{"query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 136, "total_negative": 2, "total_reviews": 138}, "reviews": {"38777055": {"recommendationid": "38777055", "author": {"steamid": "76561198008302045", "num_games_owned": 53, "num_reviews": 3, "playtime_forever": 21, "playtime_last_two_weeks": 12, "last_played": 1514462241}, "language": "english", "review": "Started the game, walking into the woods until I have to move the character to check on something. Flew off my chair cause of the jumpscare when checking the inventory, Alt + F4 comes after that. 10/10 would play again in a few weeks time.", "timestamp_created": 1514462351, "timestamp_updated": 1514462351, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38763659": {"recommendationid": "38763659", "author": {"steamid": "76561198131348759", "num_games_owned": 121, "num_reviews": 23, "playtime_forever": 363, "playtime_last_two_weeks": 0, "last_played": 1509376774}, "language": "spanish", "review": "[url=http://www.shdownloads.com.ar/2017/12/analisis-yomawari-midnight-shadows.html] Analisis Completo en SHD - Survival Horror Downloads [/url]\n\nYomawari: Midnight Shadows nos presenta a dos niñas: Yui y Haru, que se reunieron durante el anochecer para disfrutar de los fuegos artificiales de su pueblo desde un punto lejano al mismo. Una vez finalizado el espectáculo deciden volver a sus hogares por el sendero que las dirigió a ese punto, pero para su desgracia, una serie de extraños sucesos en el camino que atraviesa el bosque levanta sospechas de que no están solas y algo raro se oculta entre las sombras. La preocupación no estaba de más ni mucho menos equivocada; debido a un escalofriante encuentro sobrenatural quedan separadas a su suerte con la noche como único testigo del horror que las acosaría.\n\nMidnight Shadows es absolutamente semejante a su entrega anterior: Night Alone, por lo que muchos aspectos serán casi iguales. Comenzando con su jugabilidad, sencilla y cómoda en dosis iguales. En esta ocasión controlaremos a dos personajes de manera intercalada, cada uno con sus fortalezas y debilidades. Por lo tanto, en un principio encarnaremos a Yui, quien no cuenta con inventario o mapa, y luego tomaremos el papel de Haru, con quien pasaremos la mayor parte del juego. Con ella tendremos que hallar la manera de encontrar a Yui recorriendo escenarios inquietantemente desprovisto de cualquier otro ser más que las criaturas que rondan en la obscuridad.\n\nNuevamente tendremos la posibilidad de recoger objetos, como piedras u hojas de cuaderno, que podremos usar a nuestro favor para distraer a las entidades que encontremos y ocultarnos entre los arbustos hasta que la amenaza este lo suficientemente lejos. También encontraremos monedas para realizar ofrendas en los altares del pueblo y de esta manera salvar la partida. Cabe mencionar que Midnight Shadows introduce una serie de perks para aumentar los atributos de nuestra protagonista, como items para aumentar la energía, mayor espacio en el inventario, entre otros. \n\nVisualmente contiene una ya marcada dirección artística que destaca resaltando mucha personalidad, desde los escenarios (un tanto reciclados, eso sí) representados con calles solitarias alumbradas por algunos pocos postes de luz y las protagonistas con su aspecto chibi, hasta los siniestros enemigos y bosses que aparecerán sorpresivamente, a veces, cuando menos lo esperemos. El apartado sonoro cumple muy bien con sonidos ambientales aleatorios y bastante variados dependiendo de donde este parado nuestro personaje. Una vez más la musicalización brilla por su ausencia y se encuentra completamente en un inglés muy básico.\n\nPara ser breve y conciso, Yomawari: Midnight Shadows es más de lo mismo en cuanto a apartado técnico refiere, pero es una aventura que no pueden dejar pasar los que hayan disfrutado de Night Alone. \n\n [u] Lo Bueno:  [/u]\n- Muy buen diseño de escenarios y enemigos\n- Ambientación inquietante\n- Escenarios amplios\n- Introducción de perks\n- La historia\n\n[u] Lo Malo:  [/u]\n- Presenta pocos cambios con Night Alone\n- Pocos y simplones puzzles\n\n[h1] Puntuación Final: 8 altares hallados [/h1]", "timestamp_created": 1514429196, "timestamp_updated": 1514429196, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.563492", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38626563": {"recommendationid": "38626563", "author": {"steamid": "76561198372925156", "num_games_owned": 19, "num_reviews": 6, "playtime_forever": 1121, "playtime_last_two_weeks": 61, "last_played": 1514271142}, "language": "schinese", "review": "18.3小时全成就全收集全剧情，很开心夜廻有续作，延续了上一作的画风好评。总体难度比前作低一些，可探索区域是前作的2倍有余，很多地方都有提示。该吓到人的地方还是会吓到人hhhh，挺适合我这种胆子比较小的。[spoiler]日本一依旧在虐萝莉这件事上不肯放，啥时候给个GOODEND啊……[/spoiler]\n9/10，扣的一分是因为只靠游戏本体依旧没法把故事完整的了解orz。希望有续作！", "timestamp_created": 1514129790, "timestamp_updated": 1514129790, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38565080": {"recommendationid": "38565080", "author": {"steamid": "76561198294967815", "num_games_owned": 1337, "num_reviews": 6, "playtime_forever": 1370, "playtime_last_two_weeks": 0, "last_played": 1512141595}, "language": "schinese", "review": "本款游戏是Yomawari系列的第二作，前作为前作为[url=http://store.steampowered.com/app/477870/Yomawari_Night_Alone/]Yomawari: Night Alone[/url]，这次带来了两个小女孩之前的友(ai)情（qing）故事。\n\n大致情节：\n[quote]  游戏的主人公是两个小女孩Yui（小唯）和Haru（小遥），以及神犬chaco（茶子）。\n  小遥在不久之后就要搬家，离开小镇，但是小遥本身不想离开小镇，想和小唯在一起。\n  小唯的另一只小狗Kuro死了，在山顶埋葬完小狗之后由玩家操作，进行了新手教程，结束序章。\n  在结束新手教程以后，小唯的好朋友小遥来到家门口与小唯一起去山顶看烟花。在下山的路上，小唯拿着手电去探路，却不见了，随后小遥踏上了寻找小唯的路程…在搜索小镇的途中，在不同的区域遇到了各类妖怪，甚至被带到隔壁镇子，但是为了找回好朋友，要鼓起勇气面对各种奇怪的生物....\n  搜索小镇，经过了一些妖怪的统治区域之后，终于...小唯和小遥终于找到了彼此，却发现事情并没有那么简单…[/quote]\n[spoiler]等我通关以后，写测评整理截图的时候，才发现其实大boss在第一章就出现了...[/spoiler]\n\n优点：\n[list]\n[*]+萌萌的画风\n[*]+剧情比上一作明朗，虽然仍不确定在游戏故事发生前两位女主经历了什么\n[*]+画面提升，作画和场景等等都看着舒服了不少\n[*]+存档机制优化，上作出门在某地存档，然后退出游戏会失去进度，本作不会\n[*]+细节赞，例如：不同场景下的脚步声区别很明显\n[*]+情怀给的很足，成就、场景、怪物方方面面，甚至还有熟悉的前作女主[spoiler]和新手教程[/spoiler]\n[*]+游戏内容增加，主要是一下几点：\n[olist]\n\t[*]新增了几处室内场景（室内没有地图）\n\t[*]可探索区域增加，可以探索两个小镇\n\t[*]更长的流程，主线支线都比前作流程长[/olist]\n[/list]\n\n缺点：\n[list]\n[*]-游戏宣传的两视角游玩，个人觉得更多的只是噱头\n[*]-前作小镇虽然探索区域很大，但是一些前作可以去的地方，本作不能去。相比发售前的宣传较失望\n[*]-装备系统很鸡肋，通关之前只能拿一半装备，二周目收集装备作用不大\n[*]-游戏流程、收集物品增加,相对应的是较繁琐的全收集过程\n[*]-恐怖氛围一般，初期游玩还挺害怕，玩到后期就...看到怪很开心地一键回城（心疼Haru..）\n[*]-OST只有一首，一招鲜打遍天....\n[/list]\n总体来说，比前作优秀很多，但是没有前作的游戏经验，玩起来总会觉得缺少些什么。\n\n语言上面，PS平台有中文，字体也和日语英语版一样好看；PC由于中文制作是为了主机版，steam没有中文，但是英语很简单，四级水平基本没有问题。\n价格上面，PS300+，PC80腿上下，对于内容来说，不亏，不过还是可以等更低的折扣。\n\n由于系列作品的原因，深夜廻有部分主线支线都与上作有联系，如果对本款游戏有兴趣，建议等促销两款游戏一起购买，或者找视频补夜迴的剧情。\n\n本次测评参与了stcn组鉴赏的活动，感兴趣可以关注我们的[url=http://store.steampowered.com/curator/255962-STCN/?appid=625980]鉴赏家[/url]。\n\n[url=https://steamcn.com/forum.php?mod=viewthread&tid=325304&page=1#pid5128869]完整测评请前往STCN[/url]\n\n年末补测评计划（1/N）\n\t\t--17.12.23", "timestamp_created": 1514013367, "timestamp_updated": 1514013535, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "38249323": {"recommendationid": "38249323", "author": {"steamid": "76561198263855295", "num_games_owned": 46, "num_reviews": 5, "playtime_forever": 667, "playtime_last_two_weeks": 40, "last_played": 1513640792}, "language": "spanish", "review": "Que puedo decir, siendo fan de su primer juego Yomawari Nigth Alone, Nippon Ichi Software se supera en esta nueva entrega y secuela directa de Yomawari, si bien Yomawari Midnight Shadows no innova demasiado en su gameplay, bien logra agregar mecánicas simples, que le dan un toque de variación a este, puliendo su jugabilidad con nuevas mecánicas. De igual manera que su entrega anterior, el juego sufre de ser demasiado lineal, ademas de tener puzzles relativamente \"sensillos\", aun así esto no es un factor muy critico a la hora de jugar.\nLa historia no sera diferente de su primera entrega, siendo un tanto deprimente y obscura, ya que nos tendrá siempre con la incertidumbre de saber más y más sobre los acontecimientos que rodean a yui y haru, nuestras protagonistas, y como siempre, dándonos una libre exploración del mapa para así poder descubrir todos los coleccionables del juego, que al igual que el primero, no serán pocos, dándole ademas el factor de rejugabilidad, claro si es que te gusta encontrar todos los secretos que estos juegos tienen.\nPara terminar, creo que vale mucho la pena este juego, ya que nos demuestra que no siempre en todos los videojuegos hay finales felices y sobre todo, nos recuerda que en las calles, en la obscuridad, siempre habrá \"alguien o \"algo\" que siempre estará observando, en las sombras de la media noche.", "timestamp_created": 1513052678, "timestamp_updated": 1513052678, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38128767": {"recommendationid": "38128767", "author": {"steamid": "76561198060628914", "num_games_owned": 433, "num_reviews": 122, "playtime_forever": 882, "playtime_last_two_weeks": 0, "last_played": 1512650284}, "language": "japanese", "review": "『深夜廻』\n日本一ソフトウェア製作の探索型ホラーゲーム[url=store.steampowered.com/app/477870/Yomawari_Night_Alone/][u]『夜廻』[/u][/url]の続編に当たる作品。\n完全日本語モードあり。\n基本システムは前作とほぼ同様なので、[url=steamcommunity.com/profiles/76561198060628914/recommended/477870/][u]前作のレビュー[/u][/url]も参照のこと。\n\n前作同様、怪異が蠢く夜の街を幼女が探索するゲーム。\nゲーム内容もほぼ一緒だが、前作で非常に多かった初見殺しはだいぶ減ったように感じる。\nただボス戦は相変わらず理不尽。\n攻略法のヒントが少ないため死にながら模索していくしかない上、\nやり直す度にイベントが入るため正直ストレス。\n\nマップは前作よりもかなり広くなり、屋内マップも新たに登場。\n廃屋、図書館、地下水路等のホラゲ定番スポットも探索出来るようになった。\n\nストーリーは色々説明不足だった前作に比べると非常に良い。\n冒頭ではぐれてしまう2人の主人公「ハル」と「ユイ」が互いを強く想いながらもすれ違い、\nさらには悲しい現実を突きつけられ、そして最後は…\nもう中盤以降は涙腺緩みっぱなしでした。切ない。\n\nやはり今作も前作同様、雰囲気を楽しむゲーム。\n前作が好きだった人にはオススメですが、それ程ボリュームがあるわけでもないので、かなり割高感あるかも…\nセールを狙うかバンドルで買うのが良いかもしれません。", "timestamp_created": 1512653562, "timestamp_updated": 1512653562, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.560000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38099559": {"recommendationid": "38099559", "author": {"steamid": "76561198163473080", "num_games_owned": 68, "num_reviews": 2, "playtime_forever": 577, "playtime_last_two_weeks": 0, "last_played": 1512984339}, "language": "schinese", "review": "打完新手导引就想报警了。。。\n初期被各种忽然窜出的拦路鬼吓到扔键盘，完美sync了游戏里鬼怪接近时的砰砰心跳声。。打过几章熟悉套路后，恐怖感下降了很多，虽然还是猝不及防被恶意支线吓到[spoiler]说了they are gone从草丛里出来还给个鬼脸是几个意思？？？[/spoiler] 有评论觉得后期有些力度不足，其实我觉得配合提升的游戏难度和逐渐显露的主线剧情，紧张度仍然是合适的。。\n故事主线很清晰，2个小萝莉的友谊很真挚感人 [spoiler]友谊是真的，不想一个人死去的恐惧也是真的，从yui的绷带和笔记中隐约能猜到这是个家庭很不幸的小萝莉，人生的艰难催生的恐惧消极和恶意，强大到能让神祇变成鬼怪，让好友变成索命怨灵。到了分离的时候，有再多不舍，生者还是要斩断与死者的缘线，面对也许仍然充满艰辛的未来，life is very scary，结局也还算是正统光明的吧 [/spoiler]\n主线之外的地图还蛮大，收集元素很多，通关后还是可以继续探索 【然而谁能告诉我为什么小萝莉非要大半夜探索？担惊受怕的是屏幕前的手残阿姨好吗！\n游戏里的道具感觉有一点废，小石子之类扔起来不好控制，大部分关卡控好体力槽走位都能过关，打到通关都没用几个道具。。", "timestamp_created": 1512555637, "timestamp_updated": 1512556167, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38083285": {"recommendationid": "38083285", "author": {"steamid": "76561198205760345", "num_games_owned": 28, "num_reviews": 4, "playtime_forever": 644, "playtime_last_two_weeks": 0, "last_played": 1511887426}, "language": "schinese", "review": "被整部游戏唯一的一首BGM炸出泪", "timestamp_created": 1512490999, "timestamp_updated": 1512490999, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38039643": {"recommendationid": "38039643", "author": {"steamid": "76561198347862992", "num_games_owned": 35, "num_reviews": 2, "playtime_forever": 578, "playtime_last_two_weeks": 0, "last_played": 1512323085}, "language": "english", "review": "A game you will loop its theme song over and over again, after you finished the story.", "timestamp_created": 1512324354, "timestamp_updated": 1512324354, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38005305": {"recommendationid": "38005305", "author": {"steamid": "76561198381184677", "num_games_owned": 8, "num_reviews": 3, "playtime_forever": 853, "playtime_last_two_weeks": 0, "last_played": 1513178941}, "language": "schinese", "review": "地图不能通用，在操作角色切换的时候就很麻烦（虽然地图不是很大）。剧情非常感人，看到最后那篇日记时哭死。", "timestamp_created": 1512225339, "timestamp_updated": 1512225339, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38004117": {"recommendationid": "38004117", "author": {"steamid": "76561198209611219", "num_games_owned": 447, "num_reviews": 24, "playtime_forever": 324, "playtime_last_two_weeks": 0, "last_played": 1512211952}, "language": "schinese", "review": "欢迎收听午夜电台  下面由一先生送上一曲陈晓东的 孤单的夜里我不孤单", "timestamp_created": 1512222549, "timestamp_updated": 1512222549, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37990948": {"recommendationid": "37990948", "author": {"steamid": "76561198010090636", "num_games_owned": 427, "num_reviews": 18, "playtime_forever": 948, "playtime_last_two_weeks": 0, "last_played": 1512176941}, "language": "english", "review": "Unlike many other reviewers on Steam say, Yomawari 2 doesn't fix all the problems introduced in the predecessor. The game still has enough cheap deaths (middle finger to the Manor chapter), and you still barely use its mechanics like an ability to bait enemies, preferring to run away from them in 99.9% of the times. Yet again the developers focus way too much on a chase aspect of the game, instead of coming up with clever puzzles. But even then... the game is definitely a major improvement over the first one. In the first Yomawari its story was nothing but a garnish for the exploring aspect. In the sequel I found myself way more invested in its story events, even if it's laconic and basic as ever. The town is filled to the brim with urban legends and collectibles waiting to be uncovered, some of which are basically full-fledged side-quests. If Yomawari becomes a series it has a bright future ahead of it for sure.", "timestamp_created": 1512179636, "timestamp_updated": 1513444036, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.612676", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37878722": {"recommendationid": "37878722", "author": {"steamid": "76561198014364635", "num_games_owned": 271, "num_reviews": 14, "playtime_forever": 872, "playtime_last_two_weeks": 0, "last_played": 1511360084}, "language": "japanese", "review": "2D見下ろし視点のホラーゲーム、シリーズ2作目です。\n前作の「夜廻」から、要素がいくつか追加されています。\nストーリークリアまでのボリュームは10時間前後でしょうか。\nコレクションアイテムをコンプリートするなら、攻略サイトなどの情報なしだと15時間以上かかると思います。\n\nできるだけ、ストーリーのネタバレは控えて書きますね。\n\n懐中電灯を頼りに、お化けだらけの夜の街を彷徨い歩くゲームです。\n石や塩と言った消耗アイテムを投げて、お化けの気をひいて、難を逃れましょう。\n銃や刃物のような武器は存在せず、お化けと戦って倒していくゲームではありません。\n\nここまでは前作と同じ、以下は前作との違いを。\n\n今作の主人公は2人居て、シーンによって主人公が入れ替わって進みます。\n前作は居なくなった愛犬を探しに、今作でははぐれた親友を探しに、夜の街を彷徨います。\n前作ではどの建物にも入る事が出来ず、夜の町中を彷徨い歩くだけで、屋内があるのは自宅だけでした。\nここが個人的に前作での不満だったのですが、今作ではいくつかの建物に、屋内パートがあります。\n今作では手に入れたお守り系アイテムを装備でき、それによって少々ですが、恩恵を受けられます。\nマップも前作より広くなっています。\n\nストーリーも前作より深くなっており、あなたは衝撃の展開と終末を目にする事でしょう。\n\nそして、前作をプレイしてなくても楽しめますが、プレイしているとちょっと嬉しい要素もあります。\nできればプレイしておくことをオススメします。\n\n総評としては「おすすめ」ですが、唯一のネックは値段かなー・・・。\nコンシューマ版も同額（Vita版は5980円、PS4版は6980円）なので、Steam版が高いわけではないのですが・・・。\n今の時代、ドット絵のゲームを作るのは大変なので、労力（作成期間、人件費等など）に見合った金額なのでしょうが、Steamには似たようなレベルのグラフィックで、もっと安くてボリュームのあるゲームもあるので、ちょっと躊躇してしまいますね。\nただ、夜の日本の町を彷徨う2Dタイプのホラーゲーム、というコンセプトのゲームは非常に珍しく、この雰囲気と恐怖は、他のゲームには無いと思うので、その魅力を推したい所です。", "timestamp_created": 1511874419, "timestamp_updated": 1511874419, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.597070", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37865819": {"recommendationid": "37865819", "author": {"steamid": "76561198228228584", "num_games_owned": 67, "num_reviews": 4, "playtime_forever": 86, "playtime_last_two_weeks": 0, "last_played": 1512138752}, "language": "schinese", "review": "游戏已通关  steam买个支持  大概率不会再次通关了\n\n\n[spoiler]到底要选择多少次不剪断才能唤醒你 [/spoiler]\n[spoiler]到底要选择多少次不放手才能挽留你 [/spoiler]\n\n游戏最后小遥献完花走后的脚步绝对是小唯的吧   [spoiler]猛男落泪.jpg [/spoiler]", "timestamp_created": 1511862133, "timestamp_updated": 1511862180, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.572519", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37836674": {"recommendationid": "37836674", "author": {"steamid": "76561198096713277", "num_games_owned": 222, "num_reviews": 9, "playtime_forever": 232, "playtime_last_two_weeks": 0, "last_played": 1512615517}, "language": "english", "review": "A really lovely hand drawn horror game that still manages to scare me even though it's isometric. The translation is also very well done, so in short this game is worth checking out.", "timestamp_created": 1511827756, "timestamp_updated": 1511827756, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37797776": {"recommendationid": "37797776", "author": {"steamid": "76561198092570896", "num_games_owned": 379, "num_reviews": 7, "playtime_forever": 561, "playtime_last_two_weeks": 0, "last_played": 1512481076}, "language": "english", "review": "Impressive improvement compared to the first ver.\n\nAnd an upvote for the best atagonist I've ever seen.", "timestamp_created": 1511799803, "timestamp_updated": 1511799803, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37757923": {"recommendationid": "37757923", "author": {"steamid": "76561198232397892", "num_games_owned": 353, "num_reviews": 4, "playtime_forever": 5, "playtime_last_two_weeks": 0, "last_played": 1511765493}, "language": "schinese", "review": "很棒的游戏。4版已通关。steam买来支持，或许以后会刷全成就。\n该游戏对我来说恐怖感不大，但游戏中淡淡而又逐渐加强的悲伤，却使人感慨万千。\n在剧情方面，则是描写两位小萝莉的真挚友情，[spoiler]而在故事的最后选择放不放手，以及小遥在最后说“若干年后，我是否还会记得这个夏天的事”\t[/spoiler]，再加上最后ed的响起，不免，悲从中来。上述这些都使的作品有了很好的内涵有了很好的升华。[spoiler]是啊，人生在世终有一别，而过往云烟又有多少能够长存。每思至此，都不免唏嘘不已。\t[/spoiler]\nsteam版无中文，多少一些遗憾，但若会外语，则不成障碍，不会外语已有中文补丁。应该可以畅快的玩了吧。\n总体上，此亦不失为一佳作，不玩多少有些可惜，故推荐\t[strike]剁手\t[/strike]入手。\n[spoiler]最后献上一首以小遥为视角的小词，以结鄙文。\n           寿楼春 与小唯书\n观夏夜花火，\n记昔时步伐，同在高台。\n耀眼飞花碎散，却是凄寒。\n忆往日，今相隔。\n泪莫倾，独处空台。\n但看花飘散，倚栏空叹。多忆笑颜妆。\n花火尽，凉风起。\n有同行携手，相战山林。\n怎忘昔时人散，今为君伤。\n言是谎，行是实。\n恶梦消，却复相别。\n哪堪更相思，悠悠倚阶入梦中。\t[/spoiler]\n[spoiler]ps。文辞很烂，让大家见笑，恳请批评指教。\t[/spoiler]", "timestamp_created": 1511769423, "timestamp_updated": 1511769423, "voted_up": true, "votes_up": 17, "votes_funny": 2, "weighted_vote_score": "0.697282", "comment_count": "7", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37738406": {"recommendationid": "37738406", "author": {"steamid": "76561197994666064", "num_games_owned": 2639, "num_reviews": 545, "playtime_forever": 745, "playtime_last_two_weeks": 0, "last_played": 1511744718}, "language": "brazilian", "review": "Fabuloso pra caramba, um jogo curtinho porém super atmosférico que lembra o clima de alguns animes muito bizarros cheio de gore. Aqui você controla duas garotinhas que por algum motivo começam a ver seres bizarros, a história é apresentada em forma de capítulos variando entre uma e outra, a maioria dos espíritos você só pode ver quando os ilumina com a lanterna, mas quando estão próximos o coração bate sem parar, o que assusta pra caramba.", "timestamp_created": 1511747026, "timestamp_updated": 1511747026, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37702019": {"recommendationid": "37702019", "author": {"steamid": "76561198121560326", "num_games_owned": 146, "num_reviews": 5, "playtime_forever": 742, "playtime_last_two_weeks": 0, "last_played": 1511716505}, "language": "thai", "review": "ความกดดัน เวลาหัวใจเต้นรัว ๆ ทำให้เรากดดันซึ่งบางทีก็ไม่มีอะไร\nบรรยากาศ เดินในเมืองท่ามกลางความมืดกับไฟฉายหนึ่งกระบอก\nความสนุก ในด้านเนื้อเรื่อง เนื้อเรื่องรอง การเก็บไอเทม เดินหยอดเหรียญ 10 เยนวนทั่วเมือง และแม้แต่การวิ่งหนีวิญญาณ\nฉาก jumpscare ที่ไม่ได้ออกมาเปลืองจนหายตกใจเหมือนเกม Horror บางเกม\n\n", "timestamp_created": 1511720406, "timestamp_updated": 1511720406, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37670399": {"recommendationid": "37670399", "author": {"steamid": "76561198079425982", "num_games_owned": 235, "num_reviews": 2, "playtime_forever": 49, "playtime_last_two_weeks": 0, "last_played": 1511302429}, "language": "french", "review": "Une superbe expérience, une atmosphère prenante et de sacrées surprises.", "timestamp_created": 1511703897, "timestamp_updated": 1511703897, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37670076": {"recommendationid": "37670076", "author": {"steamid": "76561198063217844", "num_games_owned": 417, "num_reviews": 7, "playtime_forever": 902, "playtime_last_two_weeks": 0, "last_played": 1510402584}, "language": "english", "review": "Great Game For Exercise Your Heart\nAnd also good story", "timestamp_created": 1511703724, "timestamp_updated": 1511703724, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.445860", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37631813": {"recommendationid": "37631813", "author": {"steamid": "76561198028816735", "num_games_owned": 120, "num_reviews": 2, "playtime_forever": 10, "playtime_last_two_weeks": 0, "last_played": 1511681656}, "language": "schinese", "review": "这一代比上一代在剧情方面更好了，吓人可惜还是这个套路，通关后的情怀支线还是有点意思的。\n比较可惜没有带主机版的汉化，民间汉化的质量特别是字体确实和官方的差距有点大，在主机上玩完回来G胖这里喜+1一份表示支持", "timestamp_created": 1511681974, "timestamp_updated": 1511681974, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37597970": {"recommendationid": "37597970", "author": {"steamid": "76561197962064956", "num_games_owned": 352, "num_reviews": 20, "playtime_forever": 1279, "playtime_last_two_weeks": 0, "last_played": 1512162883}, "language": "english", "review": "Yomawari Midnight Shadows improves on its predecessor without breaking the mold. You are playing as a little girl wandering in a Japanese town at night, while ghosts are roaming around, and there is a dog involved once more. This could feel like \"more of the same\", but the game adds enough little things that it's a significant step up from the first game:\n- Outside of a specific area (and for good reasons), all of the ghosts are brand new, which means new strategies to figure out to survive\n- You now have two protagonists instead of one, and even if they both play exactly the same, that gotta count for something, right?\n- You can now enter some buildings, which makes for more variety in the environments you explore\n- The game is bigger than the first one, and it's a brand new town for you to explore\n- More bosses!\n- And last but not least, more twists that will leave your soul scarred!\n\nIf you liked Yomawari Night Alone, you are sure to love this one. And even if you did not, you will probably enjoy it if you enjoy things such as a nice blend of horror and cuteness, when your heart bleeds, ghosts, quiet little towns, scissors, and trying to run away as fast as your little girl's feet can carry you.\n\nI recommend playing Yomawari Night Alone before playing this game if you did not already.", "timestamp_created": 1511653614, "timestamp_updated": 1511653778, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "37528784": {"recommendationid": "37528784", "author": {"steamid": "76561198005919861", "num_games_owned": 255, "num_reviews": 2, "playtime_forever": 695, "playtime_last_two_weeks": 0, "last_played": 1509452598}, "language": "tchinese", "review": "劇情:★★★★★☆\n音效:★★★☆☆\n畫面:★★★☆☆\n================\n前回より怖い...あと悲しい！", "timestamp_created": 1511618765, "timestamp_updated": 1511618765, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37527569": {"recommendationid": "37527569", "author": {"steamid": "76561198103987644", "num_games_owned": 152, "num_reviews": 7, "playtime_forever": 1034, "playtime_last_two_weeks": 0, "last_played": 1511974595}, "language": "schinese", "review": "很不错的一款游戏，与初代相比有很大进步，尤其不会像初代那样疯狂闪退了。[spoiler]听说结局比较虐[/spoiler]目前还没通关，如果能有官方中文就更棒了！", "timestamp_created": 1511618284, "timestamp_updated": 1511618362, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37468456": {"recommendationid": "37468456", "author": {"steamid": "76561198081418912", "num_games_owned": 20, "num_reviews": 3, "playtime_forever": 80, "playtime_last_two_weeks": 0, "last_played": 1511599039}, "language": "schinese", "review": "最好会日语，不会日语得会英语，不会英语至少得会下个中文补丁\n但是不管会不会，这么可爱的主角，这么有意思的创意不来玩玩么？！", "timestamp_created": 1511589615, "timestamp_updated": 1511589615, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37312732": {"recommendationid": "37312732", "author": {"steamid": "76561198046777260", "num_games_owned": 26, "num_reviews": 2, "playtime_forever": 843, "playtime_last_two_weeks": 0, "last_played": 1511965344}, "language": "schinese", "review": "通关之后带着小狗在夜晚的街上闲逛找（捡）收（垃）集（圾）还是挺惬意的hhh", "timestamp_created": 1511522862, "timestamp_updated": 1511522862, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37311591": {"recommendationid": "37311591", "author": {"steamid": "76561198182315795", "num_games_owned": 47, "num_reviews": 10, "playtime_forever": 457, "playtime_last_two_weeks": 0, "last_played": 1511166291}, "language": "english", "review": "if you loved the first one you'll definetly love this one. way more spirits and side quest then the last and the story is very mezmerizing. i'd recommend it.", "timestamp_created": 1511522417, "timestamp_updated": 1511522417, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37277072": {"recommendationid": "37277072", "author": {"steamid": "76561198021551684", "num_games_owned": 41, "num_reviews": 1, "playtime_forever": 604, "playtime_last_two_weeks": 0, "last_played": 1512292184}, "language": "japanese", "review": "good", "timestamp_created": 1511505835, "timestamp_updated": 1511505835, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.470588", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37266321": {"recommendationid": "37266321", "author": {"steamid": "76561198052994602", "num_games_owned": 183, "num_reviews": 2, "playtime_forever": 186, "playtime_last_two_weeks": 0, "last_played": 1512100935}, "language": "english", "review": "A Cutesy Horror game where the stress is high and the breaks are short\nA definite must for those who enjoy exploring maps with dangers around every corner", "timestamp_created": 1511499904, "timestamp_updated": 1511499904, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37064281": {"recommendationid": "37064281", "author": {"steamid": "76561198182195637", "num_games_owned": 45, "num_reviews": 1, "playtime_forever": 55, "playtime_last_two_weeks": 0, "last_played": 1511444118}, "language": "schinese", "review": "边练习日语边玩美滋滋", "timestamp_created": 1511443994, "timestamp_updated": 1511443994, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36984307": {"recommendationid": "36984307", "author": {"steamid": "76561198194965722", "num_games_owned": 330, "num_reviews": 2, "playtime_forever": 428, "playtime_last_two_weeks": 55, "last_played": 1514613619}, "language": "schinese", "review": "真的很好玩可惜steam没繁中ε=(´ο｀*)))唉", "timestamp_created": 1511426671, "timestamp_updated": 1511426671, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36973217": {"recommendationid": "36973217", "author": {"steamid": "76561197960686364", "num_games_owned": 311, "num_reviews": 18, "playtime_forever": 58, "playtime_last_two_weeks": 0, "last_played": 1508474522}, "language": "english", "review": "Got to test this out for the PC and I found it very fun to play while in the dark. Played the first Yomawari on PS Vita and got hooked!", "timestamp_created": 1511423492, "timestamp_updated": 1511423492, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36952432": {"recommendationid": "36952432", "author": {"steamid": "76561198089709560", "num_games_owned": 59, "num_reviews": 3, "playtime_forever": 1666, "playtime_last_two_weeks": 0, "last_played": 1511902038}, "language": "english", "review": "I loooove this game. I really liked the first one but I am so glad they tried to improve upon it instead of keeping the same old formula. That's not to say there isn't elements from the first game in the second one (there's a lot), but they were able to expand/improve upon it in creative ways. \nThe style of the game is beautiful and there is so much to do. As I'm sure someone already mentioned, it is a bit darker than the previous game so there's a bit of warning there. I will admit the game is pricey for the amount of time it took me to finish the main game (and I took my sweet time) but I got my copy while it was on sale, so I'm pretty happy with it. I strongly recommend it to those who enjoyed the first game, those who like decent atmospheric horror games, or if you're just looking for a good scare and the game is on sale.", "timestamp_created": 1511417313, "timestamp_updated": 1511417313, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36948225": {"recommendationid": "36948225", "author": {"steamid": "76561198393970017", "num_games_owned": 55, "num_reviews": 1, "playtime_forever": 62, "playtime_last_two_weeks": 0, "last_played": 1511414651}, "language": "english", "review": "It's such a sad story that i wanna fuck the scriptwriter (of course, it's just kidding). But, even so, it's a good game. Have a good time!:)", "timestamp_created": 1511416080, "timestamp_updated": 1511416080, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36947898": {"recommendationid": "36947898", "author": {"steamid": "76561198119787425", "num_games_owned": 472, "num_reviews": 4, "playtime_forever": 966, "playtime_last_two_weeks": 0, "last_played": 1511429473}, "language": "schinese", "review": "终于通关了，被狠狠地致郁了一下。心疼小萝莉，似乎比一代主角更惨了。\n结局真是出乎意料呢，充分地告诉我们每一个新手教程都要认真对待。\n这一作剧情丰富了许多，支线也多了几个，二周目还有彩蛋哦。", "timestamp_created": 1511415998, "timestamp_updated": 1511415998, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36935294": {"recommendationid": "36935294", "author": {"steamid": "76561198019453569", "num_games_owned": 260, "num_reviews": 3, "playtime_forever": 931, "playtime_last_two_weeks": 0, "last_played": 1509893645}, "language": "japanese", "review": "前作から数年後の隣町が舞台\n今回はプレイキャラが二人だったので使用キャラを切り替えつつパズル的な要素もあるのかと思いきや別段そういう事もなく\nストーリー上視点が切り替わるだけだったので前とプレイ感覚は変わらずウザい敵も減っててサクサク進める事が出来てストレスは少なくなってます\n\nストーリーや演出は前作よりパワーアップしているのでネタバレせずにプレイする事をお勧めします\n\n\n唯一の不満点は今回の元凶をミンチに出来ない事です\n糞っ！なんでこの町にはAKもグレネードも落ちてねえんだ！\n", "timestamp_created": 1511412718, "timestamp_updated": 1511412718, "voted_up": true, "votes_up": 11, "votes_funny": 9, "weighted_vote_score": "0.627119", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36927887": {"recommendationid": "36927887", "author": {"steamid": "76561198264359608", "num_games_owned": 57, "num_reviews": 3, "playtime_forever": 110, "playtime_last_two_weeks": 0, "last_played": 1511236677}, "language": "schinese", "review": "咚咚~~~~~~~咚咚~~~~~~咚咚~~~~~咚咚~~~~咚咚~~~咚咚~~咚咚~咚咚咚咚咚~~~~~~~~~     啪~", "timestamp_created": 1511410929, "timestamp_updated": 1511410929, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36914777": {"recommendationid": "36914777", "author": {"steamid": "76561198369794571", "num_games_owned": 46, "num_reviews": 7, "playtime_forever": 307, "playtime_last_two_weeks": 0, "last_played": 1511940052}, "language": "schinese", "review": "虽然画风软萌可爱，但是高能还是非常的凶", "timestamp_created": 1511407445, "timestamp_updated": 1511407445, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36838981": {"recommendationid": "36838981", "author": {"steamid": "76561198024400312", "num_games_owned": 354, "num_reviews": 34, "playtime_forever": 473, "playtime_last_two_weeks": 0, "last_played": 1510131351}, "language": "english", "review": ":^(", "timestamp_created": 1511390033, "timestamp_updated": 1511390033, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.478261", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36720885": {"recommendationid": "36720885", "author": {"steamid": "76561198011031064", "num_games_owned": 780, "num_reviews": 13, "playtime_forever": 566, "playtime_last_two_weeks": 0, "last_played": 1509418833}, "language": "english", "review": "A great follow up to the original Yomawari. This game improves on a lot of the issues I had with the original and adds more to the experience.", "timestamp_created": 1511376041, "timestamp_updated": 1511376041, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.582256", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36717064": {"recommendationid": "36717064", "author": {"steamid": "76561198315511147", "num_games_owned": 12, "num_reviews": 1, "playtime_forever": 1558, "playtime_last_two_weeks": 181, "last_played": 1514709743}, "language": "schinese", "review": "结局非常的出乎意料，剧情也很不错，就是感觉后来主角和一代妹子两个残疾人在一起说话有点扎心……", "timestamp_created": 1511375645, "timestamp_updated": 1511375645, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36712887": {"recommendationid": "36712887", "author": {"steamid": "76561198250073110", "num_games_owned": 20, "num_reviews": 6, "playtime_forever": 407, "playtime_last_two_weeks": 0, "last_played": 1511798365}, "language": "english", "review": "I can't express enough of how much an awesome game this is. I was totally immersed in it's world and I was emotionally attached with the characters as well. Despite its cute graphics, there were still moments that I was terrified to play it alone. There were a lot of jumpscares compared with its previous game, and even though I really love Yomawari First Night Alone, this one is really a great improvement of it. Has bigger maps, has visually improved graphics, soundtracks and sound effects are far more grimmer than the old one, there are actually 2 endings (it depends on your choices almost at the end of the game - though I can say the other ending was pretty obvious that it shouldn't have ended that way, oh just play it and you'll know what I mean) and my mind and heart can't get over with its true ending as well. There were so many emotions I felt at the end of it. I was overwhelmed, hence making my entire experience of the game REALLY AWESOME. Do buy and try it. I'm hoping the developers will make another sequel. \n\nMy only concern with the game was the game length. Honestly it was too short. I didn't do any side quests, I just followed the main story right away, but even so, it felt too short. I wish it could've been longer.  Other than that, still an awesome game.", "timestamp_created": 1511375205, "timestamp_updated": 1511375205, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36706503": {"recommendationid": "36706503", "author": {"steamid": "76561198136930948", "num_games_owned": 503, "num_reviews": 24, "playtime_forever": 1736, "playtime_last_two_weeks": 0, "last_played": 1511374382}, "language": "english", "review": "A great improvement from the previous version.", "timestamp_created": 1511374419, "timestamp_updated": 1511374419, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36695939": {"recommendationid": "36695939", "author": {"steamid": "76561198343986733", "num_games_owned": 11, "num_reviews": 3, "playtime_forever": 601, "playtime_last_two_weeks": 0, "last_played": 1509882824}, "language": "tchinese", "review": "很喜欢的恐怖虐心游戏，到中盘的真相很耐人寻味，有些细节来龙去脉还是要靠玩家自己思考。", "timestamp_created": 1511352916, "timestamp_updated": 1511352916, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36693075": {"recommendationid": "36693075", "author": {"steamid": "76561198047372888", "num_games_owned": 105, "num_reviews": 5, "playtime_forever": 684, "playtime_last_two_weeks": 0, "last_played": 1511336191}, "language": "english", "review": "This is a spooky game with cute protagonists. The visuals are fantastic and the gameplay mechanics are well explored. It's a good game for that annual Halloweeny feel.", "timestamp_created": 1511343750, "timestamp_updated": 1511343750, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36639274": {"recommendationid": "36639274", "author": {"steamid": "76561198265217381", "num_games_owned": 38, "num_reviews": 1, "playtime_forever": 630, "playtime_last_two_weeks": 15, "last_played": 1514079926}, "language": "schinese", "review": "这个游戏要说恐怖的话。。。大概通关听完bgm后发现自己抑郁了才是最恐怖的点。。。（还煞有介事地上网查了查抑郁症简直没救）搞得现在都不敢听纯音乐，真的不愧对它88的价格。ps4买三百也许不是没有道理的（好想要特典啊可是我没有ps4啊）", "timestamp_created": 1511154107, "timestamp_updated": 1511154107, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36638761": {"recommendationid": "36638761", "author": {"steamid": "76561198396864140", "num_games_owned": 10, "num_reviews": 1, "playtime_forever": 648, "playtime_last_two_weeks": 52, "last_played": 1514106590}, "language": "schinese", "review": "希望出官方中文", "timestamp_created": 1511151598, "timestamp_updated": 1511151598, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36626527": {"recommendationid": "36626527", "author": {"steamid": "76561198319837946", "num_games_owned": 34, "num_reviews": 2, "playtime_forever": 106, "playtime_last_two_weeks": 0, "last_played": 1511364822}, "language": "schinese", "review": "不错的游戏  \n", "timestamp_created": 1511106771, "timestamp_updated": 1511106771, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36622915": {"recommendationid": "36622915", "author": {"steamid": "76561198132015832", "num_games_owned": 77, "num_reviews": 3, "playtime_forever": 12, "playtime_last_two_weeks": 0, "last_played": 1511095229}, "language": "schinese", "review": "续作的剧情比前作的更饱满   虽然结局依旧是致郁   有点方面还有些许不足但瑕不掩瑜    总体游戏可以给8分以上  其他两分是我们需要汉化", "timestamp_created": 1511097497, "timestamp_updated": 1511097497, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36621767": {"recommendationid": "36621767", "author": {"steamid": "76561198200637371", "num_games_owned": 27, "num_reviews": 6, "playtime_forever": 372, "playtime_last_two_weeks": 1, "last_played": 1514722382}, "language": "schinese", "review": "首先是看到了 warama的微博上 看到有关于这款游戏的，于是我就瞬间就喜欢上这款游戏 哈哈 人物挺可爱的（有爱??） 地图和整体画风都不错 这款游戏对于  刚开始接触的新人会有点恐怖 但是时间久了 就没感觉了(因为你熟悉了 游戏怪物的AI机制之后就基本上“熟能生巧”了 所以没什么好怕的，但是这款游戏嘛 还是会比较偏小众向的 属于冷门类 但是：我觉得嘛 还是挺不错的 就向我前面说的 这是款在我看来很棒的游戏 (最主要是人设可爱 哈哈）恐怖元素也还行 感觉上比较独特（至少在我看来）\n评分：7.8/10 \n+ 人物可爱\n+ 不错的画风\n+ 游戏剧情上还在探索中之后会补充\n+ 意想不到的创意 以及 给你意想不到到的恐怖？\n- 重复的套路 由于到后期你基本上熟悉了规律之后就没什么好怕了\n总评：推荐 很不错的游戏", "timestamp_created": 1511094226, "timestamp_updated": 1511094226, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36614134": {"recommendationid": "36614134", "author": {"steamid": "76561198331784232", "num_games_owned": 25, "num_reviews": 10, "playtime_forever": 719, "playtime_last_two_weeks": 0, "last_played": 1511788157}, "language": "koreana", "review": "일단 처음 플레이하면서 느낀점이 그냥 ps4의 게임 ui를 그대로 배껴온것 같다라는 느낌이였습니다.\n뭐 그건그것이고 게임은 재밌습니다.\n영어 조금만 할 줄알면 쉽게 해석이 가능했고적절한 깜놀요소 그리고 세이브에 필요한 코인이라는 아이템을 자주 줘서 어느정도 난이도를 줄여줍니다.\n\n스토리는 이렇습니다. 하루와 유이는 불꽃놀이를 보러 산위로 올라갑니다.그후 유이는 갑작스럽게 실종되어지고 하루는 유이를 찾을 밤늦게 마을을 돌아다닙니다.그렇게 어렵게 만난 두사람 하지만 이미 유이는 이세상사람이 아니였고........(뒷내용 직접해보세요)\n\n추신 사운드트랙에 main them 한곡만있습니다. 어떤 노래냐면 소개영상?에 삽입된 노래입니다.", "timestamp_created": 1511067673, "timestamp_updated": 1511773449, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.437956", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36611220": {"recommendationid": "36611220", "author": {"steamid": "76561198043978087", "num_games_owned": 764, "num_reviews": 13, "playtime_forever": 4610, "playtime_last_two_weeks": 0, "last_played": 1509091169}, "language": "english", "review": "Similar to the first Yomawari game, Yomawari Midnight Shadows does use the same game mechanics as in the first one; outwitting enemies by hiding or outrunning them. The difficulty isn't too hard, (as there's only one setting, same as the last game) but you'll quickly learn how to deal with tough situations by exploring which is the main focus of the game anyways. The overall art is pretty great. You are playing through a town that's at night and so you will experience what urban Japan is like, through as much as you can through a game anyways. Gameplay-wise, it'll be a long journey that's mostly due to the amount of exploring you'll be doing, roughly maybe over 10 hours easily, though I like to explore every nook and cranny so it would be most likely under that time if you just want to enjoy the story. As for exploration, the area is much bigger than Yomawari Night Alone and there are numerous points in the game where it will make players reminiscence about the old one, though I wouldn't say it's mandatory to play the first Yomawari, you will miss out on things that only players who played the first game will get so I'd still advise going back the first one if you haven't done so already.\n\n[b]I'd also like to point out there are no loud screamers or whatnot in this game if that's bothering your mind. I know how much that affects certain people so there it is.[/b]\n", "timestamp_created": 1511055689, "timestamp_updated": 1511055689, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.565463", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36602252": {"recommendationid": "36602252", "author": {"steamid": "76561198103869478", "num_games_owned": 58, "num_reviews": 1, "playtime_forever": 871, "playtime_last_two_weeks": 0, "last_played": 1512066649}, "language": "schinese", "review": "本来想全收集后在评价，结果提前集齐拼图地图全开后根本不记得哪没去了，建议大家留个拼图别捡，对攻略的当我没说。\n估计不会有下一作了，毕竟套路已经摸清了[spoiler] 没错！新手引导 黑手就是你！两部都TM是你！要有下一作，打死我也不按引导说的做[/spoiler]\n通关需要点代价这事也成标志了，[spoiler] 遇见前作女主=残疾人士聚会 关键还TM搭个妹子进去[/spoiler]\n总体来说比前作强很多，硬伤基本都改了\n剧情完整了，道具有用了，见面杀没有了，任务多了，难度变低了\n二周目时我想起个页游广告 [spoiler] 开局一人一狗，装备全靠捡 [/spoiler]", "timestamp_created": 1511025311, "timestamp_updated": 1511025311, "voted_up": true, "votes_up": 5, "votes_funny": 2, "weighted_vote_score": "0.583333", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36593855": {"recommendationid": "36593855", "author": {"steamid": "76561198319900326", "num_games_owned": 47, "num_reviews": 19, "playtime_forever": 85, "playtime_last_two_weeks": 0, "last_played": 1511892217}, "language": "schinese", "review": "深夜廻完全汉化下载：\n链接: https://pan.baidu.com/s/1qY0t2De 密码: hhhh\n\n", "timestamp_created": 1511002981, "timestamp_updated": 1511002981, "voted_up": true, "votes_up": 49, "votes_funny": 5, "weighted_vote_score": "0.781841", "comment_count": "6", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36586603": {"recommendationid": "36586603", "author": {"steamid": "76561198342831833", "num_games_owned": 73, "num_reviews": 3, "playtime_forever": 22, "playtime_last_two_weeks": 0, "last_played": 1509196895}, "language": "schinese", "review": "可爱的画风，萌萌的萝莉，即使是菜单界面也惹人喜爱。\n萝莉的一举一动都触动着老夫的心弦。\n这是一款非常治愈人心的游戏……(⊙v⊙)嗯", "timestamp_created": 1510976120, "timestamp_updated": 1510976120, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36584725": {"recommendationid": "36584725", "author": {"steamid": "76561198291333785", "num_games_owned": 21, "num_reviews": 1, "playtime_forever": 138, "playtime_last_two_weeks": 0, "last_played": 1512718391}, "language": "english", "review": "This game is freaking good.  Unless you are not afraid with horror, it is a great game to get in steam!!!.\nCheck out my youtube channel to see the gameplay :)\nhttps://youtu.be/0KQVZNPBr6U", "timestamp_created": 1510968280, "timestamp_updated": 1510968280, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.469324", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36576345": {"recommendationid": "36576345", "author": {"steamid": "76561198273270561", "num_games_owned": 74, "num_reviews": 5, "playtime_forever": 442, "playtime_last_two_weeks": 40, "last_played": 1513856543}, "language": "thai", "review": "สำหรับผม ถือเกม ทำออกมาได้แบบ ตื่นเต้นดีครับบบ สนุกเหมือนเดิม ้เป็นเกมแนวเนื้อเรื่อง ที่น่าติดตามดีครับ\nผมซื้อมา 2 ภาคละ ถึงแม้ว่้า ถ้าเล่นจบจะไม่มีอะไรให้เล่นก้เถอะ แต่ขอบอกว่าเกมนี้เนื้อเรื่อง กินใจมากๆๆครับ ทั้ง 2 ภาคเลยครับบ ตื่นเต้นดีัครับบบบ >< สำหรับผม ผมให้ 10-10 เลยครับ เนื้อเรื่อง แล้ว ตัวละคร ระบบการเล่นนน พอดีๆๆกันทั้งหมดเลยครับบบ", "timestamp_created": 1510938912, "timestamp_updated": 1511578200, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36571707": {"recommendationid": "36571707", "author": {"steamid": "76561198324901345", "num_games_owned": 15, "num_reviews": 2, "playtime_forever": 914, "playtime_last_two_weeks": 0, "last_played": 1510551139}, "language": "schinese", "review": "已经全收集，成就没达成是因为当时没联网hhhh\n深夜廻估计让不少夜廻玩家感觉自己上一作似乎玩的像是深夜廻的测试版一样\n比起一代生硬和总是迟到的新手教程还是剧情上的互动，深夜廻都进行了很大的改善\n如果说有什么理由去推荐你再去玩夜廻……估计就是体验下深夜廻做的多好吧\n深夜廻没什么太大难度，pc上用360手柄感觉良好\n也很少会出现死的不明不白和上作那种追你到死的小怪\n可以说把上一作的缺点基本都弥补了\n语言方面不做什么评价，不能因为没有中文去否定什么啊~虽然是挺可惜的\nbgm（ost）依旧是只有一首ed，怎么说呢……作为一个恐怖游戏能做到没有bgm又能把气氛渲染到位，省钱又怎样hhhh\n总体来说是良心作。买买买hhhh", "timestamp_created": 1510927015, "timestamp_updated": 1510927015, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.543568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36549777": {"recommendationid": "36549777", "author": {"steamid": "76561198113141837", "num_games_owned": 33, "num_reviews": 12, "playtime_forever": 403, "playtime_last_two_weeks": 0, "last_played": 1510933492}, "language": "english", "review": "A Ghost Lolicon tries to ruin Yui and Haru's friendship", "timestamp_created": 1510834613, "timestamp_updated": 1510926070, "voted_up": true, "votes_up": 0, "votes_funny": 2, "weighted_vote_score": "0.497288", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36533127": {"recommendationid": "36533127", "author": {"steamid": "76561198377941749", "num_games_owned": 40, "num_reviews": 9, "playtime_forever": 382, "playtime_last_two_weeks": 0, "last_played": 1510757104}, "language": "schinese", "review": "不懂怎么表现温柔的我们，还以为[spoiler] 殉情[/spoiler]只是古老的传言。", "timestamp_created": 1510758489, "timestamp_updated": 1510758489, "voted_up": true, "votes_up": 18, "votes_funny": 3, "weighted_vote_score": "0.727835", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36515480": {"recommendationid": "36515480", "author": {"steamid": "76561198199142611", "num_games_owned": 140, "num_reviews": 47, "playtime_forever": 17, "playtime_last_two_weeks": 0, "last_played": 1511607536}, "language": "schinese", "review": "画风不错，推荐指数⭐⭐⭐⭐\nPS:我们需要中文\nWe need Chinese\n中国語は必要\nNous avons besoin de chinois\nWir brauchen chinesisch\nNecesitamos chino\npotrzebujemy chin\nPrecisamos de chinês\nНам нужно китайский \nเราต้องการภาษาจีน\nΧρειαζόμαστε κινέζικα", "timestamp_created": 1510680093, "timestamp_updated": 1511637075, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36427308": {"recommendationid": "36427308", "author": {"steamid": "76561198044204047", "num_games_owned": 80, "num_reviews": 7, "playtime_forever": 1238, "playtime_last_two_weeks": 0, "last_played": 1511582614}, "language": "english", "review": "The sequil to Yomawari: Night Alone. With the sequil comes much better ballance. Sprinting no longer feels broken and enemies have been ballanced out better as well. This along with the new charm mechanic makes this game a must play for fans of the previous game.", "timestamp_created": 1510347424, "timestamp_updated": 1510347424, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36403846": {"recommendationid": "36403846", "author": {"steamid": "76561198148918936", "num_games_owned": 162, "num_reviews": 5, "playtime_forever": 1191, "playtime_last_two_weeks": 0, "last_played": 1510223748}, "language": "spanish", "review": "Segundo juego  de la  serie \"Yomawari\" Y al igual que su predecesor, es un port del psp vita y es un juego de nicho!\n\nMantiene las mecanicas del primero y agrega un par mas, juego de ritmo lento, explora cada centimetro del mapa en busca de objetos coleccionables (4 paginas de ellos), nuevos \"espiritus\" en cuyas manos moriras  a cada vuelta de esquina, el tamaño del mapa es casi el doble que el del primer juego asi que tendras al menos 20 horas  de gameplay.\n\nSi te terminaste el primer juego amaras este, si no, tendras que hacerlo, pues aunque \"ligeramente\", si estan ligados!\n\nrecomendaria que compren ambos en descuento, pues aunque muy buenos, despues de encontrar todos los objetos (Y ver los sub plots), el factor de rejugabilidad se vuelve cero! y son relativamente cortos (ambos los termine completamente en 20 horas)\n", "timestamp_created": 1510256525, "timestamp_updated": 1510256525, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502900", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36384877": {"recommendationid": "36384877", "author": {"steamid": "76561198436342104", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 1200, "playtime_last_two_weeks": 0, "last_played": 1512917912}, "language": "schinese", "review": "没有中文版", "timestamp_created": 1510181104, "timestamp_updated": 1510181104, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36370672": {"recommendationid": "36370672", "author": {"steamid": "76561198103555080", "num_games_owned": 25, "num_reviews": 1, "playtime_forever": 32, "playtime_last_two_weeks": 0, "last_played": 1510109828}, "language": "schinese", "review": "买不了吃亏，买不了上当。", "timestamp_created": 1510128458, "timestamp_updated": 1510128458, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36323800": {"recommendationid": "36323800", "author": {"steamid": "76561198338501061", "num_games_owned": 322, "num_reviews": 10, "playtime_forever": 1085, "playtime_last_two_weeks": 0, "last_played": 1510731436}, "language": "schinese", "review": "主线通关达成，还没刷全成就、全收集，有空再刷吧\n简单说说游戏，画面较前作提升不少，环境氛围质量大提升，女主还是那么可爱。\n配乐依旧好评，但有些地方音效效果很差，感觉退步了？？个别场景女主的脚步声会很吵人。\n剧情上有点黑，日本一你真的够了！！\n其次主线剧情实在太短了，没什么感觉就通关了，章节boss也比前作少了好多（而且也变弱了好多）\n怕是难度最简单的一部日本一游戏了，没有感觉啊啊啊（萤火虫10分难度，这作怕是4分都没有）\n开放式地图大小是前作的2倍还要多，前作的小镇也可以探索，而且还有前作的经典小怪，大好评\n前作的boss不知道还能不能遇到，有点期待，其他支线剧情也还没通，不过看我没收集的物品感觉应该还是很有量的\n推荐给又喜欢恐怖又喜欢萌系的玩家", "timestamp_created": 1509981495, "timestamp_updated": 1510027795, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.569536", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36319755": {"recommendationid": "36319755", "author": {"steamid": "76561198103287041", "num_games_owned": 47, "num_reviews": 2, "playtime_forever": 638, "playtime_last_two_weeks": 0, "last_played": 1509970953}, "language": "schinese", "review": "+画风清新\n+剧情很棒\n-很遗憾没有中文", "timestamp_created": 1509968096, "timestamp_updated": 1509968096, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36318741": {"recommendationid": "36318741", "author": {"steamid": "76561198305921334", "num_games_owned": 26, "num_reviews": 2, "playtime_forever": 846, "playtime_last_two_weeks": 1, "last_played": 1514015299}, "language": "english", "review": "A great sequel to Night Alone\n\nPros:\n+Great Story like the first game\n+Gameplay, more mechanics\n+Improved Visuals (although there are some chipping textures)\n\nCons:\n-No more home teleport, so getting missed items will be more tedious on some levels\n-Price, still abit expensive for me for its short gameplay\n", "timestamp_created": 1509964165, "timestamp_updated": 1509964165, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.633384", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36294387": {"recommendationid": "36294387", "author": {"steamid": "76561197971678784", "num_games_owned": 278, "num_reviews": 22, "playtime_forever": 485, "playtime_last_two_weeks": 0, "last_played": 1511951630}, "language": "english", "review": "Yomawari : Night alone was a small die-and-retry horror game that was less about being cute girls encountering spooky things than it was about an innocent grade school girl coming to understand mortality and the cruelty of the world. Effective in its simplicity.\n\nMidnight Shadows is very much what might expect of a sequel - bigger, more elaborate. The town is noticeably larger, you have interior environments, and more variety in both gameplay mechanics and malevolent spirits. Night Alone had, barring a few exceptions, only one strategy against ghosts - manage your stamina to avoid them, often in the nick of time because stamina and speed was carefully calculated to be just barely enough. Midnight Shadows has a greater variety of strategies, or perhaps more accurately rules against the spirits. Don't run, avoid their gaze, turn off the lights, et caetera. You die less because you ran out of steam than because a spirit took you by surprise.\n\nThe story, too, is much more present. While Night Alone was somewhat sandbox-y, Midnight shadows has much more direction to it. More dialogue, more jump scares (which tend to be creative so I can't be too mad at them), more cutscenes. You can explore the town and encounter optional events in both, but the main story is heavier in the sequel.\n\nIn summary, I think I liked the story of Night Alone better, but Midnight Shadows is every bit a sequel that expands on the premise.", "timestamp_created": 1509878186, "timestamp_updated": 1509878186, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36276042": {"recommendationid": "36276042", "author": {"steamid": "76561198124449156", "num_games_owned": 158, "num_reviews": 41, "playtime_forever": 75, "playtime_last_two_weeks": 0, "last_played": 1509813963}, "language": "russian", "review": "Yomawari: Midnight Shadows это отличный хоррор, который не дает расслабится ни на секундочку. Уже с самого начала игры на вас начинают давить различного рода звуки, который создают впечатление, что вот из этих кустов что-то вылезет, а тут что-то появится и в таком духе на протяжении долгого времени. \n\nГемплей в данной игре очень простой. Обучение дотошно расскажет вам как все в игре устроено, причем в интерактивной форме (Что очень мне, кстати, нравится). Игра вышла довольной интересной, особенно отлично проработана система страха и бега: чем больше ты боишься тем быстрее тратится стамина. И в чем-то это действительно реально\n\nСюжет очень прекрасен и поначалу у меня возникает очень много вопросов (Может проблема в том, что я не играл в первую часть? Тогда советую приобрести и первую часть), особенно в самом начале, но по мере прохождения игры, сюжет начинает раскрываться, но делает он это очень медленно, что, кстати, все больше и больше заставляет окунутся в этот мрачный и полный неожиданных скримеров мир. С каждой секундой интерес к игре расстет все больше и больше и вот ты уже нетерпеливо сидишь, ожидая кульминации.\n\nАтмосфера в игре очень давящая и \"омерзительная\". Все эти противные, омерзительные звуки, заставляют меня постоянно играть в эту игру скукожившись. Они отвлекают игрока от различных скримеров (Иначе говоря ты концентрируешься не на то, что показано в экране, а на тот звук, который вызывает давящую и раздражающую атмосферу)\n\nСама графика погружает нас в атмосферу страха (В этой игре прямо все пропитано страхом и тревогой! Даже как-то не по себе, а еще прибавьте к этому купаж из темного времени суток и объемный звук в наушниках и вуаля! Домик в деревне вам обеспечен). Сменное белье к приобретению рекомендую.\n\nПодводя итог, хочу сказать, что данная игра вышла очень пугающей, давящей, атмосферной. Сюжет вышел довольно интересным, такой от которого бегут мурашки (Особенно пролог, где одна из героинь бросает собачку, а сама вешается. Это выглядело очень жутко). Игра не поддерживает русский язык, но это не является такой огромной помехой. Стоимость данного шедевра вполне достоина своих денег (Ну можете подождать скидку, если вы хотите удовлетворить своего внутреннего еврейчика). Ставлю 10 из 10\n\nВы можете прочитать наши мнения о других играх в группе: \nhttp://steamcommunity.com/groups/SpecialGamesClub#curation", "timestamp_created": 1509817084, "timestamp_updated": 1510596645, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.615385", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36248755": {"recommendationid": "36248755", "author": {"steamid": "76561198009564154", "num_games_owned": 2006, "num_reviews": 11, "playtime_forever": 664, "playtime_last_two_weeks": 0, "last_played": 1508612236}, "language": "english", "review": "This game may look cute with its round character design yet it is also quite dreary.\nThe atmosphere is really good, and while not usually scary, it can be very stressful...in a good way.\n\nThe story is quite interesting, the overall world design seems fitting and the gameplay elements are basic and functionnal.\nThe controls are simple and fitting, with a few interact-able items and inventory items to help you.\n\n30€ is a hefty price, so I recommend getting it on sale, though the game itself is really unique (well the series is) and merits the interest.\n", "timestamp_created": 1509733362, "timestamp_updated": 1509733362, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.507574", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36247932": {"recommendationid": "36247932", "author": {"steamid": "76561198296946126", "num_games_owned": 242, "num_reviews": 27, "playtime_forever": 59, "playtime_last_two_weeks": 0, "last_played": 1510679912}, "language": "german", "review": "cooooolll", "timestamp_created": 1509731140, "timestamp_updated": 1509731140, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36243154": {"recommendationid": "36243154", "author": {"steamid": "76561198373794156", "num_games_owned": 21, "num_reviews": 5, "playtime_forever": 925, "playtime_last_two_weeks": 0, "last_played": 1513111951}, "language": "schinese", "review": "这是一好游戏！", "timestamp_created": 1509718871, "timestamp_updated": 1509718871, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36238807": {"recommendationid": "36238807", "author": {"steamid": "76561198140761361", "num_games_owned": 77, "num_reviews": 3, "playtime_forever": 1141, "playtime_last_two_weeks": 0, "last_played": 1509514088}, "language": "english", "review": "As a fan of the first game as well as the horror genre as a whole, I feel like if you enjoy horror games that are heavily influenced by sound design, hand drawn backgrounds and characters, forign culture, tension and compelling settings scenarios and characters, I cannot reccomend this game enough, even at its current 30 dollar price point.\n\nPROS: \n- Extremely strong sound design; perhaps one of the most well done use of sound effects, silence and background noise. The sound design works so well within the games system, as well as adding to the enviornment, it's nothing short of exemplary.\n- Well designed character, sprits and environments. Every single character as well as spirits are creatively designed and expertly illustrated, as well as expertly illustrated backgrounds and enviornments, expanding the simple 2d plane of the previous game to create a more dimensional gameplay. \n- Compelling gameplay; The heartbeat system returns from the previous game, as well as the function of revealing spirts via light sources. Each design of the spirts are wonderfull, and will inspire you to look more into their backstory and creation, as well as devising methods to deal with each specfic spirt you encounter.\n- Interesting Story. The story, while simple in its premise, is very well paced, and interlaced with elements of exploration and discovery, and leads to a satisfying conclusion.\n- Optional world building and item collecting. The option of exploring the game world has been expanded from the previous game: three entire pages of inventory have been dedicated to collectable items that have been scattered around town, each seemingly benign in appearence, but given an subtle eerie description. More optional events have been added, and exploring rewards the player with collectables and room decorations.\n- Expanded game area. The base area is roughly twice the size of the first game, providing unique districts and areas, as well as being able to return to the town from the first game in the post-game.\n\nCONS:\n-Some systems can be difficult to grasp for first time players. This game subtly decides that you have played the first game, and you dont have a long period to practice controlls\n- Some periods can be frustrating if you're having difficulty understand certain enemy or boss mechanics. \n-Certain locations are removed from the last save point, or do not give you the ability to return to the world map from the save points, so backtracking through an area might be a bit boring.\n\nIf you're interested in Horror and Japanese culture, this game is for you. I highlly recommend this game for anyone who likes well designed simple games, with a penchant for horror. 9/10", "timestamp_created": 1509706405, "timestamp_updated": 1509706405, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502712", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36219690": {"recommendationid": "36219690", "author": {"steamid": "76561198313255599", "num_games_owned": 15, "num_reviews": 2, "playtime_forever": 401, "playtime_last_two_weeks": 0, "last_played": 1509189913}, "language": "schinese", "review": "画风谐美，剧情跌宕起伏，很同情游戏中的两位小萝莉，凄凉悲惨，催人泪下，结局以伤感形式告终，不禁让人联想小唯是否还会回来，期待下一部作品，点一个大大的赞。", "timestamp_created": 1509636557, "timestamp_updated": 1509636557, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36206853": {"recommendationid": "36206853", "author": {"steamid": "76561197972112919", "num_games_owned": 2143, "num_reviews": 2, "playtime_forever": 505, "playtime_last_two_weeks": 0, "last_played": 1509772593}, "language": "english", "review": "Yomawari: Midnight Shadows is an unnervingly brilliant tale of loss, regret, and high tolls to pay. It is not a happy story. But it is a shining example of Japanese horror. As a sequel it has attempted to build on the world established in the original and does so wonderfully. The developers clearly used their knowledge of (Japanese) cultural and religious beliefs (such as those of Shinto) to help create a world that could very easily mirror our own. Many of the locations present could represent any street or shrine found throughout Japan. Even the mountain forest retains echoes of a similarity to Aokigahara — an area infamous for being a place where Japanese go to end their lives; even a similar sign is included urging those who read it to treasure their life and seek help.\n\nSee full review: http://www.j-ga.me/s/review-yomawari-midnight-shadows/", "timestamp_created": 1509588560, "timestamp_updated": 1509588560, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36204442": {"recommendationid": "36204442", "author": {"steamid": "76561198087451020", "num_games_owned": 2003, "num_reviews": 110, "playtime_forever": 1271, "playtime_last_two_weeks": 0, "last_played": 1509686058}, "language": "schinese", "review": "全成就达成，特来简评一下：\n\n+环境的画风依然是那么软萌，女主的画风更加契合于环境（玩过前作的应该都有感觉，前作女主的色调明显比环境明亮很多）\n+剧情有血有肉，比前作丰满很多\n+地图超大，是前作的两倍左右，前作的小镇也可以去探险了，还能遇到前作的女主哦\n+收集品不再是单纯的捡东西，好多收集品都有相关的支线小任务，比前作单纯跑图捡东西有意思多了\n\n-不支持中文，有点遗憾\n-难度比前作低，有威胁的小怪比前作少，BOSS摸清套路基本没难度，恐怖感有所减少\n-结局致郁", "timestamp_created": 1509578488, "timestamp_updated": 1509685942, "voted_up": true, "votes_up": 21, "votes_funny": 1, "weighted_vote_score": "0.688623", "comment_count": "8", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36200504": {"recommendationid": "36200504", "author": {"steamid": "76561198028020795", "num_games_owned": 3403, "num_reviews": 115, "playtime_forever": 590, "playtime_last_two_weeks": 0, "last_played": 1509504003}, "language": "english", "review": "Full review (including score): https://cublikefoot.com/2017/11/01/yomawari-midnight-shadows-actual-game-review/\n\nYomawari: Midnight Shadows is a deceptively cute horror game. It makes that fact clear quickly. I was not expecting to actually be scared by a game with such cute protagonists, but I was wrong. The game manages its atmosphere well, has a large world to explore, and generally is a good horror game all around, even if there are a few annoyances.\n\n[h1]Pros:[/h1]\nGreat atmosphere. This game does an incredible job at maintaining its atmosphere, one of constant unease. In place of a soundtrack, the game just plays constant ambient noise, showcasing the top-notch sound design. An example of this would be the several audio cues used when certain enemies are nearby or when something is about to happen. Another being the character’s heartbeat increasing when enemies get near. There is a lot of emphasis placed on the sound design and that emphasis is well-deserved.\n\nThe game’s graphics were equally important in projecting this atmosphere. There are a wide variety of enemies and each has its own unique and creepy design, contrasting the cute designs of the main characters. The backgrounds are also very well-done with a high level of detail. The amount of work that went into preserving this atmosphere is just incredible.\n\nLarge world to be explored. While the game may hold your hand at times (placing blockades in certain areas and using a dog to give directions), there is still a pretty decent amount of exploration to be done. The game’s world is actually quite big. I beat the game in just under six hours and still had several areas left to explore. There are plenty of collectibles to find and achievements to unlock just by exploring. This adds a lot of potential playtime for achievement hunters like myself.\n\n[h1]Cons:[/h1]\nVariety of game mechanics. Outside of basic movement and the ability to toss certain objects, the game is really lacking in the amount of mechanics offered. For example, during the tutorial, the player is instructed to push a box into place in order to move onto the next area. It is a simple mechanic, but it is only ever used past that point maybe two or three times. There could have been several interesting uses for this mechanic, but the game simply does not take advantage of it. Most boss battles are just a combination of avoiding attacks and pressing A when necessary. The throwing of rocks or paper airplanes (used in normal gameplay to distract enemies) is not incorporated at all in these boss fights, which was rather disappointing. In a sense, this makes the game more accessible, as it is not complex at all, but it can drag down down the experience at times.\n\nSlow and repeated cutscenes. Usually before each boss fight a cutscene is played, in which the character usually gives some dialogue and may look around or do some other minor movement. I found that these moments were incredibly slow compared to the rest of the game, especially considering that a large chunk of it is spent running away from enemies. The constant shift from high-intensity gameplay to more mellow scenes was a bit jarring. It also does not help that during some boss fights, if I were to die and respawn, I would be forced to sit through the same slow cutscene before getting back into the boss fight.\n\n\nYomawari: Midnight Shadows is a solid horror game overall, my favorite of the year thus far. The incredible job done towards maintaining its atmosphere and the sheer amount of exploration to be done are my favorite aspects of this game. Even with the small amount of game mechanics and the slow cutscenes, I still had a great time.\n\nVideo review: https://www.youtube.com/watch?v=_npUvX4R544", "timestamp_created": 1509565574, "timestamp_updated": 1510168683, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.477643", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36196090": {"recommendationid": "36196090", "author": {"steamid": "76561198286892141", "num_games_owned": 11, "num_reviews": 1, "playtime_forever": 198, "playtime_last_two_weeks": 62, "last_played": 1513700259}, "language": "schinese", "review": "请用心去看，用心去听，这并不只是在玩游戏，这是一段开始就注定是悲剧的旅程。", "timestamp_created": 1509553800, "timestamp_updated": 1509553800, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36193798": {"recommendationid": "36193798", "author": {"steamid": "76561198358411456", "num_games_owned": 111, "num_reviews": 78, "playtime_forever": 439, "playtime_last_two_weeks": 0, "last_played": 1509633266}, "language": "tchinese", "review": "八月底首先在PS4平台上發售的繁中版\n抱著期待的心情等到十月底上架而購買的Steam版\n劇情和玩法沒讓我失望，與前作操作方法一樣\n\n每個妖魔鬼怪都有其應對與閃避方式，遊玩所蒐集物品及探索過程，其內容與經歷多少能了解關於它們一些背後故事。\n\n消耗性道具欄的部份除了某些劇情需要、存檔以外，其餘道具沒用上幾次，對一些妖魔鬼怪們無效（許多都是快步閃過或是找掩體躲即可）[strike]小石頭仍然是若有似無加減使用的存在[/strike]\n\n如果真有打算利用，切記「勿慌勿亂、瞄準後丟」\n\n號稱地圖兩倍大，實際上是[spoiler]本作地圖加上鄰鎮前作地圖套用而已，充其量可能是在通關後探索道具、順便一窺前作的妖魔鬼怪們吧。（有玩過前作的人在探索前作地圖，某些細節和支線會有似曾相識感、以及通關後會遇到前作主角）[/spoiler]\n以雙主角視角進行遊玩，方便在劇情交待上有連貫性的作用。\n\n日本一以幼女當主角的一向虐心，本作也不例外。\n開頭教學虐、分歧夭壽虐、結尾更虐。\n總之因為這款玩通關的關係，本人的創作慾正蠢蠢欲動了！[spoiler]深刻認為製作團隊可能是MGS粉絲[/spoiler]\n\n既然是系列作，那下次會出什麼？\n\n[b]幼女戰隊當主角的《極深夜廻》？[/b]\n[b]全世界各地幼女的《超極深夜廻》？[/b]\n[strike]我還「超級夜總會」咧XDDD[/strike]\n\n[h1]「沒關係！只要是幼女、我都要！」[/h1]", "timestamp_created": 1509548227, "timestamp_updated": 1509597371, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.514563", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36193221": {"recommendationid": "36193221", "author": {"steamid": "76561198349877339", "num_games_owned": 6, "num_reviews": 6, "playtime_forever": 1158, "playtime_last_two_weeks": 7, "last_played": 1514539858}, "language": "japanese", "review": "とても思い入れがある作品なので一言だけ書かせて下さい。\n\n\n\nすごくつらかったです…\n\n\n追記　クリアしてしばらく経過した今でも思い出す度に涙が出てきて…つらいです…", "timestamp_created": 1509546805, "timestamp_updated": 1514680531, "voted_up": true, "votes_up": 8, "votes_funny": 6, "weighted_vote_score": "0.382467", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36176796": {"recommendationid": "36176796", "author": {"steamid": "76561198075764517", "num_games_owned": 160, "num_reviews": 15, "playtime_forever": 630, "playtime_last_two_weeks": 0, "last_played": 1509436575}, "language": "english", "review": "CUTE AND SCARY THE BEST COMBINATION", "timestamp_created": 1509485735, "timestamp_updated": 1509485735, "voted_up": true, "votes_up": 8, "votes_funny": 2, "weighted_vote_score": "0.599768", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36169681": {"recommendationid": "36169681", "author": {"steamid": "76561198342036731", "num_games_owned": 63, "num_reviews": 15, "playtime_forever": 880, "playtime_last_two_weeks": 0, "last_played": 1509881454}, "language": "schinese", "review": "[h1] 终于全成就了 聊下心得吧....以下内容涉及剧透注意\t[/h1]\n\n\n\n\n\n\n\n\n[b] 关于音乐\t[/b]\n本作的音乐依然是很棒棒 和前作一样 还是那种深邃 幽静的 黑暗的夜晚的感觉 值得一提的是 支线任务的得到收音机后就可以在女主家里欣赏到本作和前作的音乐了 嗨呀真是爽到啊美滋滋~\n\n[b] 关于剧情\t[/b]\n前作是找狗狗和姐姐 这作找姬友2333 不过感觉比前作要虐心一些啊....说实话后面剧情我没看太懂...根据支线小唯留下的字条来看 我个人的理解是 最开始是小唯想要拯救小遥 然后小唯的狗狗小黑代替小遥死了 小唯受不了狗狗死去姬友搬家的打击自杀了 然后.....小唯的灵魂貌似黑化了 想要杀掉小遥和小遥在一起 但是小遥不能接受这样的小唯就断手了 然后小唯的灵魂大概是被困在那座山上了吧 最后她把小瑶救出来的时候可以选择不放手 但是没用 所以最后只能放手了 我觉得她应该是在对狗狗说 再见了 小遥就拜托你照顾了 感觉好虐心啊 我擦日本一你怎么这么虐这对可怜的姬友啊...\n\n不过根据支线来看 主角小遥貌似和前作女主成为了朋友 这个真的是本作在极大的致郁中仅有的一丝希望了 小遥的最后一篇日志中写到 “我搬到了别的地方 有了新的朋友 不知道还会不会回想起那个夏天的事情 生活还真是可怕啊” 受不了了好可怜啊啊啊啊啊......\n\n[b] 关于本作加入的护符系统\t[/b]\n感觉好多护符都挺鸡肋的2333  带更多的石头...萤火虫时间更长啊...还有那个多了10日元的...恕我直言这个小镇的钱根本捡不完 随便走在大街上或者翻翻垃圾袋都能捡到钱2333 比较有用的应该是那个跑的时间更长还有跑的更快吧\n\n [b]关于本作的地图\t[/b]\n本作增加了一些室内的地图 比如图书馆啊洋馆啊下水道啥的 感觉还是很不错的 尤其是洋馆那里 那种破旧的洋馆 地板上的裂缝 感觉有种之前玩的尸体派对驭血的味道 不错不错 还有就是 本作的小镇和前作女主居住的小镇相邻 玩家可以通过地图到达前作小镇 并且会遇到前作中出现的熟悉的怪物 最令我惊喜的是我居然还遇到了前作女主2333 不知道主角会不会和她成为好姬友呢...毕竟一个瞎左眼一个断左手 两个残疾人在一起相互也有个照应嘛23333\n\n[b] 关于怪物与BOSS战\t[/b]\n感觉本作新加的一些怪物都挺不错的 尤其是那个小蝌蚪一样的追你的时候还会卖萌撒娇一样的叫 被手电照到还会捂着眼 简直萌死我了啊23333 一般的小怪都不算难 也有一些跑的比较快的怪 用石头或是纸飞机啥吸引注意就可以 BOSS战也并不算太难 毕竟这些BOSS的套路都还是很好找的 [spoiler] 我会告诉你我在原地和那个大骷髅周旋了十分钟才发现应该往右边走的吗233\t[/spoiler]\n\n总之这一作还是非常非常不错的 没有让我失望  第一次写了这么长的评论 不知道这游戏会不会还有下一作 好期待啊啊啊啊", "timestamp_created": 1509464875, "timestamp_updated": 1509882178, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36159395": {"recommendationid": "36159395", "author": {"steamid": "76561198052342705", "num_games_owned": 88, "num_reviews": 9, "playtime_forever": 1134, "playtime_last_two_weeks": 0, "last_played": 1509356725}, "language": "english", "review": "[u]TL;DR - Like the other games NiS has been porting, it's a fun ride...but wait for a sale before purchasing due to lack of mileage and replayability.[/u]\n====\n\nY:MS is a sequel to the previous game, developed for the PS4 rather than the Vita. To reitterate upon the above, this does not make excuses for the price. With more space for exploration (and indoor areas) and a more involved postgame, it simply drags the title closer to what they ask you to pay.\n\n----\n\nThe fresh coat of paint they chose to apply to the game to differentiate it from the previous one is jump scares (and a few memes). Fortunately there is no reliance on these to give the game its identity, and like before, the game remains a quiet romp through the town at night as a little girl (what are her parents doing?) where spirits roam the streets, threatening to murder you should you be caught. The atmosphere and ambience of the game is a repeat performance, with no actual music and just the sounds of the city and nature to keep you company. Once again the top down view and artstyle helps prevent the game from living up to the horror tag, so if that's what you came for it might be a bit disappointing.\n\nAs in the case of htol:niq to A Rose in the Twilight, the developers chose to drop the difficulty of the game to make it flow better and make it have less frustrating cliffs to scale*. There are still a few areas of the game where if you die, the nearest save point is obnoxiously far away, and you will have to repeat sequences. On the flipside, this still leaves the old trick of suicide running to a random area to snag a collectible only to die and still have it collected.\n\n*[spoiler](The main antagonist they chose to introduce to the game is unfortunately the frustrating price you pay for an overall better game, as his hitbox is questionable and most of the areas you encounter him will leave you screwed solely by RNG when he chooses to teleport near you.)[/spoiler]", "timestamp_created": 1509433915, "timestamp_updated": 1509433964, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502712", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36139597": {"recommendationid": "36139597", "author": {"steamid": "76561198126803076", "num_games_owned": 27, "num_reviews": 22, "playtime_forever": 2267, "playtime_last_two_weeks": 5, "last_played": 1513694484}, "language": "english", "review": "Yomawari Midnight Shadow story really darker and sadder than the Yomawari Night Alone\nbut basically,The gameplay is almost the same and improved from the first game.\nMany new even and OLD map and places to explore, the map is pretty large.\nAnd you can SAVE on JIZO not like Yomawari Night Alone where JIZO function is just like Checkpoint in Yomawari Midnight Shadow JIZO can become your SAVEPOINT\n\nPros:\n1. Story, there's alot more dialogue in game which can helped you tell / figure out the story\n2. Sound, badum-badum-badum(heart sound when there's ghost nearby) still make me creepy out\n3. Visual, overall still same like Yomawari Night Alone( Character, Place)\n4. Gameplay, new feature when you can hold item like plank wood, you can push some box that can help in your adventure\n5. Jumpscare, what i can say?? this is horror game overall jumpscare anywhere \n6. YIPEEEE~ the dog it's not die like the first game and YOU CAN BRING THE DOG WITH YOU.\n\nCons:\n1. THERE'S NO TELEPORT TO GO HOME.\n2. JUMPSCARE\n3. JUMPSCARE (another again)\n\nI really recommended this game to anyone that like puzzle adventure horror game\nbut it's little pricey if you really big fan of Yomawari Series well i think that 's not a problem :)\n\n10/10", "timestamp_created": 1509367581, "timestamp_updated": 1512154885, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.599355", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36127548": {"recommendationid": "36127548", "author": {"steamid": "76561198036021878", "num_games_owned": 344, "num_reviews": 2, "playtime_forever": 381, "playtime_last_two_weeks": 0, "last_played": 1509318567}, "language": "english", "review": "When this game was announced I was very excited since I played the first title and really enjoyed it. I personally don't like horror games and sometimes I'm way too scared to play one but the cute designs of the characters and the world building helped me get through this game.\n\n\nStory (Potential Spoilers)\nThe story this time is tells itself more compared to the first. Within the first game, you sort of piece things together and sort of figured out an interpretation but in Midnight Shadows there is more dialogue which helped you figure out what's going on which the first didn't do. I found that the items you picked up in Midnight Shadows did more warning of things than of telling a little bit of a story of the town. LIke in the first game you learned the fate of the ghost girl but the ghost girl in this game I felt didn't have much clues that lead to her demise unless I missed something. Though the main story is much more fleshed out.\n\nVisual/Audio\nThe game is again very pretty. Nicely detailed backgrounds that are dingy dark and foreboding at times. The character designs are simplistic and cute while the spirit designs are unsettling. Everytime I encountered a spirit I had chills running through my body. The game only has one song in it but much like the first game it is a great piece. Other than that, the game has ambient noise along with the haunting sounds of spirits at times. Again the sound design is very fitting and effective.\n\nGameplay\nMidnight Shadows plays very much like Night Alone. You can run, you can tip toe, you can control where you point the flashlight, you can hide, and use items. The game adds equipable charms which will give you some sort of a benefit. Another mechanic that was added is the ability to push objects and carry objects both of which disables you ability to use your flash light. So you basically wander around town dodging spirits. One thing I feel like the game lacked was more utilization of the pushing and holding of objects. They could have used that mechanic more. The game was more straight forward. I remember in Night Alone that there are some items you basically had to find in order to get through situations which the game didn't guide you to find. The end game had a very interesting gimmick though. So very much like the first game. It felt good to play and it was pretty easy but that may be because I played the first and in some cases knew what to expect.\n\nSummary\nIt was a fun experience the story was interesting enough for me to push forward. The gameplay was not too hard but not too easy though I feel like it was easier for me compared to the first. It still has things like the game saving you progress even when you don't save at a save point meaning you retain treasures you picked up when you die. The game is still very pretty and the audio fits to make spine chilling encounters. There are some jump scares too.\n\nI'd recommend the game but I will say that it is a little pricey. Though I think those looking to 100% the game will get some more bang for the buck but unless you are a big fan of the first game I would say wait out for a sale.", "timestamp_created": 1509322408, "timestamp_updated": 1509322408, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502322", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36111128": {"recommendationid": "36111128", "author": {"steamid": "76561198313335578", "num_games_owned": 114, "num_reviews": 25, "playtime_forever": 1186, "playtime_last_two_weeks": 0, "last_played": 1509280957}, "language": "schinese", "review": "很棒的日式恐怖游戏。游戏把突如其来的恐怖和缓慢惆怅的悲伤，这两种情感结合地十分到位。因为有第一部的铺垫，所以本作各方面的细腻度都打磨得几乎完美。\n故事。两位小萝莉的真挚友情，以及勇敢面对现实的苦难，使作品有了很好的内涵。用小朋友的语言把故事叙说，完美精致。\n画面。延续上一部的风格，暗红加深绿以及日式的白色，完全体现了区别于欧式恐怖游戏的风格。怪物，人设都十分精致。\n音乐。让人印象深刻。主题曲很有韵味，各个场景的背景音都很贴切。可惜没有角色的曲子。\n总体上，这是一款能有价值的日式恐怖游戏。", "timestamp_created": 1509283427, "timestamp_updated": 1509283427, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36097683": {"recommendationid": "36097683", "author": {"steamid": "76561198296787312", "num_games_owned": 41, "num_reviews": 3, "playtime_forever": 562, "playtime_last_two_weeks": 0, "last_played": 1512293748}, "language": "schinese", "review": "日本一日常虐萝莉，游戏还是值得一玩的，不过目前 的汉化补丁质量比较糟糕，英文和日文渣要好好考虑", "timestamp_created": 1509247739, "timestamp_updated": 1509247739, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36081321": {"recommendationid": "36081321", "author": {"steamid": "76561198111094354", "num_games_owned": 51, "num_reviews": 14, "playtime_forever": 923, "playtime_last_two_weeks": 0, "last_played": 1512107179}, "language": "english", "review": "First, I've played the first Yomawari and was looking forward the sequel since it got the first announcement.\nAnd thank you NISA for beta test chance, I really appreciate it since I love the franchise and NISA games.\n\nThis sequel's story got really darker and sadder than the first one :(\n\nThe gameplay is almost the same and improved from the first game.\nMany places to explore, the map is pretty large.\nAnd you can save outside! (Jizo statues are just checkpoint save in the first game, you have to go home to really save the game)\n\nA purrfect game to play for halloween, put your headphones and go ba-dump with the girls.\n\nGreat sequel, thank you for the localization of the game!\n", "timestamp_created": 1509204902, "timestamp_updated": 1509204902, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36079895": {"recommendationid": "36079895", "author": {"steamid": "76561198034865771", "num_games_owned": 82, "num_reviews": 3, "playtime_forever": 554, "playtime_last_two_weeks": 0, "last_played": 1509200956}, "language": "finnish", "review": " Todella hyvä tunelma ja nätti piirostyyli. \nPeli osaa pelotella pelaajaa hyvin kohdissa missä sitä vähiten odottaa (aluksi) ja monet hirviöt vaikutavat tuleen suoraan japanilaisesta animesarjasta. \nOlisin tosin halunnut jotain vaihtelua hirviöiden toimintaan. Nyt niiten karkuun juokseminen tuntuu jo hieman puudutavalta varsinkin kun kylän jokainen kulma on niitä täynnä, eikä karkuun aina pääse kiitos epäreilujen tilojen takia. \n\nKartasta ei ole juurikaan mitään apua kun se ei kerro minne sinun pitäisi mennä eikä tukittuja reittejä näy kartalla ollenkaan paria kohtaa lukuunottamatta. Onneksi pelistä löytyy teleportaus toiminta, jotta sinun ei tarvi kulkea reittä alusta asti \nPelissä ei ole myöskään mitään varsinaista kuolemaan vaan voit jatkaa peliä viimeisimmästä tallennuksesta tosin tällöin heitämäsi kivet yms. katoavat ainoastaan repustasi.  \nJotkut bossi tappelut tosin olisi voinnut olla hieman paremmin hahmoteltu nyt tuntui siltä ettei bossia voi läpäistä ilman kuolemaa ellei tiedä mitä tulisi tehdä. Sama parissa muusakin kohtaa.\n\nPelistä löytyy myös paljon kerätäviä asioita joita en itse kylläkään jaksanut alkaa etsimään joten tiedä mitä niillä tulisi tehdä.\n\nMuutamia kaatumisia lukuun ottamatta peli toimi sujuvasti eikä mitään pelaamista estäviä bugeja kohdallani löytynyt.\n\nJos haluut parin illan kauhuviihdettä animetyylillä,  kanattaa tämä nakata mukaasi.\n\n", "timestamp_created": 1509202199, "timestamp_updated": 1509202199, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36065952": {"recommendationid": "36065952", "author": {"steamid": "76561198187859285", "num_games_owned": 37, "num_reviews": 3, "playtime_forever": 11, "playtime_last_two_weeks": 0, "last_played": 1508956190}, "language": "schinese", "review": "深夜廻、夜廻第一眼都让我想起一部叫做《魔女之家》的RPG免费小游戏，我没有调查过也没上魔女之家作者的官网看过他的最新动态。夜廻虽然是日本一做的游戏但是我总有种魔女之家作者参与了其中，或者是日本一夜廻的制作人也玩过魔女之家的感觉。比如说一代里窜过街的黑猫，比如说血腥的场景，比如说略黑暗的结局，比如说固定点存档，还有几乎是游戏给人整体的感觉，画风，2D绘制的背景和二头身萌萌的女主。可能夜廻和魔女之家没有必然的联系吧，但我相信这么相似的她们的某处一定有着偶然的关联。", "timestamp_created": 1509168133, "timestamp_updated": 1509168133, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36065502": {"recommendationid": "36065502", "author": {"steamid": "76561198051634732", "num_games_owned": 323, "num_reviews": 11, "playtime_forever": 213, "playtime_last_two_weeks": 0, "last_played": 1509164978}, "language": "english", "review": "I received this game for free from NIS America to review before launch, but was unable to do so until the Friday after launch.\n\nPros:\nThe game has a really nice art style. The movement is very smooth and it's cartoony, but in a violent way.\nThey use sound appropriately to give you the WTF! moments when you run into the different types of ghost.\n\nCons:\nInstead of building up tension and then getting you with a fright, the game seems to stay at a constant plateau in each chapter... a low plateau.\nThe story is a bit lacking. Even with little clues dropped around town to unlock some mysterious entity, you still spend most of your time wandering aimlessly through town trying to find the objective in some chapters. In others, you are forced down certain paths that will have you hitting a respawn point repeatedly to attempt getting passed a faster enemy.\nMy controller didn't work with the game. Though taht is more of my issue and not the games.\n\nThe game as a whole just kind of felt meh, but that is my opinion. I enjoy a good story tied in with the jump scares and pacing when it's done right... but this Yomawari just didn't have anything for me. You can see my playthrough below.\nhttps://www.twitch.tv/videos/185703014", "timestamp_created": 1509166809, "timestamp_updated": 1509166809, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.317727", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36063890": {"recommendationid": "36063890", "author": {"steamid": "76561198148412067", "num_games_owned": 128, "num_reviews": 3, "playtime_forever": 1110, "playtime_last_two_weeks": 0, "last_played": 1511084293}, "language": "schinese", "review": "游戏是好游戏，剧情比一代夜迴明确。结尾ED的BGM也很赞（事先看过实况）。\n可惜目前没有中文 PS4是有的，等等看会不会出吧。\n日本一真的喜欢虐小女孩啊= =\n\n\n\n（推荐用手柄游玩）", "timestamp_created": 1509161724, "timestamp_updated": 1509161724, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36055616": {"recommendationid": "36055616", "author": {"steamid": "76561198177309646", "num_games_owned": 11, "num_reviews": 1, "playtime_forever": 820, "playtime_last_two_weeks": 0, "last_played": 1506560055}, "language": "english", "review": "I really like the story, really great game, Cute graphics, scary moments and over all i really enjoy this game.<3", "timestamp_created": 1509135520, "timestamp_updated": 1509135520, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36054563": {"recommendationid": "36054563", "author": {"steamid": "76561197985101174", "num_games_owned": 93, "num_reviews": 15, "playtime_forever": 1933, "playtime_last_two_weeks": 0, "last_played": 1513264023}, "language": "english", "review": "If you are looking for a spooky scary game to play on Halloween day, then look no further than Yomawari: Midnight Shadows! It is the perfect game for event with an engrossing story and environment that will keep you sucked into the story for a good while.", "timestamp_created": 1509132919, "timestamp_updated": 1509132919, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.541523", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36047546": {"recommendationid": "36047546", "author": {"steamid": "76561198119980011", "num_games_owned": 79, "num_reviews": 1, "playtime_forever": 708, "playtime_last_two_weeks": 0, "last_played": 1509117686}, "language": "koreana", "review": "도전과제 깨야되는데 까마귀가 안나오네", "timestamp_created": 1509118032, "timestamp_updated": 1509118032, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.476691", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36031536": {"recommendationid": "36031536", "author": {"steamid": "76561197989154506", "num_games_owned": 764, "num_reviews": 10, "playtime_forever": 847, "playtime_last_two_weeks": 0, "last_played": 1509268283}, "language": "english", "review": "The gameplay is a lot more smoothed out than the first one, without many of the frustratingly tight moments of its predecessor.  It's still pretty spooky, atmospheric,  and is a good bit longer and larger than the first game, with plenty to explore.  Personally, I felt the story of the first game was a bit more concise and powerful, but still enjoyed what this game had to tell.\n\nIf you considered the first game worth the asking price, I think the additional polish and length are worth the increase here.", "timestamp_created": 1509078069, "timestamp_updated": 1509078638, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36030872": {"recommendationid": "36030872", "author": {"steamid": "76561198321283683", "num_games_owned": 70, "num_reviews": 4, "playtime_forever": 149, "playtime_last_two_weeks": 0, "last_played": 1512914781}, "language": "schinese", "review": "没有支持手柄震动，很失望", "timestamp_created": 1509075702, "timestamp_updated": 1509075702, "voted_up": false, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.298737", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36011821": {"recommendationid": "36011821", "author": {"steamid": "76561198126049232", "num_games_owned": 11, "num_reviews": 1, "playtime_forever": 1384, "playtime_last_two_weeks": 0, "last_played": 1511333992}, "language": "tchinese", "review": "自從PS4出了以後就很期待，\n在steam出了隔天馬上買來玩，\n真的不讓人失望，就算只有英文、日文，\n但劇情不難，使用日文的注意，\n(可能是小學生的關係，使用的都是假名，比較不容易懂)\n音樂的DLC滿可惜的，只有一首歌曲，\n但喜歡的可以買來聽，\n沒玩過夜迴的也可以玩玩看深夜迴，\n兩部的關聯性不大，深夜迴可以說是獨立出來的另一個遊戲，\n喜歡可愛、恐怖風格的歡迎來玩玩看。", "timestamp_created": 1509021092, "timestamp_updated": 1509021092, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502050", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36010257": {"recommendationid": "36010257", "author": {"steamid": "76561198161890793", "num_games_owned": 31, "num_reviews": 2, "playtime_forever": 930, "playtime_last_two_weeks": 0, "last_played": 1511063230}, "language": "english", "review": "Really love the story this time. And it would be better if you try the first game before moving on the second game, it actually connected after finish the main story", "timestamp_created": 1509016645, "timestamp_updated": 1509016645, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.577618", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36006915": {"recommendationid": "36006915", "author": {"steamid": "76561198055778828", "num_games_owned": 41, "num_reviews": 12, "playtime_forever": 133, "playtime_last_two_weeks": 0, "last_played": 1511157073}, "language": "english", "review": "wow, only about 30min and I feel it, pretty much the same game as the other Yomawari(played it on vita) but with so much more improvment.", "timestamp_created": 1509005932, "timestamp_updated": 1509005932, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36005945": {"recommendationid": "36005945", "author": {"steamid": "76561198129706768", "num_games_owned": 25, "num_reviews": 1, "playtime_forever": 63, "playtime_last_two_weeks": 0, "last_played": 1509183379}, "language": "koreana", "review": "ㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠ", "timestamp_created": 1509001657, "timestamp_updated": 1509195091, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.517986", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36005629": {"recommendationid": "36005629", "author": {"steamid": "76561198213771221", "num_games_owned": 107, "num_reviews": 7, "playtime_forever": 442, "playtime_last_two_weeks": 0, "last_played": 1511086848}, "language": "schinese", "review": "怎么说呢？这一作总的来说比上一作要好多了，起码知道了主要说的是什么故事。上一作则是在午夜的充满着妖怪的街头上寻找姐姐和小狗，而这次是寻找朋友，且故事相对前作是要虐心得多。[spoiler] （没错我已经视频通关了）[/spoiler] 不过还是一部不错的独立作品。\nPS：为什么日本一这么喜欢虐萝莉[spoiler] 幼女[/spoiler] 啊……", "timestamp_created": 1509000123, "timestamp_updated": 1509000123, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35987125": {"recommendationid": "35987125", "author": {"steamid": "76561197999613929", "num_games_owned": 293, "num_reviews": 148, "playtime_forever": 470, "playtime_last_two_weeks": 0, "last_played": 1508925710}, "language": "english", "review": "The follow up of the previous game is as scary and cute in equal parts - but it also follows the same pitfalls.\n\nVideo:\nhttps://www.youtube.com/watch?v=xSmDzDTTQ1Q\n\nText:\nOkay, the game is scary and that is pretty much what you'd expect. What I didn't expect was that even knowing that the game relied heavily on jump scares, I'd still be scared shitless time and again. The pacing and world building between the cute visuals that switch into the gruesome in a blink, the sound design with heartbeats and screeches, and even the world building that guides you to the place you need to go. This is a scary game, and that's a hard thing to achieve with 2d isometric style graphics.\n\nFrom start to finish I enjoyed myself immensely. BUT - that doesn't mean that the game is perfect.\n\nI personally really dislike the save mechanic in the title, which encourages save scumming and lets you keep items even after dying. This removes a lot of the risk-reward in some things and diminishes the tension of the gameplay that the game relies on so heavily. Also, i am not a fan of the way they game pretends to be \"open\" for exploration, and then locks of everything but a few pathways for you to walk though, resulting in a lot of backtracking and wasted time for no real reason.\n\nFrom a PC Perspective the lack of extended resolution support and limited options (though it has rebindable keys) is annoying to say the least. This also shows in the way the game is rendered, with the textures stretching and expanding on higher resolutions, meaning that the visual fidelity that looks full of details at 720p loses a lot of its nuance at 1080p and higher.\n\noveral, a good solid sequel to the previous title that follows mostly the same design patterns and mechanics to do exactly one thing, and do it well: Scare you. And it succeeds.\n\nIf you enjoy the review [url=http://store.steampowered.com/curator/11617580/]do follow my curator feed![/url]. Or check out the various other reviews on [url=https://youtube.com/c/guylogicgaming] YouTube[/url].", "timestamp_created": 1508933597, "timestamp_updated": 1508934326, "voted_up": true, "votes_up": 18, "votes_funny": 1, "weighted_vote_score": "0.599546", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "35986551": {"recommendationid": "35986551", "author": {"steamid": "76561198155521992", "num_games_owned": 65, "num_reviews": 3, "playtime_forever": 407, "playtime_last_two_weeks": 0, "last_played": 1511960993}, "language": "english", "review": "I played this game because i received the beta key, I fell in love with the art-style of this game, and it challenged me to keep playing while i got (jump)scared. I really like what i've seen so far and you should really play it as well.", "timestamp_created": 1508931703, "timestamp_updated": 1508931703, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "35986219": {"recommendationid": "35986219", "author": {"steamid": "76561198116432853", "num_games_owned": 183, "num_reviews": 15, "playtime_forever": 139, "playtime_last_two_weeks": 6, "last_played": 1514094875}, "language": "schinese", "review": "英文文本难度也不是很大，犹豫没汉化的话直接入手吧，反正过几天肯定有补丁", "timestamp_created": 1508930674, "timestamp_updated": 1508930674, "voted_up": true, "votes_up": 4, "votes_funny": 3, "weighted_vote_score": "0.563758", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35984045": {"recommendationid": "35984045", "author": {"steamid": "76561198133893612", "num_games_owned": 160, "num_reviews": 2, "playtime_forever": 478, "playtime_last_two_weeks": 0, "last_played": 1510314944}, "language": "english", "review": "a bit pricey but worth it.\nthis game is all about cute girls doing cute things in a land full of rainbows and unicorns XD", "timestamp_created": 1508922468, "timestamp_updated": 1508922468, "voted_up": true, "votes_up": 2, "votes_funny": 5, "weighted_vote_score": "0.424288", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35982862": {"recommendationid": "35982862", "author": {"steamid": "76561198255779880", "num_games_owned": 10, "num_reviews": 2, "playtime_forever": 225, "playtime_last_two_weeks": 0, "last_played": 1512819628}, "language": "english", "review": "i first play yomawari nice cute\nhear heart enemies get close but still there\nits great game", "timestamp_created": 1508917459, "timestamp_updated": 1508917459, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.414904", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35982015": {"recommendationid": "35982015", "author": {"steamid": "76561198336573680", "num_games_owned": 47, "num_reviews": 5, "playtime_forever": 504, "playtime_last_two_weeks": 0, "last_played": 1510114494}, "language": "english", "review": "I was a big fan of the first Yomawari and I'm very pleased with how Midnight Shadows turned out. Midnight Shadows plays just like the first Yomawari, but with extra QOL improvements to make your experience less annoying compared to the first game. Midnight Shadows is an easy game to pick up and play for fans of sprite horror and doesn't require you to play the first game so even newcomers can give it a shot.\n\nIf you like the cute sprite art and want an atmospheric horror experience, give it a shot.", "timestamp_created": 1508913243, "timestamp_updated": 1508913243, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.592420", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35981937": {"recommendationid": "35981937", "author": {"steamid": "76561198051986429", "num_games_owned": 176, "num_reviews": 6, "playtime_forever": 180, "playtime_last_two_weeks": 0, "last_played": 1508944309}, "language": "schinese", "review": "深夜廻是日本一出品的恐怖探索动作游戏夜廻的后续作品。简单来说是一个操纵小萝莉在夜晚冒险和躲避妖怪的游戏，算是名声还不错的小品级作品，就随便写一点好了\n\n优点：\n\n+画风细致优美\n    整个游戏很多地方都仿佛一件艺术品，横版部分甚至产生了胧村正背景的错觉，气氛渲染功力十足\n\n+恐怖成分恰到好处 \n    虽然带着恐怖元素，但是仅仅达到吓一跳的程度。在以心理恐怖为主要卖点的日系作品里这种程度算非常轻的，适合所有年龄段的玩家游玩\n\n+探索的部分很足\n    整个游戏是以“固定式主线”+“自由探索式支线”的部分组成的，支线任务数量充足（虽然部分要在主线结束后才能做）\n\n+难度适中\n    上一作经常路边走着随便就冲一个家伙把你送回复活点的坑爹情况基本没有了。这次一般情况下攻击都有较明显的提示\n\n+剧情饱满\n    相比上一作夜廻，这次的新作品对于剧情的把握是更加成熟了。不再是一个片段拼凑的，为了任务物品而进行，剧情在大部分时候只是背景的作品。这次剧情的比重大大提高，全程贯穿游戏，整个故事也更加鲜活。\n\n+本地化很棒\n    良心本地化，连游戏里的素材都做了部分本地化，而且切换语言可以在游戏中实时进行（虽然现在没有官方中文，但是在PS4上有中文，未来或许有那么点可能呢？）\n\n缺点：\n\n-没有官方中文\n    作为一个故事主导的游戏，明明存在官方中文的版本（PS4）但Steam版并不支持官方中文，这不能不说是一种遗憾。游戏只有日文/英文可选，且日文情况下由于设定女主是小学生文本全部由假名构成，这对大部分国内玩家来说无疑是一大减分项，这么好的作品如果只能猜着打就太可[strike]惜[/strike]怜了\n\n-没有背景音乐\n    和上一作一样整个游戏只有一首主题曲，只在ED的时候播放（虽然通关以后可以随时听）。其余时候只能听到各种音效（主要是心脏怦怦跳动），这多少有些枯燥\n\n-游戏对PC操作方式的支持不够好\n    作为源生PS4/PSV的游戏，深夜廻对手柄的支持是很好的，但是对键盘的支持就不怎么样了。默认的两种键位设置都会在有些情况下觉得不顺手，虽然可以自定义按键，但有些按键冲突的情况仍然需要注意\n\n[spoiler]通关以后肯定有不少人想准备刀片吧嗯[/spoiler]", "timestamp_created": 1508912760, "timestamp_updated": 1508912760, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.614764", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35981563": {"recommendationid": "35981563", "author": {"steamid": "76561198311862030", "num_games_owned": 102, "num_reviews": 19, "playtime_forever": 319, "playtime_last_two_weeks": 0, "last_played": 1511412610}, "language": "schinese", "review": "还行吧，主要是画风合我胃口，看英语感觉没啥代入感。希望有中文", "timestamp_created": 1508910885, "timestamp_updated": 1508910885, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35979829": {"recommendationid": "35979829", "author": {"steamid": "76561198210937049", "num_games_owned": 128, "num_reviews": 27, "playtime_forever": 485, "playtime_last_two_weeks": 0, "last_played": 1511176374}, "language": "schinese", "review": "——难受，[spoiler]日本一虐Loli感觉出了名了！ [/spoiler]\n\n——由于本作的地图比上作要大很多，探索要素就比较多了。不过键盘+鼠标的操作手感还是感觉不熟悉，慢慢习惯了！这作的价格还是可以的，虽然首发没打折，但入了上作全部的此作本体+DLC可以享受20%的折扣，还是很不错！\n\n——OST真心好听，这作推荐入手这个DLC！\n\n——已通关，这游戏如果有些收集要素没有完成，可以在二周目进行了。也可以去邻镇并且能遇到一代主角，总共有5处可以和一代主角互动。[spoiler]具体地点可以百度找寻！[/spoiler]\n\n——期待下部作品了。[spoiler]下作会“少”什么呢。。。 [/spoiler]", "timestamp_created": 1508901868, "timestamp_updated": 1509171554, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35977978": {"recommendationid": "35977978", "author": {"steamid": "76561198165413614", "num_games_owned": 191, "num_reviews": 59, "playtime_forever": 1680, "playtime_last_two_weeks": 0, "last_played": 1510625875}, "language": "russian", "review": "Ждал выхода игры больше своего дня рождения и не зря !\nПлюсы новой часть:\n+Маштабы карты стали больше\n+Заданий стало вдвойне больше (так как уже две героини) \n+Еще одна милая лоли \n+Монстров дохххуя ,теперь они на каждом ебббаном шагу \n+Атмосферность \nНо, так же в игре есть пару минусов:\n-Быстрота и легкость заданий (Если же раньше вы горбатились по всей карте в поисках того чего надо ,то тут уже проще ,так как на правильный путь вас наталкивают подсказки и монстры)\n-РАЗРАБЫ ПОЧЕМУ НЕТУ АРТ-ББЛЯТЬЬ-БУКА ПО ЭТОЙ ИГРЕ \nНу на этом и закончу ,так как игра у разработчиков получилась воистину ,и моя оценка данной игре 10 из 10 потерянных Юй", "timestamp_created": 1508892202, "timestamp_updated": 1508892202, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.494891", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35977589": {"recommendationid": "35977589", "author": {"steamid": "76561198296491025", "num_games_owned": 66, "num_reviews": 4, "playtime_forever": 1304, "playtime_last_two_weeks": 0, "last_played": 1511585116}, "language": "schinese", "review": "大概上周在岗少（唔好像打错了什么？）那发现夜廻竟然出续作了，赶快跑来steam上加入心愿单。估计不会降价，所以一发布就直接买了。嘛，还是有点补票性质的哈哈哈。剧情很有创意，真相揭露的时候能让人起鸡皮疙瘩，具体的就不剧透了。结局比上一作更致郁了，编剧和小萝莉有仇吗QAQ 画面和操作延续了前作的风格，道具和场景加了不少有意思的东西，比如能随时躲藏的垃圾袋，电车/洋馆之类的。也有一些很令人怀念的彩蛋，比如前作的小萝莉，还有前作的大蜈蚣神（好心疼蜈蚣神啊QAQ）总之对于喜欢这种类型的游戏或者故事的人来说肯定值回票价了，放心买吧www\n\nP.S. 哦对了没有中文版，估计只能等非官方汉化补丁了。我目前玩的英文版，文本很简单，高中水平就能正常阅读了。\nP.S.S 高分辨率时偶尔会崩溃+丢失剧情，大家小心。。。调低分辨率可有效减少崩溃频率。\n\n--------------------------------------\n刚刚正式通关了……\n听到片尾曲还是很难受……\n[spoiler]\n“要不要放开小遥的手？”\n“不要。要。'\n看到这句话就泪目了……\n[/spoiler]\n\n--------------------------------------\n大概是我最喜欢的游戏了。嘛，总之大家有什么问题都可以来问我~", "timestamp_created": 1508890003, "timestamp_updated": 1511381259, "voted_up": true, "votes_up": 12, "votes_funny": 8, "weighted_vote_score": "0.661860", "comment_count": "9", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35975254": {"recommendationid": "35975254", "author": {"steamid": "76561198035712339", "num_games_owned": 78, "num_reviews": 3, "playtime_forever": 2062, "playtime_last_two_weeks": 0, "last_played": 1511567887}, "language": "japanese", "review": "夜道探索ホラー夜廻の待望の続編、深夜廻です。PS4本体と公式プレミアム限定版を予約するほど待ってました。\nゲーム内容自体は前作夜廻に比べて大幅にボリュームアップ、前作で慣れたヨマワラーの方にも存分に楽しめる内容となっています。\n個人的には前作の夜廻からプレイすることをお勧め（クラッシュ報告が非常に多いですが、ユーザーレビュー等によるクラッシュ回避方法解説アリ）\n元々がコンシューマ版より大幅に安い上にセール時は1000円以下で購入できます。\n\n良い：\n広くなった街に新しいお化け、探索心をくすぐるコレクションも前作よりパワーアップ。\n見覚えのあるお化けなんかも居て懐かしい気持ちになるような旧知の友達に出会えたような・・・。\nPS4版でのプレイデータでしたが、初見でのクリアまでの時間は大体8時間ほどだったと思います。\n前作で散々慣れてからのプレイでこの程度なので単純にボリューム自体増えてますし、本筋のストーリーも\n負けず劣らずビックリさせてくれますし、涙腺を刺激してくれます。\n\nまたPS4版との相違点ですが、言語選択で英語が選べる、解像度が640*480～1920*1080（当方の環境で）まで選べる、\nキーボードやコントローラの細かいバインド設定の変更などにも対応しています。\n\n前作は元がPSVitaからの移植なので、今作はビジュアル面においても非常に楽しめます。\n\n可愛らしい主人公キャラに、薄暗くてお化けの蔓延る田舎の街、どこかノスタルジーさを感じる世界観で胸が締め付けられる感情を抱きたい方に是非。\n100円で買えるサウンドトラック（1曲のみ、PVで聴けるメインテーマ）も他では公式プレミアム限定版（現時点では在庫無し）のみでしか手に入りません。\n\n悪い：\nゲームの性質上、やはりある程度は死にゲー覚悟が必要です。\nこれが苦手で苦になる方にはあまりお勧めはできません。\nまた中継地点的な場所でいろんな場所にワープして移動できるのですが、これが前作と同様で若干かゆい所に手が届かないような・・・。\nスタミナ要素とランダムで配置されるお化けの要素が相まってきて、周回プレイだと移動が若干面倒に感じることがあります。\n\nまた、配信当日現時点では前作のようなデジタルアートブックは配信されておらず、PS4版プレミアム限定版付属の前日譚の小説などが無いので、\nどうしても手に入れたい場合はオークション等で探す必要があります、PS4版を持ってない場合は後日対応してくれるのを祈るしかないですね。\n\n夜廻の世界感を体験したことのない兄貴達は、バンドルでのセットがお得なので買って堪能しようね。\nセールを待つのもいいと思います。", "timestamp_created": 1508878701, "timestamp_updated": 1508878701, "voted_up": true, "votes_up": 26, "votes_funny": 1, "weighted_vote_score": "0.548067", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35973925": {"recommendationid": "35973925", "author": {"steamid": "76561198157202733", "num_games_owned": 130, "num_reviews": 7, "playtime_forever": 811, "playtime_last_two_weeks": 0, "last_played": 1509882150}, "language": "russian", "review": "Могу сказать одно - любой человек, который прошёл первую часть, тут почувствует себя, как дома. Всё родное. Всё прекрасное. Всё такое же.\nНО уже больше....масштабнее и вразы интереснее.\nНас сразу бросают в омут с головой. Нас пугают и пугают основательно. Нас всё так же ведёт за собой в темноту неизвестную и дико мрачную пёсик.\nМы всё это уже видели и всё это уже ощущали. Но то была другая история, а это я рассказал первые часы геимплея. \nА остальное просто по умолчанию уже годное и прекрасное. \n(цена просто шикарная)\n(у меня был выбор - идти во вторую дэстини или в эту игру)\nвыбор слишком очевиден :D", "timestamp_created": 1508873895, "timestamp_updated": 1508873895, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.521381", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35972749": {"recommendationid": "35972749", "author": {"steamid": "76561198288955442", "num_games_owned": 91, "num_reviews": 2, "playtime_forever": 109, "playtime_last_two_weeks": 0, "last_played": 1509132666}, "language": "schinese", "review": "第一时间买了，接下来就是等中文了。\n先用自己差到顶点的日语来玩一下吧。\n\n\n\n玩了一下，然后发现了件事，之前看别人PS4玩是中文的，现在用日语一看，结果延续了上代的一个设定，就是主角年龄太小，只会用假名。\n\n而且按键也有点不习惯，看一下能不能改。\n\n主要这假名太难受了。", "timestamp_created": 1508869425, "timestamp_updated": 1508869425, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.497942", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35971915": {"recommendationid": "35971915", "author": {"steamid": "76561198075716367", "num_games_owned": 1585, "num_reviews": 23, "playtime_forever": 372, "playtime_last_two_weeks": 0, "last_played": 1509668239}, "language": "english", "review": "A pretty fun game with a nice cute atmosphere. I am a big chicken when it comes to playing horror games, but I powered through and made it relatively far for what I could. \n\nThere are some. . . enemies that are quite a pain and it felt like I was stuck hiding forever, but all in all I would easily recommend this game on a sale. As it stands I was lucky to get it from the devs themselves, but buying it for $30 is a bit much for me even if it is a better game than it's original (which I should hope it is)", "timestamp_created": 1508866646, "timestamp_updated": 1508866646, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.508970", "comment_count": "5", "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "35971808": {"recommendationid": "35971808", "author": {"steamid": "76561198040278434", "num_games_owned": 1847, "num_reviews": 54, "playtime_forever": 491, "playtime_last_two_weeks": 0, "last_played": 1508869221}, "language": "english", "review": "Who would win in a fight?\n> A little Girl, full of Bravery and vigor trying to find her bestest friend in the world\nOr\n>A Bunch of Spoopy Boiz?\n\nI have been playing the Beta for a good while now and I can say - this is one of the most Genuine horror experiences I have played in ages. It has everything from loveable characters, Spoops from start to finish, a WTF-Hook right at the start.\n\nAesthetics:\nThe games graphics look very pretty and crisp for the amount of Dark the game plays in. The Menus and Map are also kept in a very cutesy Picture Diary-esque manner. Like every Item is represented by a cute drawing and a very childlike description\n\nSound:\nMost of the time the game is very quired, save for Ambient noises and sometimes ghost noises. But all the sounds and music scraps that are playing really enhance the experience. \n\nGameplay: \nIts basic adventureish gameplay. You move in an isometric world and are able to pick up Items, collectibles or interact with your enviroment to make events happen or to help you progress. And heres where the horror factor sets in - You barely have anything to defend yourself. Certain Spirits will chase you down or otherwise try to get you killed while you have very little in terms of defense. You can hide in or behind certain objects to shake off some of the spirits but then again some might not be able to be shaken off. Luckily you can \"sense\" nearby spirits by your heartbeat. The louder it thumps, the closer one is. But this comes with its own set of problems - the faster your heart beats the faster you burn through your sprinting stamina and the less time you can actually try to gain ground on them.\n\nIs there anything bad?\n\nYeah, kinda. Some of the boss encounters tend to go very tediously or stretch for very long (Looking at you Chapter 7s Grabby Pokey Eyeball Dude). You also dont really get any explanation into what the useables do. and experimentation usually ends in your death and wasting Items that sometimes have a very low carry limit doesnt seem like the best idea.\n\nVerdict: Worth. Especially around Halloween, the season of spooks this is a great experience", "timestamp_created": 1508866321, "timestamp_updated": 1508866321, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.505842", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "35971482": {"recommendationid": "35971482", "author": {"steamid": "76561198268945764", "num_games_owned": 1654, "num_reviews": 5, "playtime_forever": 1125, "playtime_last_two_weeks": 0, "last_played": 1509406074}, "language": "english", "review": "Firstly I'd just like to say I highly recommend the game!\nEspecially if you are familiar with Yomawari Night\n(also a great game but not needed as story is different but great all the same)\n\nA great game just in time for Halloween!\nTrust me you will get the best out of this game playing in the dark with headphones on! \n(Also if you have family/friends home who will sneak up on you when you least expect it!\nMWAHAHAHA happened to me so many times, my goodness them sneaky ninjas)\n\nThe Pros:\n•Beautifully painted game graphics\n•Great sound effects & lighting mechanics really adds ambiance\n•Fun and suspenseful a real thriller \n•Gripping story filled with sadness, frustration and WTF moments\n\nThe Cons:\nI'd like to say none but...\n•Can be a bit tricky if not using items right\n•Having to constantly save or find a Jizo Statue to save is difficult \n when you keep dying and have to constantly go back  to where you died\n•Not enough Jizo Statues in Town\n•Can't redo story chapters or bosses after beaten\n•Only 1 save slot so you can't even go and replay earlier parts \n unless you start new game and do it all over again\n(They haven't learned any of the frustrations from the previous game it seems)\n\n♥NOTE♥ \nWhen you find an item near a save that is useful Save, pick up item, have a monster kill you nearby, \npick item up again, get killed and repeat till stock is up to max!! \nThen save again and resume your quest makes it a lot easier", "timestamp_created": 1508865347, "timestamp_updated": 1508865347, "voted_up": true, "votes_up": 9, "votes_funny": 1, "weighted_vote_score": "0.441433", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "35971371": {"recommendationid": "35971371", "author": {"steamid": "76561198077157970", "num_games_owned": 1321, "num_reviews": 97, "playtime_forever": 546, "playtime_last_two_weeks": 0, "last_played": 1508805299}, "language": "spanish", "review": " [h1] Yomawari: Midnight Shadows - Review [/h1] \n\nYomawari: Midnight Shadows poco y nada ha cambiado desde su entrega original, de tal forma que logra mantener el equilibro perfecto entre la inocencia y la malicia con personajes frágiles y un escenario despiadado. Una vez más encontramos una absoluta libertad de exploración con un intrincado diseño de escenarios que se abastece principalmente por retorcidas criaturas, por lo tanto, correr y esconderse entre los arbustos será la única defensa. \nDesafortunadamente peca de presentar Puzzles escuetos de una resolución simple y poco profunda. En cierta forma ha llegado un poco más casualizado de lo esperado, sin embargo esto no afecta en lo más mínimo su experiencia final. Midnight Shadows se caracteriza principalmente por entregar una ambientación inquietante y al mismo tiempo conmover con un cruel relato de terror oriental que pone en movimiento una encantadora pesadilla.\nEn definitiva, Midnight Shadows se mantiene fiel a sus raíces con la dosis justa de terror y locura. Una asignatura pendiente para todos los seguidores de los Survival Horror.\n\n[b]Para leer el análisis completo dirigirse al siguiente enlace:[/b]\n\n[url=https://pcindiemrace.com/2017/10/24/yomawari-midnight-shadows-review/] PC Indie Master Race [/url]", "timestamp_created": 1508864995, "timestamp_updated": 1508864995, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.629011", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "39320258": {"recommendationid": "39320258", "author": {"steamid": "76561198210073805", "num_games_owned": 47, "num_reviews": 1, "playtime_forever": 671, "playtime_last_two_weeks": 474, "last_played": 1515797973}, "language": "english", "review": "this game needs more atention than it gets, it has a beutiful art style and makes a really good atmosphere it has a good developed world and is very large, the gameplay can be a little complicated and some things are a little bit unfair but i think is part of the expirience and i really loved the story and the characters i really recomend it if you like a good horror game", "timestamp_created": 1515877151, "timestamp_updated": 1515877151, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39306060": {"recommendationid": "39306060", "author": {"steamid": "76561198108104422", "num_games_owned": 527, "num_reviews": 41, "playtime_forever": 634, "playtime_last_two_weeks": 634, "last_played": 1515658405}, "language": "schinese", "review": "[h1]纵使黎明不再到来，世界如此孤单。只要一想起和她永恒的约定，内心便不再害怕。[/h1]\n\n夜晚的小镇静的出奇，静到只能听见自己踢踏的脚步声，让我莫名有些害怕。突然闪过的妖怪伴随着巨大的尖叫把我吓得瘫坐在地上不知所措，等回过神来便拔腿就跑。但我只能在追逐中不断躲避，而且我体力并不好，跑不了多久便会需要休息一会儿。所幸的是，我能够躲进路边的草丛里，待它走近的时候心都提到了嗓子眼儿，直到它离开都不敢发出一丝声响。小镇到底是何时起有了这么多四处游走的鬼怪呢，我不知道，但是小唯还没有回家，这里这么危险，我一定要尽快找到她才行。于是我在小镇里四处乱转，分不清方向，为了防止遗忘，我用画笔将走过的道路画在了纸上。\n\n小镇里有各种鬼怪，第一次见的时候总是会忍不住害怕，有些怪伪装成物品躺在那里，一旦有光照到它就立刻朝我追了过来，着实吓了我一跳。有些怪反而不照着它便会飞快的靠近，于是我只能拿着手电筒四处驱赶它们。还有的妖怪甚至和我玩起了一二三木头人，只要我看着它就不会再动。因此，在见过它们几次后，我渐渐变得不再害怕，甚至还对一个妖怪喊出了这句话。我以为自己改变了，变得有所成长。但我所不知道的是，自己所做的这点程度的努力只不过是绝望中的挣扎。我仍旧在无人的夜里独自哭泣，在日记里写下无人聆听的思念。\n\n[h1]再一次相遇，却已是别离。述说着不愿放弃，却不得不松开缠绕住的羁绊。[/h1]\n\n最终，我明白了一切的真相，明白了是自己造就了这一切的开始，内心就变得悲痛万分。被这恶意的教程，被那蛊惑人心的指引摆了不止一道的感觉让人火大。带着这种愤怒，不甘和羞辱，我打败了最终boss，并终于找到了小唯，然而迎接我的却不是什么he，而是一个无法抉择的抉择。\n\n明明是很萌的画风，设定上却是恐怖的类型。明明剧情是固定的走向，却又偏要玩家来做出那个回答，像是被硬抓着手，让你亲自来造就这个结局，明明不是那样想，却又不得不那样做。究竟是怎样的恶意才能对玩家如此残忍，造就了一个开始，还要再造就一个结束。于是，在经历了近百次死亡的轮回，在付出了无数的血与泪，甚至斩断了原有的约定之后，得到的仍是注定的结局。\n\n故事的开始，面对那惨痛的事实，我觉得一定有什么能够改变。然而故事的结束，给予我的还是如同Be一样的绝望和悲伤。明明已经付出了那么多，到头来却还是什么都没有改变。悲剧总是这样，先给人以希望，最后又将希望给碾碎，让我深深体会到这无力的呐喊，无助的挣扎。当整部游戏唯一的一首bgm在结束时响起，回味起来只有失落和伤感，让我不愿意就这样去接受。而此时唯一能给予我温暖的，便是能够在隔壁的城镇找到前作的女主，她与自己有着相似的经历，不同的是她有一个美好的结局。虽然只是简短的几句寒暄，但也能感受到温暖的慰藉。\n\n[h1]转角的下一个路口，仍期盼着有你的身影[/h1]\n[list]\n[*]游戏虽是恐怖游戏，但与其他恐怖游戏不同，全程没有bgm，仅凭心跳声渲染紧张的氛围。吓人的地方也只有突然蹦出骇人的画面，并配以惊悚的音效这种程度而已，见多了做好心理准备就不足为惧。\n\n[*]游戏没有明确的路线指引，这可能会比较为难路痴，但通过特殊的事物以及妖怪的放置最终还是能引导玩家到正确的路线上。\n\n[*]主线剧情还算清晰明了，但是更多的细节仍需要通过收集物品，完成支线才能了解整个故事的全貌。主线的流程不长，不会超过十个小时。而由于玩法比较单调，收集繁琐，支线是否完成还要因人而异。\n\n[*]游戏最大的特色便是新手教程和剧情的相互结合，等到结局时才能明白制作组的用意，无不惊叹设计的巧妙。[strike]但这种巧妙又极为恶心，想必玩过的人都会感觉跟糊了一脸屎一样。[/strike] \n\n[*]本作相比前作在画面上有所提升，新增室内场景，存档优化等等，有不少进步。甚至还能去前作的小镇，这对于我，或者前的作粉丝来说都是个不小的惊喜。要说缺点的话，有些地方的层次感不强，看着像条路结果只是个山壁。\n[/list]\n\n[code]感谢[url=https://steamcommunity.com/id/AmazedXXXX]AmazedXXXX[/url]赠与的游戏以及[url=https://steamcommunity.com/groups/ProjectUP]UP鉴游组[/url]给予的评测机会\n\n[/code]", "timestamp_created": 1515843205, "timestamp_updated": 1515853430, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.567845", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "39188901": {"recommendationid": "39188901", "author": {"steamid": "76561198160868511", "num_games_owned": 573, "num_reviews": 353, "playtime_forever": 2563, "playtime_last_two_weeks": 2010, "last_played": 1515439264}, "language": "english", "review": "An impressive sequel to the already excellent first Yomawari,it features improved visuals an expanded gameplay with more depth,a huge world to explore and the great atmosphere that made the first game a truly memorable experience.", "timestamp_created": 1515437695, "timestamp_updated": 1515437695, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.536878", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39072741": {"recommendationid": "39072741", "author": {"steamid": "76561198305093826", "num_games_owned": 91, "num_reviews": 23, "playtime_forever": 915, "playtime_last_two_weeks": 0, "last_played": 1513871445}, "language": "schinese", "review": "虐妹又虐狗的剧情、伤感又温柔的BGM、可爱又可怕的鬼怪......\nemmmmmmm还是熟悉的味道，还是熟悉的日本一！\n\n【过了几年之后，\n   我还会想起\n   这个夏天发生的事情吗？\n   未来会变成怎样呢？\n   活着这件事让我感到很害怕。】", "timestamp_created": 1515127016, "timestamp_updated": 1515127016, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.566929", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39458633": {"recommendationid": "39458633", "author": {"steamid": "76561198122696228", "num_games_owned": 79, "num_reviews": 23, "playtime_forever": 471, "playtime_last_two_weeks": 59, "last_played": 1515252613}, "language": "schinese", "review": "如果你是一个恐怖游戏爱好者，这是一部不容错过的佳作。\n优点：\n1.流程长，画面质量高。\n2.怪种类多，高矮胖瘦，山珍海味，十八般武艺，八仙过海。\n3.boss战不长不短也不蠢。\n[strike]4.控制日本幼女还是两个[/strike]\n4.一人一狗。\n5.探索要素丰富。\n缺点：\n1.吃前作，你没玩过你对一些场景你可能根本不知道。（这里我对一位即使家都快被拆了仍旧尽职尽责的大仙说一声对不起，我初见真以为你就一只蜈蚣。）\n2.地图分割问题，这个玩到后面自然明白，我是不知道为什么制作组要把几张大地图分开。\n3.主菜单的音乐下次能不能改一下，贼吵。\n说一点自己玩后感（带有极强个人主义）：\n1.整个剧情其实没啥深度，但相比起现在其他恐怖游戏普遍不是弄得贼复杂花里胡哨让人感觉“我草牛逼“，就是仿佛制作组每一个人都在思考人类终极命题弄一个贼深奥的剧情让人感觉“我曹真牛“。这个游戏剧情我没有任何感慨，只有热泪盈眶。\n2.关于结局，我觉得，没必要太悲伤。就如寻梦环游记里面说的一样，人死了但他还在另一个世界活着，只要我们还记住他他就会一直活下去。到最后，即使两位好友阴阳相隔，但缘分，即使是神仙也无法斩断。（老哥我不是针对你不要把你剪刀张开谢谢）\n3.关于缘天尊，我觉得没必要吐槽他杀心看上去那么重了。别人就这个样子难不成你指望他帮你杀29个人啊。\n4.小广告[spoiler] https://space.bilibili.com/6607783?spm_id_from=333.338.viewbox_report.5#/\t[/spoiler]", "timestamp_created": 1516369260, "timestamp_updated": 1516370236, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.522059", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39585347": {"recommendationid": "39585347", "author": {"steamid": "76561198054873070", "num_games_owned": 85, "num_reviews": 1, "playtime_forever": 827, "playtime_last_two_weeks": 0, "last_played": 1509808326}, "language": "french", "review": "Yomawari Midnight Shadows, second épisode de la série Yomawari, reprend les bases de son prédécesseur, tous en ajoutant quelques fonctions. Le premier étant déjà fort sympathique, celui-ci est (pour moi) une merveille.\n\n-Style graphique à la fois mignon et glauque, un savant mélange qui, ma bien souvent jouer des tours, me sentant en sécurité là où il y avait danger et inversement.\n\n-Une ambiance oppressante à souhait, l'absence de musique, les bruits de pas, les râles de monstre, la résonance des endroits clos. Tout est fait pour vous sentir à la fois perdu et seul, surtout seul, terriblement SEUL !\n\n-Le gameplay, certes simple, mais efficace, nous contrôlons des petites filles, pas des personnages de shonen ou autres, ces actions limité renforce le sentiment d'impuissance de ces petites, contres un destin qui s'acharne sur elles. On marche, cours, se cache, ramasse des objets, les jettes.\n\n-L'histoire semble simple, toute tracée et bien trop prévisible, mais elle est pourtant pleine de surprise. J'ai, pour ma part, vraiment adoré, mais ne cherchez pas non plus quelque chose de fou, ce n'est pas le but de ce jeu !\n\n-Les environnements, la ville dans laquelle vous évoluerez vous semblera bien plus grande qu'elle ne l'est vraiment, certains passages dans des bâtiments et autres sont parfaits pour les claustrophobes et bien sûr, rempli de monstre avec un curieux sens de l'accueil.\n\n En conclusion, j'ai passé un très bon moment d'angoisse sur ce jeu, je le recommande vivement à tous les fans du premier et à ceux qui, comme moi, recherche une ambiance plutôt que de l'action dans un jeu d'horreur. J'attends un troisième Yomawari avec beaucoup d'impatience et j'espère que celui-ci marchera suffisamment pour que cela arrive.", "timestamp_created": 1516813363, "timestamp_updated": 1516813363, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39550368": {"recommendationid": "39550368", "author": {"steamid": "76561198138334952", "num_games_owned": 65, "num_reviews": 3, "playtime_forever": 1183, "playtime_last_two_weeks": 560, "last_played": 1516253478}, "language": "english", "review": "Great game, nice plot and characters, and lots of things to collect.", "timestamp_created": 1516686967, "timestamp_updated": 1516686967, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39532823": {"recommendationid": "39532823", "author": {"steamid": "76561198036319861", "num_games_owned": 128, "num_reviews": 6, "playtime_forever": 292, "playtime_last_two_weeks": 59, "last_played": 1516768698}, "language": "schinese", "review": "你看到我手上的塑料袋没？\n啪！", "timestamp_created": 1516621021, "timestamp_updated": 1516621021, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39608708": {"recommendationid": "39608708", "author": {"steamid": "76561198008528113", "num_games_owned": 192, "num_reviews": 1, "playtime_forever": 525, "playtime_last_two_weeks": 525, "last_played": 1516806949}, "language": "koreana", "review": "すごいゲーム。他にこのゲームを表現できるかわからない。。。次作を楽しみにしています。", "timestamp_created": 1516895815, "timestamp_updated": 1516895815, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "40904700": {"recommendationid": "40904700", "author": {"steamid": "76561198041992533", "num_games_owned": 166, "num_reviews": 2, "playtime_forever": 663, "playtime_last_two_weeks": 380, "last_played": 1521579217}, "language": "english", "review": "Like Yomawari Night Alone but with an improved story.", "timestamp_created": 1521397203, "timestamp_updated": 1521397203, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "40687277": {"recommendationid": "40687277", "author": {"steamid": "76561198005545584", "num_games_owned": 71, "num_reviews": 5, "playtime_forever": 446, "playtime_last_two_weeks": 0, "last_played": 1520099919}, "language": "schinese", "review": "游戏难度总体比第一代要低，但流程比第一代的长，收集要素也非常多~通关后还能去第一代的小镇探险非常有趣~", "timestamp_created": 1520613982, "timestamp_updated": 1520613982, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "40563773": {"recommendationid": "40563773", "author": {"steamid": "76561198188053522", "num_games_owned": 30, "num_reviews": 7, "playtime_forever": 779, "playtime_last_two_weeks": 0, "last_played": 1520271301}, "language": "schinese", "review": "玩到中间看到路上出现了猫...然后吸了起来...追猫比被奇怪的东西追爽多了！", "timestamp_created": 1520173560, "timestamp_updated": 1520173560, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "40530383": {"recommendationid": "40530383", "author": {"steamid": "76561198122386835", "num_games_owned": 57, "num_reviews": 4, "playtime_forever": 180, "playtime_last_two_weeks": 0, "last_played": 1511169509}, "language": "koreana", "review": "한글패치좀 ㅠ", "timestamp_created": 1520070502, "timestamp_updated": 1520070502, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "40412341": {"recommendationid": "40412341", "author": {"steamid": "76561198012310051", "num_games_owned": 155, "num_reviews": 21, "playtime_forever": 695, "playtime_last_two_weeks": 0, "last_played": 1513506134}, "language": "english", "review": "If you never played the first Yomawari or you didn't like its unfairness, the second one is the best place to start. \n\nIt is more polished, with a less tedious gameplay and more dynamic situations. The game is more accessible, without losing anything from the previous one. For example you can save at any checkpoint, not just at the end of each act. There are more locations to explore, a creepy plot and setting and a wide range of disturbing enemy. The game is quiet long compared with the original (~8 hours; 15 to do everything), with a lot secondary things to do. The game is not easy, with lot of difficult situations, but it is more polite in its design.\n\nThe problem is if you played the first Yomawari, because in that case you will have lot of deja-vú. Many enemies and also situations are completely recycled from the previous game. However this is just a part, because the majority of the game is original and innovative. Especially the final boss deserve an applause, both in term of design and gameplay.\n\nThe game is a beautiful and dark fairytale, with an amazing atmosphere and a nice sense of exploration. The price is a bit exaggerated, maybe wait a bit and buy when is in discount, you will not regret it. \n(Version played: Beta)", "timestamp_created": 1519643851, "timestamp_updated": 1519643851, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "40173907": {"recommendationid": "40173907", "author": {"steamid": "76561198134515533", "num_games_owned": 19, "num_reviews": 2, "playtime_forever": 817, "playtime_last_two_weeks": 0, "last_played": 1510530120}, "language": "russian", "review": "Отличное продолжение первой части. Как и в первой части, смысл почти один и тот же - поиск человека. Добавили новых врагов и анимацию волос.\n\nВ общем, 10 искалеченных девочек из 10!", "timestamp_created": 1518910882, "timestamp_updated": 1518910882, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "40117722": {"recommendationid": "40117722", "author": {"steamid": "76561198085617995", "num_games_owned": 487, "num_reviews": 31, "playtime_forever": 89, "playtime_last_two_weeks": 71, "last_played": 1521654534}, "language": "schinese", "review": "发售前就特别期待，趁psn打折200多rmb入手，玩到通关觉得超出预期的游戏。为了那一首ost只好又来steam买一遍。", "timestamp_created": 1518759553, "timestamp_updated": 1518759553, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.563758", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39737100": {"recommendationid": "39737100", "author": {"steamid": "76561198107594026", "num_games_owned": 71, "num_reviews": 8, "playtime_forever": 672, "playtime_last_two_weeks": 0, "last_played": 1510588647}, "language": "koreana", "review": "전작보다는 연출이나 그래픽이 좋아진것같다.\n이번에도 놀라운 튜토리얼에 입이 안다물어진다.\n전작의 주인공이 살던 마을로 갈 수 있는것에 감동받아 추천을 박는다.\n\n스토리구성은 말해봤자 입아프고 이번에도 유사공포게임은 못벗어난것같다.\n아직도 고양이마리오 마냥 곳곳에 배치해놓은 귀신 피해가기 바쁜게임.\n\n그냥 도전과제랑 게임 컨텐츠인 수집품이나 모으며 놀도록 하자.", "timestamp_created": 1517354336, "timestamp_updated": 1517356386, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}}
