{"reviews": {"38998354": {"recommendationid": "38998354", "author": {"steamid": "76561198331344255", "num_games_owned": 29, "num_reviews": 5, "playtime_forever": 179, "playtime_last_two_weeks": 6, "last_played": 1516404194}, "language": "english", "review": "Maggie's Apartment is pretty darn good. Like, damn, it's really good. First of all, it's got great characters, and the water color paintings for the characters and background suit the world so well. Not to mention, it's got great music! Along with that, it's a great Point 'n Click, with many puzzles, amazing dialouge, and a great ending! I would recommend this game to anybody that appreciates art, music, drama, and Love Robots. A solid 8/10!", "timestamp_created": 1514952161, "timestamp_updated": 1514952161, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38967939": {"recommendationid": "38967939", "author": {"steamid": "76561198158634088", "num_games_owned": 193, "num_reviews": 35, "playtime_forever": 196, "playtime_last_two_weeks": 0, "last_played": 1514887864}, "language": "schinese", "review": "手绘解谜， 曲折的剧情， 原声。\n\n这是一个非常好的小游戏\n\n8.5/10", "timestamp_created": 1514887970, "timestamp_updated": 1514887970, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38396172": {"recommendationid": "38396172", "author": {"steamid": "76561198201587254", "num_games_owned": 11, "num_reviews": 1, "playtime_forever": 191, "playtime_last_two_weeks": 0, "last_played": 1513590203}, "language": "english", "review": "Anatola's work has always been a massive inspiration for be during my growth as an artist. When I heard that they had created a game which would utilize the elements of their art/animation style, I was estatic! I had been well aware of their talent for character design, their funky style of animation, and their incredible way of creating such beautiful, intricate, colorful backgrounds! For the longest time, I wasn't able to buy the game and kept myself from spoilers as much as I could. I kept my ground and pushed through, until I was finally able to purchase the game today!\n\nWithout a doubt, it was well worth the wait. For such a short, simple, little game, it brought me so much emotion and enjoyment. Each character, though given small interactions with Maggie, has their own diverse personality and uniqueness! I fell absolutely in love with these characters! They're all so varied in design, dialogue, story. It's pretty amazing! The background design is just as beautiful as I hoped it would be. All of the fractals of color within each background stuck out to me a lot! I love the care put into it all! I love the way each piece of the game fits together into something so humorous and charming. Figuring out each piece of the puzzle was so fun and honestly scary at times!! I felt so mant emotions for Maggie's struggle, as well as Beauty's....hell...even Dunc's! It was an incredible experience all around and I highly recommend it to anyone who enjoys well written characters, story, and gorgeous artistry! \n\nI'd also highly recommend this game to anyone who has experiences with trauma or abuse? As silly as it may seem, this game and its story provided a lot of comfort for me as someone who has been through many experiences with abuse/sexual harrassment/manipulation/or otherwise. It's a very comforting, loving story with so much care and so much humor, so much turmoil and so much struggle. I couldn't ask for a better game from 'Tola. Keep 'em coming, bud! Your stuff is one in a million!! \n\n<3", "timestamp_created": 1513591087, "timestamp_updated": 1513591087, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38289607": {"recommendationid": "38289607", "author": {"steamid": "76561198141829182", "num_games_owned": 40, "num_reviews": 3, "playtime_forever": 2015, "playtime_last_two_weeks": 0, "last_played": 1512963074}, "language": "english", "review": "i was expecting a simple point and click like anatola howard's other games and was pleasantly surprised with OH MY GOD AMAZING", "timestamp_created": 1513203787, "timestamp_updated": 1513203787, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "38129313": {"recommendationid": "38129313", "author": {"steamid": "76561198047425587", "num_games_owned": 209, "num_reviews": 7, "playtime_forever": 189, "playtime_last_two_weeks": 0, "last_played": 1512317580}, "language": "english", "review": "something about vore", "timestamp_created": 1512655018, "timestamp_updated": 1512655018, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36819067": {"recommendationid": "36819067", "author": {"steamid": "76561198072557122", "num_games_owned": 92, "num_reviews": 1, "playtime_forever": 197, "playtime_last_two_weeks": 0, "last_played": 1502452118}, "language": "english", "review": "Short but satisfying. Plot-wise and visual-wise - a little work of art.\n\nAlso well-done game of this format - puzzles aren't too easy but also a player doesn't stuck (at least I haven't).\n\nBe warned though - a lot of the game is centered around a girl and her admiration for her boyfriend so if you're not into romance then...", "timestamp_created": 1511386755, "timestamp_updated": 1511386755, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36676534": {"recommendationid": "36676534", "author": {"steamid": "76561198260443534", "num_games_owned": 165, "num_reviews": 1, "playtime_forever": 56, "playtime_last_two_weeks": 0, "last_played": 1511238039}, "language": "english", "review": "IDK man the story and puzzles and shit were good but I mostly just bought the game because the protagonist is rly hot. So if you have a thing for short, plump, socially awkward in a cute way gals I would reccomend this game to you.", "timestamp_created": 1511274205, "timestamp_updated": 1511274205, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36220954": {"recommendationid": "36220954", "author": {"steamid": "76561198061981262", "num_games_owned": 85, "num_reviews": 1, "playtime_forever": 284, "playtime_last_two_weeks": 0, "last_played": 1509638768}, "language": "english", "review": "An enjoyable ride. Time well spent.", "timestamp_created": 1509639832, "timestamp_updated": 1509639832, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35938034": {"recommendationid": "35938034", "author": {"steamid": "76561198024994537", "num_games_owned": 126, "num_reviews": 16, "playtime_forever": 172, "playtime_last_two_weeks": 0, "last_played": 1508735515}, "language": "english", "review": "This game is a work of art. Well worth the money for its superb writing and voice acting. Well worth the time to see it through to the end. There are some things I may never understand about the turn of the plot or the characters' motivations. I'm glad I got to play it, though.", "timestamp_created": 1508736096, "timestamp_updated": 1508736096, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35821449": {"recommendationid": "35821449", "author": {"steamid": "76561198025636120", "num_games_owned": 62, "num_reviews": 2, "playtime_forever": 124, "playtime_last_two_weeks": 0, "last_played": 1501696170}, "language": "english", "review": "Very sweet, lovely soundscape and characters.", "timestamp_created": 1508343169, "timestamp_updated": 1508343169, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35171062": {"recommendationid": "35171062", "author": {"steamid": "76561198250581104", "num_games_owned": 84, "num_reviews": 1, "playtime_forever": 178, "playtime_last_two_weeks": 0, "last_played": 1507263065}, "language": "english", "review": "I would recommend maggie's apartment. I love the story, the art style is beautiful, abd I love the music too.You will love the charcters as well.I would like to see more games of the developer.", "timestamp_created": 1506229050, "timestamp_updated": 1506300359, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35007177": {"recommendationid": "35007177", "author": {"steamid": "76561197985139708", "num_games_owned": 210, "num_reviews": 1, "playtime_forever": 202, "playtime_last_two_weeks": 0, "last_played": 1505272213}, "language": "english", "review": "A small scale point and click mystery game, with a unique art style, but more importantly a story that will enthrall you through in-game conversations  with good writing and good voice acting.\n\nThis is a short story, disguised as a 4 screen point and click mystery adventure, that is actually a series of conversations with characters you don't even see in-game. But let me tell you why it's so good.\n\nAs a game, the puzzles are mostly simple and make sense. You have no inventory so it's a very streamlined experience. The bulk of the game is conversations with Maggie's neighbors, which are done through the thin walls of her apartment, so you don't see most of them visually. However, the conversations are where the game shines. The neighbors, despite being a voice on the other side of a wall, all come off as fleshed out people, they feel real. The quality of the writing and voice acting was my favorite part of this game. I was honestly impressed by what I thought was a low-budget indie-game. And grew to like several of the characters, which I also think is the mark of good writing.\n\nTo speak to sound design, as someone who lives in New York City, and played this game with headphones, I had to take my headphones off a few times to check if the sounds I was hearing where in-game, or outside my own apartment building. The credits page is 2 screens long, and the second page is sound licensing, so if you want a true big-city sound experience, this game does it the best I've ever heard. The goofy sound effects are fun, but the real city noises I did have trouble distingusing from in-game, or the real city outside my own window.\n\nYou are sometimes given dialog path decisions to determine the other character's opinion of Maggie. Though I feel the scope of the game requires only one true path through the game, I still enjoyed the occasional \"I agree\", \"No you're wrong!\" option, and it makes me consider a second play-through to see what would happen if I picked other options. Again, the conversations are the strong point, so I would want to hear more of them. I also enjoyed the prerogative this game has that this binary decision isn't \"good\" or \"bad\" and more \"what would advance the plot\" so you are sometimes forced into picking what would normally be \"bad\" because you know it's the only way the story would make sense. Which is a nice diversion from the triple-A \"moral\" games, which get on my nerves, and I enjoyed the dedication to story in this game.\n\nAs stated before, the game is short, it took me a little over 2 hours to get from beginning to end. But it is very much a mystery story. Throughout the game they hint at what the conclusion could be, and I drew my own conclusions based on the clues, and while I was close, the ending took me by surprise. And I very much enjoyed not only the ending to the story, but the the plot wrap-up where everything was completely explained by the information already given, which I think is the mark of a good mystery story.\n\n\nWatch the trailer, the last quarter is actual gameplay, it'll give you a sense of the animation and visual quality. But the bulk of the game is in story telling, and character development that is really the quality of this game. The single conversation the trailer shows with a character is so limited, and that's really the game's strength. It's a fun mystery, lead by conversations, and I think the trailer relies too much on the artistic style, which ends up being a small part of the experience.\n\nI enjoyed my time with Maggie, and would reccomend it to others.", "timestamp_created": 1505595854, "timestamp_updated": 1505682678, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34945839": {"recommendationid": "34945839", "author": {"steamid": "76561198067543686", "num_games_owned": 24, "num_reviews": 1, "playtime_forever": 77, "playtime_last_two_weeks": 0, "last_played": 1505331819}, "language": "english", "review": "I'm just gonna start with some complaining to get it out of the way, but trust me, if I didn't like this game, I wouldn't bother to write this.\n\nFirst, the tone is kind of all over the place. One minute I'm cackling at a cactus elaborately dissing the sun, the other it's the genuinely tragic story about lies, manipulation and attempted murder. \n\nDidn't really get why we had to painstakingly give the police guy four bottles one by one and watch him drink each of it. I thought that maybe it was going to be a plotpoint later, like Randy gets angry that you gave away X beer bottles, but nope?\n\nBeauty's voiceacting sounds a little too bored and emotionless. It's cute in small doses, but she has to dramatically narrate at the end a lot. I really enjoyed Shrimp and Cheesey's voices, though.\n\nI'm also still confused whether Beauty and Dunc are the actual inhabitants of this world, or Maggie just imagined herself some friends. I mean, Randy knew about Beauty's existence, but all the other characters we see look humanoid.\n\nAside from that, I really like the artwork (hell, I basically bought the game because of it), and the characters are fun and likeable. The bit with the cop and the pirated music made me laugh out loud.\n\nI love that this game has a retro feeling to it. It's like I'm playing some old point-and-click adventure from the classic era, I have a huge soft spot for that.\n\nAlso, I gotta say, it would've been really easy to ridicule a fat girl who watches TV in her undies all day and gushes about her flamboyant husbando, but the game just lovingly pokes fun at her, and I respect that.\n\nAs someone who also tried developing games in a team of two people, I kinda admire the way you managed to cut so many corners. The game takes place in one room, you never see most of the characters you talk to, the major plotpoint is described over the radio, the main character is a simplified white blob that's easy to animate, the other two major characters are just a cactus and a radish... And I don't mean it in a bad way, since a) the game is short enough so that you don't get tired of it b) the voiceacting adds more character to the people we can't see c) it's claustrophobic, but it fits Maggie, who doesn't go out much and just focuses on her boyfriend. It's so cleverly low-budget, it's impressive.\n\nOverall, a cute little experience. Can't say I didn't have fun. Kudos to you guys.", "timestamp_created": 1505384561, "timestamp_updated": 1505507204, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502240", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34872735": {"recommendationid": "34872735", "author": {"steamid": "76561198009301811", "num_games_owned": 192, "num_reviews": 28, "playtime_forever": 152, "playtime_last_two_weeks": 0, "last_played": 1505079995}, "language": "english", "review": "Maggie's Apartment is one of the best written point and click adventures I have played.  Its fantastic visuals and simple yet satisfying game play make this a must have.\n\nThe artwork and animation are visually stunning.  Character movements are not programmed sprite sliding around on the screen but rather fully animated natural movements.  Maggie bounces, shakes and shimmies at every interaction.  There are few backgrounds, but this is to the effect of the creative design.  But the backgrounds that are included feel lived in and characterize Maggie and her world.\n\nThe game play mechanics are a simplified form of point and click. The entire game takes place in Maggie’s apartment. Her only interactions are to her house plants and her neighbors through the walls. You would think this would make the game feel small and restrictive, but it doesn’t, there is a lot to learn talking to the walls.  Further, Maggie cannot pick up any items. Instead you drag items as the lay in her apartment to what you want to interact with.  This works really well, since you never leave the apartment, it is very intuitive and lets Maggie assemble the mess she lives in.  The game play is simple and revolves around the concept of discovery.  It is not so much as puzzling out how to do something but discovering solutions.\n\nVoice acting in the game was brilliant as well.  Characters were well developed and every voice personified them perfectly.  No phoned in acting here, accents (albeit cartoonish) were well done and unique to the characters. Even the sound engineering was spot on.  Voices were muffled in a way that made you feel like you were listening through walls.  Moreover, the radio in the apartment played music which doubled as the menu to control sound in the game (clever).\n\nMaggie’s Apartment is fine example of excellent writing.  Maggie is deeply flawed and incredibly endearing.  For the entire story, Maggie is mostly naked and exposed, while in the supposed safety of her apartment. In contrast the private and intimate lives of those around her seep through the walls easily.  Even outside Maggie’s apartment the game makes a point to show that everything going on around is completely exposed. These concepts re-enforce the revelation of the truth. And, without spoiling the game to much, its conclusion is wonderful. The dialogue is engrossing and with every revelation I was eager to learn more.  Plotting and theme are creative and build an argument that has very real truth to it. Put simply, this game is written splendidly.\n\nMaggie's Apartment scores perfect tens on all counts. Art and animation were lively, voice acting and music where brilliant, and the game play was simple yet fun. But the star of the show was the well written story. Honestly, there are so many reasons to recommend this game it is difficult to count.\n", "timestamp_created": 1505083836, "timestamp_updated": 1505083836, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500473", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34714214": {"recommendationid": "34714214", "author": {"steamid": "76561198048789701", "num_games_owned": 80, "num_reviews": 1, "playtime_forever": 172, "playtime_last_two_weeks": 0, "last_played": 1504405510}, "language": "english", "review": "As someone who has adored Howard's artwork and previous freeware game releases, I was extremely excited when the trailer for Maggie's Apartment was released, and eagerly waited for the official release of the game. Now that I've played it, would I say that my hype was deserved? Yes, absolutely.\n\nMaggie's Apartment is a wonderful game, and it feels like a love letter to the kind of wonder and excitement that 90s point-and-click games held back in their heydey, and especially the charm of the Humongous Entertainment games. The animation style, while largely minimal, does exactly what it needs to, and combined with the offbeat character designs feels charming and friendly to look at. The warmth of the visuals also provides an interesting contrast to the sorrows of the plot, but you'll have to find out exactly how for yourself. The writing and voicework for the game is also top-notch, as every character's voice and dialogue feels completely natural to them, and the writing feels clever without being smarmy or annoying.\n\nThe game is not without its flaws, but I'd say largely they're the kind of flaws that the majority of point-and-click games suffer from. Figuring out how to progress can be baffling and require solutions that are hard to logically reach unless you remember the old point-and-click gameplay standby of \"examine everything, try to combine every object with every other object, exhaust every dialogue choice\". The minimalist animation style, while charming, also means that during some of the conversations (and some of them go on for QUITE a while, as some characters love to talk about nothing in order to cover up the SOMETHING that's the real issue they're having) there's not a lot to look at, and I found myself looking away from the game during these points, which felt like a crime, because it IS a very beautiful game.\n\nIf you're a point-and-click fan, or someone who loves to play games for character intriuge, or who loves the look of hand-drawn animation, I'd absolutely recommend the game. I would not recommend it for kids (unless you got some weird kids) because as charming as the style is, the game deals with some fairly dark concepts here and there, and the ending is fairly intense. Overall though, it's a game I'm still thinking about and feel strongly affectionate for, even if it took me far too long to get around to finishing it.", "timestamp_created": 1504451701, "timestamp_updated": 1504451701, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502262", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34381099": {"recommendationid": "34381099", "author": {"steamid": "76561198024736135", "num_games_owned": 95, "num_reviews": 1, "playtime_forever": 116, "playtime_last_two_weeks": 0, "last_played": 1503258400}, "language": "english", "review": "Great point and click game. A nice way to spend a sunday morning. A fantastic job was done all around with the art, songs, and voice acting.", "timestamp_created": 1503258942, "timestamp_updated": 1503258942, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34301626": {"recommendationid": "34301626", "author": {"steamid": "76561198011444268", "num_games_owned": 188, "num_reviews": 2, "playtime_forever": 109, "playtime_last_two_weeks": 0, "last_played": 1502953932}, "language": "english", "review": "Beautiful art and soulful voice acting really bring together this short but delightful experience. There were a couple of moments of \"point and click logic\" but nothing that slowed me down too much. \nIf you want a little mystery game to tickle your mind then this is for you and I hope to see more from this team. <3", "timestamp_created": 1502954416, "timestamp_updated": 1502954416, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34276137": {"recommendationid": "34276137", "author": {"steamid": "76561198001237605", "num_games_owned": 40, "num_reviews": 1, "playtime_forever": 158, "playtime_last_two_weeks": 0, "last_played": 1502889587}, "language": "english", "review": "A short, satisfying game with fantastic visuals and an intense story. The downside is that it's quite short; I finished in 2.6 hours. The upside is that there isn't a wasted moment in the whole game.", "timestamp_created": 1502889821, "timestamp_updated": 1502889821, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34269673": {"recommendationid": "34269673", "author": {"steamid": "76561198080179215", "num_games_owned": 122, "num_reviews": 4, "playtime_forever": 158, "playtime_last_two_weeks": 0, "last_played": 1502859502}, "language": "english", "review": "I couldn't help but play this game in one sitting. It was funny and charming. The art is so nice and the voices even better. Every single thing about this game has so much character, ESPECIALLY little Maggie. We all know what it's like to be in a situation where you're blinded by love, and this game took it to the extreme in such a simple, almost silly way. Even the \"serious\" stuff about this game is funny, but the point still gets across. Maggie was, of course, the main reason this game was so dang good. She's a cute, short, chubby girl who is WAY too lost in her hopeless romantic outlook, just like me! It was honestly a bit humbling to see a character so much like myself in a story like this. I feel wonderful after playing this, because I really feel like I UNDERSTAND what Maggie goes through. It's not just a surface-level conflict, even if it is a bit SILLY of a conflict.\n\nIn short, this game was fantastic. If I was playing it with no distractions, I'm a bit convinced I would've cried at least a little near the end, especially since I know pain like what Maggie experiences. Good music, good art, good jokes, everything was wonderful! I want to be sad it was so short, but I feel like it would've overstayed it's welcome otherwise.\n\nFor anyone looking to play a short, silly, and strangely thought-provoking game, Maggie's Apartment is perfect for you.", "timestamp_created": 1502860132, "timestamp_updated": 1502860132, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.498339", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34244586": {"recommendationid": "34244586", "author": {"steamid": "76561198055222756", "num_games_owned": 176, "num_reviews": 14, "playtime_forever": 208, "playtime_last_two_weeks": 0, "last_played": 1502748527}, "language": "english", "review": "Its pretty good but, it should be mentioned that you have to drag objects to other objects to actually progress. It makes sense for a point and click, but its never mentioned that you can actually grab objects. Other than that though, the game's got charm and I definitely recommend checking it out, even if you're not a fan of point and click adventures.", "timestamp_created": 1502748945, "timestamp_updated": 1502748945, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.507610", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34208148": {"recommendationid": "34208148", "author": {"steamid": "76561198068817861", "num_games_owned": 126, "num_reviews": 40, "playtime_forever": 220, "playtime_last_two_weeks": 0, "last_played": 1502577647}, "language": "english", "review": "Lovely game!\nAs a point-and-click admirer, and a long-running gamer when it comes to the genre, I am always looking for good titles to enjoy. Most of the times, the games claim to be oh-so-great, but end-up being oh-so-abysmal. \nMaggie's Apartment is exactly the opposite - the game makers claim ot have created a fun small game. And that's exactly what they did.\n\nI am not sure the topic or the plot would be as enjoyable for the male audience as it would be for the female, but come on - who hasn't had a near-stupid crush on a celebrity? \n\nThe game is fun and full of puns and jokes. Exactly what the trailer suggests. 3-4 hours filled with loveliness. Not to mention the way Maggie moves around. I adore the way she looks. Such a cute thing!\n\nHope you make more games like this one. I would definitely follow your careers, guys :)", "timestamp_created": 1502609261, "timestamp_updated": 1502609261, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34175722": {"recommendationid": "34175722", "author": {"steamid": "76561198014527083", "num_games_owned": 855, "num_reviews": 12, "playtime_forever": 151, "playtime_last_two_weeks": 0, "last_played": 1502480857}, "language": "english", "review": "A short and beautiful game with some wonderful voice acing and even better artwork.\n\nThis whole game from every little aspect feels so lovingly rendered and humble in its exicution.\n\nIf you have an afternoon to kill and want a point and click that isnt your normal insanity of clicking everything with everything else, try Maggie's Apartment.", "timestamp_created": 1502481180, "timestamp_updated": 1502481180, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34163874": {"recommendationid": "34163874", "author": {"steamid": "76561198400954878", "num_games_owned": 6, "num_reviews": 1, "playtime_forever": 119, "playtime_last_two_weeks": 0, "last_played": 1502440910}, "language": "english", "review": "FANTASTIC GAME!!!! The art is absolutely gorgeous and the story keeps you on edge, I couldn't wait to figure out the mystery and I was not dissapointed. All the characters were well fleshed out and fun to talk to, and the items were easy to interact with, while the puzzles were still challenging enough to make you think through things. I can't wait to play it again!!! (also the music and voice acting was hella good, 10/10)", "timestamp_created": 1502440769, "timestamp_updated": 1502440769, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34160353": {"recommendationid": "34160353", "author": {"steamid": "76561198253793207", "num_games_owned": 58, "num_reviews": 4, "playtime_forever": 116, "playtime_last_two_weeks": 0, "last_played": 1503201965}, "language": "english", "review": "This game was really nice, it was good to see a fat female mc for a change. The story was a trip too, I didn't expect it to do what it did at all. character designs overall are cute but the one for Randy is great. Voice acting is pretty cute too. I just love the feel of the game, the environments and animation style are really charming", "timestamp_created": 1502422731, "timestamp_updated": 1502422731, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.646530", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34147214": {"recommendationid": "34147214", "author": {"steamid": "76561198057751457", "num_games_owned": 33, "num_reviews": 1, "playtime_forever": 332, "playtime_last_two_weeks": 0, "last_played": 1502337062}, "language": "english", "review": "This is a beautiful and all around charming game. Point N' Click games were the first games I ever played as a kid and my god I didn't realize how much I missed this genre until I played Maggie's Apartment. This game is funny and cute, but it's also very much a mystery story and can be ominous when it wants to be. \n\nThe animations are lumbering and have a weight to them that make them a joy to watch. The character designs are gorgeous (the pillow-y Maggie and the spindly Randy were my favorites!) and the voice acting is great. This is a short game with an intimate story that is relatively small in scope, but it is so dense with content and attention to detail that you will come out of this experience feeling totally satisfied. It is a wonderful game and well worth the price tag! \n\nI can't recommend this game enough.", "timestamp_created": 1502373891, "timestamp_updated": 1502373891, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34140200": {"recommendationid": "34140200", "author": {"steamid": "76561198071672678", "num_games_owned": 19, "num_reviews": 1, "playtime_forever": 218, "playtime_last_two_weeks": 0, "last_played": 1507690318}, "language": "english", "review": "A great mystery with rich characters and a story you can get invested in. gameplay is simple without being boring. also ive had most of the soundtrack stuck in my head all day!", "timestamp_created": 1502346778, "timestamp_updated": 1502346778, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34132376": {"recommendationid": "34132376", "author": {"steamid": "76561198408958276", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 329, "playtime_last_two_weeks": 0, "last_played": 1502563148}, "language": "english", "review": "Really liked this game! The art is amazing, the music is stunning, the plot twists are unexpected!\nI was glad to sink inside this little bizarre world of Maggie's apartment\n", "timestamp_created": 1502310279, "timestamp_updated": 1502310279, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34116938": {"recommendationid": "34116938", "author": {"steamid": "76561198061724811", "num_games_owned": 113, "num_reviews": 2, "playtime_forever": 179, "playtime_last_two_weeks": 0, "last_played": 1502248076}, "language": "english", "review": "What a great point and click game. Figuring things out was fun and the story and characters were really interesting.\n\nI did get stuck a little bit on some points, but not enough to need a walkthrough.  And it was short, but the good-content-per-second ratio makes this worth my time.", "timestamp_created": 1502249219, "timestamp_updated": 1502249219, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34114552": {"recommendationid": "34114552", "author": {"steamid": "76561198013994193", "num_games_owned": 29, "num_reviews": 7, "playtime_forever": 147, "playtime_last_two_weeks": 0, "last_played": 1503151000}, "language": "english", "review": "As with most great indie games, the only downside to this game is you end up wishing there was more of it! If you're already used to solving point-and-click adventure type puzzles, you probably won't get a long playthrough out of this. Personally I finished in about two hours, but I plan to play again so that I can try and get every possible dialogue option since I bypassed  quite a few by accidentally picking the right answer too soon. But the story is full of surprises, the characters are charming, and the art is very fun to look at.\n\nYou're in for an emotional ride with this game and all I can say is it's best to go in completely blind so that you can get the full impact of all of the twists and turns. I'll definitely buy any more games put out by these developers in the future.", "timestamp_created": 1502236695, "timestamp_updated": 1502236695, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34111963": {"recommendationid": "34111963", "author": {"steamid": "76561198064909636", "num_games_owned": 22, "num_reviews": 1, "playtime_forever": 146, "playtime_last_two_weeks": 0, "last_played": 1502211632}, "language": "english", "review": "i Love this game! Anatola Howard is such an amazing artist, and theres always such an interesting and unique feel about all of her work. I loved 4 Lung Boy too, Such a good weird feeling. this game is an excellent little story that's just full of characters with so much character, the voice acting is EXCELLENT, the animations are all so quirky and cute, and the puzzles are fun to solve but not troubling. Really got a good pajama sam vibe from it all. \n\nthanks so much for making such a good and cool game! it's really inspiring!", "timestamp_created": 1502226291, "timestamp_updated": 1502226291, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34100769": {"recommendationid": "34100769", "author": {"steamid": "76561198299622827", "num_games_owned": 3, "num_reviews": 1, "playtime_forever": 152, "playtime_last_two_weeks": 0, "last_played": 1502187715}, "language": "english", "review": "I have never written a review, but I felt like I needed to for this game. The story is well-paced, the characters and environment are illustrated wonderfully, the soundtrack and voice-acting was some of the best I've heard in a while. It was reminiscent of old point-and-click games I played as a kid, but still original and fresh. Please play this game.", "timestamp_created": 1502189523, "timestamp_updated": 1502189523, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34096783": {"recommendationid": "34096783", "author": {"steamid": "76561198151633495", "num_games_owned": 51, "num_reviews": 1, "playtime_forever": 234, "playtime_last_two_weeks": 0, "last_played": 1502170031}, "language": "english", "review": "Maggie's Apartment is such a nice refreshing game with a colorful cast of characters and such interesting art style. With the game's lighthearted style the dark undertones were much more impactful. While the game is relatively short the story was just so good that I wouldn't mind replaying it again. If you are interested in charming art and a great story this game is for you!", "timestamp_created": 1502172691, "timestamp_updated": 1502172691, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34090364": {"recommendationid": "34090364", "author": {"steamid": "76561198096856475", "num_games_owned": 175, "num_reviews": 4, "playtime_forever": 470, "playtime_last_two_weeks": 0, "last_played": 1502142165}, "language": "english", "review": "As you can see above, I played it really slow and enjoyed everything in it. (2x now)\nIt's a shame that it's so short; but for what it is... it's really good!\nA really nice story, with very important themes, told in a light hearted humorous way.\nCan't wait for the next game!", "timestamp_created": 1502142634, "timestamp_updated": 1502142634, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502712", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34089236": {"recommendationid": "34089236", "author": {"steamid": "76561198410922384", "num_games_owned": 1, "num_reviews": 1, "playtime_forever": 75, "playtime_last_two_weeks": 0, "last_played": 1502082861}, "language": "english", "review": "I just finished playing and I absolutely loved it!!! The art/animation/plot/characters were so good! \nI seriously recommend this game!", "timestamp_created": 1502138382, "timestamp_updated": 1502138382, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.457048", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34084370": {"recommendationid": "34084370", "author": {"steamid": "76561198043062196", "num_games_owned": 122, "num_reviews": 15, "playtime_forever": 128, "playtime_last_two_weeks": 0, "last_played": 1502120152}, "language": "english", "review": "This game gives me hope that point and click games - specifically, good ones - are still far from dead. It's everything I would want from a good adventure game - lovable characters, wonderfully weird art direction, quality voice acting, logic puzzles that won't drive you to the point of frustration, and writing that can be both laugh-out-loud funny and sharply emotional. While it lasts only a couple hours, I felt more than satisfied after seeing the story through to its conclusion. As someone who loves adventure games, I would definitely put this on a \"must play\" list.", "timestamp_created": 1502121138, "timestamp_updated": 1502121138, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34073699": {"recommendationid": "34073699", "author": {"steamid": "76561198069063619", "num_games_owned": 72, "num_reviews": 1, "playtime_forever": 181, "playtime_last_two_weeks": 0, "last_played": 1502075420}, "language": "english", "review": "Been looking forward to playing this game since the artist first announced it! It held up to my expectations and was beautiful. The stories intriguing and i had a lot of fun playing it with my friend! its pretty good.", "timestamp_created": 1502075966, "timestamp_updated": 1502075966, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34073231": {"recommendationid": "34073231", "author": {"steamid": "76561198018686466", "num_games_owned": 524, "num_reviews": 89, "playtime_forever": 11, "playtime_last_two_weeks": 0, "last_played": 1502072520}, "language": "english", "review": "I had nothing but problems trying to play this game so I gave up on it. I've played many point&click games but it's been a while since I found one this annoying in terms of technical issues. Once you start a new game, I could not find any way to access the menu again to quit (nor save progress). Since there's no game menu available, I was forced to quit by killing the process/task - but this game does not like to be minimized so this always resulted in crashing my machine temporarily along with the game (which of course didn't save any progress). It also seems like the cut scenes aren't skippable which made it a bit annoying to start over again with the same problems waiting for me. On top of that, changing from windowed mode to fullscreen left the game running in the same size as the initial window but with black filling in the edges to make up the full screen. Not worth my time.", "timestamp_created": 1502073153, "timestamp_updated": 1502073153, "voted_up": false, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.418270", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34072748": {"recommendationid": "34072748", "author": {"steamid": "76561197983359608", "num_games_owned": 823, "num_reviews": 105, "playtime_forever": 176, "playtime_last_two_weeks": 0, "last_played": 1502070604}, "language": "english", "review": "It's pretty good.", "timestamp_created": 1502070617, "timestamp_updated": 1502070617, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.467836", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34055927": {"recommendationid": "34055927", "author": {"steamid": "76561198262004601", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 196, "playtime_last_two_weeks": 0, "last_played": 1501764052}, "language": "english", "review": "There's something refreshing about Maggie's Apartment that I can't quite put my finger on.\n\nSomething that's important to know going in is that it's a very small, self-contained story. It feels like you're learning just as much about Maggie and her relationships as you are about the mystery. I'm not going to spoil what happens, but the game definitely has some interesting commentary on celebrity culture and idolization.\n\nI really like the art style in this. It has kind of an 80's quality to it, for lack of a better description. Lots of highly-saturated colors and dramatic, rubbery character designs reminiscent of the work of Craig McCracken or David Feiss (the person who animated this is a Calarts student if you couldn't already tell). I dig the designs of Rascal and Randy in particular- they're both very funny and memorable. I know it's not a huge deal for point n' click games to be hand-animated, but I think it's honorable here nonetheless, especially given how much care is given when it comes to basic movements, like climbing onto a couch.\n\nAs with many point n' click adventure games, Maggie's Apartment can be a little cryptic sometimes- there are points where you have to exhaust every single character's dialogue options (sometimes multiple times) to advance the plot. Keep that in mind particularly when talking to Rascal. The game also doesn't explain this right away, but instead of having an inventory, you just click and drag objects in the room to other objects. Sometimes both objects are move-able, and sometimes only one, like when objects need to interact with the window or the Randy poster. \n\nI was kind of hoping the game would have some branching paths, but it appears to be a series of puzzles based around a linear, predetermined path. This is honestly fine by me- it's a game made by a couple of art students, not programmers. Play this game for the art, the story, and the comedy, but it's probably not what you want if you're looking for a challenge.", "timestamp_created": 1502010532, "timestamp_updated": 1502010532, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.509804", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34054246": {"recommendationid": "34054246", "author": {"steamid": "76561198040633020", "num_games_owned": 6, "num_reviews": 1, "playtime_forever": 330, "playtime_last_two_weeks": 0, "last_played": 1501999769}, "language": "english", "review": "My favorite part of this game was meeting these colorful characters and peering a little into their lives. I can only wish there had been more of that. The beginning was a bit frustrating gameplay wise since I was unaware of one of the mechanics of the game and the controls weren't listed anywhere. Otherwise a straight forward and engaging adventure game with great voice work and awesome artwork. I can't wait to replay it so I can enjoy it again while understanding everything that went down.", "timestamp_created": 1502003053, "timestamp_updated": 1502003053, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34053101": {"recommendationid": "34053101", "author": {"steamid": "76561198400711895", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 158, "playtime_last_two_weeks": 0, "last_played": 1501995235}, "language": "english", "review": "Maggie's apartment is a beautiful game, with unique animation, unusual characters, wonderful music, and quite the mystery to solve. I have always enjoyed the point and click genre, it brings me back to my childhood with old edutainment games. This is a game I spent my Saturday night playing, and its a game that I will probably return to another Saturday night, which is a rarity for me. I highly recommend Maggie's Apartment.", "timestamp_created": 1501997128, "timestamp_updated": 1501997128, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34047895": {"recommendationid": "34047895", "author": {"steamid": "76561198405171724", "num_games_owned": 3, "num_reviews": 1, "playtime_forever": 527, "playtime_last_two_weeks": 0, "last_played": 1512513343}, "language": "english", "review": "such a beautiful game, by such an amazing artist, I've already played through it three times  not only for the great storyline, but just to stare at all the beautiful art!!!", "timestamp_created": 1501972477, "timestamp_updated": 1501972477, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34032404": {"recommendationid": "34032404", "author": {"steamid": "76561198005551156", "num_games_owned": 158, "num_reviews": 6, "playtime_forever": 185, "playtime_last_two_weeks": 0, "last_played": 1501916892}, "language": "english", "review": "Maggie's Apartment is short and sweet, and will appeal to fans of the genre as well as anybody who appreciates games with a beautifully unique art style. The voice acting is extremely charming, the humor never feels forced, and above all Maggie's Apartment feels like a labour of love.\n\nThe puzzles might be a bit simple for veterans of the point and click genre, but they all work logically (and don't require any annoying pixel hunts).\n\nOverall: Recommended", "timestamp_created": 1501917720, "timestamp_updated": 1501917720, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34030796": {"recommendationid": "34030796", "author": {"steamid": "76561198034188563", "num_games_owned": 120, "num_reviews": 2, "playtime_forever": 946, "playtime_last_two_weeks": 0, "last_played": 1501908559}, "language": "english", "review": "I'm not too familiar with the artist so I'm a bit of an outsider here, although I believe the lead artists are students so I assume this is a student project; but this game popped up on my feed and on occasion I like to take a chance with off-beat, unusual point and clicks. It's a genre with a lot of very interesting experiments.\n\nThis is a quirky, charming, extremely experimental little game that revolves around a neat twist. The artstyle is simplistic but has a kind of old style caricature comic strip charm to it. There's a few inconsistencies with the animation, but It's pretty obvious this was done on a student's budget so it's perfectly excusable and the personality of the protagonist in all of her little actions makes up for it. The game also has a kind of dark sense of humor, but it's subdued and doesn't overdo it.\n\nAs it is a priced release, I do have to point a few things out though. Even by point and click standards, some clues and overall the progression of events the player must trigger to move things forward can be especially vague. The ability to actually drag items isn't really even hinted and I only discovered it after fanatical clicks on the screen by accident. There's a minor glitch involving the mini fridge becoming unclickable (that has an easy fix as stated on the hub. Nonetheless though, I gotta note it.). The game crashed a few times when accessing the menu for me as well.\n\nFinally, in the \"not bad not good\" notes territory...the game is quite short. Not necessarily a negative, as the game is obviously a bit of an experiment and short and to the point can be a big plus. However aspects of the story, keeping things as vague as possible in order to avoid spoilers, go unresolved by the end. The game concludes its main plot well enough, but there's a certain something big that isn't really explained. I can only assume it's meant to be interpretive, but it might leave some confused as there isn't really even much in way of hint as to what to make of said detail.\n\nAll and all though, it's an interesting little experimental scene of a game. A part of me does wish it were a bit longer perhaps, but that's kind of a good thing to. Just know that it is just that, an experiment. I might say as well that  for the type of game it is and the short length...it might be a bit overpriced, however it's certainly not a purchase I regret. If you like quirky little experiments once in a while and have your expectations in perspective, I'd give it a go.", "timestamp_created": 1501910331, "timestamp_updated": 1501911079, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34028425": {"recommendationid": "34028425", "author": {"steamid": "76561198199789389", "num_games_owned": 64, "num_reviews": 3, "playtime_forever": 246, "playtime_last_two_weeks": 0, "last_played": 1501898910}, "language": "english", "review": "I'm not usually a fan of point-and-click kinds of games, but Maggie's cute! I wish I could just hug her and intensely squeeze her! <3 Though a lot of the art feels like a series of storyboards, especially since the animations for any given scene loop through 3 different frames. This makes the overall drawing feel like it could benefit from more polish. At least it's not like you'd make the game unwinnable at any point, but I did get stuck once. I definitely like the emotion of the characters, although I have no idea why the raddish wants to be eaten so badly (or why her audio quality sounds mildly tinny to me). That's never explained clearly (at least to my understanding). I love how blinded by love Maggie is, especially [spoiler]with how casually (dare I say upbeat) she mentions buying CO2 canisters for her boyfriend.[/spoiler] That made me giggle.\n\nOverall, it's short but cute.", "timestamp_created": 1501899556, "timestamp_updated": 1501899556, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34027401": {"recommendationid": "34027401", "author": {"steamid": "76561198065184732", "num_games_owned": 39, "num_reviews": 1, "playtime_forever": 214, "playtime_last_two_weeks": 0, "last_played": 1501894172}, "language": "english", "review": "Wow, what a game! It's beautiful, clever, and unique. The police officer was my favorite, in voice acting and in character design. I also really enjoyed being dropped into this limited space to explore and learn about the context of the world.", "timestamp_created": 1501894694, "timestamp_updated": 1501894694, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34025025": {"recommendationid": "34025025", "author": {"steamid": "76561198185387234", "num_games_owned": 203, "num_reviews": 4, "playtime_forever": 255, "playtime_last_two_weeks": 0, "last_played": 1501807889}, "language": "english", "review": "This is a fantastic point and click game made by Antola Howard. There are many things in this game that will catch your attention and keep it. Wether it be the art style, animation, voice acting, music, or even the story, you will be entranced the entire playthrough. Indie game of the year contender for sure.", "timestamp_created": 1501884623, "timestamp_updated": 1501884623, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34024348": {"recommendationid": "34024348", "author": {"steamid": "76561198000617329", "num_games_owned": 110, "num_reviews": 2, "playtime_forever": 334, "playtime_last_two_weeks": 0, "last_played": 1501893163}, "language": "english", "review": "+charming and unique visuals (cops got dem fine legs)\n+Fantastic story\n+Catchy original songs\n\n-Actual puzzles are lacking\n\nFell in love with the artstyle almost immedietly, some people may say the animation choppy but I think adds to the games overall charm and you quickly get used to it (Maggie's lil floppin around animations are adorable). Voice acting is suprisingly well done for a tiny indie game like this, although you never see some the characters you talk to they were all memorable with well written dialogue. \n\nUnfortunately the puzzles suffered from moonlogic, alot of the time I just solved them by randomly guessing. Like I put the Isaac Newton head  outside and had no idea why I needed to, and it turns out it was for something much later on. Maybe if there was another earlier puzzle that gave the player a reason to think to move it (like maybe Maggie finds out there was somthing hidden behind it) that may work better. \n\nBut that dosen't matter too much if the story kept me invested enough to wanna find out what happens next, may not be the best point n cick but the story and visuals more than make up for it.", "timestamp_created": 1501881772, "timestamp_updated": 1501881876, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34023845": {"recommendationid": "34023845", "author": {"steamid": "76561197970497753", "num_games_owned": 185, "num_reviews": 1, "playtime_forever": 153, "playtime_last_two_weeks": 0, "last_played": 1506572219}, "language": "english", "review": "Absolutely gorgeous game. All of the art is a pleasure to look at, and the story grabbed me tight. It's short, but the amount of work and care that went into it is clear in every single second. I got super emotionally invested, I'm still thinking about it after finishing it, and the price tag is definitely worth it - especially when you consider all of the artwork present in this game. I was worried the voice acting might be a bit hammy, but it was actually really endearing! I hit a few snags of awkward adventure game logic, and there's definitely a few places where if you talk to someone in the wrong order, it can confuse you. It's not an excuse, but fortunately since the whole game takes place on a total of 4 screens, trying to brute force something is at least not too hard or time consuming. Anyway, great game, would play again, probably will, wonderful art and animation, great story.", "timestamp_created": 1501879939, "timestamp_updated": 1501879939, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34022591": {"recommendationid": "34022591", "author": {"steamid": "76561198203621708", "num_games_owned": 62, "num_reviews": 1, "playtime_forever": 160, "playtime_last_two_weeks": 0, "last_played": 1501879712}, "language": "english", "review": "Maggie's Apartment is a short experience (I'm notoriously poor at point-and-clicks and still beat it in 2 hours) but damn if it doesn't pack a lot into that short time. Stylish, brilliantly funny, unique and dripping with charm.", "timestamp_created": 1501875533, "timestamp_updated": 1501875533, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34020299": {"recommendationid": "34020299", "author": {"steamid": "76561198099898193", "num_games_owned": 67, "num_reviews": 1, "playtime_forever": 189, "playtime_last_two_weeks": 0, "last_played": 1501682844}, "language": "english", "review": "delightfull story, wonderfull art, and some pretty great puzzles. its an all around pretty awesome experince!", "timestamp_created": 1501867392, "timestamp_updated": 1501867392, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34020226": {"recommendationid": "34020226", "author": {"steamid": "76561198236557594", "num_games_owned": 44, "num_reviews": 2, "playtime_forever": 134, "playtime_last_two_weeks": 0, "last_played": 1501795288}, "language": "english", "review": "So good, the artwork was amazing and reminded me of a show I used to watch (cant think of the name.) The couple next door literally had me dying laughing, and the characters were all interesting in unique ways which was so nice. Only complaint is that it was wayyyy to short for a game that's $9.99. I hope they add more in the form of a dlc or something.", "timestamp_created": 1501867147, "timestamp_updated": 1501867147, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34019650": {"recommendationid": "34019650", "author": {"steamid": "76561198750784329", "num_games_owned": 1, "num_reviews": 1, "playtime_forever": 208, "playtime_last_two_weeks": 0, "last_played": 1501808593}, "language": "english", "review": "Worth it for the amazing visuals and voice acting alone. I felt so inspired while playing this. While I did get stuck a couple times, it was still fun to explore Maggie's world with its own unique logic. I definitely recommend if you're a fan of quirky animation and stories.", "timestamp_created": 1501865160, "timestamp_updated": 1501865160, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34015312": {"recommendationid": "34015312", "author": {"steamid": "76561198301985029", "num_games_owned": 9, "num_reviews": 1, "playtime_forever": 255, "playtime_last_two_weeks": 0, "last_played": 1501850260}, "language": "english", "review": "I remember seeing a bit of early artwork and animation for this game a while back and was instantly intrigued and honestly the final product was well worth the wait! The design is beautiful and the voice acting really makes you feel for characters that you can and can't see throughout the game. I thought the story struck a great balance between being hilarious and touching.\n\nMy only criticism is how tricky it is to realise that you can drag objects around on-screen to interact with other things. I kept trying to drag items while Maggie was examining them instead of doing this in Maggie's 'apartment overview.' Fortunately another reviewer posted about this which helped me immensely!\n\nAll-in-all a beautiful game which I was delighted to play! Thank you so much for Maggie's Apartment!", "timestamp_created": 1501850879, "timestamp_updated": 1501850879, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34010021": {"recommendationid": "34010021", "author": {"steamid": "76561198004116871", "num_games_owned": 307, "num_reviews": 4, "playtime_forever": 242, "playtime_last_two_weeks": 0, "last_played": 1501829127}, "language": "english", "review": "Good: Art!\nBad: I think all I enjoyed was the visual art...\n\nPlain and simple didn't have a story I enjoyed. If you feel like you're really never hinging on story writing, or you're super open minded and want to wing it... don't even keep reading this review. Just buy it when you feel the price is right. As for me... I had some suspension of disbelief, but it quickly spiraled away with events that made little to no sense. I figure I wasn't this game's target audience, and I base that on how the game goes from being silly to serious as a heart attack... and I sort of only value serious material I can connect with. If you're asking me to value characters, I need empathy. Without that, it's easier just to go to reddit and look at pet gifs... just as much clicking, just as random, and no real struggle with random calls back to adult life and its misery.\n\nI think you can give this game a fair shake for the art, which is great. But I had hoped for more than just the visuals. I kind of wanted to feel connected. I respect a lot of the other folks that liked this story, so feel free to disagree. I've just played a lot of different point-and-click games, and could very well be the snob here. If it wasn't for the art, I'd be asking for my money back.\n\nI ended up not finishing the story (I am pretty sure I was two clicks away, but it was just too frustrating)... and while I can't describe where I stopped, I'm sure you'll know it when you hit it and think \"So, this is supposed to be tragic? Or interesting? Why do I feel like I've lost time from my life I can't get back...\"\n\nIf I do go back to the game, it'll be to pull the graphics out...", "timestamp_created": 1501830804, "timestamp_updated": 1501830804, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.490980", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34002632": {"recommendationid": "34002632", "author": {"steamid": "76561198061787400", "num_games_owned": 34, "num_reviews": 2, "playtime_forever": 134, "playtime_last_two_weeks": 0, "last_played": 1501796363}, "language": "english", "review": "Really cute and sweet game. Finished it in ~2 hours.\n\nUhhhh ending actually shocked me as I didnt expect something like that to happen in this lil cutie of games. Voice acting and sound was top ! \n\nOnly real crit would be that sometimes it was hard to hear the other people(as theyre not in the same room as you most times), but that isnt too bad as the whole game is subbed. Real goofy at times too so real fun ! The other one would be that it feels real short but what can you expect from a point and click. On the plus side, the story is real solid tooooo. :)", "timestamp_created": 1501796781, "timestamp_updated": 1501796781, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33998861": {"recommendationid": "33998861", "author": {"steamid": "76561198043294565", "num_games_owned": 155, "num_reviews": 1, "playtime_forever": 194, "playtime_last_two_weeks": 0, "last_played": 1501737217}, "language": "english", "review": "A fun point and click game that left me wanting more. If you like talking eye patch wearing radishes, you'll like this game.", "timestamp_created": 1501784843, "timestamp_updated": 1501784843, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33997281": {"recommendationid": "33997281", "author": {"steamid": "76561198060470057", "num_games_owned": 199, "num_reviews": 14, "playtime_forever": 144, "playtime_last_two_weeks": 0, "last_played": 1501702159}, "language": "english", "review": "There were a few things about this game that irked me. The transitions to get outside took a while, I got lost once or twice because I couldn't find the right thing to click on and some of the puzzles were teetering on moon logic. But overall, I think this game knows what it is, and manages to play to its strengths.\n\nMaggie's Apartment is a short single room point and click. It gets in, tells a story it has to tell and gets out. Do I wish it was a little bit longer? Yes. Am I happy with the time I got with the game? Also yes. The opening cinematic does, as other reviews put it, use great use of cinematography to establish the mood of this story.\n\nSo I'm going to reccomend you give this game a try. The art is beautful, the voice acting is fun, and the story is interesting and revealed in such away that it will keep you guessing all the while.", "timestamp_created": 1501780033, "timestamp_updated": 1501780033, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33997080": {"recommendationid": "33997080", "author": {"steamid": "76561198001112993", "num_games_owned": 48, "num_reviews": 1, "playtime_forever": 147, "playtime_last_two_weeks": 0, "last_played": 1501654301}, "language": "english", "review": "It was a very cute game! The art style was charming as well as the characters in them. Truth be told, I thought the game would be a lil different from what I had seen about it in the past, but still it was great! This is the kinda game I can just go back to playing from time to time to just chill and have some lighthearted fun, thanks for the hardwork!", "timestamp_created": 1501779456, "timestamp_updated": 1501779456, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33990514": {"recommendationid": "33990514", "author": {"steamid": "76561198013334338", "num_games_owned": 233, "num_reviews": 2, "playtime_forever": 472, "playtime_last_two_weeks": 0, "last_played": 1501795862}, "language": "english", "review": "Maggie's Apartment is Anatola Howard's (a.k.a. Maroon Racoon's) first commercial game project. When examined alongside her previous free games, Pen Palz and 4 Lung Boy, Maggie's Apartment is both similar in nature and noticably more developed than either of them.\n\nThis is a game that wants you to have a certain experience inside the safety of a video game; an experience that, if you've ever had it in real life, you will know might well be one of the hardest things to go through/make someone else go through there is. And every single element of this game's narrative and plot is drenched in metaphor and foreshadowing towards its ultimate goals: Empathy, and understanding.\n\nNot only charming and, at points, hilariously written and voice-acted, Maggie's Apartment is an incredibly smart and thought-provoking game. The art is extremely detailed and the designs are wonderfully imaginative. Every character has a unique voice (both in writing and acting) and many will stick with you for a long time.\n\nDespite only being about 3 and a half hours in length, Maggie's Apartment is adventure gaming bliss. You owe it to yourself to check it out.", "timestamp_created": 1501759801, "timestamp_updated": 1501759801, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33987986": {"recommendationid": "33987986", "author": {"steamid": "76561198058909151", "num_games_owned": 34, "num_reviews": 2, "playtime_forever": 216, "playtime_last_two_weeks": 0, "last_played": 1501749000}, "language": "english", "review": "Delicious homegrown raw organic, non GMO, artisinal point and click adventure game. \n\nA really fun and unique style soaks through every inch of this little game. The characters and animations and songs and dialogue are so wacky and fun. \n\n There's something unique and nostalgic here that you can't possibly get from design by committee. You can tell that there's a strong singular voice at work behind the scenes on this game and I can't wait to see what they do next.", "timestamp_created": 1501749963, "timestamp_updated": 1501749963, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33987353": {"recommendationid": "33987353", "author": {"steamid": "76561198224776100", "num_games_owned": 58, "num_reviews": 1, "playtime_forever": 256, "playtime_last_two_weeks": 0, "last_played": 1505552685}, "language": "english", "review": "Wow, what a fantastic, wild ride. I genuinely loved the story, characters and artwork, and the puzzles were fun too (although there were a few places I got stuck, or spots I didn't realize I could click on.) \nAll in all, Maggie's Apartment left a real impact on me, and I'm very curious about what happened to the characters after the events of the game. Although it was a relatively short playthrough, you get very attached to Maggie and her friends and neighbors through their charming dialogue and superb voice acting. \nI really can't recommend this game enough if you're a fan of point n' click adventures and have a taste for mystery.", "timestamp_created": 1501746921, "timestamp_updated": 1501746921, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.543568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33987168": {"recommendationid": "33987168", "author": {"steamid": "76561198014273968", "num_games_owned": 261, "num_reviews": 8, "playtime_forever": 191, "playtime_last_two_weeks": 0, "last_played": 1501744452}, "language": "english", "review": "Maggie's Apartment is a point & click adventure game that roughly took me about 3 hours to finish from start to finish. Throughout the story, you meet a variety of colorful characters, most of them non-human. The dialogue itself if wonderful, and the jokes throughout the game are clever, silly, and downright smart. I am a sucker for good dialogue, so this game was an honest treat.\nThe story itself is very cute, and at the same time, kind of heart-wrenching towards the end. The game, however, relies on point-and-click and some puzzle solving to progress the story. I am not fond of point & click games, but I love a good puzzle. This game had a nice blend of the two, and I was invested enough in the story to get past the point-and-click aspect of the game. The difficulty is also not too hard. There are some spots that had me stumped for a little while, but I was able to progress through trial and error. Some parts were a little confusing, and the first real obstacle was finding out you can drag items to make them interact with other objects and such.\nThe art style is interesting but unique. I loved Maggie's design and the general art direction of the game. The sound effects and movement of the characters were perfect, and it didn't take away from the story or immersion at all. The animation is a bit choppy, but once you get used to it after a few minutes of playing, you really start to appreciate the style. There were a few instances, however, where the sound felt out of place or too low. This is not a serious problem and is easily overlooked.\n\nOverall, I highly recommend this game to anyone that's a fan of adventure, point & click, or just a good story in general.\n10/10, would get emotional over a radish again.", "timestamp_created": 1501745967, "timestamp_updated": 1501745967, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33984600": {"recommendationid": "33984600", "author": {"steamid": "76561198052457456", "num_games_owned": 124, "num_reviews": 1, "playtime_forever": 171, "playtime_last_two_weeks": 0, "last_played": 1501730063}, "language": "english", "review": "A lovely gem of a game, and one that nails a very peculiar note of cheerful uneasiness so skillfully. Hope to see more from the creator in the future, we coul use more art like this.", "timestamp_created": 1501731973, "timestamp_updated": 1501731973, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33984531": {"recommendationid": "33984531", "author": {"steamid": "76561198094432643", "num_games_owned": 188, "num_reviews": 71, "playtime_forever": 197, "playtime_last_two_weeks": 0, "last_played": 1501730799}, "language": "english", "review": "Maggie's Apartment is a cute point-and-click mystery taking place effectively in one room (well, one and a half). The main draw is the animation, which is reminiscent of the old MTV's Liquid Television shorts. The main drawback is it's rather short--not really a surprise, since everything takes place in one room.\n\nA few other negatives:\n- the puzzles are a little moon-logicky, even if they kinda make sense in this story's context\n- suspending disbelief NOT that the walls are paper-thin, but that the neighbours are available to hear and talk to you when you need them (and it's hard to hear them when they DO talk to you... believable, but annoying)\n- the endgame timing isn't clear (I thought the game locked up, but no--just wait)\n- why did I have to eat her =(\n\nOn the whole, though, I think it's worth playing once, if only because I find Dunc and Beauty to have pleasant voices. Definitely would like to see a similar title in the future (sequel??) in this style.", "timestamp_created": 1501731720, "timestamp_updated": 1501731720, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33981251": {"recommendationid": "33981251", "author": {"steamid": "76561198046066080", "num_games_owned": 55, "num_reviews": 1, "playtime_forever": 165, "playtime_last_two_weeks": 0, "last_played": 1501711382}, "language": "english", "review": "There's so much packed into this little game! Gorgeous art, charming characters, and a captivating story, which all makes for an extremely satisfying experience.", "timestamp_created": 1501715302, "timestamp_updated": 1501715302, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33981141": {"recommendationid": "33981141", "author": {"steamid": "76561198125734148", "num_games_owned": 37, "num_reviews": 2, "playtime_forever": 195, "playtime_last_two_weeks": 0, "last_played": 1503624878}, "language": "english", "review": "this was not that bad. It really could have been longer. I was still waiting on an explanation on why Maggie had to eat Beauty. (Spoiler) Nice little Indie Game though. Dont get your hopes up to high though if getting this.They story was a little interesting. Unique art style. liked it. Not bad, but not great.", "timestamp_created": 1501714809, "timestamp_updated": 1501714809, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.324232", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33980975": {"recommendationid": "33980975", "author": {"steamid": "76561198121517538", "num_games_owned": 14, "num_reviews": 2, "playtime_forever": 234, "playtime_last_two_weeks": 0, "last_played": 1501694314}, "language": "english", "review": "I LOVED this game! Wonderful story, memorable characters, and a great soundtrack.  You can tell a lot of love went into this project. Definitely check it out :)", "timestamp_created": 1501714129, "timestamp_updated": 1501714129, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33980656": {"recommendationid": "33980656", "author": {"steamid": "76561198131427108", "num_games_owned": 35, "num_reviews": 1, "playtime_forever": 369, "playtime_last_two_weeks": 0, "last_played": 1505025670}, "language": "english", "review": "Love this!\n\nBeautifully told story, great voice acting, great characters, great world. I don't know what I was expecting but the story blew me away as everything unfolded. It's a short game but it's truly a gem! Highly recommend.", "timestamp_created": 1501712840, "timestamp_updated": 1501712840, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33977498": {"recommendationid": "33977498", "author": {"steamid": "76561198081119341", "num_games_owned": 53, "num_reviews": 2, "playtime_forever": 146, "playtime_last_two_weeks": 0, "last_played": 1501700992}, "language": "english", "review": "this game was way more than i expected. i bought it for its animation and art which i adore, but its an amazing story and gameplay experience. i dont think i could have expected such a compelling and slightly dark story from as cute and cartoony game as this.\n\ntheres a sense of satisfaction in figuring out the problems and puzzles throughout the game and i was shocked putting together piece after piece until they all came together in the end. and admittedly i almost cried at a few points\n\ngreat characters, great art, great animation, great story, great puzzles, please play this amazing game", "timestamp_created": 1501701569, "timestamp_updated": 1501701569, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33974687": {"recommendationid": "33974687", "author": {"steamid": "76561198098438809", "num_games_owned": 237, "num_reviews": 2, "playtime_forever": 116, "playtime_last_two_weeks": 0, "last_played": 1501699193}, "language": "english", "review": "I've played many point & click games in my life, but this one, in particular, made me feel something that the others did not. Great story with a hugable protagonist. This story and game honestly caught me off guard at times and is something that I won't forget anytime soon. This game has my recommendation.", "timestamp_created": 1501691983, "timestamp_updated": 1501691983, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33970529": {"recommendationid": "33970529", "author": {"steamid": "76561197966867869", "num_games_owned": 266, "num_reviews": 2, "playtime_forever": 141, "playtime_last_two_weeks": 0, "last_played": 1501676696}, "language": "english", "review": "A memorable, lushly animated, surprisingly dark and claustrophobic classic li'l adventure game. Why isn't this on the front page. Steam is broken.", "timestamp_created": 1501678883, "timestamp_updated": 1501678883, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.540255", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33966062": {"recommendationid": "33966062", "author": {"steamid": "76561198012772088", "num_games_owned": 569, "num_reviews": 4, "playtime_forever": 144, "playtime_last_two_weeks": 0, "last_played": 1501729763}, "language": "english", "review": "Just play this game now. It's worth it.", "timestamp_created": 1501661400, "timestamp_updated": 1501661400, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.496183", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33963772": {"recommendationid": "33963772", "author": {"steamid": "76561198046567684", "num_games_owned": 88, "num_reviews": 2, "playtime_forever": 214, "playtime_last_two_weeks": 0, "last_played": 1501649204}, "language": "english", "review": "A quick game, but it is packed with charm, memorable characters, and an interesting story. I got stumped on a few parts, but there wasn't anything too taxing on the mind. I strongly recommend this game to anyone, not just fans of PNC games!\n\nNever forget Officer Rascal.", "timestamp_created": 1501649574, "timestamp_updated": 1501649574, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33963360": {"recommendationid": "33963360", "author": {"steamid": "76561198071971781", "num_games_owned": 33, "num_reviews": 2, "playtime_forever": 258, "playtime_last_two_weeks": 0, "last_played": 1501702636}, "language": "english", "review": "The art and animation for this game is just jaw-dropping. The dialogue is intriguing and the voice acting is hecking top notch. The storyline is really goofy, and cute, and bizarre; the whole game just had a really solid dreamy aesthetic to it.", "timestamp_created": 1501647471, "timestamp_updated": 1501647471, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33963328": {"recommendationid": "33963328", "author": {"steamid": "76561198030202818", "num_games_owned": 215, "num_reviews": 11, "playtime_forever": 127, "playtime_last_two_weeks": 0, "last_played": 1501646835}, "language": "english", "review": "THIS IS A FANTASTIC AND INTRIGUING POINT-AND-CLICK-ADVENTURE GAME FEATURING:\n\n- absolutely wonderful visuals\n- a fantastic soundtrack\n- a superb cast of characters\n\nI HAD A BLAST WITH IT AND I HAVE A GUT FEELING THAT YOU WILL TO.\n\nI AM VERY SATISFIED.\n\n", "timestamp_created": 1501647312, "timestamp_updated": 1501647312, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33963048": {"recommendationid": "33963048", "author": {"steamid": "76561198066957420", "num_games_owned": 60, "num_reviews": 12, "playtime_forever": 504, "playtime_last_two_weeks": 0, "last_played": 1501810610}, "language": "english", "review": "i was excited for maggie's apartment like little else after playing [url=https://denzquix.itch.io/4-lung-boy]4 lung boy[/url], an adventure game about being young and socially uncomfortable made by anatola for a game jam (it is also FREE, please check it out) and i was not disappointed. i got the same feeling playing this as i remember playing strange edutainment games as a kid.  the EXCELLENT (as always) animation and artwork goes a long way to bringing me there, along with your talking plant buddies and your neighbors who are somehow weirder as people. there's a playfulness and sweetness to it that makes the more mature themes all the more emotionally pointed. maggie's apartment is further proof that we're really lucky anatola howard decided to make video games.\n\ngot stuck a couple times but still enjoyed myself. just remember to click on the ceiling floor and walls often to hear new things from people, and you should be ok i think.", "timestamp_created": 1501646051, "timestamp_updated": 1501646051, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.507995", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33962716": {"recommendationid": "33962716", "author": {"steamid": "76561198066980367", "num_games_owned": 36, "num_reviews": 3, "playtime_forever": 232, "playtime_last_two_weeks": 0, "last_played": 1501643971}, "language": "english", "review": "It is a short story point and click game, but with a satisfying and invested story. Not to mention that it is accompanied with its charming artstyle to suit it. I can't say much about it since it would be spoilers. But all I can say is, it is not what anyone would expect at all. If you want a surprising and eventful story, go for this. \n\nI just finished playing it, and am like. \"WHOA, PHOO. WOW.\"\n\nIt is something that you just have to play it yourself and experience.", "timestamp_created": 1501644340, "timestamp_updated": 1501644340, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33962406": {"recommendationid": "33962406", "author": {"steamid": "76561198043785114", "num_games_owned": 44, "num_reviews": 1, "playtime_forever": 169, "playtime_last_two_weeks": 0, "last_played": 1501642627}, "language": "english", "review": "Stunning art, captivating story and fun characters A+", "timestamp_created": 1501642705, "timestamp_updated": 1501642705, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33960994": {"recommendationid": "33960994", "author": {"steamid": "76561198042752791", "num_games_owned": 61, "num_reviews": 4, "playtime_forever": 156, "playtime_last_two_weeks": 0, "last_played": 1501638676}, "language": "english", "review": "Never thought I'd ship a radish and marshmallow together. \n\nHonestly wasn't sure what I expected when I bought the game, but it definitely wasn't this. Cute game, and it'll probably catch you off guard. Worth a playthrough.", "timestamp_created": 1501635802, "timestamp_updated": 1501635802, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33960980": {"recommendationid": "33960980", "author": {"steamid": "76561198157487910", "num_games_owned": 72, "num_reviews": 1, "playtime_forever": 227, "playtime_last_two_weeks": 0, "last_played": 1502281043}, "language": "english", "review": "Maggie's apartment is not just simply a point and click but more of an experience,fine art in the form of a game,and a mini interactive movie with heavy cinematography elements all in one! \n\nA carefully crafted masterpiece of a story that hides under cute and charming silly visual humour, symbolism,sexual innuendos. only to trick you so that it can grab onto your chest and punch the wind out of you until you feel what it wants you to feel. This is not your average point and click and is not afraid of going dark and realistic.\n\nThis game is not going to be your parent and safe guard you from serious adult themes, though at the same time it will also present those dark themes in a humour filled way. The contrast of quirky cartoony character designs on a base of very realistic mature story is what makes this whole game even more interesting look/commentary into human behaviour especially the more darker parts of it like emotional manipulation,obsession,emotional comforts, destructive fantasising, denial of reality. \n\nThis games ending left me speechless overly emotional and to the point of tears almost...\neverything about this game is filled with the contrast of humour and melancholy which gives a bittersweet vibe from the mid point up until the end.\n\nAnatola Howard has truly made something special here and it really shows! it was worth every bit of the wait to experience such a powerful moving story presented with such flare and charm. Definitly going in my top 10 favourite games list I enjoyed every second of this and can't wait to see what Anatola makes next after this!", "timestamp_created": 1501635724, "timestamp_updated": 1501635879, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.674534", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33960147": {"recommendationid": "33960147", "author": {"steamid": "76561198047743515", "num_games_owned": 100, "num_reviews": 2, "playtime_forever": 134, "playtime_last_two_weeks": 0, "last_played": 1501631617}, "language": "english", "review": "The artwork is amazing, the character designs are amazing, and the experience this game gave me was... AMAZING!\ngod, unraveling the mystery behind Randy Rosebud was crazy satisfying.\nThe puzzles were not as difficult as they would in a normal point and click game, but thats why this game is good! the confined area means that it won't take forever to find the solutions to puzzles as there are only 'so' many objects.\n\ngonna be honest though... the part where I had to vore a sentient raddish was... pretty gay. but that doesn't mean it was bad. ;)", "timestamp_created": 1501631904, "timestamp_updated": 1501631904, "voted_up": true, "votes_up": 12, "votes_funny": 2, "weighted_vote_score": "0.641414", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33958711": {"recommendationid": "33958711", "author": {"steamid": "76561198109627682", "num_games_owned": 148, "num_reviews": 8, "playtime_forever": 149, "playtime_last_two_weeks": 0, "last_played": 1501636341}, "language": "english", "review": "Anatola Howard is definitely one of my favorite artists, and they have achieved so much at such a young age. I was following this game for a long time through their twitter and bought it immediately.\n\nMaggie's Apartment is a fully voice-acted point-and-click game, and the artwork (both backgrounds and characters) is absolutely beautiful. The dialogue and music are incredibly sweet as well, and an 8 track album comes along with the game purchase ( Happy go Randy Me is the best song (^:  )\n\nI definitely recommend this game to anyone, if not for the gameplay, then simply just to support an amazing artist.", "timestamp_created": 1501625506, "timestamp_updated": 1501713546, "voted_up": true, "votes_up": 27, "votes_funny": 0, "weighted_vote_score": "0.756485", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34640918": {"recommendationid": "34640918", "author": {"steamid": "76561198116642607", "num_games_owned": 187, "num_reviews": 1, "playtime_forever": 195, "playtime_last_two_weeks": 0, "last_played": 1504203691}, "language": "english", "review": "beautiful game with a really good sountrack. i loved all of the characters and had a lot of fun", "timestamp_created": 1504204944, "timestamp_updated": 1504204944, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 81, "total_negative": 3, "total_reviews": 84}}
