{"reviews": {"38721285": {"recommendationid": "38721285", "author": {"steamid": "76561198132144164", "num_games_owned": 27, "num_reviews": 2, "playtime_forever": 25, "playtime_last_two_weeks": 0, "last_played": 1514236773}, "language": "german", "review": "Ein sehr gutes spiel macht auf jeden fall laune, drei gut gemachten kampanien,ein Sanbox modus mit vielen Fraktionen was will man mehr.Die Grafik ist etwas veraltet, wen das nicht stört wird viel spass mit dem game haben . Wer Hegemony Gold  auf deutsch spielen möchte (die Steamversion ist Englisch) sollte  sich die Deutsche Demo runterladen dort gebt ihr dann den Produktschlüssel ein und ihr habt die Vollversion auf deutsch. Den Produktschlüssel erhaltet ihr natürlich nur wenn ihr das Spiel kauft, einfach rechtsklick auf Hegemony Gold in eurer Bibliothek  und auf Produktschlüssel anzeigen gehen. Empfehle Hegemony Gold im Sale zu kaufen weil ich finde das 15 Tacken zu viel für so ein älteres spiel sind.\n\nlink für die Deutsche demo (für alle Englischmuffel ;) http://www.gamestar.de/artikel/hegemony-gold-deutsche-demo-zum-download,2321909.html", "timestamp_created": 1514343133, "timestamp_updated": 1514343133, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37696281": {"recommendationid": "37696281", "author": {"steamid": "76561198175839927", "num_games_owned": 49, "num_reviews": 25, "playtime_forever": 1743, "playtime_last_two_weeks": 43, "last_played": 1515271029}, "language": "english", "review": "Just got back into the game. It's pretty good.", "timestamp_created": 1511717281, "timestamp_updated": 1511717281, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.472441", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35906303": {"recommendationid": "35906303", "author": {"steamid": "76561198076133691", "num_games_owned": 347, "num_reviews": 98, "playtime_forever": 424, "playtime_last_two_weeks": 0, "last_played": 1460462535}, "language": "russian", "review": "Эта Игра мне понравилась-но в ней нет русского перевода", "timestamp_created": 1508632418, "timestamp_updated": 1508632418, "voted_up": true, "votes_up": 1, "votes_funny": 2, "weighted_vote_score": "0.461979", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35890258": {"recommendationid": "35890258", "author": {"steamid": "76561197998445123", "num_games_owned": 406, "num_reviews": 55, "playtime_forever": 899, "playtime_last_two_weeks": 0, "last_played": 1508601790}, "language": "english", "review": "This is a golden gem from the past, and still worth buying. Actually if you can live with the old graphics (they are actually good in perspective) this title is still better than their new ones. In the news ones they added new features, and nice graphics but made the UI terrible to play the game.\n\nThe game is HUGE, however you can argue that it doesnt have much variation. Handful of units for the whole campaign, and you spend your time doing the same thing over and over.\n\nWarning, the game is a bit of a micromanagement shore. Specially when you really start expanding. Once you get past the learning curve it starts moving faster.", "timestamp_created": 1508590100, "timestamp_updated": 1508590100, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501397", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35321695": {"recommendationid": "35321695", "author": {"steamid": "76561198009660228", "num_games_owned": 400, "num_reviews": 5, "playtime_forever": 3925, "playtime_last_two_weeks": 0, "last_played": 1496887608}, "language": "english", "review": "Slaying liberal Greeks, backwards Barbarians and taking Turkey from the Persians before Thanksgiving!", "timestamp_created": 1506743248, "timestamp_updated": 1506743248, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.401454", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34695372": {"recommendationid": "34695372", "author": {"steamid": "76561198011250864", "num_games_owned": 684, "num_reviews": 37, "playtime_forever": 1330, "playtime_last_two_weeks": 0, "last_played": 1444429547}, "language": "english", "review": "Very nice strategy game. Its slower paced and focuses a bit on your economic and logistical sitaution, but still very satisfying.", "timestamp_created": 1504386255, "timestamp_updated": 1504386255, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33205289": {"recommendationid": "33205289", "author": {"steamid": "76561198040062168", "num_games_owned": 170, "num_reviews": 40, "playtime_forever": 1058, "playtime_last_two_weeks": 0, "last_played": 1502697483}, "language": "spanish", "review": "Ou Ou Ou!!! \n\nSí. No me perdono considerarme un buen jugador de wargames, de estratégicos, y no tenía ni repajolera idea de que existía este diamante -en bruto-, y realmente me averguenza en mi \"categoría\" de player de wargames. Lo siento, estaré más pendiente...\n\nY me lancé casualmente sobre este Hegemony dando de lado al más reciente III. Nada en particular, y seguramente sea un enorme juego, quizás hasta mejor, pero es la temática de la Hélade, la que andaba buscando, huérfano de ese periodo. Lo que no era \"mitológico\" era raro. Hegemony Gold es simplemente lo que andaba buscando. Aquí tengo en serio, lo que el Total War Alexander me ofrecía infantilmente en forma de mod. Es Grecia, griegos, y sus líos. \n\nEl juego me parece soberano, de darte a mucho pensar, de exigirte tomarlo en serio. Es un wargame en tiempo real, con connotaciones económicas, religiosas, raciales. Todo compactado en un formato delicioso de mapa estratégico, mapa de fichas, y unidades correteando por bosques y llanuras, murallas y templos, con la simple acción de la rueda del ratón, que te pasa de tu visión Zeus, a la de un triste peltasta humano y temporal. \n\nEntras al juego y te ofrece una extraña sensación. Ves la interfaz de carga y dices... Aficionados. Entras al menú y dices, Aficionados. Empiezas a jugar y dices.... Bravo!!! Se nota que el estudio no debe ser Ubisoft, pero también notas conocimiento, amor por la historia, amor por los juegos, amor por el trabajo. Y eso es muy importante. El juego además de las \"campañas\", ofrece un sensacional y complicado \"Sandbox\", que a su vez lo veo como la señal distintiva de este juego a otros. Aquí te montas tú película de la Grecia clásica, sin que se te desmorone el rigor con ello... \n\nCon sencillez de colocar ficha aquí y allí, sin más, tienes, rutas comerciales, bloqueos, saqueos, pillaje, emboscadas, batallas campales, economía, util uso de la teogonía griega, en definitiva \"sandbox\" inagotable de amplio universo. Deciros que empecé partida con Mesenia. En la realidad viles subyugados a la belicosa Sparta que lucharon por su libertad mientras eran pisoteados por el \"estado militar\". Pues bien, la partida es realmente épica. Ahí me dedico a sobrevivir a los intentos de subyugación espartana con las armas propias de un esclavo. No sabéis el placer que me causa llegada la \"temporada del ganado\", lanzar mis jabalineros rápidos y robarle a la temible lacedemonia sus carnes apreciadas. Un verdadero placer contemplar a la hopliteria de Sparta salir en lentitud a tratar de evitar el robo de sus reses, mientras yo los sorteo como un arcaico Curro Jiménez. \n\nEvidentemente Sparta es un estado fuerte y belicoso, y me manda campañas anuales de castigo, incendiando mis campos de cebada, y es cuando se produce mi máxima aspiración; combatir a campo abierto más por honor que por sensatez... ¿Os parece poco? Probar con Atenas, y diréis... Por Poseidón, que superioridad de medios hegemónicos, soy intratable... já. El juego está muy bien equilibrado para que debas usar la lógica y no te lances a modo \"command conquer\". Ser Atenas puede parecer.... pero no es. \n\nCon todo, tenga cuidado con esta bien llevada simpleza y acierto. El juego está bien diseñado para manejar mucho de forma fácil, pero debes tener el interés y la paciencia de querer aprenderlo. Si eres un jugador estratégico casual, mantente en Total War Rome o Alexander. Son muy divertidos. Esto es divertido si te gusta la estrategia, dar la pausa, pensar, y decidir golpear como puedas, y no como quisieras. Si eres de aprender, te gusta la historia, la estrategia y eres paciente, te llevarás la misma sorpresa que yo. \n\nUn Saludo!!", "timestamp_created": 1499121455, "timestamp_updated": 1499121455, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32779851": {"recommendationid": "32779851", "author": {"steamid": "76561198035902812", "num_games_owned": 165, "num_reviews": 3, "playtime_forever": 9781, "playtime_last_two_weeks": 0, "last_played": 1513176884}, "language": "english", "review": "A game that has few peers, the closest that most people interested in this genre of gaming could compare it to would be a Total War game - you manage armies and resources to take cities and project your power.\n\nTo stop at this point is a disservice to how unique Hegemony is as a game. A major component this game tries to focus on is the complexity of waging war beyond simply marching a larger army to where your enemy is and beating them around the head a few times. You need to think about your supplies, the seasons, the number of recruits you have waiting to be called up, and the time it will take to defeat the enemy. You'll be frustrated as a planned lightning assault gets bogged down by a stubborn city resisting you, and then gobsmacked when a relief force arrives and you realise you need to pull back or lose your army because you ran out of food.\n\nAt this point there are many players who would be turned off by the complexity of this. \"Why is the game punishing me for such small mistakes?\". For me the most satisfying moment was learning from those mistakes and realising that the AI is as much at the mercy of these factors as I was. Starve out that impregnable mountain fortress, or build your own fortress on the route the relief force has to take to bide you the time you need. Along with the immense care taken by the developers in making the map the challenges you face each time are unique and interesting.\n\nWith that said I want to recommend this first game against the latter two; Hegemony Rome and Hegemony III. The former is a transition between the two, and the latter is a great game in it's own right that however doesn't capture the immense care and individuality of this first game.\n\nIt is well worth the price.", "timestamp_created": 1498409844, "timestamp_updated": 1498409844, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.543884", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32513977": {"recommendationid": "32513977", "author": {"steamid": "76561197992434335", "num_games_owned": 98, "num_reviews": 6, "playtime_forever": 2250, "playtime_last_two_weeks": 0, "last_played": 1500316727}, "language": "english", "review": "Excellent strategy game!   You get more than enough for what you pay for.  The main campaign can take 50-100 hours to finish and there are two other campaigns and a sandbox mode", "timestamp_created": 1497724664, "timestamp_updated": 1497724664, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.528687", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32457794": {"recommendationid": "32457794", "author": {"steamid": "76561198165363994", "num_games_owned": 16, "num_reviews": 1, "playtime_forever": 1593, "playtime_last_two_weeks": 0, "last_played": 1496539101}, "language": "english", "review": "Really good game, nice gameplay, quite different. However, it has its cons.\n\nPros:\nIts good; not great, but good.\nIt has a replayability value.\nNice units and improvements.\nGood strategy.\n\nCons:\nIt crashes after a few hours, no matter what.\nIt gets rather boring after several hours.\n", "timestamp_created": 1497571448, "timestamp_updated": 1497571448, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.470763", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31633827": {"recommendationid": "31633827", "author": {"steamid": "76561198069887501", "num_games_owned": 105, "num_reviews": 1, "playtime_forever": 18459, "playtime_last_two_weeks": 0, "last_played": 1497212585}, "language": "dutch", "review": "Ik vond dit spel toen ik naar het zoeken was naar een leuke strategie game in de sfeer van total war. En was aangenaam verrast met dit spel, ik vond het zo leuk dat ik gezocht heb naar meer van deze uitgever. Ze waren net met Rome begonnen en heb deze dan ook meteen gekocht, leuke actieve defs en reageren ook snel als je ergens mee zit, spel zat ook toen nog in de vroegtijdige  toegang, dus soms liep je ergens tegen aan, meld dit en je kreeg altijd leuke reacties terug. Daarna kwam Hegemony III, deze natuurlijk ook meteen aangeschaft. naar mijn mening blijft deze toch het leukst al mis ik wel wat opties welke de nieuwe games wel hebben, maar de muziek en sfeer van deze blijft fantastisch. Als je nog niks van deze serie hebt kan ik je deze zeker aanraden, zelf zou ik Rome overslaan, maar deel 3 kan ik je ook aanraden, daar zitten opties in die je in deze graag zou hebben. Maar alles bij elkaar blijft dit een onder gewaardeerde parel. Voor de prijs hoef je zeker niet te laten en steun je een leuke kleine groep gamedesigners, welke dit verdienen.", "timestamp_created": 1494275095, "timestamp_updated": 1494275095, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31367626": {"recommendationid": "31367626", "author": {"steamid": "76561198039433849", "num_games_owned": 63, "num_reviews": 4, "playtime_forever": 8505, "playtime_last_two_weeks": 0, "last_played": 1493011013}, "language": "english", "review": "Amazing game, a bit old, but great, and this by a small studio!", "timestamp_created": 1493169241, "timestamp_updated": 1493169241, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.488915", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30645862": {"recommendationid": "30645862", "author": {"steamid": "76561198021913143", "num_games_owned": 110, "num_reviews": 15, "playtime_forever": 1573, "playtime_last_two_weeks": 0, "last_played": 1487467952}, "language": "english", "review": "I owned this game for many years and had always returned to it occasionally (prior to purchasing Hegemony 3) and that's because of an honest individuality. Longbow seems to focus on the logistical aspects of conquering/raiding. That means often times you become limited in offensive operations due to a lack of food in the area. Yes, its food really, explained through farms and/or sheep each supplying a certian amount of food to the nearby city(s). You can really get the feel for seasonal raiding between two city-states each simply trying to carry off food or harm the production of the other. A lack of quick/residual manpower in each city also vastly depicts the relative low loss of life in battles of the period, as you'll find yourself or your opponent often afraid to make too costly an attack, which means garrisons do largely help deter invaders in the game. Actual fighting plays out a lot like a down-graded TW (So RTS unit-based) Definitely worth trying if youre interested in the period.", "timestamp_created": 1490067490, "timestamp_updated": 1490067490, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.585942", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30474492": {"recommendationid": "30474492", "author": {"steamid": "76561198167320282", "num_games_owned": 31, "num_reviews": 3, "playtime_forever": 1069, "playtime_last_two_weeks": 0, "last_played": 1503159066}, "language": "french", "review": "Un très bon jeu de stratègie en Grèce antique ! Il y en à peus et celui-là est surement le meilleur !", "timestamp_created": 1489336348, "timestamp_updated": 1489336348, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30353079": {"recommendationid": "30353079", "author": {"steamid": "76561198039359563", "num_games_owned": 281, "num_reviews": 13, "playtime_forever": 2813, "playtime_last_two_weeks": 0, "last_played": 1512290663}, "language": "german", "review": "Dieses Spiel ist eines meiner absoluten Favoriten! (Bitte von der Spielzeit in Steam nicht täuschen lassen, diese wird nur gezählt wenn man nach Spielstart raustabt und den Launcher neu öffnet und Ihn so stehen lässt...) Ich habe das Spiel schon mehrere 100 Stunden ohne steam gespielt.\n\nWichtig ist in diesem Fall die Gold Version zu kaufen, da dadurch diplomatische Optionen in das Spiel eingefügt werden, die die politischen Vehältnisse dieses Abschnitts der griechischen Antike noch besser abbilden. Ebenso erhält man zwei weitere Scenarios und einen Sandboxmodus, in dem man jede! wirklich jede! Nation spielen kann.\n\nDiese Epoche der griechischen Antike, die Zeit zwischen dem Hegemonieverlust Spartas bei Leuktra 379 v. Chr. und der Hegemonie Makedoniens bei Charoneia 338 v. Chr. ist eine der abwechslungsreichsten und spannensten, was Militärtechnik, Diplomatische Wechselspiele und Hegemoniestreben der Polis angeht. Dieses Spiel spiegelt dies sehr gut wieder.\n\nMein Lieblingsstart ist aber der Standardstart mit Philipp.\nIn einer dynamischen Kampagne kann man den Aufstieg Philipps II. von Makedonien begleiten, gespickt mit einer Vielzahl an Sequenzen und Orten, die man langsam einnimmt bzw. entdeckt. Dabei steht einem die Vorgehensweise komplett offen. Zu Beginn muss man sich von der Hauptstadt Agai aus behaupten und kann (muss nicht!) den Missionszielen folgen. Dabei schließen sich einem historische Anführer an oder stellen sich dem Spieler entgegen. Besonders reizvoll ist die Möglichkeit Frieden zu vereinbaren, um benachbarte Staatenbünde oder Stämme daran zu hindern in Makedonien einzufallen.\nIhr wollt Makedonien erst nach Persien ausbreiten und vielleicht später erst nach Illyrien gehen? Kein Problem.\n\nMit der Leertaste pausiert man das Spiel. Dies entpuppt sich schnell als bester Freund, da die Map dynamisch weiterläuft. Alles findet in Echtzeit statt, so das man schonmal  beschäftigt ist, wenn das eigene Gebiet von 3 Seiten angegriffen wird... Aber das ist zu verkraften, wenn man sich überlegt ausbreitet und Bündnisse schließt an Fronten, wo man keine Truppen haben will bzw, mehr leisten kann. Dieser Aspekt gefällt mir auch sehr gut. Die Wirtschaft (Goldeinkommen / Asugaben) werden durch Städte und Minen geleistet. Nahrung für die Armee bekommt man durch Höfe. Schafherden sind eine mobile Nahrungsquelle für die Armee. Zuviele Truppen sind nicht möglich wenn das Goldeinkommen fehlt.\n\nDie stufenlos zoombare, riesige Karte und die Atmosphäre machen dieses Spiel zu einem Leckerbissen für Antike bzw. historisch gut umgesetzte Spiele Fans!\n\nPro:\n\n-Atmosphäre\n-starkes Szenario\n-große Karte\n-freie Vorgehensweise\n-abwechslungsreiche Einheiten\n-ein sehr verzweigtes Versorgungsnetz im späteren Spiel\n-Pausenfunktion mit Leertaste\n-stufenlos zoombar\n-stimmungsvolle Musik\n-tolle Videosequenzen und Missionen bzw. Events\n-nicht so leicht, KI pisakt ohne Gnade\n\nContra:\n\n-für anspruchsvolle Spieler (taktisches Verständnis)\n-wird etwas unübersichtlich im späteren Spiel\n-kann bei schlechter Planung zum geklicke an mehreren Fronten ausarten", "timestamp_created": 1488792949, "timestamp_updated": 1488793741, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29560634": {"recommendationid": "29560634", "author": {"steamid": "76561198245968936", "num_games_owned": 20, "num_reviews": 3, "playtime_forever": 59, "playtime_last_two_weeks": 0, "last_played": 1511602605}, "language": "english", "review": "Ive played this game apart from steam more than 500+ hours its flawless but it needs a cheat system while playing sandbox conquering greece is awful with so much limited budget", "timestamp_created": 1485684672, "timestamp_updated": 1485684672, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.412254", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29212158": {"recommendationid": "29212158", "author": {"steamid": "76561198056851771", "num_games_owned": 65, "num_reviews": 1, "playtime_forever": 1382, "playtime_last_two_weeks": 0, "last_played": 1513114929}, "language": "english", "review": "Definitely, a thumps-up for any Grand-Strategy fans! Large map and extreme strategy needed to play the game! Fighting a war in the South to win a major port city along the sea of Marmara, only to be stabbed by Barbarians in my under protected North!!!! \n\nMy only complaint is the lack of liberty when it comes to cities, farms, trade nodes and the economy in general. Without over-complexifying the economy, adding the liberty to establish settlements, farms, trade routes and develop cities would be nice. \n\nThough, for grand military fans: Great game.\n", "timestamp_created": 1484258294, "timestamp_updated": 1484258294, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.520248", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29004302": {"recommendationid": "29004302", "author": {"steamid": "76561198007360038", "num_games_owned": 203, "num_reviews": 31, "playtime_forever": 12403, "playtime_last_two_weeks": 0, "last_played": 1487081349}, "language": "english", "review": "A stunningly good wargame. Guaranteed to keep you occupied for hours on end!", "timestamp_created": 1483531206, "timestamp_updated": 1483531206, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.507654", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27959493": {"recommendationid": "27959493", "author": {"steamid": "76561198061599523", "num_games_owned": 82, "num_reviews": 5, "playtime_forever": 534, "playtime_last_two_weeks": 0, "last_played": 1488722026}, "language": "german", "review": "nice", "timestamp_created": 1480346780, "timestamp_updated": 1480346780, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.494438", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "27730306": {"recommendationid": "27730306", "author": {"steamid": "76561198036665357", "num_games_owned": 145, "num_reviews": 7, "playtime_forever": 4108, "playtime_last_two_weeks": 0, "last_played": 1507864829}, "language": "english", "review": "Hegemony is truly a game about building an Empire. Once you begin expanding your Empire you will soon notice that you need more food, Supply nodes, Gold, troops and suitable defensive locations in order to just exist.\n\n You can never be satisfied because just outside your borders lies the mines and or fertile lands that may fuel your next campaign across Thessaly, The Danube River, Asia Minor or many, many other provinces that, once within your grasp, will enable you to recruit allied/Mercenary troops to complement your native army, land and sea supply lines to feed your cities and army, gold to fuel your diplomatic and military needs and more territory to call your own.\n \nSpeaking as someone who has a degree in History and knows a lot about antiquity and Mesoamerican civs, the game does a amazing job of presenting Ancient Greece, it's warring states, cities, people, and events. If you have any interest Greek History, Military tactics and Geography, this game and it's successors are exelent as a introduction on the matter.\n\nTo Quote Phillip II, the great: \" My son, ask for thyself another kingdom, for that wich I leave is too small for thee\".", "timestamp_created": 1480193547, "timestamp_updated": 1480193547, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.510604", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "27637517": {"recommendationid": "27637517", "author": {"steamid": "76561198000551221", "num_games_owned": 456, "num_reviews": 2, "playtime_forever": 4091, "playtime_last_two_weeks": 0, "last_played": 1480158123}, "language": "english", "review": "This game is about Macedon. But not yet another game about Alexander the Great !\nIt's even better, it's about his father, Philip II of Macedon, whose achievement was even more incredible than conquering Persia and India : he unified Greece.\nYes, he is the Guy who beat Athens, Thebes (The Dragon of Beotia) and even Sparta !\n\nThe game is about tactical battles, some simplistic diplomacy, strategy, but more important, logistics.\nTroops need moral. And moral needs food. And food doesn't magically move itself from fields to warriors. You need supply routes.\n\nThe main campaign is driven by a lot (and I mean a lot) of Objectives. Some of them, historical, being mandatory for your progress towards victory. All of them having their own rewards.\n\nBattles are tactical, with use of charging and flanking being very important.\n\nThe game is not perfect (far from it). Graphics are mediocre. It can sometimes be teadious.\nBut the journey of Philip II to become the Hegemon of Greece is just amazing.\n\n9/10", "timestamp_created": 1480157724, "timestamp_updated": 1480157724, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.555449", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "27559523": {"recommendationid": "27559523", "author": {"steamid": "76561197973541987", "num_games_owned": 483, "num_reviews": 1, "playtime_forever": 8955, "playtime_last_two_weeks": 0, "last_played": 1491668213}, "language": "english", "review": "This is one of the most amazing and most underated games out there.  \n\nThe first few minutes (ok... first hour) can be a bit rough, being attacked from everywhere, running out of gold or recruits... but don't give up.\nIt has incredible depth and strategy to it.  Great replayability.  And it makes you dream by taking you back to Ancient Greece.\n\nI purchased a copy directly from the developper, so my Steam hours are but the tip of the iceberg.  And yes... I bought the game three times, just to support the developpers and have been recomending it to everyone around me ever since.\n", "timestamp_created": 1480113028, "timestamp_updated": 1480113028, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.510604", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27065796": {"recommendationid": "27065796", "author": {"steamid": "76561198012093663", "num_games_owned": 185, "num_reviews": 6, "playtime_forever": 39442, "playtime_last_two_weeks": 0, "last_played": 1487365315}, "language": "english", "review": "Ruling the sheep is a sure way to rule all!", "timestamp_created": 1479973893, "timestamp_updated": 1479973893, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.451193", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27038154": {"recommendationid": "27038154", "author": {"steamid": "76561198069758865", "num_games_owned": 57, "num_reviews": 1, "playtime_forever": 10243, "playtime_last_two_weeks": 0, "last_played": 1493443648}, "language": "english", "review": "good war game", "timestamp_created": 1479966300, "timestamp_updated": 1479966300, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.451193", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26966166": {"recommendationid": "26966166", "author": {"steamid": "76561198019645524", "num_games_owned": 326, "num_reviews": 5, "playtime_forever": 3977, "playtime_last_two_weeks": 0, "last_played": 1478565112}, "language": "english", "review": "Hegemony is a grand strategy game from indie developer Longbow Games. It's pretty similar to Total War in a lot of ways, except that everything happens on the world map. All the action is in real time, but the player can pause the game and issue orders at will. This becomes very important as your empire expands, because the map is very large and past a certain point you'll likely be fighting multiple battles at any given time. Overall, it's a much slower-paced and deliberate kind of game than AoE or Starcraft that depends more on careful planning than actions-per-minute, but still much faster than turn-based strategy. It's also a rather low-stakes game, since no particular battle field defeat is likely to be fatal to your empire, and you can pretty much always recover with some time and effort. Outright losing a campaign would essentially require intentional self-sabotage.\n\nIn terms of production values, the game clearly shows its creators' lack of resources. The unit models lack fidelity, the map is somewhat plain (aesthetically, that is, in mechanical terms there are a wide variety of environments), the sound effects are functional but get repetitive quickly, and the less said about the (thankfully rare) voice acting, the better. Still, none of these issues impact the gameplay itself.\n\nLike Total War, units are created as groups rather than as individual guys, and fight in formation. There are only a few broad unit categories, and most of the factions (especially in Greece proper) are pretty much the same, but most factions have at least one unique unit, and some of these really do alter strategies quite a bit. Basic tactics revolve around a battle line of heavy infantry, and an unskilled player could probably get through the game eventually just by swamping the enemy under as many hoplites as possible, but a mixed army with ranged support, light infantry for flanking, and cavalry for fighting the enemy light units will perform much better if used properly. Units have a morale stat, and the goal of most battles is to break the enemy's will rather than fight to the death. Broken units drop their weapons and attempt to flee at top speed to the nearest friendly city, at which point they return to their home town and join the reassembling unit there. If they are captured, they can either be executed or enslaved, without moral judgement. Units recruited from the player's native faction gain experience with each victory, which the player can invest in a few different stats (speed, morale, rate of food consumption, and siege skill).\n\nThere is also naval combat, though the trireme (with Athenian and Persian variants) is the only ship available. it's a little bit finicky, to be honest, since how much damage you do is determined largely by the angle and speed at which the ships collide and they maneuver like, well, ships. It's usually just about who brought a larger fleet, or being lucky. Fortunately it isn't very important unless you're conducting amphibious invasions or raiding naval trade routes.\n\nA lot of the strategy in the game revolves around supply lines. Trade routes are constructed by the player, but in most cases it's pretty clear where they're supposed to go and it's mainly just a matter of connecting the dots. These routes produce a bit of gold, but their main purpose is transfering food. All land combat units consume food, and if they run out their morale will quickly drop to zero. Since demoralized units are pretty much useless, keeping an eye on your food supplies and ensuring that the far-reaches of your empire don't starve is in many ways more important to victory than the actual fighting. Harrassing an enemy's trade routes and pillaging their farms to starve a city's defenders can be a very effective strategy that the AI practices routinely. Since food production varies by season throughout the in-game year, the timing of a campaign can be very important. Do you want to move during harvest time so your armies can forage off the land while they slowly overcome the well-fed defenders, or in the middle of winter to more easily starve the enemy but at the risk of your units collapsing from hunger? There's no one \"correct\" strategy, but your tactics will have to reflect the specific conditions you're marching into.\n\nThere's no base building in Hegemony, which ordinarily I would be disappointed by, but here it works for me. All structures have fixed, pre-placed positions on the map to reflect the actual geography of Ancient Greece. In addition to cities, there are forts, mines, watchtowers, farms, and shrines. The first three can be deconstructed, and are often found ruined, but the site can always be rebuilt. Forts and watchtowers are pretty self-explanatory, mines can be filled with either paid workers or slaves to provide gold, which acts as a population limit, and different types of shrines (heroic, logistics, and healing) provide different benefits to the units of the faction that controls them.\n\nThere are three campaigns in the game and a sandbox mode. The campaigns are a bit more structured than Total War since the player is given specific objectives throughout, and the rewards for completing them are often substantial, but there aren't any time limits and once you complete the tutorial section of the beginner's campaign the map is completely open. I spent about 60 hours conquering the entire map in my first playthrough of the Macedonian campaign, even though I had technically finished all the objectives much earlier than that. As a history student, I personally really appreciate the Civilopedia-style background information on pretty much everything in the game, and the developers make it clear that they've done their homework.\n\nThere are a number of different factions in the game, and a diplomacy system, but it's very simplistic. Other factions have a fixed hostility level to yours, based on the historical relations between them, and a variable intimidation statistic that depends on your relative strength and how close they are. These factors affect the frequency of attacks, and how much it costs the player to establish a truce or an alliance. The most important effects of the faction system are on the main gameplay. A faction's hostility determines the size of the garrison required to supress the inevitable rebellions, while allies fall under the player's control immediately and don't require a garrsion at all. Allied units are also slightly superior to the mercenaries recruited from most conquered cities, though they still have weaker morale than the player's native units, and don't gain experience. As I mentioned earlier, each faction also has unique units which can only be produced from their native cities. I often choose my targets specifically to gain access to a particular unit I like.\n\nIn conclusion, Hegemony is an extremely innovative game which makes up for low production values with simple but deep mechanics. Highly recommended to all strategy fans.", "timestamp_created": 1479948482, "timestamp_updated": 1479948482, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.607831", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26039985": {"recommendationid": "26039985", "author": {"steamid": "76561198010904779", "num_games_owned": 192, "num_reviews": 5, "playtime_forever": 1034, "playtime_last_two_weeks": 0, "last_played": 1476574507}, "language": "english", "review": "I first got this a few years back because it looked interesting. I didn't play too much as I think there were a few big releases around that time that took my attention. I came back to this recently and realised what a gem it is! I've been playing heaps the last couple weeks and it's bloody awesome :) Watch out for rage mode as you are concentrating on one part of the map then realise a bunch of skirmishers have slipped into unguarded parts of your kingdom and stolen all your mines and burned your farms. Usually enough of a casus belli for me to divert my entire campaign to burning all traces of their civilisation and salting the earth - Carthage style.\n\n10/10 would raze and pillage the Paeonians again just because they burned my tomato crop again.", "timestamp_created": 1476495869, "timestamp_updated": 1476495869, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.510604", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25863649": {"recommendationid": "25863649", "author": {"steamid": "76561198006412029", "num_games_owned": 127, "num_reviews": 9, "playtime_forever": 554, "playtime_last_two_weeks": 0, "last_played": 1475638533}, "language": "english", "review": "This game was fun at first but once my empire grew beyond 10 cities, it started crashing every 15 minutes rendering it unplayable.", "timestamp_created": 1475638806, "timestamp_updated": 1475638806, "voted_up": false, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.502381", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25637927": {"recommendationid": "25637927", "author": {"steamid": "76561198000990897", "num_games_owned": 78, "num_reviews": 1, "playtime_forever": 30350, "playtime_last_two_weeks": 1144, "last_played": 1515961875}, "language": "english", "review": "Very good game which has hundreds of hours to play if u like to play in sandbox, but the campaing in itself is too short and the missions seem a bit forced towards the end.", "timestamp_created": 1474563505, "timestamp_updated": 1474563505, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24911987": {"recommendationid": "24911987", "author": {"steamid": "76561197997502804", "num_games_owned": 1983, "num_reviews": 149, "playtime_forever": 315, "playtime_last_two_weeks": 0, "last_played": 1491541577}, "language": "schinese", "review": "地图太大管不过来", "timestamp_created": 1471183598, "timestamp_updated": 1471183598, "voted_up": false, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.479023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24731982": {"recommendationid": "24731982", "author": {"steamid": "76561198059957188", "num_games_owned": 535, "num_reviews": 35, "playtime_forever": 8212, "playtime_last_two_weeks": 0, "last_played": 1488881067}, "language": "tchinese", "review": "Buy it!", "timestamp_created": 1470433232, "timestamp_updated": 1470433232, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.504841", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24351466": {"recommendationid": "24351466", "author": {"steamid": "76561197966694886", "num_games_owned": 37, "num_reviews": 4, "playtime_forever": 7358, "playtime_last_two_weeks": 0, "last_played": 1492385576}, "language": "english", "review": "If you don't know if the game is for you. Just play the demo!", "timestamp_created": 1468667992, "timestamp_updated": 1468667992, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502963", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24239163": {"recommendationid": "24239163", "author": {"steamid": "76561198080953278", "num_games_owned": 10, "num_reviews": 4, "playtime_forever": 24062, "playtime_last_two_weeks": 549, "last_played": 1515454781}, "language": "english", "review": "Excellent game with the most faithul recreation of post-Leuctra Greece I have seen, much better than the Total War effort (Wrath of Sparta). Very difficult to just pick up, be prepared to fail a few times. I also play Hegemony 3 but Hegemony Gold has my preferred setting.", "timestamp_created": 1468180808, "timestamp_updated": 1510669193, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.501103", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24223838": {"recommendationid": "24223838", "author": {"steamid": "76561198008535027", "num_games_owned": 35, "num_reviews": 2, "playtime_forever": 8230, "playtime_last_two_weeks": 0, "last_played": 1511642336}, "language": "english", "review": "I bought this during the summer sale but it well worth the standard price. Its a simple concept (raise troops, pay them, feed them, attack your neighbors) but finding the right balence makes it much more complex than you might think. Definitely a different spin than any of the other strategy games you might also be playing, EUIV, Total War, CKII. \n\n[*]Supply Lines/Logistics- Your cities each have a predetermined number of trade routes based on the economic power of that city. Some have 2, some have 16. These can connect to farms (which produce food, with varying amounts for each season), mines (which produce gold when worked by workers or slaves captured in battle), and they connect to other cities. Food moves along these routes with different capacities based on how long it is. Some routes that are very close (like a city to the farm next to it) can carry up to 100 a week and longer routes usually start at a base level of 15 per week, but can be upgraded by paying gold. Your units replentish their losses only if they are on one of these supply lines. \n\n[*]Finances- You don't have a treasury like in other games, only an income. Your finances are viewed as a weekly income/cost. Mines produce up to 80 gold a week whereas upgraded roads can cost up to 90 as well as your troops having a weekly upkeep. So at any point your spending overtakes your income, units don't get paid and their moral starts to drop. The same will happen with food, but you don't have a kingdom production/expenditure because food can only get to your troops and cities if you have sufficient supply lines.\n\n[*]Battles- Your troops fight in real time on the campaign map like Paradox games but you can deploy and position them like in Total War with bonuses if your cavalry charges a unit or if you flank an enemy. A unit's moral drops a little for each soldier that dies and it will rout if the moral drops to 0. Cities act in a similar way but with a number assigned to its seige strength. When you are sieging a city, its constatly dropping, with larger hits if you use catapaults, and when it gets to 0, it becomes yours. If a city or fort has a garrison, it will shoot back at you. When a unit routes, it will regroup at its home city and replentish its losses. This will always happen, unit don't get destroyed, even if every troop dies.\n\n[*]Cities- When you retake a city that is part of your culture or basiaclly within your historical territory, it becomes part of your empire. You can recruit native units, the same you can recruit at your capital, and they can change their home city to any with the same culture. If you have every unit with its home set as your capital, they will only replentish its number from that city so it's best to try to spead them out. For example, if your capital is in the middle of your empire and your troops take losses on the edge, manpower will be taken from its home and move along supply lines to that unit. Cities recouperate manpower slowly and when it's at 0, your troops won't fill their ranks unless you change their home city and they recruit from there.\n\n[*]Culture- When you expand and take a neighboring city that is not native, they will remain hostile to your occupation. This manifests as needing a garrison to prevent it from rebelling and joining its original nation. You can station your own troops from native cities, hire allied troops if that city is friendly/allied to you, or hire mercinaries from that city at an increased cost. They will have a specific culture and can have their home city assigned to any city with a shared culture.\n\n[*]Final thoughts- There are still other aspects, generals, naval combat, objectives/rewards, population and migrants, stockpiling food, etc. but the tutorial covers these aspects. The tutorial is only educational for the first hour or so, like I said, simple concept. The difficulty comes with taking these basic rules and balencing the food and gold across your empire, your troops to attack enemies and your garrisons to counter raids and supress uprisings. The introductory capmaign starts you as Phillip of Macedon as it guides your expansion. After a bit though, you have learned the game enough that you don't need a tutorial and just need some practice. I easily sunk 40 hours into that capmaign just taking my time, finding the most efficient way to set up supply lines and cheapest ways to maintain garrison without depleating my manpower reserves.\n\nThat being said, I highly reccomend this game. The intro campaign lasts long enough to justify the price and it has plenty of replayability because you can go a different direction because the map is enormous. There are also other campaigns with the Peloponnesian War being very complex as well as a sandbox mode- play as any faction with no rules or time limits.", "timestamp_created": 1468127970, "timestamp_updated": 1468127995, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.605045", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23233068": {"recommendationid": "23233068", "author": {"steamid": "76561198306259559", "num_games_owned": 15, "num_reviews": 7, "playtime_forever": 12128, "playtime_last_two_weeks": 0, "last_played": 1515006437}, "language": "english", "review": "I love the logistics and deep strategy this game offers, you can tell the developers put a lot of effort into this hidden gem. Probably my favorite game in my library so far.", "timestamp_created": 1464350510, "timestamp_updated": 1464350510, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.504728", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22869671": {"recommendationid": "22869671", "author": {"steamid": "76561198022087017", "num_games_owned": 337, "num_reviews": 43, "playtime_forever": 1259, "playtime_last_two_weeks": 0, "last_played": 1463842433}, "language": "german", "review": "Ich hatte mir dieses Spiel eigentlich nur gekauft, um meine Hegemony Sammlung zu vervollständigen. Die Nachfolger Hegemony II: Rome und insbesondere Hegemony III: Clash of the Ancients gefallen mir nämlich ausgesprochen gut. \n\nDa ich nun einige Tage im Ausland verbracht hatte - mit einem alten klapperigen Laptop - ergab sich eine Gelegenheit mal den ersten Teil anzusehen. Umso überraschter bin ich nun, da dieses Teil richtig rockt. Okay, Grafik ist jetzt nicht so überragend aber in Sachen Atmosphäre ein echtes Sahnestück. Und die ganze Geschichte um König Philipp von Macedonien (dem Vater vom Alexander dem Großen) ist echt mit Liebe zum Detail gemacht. \n\nFans der Antike sollten unbedingt zugreifen. Den Schwierigkeitsgrad erstmal lieber auf Casual einstellen, oft pausieren und regelmässig speichern. Das Teil ist was für richtige Strategen.\n\nP.S.Bin bei Steam auch als Kurator unterwegs und freue mich über jeden Follower: \n\nhttp://store.steampowered.com/curator/2370797-7IDGaming.de/?appid=275290", "timestamp_created": 1462738396, "timestamp_updated": 1473422375, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.514744", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22566892": {"recommendationid": "22566892", "author": {"steamid": "76561198063892568", "num_games_owned": 415, "num_reviews": 1, "playtime_forever": 2046, "playtime_last_two_weeks": 0, "last_played": 1503819012}, "language": "english", "review": "Hegemony Gold: Wars of Ancient Greece is a very intelligent game, both immediate and deep. I would define it as an \"operational grand strategy game\". \n\nThe emphasis is obviously on logistics: the real trick to success is keeping your troops well supplied and in good shape, and that can be hard, especially during sieges and winters. Sieges in particular are rather well represented in a fun way, as you'll need to block enemy supply routes, both on land and on sea, while keeping your own open. \n\nStrategical maneuvering is also very important, and delaying the movement of an army might mean the collapse of your empire. Your state is almost like a house of cards: lose a key region for your supply network and your income, and you'll find yourself in big trouble. The AI itself is very skilled at exploiting those weaknesses in your grand strategy, and you'll find yourself often at war on multiple fronts. Unlike many strategy games, as you grow there won't be any kind of avalanche effect: you will have more resources and more troops but your borders will also be longer, and you'll find out that you can't deploy that many troops in a specific campaign anyway: small and mid-sized kingdom still pose a very tangible threat even when  you're the biggest empire on the map.\n\nThe tactical part is simplistic: it's an RTS at that, but the mechanics are a bit lacking. Also, proper tactical maneuvering is still very important but most of the time you'll find that there isn't a lot of room for maneuvering.\n\nOther than that, this game has a huge plus: the immersion value. It recreates the era pretty well, and to this day I've never seen a more detailed recreation of Ancient Greece in a videogame, with many historical kingdoms and city-states making their appearance in Hegemony and so many missions you have to complete to establish your dominion over Greece. You'll never get bored as you'll always have things to do, and the historical grand campaign lasts many, many hours.\n\nIn short, I highly recommend the game. It's a very original and innovative title, and if you like historical immersion and strategy go for it: you won't be disappointed.\n", "timestamp_created": 1461330363, "timestamp_updated": 1461330363, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.501103", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21323884": {"recommendationid": "21323884", "author": {"steamid": "76561198012214018", "num_games_owned": 156, "num_reviews": 16, "playtime_forever": 5019, "playtime_last_two_weeks": 0, "last_played": 1457200022}, "language": "english", "review": "Fantastic ! The best of the series.The perfect balancing between semplicity and innovation,better than hegemony rome and hegemony iii. We don't need a complex costruction of buildings or a lot of kinds of units but the possibility so survive the winter with a flock of sheeps or raiding mercant navy with other navies =D We need to secure zone rich of mine or farmlands with our hoplite or phalangite.Definitely a bad AI of enemies (longbow games hate developing AI in my opinion).So if will ever be an Hegemony iv don't waste time to implementing a lot of \"stances\" or building type but remeber the elements that are the heart of hegemony gold.And focus on AI. Very unique game.Buy it!", "timestamp_created": 1455910625, "timestamp_updated": 1455910625, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500480", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20687955": {"recommendationid": "20687955", "author": {"steamid": "76561198037172871", "num_games_owned": 22, "num_reviews": 1, "playtime_forever": 19212, "playtime_last_two_weeks": 0, "last_played": 1513964897}, "language": "english", "review": "Very Very fun always good to come back to.", "timestamp_created": 1453502254, "timestamp_updated": 1453502254, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20650787": {"recommendationid": "20650787", "author": {"steamid": "76561197961778383", "num_games_owned": 57, "num_reviews": 11, "playtime_forever": 17964, "playtime_last_two_weeks": 0, "last_played": 1454553999}, "language": "english", "review": "Innovative and epic game.", "timestamp_created": 1453330002, "timestamp_updated": 1453330002, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.594124", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20098356": {"recommendationid": "20098356", "author": {"steamid": "76561197997754212", "num_games_owned": 193, "num_reviews": 1, "playtime_forever": 12821, "playtime_last_two_weeks": 0, "last_played": 1450195127}, "language": "english", "review": "Fun game. The food mechanic makes for a challenge. It's like merging a Total War campaign map with their battle map. The unit variety is pretty limited, but the map is huge. You can easily throw hundreds of hours at it.", "timestamp_created": 1451437471, "timestamp_updated": 1451437471, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19240238": {"recommendationid": "19240238", "author": {"steamid": "76561198110194578", "num_games_owned": 61, "num_reviews": 17, "playtime_forever": 59, "playtime_last_two_weeks": 0, "last_played": 1448315482}, "language": "english", "review": "bad graphics but good game love the campiagns", "timestamp_created": 1448313746, "timestamp_updated": 1448313746, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18960220": {"recommendationid": "18960220", "author": {"steamid": "76561198067757236", "num_games_owned": 21, "num_reviews": 2, "playtime_forever": 80, "playtime_last_two_weeks": 0, "last_played": 1455155496}, "language": "english", "review": "It's finally working thus I'm having fun now Just unstall it if the error message pops up then reinstall it then it shall play!", "timestamp_created": 1447015365, "timestamp_updated": 1454389882, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "17014161": {"recommendationid": "17014161", "author": {"steamid": "76561198010890055", "num_games_owned": 97, "num_reviews": 5, "playtime_forever": 2043, "playtime_last_two_weeks": 0, "last_played": 1459339253}, "language": "english", "review": "An epic strategy game which has a great potential. Playing this game is like playing chess :) \n\nEpic history of Ancient Greece. Well done guys!", "timestamp_created": 1436725171, "timestamp_updated": 1436725171, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.532430", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "16933907": {"recommendationid": "16933907", "author": {"steamid": "76561197992175965", "num_games_owned": 1109, "num_reviews": 158, "playtime_forever": 877, "playtime_last_two_weeks": 0, "last_played": 1420171438}, "language": "english", "review": "I really like these games. It's like if the Total War games were all Real-time but scaled down to a more manageable, non-turnbased level. There are dozens of factions to choose from each with strengths and weaknesses and varied starting positions. If you don't want to play the grand campaign that focuses on Greece and parts of Western Anatolia, you can try to unite Greece as Philip of Macedon. You've got supply lines, varied unit types, naval combat, raiding, infrastructure and so much more. It's definitely a blast for anyone interested in either Real-time Strategy, 4x or Ancient Warfare.", "timestamp_created": 1436308808, "timestamp_updated": 1436308808, "voted_up": true, "votes_up": 12, "votes_funny": 7, "weighted_vote_score": "0.586339", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "16745210": {"recommendationid": "16745210", "author": {"steamid": "76561197972136508", "num_games_owned": 89, "num_reviews": 1, "playtime_forever": 10133, "playtime_last_two_weeks": 0, "last_played": 1500037216}, "language": "english", "review": "The game is very well done. I played the Demo when it first came out and fell in love with it.", "timestamp_created": 1435429532, "timestamp_updated": 1435429532, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "16343379": {"recommendationid": "16343379", "author": {"steamid": "76561198093364625", "num_games_owned": 55, "num_reviews": 18, "playtime_forever": 19512, "playtime_last_two_weeks": 0, "last_played": 1501557726}, "language": "english", "review": "An epic game that lets you build an empire and dominate the future of Western civilisation. Highly recommended.", "timestamp_created": 1434155550, "timestamp_updated": 1434155550, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.563271", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "16319580": {"recommendationid": "16319580", "author": {"steamid": "76561198030980450", "num_games_owned": 172, "num_reviews": 156, "playtime_forever": 672, "playtime_last_two_weeks": 0, "last_played": 1511386585}, "language": "english", "review": "Try combo B with tofu first. \n\n10/10 would come back to dine.", "timestamp_created": 1434077692, "timestamp_updated": 1434077692, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.397685", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "14912369": {"recommendationid": "14912369", "author": {"steamid": "76561198042196566", "num_games_owned": 1490, "num_reviews": 8, "playtime_forever": 5935, "playtime_last_two_weeks": 0, "last_played": 1430054931}, "language": "english", "review": "By far the best representation of Ancient Greek warfare I've come across in a video game. A great complement to the History of the Peloponnesian War.\n\nCons:\n- Clunky interface\n- The campaign is very long, and as such gets quite repetitive by the end.", "timestamp_created": 1426464964, "timestamp_updated": 1426464964, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "14654569": {"recommendationid": "14654569", "author": {"steamid": "76561198059476399", "num_games_owned": 102, "num_reviews": 2, "playtime_forever": 1486, "playtime_last_two_weeks": 0, "last_played": 1459720736}, "language": "english", "review": "If you're me, you'll immediately pick this game up without looking at the reviews because you're a Greek History nerd.  If you're me again, you are deeply satisfied with the results.\nHegemony Gold is a game set during the wars of Ancient Greece, specifically around Philip II and the Peloponessian war.  Instead of a game like Total War, all battles are set on the same map and provide a difficult challenge.  You have to make sure your troops have sufficient morale and food or else they'll rout and either be captured and executed, or have to reform at the nearest city.  It basically focuses more on the logisitics of war than the battles.  Very interesting and highly recommended.", "timestamp_created": 1424908119, "timestamp_updated": 1424908119, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.558011", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "14397601": {"recommendationid": "14397601", "author": {"steamid": "76561198006926854", "num_games_owned": 32, "num_reviews": 3, "playtime_forever": 4577, "playtime_last_two_weeks": 0, "last_played": 1493154942}, "language": "portuguese", "review": "Do you like Empire-building?\nDo you like real-time battles?\nDo you like innovative supply mechanics?\nDo you like to be challenged by winter as your prepared campaign stumbles into an enemy force not previously scouted, running into supply shortage and suffering massive casualties?\n\nEven if you don't, you will like it now! Guaranteed.\n\n9/10", "timestamp_created": 1423449036, "timestamp_updated": 1423450631, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "13939181": {"recommendationid": "13939181", "author": {"steamid": "76561198060362442", "num_games_owned": 114, "num_reviews": 9, "playtime_forever": 2240, "playtime_last_two_weeks": 0, "last_played": 1487990776}, "language": "english", "review": "I like the historical aspects of this game. I also like the historical accurate units and buildings and like. What I do not like is that you fit 40 slaves into a mine, and that is it, any over, you dont get any more income. I dont like that the recruiting is 1.9 or .5 a wk depending on settler size of city, now it maybe historically correct but discounting the national unity and the drive at which philp gave to drive out any invading army is also abismal at best. He recruited on loans of money and patriotism. Now with all that said, I like the mechanic that is used to simulate revolts. \n\nI will say over all that this game is worth cosideration at a lower price due to my dislikes and the fact that there is no real \"set mining material to refine\" mechanism. I mean you get the locations of mines, but not the products of the mine or the actual costs for the materials. That would make the game more interesting instead of capping mines at 40 slaves to make 80 coins a turn and there is no budget really other than income vs expense so no way to really do anything beyond yearly reports.\n\nI know I am probably being alot more critical of the games than most people but honestly I have done research, quite alot recently, and found that most games dont really want to go into how economies or military actions, etc actually affect the population nor how it affects international diplomacy. I am not knocking the developers by any means. They did a great job of the historical elements. I just hope that they have planned for the new one more units and more economy and more historical events. \n\nA suggestion to the developers for the new game, Add Galleys... Galleys and Gladass were ships that helped most countries rule the Med region for years. I am shocked that you didnt add at least a shortened version for the greek campaigns... Unless you just coupled them with Thrimes. Then I understand.", "timestamp_created": 1420970775, "timestamp_updated": 1420970775, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.443826", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "13933794": {"recommendationid": "13933794", "author": {"steamid": "76561198000619523", "num_games_owned": 341, "num_reviews": 24, "playtime_forever": 2296, "playtime_last_two_weeks": 0, "last_played": 1503848436}, "language": "french", "review": "Jeu de stratégie en temps réel avec pause active (type Paradox), ce jeu est une pure merveille pour les fans de guerre \"réaliste\". \n     En effet le jeu est centré sur les villes, chaque troupe provenant d'une cité, c'est à dire que les renforts seront prélévé directement dans la population de sa ville d'origine, ce qui oblige à une rotation des armées sous peine de manque d'hommes.\n     De plus chaque armées ne peut emmener qu'une quantité fixe de raviltaillement, elle doivent rester dans votre territoire pour que les villes puissent les fournir, et ici aussi chaque ville doit envoyer de ses propres réserves; pour clarifier si vous groupez vos troupes, vous avez des risques de famine car le grain doit traverser votre empire, mais chaques routes à une capacité limité de \"transfert\", ce qui créé des goulots d'etranglement logistique très interessants.\n     La campagne est très longue (une seule ville au début, plus de 200 à conquerir), et est vraiment sympa car chaque région à sa propre quète (en réalité une série d'objectifs divers qui débloque des héros ou diverses récompense) ce qui donne à chaque front sa particularité (on a pas l'impression de \"blober\"). La diplomatie est présente et poussée, l'IA étant assez réaliste à ce niveau là.\n\n     En fait la seule raison qui ne m'a pas (encore) fait dépassé la centaine d'heures est justement ce soucis du détail. On est litteralement noyé sous les informations en une vingtaine d'heure (je controlais 25-30% de la map en gros) et les options de controle d'IA maccro ne sont pas assez poussées/efficaces, et on perd son temps avec des \"détails\". Alors certes c'est réaliste, ça donne une inertie comme tout grand empire, mais votre cerveau va saturer sous la masse. De plus il y'a beaucoup d'events historiques, certains vraiment abusés pouvant couler votre empire si non anticipés. Un conseil, sauvegarder souvent!\n\n    J'ajouterai que je trouve cet épisode là plus interessant que sa suite, Hegemony Rome.", "timestamp_created": 1420936118, "timestamp_updated": 1480768072, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.509400", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "13852260": {"recommendationid": "13852260", "author": {"steamid": "76561198125035616", "num_games_owned": 47, "num_reviews": 1, "playtime_forever": 8598, "playtime_last_two_weeks": 0, "last_played": 1505247694}, "language": "english", "review": "Hegemony is my favorite strategy game because the developers filled it to the brim with their love and care, which is 100 times more important than what I term \"technical graphics\" - number of polygons and texture detail. The game truly captures the feeling of ancient warfare by altering accepted gameplay; For example, building town walls makes occupied cities more likely to rebell and thus requires larger garrissons (why shouldn't they feel more secure and independant behind walls?). They have also shifted the scope of the warfare, from the genre's standard province by province conquest, we now have a methodical, strategic border creep, city by city. \n\nThis game gave me some amazing moments. The most recent from when I first started the Spartan campaign. I felt resonably confident and thus cranked up the difficulty all the way. It started off well, I controlled a single island-city on the Ionian coast, which is perfect for figuring out your surroundings. Yet, I had sufficent numbers of spartan recruits and a large subsidy from home to be comfident. Then I made my biggest mistake, by building more ships and an extra brigade. I was dangerously overstretched and thoughtlessly attacked the closest city on the Athenian-held coast with my hoplites. Unexpectedly, the city was reinforced, my spartans lost and I deep in desperation. I felt just like the Athenians after Sicily.\n\nMy army was rebuilding, yet my manpower was used up by either replacing ships killed when I was't looking or still under construction from my earlier expansion. So, I used my single remaining ship to transport a starting spearman brigade to the south (spearmen are this game´s equivalent of WW2 France). There lay a tiny island city basicly undefended and even my spearman brigade could capture it. It had neither farms nor mines. It didn't matter, I only wanted it's manpower. I thus used it as a naval base, freeing up my spartans for infantry. That is beacause captured cities can only produce mercenaries, which means expensive, second-rate troops. They can still produce ships at the same price and quality - wood is wood and ships are ships.\n\n My main base was still short on manpower and for the remainder of the year, I had to cower behind my walls as the Athenians burnt my fields. I knew I would take my revenge upon them, yet all I could do was send my spearmen to do the same to them. I knew I would later take that city, fisting my hands. I soon did.", "timestamp_created": 1420484209, "timestamp_updated": 1420484209, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "13780777": {"recommendationid": "13780777", "author": {"steamid": "76561198165875318", "num_games_owned": 6, "num_reviews": 3, "playtime_forever": 5949, "playtime_last_two_weeks": 677, "last_played": 1516366334}, "language": "english", "review": "i recommend to buy this game", "timestamp_created": 1420194952, "timestamp_updated": 1420194952, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "13714806": {"recommendationid": "13714806", "author": {"steamid": "76561198022898758", "num_games_owned": 28, "num_reviews": 6, "playtime_forever": 19, "playtime_last_two_weeks": 0, "last_played": 1420111596}, "language": "english", "review": "This lloks like a great game, bought it on Christmas Day well I thought..........\nIf I can get to play, its not working/booting or whatever, here we go again.\nSteam suggest a simple automated solver, no\n\nSteam then passes it over to the publishers, well thank god.\nA little help and a few suggestions we made it work.\nPlayed afew hours now looks intresting for the money and good statergy games are hard to find.\n\nSOLUTION....Game has to be run/started from\n\nC:\\Program Files (x86)steam/steamapps/common folders", "timestamp_created": 1419953010, "timestamp_updated": 1420200590, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "13630496": {"recommendationid": "13630496", "author": {"steamid": "76561197995724960", "num_games_owned": 635, "num_reviews": 7, "playtime_forever": 8161, "playtime_last_two_weeks": 0, "last_played": 1420954585}, "language": "japanese", "review": "[h1]テーマ[/h1]\n\nアレクサンドロス大王の父親、マケドニア王フィリッポス二世となって紀元前の古代ギリシアを統一していくゲーム。信長の野望で言えば信秀の野望と言えそうなスポットの当て具合は地味でマニア好みだけれど、岩明均の描くヒストリエのファンであれば当時のマケドニアの先進的なイケイケ具合がぐっと馴染み深いはず。\n\n[h1]シームレスな戦略・戦術マップ[/h1]\n\nゲーム的にはTotalWarのような会戦RTS。しかし部隊操作の規模感としてはTWの半分か3分の1程度。その代わりTWのようなターン制の戦略フェイズとRTSの戦術フェイズに分かれること無く、シームレスに一体化した戦略と戦術操作ができるのが特徴。マップをズームインすればフィールド上で戦うRTSの部隊操作になり、マップをズームアウトすると古地図の上に並べられたチップとして表示されるのはR.U.S.E.と似ている。これを中途半端と見るか、うまく両立させていると捉えるかで評価の向きが変わるんじゃないかと思う。\n\n[h1]淡々と目標をこなす[/h1]\n\nマケドニアの擁する重装歩兵ファランクスは当時の最強ユニットであり、とにかくまともに戦えばどこでも敵無し。進軍していけばいいだけなので、この単調具合が好きかどうかも評価の分かれそうなところ。北方にはイリュリア人などの山岳勢力、南には中央ギリシアの都市国家、東方にはトラキアやペルシア勢力、海からはアテネが上陸スパムをかけてくる。これらをとにかく倒して四方に進出すれば良いわけだけど、どの順番でどう平定していくかは自由。各地域には達成目標が設定されていて、指定された都市を攻略すると予算が増えたり部隊が増えたりする。その場その場でやるべき目標が提示されてそれを淡々とこなしていくのは単調な進軍っぷりとは相性が良い。\n\n[h1]兵站を重視した部隊運用[/h1]\n\n最強と言えどもファランクスには弱点も有り、課題としてはその運用となる。部隊人数が多いので人員や食料消費が多いし、重装で足も遅い。ファランクスを何部隊もまとめて同じ戦線に投入しても過剰戦力だし、前線の食料は尽きてしまうし、別の地域の敵に対処しづらい。なので領土が拡大するに従い、各地域にファランクスを中心として投槍・弓兵、騎馬兵を伴った部隊を配備して、限定戦力で戦っていく運用感となる。\n\nまたファランクスは投槍には滅法弱いので、単身で突っ込むと敵後方からの射撃によってあっさり潰滅してしまう。そのためこちらも射撃ユニットで応戦したり、騎兵で裏に回りこんで叩くといった兵科の協調がRTS戦術パートとして重要になる。\n\n[h1]まとめ[/h1]\n\nグラフィックもパッとしないし、題材もアツいけど地味だし、とにかく淡々としてて、特にTotalWarなんかに比べると映画的スペクタクルは到底及ばない。でも小競り合いを繰り返して徐々に進出していく感じがプレイ感としてだいぶ気楽だし、古代の戦争としてもこちらのコンセプトのほうが性に合ってる気もして、なんというかこれはこれ、といった良さがある趣き具合です。", "timestamp_created": 1419662846, "timestamp_updated": 1419665703, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.687404", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "13578644": {"recommendationid": "13578644", "author": {"steamid": "76561198169323644", "num_games_owned": 15, "num_reviews": 1, "playtime_forever": 17167, "playtime_last_two_weeks": 0, "last_played": 1506815851}, "language": "english", "review": "shit it doesnt work on windows pc and when it does its very slow", "timestamp_created": 1419463739, "timestamp_updated": 1419463739, "voted_up": false, "votes_up": 0, "votes_funny": 9, "weighted_vote_score": "0.170659", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "13572106": {"recommendationid": "13572106", "author": {"steamid": "76561198046569334", "num_games_owned": 26, "num_reviews": 7, "playtime_forever": 3844, "playtime_last_two_weeks": 0, "last_played": 1487980354}, "language": "english", "review": "Changed my review to recommend.  \n\nIf the game won't start, run it from the Steam folder on your computer directly.  It works then.\n\nThis is a great game that is simple in it's concept but difficult to master.  It is \"smaller\" in scope than the Total War games but has one thing they don't.  When fighting a tactical battle in Hegemony you are actually picking the terrain you will be on.  Unlike Total War where you are picking one of several pre-made tactical layouts.  In Hegemony, you *can* pick your place. \n\nGreat game for a very low price.  Steam should try and support it by at least putting the work arounds as a sticky topic.  \n\n\n\nSTEAM read this:   I would buy more expensive games from you but I can't trust that you work. You have no policy to handle complaints, so you won't see much $$ from me.", "timestamp_created": 1419442238, "timestamp_updated": 1420129331, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.458253", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "13439989": {"recommendationid": "13439989", "author": {"steamid": "76561198083597329", "num_games_owned": 105, "num_reviews": 9, "playtime_forever": 377, "playtime_last_two_weeks": 0, "last_played": 1459400753}, "language": "english", "review": "Just to be clear, Hegemony Gold: Wars of Ancient Greece is a far superior game to Hegemony: Rome.", "timestamp_created": 1418951102, "timestamp_updated": 1418951102, "voted_up": true, "votes_up": 20, "votes_funny": 4, "weighted_vote_score": "0.590615", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "13438987": {"recommendationid": "13438987", "author": {"steamid": "76561197984611927", "num_games_owned": 889, "num_reviews": 30, "playtime_forever": 1699, "playtime_last_two_weeks": 0, "last_played": 1444588366}, "language": "english", "review": "Very good tactical/strategy game.\n\nThough Hegemony Rome has improvements in many areas, this game feels more polished and just\n'flows' much more nicely.\n\nI would recommend this over H:Rome, unless you've played this one to death.\nThough after further updates H:Rome may get better, good even.\n\nIn the meantime, anyone looking for a really good strategy game with tactical battles, logistical management,\nand massive/grand scale; a game you can sink a ton of hours into, you've gotta give this game a shot.", "timestamp_created": 1418947124, "timestamp_updated": 1418947124, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.589238", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "12889631": {"recommendationid": "12889631", "author": {"steamid": "76561198049444603", "num_games_owned": 369, "num_reviews": 15, "playtime_forever": 1793, "playtime_last_two_weeks": 0, "last_played": 1392485197}, "language": "english", "review": "Has something a lot of strategy games are missing: supply lines. Every war campaign feels much more authentic now. You can also organize troops in cool looking battle lines with historical commanders in charge. Sometimes you don't have enough space for them though.\nWhat I think is very awesome about the game is the quest system through which the scenario is being developed. It is like when you zoom out you see a pillar in every region which tells you about the respective history based quest line. Looks very nice and fitting. And the story is not strictly linear! RECOMMEND.", "timestamp_created": 1415724526, "timestamp_updated": 1415724526, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.625922", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "12447257": {"recommendationid": "12447257", "author": {"steamid": "76561198007738697", "num_games_owned": 60, "num_reviews": 7, "playtime_forever": 632, "playtime_last_two_weeks": 0, "last_played": 1512691676}, "language": "german", "review": "Das Spiel ist sehr zu empfehlen und speziell für Rome Total War Spieler eine sehr gute Abwechslung.\n\nDie Karte ist sehr groß und umfasst Griechenland, sowie den südlichen Balken und die Küsten Kleinasiens. Die Regionen sind viel kleiner und detaillierter als in TW. Die griechischen Stadtstaaten und Anrainervölker wie Perser oder Illyrer bieten massig Abwechslung, speziell der Spielmodus \"Sandbox\" ist zu empfehlen, mit einem kleinen Stadtstaat ist die Schwierigkeit brutal. Denn man muß stets die Logistik und begrenzten Goldreserven im Auge haben. Zwingt auf Dauer zum Nachdenken, aber ist auch nicht so, dass man sich nur damit befassen muß. Es bleibt also genug Zeit für die Eroberung.\n\nEinfach mal einen starken Nachbarn anzugreifen ist auch nicht einfach möglich, man muß bei Hegemony die Feldzüge gut planen, auch mit Blick auf die Jahreszeiten (Essen bunkern, Schafsherden etc.)\n\nDie KI ist zwar berechenbar, aber knallhart. Man steht grundsätzlich mit allen im Krieg.\n\nBesonderheiten sind außer der Logistik noch das Spielen in Echtzeit, die Schlachten finden auf der Kampagnenkarte statt. Die Leertaste ermöglicht aber jederzeit Verschnaufpausen, oft wird es hektisch und man steht fast immer unter Strom, durch regelmässige Überfälle von Außen (von Land und von See).\n\nMinuspunkte für die primitive Diplomatie und die Tatsache, dass die KI sich nicht untereinander bekriegt, die Grenzen der anderen bleiben also immer statisch.\n\nFazit:\nWer TW mag wird sehr wahrscheinlich auch Hegemony sehr mögen. Mal was anderes durch die Echtzeit, es hat nicht die Tiefe von Rome TW2, aber ist unterm Strich nicht schlechter. Ist schnell runtergeladen. Es gibt drei vorgefertigte Kampagnen oder freies Spiel (Sandbox). Das Spiel trotz der Minuspunkte langfristig abwechslungsreich\n", "timestamp_created": 1413026509, "timestamp_updated": 1413026509, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "12295978": {"recommendationid": "12295978", "author": {"steamid": "76561198090336857", "num_games_owned": 38, "num_reviews": 5, "playtime_forever": 1214, "playtime_last_two_weeks": 0, "last_played": 1466727474}, "language": "english", "review": "A deeply clever little game. Not for everyone, and a few (modest) historical liberties have been taken, but it models ancient warfare in a way that feels authentic -- much more so than the Total War series, which it superficially resembles. In fact, the Hegemony series' zoomable realtime map is what CA should have been doing years ago.\n\nThis is a game about operational planning as much as tactics and strategy -- army composition, march order, recon, logistics and timing are essential to victory -- and each region is almost a sort of puzzle to be solved. Approach it as a new kind of challenge, rather than a conventional 4x, and you might be pleasantly surprised.", "timestamp_created": 1412041629, "timestamp_updated": 1412041629, "voted_up": true, "votes_up": 15, "votes_funny": 1, "weighted_vote_score": "0.641563", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "12090280": {"recommendationid": "12090280", "author": {"steamid": "76561198066006112", "num_games_owned": 44, "num_reviews": 2, "playtime_forever": 2121, "playtime_last_two_weeks": 0, "last_played": 1496003015}, "language": "english", "review": "It's as promising as it tells it is, except for diplomacy which is kindof limited but more than enough (heck, it's greek city-states: Why ally with neighbours while you have your own hegemony/league?).\n\nAlso, the game allows you to play differend kinds of factions with differend kinds of gameplay (for example, the Paeonians are mainly a cavalry faction with no hoplites, the Illyrians got no cavalry while having a huge empire so they have to focus on intelligent defending, and Crete has to rely on naval raiding-conquering tactics).", "timestamp_created": 1410647223, "timestamp_updated": 1410647271, "voted_up": true, "votes_up": 21, "votes_funny": 2, "weighted_vote_score": "0.692501", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "11797334": {"recommendationid": "11797334", "author": {"steamid": "76561198008627082", "num_games_owned": 172, "num_reviews": 30, "playtime_forever": 99, "playtime_last_two_weeks": 0, "last_played": 1471686028}, "language": "english", "review": "This game is very original, fun and smart, what do you need more in RTS game, it introduces new concept and the feels of it fit the ancient greece period well, graphics are not so good though but since it is an indie game I give them full respect, the next title will be better in everything including the AI, I am sure the developers will become big soon since the base and the concept of the game are original and tight.", "timestamp_created": 1408562564, "timestamp_updated": 1408562564, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.454115", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "11767216": {"recommendationid": "11767216", "author": {"steamid": "76561198018913670", "num_games_owned": 610, "num_reviews": 67, "playtime_forever": 4322, "playtime_last_two_weeks": 0, "last_played": 1476638790}, "language": "english", "review": "Who likes RTS games and Ancient Greece, check this out! A chilly nice game for endless hours of relaxed fun. For me: I am postive surprissed and found this game by mistake.... ;-) Try the demo and conquer greece! But play it longer than 10mins, you need a little time to get it.", "timestamp_created": 1408372198, "timestamp_updated": 1408372198, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.528734", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "10796398": {"recommendationid": "10796398", "author": {"steamid": "76561197989798328", "num_games_owned": 339, "num_reviews": 15, "playtime_forever": 1884, "playtime_last_two_weeks": 0, "last_played": 1473837105}, "language": "english", "review": "Simple and innovative game mechanics create one of the best strategy games there is...\n\n...except for Hearts of Iron 3.", "timestamp_created": 1403706960, "timestamp_updated": 1403706960, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.513147", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "10675790": {"recommendationid": "10675790", "author": {"steamid": "76561198006734119", "num_games_owned": 104, "num_reviews": 7, "playtime_forever": 2029, "playtime_last_two_weeks": 0, "last_played": 1501032219}, "language": "english", "review": "What a great game, lots of chalanges and yet simple enough to no bog down. I am loking at getting Hegemony Rome next. Recomended!", "timestamp_created": 1403461166, "timestamp_updated": 1403461166, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.489324", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "10531255": {"recommendationid": "10531255", "author": {"steamid": "76561198017358661", "num_games_owned": 1496, "num_reviews": 25, "playtime_forever": 1576, "playtime_last_two_weeks": 0, "last_played": 1381659120}, "language": "english", "review": "A mix between Grand Strategy and historical RTS.\n\nAnd no-one's ever pulled it off so perfectly before or since.", "timestamp_created": 1403202107, "timestamp_updated": 1403202107, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.526939", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "10296282": {"recommendationid": "10296282", "author": {"steamid": "76561197961022974", "num_games_owned": 139, "num_reviews": 1, "playtime_forever": 9, "playtime_last_two_weeks": 0, "last_played": 1401523973}, "language": "german", "review": "yesterday i bought the game and it dont start...i spend 20 euros and now for what - for nothing? had anyone the same problem?", "timestamp_created": 1401523777, "timestamp_updated": 1401523777, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "10171833": {"recommendationid": "10171833", "author": {"steamid": "76561198097093152", "num_games_owned": 106, "num_reviews": 1, "playtime_forever": 1738, "playtime_last_two_weeks": 0, "last_played": 1505317641}, "language": "english", "review": "ive played the demo and its good but the full game never stops loading", "timestamp_created": 1400522559, "timestamp_updated": 1400522559, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.372214", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "9799548": {"recommendationid": "9799548", "author": {"steamid": "76561198047182684", "num_games_owned": 31, "num_reviews": 4, "playtime_forever": 4508, "playtime_last_two_weeks": 0, "last_played": 1493796221}, "language": "english", "review": "This game is awesome. I love it honestly. The game covers a rare era in gaming, and it has very unique gameplay that makes this so awesome.", "timestamp_created": 1397331980, "timestamp_updated": 1397331980, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.552960", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "9487383": {"recommendationid": "9487383", "author": {"steamid": "76561198026945236", "num_games_owned": 276, "num_reviews": 5, "playtime_forever": 4298, "playtime_last_two_weeks": 0, "last_played": 1394584308}, "language": "english", "review": "A brilliant combination of tactical and strategic decision making. I've never seen a game put such an intuitive and accessible logistics system into a game. Doing fast raids to burn farms is actually worthwhile and properly rewarded.", "timestamp_created": 1394886347, "timestamp_updated": 1394886347, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.570942", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "9418983": {"recommendationid": "9418983", "author": {"steamid": "76561197975463343", "num_games_owned": 219, "num_reviews": 4, "playtime_forever": 13501, "playtime_last_two_weeks": 0, "last_played": 1485948061}, "language": "english", "review": "Rikitgt fläskig strategi. Innovativt och episkt. Von Clausewitz in i kärnan.", "timestamp_created": 1394541207, "timestamp_updated": 1394541207, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.456568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "9404165": {"recommendationid": "9404165", "author": {"steamid": "76561198007212397", "num_games_owned": 295, "num_reviews": 1, "playtime_forever": 4752, "playtime_last_two_weeks": 0, "last_played": 1395022024}, "language": "english", "review": "Hidden gem!", "timestamp_created": 1394404181, "timestamp_updated": 1394404181, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.544134", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "9362324": {"recommendationid": "9362324", "author": {"steamid": "76561198007856646", "num_games_owned": 202, "num_reviews": 1, "playtime_forever": 13147, "playtime_last_two_weeks": 0, "last_played": 1501053248}, "language": "english", "review": "I love this Game. Played so much. Such Satisfaction. Play as the Persians and change the course of history and utterly destroy those pesky Greeks. Western thought be damed all hail the God KING!!! or Play as Athens and take over Persian anatolia instead of Alexander, maybe play as Sparta and lead the greek armies or stuff up history untterly and play as a tribe living near the Danube river and destory both Greece and Persia. The map is seemless zooming all the way in looking at your capital then zooming out to see the progress of your Hoplites in a battle in seconds. The game looks simple and easy to manage after a few hours of getting the ropes. Which is good, peaceful infact when compaired to Franchises like Paradox or Total war. However don't be fooled, It might seem simple but you will have desk slamming moments if your not prepared to defend against sudden attacks. Horsmen riding in on there dammed horses oh so evily taking out farms just before winter. Before you know it you have a huge food deficit. Your new conquests start rebelling, ohh whats that? (sigh) oh great Athens has arrived on the other side of your empire with 6 ships packed of Hoplites wanting there city back. One of 2 things could happen you laugh gleefully as you mange to wipe out the invaders or..........Laugh gleefully in a few seasons in game taking it all back and Executing all the enemies that surrended to your blood bathed armies. REVENGE!!!! The map is huge with many places ploped in if you know your Greek lore and Mythology with a decent amount of historical facts tossed in for good measure.  With 3 campains and a sandbox mode able to pay as any faction. Some people may complain about the lack of diplomacy but who needs it. Old men talking to old men to form alliances and such is such a drag to the young, fit and ready to campaign hoplites just conquer it all. If anyone has an interest in classical era Greece then this is the game for YOU! if you like Phillip II of Macedon and his son Alexander and his rise, this is the game for YOU! If you enjoy the 30 years peloponnesian war with one campaign centered on the Athenian Empire and the Other on the Spartan led Peloponnesian league, then this is a game for YOU! if you like conquest, Then well yes you guessed it, you should just get this game. This company just released their new title Hegemony Rome where you can play as Gaulic tribes and Julius caesar taking it for Rome then you should just get BOTH GAMES!", "timestamp_created": 1394115018, "timestamp_updated": 1394115173, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.540079", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "9307951": {"recommendationid": "9307951", "author": {"steamid": "76561198007681709", "num_games_owned": 74, "num_reviews": 2, "playtime_forever": 14, "playtime_last_two_weeks": 0, "last_played": 1337324400}, "language": "english", "review": "I simply cannot believe when I read this comments here, some people wrote bad review about this game, then recommend the game to others ?! I woudn t recommend this game to anyone, because game is simply bad and poor, maybe good idea, but bad realisation. My opinion 3/10!", "timestamp_created": 1393701692, "timestamp_updated": 1393701692, "voted_up": false, "votes_up": 5, "votes_funny": 2, "weighted_vote_score": "0.147650", "comment_count": "9", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "9218113": {"recommendationid": "9218113", "author": {"steamid": "76561197993064847", "num_games_owned": 78, "num_reviews": 17, "playtime_forever": 1519, "playtime_last_two_weeks": 0, "last_played": 1423687676}, "language": "english", "review": "I've played this game over 200 hours (not on steam i've also got a non drm version). This is one of the best strategy games i have ever played. It has is problems :AI only raides and not really attack you, AI armies builds are kinda strange and AI does some stupid things like not changing the home of a unit without one. But the scale, the managing of food/units/reserves etc. is extremly fun and satisfying.  Zooming in and out feeling like a real commander, caputering slaves and let them carry food, fighting over flocks of sheep (to be honest that is cool :P) and the biggest plus is the campaign witch you can play on your own pace, you can follow the missions you wanted and in your own order. I just an all out great strategy game like I never seen before. It is a bit dated and part II is coming (Rome still in early acces). Just buy this game, have fun and wait for Rome to go out of early acces and have even more fun. The developpers are also great guys, listining to the community via there own forum and the steamhub, support indie devs and buy this hidden gem! I give this game a 9 out of 10.", "timestamp_created": 1393075808, "timestamp_updated": 1393075808, "voted_up": true, "votes_up": 17, "votes_funny": 2, "weighted_vote_score": "0.638975", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "9121354": {"recommendationid": "9121354", "author": {"steamid": "76561198024834331", "num_games_owned": 95, "num_reviews": 1, "playtime_forever": 6117, "playtime_last_two_weeks": 0, "last_played": 1431105806}, "language": "czech", "review": "Tato hra neni pro každého hráče, když chcete vizuálně krásné bitvy tak si kupte něco ze série Total War, ale když chcete pořádnou válečnou strategii a nemáte moc vysoké nároky na grafiku tak toto je pro vás jasná volba. Mě osobně se ta hra velice líbí, hned z několika důvodů. Třeba v serii Total War vám stačí dobýht hlavní město regionu a tím to hasne.....Tady musíte obsadit několik měst a někdy i pevností, aby jste si podmanily celý region. Například, aby jste dobyli Malou Asii tak musíte přibližně obsadit 30 měst a pevností. A to není vše.....narozdíl od serie Total War musíte své vojáky krmit.......ne jednou se mi stalo, že jsem táhnul hluboko do hor a tam mi došli zásoby a mí vojáci byli poté zmasakrování jako v Teutoburském lese. A co teprv když si obsadíte kus velké země tak nástává problém v shromažďování zásob a vojáků.....třeba na dobytí Athén jsem skoro hodinu shromažďoval vojáky, proviant a lodě.\nBitevní taktika je dost strohá.....Total War vám v tomto ohledu vám nabídne mnohem více, ale na druhou stranu strategii si tady užijete mnohem víc.\nRozhodně ji doporučuju pro hráče, kteří mají rádi strategie a ví něco málo o bitevní taktice a válečné strategii.\n", "timestamp_created": 1392475427, "timestamp_updated": 1392475427, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502262", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "9063984": {"recommendationid": "9063984", "author": {"steamid": "76561197972321409", "num_games_owned": 256, "num_reviews": 2, "playtime_forever": 5516, "playtime_last_two_weeks": 0, "last_played": 1485609080}, "language": "english", "review": "Amazing game, say no more. It has everything I wanted in a strategy game. I would recommend this to anyone who likes strategy games.", "timestamp_created": 1392213933, "timestamp_updated": 1392213933, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.497942", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "9024572": {"recommendationid": "9024572", "author": {"steamid": "76561198006614873", "num_games_owned": 163, "num_reviews": 12, "playtime_forever": 591, "playtime_last_two_weeks": 0, "last_played": 1410918898}, "language": "english", "review": "Are you a history nerd?\nDo you have an IQ that allows you to execute a previously developed plan while compensating for uncertainties ?\nDo you not care about your game looking like it came out in 1998 ?\n\n\nThan this game is for you bud !", "timestamp_created": 1391903319, "timestamp_updated": 1391903319, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.476378", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "8955407": {"recommendationid": "8955407", "author": {"steamid": "76561198041547911", "num_games_owned": 671, "num_reviews": 18, "playtime_forever": 1749, "playtime_last_two_weeks": 0, "last_played": 1391375858}, "language": "english", "review": "This is truly one of my favorite strategy games!", "timestamp_created": 1391376599, "timestamp_updated": 1391376599, "voted_up": true, "votes_up": 3, "votes_funny": 2, "weighted_vote_score": "0.507692", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "8804708": {"recommendationid": "8804708", "author": {"steamid": "76561198008961837", "num_games_owned": 707, "num_reviews": 14, "playtime_forever": 2587, "playtime_last_two_weeks": 0, "last_played": 1473305687}, "language": "english", "review": "A rich, unique grand strategy experience that manages to deliver a fair amount of tactics to boot! It's the only game, that I know of, that allows you to fight the Peloponnesian War (yay triremes!), so it's a must have for any Thucydides fans out there (you know who you are). The $20 price tag is fair considering how many hours of gameplay you can squeeze out of it; if you can manage to grab it on a sale so much the better. Overall I'm very impressed with it, especially considering it was made by four people...", "timestamp_created": 1390371510, "timestamp_updated": 1390371510, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "8778742": {"recommendationid": "8778742", "author": {"steamid": "76561198084127712", "num_games_owned": 20, "num_reviews": 4, "playtime_forever": 1521, "playtime_last_two_weeks": 0, "last_played": 1458771048}, "language": "english", "review": "This game is THE shit man. It had me on the edge of my seat, sending phalanx brigades to all of my borders, and almost pissing myself when the combat music comes on, I HIGHLY reccomend it due to historical accuracy, strategic excellence, and just FUN!\nThe only bad part is that most units of really low morale, so you can lose easily if you aimlessly throw peltasts at Phalanx units.", "timestamp_created": 1390189325, "timestamp_updated": 1390189325, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "8690402": {"recommendationid": "8690402", "author": {"steamid": "76561198022655593", "num_games_owned": 137, "num_reviews": 8, "playtime_forever": 81, "playtime_last_two_weeks": 0, "last_played": 1376108289}, "language": "english", "review": "Its fun to play, but it doesn't take long until you notice yourself becoming bored at times.  I spent $20 on the game and from the experience, I wouldn't buy this game unless it was on sale.", "timestamp_created": 1389603162, "timestamp_updated": 1389603162, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.482094", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "8564705": {"recommendationid": "8564705", "author": {"steamid": "76561197990375921", "num_games_owned": 91, "num_reviews": 4, "playtime_forever": 72888, "playtime_last_two_weeks": 0, "last_played": 1498438489}, "language": "portuguese", "review": "good game  note 10 for this one", "timestamp_created": 1388887661, "timestamp_updated": 1388887661, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "4.980100", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "8561251": {"recommendationid": "8561251", "author": {"steamid": "76561198007190245", "num_games_owned": 57, "num_reviews": 1, "playtime_forever": 2354, "playtime_last_two_weeks": 0, "last_played": 1504798743}, "language": "english", "review": "Good RTS. Worth getting if interested in greek history.", "timestamp_created": 1388873552, "timestamp_updated": 1388873552, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.517906", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "8550344": {"recommendationid": "8550344", "author": {"steamid": "76561197960288185", "num_games_owned": 312, "num_reviews": 5, "playtime_forever": 5424, "playtime_last_two_weeks": 0, "last_played": 1368774000}, "language": "german", "review": "Tolle Einzelspieler-Kampagne die erst zum Ende hin ein wenig abflaut. Das Geld wars definitiv wert. Das Spiel braucht keine Strategischen Meisterleistungen, der Computer reagiert fast nur, statt selbst aktiv zu werden. Ziemlich einzigartige Features wie  die Nahrungsversorgung der Armeen halten den Spieler trotzdem auf trab. Vor allem die ersten ~10-15 Stunden sind wirklich toll und auch Anspruchsvoller. Schätze die komplette Spielzeit der Kampagne belief sich für mich auf ca. 50 Stunden und ich bin noch immer nicht ganz fertig.", "timestamp_created": 1388830922, "timestamp_updated": 1388830937, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.512771", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "8508554": {"recommendationid": "8508554", "author": {"steamid": "76561198007183380", "num_games_owned": 175, "num_reviews": 3, "playtime_forever": 1497, "playtime_last_two_weeks": 0, "last_played": 1452998994}, "language": "english", "review": "Players who e.g. like the Total War Series should give this a try as well as a low cost alternative. Unfortunately, there hasn’t been much marketing investment for the game overtime, though the concept is quite interesting. The game does not split up into a strategic and a battle map respectively, but lets the player scroll into the action from a more abstract point of view.\nThe fact that the player’s army size is limited, there are revolts, supply rules and the player faces at least constant skirmishes with his neighbours constitutes a permanent challenge. However, units gain experience, including the reduction of supply needs and the possibility to provide cities with walls helps the player to control his expanding territory. Furthermore the game is great for people interested in the history of the period. \nThough not overwhelming, graphics are actually lovely and it is definitely worth giving the game a try if you are a strategy gamer.\n", "timestamp_created": 1388670282, "timestamp_updated": 1388670282, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.565217", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "8326772": {"recommendationid": "8326772", "author": {"steamid": "76561198032574266", "num_games_owned": 552, "num_reviews": 1, "playtime_forever": 863, "playtime_last_two_weeks": 0, "last_played": 1366527600}, "language": "english", "review": "Ancient Battles for the Unification Of Greece. Highly Recommend!!!! Hidden Gem!!!!", "timestamp_created": 1388129452, "timestamp_updated": 1388129452, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.497669", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "8131354": {"recommendationid": "8131354", "author": {"steamid": "76561197963000314", "num_games_owned": 808, "num_reviews": 34, "playtime_forever": 9690, "playtime_last_two_weeks": 0, "last_played": 1443375060}, "language": "english", "review": "An interesting real time strategy game. You are Phillip conquering the city states of Greece to create your Hegemony. It is certainly a game that shows the trouble of directly maintaining a large empire. In the beginning, you only control a few cities which means it is easy to micromanage your troops. The map is very large, consisting of hundreds of cities, that you most likely need to capture to win. \n\n The big issue in this game is logistics. Troops need food, cities need supply lines with other cities and farms for food. You need supply lines to mines to secure income. There is no way to conquer the map with just one army. Troops need to resupply and replenish. Philip starts out surrounded by enemies around him. Expanding too fast in one direction will leave you overstretched. \n\nSome cities are very bothersome to invade. No farmland to sustain your armies means you need to either bring workers or sheep to resupply food. When you get there, they seem to have an army far too large for their food to accomodate, and you better hope that you win otherwise you have to assemble the troops again and march all the way across the map to try again. \n\nYou also need to watch that cities don't starve. If you conquered a city and they have no food, they will start to rebel. Ignore it too long, and you have to march troops to reconquer the city. Repeat that a couple dozen times and include a couple Greek powerhouses like Thebes and Athens that will constantly raid your cities. \n\nAnd then there is the whole land of Persia which seems to take up half the map. I haven't reached there yet, so I can't see how hard it will be. It will be a huge pain to muster troops from halfway across Greece to invade though.\n\nBuy this game if you like real time strategy games that start simple and become logistical nightmares as you progress.", "timestamp_created": 1387510013, "timestamp_updated": 1387510013, "voted_up": true, "votes_up": 70, "votes_funny": 2, "weighted_vote_score": "0.836516", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "8049040": {"recommendationid": "8049040", "author": {"steamid": "76561198062456518", "num_games_owned": 68, "num_reviews": 1, "playtime_forever": 2963, "playtime_last_two_weeks": 0, "last_played": 1507477935}, "language": "english", "review": "This game is soooo much better than what i had expected.  These guys really need some sort of marketing team because this game is legitamite but not known at aall. deffinetly buy this game if you love athens and sparta, ancient greece, RTS's and fun, 10/10", "timestamp_created": 1387073378, "timestamp_updated": 1387073505, "voted_up": true, "votes_up": 39, "votes_funny": 1, "weighted_vote_score": "0.694207", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "7833055": {"recommendationid": "7833055", "author": {"steamid": "76561198017741263", "num_games_owned": 380, "num_reviews": 3, "playtime_forever": 121, "playtime_last_two_weeks": 0, "last_played": 1421514354}, "language": "english", "review": "An excellent game that focuses on the life of Philip II of Macedon, Father of Alexander the Great.\nPros\n-Logistics system - your soldiers have to eat and that food has to come from somewhere. it makes burning farms and raiding supply lines a viable strategy for starving out a city. it also forces you to pay attention to the edges of your empire and protect the land outside the city.\n-Naval combat and landings - makes you want to murder every man, woman, and child in Athens.\n-Campaigns - The main campaign follows Philip as he conquers Greece. Two other campaigns focus on the Peloponnesian war (One as Athens and the other as Sparta). There is also a sandbox mode that lets you play any faction in the game. The scripted campaigns are the most fun.\nCons\n-Graphics are mediocre at best\n-Sandbox is bland - You can build an empire but the AI only reacts to you and rarely takes the initiative.\nOverall 8.5/10 - If the graphics don't bother you then any strategy gamer will really enjoy this game.\nNote - i know it says i only have two hours played, i bought the game from the Developors site before it was on Steam and played that version.", "timestamp_created": 1385766278, "timestamp_updated": 1391268947, "voted_up": true, "votes_up": 39, "votes_funny": 2, "weighted_vote_score": "0.749099", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "7827370": {"recommendationid": "7827370", "author": {"steamid": "76561198024731492", "num_games_owned": 176, "num_reviews": 13, "playtime_forever": 2400, "playtime_last_two_weeks": 0, "last_played": 1399396221}, "language": "english", "review": "Pausable Real-Time Strategy on a seamlessly zoomable, historically accurate map? Yes please! It's kind of like a combination of the Paradox titles and Total War, which, in my book, makes a winner. What we see here, are the very beginnings of the future of strategy games. This is a must have for all strategy fans and history buffs. Innovative and truly unique, Hegemony is developed by a small developer with limited funding, and sometimes it shows, but really, I cannot recommend this enough.", "timestamp_created": 1385747720, "timestamp_updated": 1385747720, "voted_up": true, "votes_up": 103, "votes_funny": 1, "weighted_vote_score": "0.851678", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "7372256": {"recommendationid": "7372256", "author": {"steamid": "76561198006703813", "num_games_owned": 132, "num_reviews": 4, "playtime_forever": 1153, "playtime_last_two_weeks": 0, "last_played": 1390771770}, "language": "english", "review": "Hegemony Gold: Wars of Ancient Greece is a nice strategy game spanning an historic map, with a variety of units to arrange as part of your tactical masterplan to reunite Macedonia and then following on from that the states of Greece.  Be sure to set up supply lines between the local farms and gold mines or you'll soon have starving citizens and run out of recruiting funds!  Great fun if you like Ancient Greek history and oldy worldy war games.", "timestamp_created": 1381613695, "timestamp_updated": 1388532106, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "1561186": {"recommendationid": "1561186", "author": {"steamid": "76561197994753759", "num_games_owned": 108, "num_reviews": 35, "playtime_forever": 284, "playtime_last_two_weeks": 0, "last_played": 1423460156}, "language": "english", "review": "One of the best indie strategy games I've played. Very deep and enjoyable game.", "timestamp_created": 1376450268, "timestamp_updated": 1391395312, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "105782": {"recommendationid": "105782", "author": {"steamid": "76561197961965121", "num_games_owned": 71, "num_reviews": 1, "playtime_forever": 5768, "playtime_last_two_weeks": 0, "last_played": 1403414210}, "language": "english", "review": "------------------------E L L H N E S-------------------\n\n\n", "timestamp_created": 1373594267, "timestamp_updated": 1373594267, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.513147", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "1811170": {"recommendationid": "1811170", "author": {"steamid": "76561197998314295", "num_games_owned": 891, "num_reviews": 160, "playtime_forever": 4, "playtime_last_two_weeks": 0, "last_played": 1358323200}, "language": "russian", "review": "занятная стратегия про междоусобные войны греческих полисов", "timestamp_created": 1358537845, "timestamp_updated": 1385409270, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.545929", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "2074381": {"recommendationid": "2074381", "author": {"steamid": "76561198001854537", "num_games_owned": 1288, "num_reviews": 36, "playtime_forever": 2518, "playtime_last_two_weeks": 0, "last_played": 1511697369}, "language": "spanish", "review": "Va por delante que a este juego lo jugué muchas horas antes de que saliera en Steam y tambien en su version \"Filipo de Macedonia\".\n\n\nUno de los mejores juegos que he tenido de estrategia. Combina tactica y estrategia en tiempo real y sin cargas. Tiene 3 pausas automaticas por alertas: escasez de alimentos, enemigos cercanos y combates. sistema de de red de suministros muy completa hasta el extremo de tener que planificar las campañas teniendo en cuenta tamaño de ejercito, estacion y lugar (pueden forrajear y acampar). Las unidades al combatir acumulan experiencia que puedes distribuir en 4 campos: asedios, autonomia de suministros, iniciativa (aguantan mas tiempo corriendo y/o cargando, asi como aumentan el campo de vision) y moral. Asi por ejemplo puedes especializar tropas para las escaramuzas o para la primera linea de combate y que aguanten mas castigo. Tiene un monton de misiones no lineales, muchas interrelacionadas entre si. Ademas muchas misiones tienen varios objetivos. las estaciones del año son muy importante para el inicio de campaña. No se pueden llevar ejercitos masivos sin planificar la ubicacion. He tenido batallas donde los ejercitos se han ido posicionando y y ha habido escaramuzas previas a la batalla principal. Se le puede cortar la retirada a los ejercitos enemigos que huyen. La IA entra en tu territorio con unidades moviles a quemar cosechas y derribat tus torres de vigilancia con el fin de cegarte y poder moverse a traves de tu s dominios y que no le veas el grueso de las tropas. Los esclavos pueden y deben recoger comida para acompañar a los ejercitos a las campañas. Aqui no funciona el \"todos a la vez \"  a la hora de atacar ya que existe el \"overcrowded\" que consiste en una penalizacion por acumulacion en el mismo sitio de soldados. Se puede defender con pocos guerreros un enclave, por ejemplo un paso al estilo de la peli 300. He llegado a aguantar con una falange y dos unidades de javalineros a mas de 4 falanges enemigas aprovechando el terreno y el overcrowd del enemigo. Es el unico juego donde he apreciado el hostigamiento a los ejercitos asi como las escaramuzas. El paso del mapa estrategico al terreno es continuo y sin carga. Las redes de suministros se pueden modificar y ampliar o reducir su capacidad de acuerdo a las necesidades de comida modulando el trasvase de comida entre ciudades como si fueran vasos comunicantes. Trae 3 campañas y un sandbox. Que mas quereis, es un juegazo que es facil de aprender ya que trae un tutorial que te va introduciendo en los conceptos del juego poco a poco.", "timestamp_created": 1354214339, "timestamp_updated": 1426421127, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.680946", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "1197481": {"recommendationid": "1197481", "author": {"steamid": "76561197989017101", "num_games_owned": 424, "num_reviews": 11, "playtime_forever": 407, "playtime_last_two_weeks": 0, "last_played": 1367478000}, "language": "english", "review": "This game is actually quite good, it certainly is a strategy game all it's own, it certainly doesn't beat any graphics contests and is not quite satisfying instantly, but as you forge an empire with supply lines and subjugate and enslave your enemies, continuously fighting new foes you begin to appreciate how great a game it really is, it's actually really hard to start snowballing, unlike most strategy I play. And if you want to, you can play as Persia or Scythia and conquer all those silly Greek states!", "timestamp_created": 1353884221, "timestamp_updated": 1353884221, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "4948872": {"recommendationid": "4948872", "author": {"steamid": "76561198043655734", "num_games_owned": 192, "num_reviews": 6, "playtime_forever": 2910, "playtime_last_two_weeks": 0, "last_played": 1507406390}, "language": "english", "review": "This may not be the super acton packed non stop blood and gore of total war, but this is a strategy game that makes you think about your campaigns, who they'll affect, and what new enemies you'll make from them\n", "timestamp_created": 1352321372, "timestamp_updated": 1352321372, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "2640951": {"recommendationid": "2640951", "author": {"steamid": "76561198010364083", "num_games_owned": 505, "num_reviews": 11, "playtime_forever": 7501, "playtime_last_two_weeks": 0, "last_played": 1372557749}, "language": "english", "review": "Very Good Game!!!!!", "timestamp_created": 1344927622, "timestamp_updated": 1344927622, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "66427": {"recommendationid": "66427", "author": {"steamid": "76561197961025630", "num_games_owned": 370, "num_reviews": 47, "playtime_forever": 457, "playtime_last_two_weeks": 0, "last_played": 1378384039}, "language": "english", "review": "This game is SICK! At ten dollars, this is the steal of the summer sale thus far. Combining elements of Grand Ages: Rome and Rome: Total War with some realistic tactical micro-management that really makes you plan ahead and not get too sloppy, Hegemony Gold is a game that will make anyone who always gauges the quality of a solid classical Empire-building Sim between the City micro-management and the combat system set this game as the new benchmark for utility.\n\nIt's just deep enough to be historically relevant and to make you think a bit before you act, but not so deep that you get lost in the details or want to bash the keyboard in frustration as there is just too much to be handled at once.\n\nHegemony Gold gives you just enough combat challenge to keep you on your toes while keeping a steady flow of the cycle of conquer, expand, and maintain element that keeps things realistic and challenging.This game is both challenging and fun, a real bargain and true gem.", "timestamp_created": 1343156382, "timestamp_updated": 1343156382, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "204936": {"recommendationid": "204936", "author": {"steamid": "76561197965181935", "num_games_owned": 622, "num_reviews": 17, "playtime_forever": 8978, "playtime_last_two_weeks": 0, "last_played": 1426866202}, "language": "english", "review": "Think a more accessible Total War, but all in real time, with one large seamless map, no loading screens for battles.", "timestamp_created": 1342463616, "timestamp_updated": 1342463616, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.527027", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "6393239": {"recommendationid": "6393239", "author": {"steamid": "76561198065324372", "num_games_owned": 51, "num_reviews": 7, "playtime_forever": 6664, "playtime_last_two_weeks": 0, "last_played": 1420345651}, "language": "english", "review": "Hegemony is a top tier real time strategy game. In it you must expand your starting kingdom through war and diplomacy. There is also historical campains which start in certain senarios, however I have not played these and therefore will not comment on them.\n\nPros:\n- In this game you have to plan your campains wisely, each season will directly impact food production, which is central to gameplay. The impact of feeding your troops (logistics) really deepens the campain over other strategy games such as total war.\n- The camera can be scrolled in and out to see the larger picture or into great detail. It reminds me of the supreme commander camera.\n- Aestheticly this game has an interesting \"board gamey\" style, with units lookng like peices on the board. I enjoy this art style as it is unique from other games.\n- The map is huge, and gives players vast areas to conquer.\n- There are small histroy notes scattered throughout the map which help immerse you (and are interesting to history buffs like me).\n- The music is simple but also helps immersion into the ancient greek world.\n\nCons:\n- The diplomacy in this game is very shallow, and boils down to paying your enemies enough so they will stop invading you so you can focus on eating another nation.\n- You will constantly be raided by Athens throughout the entire game, as Athens has naval island bases scattered throughout the greek world. This is not really a con as it gives a difficulty boost to the game, but it can be annoying.\n- The unit diversity is not very high. All the greeks have the same hopilites, barbarians have the same medium cav, thrace has the same peltasts. However, some of the greek factions have hopilites which are stronger in combat, some are stronger at seiges. Thracian petalst are vastly different to greek peltast. Persians have elite heavy cav. You will find the unit diversity to be simple, yet effective.\n\nIn conclusion, this is a very enjoying strategy game which is great for strategy gamers and history gamers. Given that this was developed by a small team, it is remarkable how polished, complete, and high quality it is. 9/10", "timestamp_created": 1340951443, "timestamp_updated": 1439001836, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "2880693": {"recommendationid": "2880693", "author": {"steamid": "76561198014003652", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 6344, "playtime_last_two_weeks": 0, "last_played": 1339138800}, "language": "english", "review": "Hegemony: Philip of Macedon was a brilliant but flawed game. Hegemony Gold: Wars of Ancient Greece squashes every bug, adds in tonnes of content, and stands as one of, if not THE best, Grand Strategy RTS games I've ever played. Engrossing, challenging without being frustrating, the mission based content is supremely satisfying, and the various scenarios can run to hundreds of hours of game time. I've never enjoyed painting a map my colour as much as I have here!", "timestamp_created": 1337187048, "timestamp_updated": 1337187048, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "2378758": {"recommendationid": "2378758", "author": {"steamid": "76561198006566531", "num_games_owned": 838, "num_reviews": 11, "playtime_forever": 1247, "playtime_last_two_weeks": 0, "last_played": 1399043756}, "language": "english", "review": "Great game, simple systems that make for intresting conflict, 3 campaigns and a \"choose any faction and go kill stuff\" mode. Shame it has no Multiplayer, but that doesn't matter considering it's so fun on your own.", "timestamp_created": 1336237425, "timestamp_updated": 1336237425, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "2355302": {"recommendationid": "2355302", "author": {"steamid": "76561198006254343", "num_games_owned": 180, "num_reviews": 4, "playtime_forever": 441, "playtime_last_two_weeks": 0, "last_played": 1336287600}, "language": "english", "review": "A quality strategy game. There is a bit of micromanaging involved in the military aspect that can get tedious but overall it has been a fun game to play. I also like the historical aspect and the diversity of unit types.", "timestamp_created": 1335637887, "timestamp_updated": 1335637887, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "2956461": {"recommendationid": "2956461", "author": {"steamid": "76561198015075204", "num_games_owned": 0, "num_reviews": 350, "playtime_forever": 46, "playtime_last_two_weeks": 0, "last_played": 1462163054}, "language": "english", "review": "Brilliant.", "timestamp_created": 1335097361, "timestamp_updated": 1335097361, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.401786", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "410588": {"recommendationid": "410588", "author": {"steamid": "76561197970435474", "num_games_owned": 710, "num_reviews": 84, "playtime_forever": 181, "playtime_last_two_weeks": 0, "last_played": 1407019603}, "language": "english", "review": "This is a fantastic strategy game. I owned it on retail before it was on steam. And it's a cut above the majority.\n\nIt is the sucessor to Philip of Macedon, a game i overlooked, but enjoyed when I tried the demo. But i always thought, this would be much better if you could play all the city states.\n\nGuess, what, in this you can! It may not be as fancy as total war, or as intense as hearts of iron but it has a lot of intricacy and detail, it is well worth a look. Especially if you like ancient greece.", "timestamp_created": 1334597426, "timestamp_updated": 1334597426, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.481991", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "509893": {"recommendationid": "509893", "author": {"steamid": "76561197971321708", "num_games_owned": 734, "num_reviews": 3, "playtime_forever": 3998, "playtime_last_two_weeks": 0, "last_played": 1359705600}, "language": "english", "review": "A huge and unique strategy game, where your supply lines are as leaast as important as your armies. Very much worth the price.", "timestamp_created": 1333632575, "timestamp_updated": 1333632575, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 107, "total_negative": 4, "total_reviews": 111}}
