{"query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 75, "total_negative": 1, "total_reviews": 76}, "reviews": {"38360957": {"recommendationid": "38360957", "author": {"steamid": "76561198005641309", "num_games_owned": 87, "num_reviews": 4, "playtime_forever": 194, "playtime_last_two_weeks": 0, "last_played": 1491489774}, "language": "english", "review": "As it says on the tin, it's an enjoyable, interactive period drama. While you won't find stunning graphics or hi-octane action, it's a very solid, if a bit short, adventure in the vein of Telltale Games. The story and dialogue are well written, and there are some interesting moral choices involved as well. Looking forward to more, as there are several interesting themes explored, that I'd like to see more of.", "timestamp_created": 1513460026, "timestamp_updated": 1513460026, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37615346": {"recommendationid": "37615346", "author": {"steamid": "76561198126555410", "num_games_owned": 393, "num_reviews": 3, "playtime_forever": 189, "playtime_last_two_weeks": 0, "last_played": 1499762491}, "language": "english", "review": "When I think of the concept of \"point and click\" game, this is now the game that pops into my head. The play time for the game is short, but the quality overall, from the writing, the worldbuilding, and the particular art style, is top notch. After playing through this game I was already excited for the following parts, and I think it speaks to the lasting impact that I continue to think about how much I enjoyed this. Definitely one for those interested in alternate histories and interesting worlds.", "timestamp_created": 1511668258, "timestamp_updated": 1511668258, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37485240": {"recommendationid": "37485240", "author": {"steamid": "76561198036649624", "num_games_owned": 587, "num_reviews": 86, "playtime_forever": 862, "playtime_last_two_weeks": 0, "last_played": 1511600702}, "language": "english", "review": "A strong game held back by a weak, confusing opening.\n\nThis game has a lot of strong points.  The graphics and 3D style are fantastic.  Beautiful and unique.  I've never played anything that looks and feels quite like it.  The soundtrack is fantastic, and is nicely integrated into the main story.\n\nThe only negative thing I have to say about it is that it really does flub the opening.  The game opens with a confusing sequence that doesn't really offer you anything to grab on to, and once that ends, you're dumped into a sequence that hints that the entire game will be some sort of a dry, retconed, alternate history that projects modern progressive values back onto the year 1851.  Making progress past all that feels like a bit of a slog, and doesn't give the player much reason to assume the entire game won't be more of the same.  But when the story finally gets moving, it REALLY gets moving.  You can actually feel the first moment when something interesting happens, because it's so striking.  \"Wait, what?  Does that mean what I think it means?\"  From then on out, the game is SOLID.\n\nIn fact, from then on out, the game moves so smoothly that the next thing you'll think to complain about is the cliffhanger at the end, as we wait for the conclusion.\n\nIn summary, you should absolutely play this if you're a fan of point & click adventure games with a strong story.  Just be prepared to give this one a very generous chance to get moving.  It will, if you let it.", "timestamp_created": 1511599967, "timestamp_updated": 1511600055, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.618938", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36807094": {"recommendationid": "36807094", "author": {"steamid": "76561197983121111", "num_games_owned": 532, "num_reviews": 14, "playtime_forever": 173, "playtime_last_two_weeks": 0, "last_played": 1503984953}, "language": "english", "review": "This is a refreshingly good modern point-n-click narrative game. While I wouldn't say this title would win people over on the genre every time, it is a great gem for folks who want something different in interactive narrative storytelling.", "timestamp_created": 1511384992, "timestamp_updated": 1511384992, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36450581": {"recommendationid": "36450581", "author": {"steamid": "76561197990289692", "num_games_owned": 259, "num_reviews": 9, "playtime_forever": 197, "playtime_last_two_weeks": 0, "last_played": 1510425409}, "language": "english", "review": "A very well crafted story and enjoyable story so far. It's got me hooked for whenever book 3 and 4 come out.", "timestamp_created": 1510425793, "timestamp_updated": 1510425793, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35894834": {"recommendationid": "35894834", "author": {"steamid": "76561198297856158", "num_games_owned": 29, "num_reviews": 3, "playtime_forever": 201, "playtime_last_two_weeks": 0, "last_played": 1493916411}, "language": "english", "review": "This is VERy good game,amazing graphics, voiceacting and INteresting story also!!! Too bad there isn't more games like this anymore--", "timestamp_created": 1508600517, "timestamp_updated": 1508600517, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.477707", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35352483": {"recommendationid": "35352483", "author": {"steamid": "76561198028393370", "num_games_owned": 78, "num_reviews": 1, "playtime_forever": 179, "playtime_last_two_weeks": 0, "last_played": 1506801245}, "language": "english", "review": "BLUF: Great game, movement mechanic is a bit clunky, but once you get the hang of it it stops being an issue. HIghly recommended for anyone who likes visual novels with branching decision making choices. \n\nMore details: Herald is an amazingly gorgeous experience. The situations on the boat are complex in nature and you're forced to make tough decisions about who Devan (the PC) is and who he chooses to support on the ship, Herald. The choices I made had really impactful consequences both good and bad. The artwork is stunning, the plot engaging, and the gameplay brisk and (mostly) unobstrusive to the story. \n\nI did find having to click my way around the ship somewhat agitating at first, but once I got about 20 minutes in I found that I was no longer thinking about it as much. Definitely give this game a chance. The first two books/episodes are well worth the 10 bucks.", "timestamp_created": 1506801844, "timestamp_updated": 1506801844, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35260971": {"recommendationid": "35260971", "author": {"steamid": "76561197971353375", "num_games_owned": 116, "num_reviews": 78, "playtime_forever": 13, "playtime_last_two_weeks": 0, "last_played": 1487890767}, "language": "english", "review": "Good game.", "timestamp_created": 1506602421, "timestamp_updated": 1506602421, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.429368", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34977067": {"recommendationid": "34977067", "author": {"steamid": "76561198268250352", "num_games_owned": 8, "num_reviews": 1, "playtime_forever": 334, "playtime_last_two_weeks": 0, "last_played": 1491272915}, "language": "english", "review": "Really gripping story, amazing art, and great gameplay. I'd recommend this game if you like to explore character motivations (including your own) because that's what this game is all about.", "timestamp_created": 1505495964, "timestamp_updated": 1505495964, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34783130": {"recommendationid": "34783130", "author": {"steamid": "76561198261300815", "num_games_owned": 6, "num_reviews": 2, "playtime_forever": 324, "playtime_last_two_weeks": 0, "last_played": 1510242018}, "language": "english", "review": "An interesting and engaging story, displayed in an atmospheric and enthralling world. \n\nHerald spins a tale of a relatable main character in a world only slightly different from our own 19th century. The amount of detail in both character design, writing and worldbuilding blew me out of the water. The richly animated 2D character portraits are nothing short of gorgeous and made me relate to the well-rounded characters. The 3D art is in general a lot less polished, but by no means ugly. The Indian palace that serves as the location for the frame story is a huge exception: it looks and feels wonderful.\n\nCan't wait for books III and IV!", "timestamp_created": 1504731657, "timestamp_updated": 1504731657, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34687921": {"recommendationid": "34687921", "author": {"steamid": "76561198023862056", "num_games_owned": 261, "num_reviews": 7, "playtime_forever": 163, "playtime_last_two_weeks": 0, "last_played": 1504365253}, "language": "english", "review": "Really enjoyed this. If you liked games like Life is Strange, Telltale, Dreamfall chapters, then you might enjoy this too.\nIt's not particularly long, but still really enjoyable and very polished. There was a lot more interaction than I was expecting; the screenshots made it seem a lot more text based than it really is - it's almost entirely fully voiced and there's a lot of exploring the ship.\n\nI'm surprised this game hasn't had more attention! I don't usually leave many reviews but I think this game deserves way more interest. I would hope that if the devs require more funding to finish the next chapter(s) then they would consider crowdfunding as I'd definitely support that.", "timestamp_created": 1504365633, "timestamp_updated": 1504365633, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.589103", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34467303": {"recommendationid": "34467303", "author": {"steamid": "76561198057563260", "num_games_owned": 75, "num_reviews": 1, "playtime_forever": 278, "playtime_last_two_weeks": 0, "last_played": 1498645269}, "language": "english", "review": "This game was amazing. I purchased it during the Steam sale without knowing too much about it so it was a bit of gamble. It paid off big time.\n\nThe story is really charming and gripping (I couldn't put it down and finished it all in two sittings). The historical alternate universe setting is really unique and it works really well. \n\nThe gameplay is pretty standard for a point and click game, any fan of the genre will feel comfortable playing this I think.\n\nOut of all the games I bought during the sale, this was probably my favourite.", "timestamp_created": 1503606516, "timestamp_updated": 1503606516, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34381197": {"recommendationid": "34381197", "author": {"steamid": "76561198039045751", "num_games_owned": 386, "num_reviews": 7, "playtime_forever": 197, "playtime_last_two_weeks": 0, "last_played": 1503259048}, "language": "english", "review": "Books I& II of Herald: An Interactive Period Drama is definitely overall a win for fledgling developer Wispfire. It has a compelling story, with an interesting twist at the end. The only elements of the game which I weren't fond of were the slightly wooden 3D graphics and the mediocre voice acting. However, the engaging and well conceived plot more than makes up for this. Also, the 2D animations are beautifully done, and I enjoyed the musical score as well.  If you like the visual novel format, definitely check this one out.", "timestamp_created": 1503259289, "timestamp_updated": 1503259289, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33765768": {"recommendationid": "33765768", "author": {"steamid": "76561198280371208", "num_games_owned": 425, "num_reviews": 105, "playtime_forever": 383, "playtime_last_two_weeks": 0, "last_played": 1500900763}, "language": "english", "review": "[b]A captain makes his own rules out at sea.[/b]\nI have to admit that history is not one of my strong subjects. For the most part I know the series of events and the main people involved but not exact dates of everything . And when most of our questions, both multiple choice and essay, have us pinpoint an exact date it does not go well for me. Despite this I love period pieces. Especially with the amount of research that goes into it and how it shows. Hearing possible ways the world would of been if certain events did not play out as they did is even more interesting, especially since there is a history book that is dedicated to showcasing it. With Herald: An Interactive Period Drama being alternative history, I just had to play through it.\n\nToday we go back to an alternative 19th century in the shoes of a young man named Devan Rensburg. Opening up to him being in the hands of a mysterious woman who introduced herself as The Rani. Who, of which, also seemed to of saved him from drowning. Directing Devan to recount his story from his journal and why he is wearing the Protectorate blue captain coat. Not only paving a way for us to have an intro to the story but the structure the inner narrative will be from Devan. We do spend most of our time in Devan’s retelling. Being aboard the merchant ship HLV Herald with the help of the second officer, Aaron Ludlow, hand selecting him and eventually track down his parents when they get back on land. \n\nAs most of Devan’s surroundings is either the boat or the ocean it is not surprising we are around the same characters and slowly introduced to the different parts of the boat. Luckily the characters are strong enough to carry this weight. You get the sense of every character and you know they each have their own pasts. And with this having choices on what you can say, you also sculpt how Devan is. Is he one for change, does he become concerned, will he help others? \n\nNot only are characters deep but they have great art and voice actors behind them. Each character had a great choice in a voice actor and I did not leave dissatisfied by any of the performances. When the characters talk a 2d drawing of them is put on screen, leaving the 3d model to do the body movement and not worry about facial expression. The art they show is great as well, with a little animation added, to show various expressions. And trust me some are hilarious. \n\nI do like how they decided to do the conversation choices on the boat. We get the usual wording in The Rani scenes but we get more of “I decided to…” on the boat. It’s something little, but it goes in line with him recounting it to The Rani. This also goes into his narration on the various objects you can inspect. Doing it more as telling The Rani rather than thinking about what he saw. There is undoubtedly no way he can remember everything but they do balance it out somewhat with Devan’s journal. I can only assume our first tab, mostly used to tell you your objectives, would be more towards a diary deal. With the second tab just being quick notes and backstories on various subjects such as items and people, and the last tab being the map of the HLV Herald. Though the map is a tad confusing.\n\nA huge thing with games giving you choice is how it handles them, with Telltale games commonly being brought up in this aspect. With Herald: An Interactive Period Drama, most of the decisions made have immediate, or almost immediate, consequences. Only some choices having a more long term consequence that will come into play in the last two books. And as of now they do seem like these decisions matter, especially with how the characters will probably react later on. Of course there are plot points it has to hit no matter what, but you still get some choices around those that do hold some significance. Some even are brought up as little jabs showing that characters will remember what you say.\n\nThis also focuses more on telling a story rather than the usual point and click aspect plays into the game as well. Bringing in more of a relaxed experience. Letting us look at the environment and focus on the characters and the story. There is really no challenge, other than finding your way around the boat, and most of your interactions other than with characters will be walking through the environments and giving items to various characters. The 3d world is somewhat lacking in terms of the character models, but they do try, and succeed, at filling the ship realistically. Also compensating with their soundtrack at the right times. If it was not for the 3d world we walk in, I would say this would be a visual novel.\n\nOne of the things I do wish is for the autosave to be brought to attention as I did not know if the game saved or not till I looked it up. I do totally get why as your choices seem more set in stone, but I wish it told you that it will autosave at every chapter. I do also wish we got more than three save slots. As we are eventually getting the last half, there are multiple combinations I can see happening and setting one down makes me reluctant to restart if I have all three slots filled. The replayability is there, but there are only a few save slots to use.\n\nEven though the whole story has not been revealed to us yet, I do think the plot twist we were given at the end of book two happened too early. You can kind of tell the hints that supported it after you find out, but I think the want to know how Devan got to wearing a captain’s coat, how he ended up floating in the ocean, and other things that happened at the end of book two. With book three and four still to be announced, time will only tell how the reveal is handled and if it still seems too early.\n\n[h1]Overall[/h1]\n+ Voice acting \n+ Art\n+ Well written plot and characters\n\n+/- 3d models can be better\n+/- Inspecting using a controller can be annoying as some items are so small one flick can go past the hit box\n\nHerald: An Interactive Period Drama only contains the first two books out of the planned four, but even without this the experience seems like a full one. Everything is smoothly handled and nothing seems like they were trying to pad out the game with meaningless objectives or conversations. I do hope for the rest of the story to be released soon and highly recommend this.\n\n[code] [url=http://saveorquit.com/author/ripwitch/] 💜 Check out my other reviews at SaveorQuit! 💜 [/url][/code]", "timestamp_created": 1500902902, "timestamp_updated": 1500902902, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.619892", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "33617597": {"recommendationid": "33617597", "author": {"steamid": "76561198065857063", "num_games_owned": 424, "num_reviews": 14, "playtime_forever": 190, "playtime_last_two_weeks": 0, "last_played": 1494356799}, "language": "english", "review": "The below review is taken from my original post at www.gamesfreezer.eu\n\nThe trailer of Herald exudes style and genuinely feels like something a little different. As far as I know I’ve never played a video game developed by a Dutch team with the exception of Killzone back on the Playstation 2 which obviously differs greatly from the visual novel genre. \n\n\nUpon starting Herald, the craftsmanship on offer is clear and the fact that this is coming from a small development team of only four people is astonishing. \n\n\nWispfire has been working on Herald since 2014 and I’m pleased to say that it was worth their time and it is definitely worth yours.\n\n\nThe thought of playing an interactive period drama was instantly alluring to me as it felt such a unique premise, the period and place in which Herald is set is relatively unknown to me and so I was looking forward to broadening my knowledge.\n\n\nAfter a brief introduction to the main character Devan Rensburg, who is being held ‘prisoner’ by a lady known as The Rani, the game flashes back to the beginning of Devan’s voyage and it is in this timeline that the majority of the game takes place.\n\n\nThe graphics continued to astound me as I played the game, the portraits of the characters that popped up when in the conversation were incredibly detailed and each portrait shimmers and moves to give a feeling of life to each person in the game, it’s a technique that adds an extra layer of involvement to the gameplay. \n\n The in-game character models themselves are presented in a stylised way which reminded me of Escape from Monkey Island, which as everyone knows is a good thing. The backgrounds of the game and all animations are smooth and match the lulling, unobtrusive music which couches the game-play.\n\n\nHerald is fully voice acted to an extremely high standard. Due to the nature of the game, there is a lot of dialogue but it is all handled well and I noticed no mismatches of speech to text which can sometimes be an issue in this genre. \n\n The game uses a mostly static camera with occasional sweeping flourishes during cut scenes, this ties in nicely with the point and click gameplay with the focus being heavily geared towards dialogue choices which are well-constructed. \n\n Whilst there are usually only three choices you can make, I found they were varied enough for me to always answer in the way I wanted to. In this regards the game reminded me of Deus Ex: Human Revolution as that game also had the knack of giving you dialogue choices that suited your style of play.\n\n\nNarrative-wise, the game's’ focus is on moving forwards and telling a story as opposed to challenging the player with puzzles, this makes for a very breezy gaming experience in which you can focus on the tale being told.\n\nThe game has a lot of hot spots to click on but these are more for informational purposes to add to the thoroughness of the game world, these are interesting and give an insight into life at sea at the time. As you progress through the game, various items and areas are added to the in-game encyclopaedia which can be accessed by clicking on the top of the screen.\n\nIn-game objects of interest are highlighted when you roll the mouse over them, this avoids pixel hunting issues, which is a nice touch.\n\n\nThe game being set on a boat keeps the story tight and focused, each character also has a separate personality and voice actor which makes it easy to distinguish between them. Whilst the game is set in a time during which I’m sure there were intense class division and hardship, Herald exists in a world where that divide is somewhat romanticised. In the game there is no bad language and each character is quirky and has their own foibles but whilst there is the insinuation of racial and sexual divides, they are not the main thrust of the narrative.\n\nSummary:\nHerald is a wonderfully realised game and it’s branching narrative offers replay value. I completed the first chapters in a little over two hours and I would like to point out that there aren’t many puzzles in the game, as it focuses instead on plot and atmosphere but in my personal experience this can be preferable over forced sliding / lock-box puzzles to artificially extend a game. \n\n If an interactive visual novel is something that floats your boat, I’d suggest getting a brandy ready and tucking into Herald. I eagerly await the next voyage!", "timestamp_created": 1500329954, "timestamp_updated": 1500329954, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.482469", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "33497025": {"recommendationid": "33497025", "author": {"steamid": "76561197989671901", "num_games_owned": 657, "num_reviews": 20, "playtime_forever": 314, "playtime_last_two_weeks": 0, "last_played": 1498718248}, "language": "english", "review": "I backed Herald on Kickstarter and was thrilled to finally get my hands on it. And the best part: Wispfire did not fail to deliver.\n\nThe game is visually an absolute joy, the story picked up right away and didn't let me off its hold until the credits started rolling, and I loved the diversity of the cast. The voice acting is (mostly) good and I didn't encounter any bugs or other technical issues.\n\nI only wish I could sometimes walk faster (or run, when more appropriate to the story), since traversing the ship got old really fast after you learn the layout and already clicked on everything and everyone. That, and the camera angles on the deck don't always leave you a lot of area to click on when moving. Small annoyance, but still.\n\nOverall, I enjoyed the game very much and can't wait to see where the cliffhanger at the end of Book II takes us in Book III.", "timestamp_created": 1499929195, "timestamp_updated": 1499929195, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500225", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33027485": {"recommendationid": "33027485", "author": {"steamid": "76561198072963388", "num_games_owned": 53, "num_reviews": 2, "playtime_forever": 413, "playtime_last_two_weeks": 0, "last_played": 1498808822}, "language": "english", "review": "Goodness, this game, It has such beautiful art, writing and voice acting, the twists it gives have actually left me speechless or gasping, I seriously cannot wait for the rest of the books. I love it so much.", "timestamp_created": 1498808748, "timestamp_updated": 1498808748, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.545552", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32607308": {"recommendationid": "32607308", "author": {"steamid": "76561198053022073", "num_games_owned": 97, "num_reviews": 11, "playtime_forever": 246, "playtime_last_two_weeks": 0, "last_played": 1498001070}, "language": "english", "review": "Even though I'm still waiting for the whole story to unfold like the rest of you, from what I've seen so far, I'm pretty confident that they will continue to impress me with a quality narrative, believable characters, pleasing art style, intriguing background which would incur some thoughts about more serious issues like racism or imperialism in the rest of the books to come.\n\nThere's only minor negative things to say about the game, like one particular puzzle which involves discerning which item looks like a syringe or a bandage, and etc. It didn't really contribute anything to the gameplay, while successfully breaking the immersion by figuratively yelling at my face, \"hey, it's an adventure game after all, so get ready for a puzzle!\" - no, I don't want to see more of such puzzles in the rest of the books, as I don't think every adventure games need to be another The Monkey Island series.\n\nThe game relies on low quality models and textures, but when the overall art direction looks so pleasing, I don't think it'd be such a big issue for most of the people.\n\nAll in all, I'd recommend this game to anyone who enjoys playing such games which emphasizes more on story and characters, rather than actions or puzzles.\n\nI was surprised to see that this game hasn't gathered more attention from gamers or review sites, but probably it will soon, if they can keep up with what they have done with the first two books of the series.", "timestamp_created": 1498010125, "timestamp_updated": 1498010125, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500631", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32349852": {"recommendationid": "32349852", "author": {"steamid": "76561197969447385", "num_games_owned": 468, "num_reviews": 7, "playtime_forever": 183, "playtime_last_two_weeks": 0, "last_played": 1497206044}, "language": "english", "review": "The game takes place in an alternate history where 1800's Europe and its colonies are unified under a single republican government, the Protectorate.  \n\nYou play Devan, a young man in search of identity and adventure as you set out to sea towards the lands of the east where you born, but never got to experience.  Along the way, you'll make choices that affect events not unlike recent Telltale games.  Be prepared to encounter some weighty topics like colonialism, racism, feminism, and classism.\n\nAnimations are very stilted and robotic, but the hand-drawn artstyle still manages to bring everything to life.  The voice acting is also top notch and gives the characters some real, well, character.  \n\nAs only Books I and II are released as of this review, be prepared for a very short game with a \"to be continued\" ending.  Books III and IV will be released at some point in the future to conclude the story.\n\nOverall, worth the $10 I paid and I'm looking forward to the final two episodes.", "timestamp_created": 1497207796, "timestamp_updated": 1497207796, "voted_up": true, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.689415", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32153112": {"recommendationid": "32153112", "author": {"steamid": "76561198019252930", "num_games_owned": 63, "num_reviews": 10, "playtime_forever": 593, "playtime_last_two_weeks": 0, "last_played": 1492959686}, "language": "italian", "review": "I primi due episodi di Herald: An Interactive Period Drama ci portano all'interno delle vicende che si svolgeranno all'interno della HLV Herald in un contesto storico importante come quello del XIX secolo dove imperava il Protettorato che legava gli imperi e le nazioni più forti dal punto di vista commerciale, economico e politico di quel tempo.\n\nIl livello di fruizione è più che discreto, ma mancante di mordente e di grandi colpi di scena. Il tutto è dettato dal fatto che le scelte che faremo avranno poca ripercussione sulla storia ed il finale sarà uno solo. Comunque la qualità delle fasi di dialogo è più che buona insieme ad un comparto audio semplice ma ben realizzato.\n\nGli sviluppatori olandesi di Wispfire non hanno voluto rischiare ampliando la varietà delle ripercussioni, in base alle scelte di dialogo fatte, non allontanandosi dal filone principale. Magari con i prossimi episodi sarà diverso. Consigliamo questo titolo a chi vuole giocare senza aspettarsi grandi cose e vuole spendere poco.\n\nLink articolo ---> http://www.gamesark.it/mostra_rece.asp?c=25420170012295839", "timestamp_created": 1496498050, "timestamp_updated": 1496498166, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31884254": {"recommendationid": "31884254", "author": {"steamid": "76561198078468638", "num_games_owned": 59, "num_reviews": 1, "playtime_forever": 171, "playtime_last_two_weeks": 0, "last_played": 1503772124}, "language": "english", "review": "Held my attention.", "timestamp_created": 1495377639, "timestamp_updated": 1495377639, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.481108", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31823616": {"recommendationid": "31823616", "author": {"steamid": "76561198064838002", "num_games_owned": 151, "num_reviews": 133, "playtime_forever": 152, "playtime_last_two_weeks": 0, "last_played": 1495297321}, "language": "english", "review": "An interesting while short story with a branching narrative. Yet unfinished through. The drawing could be better, and the rema but it is the story that matters in interactive novels like these.\n\nOnly 2 of 4 books are in this part, so its too early to judge, but pretty interesting so far. Would like to see how it ends in books 3 and 4.\n\nOverall recommendation: to everyone who likes interactive novels, and those who are into the colonial period theme.", "timestamp_created": 1495121378, "timestamp_updated": 1495121454, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.458601", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31509723": {"recommendationid": "31509723", "author": {"steamid": "76561198068139224", "num_games_owned": 234, "num_reviews": 28, "playtime_forever": 181, "playtime_last_two_weeks": 0, "last_played": 1493743743}, "language": "english", "review": "Everything what telltale wants to be, exists within this very Game, The Dialog reminds of Gameboy games with text Windows and the Moving pictures, there are even Some very well made Cut scenes showing the Ship and such, the Plot and the dialoge really adapts to your decisions, i payed 10$ and recieved a little less then 4 hours of solid and interisting story with point and click gameplay in between which is usually not my style.\n\nThe story belongs into a Criminal/thriller category with delightful jokes and joyful moments like a piano beeing played in between.\n\nTruely a Indie game which deserves to be elevated by support upon the steps of budget to create an even greater and longer experience in the future.\n\nthe first game since years which had zero bugs, performance issues or a moment where i watched at the clock waiting for it to end.\n\nmay this be the start of a beloved series, and more games with this style in the future.", "timestamp_created": 1493744211, "timestamp_updated": 1493744211, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.505768", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31478885": {"recommendationid": "31478885", "author": {"steamid": "76561198262860371", "num_games_owned": 92, "num_reviews": 7, "playtime_forever": 160, "playtime_last_two_weeks": 0, "last_played": 1493652425}, "language": "english", "review": "I've only played book 1 so far but let me tell you, I've never been so hooked on a story like this one! 10/10 Can't wait to keep playing!", "timestamp_created": 1493613848, "timestamp_updated": 1493652657, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.508484", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31474739": {"recommendationid": "31474739", "author": {"steamid": "76561198154425859", "num_games_owned": 1044, "num_reviews": 68, "playtime_forever": 951, "playtime_last_two_weeks": 0, "last_played": 1493579187}, "language": "english", "review": "[h1]Herald is a tightly woven dramatic interactive novel, which plays like a mystery play. Some beauty knows no language. But, this beautifully animated point & click choice based drama crosses language and race barriers with issues that we struggle with today like suicide, faith, racism, gun control, interpersonal relationships, & slavery; all set in the 19th Century.[/h1]\n\nIt seems that, in Herald, I am everyman and every woman. The script draws us in to experience the motives & thoughts of each character. The narrative, characterizations, art, & voice acting are incredibly well done. \n\n[b]Gameplay Mechanics:[/b]\nThe game plays out via simple p&c mechanics, where you use a mouse click to move through the ship. Controller options have recently been patched in, and are still being tweaked. The narrative is revealed in textboxes, where in parts it is just dialogue advanced by clicks, interspersed with sets of choices. Dialog is followed by cutscenes that are enjoyable and advance the story. I never got bored even after multiple games. The save system is convenient, making it possible to reload the chapter if you feel you made bad choices.\n\n[b]Graphics & Sound:[/b]\nThe soundtrack is lovely! One particularly haunting tune that appears in the theme is played on the piano by a character in one scene, who sings the words. This means a soundtrack would definitely be a plus.\nEven with a good machine, the framerate never went above 30 fps for me. I felt like this was intentional, as it creates a not quite slow-mo effect, lending a dramatic flair to each scene. If lower framerates bother you, this may not be the game for you. \nMost of the animations were done well, if simply. Most character movements seem true. There is one point where a character walks through a door, and then the irritating movements of the doctor helping a patient. Almost comical, the doc’s eyebrow moves side to side in one conversation.  But, in most other scenes, it is almost entrancing to see that simple can be elegant.\n\n[b]Where Herald Succeeds & Fails with Choices:[/b]  \n\n[u]Mystery/ Foreshadowing[/u] Herald is a mystery in its whole. At this point, only the 1st 2 books are released, so there is much to work with here and the writers seem to have taken full advantage of that, succeeding in every account. \n✔  There is a revealer in the final scene of the 2nd book that changes what you thought you knew in very early scenes. This leaves you with a cliff hanger of sorts. \n✔  Even multiple play-throughs add to and expand your opinions of different characters. Some things are never answered for us, but we are left to form our own opinions. \n ✔  Some apparent mysteries are left open at the end, hinted at only by shadows and shapes in the artwork. \n✔  Ultimately, characters are left to being human with various interpretations of their behavior still being available after several replays.\n\n[u]Complexity of Choice[/u] \nI rate the choice in Herald a solid 8 out of 10. I played Choice of Robots, an excellent choice game that was totally text-based. I would rate that as a perfect 10, because your choices changed everything. The choice web was intricate, creating literally hundreds of outcomes. But, games like Firewatch, which I also loved but would rate a 5, presented only cosmetic changes with the choices. The players were all drawn back into the original plot line at collection points, so that ultimately your choices did not really change the story in Firewatch. \n✔  In Herald, there is one story. The narrative rules as a mystery which you will reveal over the course of not only these current 2 books, but future books. But, your choices can affect the interplay of characters, and the outcome of scenes, and the appearance of different dialog trains. Information which you have not revealed is not later available in a conversation. \n✘  Many decisions often affect only that immediate tier, and sometimes only in the emotional feel of the dialog. For example, whether you offer to do Ian's job for him or not, you get to do it. Regardless of how you respond to the Rani in the prologue, the results are the same. And, with the captain, navigator, & senator, I was accused of taking so long whether I stalled or took the direct text options.\n✔  Numerous choices can change whether a character lives, dies, or is in the brig. Some characters can appear earlier in a scene, or in the place of another character, if your responses change. Interestingly, if you choose to start at the scripted start of the 2nd book, instead of in the 1st, I discovered that the script goes with the option of no characters being dead.\n✘  No choice seems to have an effect beyond its immediate scene, with the exception of whether certain players exist or not. Because of this & the save system, it is possible to exit to the menu and restart a book multiple times, to get multiple achievies at once. Basically, some crucial decisions will pop one of 3 different achievements. No achievement requires more than one scene’s set of responses to resolve, with the possible exception of Mad Discourtesy, which requires probably 2 scene’s answers.\n\n[u]Replayability[/u]\n✔  Despite the save/ reload ability, multiple playthroughs will probably be needed to get all achievements. Also, you won’t get all info in the mystery without at least 3 plays. My 1st play took about 8 hours, with reading everything, even the letters that are unlocked at the end and the credits. The 2nd play took 4 hours, still reading choices and popping some achievements. After that, additional plays took about a half hour per book with skipping dialog & quick choices. So, after experiencing everything the story has to offer thus far… in every nuance, I have almost 16 hours. \n\n[u]Dev Support[/u]\n✔  The dev team has made the art available in the trading card collectables.\n✔   A large collection of concept art was made available free in earlier release notes. They don’t seem to be attempting to monetize every bit of data, as many devs are doing. \n✔  They are responding quickly to comments and or email. \n\n[b]Suggestions for Improvement:[/b]\n1. The log is helpful in-game, but access to what you’ve accumulated after the game would be a great addition to the menu. \n2. Voice acting could be added for the letter collections in the menu. (Only half of them seem to pop after these first two books.)\n3. Having musical options & even a musical library in the menu, as with the letter archive, would be even better. Alternately, a soundtrack would be a plus.\n\n[h1]With a storyline as deep as the ocean, & several currents relevant to any age, Herald is so much more than a lovely journey between the sea & the stars. As a choice-based p& c adventure game, Herald provides hours of mystery drama for fans of gaming narrative. I highly recommend the game, and I look forward to the exciting upcoming books.[/h1] \n\n[b]UPDATE:\nI contacted Wispfire with some questions, & got a detailed response from the writer, Roy van der Schilden. I wanted to pass along a few of those details here.\n•\tLady Tabatha’s song, Vows, was composed by Bart Delissen. He composed all Herald’s music, as well as music for other games like Verdun. The writer wrote the lyrics for Vows, as well as directing the voice-over work. \n•\tHerald is an indie title. This is the writer & artist’s 1st commercial game, though they have done a number of theatre productions.\n•\tThe plan is to release books III & IV as a bundle, but that could change. \n•\tThe target framerate is 30fps, to create an overall cinematic experience, as well as being a bit lighter on hardware. \n•\tComposer Bart Delissen’s [url=http://bartdelissen.com/?page_id=92]game music can be sampled here.[/url] \n•\tAida de Ridder gives [url=http://heraldgame.tumblr.com/post/113177964119/the-making-of-tabatha-veazie-animated-2d]more info on the art here.[/url][/b]", "timestamp_created": 1493593352, "timestamp_updated": 1493660125, "voted_up": true, "votes_up": 45, "votes_funny": 0, "weighted_vote_score": "0.763213", "comment_count": "9", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31382236": {"recommendationid": "31382236", "author": {"steamid": "76561197999390811", "num_games_owned": 440, "num_reviews": 109, "playtime_forever": 829, "playtime_last_two_weeks": 0, "last_played": 1493237955}, "language": "english", "review": "Period drama, sorta. More like alternative history with plot holes you can sale a barque through.\n\nThe animation is just bad. It often bugs out and objects \"pop\" in and out of the characters' hands.\n\nThe \"choices\" never seem very organic, often feel counter productive, and don't have much clear impact on the story.\n\nThe story is told in what amounts to about 5 pages of written text, tops. Most of the time you are walking back and forth over the same rooms for fetch missions of no interest.\n\nThe genre is so desperate for content that this has gotten good reviews, but if you've ever debated with a partner about where to get dinner, you've played a more interesting version of this game.", "timestamp_created": 1493238161, "timestamp_updated": 1493238161, "voted_up": false, "votes_up": 25, "votes_funny": 3, "weighted_vote_score": "0.510378", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31336269": {"recommendationid": "31336269", "author": {"steamid": "76561198015052153", "num_games_owned": 1342, "num_reviews": 45, "playtime_forever": 272, "playtime_last_two_weeks": 0, "last_played": 1493026202}, "language": "german", "review": "Großartig <3 Das Aussehen, die Geschichte, die Präsentation, die Stimmen, alles <3 Oh man, warum hab' ich nur nicht gewartet, bis alle Episoden draußen sind - jetzt muss ich wieder warten :/", "timestamp_created": 1493027277, "timestamp_updated": 1493027277, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502712", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31311207": {"recommendationid": "31311207", "author": {"steamid": "76561198145439976", "num_games_owned": 20, "num_reviews": 5, "playtime_forever": 406, "playtime_last_two_weeks": 0, "last_played": 1492987466}, "language": "english", "review": "This is so good. I just finished book II and it delivered such an emotional punch that I am left incoherent, I don't know if I can write anything making sense. The mechanics felt a bit outdated but they are easily overlooked by the immersive experience. Not only the story is captivating, but the world of Herald feels very real. There is a care for detail, a work of documentation, that feels very respectful both to History and to me as the player. Too often games and shows simply handwave things and produce half baked, loosely held, environments in which to frame the story. Not here. Herald seems to say \"I respect you too much not to bring something thoroughly researched and thought out\" and it shows. \nWonderful experience with good re-play value. Highly recomendable.", "timestamp_created": 1492918542, "timestamp_updated": 1492918542, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.590450", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31159833": {"recommendationid": "31159833", "author": {"steamid": "76561198314276687", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 202, "playtime_last_two_weeks": 0, "last_played": 1492271219}, "language": "english", "review": "Great game overall. Beautiful graphics. Amazing and amusing sound. Very interesting storyline and makes you think at least twice about your choice. I recommend it and will be waiting for the following part…!", "timestamp_created": 1492273283, "timestamp_updated": 1492273283, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31133639": {"recommendationid": "31133639", "author": {"steamid": "76561198130045526", "num_games_owned": 107, "num_reviews": 3, "playtime_forever": 169, "playtime_last_two_weeks": 0, "last_played": 1490800618}, "language": "english", "review": "A beautiful game with a rich narrative, heavenly music, endearing characters. I have been checking almost daily for the release of Book III. \nAlso, Jim Sterling is in it.", "timestamp_created": 1492169638, "timestamp_updated": 1492169638, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504181", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31088995": {"recommendationid": "31088995", "author": {"steamid": "76561198059681442", "num_games_owned": 392, "num_reviews": 10, "playtime_forever": 701, "playtime_last_two_weeks": 0, "last_played": 1492128562}, "language": "english", "review": "It is more of an Interactive story where story branches up based on your choice than point&click adventure. there are only 2 episodes out so far. I found the story very engaging. Voice acting is very good, all 13 characters are fully voice acted and i believe one of the character is Jim Sterling, i was suprised to hear his voice in this game.", "timestamp_created": 1491959889, "timestamp_updated": 1491959889, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.541667", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31086377": {"recommendationid": "31086377", "author": {"steamid": "76561197986089888", "num_games_owned": 206, "num_reviews": 45, "playtime_forever": 287, "playtime_last_two_weeks": 0, "last_played": 1491860082}, "language": "english", "review": "The first chapter is rather slow and boring, but during the second chapter the story really goes places. Great writing, nice reveals, nice how it all starts tying together. After a while I hardly noticed the outdated 3D graphics. Also, the 2D character art is just amazingly good, the voice acting is nice and I really started to feel like I got to know the characters. :)", "timestamp_created": 1491946788, "timestamp_updated": 1492347047, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31085336": {"recommendationid": "31085336", "author": {"steamid": "76561198026234938", "num_games_owned": 75, "num_reviews": 21, "playtime_forever": 135, "playtime_last_two_weeks": 0, "last_played": 1491720663}, "language": "english", "review": "This is a good story game to relax on if you would like to watch a book. The voices and animation are well done. The story could develop a little faster though. \n\nYou're a lost sailor/captain(maybe) drowned at the sea, only to be saved by a Rani. Who forces you to tell her the entire story, this is where you play the game. The decision you choose will affect the story dramatically. You are the author of your own destiny and others if you decide to screw them over.\n\nPros:\n- Nice story\n- Good game to relax on\n- Graphics and animations are well done\n- Friendly for all ages\n\nCons:\n- Story could develop a little faster - The first book\n- Could use fast-forward button\n- Nothing really exciting in the first book I felt (spoiler)\n\nIt's a game worth checking out. Just be aware the story took a while to develop. Things do pick up near the end of Book 1. Don't want to spoil the fun so only the first 30min. https://www.youtube.com/watch?v=6ZKeZDTK59g&list=PLr2Bud6fw9oWVnyEHptiOh89F_pqV-wF7. Hope this get you guys an idea how the game plays out.\n\n-BK", "timestamp_created": 1491942367, "timestamp_updated": 1491942367, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.438788", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31064051": {"recommendationid": "31064051", "author": {"steamid": "76561198142348353", "num_games_owned": 66, "num_reviews": 1, "playtime_forever": 530, "playtime_last_two_weeks": 0, "last_played": 1493005487}, "language": "english", "review": "I really love this game, so much so that the moment I finished one playthrough, I started the next. The genius of Herald is the way it blends everything that's almost comfortingly familiar about adventure games and comes up with something entirely fresh and exciting. Many of the character archetypes (stern statesman, whiny cabin boy, underappreciated officer) are immediately familiar, but as the story unfolds every single character is given depth. The plot surprised me at multiple times (especially the end of Book II, loved it!), but it never felt forced because there were always clues laying the groundwork for every reveal. It seems you are bound to go through the same basic plot, but your choices certainly matter in some significant ways, some choices opening up or closing options later. And both books so far end with high stakes conversations with dramatic effects. I was surprised after I finished playing to enjoy reading the archives (letter and document style backstory pieces), which add further depth to several characters and help to explain their motivations. This is a rich story with lots of detail accessible to flesh it out, but even if you skip clicking around the ship for extra information, there's a lot to enjoy. \n\nTechnically speaking, you can see the graphics from the preview videos and screenshots and they're nothing special. I love the character portraits though, which are very detailed and dynammic. The changing of expressions and general movement of the portraits during conversation helps to give the already good voice acting a visual component to play off of. For a game like this where the soul is in the dialogue and choices, I think this works very well. \n\nI definitely recommend this game! Be aware that it deals with a variety of issues and topics of colonialism from several angles, so if you are sensitive to some content (violence, slavery mentions, racism) you may want to check for warnings to prepare yourself. That said it's a very well crafted story and I am eagerly looking forward to the rest of it!", "timestamp_created": 1491845800, "timestamp_updated": 1491845800, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.498008", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31030544": {"recommendationid": "31030544", "author": {"steamid": "76561198046857109", "num_games_owned": 35, "num_reviews": 2, "playtime_forever": 247, "playtime_last_two_weeks": 0, "last_played": 1496638559}, "language": "english", "review": "With a large majority of our fiction taking place in a European and western setting, Herald is an excellent departure into a setting most gamers will find refreshing and new. Although the endings you recieve in in books 1 and 2 are quite similar, the overall story captivated me and I would reccomend this videogame. The art style is also something that should not be ignored, and I applaud the artists for their work.", "timestamp_created": 1491703984, "timestamp_updated": 1491703984, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30964248": {"recommendationid": "30964248", "author": {"steamid": "76561198051833822", "num_games_owned": 129, "num_reviews": 2, "playtime_forever": 190, "playtime_last_two_weeks": 0, "last_played": 1491374965}, "language": "english", "review": "Herald is atmospheric and beautiful. It explores themes you don't often see covered in video games in a mature and interesting way, and the writing is quite engaging. You do get the chance to roleplay with your character to a limited degree, but with some experimentation, I have found that very few of the choices you make seem to have any significant impact on the story (though perhaps the fault is mine for not finding the right combinations to make the change, since the significant choices are not always the most obvious). As others have said, the voice acting is quite good as well. I would reccomend it to visual novel lovers, and potentially those who love graphic novels and/or interactive fiction as well. There is not a whole lot of gameplay here however, so gamers who like entertaining gameplay woven into the story may not enjoy this one quite as much.", "timestamp_created": 1491409996, "timestamp_updated": 1491409996, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.501992", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30958084": {"recommendationid": "30958084", "author": {"steamid": "76561198011654048", "num_games_owned": 197, "num_reviews": 2, "playtime_forever": 274, "playtime_last_two_weeks": 0, "last_played": 1491386307}, "language": "english", "review": "Interesting setting and story, with very colorful characters. Many choices to make, though the story doesn't feel overly divergent after one play through. Really enjoying it and looking forward to more!", "timestamp_created": 1491386496, "timestamp_updated": 1491386496, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30955068": {"recommendationid": "30955068", "author": {"steamid": "76561198053904656", "num_games_owned": 138, "num_reviews": 3, "playtime_forever": 484, "playtime_last_two_weeks": 0, "last_played": 1491367411}, "language": "english", "review": "This game is not only utterly gorgeous, but the plot is filled with such twists and turns that I was literally gasping constantly. Often, adventure games and visual novels are stereotyped as \"boring.\" This game is anything but. It is seriously an amazingly good time, and the devs deserve all the support they can get. I want to know how it ends!", "timestamp_created": 1491368179, "timestamp_updated": 1491368179, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.505396", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30942779": {"recommendationid": "30942779", "author": {"steamid": "76561198009854709", "num_games_owned": 1696, "num_reviews": 476, "playtime_forever": 337, "playtime_last_two_weeks": 0, "last_played": 1491059522}, "language": "italian", "review": "L'INDIA COLONIALE CI ASPETTA (Herald: An Interactive Period Drama) \nSiete pronti a diventare un giovane ragazzo di origini indiane nell'Inghilterra coloniale? No? Neanche il protagonista di Herald. Ed è per questo che siamo su una nave diretta verso casa. Ma tutto non andrà come previsto.\n\nhttps://www.youtube.com/watch?v=dvsSzLVIVjc&t=0s", "timestamp_created": 1491314313, "timestamp_updated": 1491314313, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.459184", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "30918016": {"recommendationid": "30918016", "author": {"steamid": "76561198252042352", "num_games_owned": 7, "num_reviews": 1, "playtime_forever": 207, "playtime_last_two_weeks": 0, "last_played": 1490135348}, "language": "english", "review": "Very well written, visuals are stunning, music is great. \n\nIf you like a story based adventure game, Herald offers something unique!", "timestamp_created": 1491207040, "timestamp_updated": 1491207040, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30912828": {"recommendationid": "30912828", "author": {"steamid": "76561198026966539", "num_games_owned": 484, "num_reviews": 2, "playtime_forever": 248, "playtime_last_two_weeks": 0, "last_played": 1491168667}, "language": "english", "review": "I participated in the Kickstarter campaign because I thought the short demo showed promise. I think Herald actually exceeded my expectations!\n\nThe setting is great, the character portraits gorgeous and the story very engaging. The somewhat free movements as well as the animated characters and backgrounds really bring life to the surroundings. I think this is a very successful mix of point&click and visual novel.\n\nI really can't wait for the continuation of the story.", "timestamp_created": 1491178629, "timestamp_updated": 1491178629, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30891296": {"recommendationid": "30891296", "author": {"steamid": "76561197993664311", "num_games_owned": 346, "num_reviews": 38, "playtime_forever": 270, "playtime_last_two_weeks": 0, "last_played": 1491096921}, "language": "english", "review": "I enjoy point & click games and this one was quite good. I liked the voice acting except for one or two characters. The art and story are suberb and will leave you wanting to see more. It was short with 4 hours ish played. Did it for the story on my first run, but the replayability is there for the achievements! For fans of the genre, it`s well worth playing this title. Looking forward to Book 3 & 4 !", "timestamp_created": 1491101737, "timestamp_updated": 1491101815, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.503669", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "30887522": {"recommendationid": "30887522", "author": {"steamid": "76561198025209557", "num_games_owned": 190, "num_reviews": 5, "playtime_forever": 219, "playtime_last_two_weeks": 0, "last_played": 1491080476}, "language": "english", "review": "This game is beautiful. The art, the world, and the voice acting is on POINT! If you are a fan of point and clicks this one is worth checking out. It's not based on puzzles but it's based on a beautiful story.\n\nIf you like story over gameplay this game is for you.\n\nI spent time admiring the art a lot in this one.", "timestamp_created": 1491084734, "timestamp_updated": 1491084734, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.608738", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "30801307": {"recommendationid": "30801307", "author": {"steamid": "76561198015681227", "num_games_owned": 499, "num_reviews": 1, "playtime_forever": 85, "playtime_last_two_weeks": 0, "last_played": 1490733303}, "language": "english", "review": "Currently just finished the first book just started the second book. Like the description says Herald is a  \"choice-driven adventure game\" thus far It's not your standard point and click adventure where you are combining different items to solve puzzles but a strong narrative driven game where your choices really matter in how the game flows. I love the voice acting and the quality is really good especially from the lead roll. Already looking forward to Book III and IV!", "timestamp_created": 1490733809, "timestamp_updated": 1490733809, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.558011", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30796128": {"recommendationid": "30796128", "author": {"steamid": "76561197993084979", "num_games_owned": 135, "num_reviews": 2, "playtime_forever": 150, "playtime_last_two_weeks": 0, "last_played": 1490885431}, "language": "english", "review": "I like it very much. The voice acting and story are really good.", "timestamp_created": 1490717240, "timestamp_updated": 1490717240, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.465587", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30750860": {"recommendationid": "30750860", "author": {"steamid": "76561198308730475", "num_games_owned": 322, "num_reviews": 13, "playtime_forever": 275, "playtime_last_two_weeks": 0, "last_played": 1491076748}, "language": "english", "review": "I quite enjoyed the story of Devan so far and can't wait to play the rest, I was lucky enough to ensure certain characters didn't get harmed although I really disliked Ludlow, I can't tell if that was intentional or not and I wasn't overly happy that the game stopped me from reporting something important to the captain but I didn't mind.\n\nThe epilogue for Book 2 was certainly... surprising to say the least.", "timestamp_created": 1490533785, "timestamp_updated": 1490533785, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504460", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30638138": {"recommendationid": "30638138", "author": {"steamid": "76561198037431767", "num_games_owned": 74, "num_reviews": 2, "playtime_forever": 475, "playtime_last_two_weeks": 0, "last_played": 1490029095}, "language": "english", "review": "Thoughtful, well-written, well-paced, well-voiced, lovely interactive novel. I'm looking forward to more installments.", "timestamp_created": 1490029221, "timestamp_updated": 1490029221, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30633464": {"recommendationid": "30633464", "author": {"steamid": "76561197983963098", "num_games_owned": 238, "num_reviews": 1, "playtime_forever": 141, "playtime_last_two_weeks": 0, "last_played": 1489832850}, "language": "english", "review": "If you like the Telltale games, then you will probably like this game too! Game looks and feels great.", "timestamp_created": 1490010068, "timestamp_updated": 1490010068, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30612770": {"recommendationid": "30612770", "author": {"steamid": "76561198044461922", "num_games_owned": 197, "num_reviews": 4, "playtime_forever": 64, "playtime_last_two_weeks": 0, "last_played": 1489983201}, "language": "english", "review": "Only spent a bit of time in the game but it's obvious that a lot of heart and talent has gone into the production. A visual novel mixed with point and click adventure, with a historical slant. The art is gorgeous and the VO work top-notch. Looking forward to picking my way through episodes 1 and 2. Great job devs!", "timestamp_created": 1489921697, "timestamp_updated": 1489921697, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30576770": {"recommendationid": "30576770", "author": {"steamid": "76561198102784114", "num_games_owned": 57, "num_reviews": 1, "playtime_forever": 132, "playtime_last_two_weeks": 0, "last_played": 1489783686}, "language": "english", "review": "If you're looking for a period-piece adventure with strong writing and voice work.\n\nA slow start is worth the patience as Episode 2 picks up considerably. There are enough choices and satisfying - often multi layered - results that are quite rewarding. The dialogue ranges from average to strongly witty, especially in a wonderful exchange between two first-class passengers over tea.\n\nEpisode 2 even provides a welcome sense of urgency nearing its climax, very refreshing for a point and click adventure. The second episode end reveals a strong enough cliff-hanger that I was eager to see more.\n\nFull review here  http://www.a90skid.com/herald-review/\n\nReview copy provided", "timestamp_created": 1489783993, "timestamp_updated": 1489796333, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.518519", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30514244": {"recommendationid": "30514244", "author": {"steamid": "76561198079682227", "num_games_owned": 61, "num_reviews": 1, "playtime_forever": 201, "playtime_last_two_weeks": 0, "last_played": 1489444907}, "language": "english", "review": "Really enjoyed this game and would recomend it to anyone who is looking for a new and interesting point & click", "timestamp_created": 1489524094, "timestamp_updated": 1489524094, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30498278": {"recommendationid": "30498278", "author": {"steamid": "76561198057858853", "num_games_owned": 109, "num_reviews": 1, "playtime_forever": 259, "playtime_last_two_weeks": 0, "last_played": 1489443203}, "language": "english", "review": "I am really intrigued by the game. I love how the exiting story captivated me and made me curious for the next chapters. Especially the end of book 2 was truely... shocking, I did not see that coming. I hope other people will enjoy the game as much as I did up till now. I also learned about some things I didn't know before I played the game.\n\nI didn't play out any other story lines yet so I can't say whether there is any difference in outcome when I change my choices but I have come to believe there are many other outcomes to the story.\n\nThe game finished quite fast but for this game I didn't mind it that much because the story already captured me. I liked the artwork and I think I can get some extra playtime when I play out the other outcomes.\n\nOverall I hope that the game gets a follow up on the story so I can find out about what happened and happens next.", "timestamp_created": 1489444088, "timestamp_updated": 1489444088, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.547032", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30403307": {"recommendationid": "30403307", "author": {"steamid": "76561198024847480", "num_games_owned": 42, "num_reviews": 2, "playtime_forever": 349, "playtime_last_two_weeks": 0, "last_played": 1493782899}, "language": "english", "review": "Beautiful boatship to explore in a simple point and click.\nGood looking graphics for an thrilling interactive drama.\n\nLe Protectorat, pour ou contre ?", "timestamp_created": 1489038413, "timestamp_updated": 1489038413, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30390340": {"recommendationid": "30390340", "author": {"steamid": "76561198011515841", "num_games_owned": 227, "num_reviews": 24, "playtime_forever": 296, "playtime_last_two_weeks": 0, "last_played": 1488945229}, "language": "english", "review": "Can't wait for Books 3 & 4!  The historical elements and story kept my interest throughout.  Lots to click on and read about in the journal.  Bad voiceover work could have killed this game, but the voiceover talent was excellent!  Very enjoyable experience aboard the Herald.\n\nIf you like interactive stories, I think you would most certainly like this one.  Choices do seem to matter, even though some we might not find out about some until the next installment.", "timestamp_created": 1488978046, "timestamp_updated": 1488978046, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.525140", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30375509": {"recommendationid": "30375509", "author": {"steamid": "76561197978711297", "num_games_owned": 5015, "num_reviews": 29, "playtime_forever": 234, "playtime_last_two_weeks": 0, "last_played": 1487690215}, "language": "german", "review": "\"Devan Rensburg ist alles andere als ein geborener Seemann. Er ist eher schmächtig, recht intelligent und er lässt sich nicht gern herumkommandieren. Trotzdem heuert er an einem schicksalhaften Tag im Jahr 1857 auf der HLV Herald an.\n\n...\n\nHerald spielt sich zwar eher wie ein klassisches Point & Click Adventure, aber im Fokus stehen ganz klar die Gespräche mit der Crew und den Passagieren an Bord. Statt euch bei raffinierten Rätseln den Kopf zu zerbrechen und Items zu kombinieren, führt ihr in erster Linie die banalen Befehle eurer Vorgesetzten aus. Und während ihr dem Kapitän und seinen Gästen den Tee serviert oder in der Kombüse aushelft, kommt ihr mit den unterschiedlichen Charakteren ins Gespräch. Auf diese Weise lernt ihr aber nicht nur die anderen besser kennen, sondern formt mit euren Antworten auch nach und nach Devans Persönlichkeit. Die Wahl fällt dabei nicht immer leicht, denn die Entwickler haben sich viel Mühe gegeben, das Schiff mit vielschichtigen Figuren zu bevölkern, deren Beweggründe sich nicht immer gleich mit gut oder böse abstempeln lassen.\n\n...\n\nHerald ist ein ebenso spannendes wie mutiges Abenteuer, das auf clevere Weise Themen anspricht, mit denen wir als Gesellschaft bis heute zu kämpfen haben. Mein einziger Kritikpunkt ist, dass das Warten auf Book III & IV (erscheint als DLC) nach diesem verblüffenden Cliffhanger zu einer echten Qual werden dürfte.\"\n\nWer mehr wissen mag, findet auf meinem Blog den kompletten Test:\n\nhttp://polygonien.de/2017/02/do-as-the-white-man-does-herald-an-interactive-period-drama-book-i-ii-im-test/", "timestamp_created": 1488904668, "timestamp_updated": 1489053817, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.575430", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "30315853": {"recommendationid": "30315853", "author": {"steamid": "76561198163246712", "num_games_owned": 56, "num_reviews": 5, "playtime_forever": 527, "playtime_last_two_weeks": 0, "last_played": 1491360525}, "language": "english", "review": "This was truly a great experience! i simply love how all the carachters have this sort of down-to-earth feel to them and better yet the story up to this point is AMAZING i cant wait for the rest of the episodes to come out!", "timestamp_created": 1488637956, "timestamp_updated": 1488637956, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30294826": {"recommendationid": "30294826", "author": {"steamid": "76561197993603676", "num_games_owned": 102, "num_reviews": 1, "playtime_forever": 22, "playtime_last_two_weeks": 0, "last_played": 1488547073}, "language": "english", "review": "Herald is how I want more narrative-focussed games to be like. The writing is excellent, the world-building is top notch, but most prominent of all: the game is extremely well paced. No meandering, no filler gameplay, no plot-jamming characters. This gives the game a forward momentum that makes you want to finish the two episodes in one sitting.\n\nRegarding gameplay: it is much more of a story-telling based game than, say, a point-and-click adventure. Expect to find the challenge in making decisions in the storyline (which can be quite challenging!) than within puzzles. This game is for people interested in roleplaying & interactive storytelling.\n\nThe biggest downsides are that the visual style may need some getting used to & some of the voice acting of some of the side-characters sound odd in compare to the main characters. Because the game relies on telling a story based on your choices, you may occasionally encounter a plottwist and only then realise you didn't gain the full picture before.\n\nBesides this, I do wish to highlight some other aspects too: The feeling of the setting is communicated quite well through some really good directing and audio work. The ship feels like a ship, especially when things get a bit more tense (and things do get tense!).\n\nAn semi-obligatory disclaimer: I was a kickstarter backer and I played the DRM-free version. Back then I backed a few other games which turned into mostly disappointments (I'm rather picky with games that claim to have good stories or narratives). So while I appreciated the intention of the creators, I was a little more than sceptic when I started playing. It feels good to be proven wrong.", "timestamp_created": 1488548220, "timestamp_updated": 1488548266, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.642679", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30265765": {"recommendationid": "30265765", "author": {"steamid": "76561197969386268", "num_games_owned": 470, "num_reviews": 3, "playtime_forever": 273, "playtime_last_two_weeks": 0, "last_played": 1488397736}, "language": "english", "review": "I've played the game at the Gamescom 2016 for the first time and it got me hooked because of the setting, the art style and the music. Therefore I had to buy it right after it got released.\n\nAs you can see from the 4 hours of playtime, the two books can be played through quite quickly, yet you can (and should) replay to see what happens with the story in an alternative savegame.\n\nThe game emphasizes on the decisions you make, similar to the Telltale adventure games. However, you don't have quicktime events, multiple savegames for one story line or endless dialogues. There's an automatic savegame mechanism in place, which saves the game usually when entering new locations after important scenes or conversations. There's no other way to save your game, so you have to stick with your decisions or start from the very beginning. With the 3 available savegame slots you can create 3 different story lines. The conversations are good in length and content, the story related dialogues are all voiced and sound really great. I wished to have all dialogues voiced, but that's only a minor issue.\n\nAlso this game should not be confused with a typical Point and Click adventure game. It is what it is: An Interactive Period Drama. Interactive regarding your decisions, period regarding the game's general setting (just listen to the music!) and drama because of the story's content and presentation. When I talked with one of the creators at Gamescom, he said the emphasis is the story (and your decisions) and now I can say it does deliver till the end of Book II, which has a cliffhanger with many questions left unanswered, so I can't wait for book III and IV to be released.", "timestamp_created": 1488396469, "timestamp_updated": 1488396469, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30260485": {"recommendationid": "30260485", "author": {"steamid": "76561198208066220", "num_games_owned": 9, "num_reviews": 3, "playtime_forever": 183, "playtime_last_two_weeks": 0, "last_played": 1487941571}, "language": "english", "review": "Great to see this fine effort for a point n' click adventure with some truly inspiring content.\nAtmosphere of the game is great and so are the visuals.\n\nIf you are looking for humor you'd better steer clear of this though!\n\nKeep up the good work people!\n", "timestamp_created": 1488376522, "timestamp_updated": 1488376522, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30252492": {"recommendationid": "30252492", "author": {"steamid": "76561198177699033", "num_games_owned": 59, "num_reviews": 2, "playtime_forever": 154, "playtime_last_two_weeks": 0, "last_played": 1488335198}, "language": "english", "review": "this game me stressed in a good way", "timestamp_created": 1488335248, "timestamp_updated": 1488335248, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30227626": {"recommendationid": "30227626", "author": {"steamid": "76561198030151051", "num_games_owned": 327, "num_reviews": 7, "playtime_forever": 191, "playtime_last_two_weeks": 0, "last_played": 1489300314}, "language": "english", "review": "I'm a little over halfway through the current content and it's pretty good.  Fun short little story about a few small people caught up in the large empire that was the East India Trading Company (an alt history version) with good voice acting, interesting charcaters and a few suprinsingly tense moments.  This a definately worth $10 and a weekend of your time if you like these sorts of stories.  It does have some gameplay, a la \"Life is Strange\" story affecting conversation options, but nothing will require any physical skill or reaction timing, just rational thought.", "timestamp_created": 1488228384, "timestamp_updated": 1488228384, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30210281": {"recommendationid": "30210281", "author": {"steamid": "76561198023601820", "num_games_owned": 111, "num_reviews": 7, "playtime_forever": 170, "playtime_last_two_weeks": 0, "last_played": 1488157674}, "language": "english", "review": "nice story i enjoyed it wish it was a little longer \ni liked the ship life good point and click adventure \nwould buy next chapters", "timestamp_created": 1488158058, "timestamp_updated": 1488158058, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.474180", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30191279": {"recommendationid": "30191279", "author": {"steamid": "76561198058667562", "num_games_owned": 316, "num_reviews": 4, "playtime_forever": 165, "playtime_last_two_weeks": 0, "last_played": 1487969871}, "language": "english", "review": "Herald is a nice game with a story that is a lot more interesting then you might think. I was intrigued by the story and when I finally finished it (the first half that is, the second is not out yet) I had several questions left that I want to be answered in the 2nd part.\n\nThe 2D art-style is really quite unique and cool. I have to agree with others that the voice acting is very well done. You can really hear the ancestry of the NPCs you meet. Good job on that.\n\nThen there is the branching. The branching of the story feels like it actually branches more then games from like Telltale (Walking Dead, Batman, Wolf Among Us), where the choices are usually 'fake'. I got different cinematics based on my choices and characters still reference choices I made much earlier in the story.\n\nOn the downside it is rather short, I finished it in 1.5 evenings and part 2 (book III & IV) is not out yet. The gameplay is also mainly clicking around, as a proper point and click adventure requires. This game is not about puzzles though, it is about the story.", "timestamp_created": 1488102732, "timestamp_updated": 1488102732, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.478261", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30177080": {"recommendationid": "30177080", "author": {"steamid": "76561198065385098", "num_games_owned": 148, "num_reviews": 6, "playtime_forever": 488, "playtime_last_two_weeks": 0, "last_played": 1499534360}, "language": "english", "review": "TLDR: Herald is Murder on the Orient Express meets Equiano's Voyage to England and it's fantastic.\n\n+Beautiful world\n+Well conmstructed Lore\n+Engrossing characters\n+Talented Voice Actors\n+An enticing mystery plot and engaging subplots\n+Socially relevant themes handled intellignetly and interestingly\n-Weak graphics\n\nThe most striking thing about Herald is its world design, both from a visual perspective and a lore persepctive. First, the visual. The Herald, it's crew and its passengers are all a perfect blend of authentic 18th century culture and their alternate world where the Protectorate is law. From the rich blues of the officers to the dour, flemish-looking finery of its wealthier passengers to the traditional Indian clothing of the Rani. Second, it's lore. Herald takes the fairly plausible possibility of Oliver Cromwell remaining in power and uses it to show us a world where Britain is considered the centre of the free world and also a global empire simultaneously. And that is a very important phrase in Herald 'the free world' and all it means. \n\nAs an outsider to this world we see that the protectorate is a Republican Empire (Republican in the sense that it has no king, I'm not criticising the GOP) masquerading under the notion of freedom. Non-white/ non-western people are stepped on and even those who are citizens of the Protectorate are always worse off than their white counterparts. We also see the incredibly stratified and confining class system expressed in the ship's protocol. Through the lense of the Protectorate we are encouraged to consider these issues, race, class and imperialism as they aply to our own world and our own history of exploiting other nations. In the end we are made to ask if we can truly claim to be living in the 'free world'. But the message is always subtle and always interprative. Herald never tells us we are wrong, it asks us to consider if we are right.\n\nThe dialogue and characterisation is also spot on. It strikes an excellent balance between convincing 19th century speech and behaviour and making these figures relatable to our 21st century viewpoint. There are no evil people just a cast of opponents and allies that all think they're doing what needs to be done or who believe they are acting justly. All the major players manage to be likable and believable enough to keep us interested in them.\n\nThe gameplay, I think is this game's biggest let down. Whilst the talking heads are beautiful and this cast of relative unknowns do an absolutely excellent job of breathing life into a well written script there is no physical acting to compliment the conversations and the graphics are extremely antiquated. Put together it feels like the physical part of the actors performances are missing which undercuts their impact.\n\nCompared to other games in the genre, Herald lacks puzzles or QTEs.That said, Herald is a slower paced game that is more focussed on making decisions while you get into the character of Devan and his world on the Herald. But in all it is a joy to play through.\n\nIn conclusion I would highly recomend a play through of this game and it's a must buy if you catch it on sale.", "timestamp_created": 1488054624, "timestamp_updated": 1488214938, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.530806", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30148919": {"recommendationid": "30148919", "author": {"steamid": "76561198018339579", "num_games_owned": 139, "num_reviews": 1, "playtime_forever": 128, "playtime_last_two_weeks": 0, "last_played": 1500045028}, "language": "english", "review": "Herald Game is a rich, colourful visual novel that captured me from the demo. I love that the developers took the time to do their research and make this a great historical AU, that does not shy away from issues of race, class and Imperialism to tell Devan's story.\n\nIt's gorgeous to look at, and I'm already planning out how to replay with different choices as I wait for Books III and IV! Great job Wispfire. \n\nDisclosure: I recieved a free copy of the game and a code to give away on my stream. That does not detract from my love of the game, nor did that influence my review.", "timestamp_created": 1487965619, "timestamp_updated": 1487965619, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.624060", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "30137442": {"recommendationid": "30137442", "author": {"steamid": "76561197963382966", "num_games_owned": 14, "num_reviews": 2, "playtime_forever": 197, "playtime_last_two_weeks": 0, "last_played": 1491161130}, "language": "english", "review": "first time trying an indie game, and i love it! I am taken by the recent Taboo series which sets in an alternative reality of theDutch East Indies era, and generally intrigued by colonial times. The creators portray drama and dilemmas in a subtle way intermingled with clever jokes. Very impressed by this game and hats off to the developers! This weekend I'll play book II and looking forward to the rest too!", "timestamp_created": 1487929576, "timestamp_updated": 1487929723, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30135053": {"recommendationid": "30135053", "author": {"steamid": "76561198153928755", "num_games_owned": 73, "num_reviews": 6, "playtime_forever": 171, "playtime_last_two_weeks": 0, "last_played": 1487917693}, "language": "english", "review": "Gripping fundamental story with an immersive background. \nPresents with an alternative reality regarding the British Empire and it's colonies - the Protectorate. \nSpectra of choices feel tangible and important. \nCharacters have good writting and personalities. \n\nInfused with a few nice twists, Herald: An Interatice Period Drama - Book I & II, delievers a relaxing experience and fulfills it's price at $10.99 CDN.", "timestamp_created": 1487918144, "timestamp_updated": 1487918144, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.504587", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30121159": {"recommendationid": "30121159", "author": {"steamid": "76561198279847978", "num_games_owned": 1, "num_reviews": 1, "playtime_forever": 253, "playtime_last_two_weeks": 0, "last_played": 1487881682}, "language": "english", "review": "Telltale games are pretty hot right now. Herald is especially cool because it's an indie game that just looks so charming. The environments and lighting feel almost Blizzard-esque at times, though the 2D character models probably steal the show in the visual department. From the controls to the way you interact with the environment, everything feels smooth. The thing I like most about Herald, though, is the way that the player is confronted with certain social issues without the game presenting them in an overly simplified and necessarily obvious way. I guess I could give an example of this but I wouldn't want to give away any spoilers. If you like telltale games or are just curious about this game, just buy it. It's worth the €10.", "timestamp_created": 1487863951, "timestamp_updated": 1487863951, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.554569", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30115972": {"recommendationid": "30115972", "author": {"steamid": "76561198030647965", "num_games_owned": 26, "num_reviews": 1, "playtime_forever": 306, "playtime_last_two_weeks": 0, "last_played": 1488115880}, "language": "english", "review": "Love it! \nI supported the kickstarter because I love the artwork, but I am staying for the amazing story and background. \n\nI have played through Herald once, but I really had the feeling I had influence on the plot. Without spoilering: I remember being very happy about how I helped to settle an argument between two characters... untill the next scene when my wonderfull sollution came back to haunt me. And there is no going back either, this was my choice and I would need to live the the consequences. \nSo, if you'll excuse me, I am off to replay this game, so I can see how other sollutions would play out. I have this feeling that my second playthough will give me a whole new story, and I am already looking forward to it! \n", "timestamp_created": 1487844006, "timestamp_updated": 1487844006, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.518519", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30113190": {"recommendationid": "30113190", "author": {"steamid": "76561198013323781", "num_games_owned": 235, "num_reviews": 10, "playtime_forever": 359, "playtime_last_two_weeks": 0, "last_played": 1499475899}, "language": "english", "review": "This is a good, down-to-earth, visual novel that is beleiveable. \nI must warn you that this is not an anime-visual novel that's abundant out there. This visual novel has a decent believeable plot with none of cliche characters based on an alternative colonial era.\n\nI feel this visual novel is for mostly adults or mature teen.\n\nYou have no powerful heroes here; just human beings trying to make their lives work in a way or another.\n\nWhich is what a drama is all about.", "timestamp_created": 1487829275, "timestamp_updated": 1487829275, "voted_up": true, "votes_up": 36, "votes_funny": 0, "weighted_vote_score": "0.736576", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30110739": {"recommendationid": "30110739", "author": {"steamid": "76561198058043953", "num_games_owned": 100, "num_reviews": 50, "playtime_forever": 237, "playtime_last_two_weeks": 0, "last_played": 1487915204}, "language": "english", "review": "It's a point & click game with a fairly interesting story. The game is adequately voice acted but can get monotone at times. The environment is nice to look at and so does the character portrait. \n\nBe warned, though. Just like in all of Telltale games, most of the conversation choices are merely for role playing as the main character. Except for a selected few, they don't really matter much. Don't expect for any major changes while replaying.", "timestamp_created": 1487815088, "timestamp_updated": 1487925146, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.516946", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30109045": {"recommendationid": "30109045", "author": {"steamid": "76561198357467063", "num_games_owned": 8, "num_reviews": 1, "playtime_forever": 204, "playtime_last_two_weeks": 0, "last_played": 1487809102}, "language": "english", "review": "I love this game. I've played it through and I truly enjoyed the character design, the voice acting and especially the setting. While I was expecting a history lesson packaged in a game, Herald Book I & II has surprised me with a lot of twists and refined humour. I hope Wispfire will soon enough continue this story; if they were available now as DLC, I would have not hestitated for a second to get them.", "timestamp_created": 1487806103, "timestamp_updated": 1487806534, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.586143", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30107953": {"recommendationid": "30107953", "author": {"steamid": "76561198088475310", "num_games_owned": 87, "num_reviews": 16, "playtime_forever": 95, "playtime_last_two_weeks": 0, "last_played": 1487845473}, "language": "english", "review": "It very good looking game i already like it i will do a walkthrough of this game if want to check it out in my channel here:\nPart 1:\nhttps://www.youtube.com/watch?v=Uqi5Uc5WC4c\nPart 2:\nhttps://www.youtube.com/watch?v=tEsjqBvhI08&t=25s", "timestamp_created": 1487800862, "timestamp_updated": 1487865683, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.322056", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30104002": {"recommendationid": "30104002", "author": {"steamid": "76561198200221299", "num_games_owned": 30, "num_reviews": 14, "playtime_forever": 282, "playtime_last_two_weeks": 0, "last_played": 1487546630}, "language": "english", "review": "Video Review Ahoy!:\n\nhttps://youtu.be/WmKO4FI95mg\n\nFor more indie reviews check out my ad-free channel:\nhttps://www.youtube.com/channel/UCgjA-SeSysOTwXuqdWzAF_Q\n\n\nBook One:\n\nThe colonial times of the British Empire isn't exactly a part of history that's been 'done to death' within the video games medium. This doesn't come as a huge surprise, due to it having a controversial nature and possessing sometimes, convoluted politics. With Herald, it's nice to see this historical material implemented in an interesting way and communicated in a manner that engenders the player with a sincere enough interest of it.\n\nA shipwreck is always an effective start to a story. Here, it sets the scene nicely and quite quickly has us questioning the main character's journey and motives. Devan Rensburg is being held prisoner in what appears to be the Indian colonies. I use the word 'prisoner' relatively loosely, as he is being held captive in a room, furnished luxuriously with items of eastern design whilst at the same time being questioned by a woman known as The Rani; a Hindu title denoting Sovereignty. His story is one that he appears to have told her once already, judging by her demands that he tells her again \"truthfully\", what he is seeking in the colonies. Her suspicions are, however, understandable. Firstly; Devan is a young man of mixed heritage. He explains that his father is from the protectorate and his mother, is originally from the colonies. Secondly; he was pulled from the sea wearing not the garb of a standard crew member, but a captain. It's these unusual set of circumstances that pave the way for the player to not only unravel Devan's nautical story but to contribute towards it too.\n\nTold via flashbacks the game jumps from the regalia enriched room to the ship itself - Herald; a merchant vessel on the Indigo route on which Devan is the steward. Further to the opening section which contained mild interactivity, the UI and simple mechanics are explained in a tutorial set piece with the main protagonist and some of the crew. Straight away we're given a bit of a conundrum which has us wondering if our relationship with the hierarchy could go as salty as the sea air, from the outset. Shortly after, the tour of the main deck and some interactions with other crew members inform us of how to navigate the area and takes us through Devan's journal. Events, objectives, historical nuggets of info and map of the Herald are all recorded here in his pocket sized encyclopedia.\n\nAn Officer And A Cabin Boy:\n\nBeing someone who leans more towards the rustic nature of a print publication for a straightforward story, I was glad that Herald: An Interactive Period Drama introduces some nice choices, ultimatums and conversational pathways, not unlike a standard point 'n click adventure. Dialogue trees seemed to offer a nice amount of scope for fleshing out Devan's personality. This is always welcome and allows me as the player to emotionally engage with the plot and characters further. Becoming involved in disputes between other crew members, clashes of ego's and possible incidents of a darker and grubbier nature are all matters that Herald delivers within book 1. The seedier subject matter which is hinted at, seemed to be something, in my opinion, that could've possibly been handled in a slightly more artistic manner. This could well be the case further down the line but the kicker here, is that I didn't get to find that out.\nUpon firing the game up again to play through Book 2, I was rather dismayed to notice that my save file, which remained perfectly intact through two previous sittings had vanished completely. Try as I may to recover it, I had to concede that the only way to get through Books 1 & 2 in their entirety would be to start over. Although save game issues are problems that do unfortunately occur with Beta titles, or those simply within their teething stage, I'm not prepared to spend the time going through all of it again as I really shouldn't have to. A shame! After a bit of a slow start I was getting quite hooked by the story and indeed some of the personalities that developers Wispfire have provided for us.\n\n\n\nA Well Scrubbed Deck:\n\nAida, the Art Director has done a fantastic job as the game is very pleasant to look at. Character animations are nothing that I'd describe as detailed but the art work is effective enough. Basic in some places and pretty in others, especially on the character portraits during the dialogue scenes. Fine art style brushstrokes and some bold outlines create some lovely visuals. The sound also plays its part well. Aside from very occasional discrepancies with the voice acting; articulation being slightly off in places, the characters are brought to life nicely. The background music appropriately compliments each section and ambience such as the creaking of the Herald itself sets the scene in an evocative way without being intrusive.\n\nSuffice to say I quite enjoyed what I played of Book 1 (It felt as though I was coming to the end) and may return in the future. Developers Wispfire have created a nice mix here, of choice driven adventure and visual novel. I'm confident that fans of either genre, will be interested in seeing how things unfold for the enigmatic Mr Rensburg.", "timestamp_created": 1487786281, "timestamp_updated": 1487992652, "voted_up": true, "votes_up": 21, "votes_funny": 3, "weighted_vote_score": "0.437347", "comment_count": "4", "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "39340476": {"recommendationid": "39340476", "author": {"steamid": "76561198318053942", "num_games_owned": 10, "num_reviews": 1, "playtime_forever": 267, "playtime_last_two_weeks": 252, "last_played": 1515115622}, "language": "english", "review": "I honestly just love it. Herald went from \"oh, this looks kinda interesting\" to \"I wish there was more\" in a couple of hours. Sure, I'm sad it's a little short, but right now I'm just excitedly waiting for more. The setting & universe just pulls you in immediately as you start playing and you can't wait to see what the voyage has in store for you.\n\nThe graphics are unique and add to the atmosphere. I'm a big fan of visual novels and I thought it was cool to experience the story in a kind of a new way; not only seeing the character sprites(which are also beautifully animated in Herald, by the way) but also being able to actually move and explore things in the world.\n\nDefinitely keeping my eye on Wispfire from now on. Can't wait to see more games from them.", "timestamp_created": 1515942003, "timestamp_updated": 1515942003, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39230067": {"recommendationid": "39230067", "author": {"steamid": "76561198112473855", "num_games_owned": 14, "num_reviews": 2, "playtime_forever": 202, "playtime_last_two_weeks": 0, "last_played": 1499792463}, "language": "english", "review": "A lovely interactive game with nice atmosphere and characters.", "timestamp_created": 1515587335, "timestamp_updated": 1515587335, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}}
