{"reviews": {"38389131": {"recommendationid": "38389131", "author": {"steamid": "76561198158307849", "num_games_owned": 126, "num_reviews": 1, "playtime_forever": 5450, "playtime_last_two_weeks": 0, "last_played": 1512888897}, "language": "english", "review": "“What had transpired here tonight was a rather complex chain of events, but I was going to explain everything as best as I could… So that they, too, would be able to understand the tragic truth behind it all. “\n-Raiko Shinpuku\n--------------------\nSHINRAI ~ Broken Beyond Despair is a murder mystery visual novel and first in the SHINRAI series, as well as the first game developed by indie German video game developer “Gosatsu”, a duo consisting of core members Gospel and Natsu. As a visual novel, gameplay in SHINRAI ~ Broken Beyond Despair consists primarily of reading, with interactivity delegated to segments wherein the player is prompted to present evidence in order to prove or disprove character deductions. Through a series of just such segments, the player progressively pieces together the identity of an anonymous killer and reveals the truth behind an otherwise seemingly straightforward death.\n\nA secluded mountain resort, 10 friends, 1 murderer. Investigate, interrogate and present evidence as you solve various mysteries throughout the night. Will you be able to reach the truth and uncover the culprit’s identity? Or will your deductions lead you to blame someone completely innocent…? (Steam/Itch.io synopses)\n----------------\n\nAll too often is it said that “first impressions last forever” and that what defines your opinion of a person or thing is your very first, very basest of experiences with it. Quite the opposite, however, SHINRAI ~ Broken Beyond Despair establishes an identity for itself that would be somewhat unbecoming to one giving it a cursory look-over or a relatively noncommittal playthrough, and one that betrays the sheer quality of what SHINRAI eventually grows into.\n\nSHINRAI’s introductory scene found itself, when measured against everything following it, comparatively unwelcoming: juvenile humor and a somewhat uninspired setting saved just barely by a colorful ensemble of charmingly eccentric characters. Nonetheless, as banal as it may be, it was paced expertly and fluidly presented an array of details and information that make the scene nothing short of essential.\n\nSucceeding the opening segment, however, were a series of scenes equal parts shocking and engaging. In a number of ways, Gosatsu prove themselves masters of detail and suspense, utilizing the closed-circuit setting to create a wonderfully nonlinear mystery with a number of conclusions, all equally distinctive and convincing, bar the very truest of them, the one you’d least expect. In allowing the player to pursue any of the prospective murderers, Gosatsu creates a truly interactive murder mystery that rightly forces the player to make sense of the dizzying phantasmagoria of criminal activity they experienced throughout the night.\n\nSHINRAI ~ Broken Beyond Despair, to the most superficial of an audience, would initially seem unappealing or generic. It is worth it, though, to read SHINRAI in its entirety, as the mystery presented rivals perhaps some of the best in the genre. Any with experience with murder mysteries and/or the visual novel genre will feel right at home with SHINRAI, as would any who just wish to read an intelligent and thoroughly thought-out story in the ilk of Ace Attorney or Danganronpa.", "timestamp_created": 1513554271, "timestamp_updated": 1513554271, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.529703", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38247310": {"recommendationid": "38247310", "author": {"steamid": "76561197970187681", "num_games_owned": 284, "num_reviews": 2, "playtime_forever": 1031, "playtime_last_two_weeks": 0, "last_played": 1513652382}, "language": "english", "review": "As a fan of the Danganronpa franchise, I figured SHINRAI would be worth a go, and it did not disappoint. The overarching mystery was well crafted, abetted by charming characters, colorful artwork, and an atmospheric sound track. On the negative side, the story is very slow to build, with key revelations and motivations unfolding in a large exposition dump at the end. Further, the writing is rather stilted at points, which wrecks player immersion a bit.\n\nOverall, though, SHINRAI's virtues far outweigh its vices. It's an enjoyable romp, and I look forward to seeing the creators develop this world and its characters further.", "timestamp_created": 1513044004, "timestamp_updated": 1513044172, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38063294": {"recommendationid": "38063294", "author": {"steamid": "76561198156567906", "num_games_owned": 119, "num_reviews": 6, "playtime_forever": 410, "playtime_last_two_weeks": 0, "last_played": 1512411244}, "language": "english", "review": "I will start by saying that this review contains minor spoilers about the characters and story.\n\nSHINRAI - Broken Beyond Despair is an indie mystery visual novel that has some elements similar to the Danganronpa series which I also am a big fan of.\n\nThe story circulates around 10 classmates that decide to hold a halloween party in a secluded mountain resort: \n\nRaiko - Main character. Girl that doesn't show many emotions. Appears to be unfriendly towards others\nNobara - Raiko's best friend. Laid-back personality but very gullible\nRie - Host of the party. Tends to act before she thinks. Chaotic and forgetful\nRuna - Rie's best friend. Caring and kindhearted. Sophisticated\nMika - Troublemaker. Always pranking people. Goal is to scare Raiko\nMomoko - Popular girl in the school. Introverted and shy\nHiro - Momoko's boyfriend. Arrogant and loves to glorify himself\nKamen - Momoko's best friend. Honest person that never holds back. Doesn't like Raiko.\nKotoba - The most hated one in the group as he's considered a creepy pervert.\nTaiko - Kotoba's best friend. Kind and reliable guy. Rie's crush.\n\nWhen the resort suddenly gets affected by a power outage, the 10 friends split up in groups. After the power comes back on, the friends find a dead body in one of the guest rooms. The base-story is what you would call a classic murder mystery, and is not a creative one in any way. However, just as in most murder mysteries, the characters play a very big part in the storytelling and is a crucial element in every part of the story. The characters of importance have a decent and realistic backstory which in turn also builds up the story.\n\nStory: 6/10\n\nThe characters in SHINRAI have different personalities that are relatively realistic. However, most of them don't really stand out and they aren't really likable as characters. There weren't any conversation scenes where one of the characters did a stupid pun that was surprisingly fun, any scenes where one of the characters steps in to protect the main character, any scenes where one of the characters turns out to be a psychopath, or anything that makes them unique to the others. My favourite character was Kotoba as his perverted nature made him clearly different from the others and fun to talk to due to his stupid puns.\n\nCharacters: 5/10\n\nThe gameplay in SHINRAI is one of its stengths in my opinion. Instead of having a game where you only would read and click next, like most visual novels, the developers decided to add an investigation mode, similar to Danganronpa's. This investigation mode is a point and click mode where you investigate objects of interest, as well as talk to witnesses in order to find clues and evidence. There were also choices that you could actively pick between, resulting in several routes and results, the VN is made so that you as a player is able to deduct and think WITH the main character. The crime is interesting and complex, but it's described so that you would be able to try figure out what happened instead of just letting the main character explain everything at the end (which she later does though). The investigation mode could need some polishing and it was frustrating how you aren't able to save before making the choices.\n\nSomething that was really bothering me though, was the fact that all characters except 4 had alibis instantly and it kind of removed the suspense of trying to figure out who the culprit could be.\n\nGameplay: 7/10\n\nThe art is very unique to this game. It's not very polished but it's to be expected, as it was actually the developer who drew it. It was bothering me at first when playing the game as I'm used to more anime-like art like most visual novels use, but as you play the game, you'll eventually get used to it. Even though the art works relatively well for its purpose, more facial expressions could have been added as the characters tended to look the same almost always and I never saw any significant changes except for when they were crying. Though my opinion may differ from others playing the game, I'm certain that the game would have looked a lot better with anime-like art similar to danganronpa.\n\nArt: 4/10\n\nEven though the game had its bad points, and the fact that it was quite short a game, it was still very enjoyable to read. I had a great time trying to figure out the puzzle in my head, while changing theories left and right. As an indie game, I personally believe that they did a great job, and I would recommend it to people who love murder mysteries that allow you to think and solve the crime by yourself.\n\nTotal score: 6/10", "timestamp_created": 1512414164, "timestamp_updated": 1512414164, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36127120": {"recommendationid": "36127120", "author": {"steamid": "76561198043885428", "num_games_owned": 251, "num_reviews": 1, "playtime_forever": 575, "playtime_last_two_weeks": 0, "last_played": 1509319753}, "language": "english", "review": "Game was well developed mystery that allows for multiple suspects to keep deduction compelling.", "timestamp_created": 1509320851, "timestamp_updated": 1509320851, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36072647": {"recommendationid": "36072647", "author": {"steamid": "76561198141036440", "num_games_owned": 212, "num_reviews": 7, "playtime_forever": 434, "playtime_last_two_weeks": 0, "last_played": 1509146688}, "language": "english", "review": "A surprisingly good visual novel. Going into it I wasn't expecting too much but I feel like it was a very well done visual novel despite maybe coming off as being low budget. The mystery kept me guessing, the characters were cliche but I still liked them and the art style fit the visual novel. Overall I would recommend it, it is a little short so if you are looking for a visual novel you will get a lot of hours out of this probably isn't it.", "timestamp_created": 1509186898, "timestamp_updated": 1509186898, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35877616": {"recommendationid": "35877616", "author": {"steamid": "76561198214251437", "num_games_owned": 102, "num_reviews": 5, "playtime_forever": 381, "playtime_last_two_weeks": 0, "last_played": 1508550147}, "language": "english", "review": "Much better than I expected. After seeing glowing reviews I decided to buy the game; I’m glad I did!\n\nTurns out, the story is great - think Danganronpa/Ace Attorney style twists, the characters were all fairly fleshed out and likeable.  I quickly warmed to the artwork, as it is expressive, unique and fits the game well. The music is enjoyable as well.\n\nAll in all, I was very pleasantly surprised, and would highly recommend this game! - not to mention hints of yuri ;)))", "timestamp_created": 1508548096, "timestamp_updated": 1509105926, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34965602": {"recommendationid": "34965602", "author": {"steamid": "76561197971874482", "num_games_owned": 653, "num_reviews": 21, "playtime_forever": 315, "playtime_last_two_weeks": 0, "last_played": 1505456789}, "language": "english", "review": "A well done but clearly indie VN with a solid mystery.  Starts a little slow with a long expository / introduction phase but is worth taking the time to get into.  It's somewhat short in its entirety but the bonus is that nothing is overly drawn out, it's all tight.\n\nI'd say it's kind of like playing one of the long cases of a Phoenix Wright game but with more of the darker vibes of a Danganrompa title.  If you like either/both of those, give this a shot, especially if it goes on sale.", "timestamp_created": 1505457603, "timestamp_updated": 1505457603, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.548872", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34902475": {"recommendationid": "34902475", "author": {"steamid": "76561198065788473", "num_games_owned": 114, "num_reviews": 18, "playtime_forever": 568, "playtime_last_two_weeks": 0, "last_played": 1505106580}, "language": "english", "review": "Pros\n-Decent mystery and nice plot twist (not a super intricate mystery but not bad either, fun to puzzle out)\n-Bad Ends and True End ; I actually liked the Bad End mechanic in that I didn't even realize I had named the wrong culprit until I had gone on to accuse them for ten minutes and actually believed my suspect was the killer until the Bad End screen came up and told me how wrong I was\n-OST is pretty decent\n-Notebook and Diary etc is helpful for noting down what happens in the game\n-Butterfly Effect kinda? [spoiler] One of the victims can be saved. [/spoiler]\n\nCons\n-Kinda short\n-Characters are a bit stereotypical IMO, with only a few small exceptions\n-Weird gender imbalance? There are 7 girls and only 3 guys, and 2 of those 3 guys have almost no redeeming qualities whatsoever and are the two main \"jerk\" characters in the cast. [spoiler] Also those 2 guys end up being the only real \"victims\" so basically the worst characters die and most of the good ones survive. I know it had to be this way to fit the killer's motive but it felt like there wasn't much tension to find out who the killer was, given that the ones who died all deserved it, and no \"innocent\" person got hurt or killed. [/spoiler]\n-One character [spoiler] Mika [/spoiler] is completely irrelevant to the story in that they can be removed from it and the general flow of the story really isn't affected much, if at all\n\nTL;DR - I recommend the game highly if it's on sale. If not, it depends on how much you really want it but not really $15 for me", "timestamp_created": 1505227129, "timestamp_updated": 1505227129, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34800686": {"recommendationid": "34800686", "author": {"steamid": "76561197996101648", "num_games_owned": 679, "num_reviews": 19, "playtime_forever": 1288, "playtime_last_two_weeks": 0, "last_played": 1504386094}, "language": "english", "review": "SHINRAI deserves your love.\n\nAs most of us do, you probably judge a book by its cover, or, in case of VNs, its art. The art in Shinrai is actually drawn by its main writer and developer and is probably not what you would call professional. However after finishing the game I think the art feels just right in context, and it doesn't hurt the joy of the story even a little bit. There are lots of sprites, lots of expressions and outfits, and a lot of characters including extras. All of them may not be AAA quality, but in this game, they definitely don't need to be. It does what it has to - you grow to like the characters and their funny quirks.\n\nNow, onto the story. What surprised and pleased me the most is that SHINRAI is an actual fair play mystery. Which is something incredibly rare in our age of detective fiction's decline. The main \"case\" is not something the writer made up in three minutes and then explained with five deus ex machinaes, it's an actual well constructed fair mystery that you are challenged to solve. If you're a fan of Agatha Christie, you know what a joy this can be. There are hints, red herrings, timelines, clues, diary to keep track, suspect interviews, everything you need for your grumpy little detective kit. A must have for any serious mystery fan.\nYou may say that the story is nothing new and you'll be probably right. But it's an old story told in a pleasing new way, with a cast of lovely characters.\n\nThe characters are mostly well developed and written well enough to gain your sympathy and empathy. Generally I would describe them as \"very cute but quite realistic\". You won't hear any NYAAAA or see over the top stuff - they behave as normal people would and talk like real people do, which is something that usually separates english VNs from japanese ones. There is quite enough of good humour too.\n\nOverall, if I had to describe the game in three words, I'd say Shinrai is: Indie, Cute, Smart.\n\nLast of all, frankly I don't write reviews often, but in this case I believe it's justified, because Shinrai is very promising and deserves more public recognition - and the public deserves more fair play mystery VNs!", "timestamp_created": 1504811350, "timestamp_updated": 1504811350, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.690272", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34573555": {"recommendationid": "34573555", "author": {"steamid": "76561198111913542", "num_games_owned": 48, "num_reviews": 4, "playtime_forever": 339, "playtime_last_two_weeks": 0, "last_played": 1504000842}, "language": "english", "review": "Really enjoyable Mystery VN, worth full price. Art is decent, gameplay (if you can even call it that) fun, and puzzles are challenging but not over the top. You're missing out if you enjoy mystery type games like Danganronpa and haven't tried this yet.", "timestamp_created": 1504001504, "timestamp_updated": 1504001504, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34556273": {"recommendationid": "34556273", "author": {"steamid": "76561198064286516", "num_games_owned": 91, "num_reviews": 2, "playtime_forever": 574, "playtime_last_two_weeks": 0, "last_played": 1503902104}, "language": "english", "review": "Brief Introduction: allow me to start off saying this is my first review here on Steam. The reason I decided to write one was because, at the time of writing this review, the game has been out for a little over a year but has only 25 reviews. I thought I'd contribute to that number.\n\nNow for the game:\nThe game is of the Visual Novel genre, which, for those that don't know, means that it has a shit ton of dialogue with a few interactive bits thrown in. The art might seem weird at first, but I got used to it pretty fast, and I thought it looked quite decent. Like other have mentioned, the characters have a few different poses, and at some points change outfits, so it's not bad at all.\n\nThe characters are pretty anime-ish at first (which means their personalities tend to be somewhat exaggerated), but as the story progresses and you find out more about them, they can really grow on you.\n\nThe soundtrack I did find a bit lackluster though, and I kept wondering if it was a problem with my notebook, but I could always notice the music/sound effects looping, and it broke the immersion a little bit.\n\nThe story, though, is where the game does shine. Once again, like others have mentioned, the action takes a couple of hours to get started, but once it does, it's pretty easy to want to play through the game in a single session. The mystery is a very interesting one, and I found myself trying to guess what actually took place until the very end, when I had that spark in my mind and things seemed to make sense. And so, along with the protagonist and everyone else, I managed to correctly deduce the true culprit of the events that transpired. The reason I'm saying this is to show that, if you pay enough attention and keep throwing theories around your head to see what makes sense and what doesn't, it is very possible to correctly solve the mystery in your first run, as the game gives you all the tools needed to do it. The mystery in the game is very coherent (no bizarre logic leaps) and makes a lot of sense, so I think this is a huge plus.\n\nSo, for the conclusion:\n-Do you enjoy visual novels/games that are like interactive books?\n-Do you enjoy/not mind anime-ish characters with a somewhat exaggerated personality (that does get a bit of development)?\n-Do you enjoy (actually solvable) murder mysteries?\n\nIf your answer to those questions is yes, then, by all means, give this game a go. It's very likely you'll enjoy it. If I were to rate my personal enjoyment of the game, I think I'd give it a solid 9/10, well worth it's full price.", "timestamp_created": 1503936302, "timestamp_updated": 1503938280, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34546293": {"recommendationid": "34546293", "author": {"steamid": "76561198002571868", "num_games_owned": 438, "num_reviews": 18, "playtime_forever": 682, "playtime_last_two_weeks": 0, "last_played": 1503901995}, "language": "english", "review": "Solid mystery style VN, the twist is actually pretty interesting and well done-- not at all what I expected, and it's a reasonable story as well. \n\nDefinitely worth it, especially for a sale price. The only thing I wish is that there was more than just a ship tease at the end of the game for a certain yuri pairing that I won't mention to avoid spoilers, but alas...", "timestamp_created": 1503902573, "timestamp_updated": 1503902573, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34497676": {"recommendationid": "34497676", "author": {"steamid": "76561198027789951", "num_games_owned": 180, "num_reviews": 44, "playtime_forever": 674, "playtime_last_two_weeks": 0, "last_played": 1509124390}, "language": "english", "review": "While not bringing much in innovation for the mystery genre, SHINRAI – Broken Beyond Despair more than makes up for it with a highly interactive story with well-rounded characters and compelling dialogue. Despite the short playtime, I highly recommend buying this game, even at full price.", "timestamp_created": 1503728358, "timestamp_updated": 1503728358, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33767318": {"recommendationid": "33767318", "author": {"steamid": "76561198057735038", "num_games_owned": 143, "num_reviews": 1, "playtime_forever": 985, "playtime_last_two_weeks": 0, "last_played": 1499757053}, "language": "english", "review": "I play mystery visual novels with at least one other person. This takes longer but gives more enjoyment. Props to the game for deceiving both of us in the end.\n\nThis game has a slow start to build up the characters. It will take a while for the mystery to start. If you want to shorten this, don't explore the optional areas, and don't rewind saves to try other choices. At least until the mystery starts.\n\nCharacters are diverse and well done. The protagonist is interesting while not being too intrusive when making deductions. There is a lot of witty humor between characters, which is amusing when it needs to be.\n\nGlad I bought this, and look forward to the next releases.", "timestamp_created": 1500907216, "timestamp_updated": 1500907216, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33753070": {"recommendationid": "33753070", "author": {"steamid": "76561198170869129", "num_games_owned": 133, "num_reviews": 35, "playtime_forever": 361, "playtime_last_two_weeks": 0, "last_played": 1500844140}, "language": "english", "review": "This is game is one amazing mystery - it's also well-illustrated and well-written.\n\nIt's also challenging and heartwarming with memorable characters. \n\nIt's worth more than $15 and I got 6 hours out of it - granted I am terrible at solving mysteries and used a walkthrough still :-)\n\nBuy it as soon as you feel like it - the majority of the vn games of this quality are double the price and are not even half as good as this masterpiece :D", "timestamp_created": 1500844313, "timestamp_updated": 1500844313, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33161814": {"recommendationid": "33161814", "author": {"steamid": "76561198162196982", "num_games_owned": 189, "num_reviews": 6, "playtime_forever": 1067, "playtime_last_two_weeks": 0, "last_played": 1499042846}, "language": "english", "review": "If you like murder mysteries you should love this game, I know I did, from beginning to end.\nA lot of the other reviews comment on a slow start as a negative point, however I found it to be the opposite, the game does take its time to introduced all its characters and lets you get to know them, their personalities and their relationships, this, in my opinion only enhances the game as once the actual murder mystery part begins its not just random NPCs, but characters youve been given a chance to know and like or even hate, so this much maligned \"slow start\" is, to me at least, fundamental in helping you connect with the characters and better immerse yourself in the events of the game.\nThe game also features a lot of humor, its full of AWESOME references, and maybe most importantly, it feels satisfying to play The investigation segments make sense and dont feel forced, and figuring the mystey as the clues fall into place felt very rewarding.\nOverall I would definitely recommend Shinrai to any fans of murder mysteries, even those who arent a fan of VN's, as even though I used to be really into them back in the day I havent really been able to get into them for the longest time, Shinrai, however, just drew me right in.", "timestamp_created": 1499045025, "timestamp_updated": 1499045025, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33051209": {"recommendationid": "33051209", "author": {"steamid": "76561198130212420", "num_games_owned": 195, "num_reviews": 19, "playtime_forever": 777, "playtime_last_two_weeks": 0, "last_played": 1485051241}, "language": "spanish", "review": "Siempre me han encantado las historias de detectives.\n\nUno de los sueños más tiernos y tempranos de mi infancia fue el poder convertirme de adulto en algún famoso detective borracho, cansado de la vida y ludópata. Resolviendo casos por todo el mundo y haciéndome pasar por un bonachón sin cerebro ante los involucrados solo para después sacar los colmillos cual serpiente antes de engullir lentamente a su presa.\nY a pesar de que hace ya tiempo renuncié a este sueño tan bonito (Sobretodo por que los tiempos han cambiado y ahora el trabajo de detective ha sido en gran parte sustituido por búsquedas de 5 minutos acerca de como hackear el facebook de tu pareja en Yahoo respuestas) he encontrado mi placebo en series, libros y sobretodo, novelas visuales.\n\nY tengo que decir que SHINRAI - Broken Beyond Despair se ha convertido en una de mis favoritas.\n\nPor supuesto no tiene ese aire clásico y serio que puede ofrecer un Tex Murphy ni tampoco llega a la irrealidad tan dinámica que puede ofrecerte un Danganronpa pero...\nDigamos que dentro de su propio estilo (que es más bien un término medio), lo hace bastante bien.\n\nShinrai trata sobre los sucesos ocurridos en una fiesta de adolescentes, pero no unos adolescentes completamente detestables e idiotas que van muriendo producto de su propia deficiencia mental como en una de esas baratas películas yankees a las que uno solo puede acceder producto del insomnio y un canal de televisión de dudosa calidad; Shinrai es creíble. Sus personajes son adolescentes y por supuesto actúan como tal producto de la liberación de hormonas, pero eso no quiere decir que sean un montón de soretes (...Salvo quizá uno de ellos, SÍ HIRO TE ESTOY MIRANDO A TI) y en cuanto su desarrollo Shinrai sabe muy bien cuando meter humor y cuando ponerse serio.\n\nEl misterio está bastante bien construído y llega a sorprender por lo original de su ejecución, dejándote con esa sensación de \"¡Pero claro!, ¿Cómo diablos no había pensado en eso antes?\".\nLa música es sencilla pero efectiva, bastante bien lograda.\nEl arte...Quizá  sea el punto más flaco, pero voy a hacer de abogado del diablo y decir que luce mejor en el juego que en las capturas de Steam y además la atención al detalle en los escenarios es sobresaliente.\n\nPero vamos a lo más importante:\n\nLa jugabilidad.\nEsta se divide en 3 fases, Exploración, Desición e Interrogación.\n\nLa Exploración es parecida a un Phoenix Wright, con la diferencia de que no tienes que mirarlo absolutamente todo para continuar en la historia, pudiéndote dejar en ocasiones alguna pista por el camino o información adicional sobre el entorno y sobre los protagonistas, esto es MUY importante ya que producto de una investigación pobre o una mala relación de conceptos puedes llegar a uno de los múltiples finales que ofrece el juego, culpando a alguien que era completamente inocente y dejando el misterio sin resolver. \nLos escenarios en los que exploras son relativamente pequeños, pero la navegación es práctica y divertida.\n\nLas Desiciones se presentan al jugador cada vez que ocurre algo relevante en la trama y estas pueden ser determinantes para la integridad de los personajes, nuevamente, tener un mayor conocimiento sobre estos y tus alrededores te permitirá actuar adecuadamente.\n\nLa Interrogación y presentación de pruebas se da casi al principio del juego y luego en el clímax, cuando se debe resolver el misterio, de lejos la parte que más me logró impresionar, pues en lugar de lanzarte un \"Game Over\" o quitarte corazones por haber llegado a una conclusión equívoca el juego te permite equivocarte de una manera realista, con sus respectivas consecuencias.\n\nEn definitiva, si estás buscando una novela visual que sacie tu dosis de misterio y que puedas pasarte en una tarde Shinrai es perfecta.\n\n\nPD: Lamentablemente a diferencia de otros juegos que he analizado, no puedo recomendar Shinrai si no posees un nivel medio alto de inglés, ya que algunos personajes emplean un habla bastante coloquial y se puede hacer incomprensible. Si aun así estás dispuesto/a a afrontar el reto necesitarás un poco de paciencia.\n\nPD2: Casi se me olvida hacer mención de Raiko, la gatita enfadada, quién es una de las protagonistas con quién más he simpatizado en mi vida, inteligente sin llegar a la exageración, sarcástica sin llegar a la antipatía y algo arisca, pero con un corazoncito que poco a poco se va abriendo dejando al descubierto su interior hecho 100% de puro chocolate.", "timestamp_created": 1498848995, "timestamp_updated": 1498948064, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.565217", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31687117": {"recommendationid": "31687117", "author": {"steamid": "76561198059007740", "num_games_owned": 163, "num_reviews": 34, "playtime_forever": 122, "playtime_last_two_weeks": 0, "last_played": 1494525578}, "language": "english", "review": "Well, I have to say... I enjoyed it!\n\n\n\nA bit of a slow beginning but once the action begins it's plenty of fun. Good music, some good characters (honestly, most of them are annoying. Even the MC is a bit annoying), but a good mystery. \n\nSomeone once claimed it was simliar to Higurashi/Umineko. It's really not. It obviously has similarities but it's very different. It IS similar to Danganronpa in a way (so if you liked this, definitely try that series out).\n\n\n\nBut talking about this alone: I liked it. A good 8 hours and you can beat it and you'll enjoy a good mystery. You can definitely solution without it being TOO-TOO obvious. I'd actually recommend getting the soundtrack bundle as the music is quite good.", "timestamp_created": 1494524197, "timestamp_updated": 1494524197, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31275680": {"recommendationid": "31275680", "author": {"steamid": "76561198019363416", "num_games_owned": 225, "num_reviews": 6, "playtime_forever": 686, "playtime_last_two_weeks": 0, "last_played": 1505001946}, "language": "english", "review": "So, you're reading a review; that's good, as it means you're giving this some consideration.\n\nAt this point in time, you're quite possibly thinking \"Well, the art looks [i]okay[/i], but I'm not sure if I want to spend my money on a VN that's just [i]okay[/i]\".\n\nWhich is a fair point.  I don't like wasting my money, either. So I'll say it here - this is well worth picking up.\n\nNo, the art's not the best ever seen in a VN - but it's perfectly serviceable; there are a lot of characters, and a lot of facial expressions, and you're never in any doubt as to which character you're looking at.\n\nAnd it does start out somewhat slowly (slice-of-lifey, I guess) - but then that gives you time to settle in and learn a bit about each character in turn, rather than having the fairly large cast (ten main characters) all thrown at you at once.  While some of the characters are, shall we say, a little *excessive* with aspects of their personality (hello, Kotoba!), they're all well characterised and individual; you won't find yourself struggling to remember which character is which.\n\nWhat it does deliver is a plot with plenty clues scattered through it, which add together towards a satisfying conclusion - things make sense and there're no bizarre leaps of logic required (no stupid puzzles where you wonder how the hell you were meant to work out the significance of a purple rubber duck or anything!). Though it's entirely possible (or even probable) that you'll finger the wrong culprit the first time through, when you do work out what happened and why, everything falls into place logically.\n\nAnd working everything out will unlock several bonus scenes, which add further depth and insight.\n\nIn conclusion - is it the best VN in the history of ever? No, it's not.  But it's a very enjoyable read, at a fair price. If you enjoy a good story where you can solve a mystery, you're missing out if you don't grab this.", "timestamp_created": 1492783289, "timestamp_updated": 1492783410, "voted_up": true, "votes_up": 32, "votes_funny": 0, "weighted_vote_score": "0.805841", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31123744": {"recommendationid": "31123744", "author": {"steamid": "76561197972468431", "num_games_owned": 115, "num_reviews": 1, "playtime_forever": 952, "playtime_last_two_weeks": 0, "last_played": 1497583222}, "language": "english", "review": "I have to recommend SHINRAI for one big, important reason: It's actually a good, fair mystery.  I have to admit that I got tricked by a red herring, but only because I'd underestimated the writing and failed to put things together correctly.  The core puzzle is very well constructed, and the plot around it is well paced.  The largest problem is that so much of the key MOTIVES are released in a big rush after you already solve the crime and aren't hinted well enough in advacnce, but it's not a terrible flaw.\n\nThe writing is largely good... the designers got pretty cutesy shoving movie and video game quotes into the dialogue, but the characters are well-drawn and likeable (especially good ol' Kamen).  I have to admit to not seeing much point to the parent characters, and cutting them would have helped speed up the slow beginning. \n\nThe game's mechanics are fine; the \"room search\" feature doesn't get much chance to be used, and it's a bit too easy to know what objects are important while searching (unlike in the dialogue and cut-scenes, where close eye for detail is required).  \n\nThe graphics are pretty pedestrian, but they certainly do their job: there's nothing more shocking than a violent mystery starring adorable anime characters.   The music is fine, but repetitive.\n\nIn sum, SHINRAI is a well-made mystery with charming characters; I definitely recommend it, and I look forward to a longer, more ambitious game the designers might be able to do next.\n", "timestamp_created": 1492116266, "timestamp_updated": 1492116266, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.630387", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31072336": {"recommendationid": "31072336", "author": {"steamid": "76561197988973368", "num_games_owned": 346, "num_reviews": 29, "playtime_forever": 609, "playtime_last_two_weeks": 0, "last_played": 1512480488}, "language": "english", "review": "Definitely worth it, but you may want to wait for it to go on sale.  The art style and slow start may put some off.", "timestamp_created": 1491885952, "timestamp_updated": 1491885952, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.434217", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30461426": {"recommendationid": "30461426", "author": {"steamid": "76561198170334858", "num_games_owned": 132, "num_reviews": 11, "playtime_forever": 425, "playtime_last_two_weeks": 0, "last_played": 1489289164}, "language": "english", "review": "My mind is blown.\n\n\"Don't judge a book by its cover\" is a old adage simply because it has been proven time and time again that if you just give something a chance, it you may discover something truly unique and surprising. \nSure, the beginning of this visual novel is somewhat lackluster and boring, but give the game an hour or so and you'll find yourself glued to the screen, eagerly clicking away to get to the next piece of text like you're flipping through a page-turner novel. It truly is a rollercoaster that doesn't stop once it gets going. You will be on the edge of your seat the entire playthrough as the game sucks you in with its suspense and atmosphere.\n\nThe characters are quite likeable. They talk like actual teenagers. They all have friendships. They all have distinct personalities. And seeing some of them suffer the fates that they did was quite disturbing - for me, at least - and this is only possible because the game impressively made me care about its entire cast in a short amount of time. \n\nAs for the murder mystery part of this \"murder mystery visual novel,\" it does not disappoint at all. The culprit is NOT who you think they are. While the investigation sequences are short and sparse, this is not a bad thing; they give you just enough clues and information to solve out the over-arching mystery, and I swear, it's REALLY complex. \n\nThe character sprites and backgrounds may look amateurish and off-putting at first, but it will definitely grow on you and more importantly, surprise you with its meticulous attention to detail, lighting, and facial expressions.\n\nTLDR:  great visual novel; very complex mystery; likeable characters; masterful suspense and atmosphere; nice art that will grow on you and even surprise you.", "timestamp_created": 1489288345, "timestamp_updated": 1489288345, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.508383", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29455693": {"recommendationid": "29455693", "author": {"steamid": "76561198118283887", "num_games_owned": 55, "num_reviews": 2, "playtime_forever": 385, "playtime_last_two_weeks": 0, "last_played": 1485233598}, "language": "english", "review": "When I saw SHINRAI I'll admit, I was a bit hesitant to try it out, but in the end I'm very glad I decided to take the chance on it. The game is an interactive visual novel mystery, similar to Phoenix Wright and Danganronpa; so if you like those games you will probably enjoy this one.\n\nThough, like everyone else has said the SHINRAI has very slow start. But if you push past that, it's an overall fun experience. The mystery was pretty well thought out, with solutions and twists I didn't see coming. At first, I wasn't into the characters, but by the end they all grew on me, as eventually they showed hidden depths. The motivation for the crime was something I didn't see coming, so overall I think the characterization was pretty decent. The characters pretty much stand out with their distinct personalities, so much so that I can recall everyone's name which is pretty important when you're dealing with a large cast of characters. The only thing I didn't really like was Nobara's speech dialect; it was overdone and at times distracting. I also wished they explained why Kamen kept saying how Raiko was back, as though they had known each other before. I wonder if that was a dropped idea as it didn't really go anywhere.\n\nAnd I know some people here were calling the art okay, but I really enjoyed it. It's certainly not as stunning as those numerous fancy VN's, but for me it adds to the experience of the game, making it unique in how it's not super glitzed up like other games... because you know those games that look pretty and have little content? I'd rather have decent or okay art with a strong story. It'd be great to have superb art and great story, but hey I'd say the art is neat and gets the job done. I mean, the characters have more than one pose. That's always a plus considering I've played games where it's the characters doing a signature pose haha.\n\nMy only real qualm I had with the game is how at times the writing seemed to be kinda of stiff. Sometimes I felt like the characters or narration was too explainy, explaining things too much instead of just showing it. I get that Raiko is supposed to be more mature and somewhat aloof, but I felt like it might be trying a bit too hard to give off that vibe. I mean, I used to be like that, but hell you could still tell that I was 15 lol. It might have been better to have the cast remind us that they were 14/15 a bit more often.\n\nOtherwise, playing SHINRAI was a fun experience, and I'm glad I decided to take a chance on the game! If you're into visual novels of the mystery variety with a sizable cast of characters I'd recommend it.  \n\n", "timestamp_created": 1485236098, "timestamp_updated": 1485236098, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.586466", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28663103": {"recommendationid": "28663103", "author": {"steamid": "76561197991254375", "num_games_owned": 135, "num_reviews": 9, "playtime_forever": 947, "playtime_last_two_weeks": 0, "last_played": 1482704652}, "language": "english", "review": "SHINRAI is exactly what it promises to be. A murder-mystery visual novel. However unlike a book where you basically watch over a detectives shoulder solving a crime/mystery, in this visual novel you are the detective. You can investigate, question people and draw your own conclusions out of the clues and evidence you gather. That said i would say the mystery is really well written and will keep you interested and (hopefully) surprised until the end. The characters are pretty well written too and have their reason for why they behave like they do.\n\nThe only thing i have mixed feelings about is the characters ages... i feel like they behaved way too mature for their age of 14/15, but hey, maybe that's just me and honestly i was rather glad, that the characters behaved that rational and mature than having some emotional breakdown or crying for their parents. But yeah overall i think it would've been better to let them age 3-4 years.\n", "timestamp_created": 1482740519, "timestamp_updated": 1482740519, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28461199": {"recommendationid": "28461199", "author": {"steamid": "76561198261213923", "num_games_owned": 197, "num_reviews": 10, "playtime_forever": 835, "playtime_last_two_weeks": 0, "last_played": 1482018013}, "language": "english", "review": "Do I recommend this game? hell yes I do! If you're a fan of VNs like Danganronpa I can't recommend this enough. The story and characters kept me very interested till the very end which i didn't see coming at all. took me about 11 hours to beat and i'm currently on my 2nd playthrough to get the achievements I missed. SHINRAI is definitely worth your time and money and I'm really hoping there will be a sequel or more from these devs in the near future :) 10/10", "timestamp_created": 1482121476, "timestamp_updated": 1482121476, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.507288", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28194298": {"recommendationid": "28194298", "author": {"steamid": "76561198151952001", "num_games_owned": 139, "num_reviews": 5, "playtime_forever": 1205, "playtime_last_two_weeks": 0, "last_played": 1480896988}, "language": "english", "review": "What I can say ? This Game is a little gem even if not particurarly difficult to finish (reveal the mystery) and definitely deserve a place in every fan of visual novels collection but for the guys who aren't used to this kind of gameplay it could be difficult to appreciate. However this game remain in his genre a well executed piece of art: dialogue is really well written and Characters are really charming and funny so the story will never drag too long or be boring, this project show from the Art to the Trivia of the Notebook all the love of his creators (with many references to Japanese Folklore, popular anime shows and games. A personal touch of the creators I really enjoyed to read) and as a first indie project give us a tease on what Gosatsu Visual Novels team is capable of with full potential of giving us more interesting stories. So keep an eye out for this guys.They have all my support and I really hope to see more of Raiko and her friends in the future ^.^. Personal Vote: 10/10", "timestamp_created": 1480891619, "timestamp_updated": 1481911703, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500208", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25966346": {"recommendationid": "25966346", "author": {"steamid": "76561198103742775", "num_games_owned": 105, "num_reviews": 1, "playtime_forever": 561, "playtime_last_two_weeks": 0, "last_played": 1476105741}, "language": "english", "review": "As a big fan of Danganronpa(Another murder mystery VN), I decided to try this out. As the others have said, it starts out rather slow, but picks up  the pace. The art wasn't the best but I thought it was good enough especially for the price. The characters were interesting, and none of them felt fabricated. \n\nI felt that the mystery was unique, I thought I figured out who the mastermind was but it wasn't the case. It didn't really follow like other detective stories, at least the ones that I experienced. The ending was rather good, I was a bit worried how it would of ended but it all pieced together smoothly.\n\nThe only Cons that I felt were in this game were that the devs tried really hard to confuse you. Of course that's the whole intention but some of the options that you had to choose were rather forced. Some of them had no logic or reasoning to it, and the only purpose being there was to make you mess up. But all in all, its all good because I became best friends with the save button.\n\nFor the price I say its worth it, even at 15$ the art, music, characters, and plot were all good. It might seem short, but figuring the mystery out made it worth it in the end. I recommend it to people interested in mystery, and even those who experienced many mystery books/games.\n\nMy advice for people that are going to play this is, don't forget to save. I ended up saving into a bad end and had to start all over in chapter one. Thankfully the skip feature made me quickly catch back up to the story. Also you get graded on how well of an investigator you are at the end. For those that want a high grade, save save save!!!", "timestamp_created": 1476108998, "timestamp_updated": 1476109907, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.505504", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25895386": {"recommendationid": "25895386", "author": {"steamid": "76561198268269971", "num_games_owned": 87, "num_reviews": 3, "playtime_forever": 2433, "playtime_last_two_weeks": 0, "last_played": 1475821229}, "language": "english", "review": "I'll get this out of the way now: This has a slow, slow start. But it was so utterly worth it! As high school mysteries go, this is a fantastic one, putting you in the role of the aloof intellectual chasing down evidence. It doesn't go easy on you.\n\nThe art's gorgeous, the characters are fun, and the resolutions are sharp. Bad endings feel like organic letdowns, just like they should -- so you know you got it wrong.\n\nIt's fun rolling through a few times to catch all the differences, but the story does not have major event deviations (i.e., you can control what happens in certain circumstances, but you can't change the course of the story overall).\n\nNobara's speech patterns were a little off, but it wasn't too distracting for me after things started to get rolling plotwise. But again -- slow start, be aware of that.\n\nI'm looking forward to more from this developer, and I'm hoping it'll feature more of Raiko and (hopefully) more of Raiko + Kamen! XD\n\n8/10 on a 10 point scale", "timestamp_created": 1475807146, "timestamp_updated": 1475807146, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.502075", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25853519": {"recommendationid": "25853519", "author": {"steamid": "76561198125719175", "num_games_owned": 45, "num_reviews": 38, "playtime_forever": 548, "playtime_last_two_weeks": 0, "last_played": 1475319383}, "language": "brazilian", "review": "This is an awesome game to play. The developers did a very good job and you can ser the effort in every single aspect of the game.\n\nI really recommend it if you are a fan of the gente, specially because the game has multiple endings.", "timestamp_created": 1475585650, "timestamp_updated": 1475585650, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25784466": {"recommendationid": "25784466", "author": {"steamid": "76561198211268465", "num_games_owned": 185, "num_reviews": 6, "playtime_forever": 2002, "playtime_last_two_weeks": 0, "last_played": 1475206885}, "language": "spanish", "review": "if you played DANGANRONPA, or simply enjoy mystery, visuaal novel games, then this one is definitly for you!!", "timestamp_created": 1475254185, "timestamp_updated": 1475254185, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25315194": {"recommendationid": "25315194", "author": {"steamid": "76561198259367794", "num_games_owned": 15, "num_reviews": 1, "playtime_forever": 1716, "playtime_last_two_weeks": 0, "last_played": 1474340818}, "language": "english", "review": "I like the game and it is fun to play\n\nLucky, I got this on sale. Because $15 might be to high for this game for some gamers", "timestamp_created": 1472861979, "timestamp_updated": 1472861979, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.486111", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25297607": {"recommendationid": "25297607", "author": {"steamid": "76561198055006994", "num_games_owned": 618, "num_reviews": 59, "playtime_forever": 794, "playtime_last_two_weeks": 0, "last_played": 1472783765}, "language": "english", "review": "Murder Mystery Visual Novel with interactive parts, I dont know about you but that sounds awesome to me.\n\nAs a big fan of other similar games I find this VN to be quite good, full of fun anime/games references and presenting an interesting but short mystery. If anything that I've said sounds like your jam then yes, this is your jam.", "timestamp_created": 1472784352, "timestamp_updated": 1472928272, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.536424", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25279831": {"recommendationid": "25279831", "author": {"steamid": "76561198120348301", "num_games_owned": 873, "num_reviews": 389, "playtime_forever": 742, "playtime_last_two_weeks": 0, "last_played": 1472703105}, "language": "english", "review": "I just finished this game, and wow, it was really good! I liked the beginning since it was setting the mood for the upcoming events; presenting the characters, their ups and downs, etc. I could feel a better connection between them because of that, and my favorite character is Kotoba. Which is funny because I actually met a person in real life that talks just like him (he mixes various foreign words during his speech). Like, it’s so similar that I couldn’t believe my eyes at first, and I couldn’t stop laughing, haha.\n\nAlso, the small references to other games made me smile (especially the Castlevania reference). They were all so fitting to the dialogue, it was pretty nice. The art style might not be professional, but it surely gave life to the characters and its story. At first it might seem a simple mystery/detective VN, but there’s a special shine on this one. The investigation scenes were enjoyable, and the soundtrack is also really good.\n\n9/10. All your choices matter to reach certain endings, and most of characters are likable! [spoiler]Except Hiro lol[/spoiler]", "timestamp_created": 1472703016, "timestamp_updated": 1472703016, "voted_up": true, "votes_up": 16, "votes_funny": 2, "weighted_vote_score": "0.690988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25270120": {"recommendationid": "25270120", "author": {"steamid": "76561198174419926", "num_games_owned": 235, "num_reviews": 1, "playtime_forever": 319, "playtime_last_two_weeks": 0, "last_played": 1472648040}, "language": "english", "review": "Like other reviews have mentioned, the beginning of SHINRAI is rather slow. It starts with a lot of slapstick comedy and silly references, which can be a bit... obnoxious, maybe – but Raiko (our main character) is rather deadpan, so offers a good contrast to some of the more ridiculous moments.\n\nThough the main cast are all based around tropes – Runa is the well-spoken, polite young lady; Rie is the loud genki girl; Kotoba is a huge pervert; Mika is probably insane – they get some more meat to them as the game goes on. In fact, discovering the backstories behind these characters is one of the most important aspects of the game, because it is a murder mystery – and, with a murder mystery, you need potential culprits who have reasons for committing such crimes.\n\nActually, the fact I remember all these character names off the top of my head should show the writer did a pretty good job of making their rather large cast (ten main players!) distinctive and memorable.\n\nBeing able to examine rooms for evidence was fun, and I enjoying questioning the characters to pick up additional bits of information. I think maybe the ‘examine’ function was too easy, because the game wouldn’t let you leave a room until you’d found enough evidence to actually solve the case – but this is probably a good thing, as it prevents dead-ending yourself in the final chapter.\n\nAs for the art, though it initially put me off, it really grew on me. Characters have a lot of poses and multiple outfits, they’re very expressive, and some of the designs are pretty cute (Kamen’s witch costume is super adorable… Everything about Kamen is super adorable…!) There’s also a large variety of backgrounds, and the backgrounds used for the investigation scenes are very detailed, filled with lots and lots of objects to click on for Raiko to comment about. The character sprites and backgrounds go together well, the GUI looks very clean and polished.\n\nOverall, I’d really recommend SHINRAI. It’s a very nicely crafted murder mystery story with enough twists and turns to keep you entertained, but the conclusion makes sense and it’s satisfying to reach. Though the art might be a bit jarring at first, and some of the more ridiculous characterisation, it all grew on me.\n\nReally, it’s good. Go buy it. You won’t be disappointed.", "timestamp_created": 1472656375, "timestamp_updated": 1472656375, "voted_up": true, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.735664", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25253952": {"recommendationid": "25253952", "author": {"steamid": "76561198050428423", "num_games_owned": 135, "num_reviews": 20, "playtime_forever": 490, "playtime_last_two_weeks": 0, "last_played": 1472501734}, "language": "english", "review": "Great game! 9/10\n\nTL;DR: This is a really good visual novel, it has a good story, characters you'll grow to like and hate and it's lengthy enough. \n\n\nThe story starts off slow as one of the previous reviewers stated, so much so that I did consider getting a refund, however I'm glad I didn't, the writing is good and the story is interesting. The humour at the beginning seems a bit forced but later on I found myself laughing at the jokes and funny statements. It's worth a buy, you're guaranteed at least 8 hours of fun which for the original price,  I got it during a sale, it's worth it.\n\nThe music is good, but repetitive and sometimes goes silent during scenese which is good in a way so it doesn't get annoying. However there is an annoying screah from a bat as part of the dialog box, that happens everytime a character shouts or during a jump, not a jumpscare. This is the only really annoying thing I found from the game.\n\nAll in all, I'd recommend it to murder mystery fans and visual novel players alike.\nHave fun!", "timestamp_created": 1472580347, "timestamp_updated": 1472580347, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.473746", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25190084": {"recommendationid": "25190084", "author": {"steamid": "76561198301216883", "num_games_owned": 24, "num_reviews": 1, "playtime_forever": 508, "playtime_last_two_weeks": 0, "last_played": 1472327791}, "language": "english", "review": "Although SHINRAI starts somewhat slow, once the game picks up, it's an addicting and enjoyable experience. I would definitely recommend it for murder mystery lovers. \n\nTo be frank, when I first started playing, I had the urge to drop the game. The attempts at humor in the opening didn't appeal to me. Nobara's entire speech pattern felt very forced (this was a constant, though). The introduction to the characters had many moments of telling without showing. But I told myself I would continue at least until the first death. \n\nI'm so glad I kept playing. Once the story picked up, I couldn't put it down.\n\nDespite the weak introduction to the characters, I ended up liking almost everyone. Everyone's motivations and backstories are thought out very well. They're distinct enough from each other to stand out both visually and personality-wise. Everyone remains in-character throughout while still maintaining a solid murder mystery. \n\nThe mystery itself is really great and complex. The solution isn't obvious at all, and there are a lot of red herrings placed along the way. I really appreciated all of the details that came together, and finding the true culprit felt very satisfying. \n\nI also really loved the investigation sequences. They felt very reminiscent of Phoenix Wright, and there were a lot of amusing interactions from them. If anything, I just wished there were more of these.\n\nOverall, I really recommend giving this game a chance. Just prepare yourself for the weak opening and keep an open mind. \n\n\n\n", "timestamp_created": 1472329732, "timestamp_updated": 1472329732, "voted_up": true, "votes_up": 33, "votes_funny": 0, "weighted_vote_score": "0.743900", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 7, "review_score_desc": "Positive", "total_positive": 36, "total_negative": 0, "total_reviews": 36}}
