{"query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 537, "total_negative": 33, "total_reviews": 570}, "reviews": {"38290890": {"recommendationid": "38290890", "author": {"steamid": "76561198042019309", "num_games_owned": 261, "num_reviews": 8, "playtime_forever": 971, "playtime_last_two_weeks": 851, "last_played": 1513780738}, "language": "english", "review": "If you've ever wondered what being a marine from starcraft 1 was like I guess this is the closest you're going to get.", "timestamp_created": 1513209884, "timestamp_updated": 1513209884, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.581749", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38201875": {"recommendationid": "38201875", "author": {"steamid": "76561197967081751", "num_games_owned": 1092, "num_reviews": 18, "playtime_forever": 223, "playtime_last_two_weeks": 0, "last_played": 1512970086}, "language": "english", "review": "TL;DR:  Strongly recommended! An intense and scary single/multiplayer horror/sci-fi FPS, with procedural levels. What people thought the Space Hulk/Colonial Marines games were going to be. Almost impossible singleplayer, but good with a group. Make sure you have at least one friend before buying.\n\n\nTHE LONG VERSION\n\nA deceptively slow-paced and extremely tense game that places you as a space marine in huge, powered armor and puts you on randomly generated ships to download cores for... some reason, or rescue very fragile civilians.\n\nThat may sound standard or identical to other Space Hulk-esque games, but I assure you the execution is unmatched by anything else.\n\nYou see, your suit has limited ammo, vision, and power, but you don't notice that before the game starts cranking the stress-o-meter to 15 out of 10. When your enemies actually bother to show up, it's horribly disorienting (in a good, atmospheric way), and is pretty much guaranteed to make you dookie a shooter straight out through your pants and chair. \n\nNote that \"disorienting\" does not mean \"incomprehensible\". You have a motion sensor, a flashlight, and even a rangefinder counting down the meters before your face eaten off - You'll always know what killed you, it's just a lot faster than you might be used to.\n\nAlso worth noting is that you are very vulnerable in this game. It is not a power fantasy, and a great example of how having weapons and the ability to defend yourself does not necessarily remove the horror element from a horror game. You don't move that fast and have limited room to maneuver. Friendly fire is always on and it doesn't take many rounds to kill a teammate. When guns fire, their muzzle flash can be blinding and disorienting, turning dark hallways into panicked strobe-lit dancefloors of death. In case you weren't stressed out enough, your character's heart rate increases as the enemies close in, represented by the screen pulsating in time with the heart rate. This game is not for epileptics. At all. The menu says it best: \"This game will melt your face off\".\n\nOn top of all that, your enemies - the titular \"Space beasts\" - are very fast and instantly lethal in melee range. They're as deadly as their name is stupid: instant death in melee, able to smash doors, they come out of the goddamned walls, they turn off the power as much as possible, and they do it all at blinding speed. Even with turrets, a full load of ammo, and experienced team members, you are in a race against time to do your job before they overwhelm and kill you.\n\nOn top of THAT, there's an equally stupidly named enemy type called the \"Astro-Creep\". they both scare the shit out of you by face hugging your helmet and obscuring your vision, and also help result in about 3000% more friendly fire incidents by setting off automated turrets, smartguns, and motion sensors that don't realize they're actually very small wall-crawlers. \n\nAll you need to do to get out of this hellhole is accomplish your objectives as quickly as possible and get back to the shuttle. Seemingly impossible at first, but if you use turrets, make good use of locked doors and laser walls, and get a good teammate or two, you have a chance. You also get random upgrades like aim assist or infravision when you accomplish objectives like downloading cores. The upgrades really stack up over time, so doing the job quickly is very helpful. Sentry turrets can be activated to help you out. Naturally, they will shoot and kill you if you stupidly block their line of fire between you and an alien. There are also ammo and repair bays scattered randomly on the map. Tough, but fair.\n\nNote that while you can play by yourself, you will almost certainly fail all but the smallest ships. You really need at least one other person to play with you to have a realistic chance to succeed. Strongly recommended, nevertheless.", "timestamp_created": 1512888206, "timestamp_updated": 1512888206, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.539474", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37996360": {"recommendationid": "37996360", "author": {"steamid": "76561198014350816", "num_games_owned": 360, "num_reviews": 14, "playtime_forever": 24, "playtime_last_two_weeks": 0, "last_played": 1512200648}, "language": "english", "review": "I know its early access, i get that, the problem is its not even good for early access. Graphics are terrible, gameplay is so bare bones i could play it on my phone. Muzzle flash is blinding at least they warn you of it. There is no tutorial of any kind. Nothing to help you navigate menus or even teach you how to play or what to look out for. At least Dark Souls gave you control information! This game doesn't! Do not waste your money on a 15.00 game that should barely be worth .50 cents!", "timestamp_created": 1512201014, "timestamp_updated": 1512201014, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.356102", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36318838": {"recommendationid": "36318838", "author": {"steamid": "76561198170979685", "num_games_owned": 361, "num_reviews": 2, "playtime_forever": 1152, "playtime_last_two_weeks": 0, "last_played": 1509997506}, "language": "russian", "review": "Хотите поиграть в хорошую игру по чужому - alien isolation к вашим услугам. Если же вам больше нравятся чужие  -  однозначно sbtf. В сторону colonial marines даже не смотрите. Она не раскрывает тему колониальной морской пехоты от слова совсем. Другое дело sbtf, правда это не совсем чистые чужие, с легкой примесью space hulk, но по духу все равно ближе к чужим. Толпы противников, медленно, но верно заканчивающиеся патроны, страх быть сожраным заживо на пустом и темном корабле где-то далеко в космосе, где ваш предсмертный крик никто не услышит (особенно если играете в одиночку). Все это sbtf вам обеспечит с достатком. Что касаемо генерации уровней, она очень даже хороша, правда довольно часто можно встретить очень похожие, а то и абсолютно одинаковые фрагменты карты. Так же игра может подкинуть вам довольно неожиданные сюрпризы, в роде терминала (которые надо взламывать, и при том обязательно все) между двух проломов, из которых спавнятся твари. Отдеьная история - это биомасса, или же заражение, как вам угодно. Эта дрянь не причинит никакого вреда, но она запросто скроет от ваших глаз то, что может вам очень даже пригодиться, например панель управления дверью, а то и цеый терминал или раздатчик патронов. К слову, поскольку игра является по сути своей рогаликом, в ней присутствует перманентная смерть, при которой игрок теряет весь прогресс. И вот представьте себе ситуацию: вы уже не плохо так прокачаны, отступаете по коридору, попутно отстреливаясь, и внезапно натыкаетесь спиной на дверь, а стены вокруг вас покрыты заражением, и что бы вы подумали? Поварачиваетесь к тому месту, где находится панель управления, а там сплошная биомасса, и вы начинаете хаотично тыкать в нее, надеясь открыть дверь (а по скольку персонажам здесь присущ страх, то экран ваш в этот момент дергается как эпилептик в припадке), но не успеваете, со спины подкрадывается ксенос и ваншотит вас (смерть здесь в любом случае с одного удара). Качайтесь заново. И такое вполне может случиться даже при ручной генерации уровня, а если выставлена полностью случайная, то каждая секунда может превратиться в ад. В общем, понесло меня, пора бы и закругляться. Игра хороша, хоть и находится в раннем доступе. Но в том, что она из него выберется, можно быть полностью уверенным. Автор хоть и редко, но выпускает обновления, которые очень сильно улучшают игру. Не побоюсь этих слов - лучший симулятор колониального морпеха. Всем однозначно рекомендую, а фанатам чужих так вообще маст хэв. С нетерпением жду релиза.", "timestamp_created": 1509964502, "timestamp_updated": 1509964502, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.557459", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38602047": {"recommendationid": "38602047", "author": {"steamid": "76561198024660768", "num_games_owned": 478, "num_reviews": 2, "playtime_forever": 16, "playtime_last_two_weeks": 16, "last_played": 1514077896}, "language": "english", "review": "Exited pod, found copy machine, felt everything would turn out OK.  Found Alien horrors.  Everything did not turn out ok.", "timestamp_created": 1514078036, "timestamp_updated": 1514078069, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35365332": {"recommendationid": "35365332", "author": {"steamid": "76561197977357413", "num_games_owned": 489, "num_reviews": 7, "playtime_forever": 1014, "playtime_last_two_weeks": 0, "last_played": 1508484710}, "language": "english", "review": "This game does co-op/horror/roguelike right. I sincerally hope the developer continues to update this hidden gem.\n\nP.S. The online play is fairly stable, but starting games can get a little wonky (usually taking a few seconds to remake the lobby fixes it)", "timestamp_created": 1506838033, "timestamp_updated": 1506838033, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39141795": {"recommendationid": "39141795", "author": {"steamid": "76561198044336427", "num_games_owned": 44, "num_reviews": 5, "playtime_forever": 238, "playtime_last_two_weeks": 238, "last_played": 1515468526}, "language": "english", "review": "BEST GAME EVER! the fun part is getting jumped scared", "timestamp_created": 1515304223, "timestamp_updated": 1515304223, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39138853": {"recommendationid": "39138853", "author": {"steamid": "76561198026338154", "num_games_owned": 117, "num_reviews": 2, "playtime_forever": 952, "playtime_last_two_weeks": 794, "last_played": 1515983725}, "language": "english", "review": "Amazing game, get four friends together and progress through, when the power dies get ready to watch in horror as all of your friends die one by one until you are the lone survivor, Running out of ammo as the horde closes in on your position.\n\n10/10 will shit myself again...", "timestamp_created": 1515294478, "timestamp_updated": 1515294478, "voted_up": true, "votes_up": 0, "votes_funny": 2, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39021099": {"recommendationid": "39021099", "author": {"steamid": "76561198070031508", "num_games_owned": 84, "num_reviews": 1, "playtime_forever": 662, "playtime_last_two_weeks": 0, "last_played": 1514789269}, "language": "english", "review": "Great game. My freinds and I have had more fun with SBTF than most AAA games released in recent memory. Highly reccomended. I hope the devs continue to add more objectives, missions, and weapons so we can keep coming back!", "timestamp_created": 1515005357, "timestamp_updated": 1515005357, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "38917271": {"recommendationid": "38917271", "author": {"steamid": "76561197987418739", "num_games_owned": 521, "num_reviews": 44, "playtime_forever": 514, "playtime_last_two_weeks": 0, "last_played": 1513577182}, "language": "english", "review": "Now us non-actors can be in an \"Aliens\" movie.", "timestamp_created": 1514760654, "timestamp_updated": 1514760654, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38886333": {"recommendationid": "38886333", "author": {"steamid": "76561197969379252", "num_games_owned": 203, "num_reviews": 2, "playtime_forever": 1282, "playtime_last_two_weeks": 227, "last_played": 1516067876}, "language": "english", "review": "OMG.  Best game ever.\n\nIts essentially a co-op, FPS, Roguelike, perma death game that blends Aliens  movies with Games Workshops Space Hulk game.  If you like any of the above, get the game now!\n\nOne caveat:  The game is WAY more enjoyable if you have buddies to play with.  This really shines as a co-op.  Who's covering the breach, who is getting the turret, who is cover this hall etc...if you like having those kind of conversations then this game is for you.  If you are a loner puke bucket head, that doesn't enjoy other people then you may want to pass.", "timestamp_created": 1514690029, "timestamp_updated": 1514690029, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38875893": {"recommendationid": "38875893", "author": {"steamid": "76561198089899211", "num_games_owned": 55, "num_reviews": 3, "playtime_forever": 207, "playtime_last_two_weeks": 77, "last_played": 1516128401}, "language": "english", "review": "Jeeez! That was intense...", "timestamp_created": 1514667398, "timestamp_updated": 1514668243, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38839051": {"recommendationid": "38839051", "author": {"steamid": "76561198238905870", "num_games_owned": 64, "num_reviews": 3, "playtime_forever": 106, "playtime_last_two_weeks": 0, "last_played": 1514148770}, "language": "german", "review": "Richtig nice auf ner LAN-Party und was nices für leute die diese retro grafik mögen.", "timestamp_created": 1514591244, "timestamp_updated": 1514591244, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38689254": {"recommendationid": "38689254", "author": {"steamid": "76561198039037011", "num_games_owned": 350, "num_reviews": 137, "playtime_forever": 61, "playtime_last_two_weeks": 0, "last_played": 1514353654}, "language": "english", "review": "This is the Aliens Colonial Marines game i wanted. Even though its a bit lacking content it is well worth the price.", "timestamp_created": 1514278404, "timestamp_updated": 1514278404, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.543568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38681161": {"recommendationid": "38681161", "author": {"steamid": "76561197961680226", "num_games_owned": 155, "num_reviews": 15, "playtime_forever": 284, "playtime_last_two_weeks": 0, "last_played": 1514432552}, "language": "english", "review": "Super fun action time deluxe\n\nI enjoy muchly", "timestamp_created": 1514256347, "timestamp_updated": 1514256347, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "38661991": {"recommendationid": "38661991", "author": {"steamid": "76561198062040803", "num_games_owned": 77, "num_reviews": 18, "playtime_forever": 80, "playtime_last_two_weeks": 0, "last_played": 1514216290}, "language": "english", "review": "pretty fun", "timestamp_created": 1514215851, "timestamp_updated": 1514215851, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "38602061": {"recommendationid": "38602061", "author": {"steamid": "76561198067028859", "num_games_owned": 1427, "num_reviews": 32, "playtime_forever": 58, "playtime_last_two_weeks": 41, "last_played": 1515119566}, "language": "english", "review": "Pissed myself on the first playthough. Second playthrough resulted in me shitting my pants. Third playthrough cut short by cat scaring the rest of my bodily fluids out of me due to heightened tension.", "timestamp_created": 1514078086, "timestamp_updated": 1514078086, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38555653": {"recommendationid": "38555653", "author": {"steamid": "76561198089522478", "num_games_owned": 42, "num_reviews": 3, "playtime_forever": 2352, "playtime_last_two_weeks": 0, "last_played": 1514598345}, "language": "english", "review": "Great game, very well done and a ton of fun with your friends!", "timestamp_created": 1513989895, "timestamp_updated": 1513989895, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38551708": {"recommendationid": "38551708", "author": {"steamid": "76561198048970217", "num_games_owned": 371, "num_reviews": 32, "playtime_forever": 146, "playtime_last_two_weeks": 57, "last_played": 1515866159}, "language": "english", "review": "This game definitly needs a lot of work honestly. Like. A lot! key mapping. Controls. Flashlights on and off because you're forced to USE battery power. You can't properly save your friends that are tagged by any aliens. Because the multiplayer models are just one or two animations. Resulting you in shooting your friends that are being pounched  due to their character model. And it excists since 2015! How are these things not fixed yet.\n\nApart from all the frustrating animations and the way you control your suit.\nThe game is fun. Its just really hard with the systematics that are now still in the game.\nBe ready to shoot your friends a lot when they need you. And find an power source 24/7.", "timestamp_created": 1513980305, "timestamp_updated": 1513980305, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38503352": {"recommendationid": "38503352", "author": {"steamid": "76561198025814812", "num_games_owned": 331, "num_reviews": 8, "playtime_forever": 6, "playtime_last_two_weeks": 0, "last_played": 1513888676}, "language": "english", "review": "scary af", "timestamp_created": 1513889005, "timestamp_updated": 1513889029, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38409692": {"recommendationid": "38409692", "author": {"steamid": "76561198145740816", "num_games_owned": 180, "num_reviews": 3, "playtime_forever": 96, "playtime_last_two_weeks": 0, "last_played": 1513638554}, "language": "english", "review": "FIrst mission: Goes well\nSecond mission: 40 objectives with shit tons of enemies flooding one corridor and procceded to shoot my ally to death\nThird mission: Touches breaker box. Gets drop kicked by alien spawned above me", "timestamp_created": 1513638774, "timestamp_updated": 1513638774, "voted_up": false, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.434783", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38409680": {"recommendationid": "38409680", "author": {"steamid": "76561198001337396", "num_games_owned": 180, "num_reviews": 2, "playtime_forever": 49, "playtime_last_two_weeks": 0, "last_played": 1513638556}, "language": "english", "review": ">Power turns off.\n>Go to breaker to turn the power back on.\n>After activating the breaker a mob spawns on me and proceeds to inst-kill me before I can physically react.\n\n10/10 would insta-die again.", "timestamp_created": 1513638720, "timestamp_updated": 1513639021, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "38402747": {"recommendationid": "38402747", "author": {"steamid": "76561198004692894", "num_games_owned": 94, "num_reviews": 2, "playtime_forever": 1209, "playtime_last_two_weeks": 0, "last_played": 1514678407}, "language": "english", "review": "This is a great game to play with friends. You will die a lot, but the games are quick and it's fun to watch each other, so no worries. You will need to play with the map settings and play on easy to start with to stand a chance. It's not very scary, though it can make you jump.", "timestamp_created": 1513615561, "timestamp_updated": 1513615561, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "38357354": {"recommendationid": "38357354", "author": {"steamid": "76561198337750743", "num_games_owned": 8, "num_reviews": 4, "playtime_forever": 10, "playtime_last_two_weeks": 0, "last_played": 1513449395}, "language": "spanish", "review": "Recomiendo el juego, tiene una buena difiultad con graficas respetables, la desesperación y el terror estan bien implementadas, pero para ser sincero con todo lo que tiene para ofrecer realmente no vale lo que cuesta. Si su precio fuera la mitad o menos de lo que cuesta con gusto lo compraria, y conservaria, pero repito si es recomendable solo por su precio no lo vale.", "timestamp_created": 1513449922, "timestamp_updated": 1513449922, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39382947": {"recommendationid": "39382947", "author": {"steamid": "76561198008104259", "num_games_owned": 152, "num_reviews": 3, "playtime_forever": 456, "playtime_last_two_weeks": 271, "last_played": 1516075714}, "language": "english", "review": "A [b]Solid[/b] 9 out of 10\nFor being in early access, among the sea of hodge podge forgettable, garbage that has come out recently, S.B.T.F stands above the rest. At least, in my humble opinion.\n\nThe game isn't hard to grasp, and the controls and optimization are solid.\nThe game modes are well thought out too, and there is no illusion of depth that tries to bring players in, for something this game is not.\n\nIt is a straight up a corridors/ dungeon/ arcade shooter, and it does so remarkably well.\nAddictive and Fun, I believe most of my play sessions are basically an endless stream of:\n\"! more, let's do 1 more! [i]Proceeds to Die[/i]\"\n\nI am looking forward to what this game ends up bringing towards it's full release, but i stand by my review giving it a solid [i]Thumbs HELL! UP![/i]", "timestamp_created": 1516082670, "timestamp_updated": 1516082670, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.540636", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "39381552": {"recommendationid": "39381552", "author": {"steamid": "76561198008062073", "num_games_owned": 169, "num_reviews": 6, "playtime_forever": 624, "playtime_last_two_weeks": 133, "last_played": 1516075713}, "language": "english", "review": ">Space Beast Hoarde\nEverything is fine\n\n>Accidental Stray shots\nEverything. Is. Fine.\n\n>Losing HUD\nEverything. Is. FINE!\n\n>Power goes out\nWHERE THE F*CK IS THAT BREAKER I SWEAR TO-\n*Death by space beast*\n\n\nIf Space Hulk was a more frantic, sfressful, and sp00ky FPS than Deathwing, it would be Space Beast Terror Fright", "timestamp_created": 1516076644, "timestamp_updated": 1516076644, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39471470": {"recommendationid": "39471470", "author": {"steamid": "76561198019865647", "num_games_owned": 101, "num_reviews": 2, "playtime_forever": 293, "playtime_last_two_weeks": 293, "last_played": 1516506840}, "language": "english", "review": "Fun game for coop experiences.", "timestamp_created": 1516410724, "timestamp_updated": 1516410724, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "39508805": {"recommendationid": "39508805", "author": {"steamid": "76561198010179124", "num_games_owned": 111, "num_reviews": 5, "playtime_forever": 451, "playtime_last_two_weeks": 388, "last_played": 1516532638}, "language": "japanese", "review": "一般兵装のスペースマリーンとなって、洋画エイリアンシリーズの雰囲気バリバリな暗闇の中、タレットやバリアーの存在を頼りにリアクターコア再起動を目指し帰還する…と言う流れをクリアするハードコアなFPSです。\n\nまずエイリアンシリーズの雰囲気を強く意識した演出の諸々や、突然のブレーカーシャットダウンやら過剰な硝煙や酷いマズルフラッシュでの視界不良やら、既存のコンテンツを意識して作り上げられる雰囲気の悉くが「プレイヤーを不利にする」だけの方向に傾けられていて、緊迫した状態になってきた！スゲー興奮する！っていう状態がほぼ＝詰みに繋がっていて残念でしかありません。\nまた、ランダムマップ構造のステージと言う仕様上仕方のない事とは言え、マップの引き次第でクリア出来るか否かがほぼ決まってしまう位に敵の猛攻が酷いのも良くありません。進行方向から侵攻してくる敵の数が敵出現ポイント二か所分以上になると、ソロではもうほぼ突破不可能です。迂回路でもあれば何とかなりますが、それでも一か所へ侵攻してくる敵の数が変わらない以上、ジリ貧の状態になる事に変わりありません。\n加えて、何の根拠でそうなってるのか判りませんが、心強い味方となる筈のタレットが高確率でほぼ垂直に跳弾する弾をばら撒く為、これに当たってマリーンの装備にダメージが入ると言うあんまりな仕様が嫌がらせとして存在します。弾頭にスーパーボールでも使っているんでしょうかね…？それとも私の知らないSFホラーでタレットの垂直跳弾による殉職が描かれた作品でもあったんでしょうか？\n\n一方、ゲーム中に流れるBGMは雰囲気作りに一役買ってくれている良曲揃いで、敵との接見状態でどんどん緊迫していくよう曲調が変わって行くのも好感が持てます。絶望的な状況をこれでもかと盛り上げてくれる分、これを聞く状態を回避するよう動かなければならないと言うのはもどかしい限りです。", "timestamp_created": 1516536349, "timestamp_updated": 1516536349, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39577838": {"recommendationid": "39577838", "author": {"steamid": "76561198004293015", "num_games_owned": 304, "num_reviews": 40, "playtime_forever": 556, "playtime_last_two_weeks": 3, "last_played": 1516874247}, "language": "english", "review": "Great little game.", "timestamp_created": 1516789221, "timestamp_updated": 1516789221, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "39537404": {"recommendationid": "39537404", "author": {"steamid": "76561197965034307", "num_games_owned": 128, "num_reviews": 5, "playtime_forever": 1320, "playtime_last_two_weeks": 219, "last_played": 1516733838}, "language": "english", "review": "fun game especially when playing with others but i think development has stopped. which is a great shame as i think there was a lot more they could have done with it. that said there is enough of a game here for it to be worth the price (£10.99) more so if you have friends to play it with. no in game voice chat tho which can be a problem if you dont have some thing like discord.\nanyone who was a fan of space hulk on the playstation will get a good nostalgia hit from this as well.", "timestamp_created": 1516636190, "timestamp_updated": 1516636190, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39521223": {"recommendationid": "39521223", "author": {"steamid": "76561198035311613", "num_games_owned": 121, "num_reviews": 37, "playtime_forever": 2137, "playtime_last_two_weeks": 932, "last_played": 1516422531}, "language": "english", "review": "This game is as fun as the name is stupid, but it's not for everyone.\n\nFirst Impressions:\nThis game is an arcade-styled roguelike. That being said, it explains nothing and is completely unapologetic about it. This is not a flaw, it is a deliberate design choice. In your first couple of games, you WILL be a lamb to the slaughter. Don't use this time to critize the game, use it to learn more about it. I can guarantee you will enjoy the game alot more if you approach it with this mindset.\n\nDifficulty:\nWhat you see in the trailers are exactly what you get. This game is hard- Really hard. You die in one hit, and It is Virtually impossible alone- unless, of course, you rig everything in your favor via the map-gen options [spoiler]you schmuk[/spoiler]. You NEED a crew if you want to tackle normal maps and expect to live.\n \nBring Friends!\nFinding other players is pretty hard right now, considering so few are around. The most I have ever seen online in public chat at the same time is 12. \nThis is an even smaller community than Alien Swarm. Expect to see the same people frequently, and try to make good impressions. The last thing you want is to be shunned by someone.\n___________________________________\nCons:\nThere ARE a few problems with the game- Nothings perfect, right? Most players, however, have the common courtesy to never exploit these.\n\nFirst- This one is a biggie- [b]if one player Disconnects from the game, everyone is disconnected.[/b] Again, most players will wait till the round ends to Disconnect, but rarely, somone will use it to troll. How do you deal with this? add the people you trust and reinvite them to a private lobby. the troll will essentially be forced to quit the game or play alone because there are almost always no other lobbies available to join. Being an asshole actually has consequences, imagine that!\n\nSecond- No kick function. this isn't as problematic as you would think in its current state. Maybe its actually a good thing.\n\nThird- No in-game VoIP. Use Discord or Skype or somthing. Executing good teamwork on the fly is a must-have, and just straight up increases the enjoyability of the game.\n\nFourth- Lag. if you happen to be in a server with some really high ping, expect to see some crazy things.\n\nFifth- This is more of a nitpick, but reguardless, it may bug some people. there is often no rhyme or reason with how a map is constructed. No living quarters, No command centers, No bathrooms, No cafeterias, No utility closets, Nothing. Just barebone hallways littered with consoles/sentries.", "timestamp_created": 1516568998, "timestamp_updated": 1516592495, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.560293", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40910768": {"recommendationid": "40910768", "author": {"steamid": "76561198004220770", "num_games_owned": 418, "num_reviews": 8, "playtime_forever": 298, "playtime_last_two_weeks": 298, "last_played": 1521745424}, "language": "english", "review": "space beast terror fright", "timestamp_created": 1521419831, "timestamp_updated": 1521419831, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.517375", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40906883": {"recommendationid": "40906883", "author": {"steamid": "76561198044031772", "num_games_owned": 159, "num_reviews": 1, "playtime_forever": 377, "playtime_last_two_weeks": 0, "last_played": 1515820219}, "language": "english", "review": "I played this game with a group of friends for it looks like a little 6 hours over a couple of weeks, and the thing that just makes me not want to keep playing - its just so freakin shallow. There are like what 3 game modes? Less? Sure it's procedurally generated, but like other games that have that feature it doesn't add anything of substance. You'll still be downloading at consoles or picking up scientists, you just go down different corridors to do it. The options to change up the gameplay are just, what, more or less frequent spawns of enemies? Here are some useless doors for your space station, or have some nice barriers that stop an [i]unending[/i] hoard of aliens. the sound design is repetitive as well, it is so fucking grating to hear those goddamn same 2 alien sounds as they head towards you. \n\nThe only thing I can compliment is the atmosphere - which as others have said does remind me of Aliens. \n\n\n2/10 so fucking annoying", "timestamp_created": 1521403520, "timestamp_updated": 1521403520, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40860201": {"recommendationid": "40860201", "author": {"steamid": "76561197977719891", "num_games_owned": 597, "num_reviews": 77, "playtime_forever": 112, "playtime_last_two_weeks": 41, "last_played": 1521243823}, "language": "english", "review": "THE GOOD\n~ unique idea\n~ cool upgrades\n\nTHE BAD\n~ cheap jump scares\n~ bad gameplay flow\n~ terrible gunplay\n~ stoneage graphics/animations\n~ no adjustment based on player count", "timestamp_created": 1521244385, "timestamp_updated": 1521244385, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40840047": {"recommendationid": "40840047", "author": {"steamid": "76561198003171688", "num_games_owned": 334, "num_reviews": 5, "playtime_forever": 323, "playtime_last_two_weeks": 0, "last_played": 1516352555}, "language": "english", "review": "Not many games raise my blood pressure and heart rate like this game does. \nHAS LOCAL (couch) COOP so you and your non-existent friends can shit your pants at the same time when the xenos start running after you. \n\nIt hasn't been updated in a while but lets face it for a one-man game dev, this is a masterpiece. \n\nRecommended for anyone who likes Space Hulk, or who wants to be one of those space marines from Alien.", "timestamp_created": 1521164659, "timestamp_updated": 1521164659, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40824651": {"recommendationid": "40824651", "author": {"steamid": "76561198279950149", "num_games_owned": 146, "num_reviews": 3, "playtime_forever": 600, "playtime_last_two_weeks": 600, "last_played": 1521345609}, "language": "english", "review": "For all ya anti readers -----> this game is worth it and fun (add me if you someone to play with im in the central timezone)\n\n*i will update this should i feel like there anything else to add* ( 3/30/18 will be the day i no longer will be updateing this)\n\nthere are not many people who play the game so finding a party might be hard (you can always add me and ill join ya)\n\nit is easy to learn what to do and the controls are simple even allows controlers (i use a xbox one and a 360 controler for me and my friend) \n\ncan have up to 4 people on one computer ( i plug my laptop up to my TV so everyone can see everything better) or play online if there is a public party open ( seems that some people like to keep it on private even if there 1-2 slots open )\n\nthis game can make you jump every now and then (not often) when a alien suprises you\n\nyou have 3 types of guns (5 guns in total but 2 guns seem to be the same mostly)  a shotgun a machine gun(there is a gun that is like a smg called the razor but i count it as a machine gun) and 2 rifles\n\nthere are 2 types of enemys (big aliens will one shot you if they touch you) and 3 games modes (PVP deathmacth /// rescue /// salvage/// salvage seems to be everyones main game mode but for pvp deathmacth i seem to win the most with the shotgun)\n\nevery mission you complete will let you take your upgrades to the next misson but should you die or leave the game(quit/goto a new lobby) you lose all upgrades\n\nit also seems like the game is still being work on and suported", "timestamp_created": 1521102792, "timestamp_updated": 1521102792, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40770993": {"recommendationid": "40770993", "author": {"steamid": "76561198084732235", "num_games_owned": 126, "num_reviews": 1, "playtime_forever": 178, "playtime_last_two_weeks": 63, "last_played": 1520961360}, "language": "english", "review": "Probably some of the most fun I've had with a coop game in a long time", "timestamp_created": 1520880407, "timestamp_updated": 1520880407, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40670806": {"recommendationid": "40670806", "author": {"steamid": "76561197998699748", "num_games_owned": 672, "num_reviews": 30, "playtime_forever": 456, "playtime_last_two_weeks": 48, "last_played": 1520910187}, "language": "english", "review": "This is, by far, the most well optimized PC game I have ever played. On my NVIDIA 980 Ti, GPU usage never exceeds 10-11% with 4 people online.\n\nOn my laptop, it runs at a perfectly smooth 60FPS and doesn't even activate the discrete NVIDIA GPU - it runs straight off the Intel UHD Graphics 620 on it's 15W i5-8250u and never skips a beat.\n\nOnly downside is the FPS is capped at 60 max.", "timestamp_created": 1520563323, "timestamp_updated": 1520563323, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40615466": {"recommendationid": "40615466", "author": {"steamid": "76561198058995783", "num_games_owned": 201, "num_reviews": 9, "playtime_forever": 148, "playtime_last_two_weeks": 0, "last_played": 1520397130}, "language": "english", "review": "[h1]Space Beast Terror Fright: for everyone[/h1]\n\nI was first introduced to S.B.T.F. when I was gifted a code by a friend March 2018. I haven't ever seen this game before despite it being a 2015 release. \n\nThe premise of S.B.T.F is one of my favorites. A group of Space Marines in power-armour clearing out a derelic space station filled with unknown horrors. It is like Alien or Warhammer 40k. Be it games or movies, I always look forward to this type of story.\n\nI joined my friends in a four man team and didn't know at all what to expect.\n\n[i]Is this game worth playing? Is the co-op fun?[/i]\n\n[b]-Yes, S.B.T.F does not disappoint-[/b]\n\nThe lack of tutorial leads to a steep learning curve. Our first game ended in the airlock with tons of aliens swarming us in the dark as we friendly fired each other in the backs. The UI was overwhelming and we couldn't make out where we were supposed to go. After visiting the options menu, we found that the Muzzle Flash and FOV Effects Intesity were maxed out by default. When we turned those down, we were able to see what were were shooting at.\n\nAfter an hour, we were finally completing the missions.\n\nOur playstyles changed so much after only one hour. We went from a cautious four man blob to tight two man squads. By hour two we knew when we had to stay close and when we could solo sections of the station. We finally felt like the unstoppable power-armoured  space marines we were supposed to be.\n\nI enjoyed S.B.T.F a whole lot. Co-op was fantastic and much better than trying to play alone. I hope that this continues to grow and eventually get a modding scene.\n\n[b]Play Space Beast Terror Fright where vigilance means survival and power-armour only gives you tools not invulnerability.[/b]", "timestamp_created": 1520368391, "timestamp_updated": 1520368391, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.561587", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40583000": {"recommendationid": "40583000", "author": {"steamid": "76561197992591827", "num_games_owned": 46, "num_reviews": 5, "playtime_forever": 2290, "playtime_last_two_weeks": 678, "last_played": 1521568143}, "language": "french", "review": "Good game!", "timestamp_created": 1520246233, "timestamp_updated": 1520246233, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40580629": {"recommendationid": "40580629", "author": {"steamid": "76561198044421867", "num_games_owned": 162, "num_reviews": 30, "playtime_forever": 685, "playtime_last_two_weeks": 7, "last_played": 1521521753}, "language": "english", "review": "I've always wanted to know what it feels like to be a Starcraft Terran Marine onboard that zerg infested science vessel, Amerigo. This game is the game that Blizzard should have made with Starcraft: Ghost, but since they didn't, Space Beast Terror Fright is here!\n\nReference cinematics: https://youtu.be/o7pifjPrBqI\nReally though, other than the name that can be improved upon, the game itself is a hidden gem in the seas of Early Access FPS games.", "timestamp_created": 1520234469, "timestamp_updated": 1520235059, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.508734", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40560282": {"recommendationid": "40560282", "author": {"steamid": "76561198124012274", "num_games_owned": 649, "num_reviews": 5, "playtime_forever": 929, "playtime_last_two_weeks": 221, "last_played": 1521179450}, "language": "english", "review": "You see a ton of information at first and it seems like it's way too busy and you'll never understand it all, but then you play a few rounds and you learn basically what everything does within the first hour. Then you play for 6 or 7 more hours(in a row, this game is SO ADDICTIVE) and finalyl discover the excellent deathmatch mode. This game is tense, chaotic, fun, tense, insane, tense, and TENSE! \n\nAlso, from a technical standpoint all the menu options move super quick, there are a lot of options for tweaking your UI as well as your other basic options, and loading is extremely quick. You can start a map, die in under a minute, and then fire another one up right away!\n\nIf you're looking for a straightforward corridor shooter with a surprising amount of depth and customizability, this is the one for you!", "timestamp_created": 1520164276, "timestamp_updated": 1520164276, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.537223", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40559455": {"recommendationid": "40559455", "author": {"steamid": "76561198033098868", "num_games_owned": 1073, "num_reviews": 61, "playtime_forever": 130, "playtime_last_two_weeks": 7, "last_played": 1520885527}, "language": "english", "review": "To put it very simply: \"Aliens - The Game\"\nI have yet to play this in multiplayer, but this feels like it would be great in multiplayer.\nPlaying alone is pretty fun, but it's clear that it's been balanced and designed as a co-op game.\nI hope for some balancing for singleplayer and more game modes in multiplayer (there are a few extra game modes).\n\nIn conclusion, I absolutely recommend this if you like your games fueled with adrenaline and a lot of screaming.\nIn all seriousness, this is already a great game with need for some more work and polish that I hope get's finished.", "timestamp_created": 1520161987, "timestamp_updated": 1520161987, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.514768", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40550971": {"recommendationid": "40550971", "author": {"steamid": "76561197994079040", "num_games_owned": 622, "num_reviews": 3, "playtime_forever": 609, "playtime_last_two_weeks": 134, "last_played": 1520682359}, "language": "english", "review": "A Co-op FPS Rogue-like that draws heavy inspiration from Ridley Scott's Aliens and Space Hulk. Very enjoyable with a group of friends. Although, at the time of this review, the game doesn't have a tutorial, so be sure to read the help page before playing.", "timestamp_created": 1520130366, "timestamp_updated": 1520130440, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.508734", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40533184": {"recommendationid": "40533184", "author": {"steamid": "76561197972118634", "num_games_owned": 191, "num_reviews": 2, "playtime_forever": 562, "playtime_last_two_weeks": 0, "last_played": 1520047139}, "language": "english", "review": "I just finished a 9.5 hour session of this game with 2-3 Friends, I was in my first game within 2 minutes which didn't give me enough time to get a bad opinion of the game from its stupid name. \n\nPro: \n- Its the movie Aliens; the atmosphere and setting feels extremely survival horror in a derelict space station.\n- Fantastic (Nine inch nails style) soundtrack that is part of the mechanics, musical and sound ques are the key to survival.  \n- Incredible damage mapping ramps up tension; you can loose your map, your HuD, ammo counter, flashlight or battery etc, you need to continually adapt and think quickly about survival as well as the overall objectives.  \n- Extremely quick to jump into a game from the public lobby or group from steam. \n- Effective upgrades to your armour, map and weapons for the whole squad for completing Objectives, the more you achieve the less unfair it becomes until you get to the point where you're the apex predator. \n- Full customisation of options and settings to change the game type and difficulty by giving yourself an edge.  \n- No weapons are particularly over/underpowered or lack a purpose. \n- If your Marine survives s/he can continue with their improved rank and upgrades into the next mission giving you an edge. \n\nCon: \n- Its survival horror; you are extremely vulnerable to the Aliens. They kill you in what feels like one hit, spawn on top of you or in the worst places. They are terrifying and initially feel unfair until you learn how to control breaches properly, and even then there are some 'gotchya' moments. Frustration included.  \n- No classes, weapon options limited to a small range (4.5) \n- Difficulty varies wildly based on how the map is spawned. (Roguelike problems). \n- DO NOT PLAY ALONE; some of the maps with no doors and wider corridors require a 2nd+ person to help manage the spawns and cover flanking positions, its a multiplayer game that can possibly be enjoyed single player. \n- Watching allies for 15+ mins if you die early can be frustrating. \n- No Career mode, if your Marine survives s/he will not be saved on game quit. :(  \n\nOverall great game, went in totally blind, had a blast. Absolutely worth supporting at this stage and look forward to what gets added next.", "timestamp_created": 1520079542, "timestamp_updated": 1520079542, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.587275", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40523697": {"recommendationid": "40523697", "author": {"steamid": "76561198058329506", "num_games_owned": 224, "num_reviews": 4, "playtime_forever": 1030, "playtime_last_two_weeks": 0, "last_played": 1520043030}, "language": "english", "review": "3 spoopy 5 me", "timestamp_created": 1520043057, "timestamp_updated": 1520043057, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.460182", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40454882": {"recommendationid": "40454882", "author": {"steamid": "76561198034696284", "num_games_owned": 244, "num_reviews": 12, "playtime_forever": 2812, "playtime_last_two_weeks": 0, "last_played": 1519893674}, "language": "english", "review": "Can get really tense, soooo much fun", "timestamp_created": 1519799285, "timestamp_updated": 1519799285, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.488889", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40403267": {"recommendationid": "40403267", "author": {"steamid": "76561198107447301", "num_games_owned": 242, "num_reviews": 24, "playtime_forever": 721, "playtime_last_two_weeks": 0, "last_played": 1513990007}, "language": "english", "review": "Fun little game with friends, a good laugh but don't expect too much. Updates are rarely out even with the potential this game holds. Still it's fun and good for passing the time", "timestamp_created": 1519604417, "timestamp_updated": 1519604417, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40264499": {"recommendationid": "40264499", "author": {"steamid": "76561198035514458", "num_games_owned": 243, "num_reviews": 1, "playtime_forever": 63, "playtime_last_two_weeks": 0, "last_played": 1519615190}, "language": "english", "review": "Very fun game. This is like the scarier, first person version of space hulk (which I also enjoyed). I played split-screen co-op with my buddy on the big screen TV and it was a lot of fun. It will be very challenging in the beginning (i.e. you're gonna die a lot really fast), but once you get the hang of it, it gets even better. The developer is also very active and has a feed on the game website detailing what he's working on each day :)", "timestamp_created": 1519172258, "timestamp_updated": 1519172258, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40211547": {"recommendationid": "40211547", "author": {"steamid": "76561197973492211", "num_games_owned": 812, "num_reviews": 6, "playtime_forever": 215, "playtime_last_two_weeks": 0, "last_played": 1519086687}, "language": "english", "review": "Good lord, its a fast pace Space Hulk that's meant to make you poop yourself at every corner. Find yourself aboard a ship with a bunch of sentry turrets and laser fences? Bet you feel pretty safe huh? But then it happens... the power goes out. All those live turrets, all those fences... gone in an instant. Its just you, and a horde of them... Your bunghole is going to clench so hard you may as well start stuffing coal up there and make some diamonds during every mission.\n\nRescuing some civilians? Just watch as those signals drop in large numbers at a rapid rate...\n\n...Good luck Space Marines.\n\nYou'll never know which turn may just be your last.", "timestamp_created": 1519008053, "timestamp_updated": 1519008133, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40211540": {"recommendationid": "40211540", "author": {"steamid": "76561197996951306", "num_games_owned": 751, "num_reviews": 2, "playtime_forever": 181, "playtime_last_two_weeks": 0, "last_played": 1519063725}, "language": "english", "review": "Shitting your pants is the least of your worries.", "timestamp_created": 1519008027, "timestamp_updated": 1519008027, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40201968": {"recommendationid": "40201968", "author": {"steamid": "76561198010204471", "num_games_owned": 487, "num_reviews": 7, "playtime_forever": 213, "playtime_last_two_weeks": 0, "last_played": 1519258199}, "language": "english", "review": "If you've ever wanted to play Space Hulk as a shooter. This is the game to go-to. Tight corridors, intense firefights, and diminishing resources, Space Beast Terror Fright is a game that'll constantly put you on your toes.\n\nCharacters are ephermeral, so success in a mission means you keep that marine for the next mission, and the next, until they die horribly. Upgrades are carried over till you die, and every mission is a desperate race to find all the data sources, and then the reacter before escaping before your ammo runs dry.\n\nHaving played Deathwing as well, this scratches the itch better. Deathwing may be more pretty but SBTF is a very well done game of exploring giant spaceships.", "timestamp_created": 1518980596, "timestamp_updated": 1518980596, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40065453": {"recommendationid": "40065453", "author": {"steamid": "76561198187414591", "num_games_owned": 107, "num_reviews": 39, "playtime_forever": 1124, "playtime_last_two_weeks": 0, "last_played": 1517040300}, "language": "english", "review": "I’ve had so many great gaming stories with friends because of this game.", "timestamp_created": 1518604706, "timestamp_updated": 1518604706, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40026733": {"recommendationid": "40026733", "author": {"steamid": "76561198372537485", "num_games_owned": 10, "num_reviews": 1, "playtime_forever": 47, "playtime_last_two_weeks": 0, "last_played": 1518488284}, "language": "english", "review": "I had high hopes for this game. Below are the things that need to be resolved.\n-Muzzle flash is ridiculous.  (Blinding)\n-Instant death (at least give us a chance)\n-you need to keep recharging your flashlight  \n(will find yourself constantly hugging the walls since apparently your flashlight is defective and only last one minute.)\n-your view pulses when in danger (No)\n-Cannot change key layout\n\na flashlight in itself is scary enough. No need to make it go out so fast. If i get ambushed at least give me enough health to possibly back out of the situation. If you feel these things are what makes your game good then at least give us the option of turning them off.\n-Flash light battery       (on) (off)\n-Instant death               (on) (off)\n-Muzzle flash                 (lower)\n-Key mapping.\n\nGreat concept... bad execution.\n\n\n", "timestamp_created": 1518450389, "timestamp_updated": 1518450389, "voted_up": false, "votes_up": 8, "votes_funny": 2, "weighted_vote_score": "0.460927", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39829674": {"recommendationid": "39829674", "author": {"steamid": "76561198450105069", "num_games_owned": 17, "num_reviews": 1, "playtime_forever": 293, "playtime_last_two_weeks": 0, "last_played": 1516795290}, "language": "japanese", "review": "シンプルで面白い友達とやるとさらに面白いからおすすめ", "timestamp_created": 1517702600, "timestamp_updated": 1517702600, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39749786": {"recommendationid": "39749786", "author": {"steamid": "76561198069607345", "num_games_owned": 254, "num_reviews": 47, "playtime_forever": 23, "playtime_last_two_weeks": 0, "last_played": 1517413559}, "language": "english", "review": "This game is fun, until you die randomly from something appearing out of literally nowhere. also the pulsing is fun whenever something comes near so you cant see straight. other than that game is great.", "timestamp_created": 1517413605, "timestamp_updated": 1517413605, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.406649", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39644752": {"recommendationid": "39644752", "author": {"steamid": "76561198000607213", "num_games_owned": 180, "num_reviews": 3, "playtime_forever": 2074, "playtime_last_two_weeks": 85, "last_played": 1521677763}, "language": "english", "review": "Great game. Miniscule community. Impossible to beat the game alone. Great for coop, terrible for singleplayer unless you rig it your way. Do not buy unless you have people to play with.  Music is great and flows with the rythym of your current situation. The experience at first is nice though, but slowly loses its value.\n\nBuy if you like multiplayer.\nAvoid if you like singleplayer.", "timestamp_created": 1517025537, "timestamp_updated": 1517025644, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.468750", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}}}
