{"query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 91, "total_negative": 2, "total_reviews": 93}, "reviews": {"38145517": {"recommendationid": "38145517", "author": {"steamid": "76561197992121204", "num_games_owned": 542, "num_reviews": 2, "playtime_forever": 1774, "playtime_last_two_weeks": 0, "last_played": 1512710466}, "language": "english", "review": "Enjoyed it.  I was surprised by how good a game it was to be honest.  I really enjoyed the dialogue between the characters and the fact that you could see what characters were thinking at given points was a great way to give them more life.  Combat is ok...it gets deeper as the the game progresses.  Satisfying end to the story.  The only qualm I have is the respawning enemies when you leave a map and come back to it.  Fighting the same types of monsters over and over on certain tilesets can become repetitive.  That being said it was money well spent.  Thanks for the fun game!", "timestamp_created": 1512710680, "timestamp_updated": 1512710680, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36354556": {"recommendationid": "36354556", "author": {"steamid": "76561198214989148", "num_games_owned": 1313, "num_reviews": 59, "playtime_forever": 1081, "playtime_last_two_weeks": 0, "last_played": 1510098130}, "language": "english", "review": "Another Aldorlea game in the bag so time for a review!   This game is harder to quantify than those before it since for example Dreamscape has a better battle system in my opinion, but this game has a far better story.  Although again a simple one.  The emotion put into the performance both sad and happy at times is what made this game.\n\nOn the other hand this game has the flaw of you really need the guide for it the secret rooms are sometimes a little too well hidden.  But this does not detract from how fufilling this game is.  And the pairings actually make sense.  \n\nHowever this game at normal and probably hard difficulty has a rather odd problem.  Virtually every character is a 'physical' character in which the MAT stat is virtually worthless. And the one 'mage' you do have learns moves too slow and aren't strong enough to really do much for what she really needs to do.  When I got the final party member I perma benched her, since you can do a pretty awesome combo if you do galvanize+enthuse friends for 33% crits on top of increased attack, and add in dropping enemies defenses?  Even better!\n\nThough there are a few skills in the game that are bugged for example Quinacrodrone instead of reducing an enemies' defense it decreases your own defense.   And pump up the action only adds counter onto one ally not all.\n\nBut still another gem of a game by Aldorlea.", "timestamp_created": 1510098653, "timestamp_updated": 1510098653, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34098188": {"recommendationid": "34098188", "author": {"steamid": "76561198034452759", "num_games_owned": 212, "num_reviews": 35, "playtime_forever": 1171, "playtime_last_two_weeks": 0, "last_played": 1502177984}, "language": "russian", "review": "Здравствуй игрок. Ты остановился на выборе этой игры, но ты не уверен? Бери ее смело, эта игра заставила меня пустить скупую мужскую слезу в конце, я думаю она не оставит никого равнодушным, прошел ее на легендарной сложности, то еще удовольствие: получил реальный челледж, сопартийцы сбалансированы, обдумываешь на ход вперед, иногда бывают моменты когда становится легко, но ровно до того момента пока не перешагнешь на следующую часть архипелага.\nИтак к плюсам: \n1) сюжет вдаваться в подробности не буду нужно самому читать, чтобы было интересно\n2) поиск секреток - секретные комнатки это наше все=)\n3) механика игры - трудно добываемый шмот, крафт зелий, использование аксессуаров в различных ситуациях\n4) карточки - мне выпала металлическая карточка Джеррада которая стоит в разы больше, чем сама игра купленная на распродаже=)\nИтак к минусам:\n1) Для кого то это может быть минусом, но не для меня - это игра RPG Maker и этим все сказано\n2) В основном это линейность, но тут наши действия обосновываются персонажами, так что плюс / минус.\n3) Необходим средний уровень Инглиша, без него боюсь смысла брать ее нету.\nPs: Игра очень хорошо сделана, хорошо сбалансирована, отличный сюжет, местами великолепный саунд трек, хотелось бы конечно, чтобы можно было немного больше исследовать мир, но и так в принципе отлично.\nБерите однозначно, если не пугает RPG Maker  и владеете английским языком на среднем уровне.", "timestamp_created": 1502179367, "timestamp_updated": 1502179439, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.510752", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33393148": {"recommendationid": "33393148", "author": {"steamid": "76561198252711232", "num_games_owned": 49, "num_reviews": 3, "playtime_forever": 464, "playtime_last_two_weeks": 0, "last_played": 1497996681}, "language": "spanish", "review": "Muy recomendado si sois de la vieja escuela,me recordo mis primeros tiempos jugando juegos de rol,la trama es bastante buena y la forma de jugar sencilla.", "timestamp_created": 1499572145, "timestamp_updated": 1499572145, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33266246": {"recommendationid": "33266246", "author": {"steamid": "76561198023967153", "num_games_owned": 86, "num_reviews": 1, "playtime_forever": 1443, "playtime_last_two_weeks": 0, "last_played": 1499245877}, "language": "english", "review": "Old school JRPG with turn based fighting and points to spend when you level up. That's the itch I look to scratch, and so rarely does a game do it so well. I loved almost everything about this game. Almost. I didn't like being forced down a path, and restricted from certain areas. Not being allowed to back track and explore kind of irritated me, but it really became a problem when I couldn't get passed a certain part in the story because I didn't put any DEF onto a certain character, causing him to get 1 shot and not allowing me to leave the city. So had to load a previous save to grind some levels for him. Still worth the money, I hope to find more games like this.", "timestamp_created": 1499244542, "timestamp_updated": 1499244542, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32889760": {"recommendationid": "32889760", "author": {"steamid": "76561198004438421", "num_games_owned": 553, "num_reviews": 40, "playtime_forever": 23, "playtime_last_two_weeks": 0, "last_played": 1498598262}, "language": "english", "review": "Generic grinding combat paired with a story that keeps telling you to go grind. Remarkably poor writing on a technical level combined with absolutely no sense of subtlety, as Jerrat tells the player that he loves his family and will be sad now that they're dead and swears revenge because he is angry and is bad at fighting because he is a common man, as the story then poorly meshes with the gameplay as Jerrat proceeds to have trouble beating up rats despite regularly going to the forest to pick mushrooms. Add in the clumsy pairing of original art and stock RPGMaker assets and you have an all around mediocre game that I see no reason to bother sitting through any longer.", "timestamp_created": 1498598501, "timestamp_updated": 1498598501, "voted_up": false, "votes_up": 10, "votes_funny": 3, "weighted_vote_score": "0.586698", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32767644": {"recommendationid": "32767644", "author": {"steamid": "76561198030896901", "num_games_owned": 22, "num_reviews": 2, "playtime_forever": 1205, "playtime_last_two_weeks": 0, "last_played": 1498387652}, "language": "english", "review": "Recently played the game and finished it on normal mode.\n\nI liked the following:\n1) Interesting and fun conversations between each characters.\n2) Character's thoughts are conveyed throughout the game, which makes the content and gameplay enjoyable.\n3) Interesting system where you cannot just barge into civilian's houses and loot (like your average classic RPGs ;D)\n4) The stroy was quite short in my perspective, but the storyline do just go straight to the point.\n\nSuggestions for the game:\n(a) The world map appears to be \"locked-route\" and it would be better-off if players are given the option to be able to re-visit without being barred from the main story.\n(b) The side quest may be better if they are not time-event bound.\n(c) The varieties of enemies can be improved, exepcially for bosses.\n(d) There should be options for post-end game plays where you are able to attend to side quests or finding secret rooms in my opinion.\n(e) If only other characters may also be optional to join the party while on the quest...\n\nOverall it is quite a nice game with its own pros and cons. I would recommend it to friends who are interested in RPGMaker type of games.", "timestamp_created": 1498389707, "timestamp_updated": 1498389827, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.533835", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32608200": {"recommendationid": "32608200", "author": {"steamid": "76561198069159152", "num_games_owned": 700, "num_reviews": 454, "playtime_forever": 96, "playtime_last_two_weeks": 0, "last_played": 1498013432}, "language": "english", "review": "This game starts with tragedy. A roving army has lost some of its food supplies, so they pillage a local farm for supplies... and kill a woman and baby. Unfortunately for them they missed their husband/father, who was working in the fields... and now he's out for blood.\n\nThus a common farmer is thrust into a epic adventure of revenge and saving the world (because waht else do you need?). Can he complete this task without losing the man who his wife loved?\n\nLooks fun.", "timestamp_created": 1498013688, "timestamp_updated": 1498013688, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.498667", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32561838": {"recommendationid": "32561838", "author": {"steamid": "76561198026452979", "num_games_owned": 155, "num_reviews": 32, "playtime_forever": 744, "playtime_last_two_weeks": 0, "last_played": 1497867945}, "language": "french", "review": "C'est un jeu de rôles de RPG Maker, mais il est conçu pour couvrir la formule JRPG d'une manière très différente ... une façon qui regarde le monde des yeux d'un homme commun qui cherche une vengeance.\n \nLes joueurs prendront le rôle de fermier commun appelé Jerrat qui cherche la vengeance après que sa femme et son fils sont brutalement assassinés.\n\nL'aventure voit Jerrat accompagné d'autres guerriers et aventuriers en cours de route, tentant de se venger tout en jouant un complot beaucoup plus compliqué qui affectera le destin de la nation. Jerrat doit également se battre contre ses propres démons, dans l'espoir de ne pas se laisser consommer par la haine qui le conduit à sa quête et de maintenir les principes fondamentaux qui ont conduit à sa femme à l'amoureux de lui dès le début.\n\nLe conte d'un homme commun est un jeu de réflexion inspirée de 16 bits avec un combat tourné, sept personnages pouvant rejoindre le parti, cinq personnages actifs pendant le combat, 30 salles secrètes et 30 heures de jeu\n\n\"Les graphismes du jeu m'ont plu. Bien sûr, ce n'est pas le plus remarquable, mais tout semble soigné et attrayant. Tous les milieux et les personnages sont dessinés avec amour.\n\n\"Les combats ici sont les mêmes que dans n'importe quel JRPG. Leur complexité dépend du niveau de difficulté que vous choisissez au début du jeu. \"\n\nC'est un jeu de rpg-maker, donc si cela vous dérange, ce n'est peut-être pas votre tasse de thé. Si toutefois, vous aimez jouer à un jeu difficile à la fois drôle et intelligent, alors vous l'apprécierez. J'ai fait. Le temps de jeu était d'environ 10 à 12 heures. Pas mal pour un jeu peu coûteux! \"...", "timestamp_created": 1497867512, "timestamp_updated": 1497867669, "voted_up": true, "votes_up": 14, "votes_funny": 1, "weighted_vote_score": "0.696438", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32555170": {"recommendationid": "32555170", "author": {"steamid": "76561197970718744", "num_games_owned": 728, "num_reviews": 17, "playtime_forever": 1418, "playtime_last_two_weeks": 0, "last_played": 1497837419}, "language": "english", "review": "I enjoyed this game.  I like that we get to see a lot of the inner thoughts of the characters, and watch their personal progression.  Combat was decent, good pixel art, though the outfits were silly nonsense.  Good ending.\n\nI like that there was a lot of world I didn't get to visit, as the characters had good reason to not just wander half a continent away -- they were on a deadline.  Yet those areas existed anyway, to give the world life.  There's more towns and cities than you can visit.  Also there's a lot of doorways you can't enter, because of course homeowners and shopkeepers don't want you rummaging through their stuff.  My primary compulsion as an RPG player is to loot everything, but we're playing as characters who generally don't do that.  Nice touch.  :D\n\nBig complaint was controls.  Controller didn't work, F12 surprisingly restarts the game instead of taking a screenshot (so I had to play the final battle again to see the rest of the ending -- oops!), and keys were not remappable.  It wasn't crippling, but it was very inconvenient.", "timestamp_created": 1497838416, "timestamp_updated": 1497838416, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.561274", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30682768": {"recommendationid": "30682768", "author": {"steamid": "76561198013658567", "num_games_owned": 2314, "num_reviews": 81, "playtime_forever": 1405, "playtime_last_two_weeks": 0, "last_played": 1490773425}, "language": "german", "review": "Interessante Geschichte, gute Audioqualität, detaillierte Charaktere, tolle Linien des Dialogs, ein angemessener Preis. Spiel empfiehlt allen Fans von Rollenspielen mit Turn-basierten Schlachten und Rollenspiel-Fans von Indie-Spielen mit einem guten Plot, ich empfehle das Spiel.", "timestamp_created": 1490263499, "timestamp_updated": 1490263499, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30440982": {"recommendationid": "30440982", "author": {"steamid": "76561198123214280", "num_games_owned": 109, "num_reviews": 15, "playtime_forever": 1150, "playtime_last_two_weeks": 0, "last_played": 1489216428}, "language": "english", "review": "Just beat it on the hardest mode! Loveable characters, beautiful story, engaging combat, lots of stategy (or you can level grind), potion making is great! The world, I wish there was another game in this world! This game is worth at least 15$, I swear, I really became attatched to the characters! And its so well written, the character sprites look phenomenal! Truly, a MUST PLAY game, go for it, buy it, its fantastic! :D", "timestamp_created": 1489216569, "timestamp_updated": 1489216569, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.592079", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28231247": {"recommendationid": "28231247", "author": {"steamid": "76561198026797707", "num_games_owned": 66, "num_reviews": 1, "playtime_forever": 629, "playtime_last_two_weeks": 0, "last_played": 1481089005}, "language": "english", "review": "Interesting storyline with standard turn based fighting. The battle potion creation was a nice addition. Controller support would of been nice.", "timestamp_created": 1481089633, "timestamp_updated": 1481089633, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.530113", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26671077": {"recommendationid": "26671077", "author": {"steamid": "76561198045412105", "num_games_owned": 1184, "num_reviews": 8, "playtime_forever": 633, "playtime_last_two_weeks": 0, "last_played": 1479469614}, "language": "english", "review": "Play this game if you're looking for something short (10 hours), simple, and charming. I was satisfied at least, and I challenge you to avoid making it through the ending without at least smirking. \n\nScrew distilling poitions though. Whoever thought that system was even remotely usable needs to get kicked out of the industry.", "timestamp_created": 1479473425, "timestamp_updated": 1479473425, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.483232", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26367706": {"recommendationid": "26367706", "author": {"steamid": "76561198031859124", "num_games_owned": 325, "num_reviews": 24, "playtime_forever": 700, "playtime_last_two_weeks": 0, "last_played": 1478062709}, "language": "english", "review": "well worth the money and sooo many side quests i missed several aparently and still finished the game will have to hope for a walkthrough or guide to see exactly how many i missed lol", "timestamp_created": 1478062818, "timestamp_updated": 1478062818, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.592079", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26134578": {"recommendationid": "26134578", "author": {"steamid": "76561198249853896", "num_games_owned": 43, "num_reviews": 35, "playtime_forever": 69, "playtime_last_two_weeks": 0, "last_played": 1476996228}, "language": "english", "review": "A loving father farmer will put up a fence, while pitiless soldiers will steal them. A drama occurs and the farmer swears to revenge. This focus will change in the end ;) \n\nThe team is touching, of whom a shy man of the woods except for a haughty knight. The player should read the dialogue carefully to notice a scheme. You have also inner thoughts for some which is a first in a game for me. Jerrat’s life lessons to Aaydan are great. Jerrat the victim made a lesson to the bad boss, it shows a common man can worth more than a wealthy man. We also see change of mind and the evolution of the characters. There are verry funny NPC like musicians, reapers twirling and an animal appears a bit late in the game, he’s incredible. \nArtwork: I loved the windmill and Neston’s ship, Asterie’s long hair and Grawin’s smile.\nThe menu music is so stimulating to go on playing.  I loved “theme crystallized” a good start on the adventure. I loved “angry avenger” and “high stakes low chances” battle soundtracks, so exciting!\n\nI recommend Gemelle Games!", "timestamp_created": 1476992589, "timestamp_updated": 1477433390, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.496479", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25446581": {"recommendationid": "25446581", "author": {"steamid": "76561198044726835", "num_games_owned": 140, "num_reviews": 13, "playtime_forever": 760, "playtime_last_two_weeks": 0, "last_played": 1474196594}, "language": "english", "review": "Quite an interestign game. However do not worth the full price.\nThe game is slow and repetitive.\n", "timestamp_created": 1473526562, "timestamp_updated": 1473526562, "voted_up": true, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.419953", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25376232": {"recommendationid": "25376232", "author": {"steamid": "76561198069671296", "num_games_owned": 208, "num_reviews": 20, "playtime_forever": 72, "playtime_last_two_weeks": 0, "last_played": 1473112024}, "language": "english", "review": "SUCH A GOOD GAME!!!\nto put this into perspective for you, I have beaten more than half of the Final fantasy games, five of the legend of zelda games, and around nineteen other JRPGs/RPGs. AND THIS GAME IS IN MY TOP 3. So far, that is. Amazing. Just. Fucking. Amazing.", "timestamp_created": 1473141956, "timestamp_updated": 1473141956, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.333044", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25371285": {"recommendationid": "25371285", "author": {"steamid": "76561198060131687", "num_games_owned": 2009, "num_reviews": 20, "playtime_forever": 257, "playtime_last_two_weeks": 0, "last_played": 1473092841}, "language": "russian", "review": "Nice!", "timestamp_created": 1473110635, "timestamp_updated": 1473110635, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25368986": {"recommendationid": "25368986", "author": {"steamid": "76561198086321203", "num_games_owned": 965, "num_reviews": 5, "playtime_forever": 131, "playtime_last_two_weeks": 0, "last_played": 1472923077}, "language": "russian", "review": "Очередное творение от «Aldorlea Games» снова с большим, ещё лучшим рассказом о человеке который жаждить отомстить за жестокое убийство его жены и сына. Сможет ли Джеррат достичь своей цели не потеряв человечность? Узнайте это в этой большой интересной истории выполненной в 16-битном стиле RPG, где рассказ о судьбе простого человека переплетается с судьбой нации.", "timestamp_created": 1473101608, "timestamp_updated": 1473101608, "voted_up": true, "votes_up": 13, "votes_funny": 1, "weighted_vote_score": "0.688451", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25354592": {"recommendationid": "25354592", "author": {"steamid": "76561197993926157", "num_games_owned": 226, "num_reviews": 3, "playtime_forever": 869, "playtime_last_two_weeks": 0, "last_played": 1473025831}, "language": "english", "review": "This game was well designed, it never felt like I was over-powered, and I was always having to think about combat even up to the end of the game. I really like the writing also - it was clever and engaging. The party banter was quite funny in spots (you can listen in on their thoughts sometimes). It's an rpg-maker game, so if that bothers you, this may not be your cup of tea. If however, you like playing a challenging game that is both funny and clever, then you will enjoy it. I did. Game time was about 10-12 hours. Not bad for an inexpensive game! Have fun!", "timestamp_created": 1473026233, "timestamp_updated": 1473026233, "voted_up": true, "votes_up": 35, "votes_funny": 1, "weighted_vote_score": "0.674649", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25351817": {"recommendationid": "25351817", "author": {"steamid": "76561198070835518", "num_games_owned": 30, "num_reviews": 17, "playtime_forever": 151, "playtime_last_two_weeks": 0, "last_played": 1473092246}, "language": "english", "review": "+ Brilliant and witty dialogues\n+ Great and memmorable character cast, developing through the game\n+ Challenging and well balanced on the Legendary mode\n+ Enjoyable battles and music\n\n- Not as long as some other similar games\n- Lacks more variety of weapons\n\nP.s. I played this game from Aldorlea, prior to the Steam release.", "timestamp_created": 1473015362, "timestamp_updated": 1473015362, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.466974", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "25349773": {"recommendationid": "25349773", "author": {"steamid": "76561198062179577", "num_games_owned": 598, "num_reviews": 2, "playtime_forever": 120, "playtime_last_two_weeks": 0, "last_played": 1472914633}, "language": "russian", "review": "динамическая игра, хотя сначала мы просто делаем свои фермерские обязанности, но потом мы попадем в приключения, где завяжутся бои, в которых мы должны одержать победу!) ведь обычные крестьяне тоже умеют бороться) так что в путь!)", "timestamp_created": 1473008799, "timestamp_updated": 1473008799, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25349328": {"recommendationid": "25349328", "author": {"steamid": "76561198005206219", "num_games_owned": 535, "num_reviews": 3, "playtime_forever": 124, "playtime_last_two_weeks": 0, "last_played": 1472897395}, "language": "russian", "review": "игра понравилась, ведь по сюжету, вы не распиаренный принц, или крутой рыцарь, а лишь обычный фермер который попал в водоворот событий, и теперь он по уши в приключениях) игра сделанная в стиле 16 бит, так что любителям крайзиса лучше поостеречься)", "timestamp_created": 1473007603, "timestamp_updated": 1473007603, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25349242": {"recommendationid": "25349242", "author": {"steamid": "76561198117557846", "num_games_owned": 608, "num_reviews": 2, "playtime_forever": 181, "playtime_last_two_weeks": 0, "last_played": 1472918194}, "language": "russian", "review": "игра на любителя старых игр, пиксельной эпохи) если вы играли сега или денди, то вам понравиться) ностальгия одним словом) \nПлюсы\n+интересный сюжет\n+интересные квесты\nМинусы\n-нет локализации(что крайне печально)", "timestamp_created": 1473007320, "timestamp_updated": 1473007320, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25349076": {"recommendationid": "25349076", "author": {"steamid": "76561198064086456", "num_games_owned": 539, "num_reviews": 1, "playtime_forever": 181, "playtime_last_two_weeks": 0, "last_played": 1472918292}, "language": "russian", "review": "и снова 16 бит, и снова ностальгия) вполне не плохо нарисованная игра, так как это рпг, вся суть в тексте который всплывает, жаль что не на русском, но у меня нет проблем с английским) неплохой сюжет) как можно понять из названия приключения самого обычного человека!) в путь к приключениям!)", "timestamp_created": 1473006750, "timestamp_updated": 1473006750, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25348936": {"recommendationid": "25348936", "author": {"steamid": "76561198107360602", "num_games_owned": 613, "num_reviews": 2, "playtime_forever": 181, "playtime_last_two_weeks": 0, "last_played": 1472918185}, "language": "russian", "review": "рпг о приключениях обычного человека)\nПлюсы\n+Приятная графика\n+Интересный сюжет\n+Дополнительные квесты\n+Секретные помещения\nМинусы\n-нет русской локализации", "timestamp_created": 1473006352, "timestamp_updated": 1473006352, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25336430": {"recommendationid": "25336430", "author": {"steamid": "76561198061066803", "num_games_owned": 2612, "num_reviews": 246, "playtime_forever": 150, "playtime_last_two_weeks": 0, "last_played": 1472929697}, "language": "russian", "review": "Рргмейкерная ролевуха с классными артами и зарисовками, качественным саундом, и достаточно приличной боёвкой... Вы этого ждали? ну тогда вам сюда. Не смотря на всемипонятный движок игры- один из лучших вариков!", "timestamp_created": 1472950028, "timestamp_updated": 1472950028, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.447435", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25332557": {"recommendationid": "25332557", "author": {"steamid": "76561198008084834", "num_games_owned": 3387, "num_reviews": 215, "playtime_forever": 258, "playtime_last_two_weeks": 0, "last_played": 1472954556}, "language": "russian", "review": "Игра The Tale of a Common Man, представляет собой 1001 игру, созданную с помощью RPG Maker. Поэтому не стоит требовать от неё трёхмерности и красивой графики. В подобного рода играх всегда делался упор на текстовую составляющую, а не на графическую. Текста в игре много, и если вы не владеете английским хотя бы на среднем уровне - придётся либо его учить во время игры, попутно пополняя свой словарный запас, либо отложить игру до выхода русификатора. В остальном игра вполне сносна - музыка не напрягает, сюжет хоть и не самый оригинальный, но имеет свои изюминки. Есть некоторые проблемы с управлением, но это должны будут поправить в очередном патче.\n\n+ достижение и карточки\n- явно завышенная цена\n\nP.S. Интересно - когда уже разработчики перестанут использовать RPG Maker и начнут по старинке делать свои движки или же доводить до ума уже готовые, типа Unreal или Unity?", "timestamp_created": 1472934049, "timestamp_updated": 1502563558, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502989", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25330296": {"recommendationid": "25330296", "author": {"steamid": "76561198084182157", "num_games_owned": 1173, "num_reviews": 10, "playtime_forever": 251, "playtime_last_two_weeks": 0, "last_played": 1472938610}, "language": "russian", "review": "The Tale of a Common Man - RPG от уже довольно известной в кругах любителей ролевых игр компании Aldorlea Games. В этот раз героем становится обычный фермер, потерявший дорого человека. Сюжет интересен, хоть и не блещет оригинальностью, диалоги прописаны довольно неплохо.\nЧто касается визуальной части, то мне понравились локации и фигурки персонажей - как для RPG Maker - хорошо. Звуковое сопровождение также на уровне.\nЕсли вас отпугивает от приобретения цена, дожидесь большей скидки. И тогда погрузитесь в очередное приключение от Aldorlea Games", "timestamp_created": 1472926358, "timestamp_updated": 1472926358, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.536566", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "25330121": {"recommendationid": "25330121", "author": {"steamid": "76561198050442172", "num_games_owned": 1077, "num_reviews": 22, "playtime_forever": 191, "playtime_last_two_weeks": 0, "last_played": 1472926055}, "language": "english", "review": "I was hooked on the game of «Aldorlea Games». Previously I did not play in the RPG on the engine RPG Maker. Now I catch the output of each new game from them. Fans of the genre will recognize me.\n\nIn «The Tale of a Common Man» I liked the story. Though he is banal, but rather tragic. The history of the common man of the people, a simple farmer on the path of vengeance, to avenge the death of his wife and son.\n\nThe graphics in the game has pleased me. Of course it's not the most outstanding, but everything looks neat and attractive. All the backgrounds and characters are drawn with love.\n\nBattles here are the same as in any JRPG. Their complexity depends on what difficulty level you choose in the beginning of the game. Travel can be five characters, but in the game there are only 8. There was a possibility of allocating points for skillam at higher levels.\n\nHigh-quality, interesting RPGshka. Fans of the genre is not exactly pass by.", "timestamp_created": 1472925822, "timestamp_updated": 1472925822, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.498870", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25329410": {"recommendationid": "25329410", "author": {"steamid": "76561198284737282", "num_games_owned": 1661, "num_reviews": 175, "playtime_forever": 232, "playtime_last_two_weeks": 0, "last_played": 1474004429}, "language": "russian", "review": "Я уже подсел на игры от «Aldorlea Games». Раньше вообще не играл в RPG на движке RPG Maker. Теперь ловлю выход каждой новой игры от них. Фанаты жанра меня поймут.\n\nВ «The Tale of a Common Man» мне очень понравился сюжет. Хоть он и банальный, но довольно трагичный. История обычного человека из народа, простого фермера, вставшего на путь мести, с целью отомстить за смерть жены и сына.\n\nГрафика в игре меня порадовала. Конечно она тут не самая выдающаяся, но все выглядит аккуратно и привлекательно. Все фоны и персонажи прорисованы с любовью.\n\nБои тут такие же, как в любой JRPG. Их сложность зависит от того, какой уровень сложности вы выбрали в начале игры. Путешествовать можно с пятью персонажами, а в игре их всего 8. Появилась возможность распределения очков по скиллам при повышении уровня.\n\nДиалоги в игре довольно простые, поэтому даже люди со средними знаниями английского спокойно смогут все понять.\n\nДобротная, интересная РПГшка. Фанаты жанра точно не пройдут мимо.", "timestamp_created": 1472923591, "timestamp_updated": 1472923591, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.480197", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25329253": {"recommendationid": "25329253", "author": {"steamid": "76561197981228012", "num_games_owned": 11096, "num_reviews": 79, "playtime_forever": 388, "playtime_last_two_weeks": 0, "last_played": 1473054188}, "language": "russian", "review": "The Tale of a Common Man - ролевая инди игра с пошаговыми боями. Главный герой игры - фермер по имени Джеррат. В данной игре интересный, но трагический сюжет. В безоблачной жизни героя случается трагедия, неизвестные солдаты убивают его сына и любимую жену. После случившегося, наш герой встает на путь войны, и идет мстить за семью. На пути Джеррата могу повстречаться не только враги, но и союзники, а также нпс, которые будут давать дополнительные задания. В команду героя можно набрать до 5 персонажей.\n\nПлюсы[list]\n[*]Графика. Продуманные и красиво нарисованные локации.\n[*]Сюжет, трагичный, но интригующий.\n[*]Музыка. В игре хорошо подобранная музыка, которая меняется в зависимости от местности и обстоятельств\n[*]Достижения Steam[/list]\n\nМинусы[list]\n[*]Нет русского языка, без знания языка играть будет не очень интересно.\n[*]Ошибки. Так как игра только вышла, в ней есть ошибки. Например, может случится так что после того как закончится диалог, герой не реагирует на ваши команды.[/list]\n\nЕсли вам нравятся такие игры как OH! RPG!, Millennium 1-4, Beyond Reality, то эта игра для вас.", "timestamp_created": 1472923152, "timestamp_updated": 1473180498, "voted_up": true, "votes_up": 22, "votes_funny": 0, "weighted_vote_score": "0.641365", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25329060": {"recommendationid": "25329060", "author": {"steamid": "76561198017531109", "num_games_owned": 615, "num_reviews": 57, "playtime_forever": 131, "playtime_last_two_weeks": 0, "last_played": 1472899542}, "language": "russian", "review": "Одна из интересных РПГ, которые мне попадались на просторах стима.\nОтличная графика, хорошее музыкальное сопровождение. Понравились персонажи и диалоги и закрученость сюжета. Вобщем игрулина маст хев в библиотеке стим у всех любителей этого жанра) 10/10", "timestamp_created": 1472922550, "timestamp_updated": 1472922550, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.499915", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25326957": {"recommendationid": "25326957", "author": {"steamid": "76561198253409315", "num_games_owned": 388, "num_reviews": 6, "playtime_forever": 223, "playtime_last_two_weeks": 0, "last_played": 1472932992}, "language": "english", "review": "Again new game from Aldorlea Games studio which is famous for the games made in RPG Maker\nThis time we play for the person, engaged in a farm by the name of Jerrat which because of the death of the wife and the son, gives up peaceful life and goes to revenge\n\nPluses:\n\n1. There is a possibility of the choice of complexity, and also in advance is explained by what is difficult, each of difficulties\n2. Beautiful music\n3. Achievements and collection Steam cards\n4. Support of gamepad\n5. Dialogues\n\nMinuses: \n1. Expensive cost of a game for such game made on RPG Maker (but nevertheless work of the creator)\n2. A game was few times closed\n\nI would deliver to this game 7/10", "timestamp_created": 1472915861, "timestamp_updated": 1472915861, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.412565", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25326760": {"recommendationid": "25326760", "author": {"steamid": "76561198018854617", "num_games_owned": 129, "num_reviews": 29, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1472915021}, "language": "russian", "review": "The Tale of a Common Man - это старая добрая ролевая игрушка сделанная студией Aldorlea Games которая уже на протяжение большого времени радует нас своими шедеврами как серия игр Millennium. Данная игра сделана в лучших традициях предыдущих игр от данной компании. Мы будем играть за Джаррета обычного фермера который вынужден был взять в руки оружия и двинуться в приключения чтобы найти и наказать обидчиков. По пути нам будут попадаться бандиты и мифические монстры которых мы должны победить.\n\nГрафически игра так же как и другие игры от этой студии не отличаются это РПГ Мейкер. Графика уже старенькая да удаленькая) Музыка отличная местами бодрая, местами расслабляющая.\nОчень рекомендуется фанатам студии Aldorlea Games.", "timestamp_created": 1472915219, "timestamp_updated": 1472915219, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.516746", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25326633": {"recommendationid": "25326633", "author": {"steamid": "76561197980687009", "num_games_owned": 141, "num_reviews": 34, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1472916838}, "language": "ukrainian", "review": "The Tale of a Common Man - це рольова гра оповідає про пригоди цілком звичайної людини, фермера який кинув свою звичну роботу після того як убили його дружину і дитину. Він зібрав свій загін хоробрих хлопців які вирушили в подорож що знайти кривдників і врятувати світ від міфічних істот. \n\nГрафіка в даній грі старовата але в цьому вся суть РПГ Макер, вона ніколи не змінювалася. Досить таки звична графіка. Музика в грі зроблено дуже якісно.\nЦіна велика але гра того варта)", "timestamp_created": 1472914793, "timestamp_updated": 1472914793, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25326465": {"recommendationid": "25326465", "author": {"steamid": "76561198044253557", "num_games_owned": 1316, "num_reviews": 10, "playtime_forever": 124, "playtime_last_two_weeks": 0, "last_played": 1472921294}, "language": "english", "review": "Interesting story, good audio quality, detailed characters, great lines of dialogue,an adequate price. Game recommend to all fans of role-playing games with turn-based battles and role-playing fans of indie games with a good plot, I personally liked the game.", "timestamp_created": 1472914176, "timestamp_updated": 1472914176, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.464387", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25325727": {"recommendationid": "25325727", "author": {"steamid": "76561198272374716", "num_games_owned": 6817, "num_reviews": 858, "playtime_forever": 278, "playtime_last_two_weeks": 0, "last_played": 1472906001}, "language": "russian", "review": "«Aldorlea Games» в очередной раз радует своих поклонников новой RPG на движке RPG Maker!\n\nНа сей раз нам предстоит пережить с главным героем трагедию потери близких и помочь ему отомстить за убийство его жены и ребенка.\n\nОчаровательная игра с захватывающей историей мести. Все сделано в уже устоявшихся традициях игр этого жанра. «Aldorlea Games» удается делать маленькие шедевры на таком, казалось бы, простом движке, как RPG Maker. Графика, музыка, главные герои и сама история удались на славу. Игру так и хочется пройти до конца.\n\nБои пошаговые, но очень динамичные. В игре есть выбор уровня сложности. Теперь можно выбирать статистики, которые повысятся при получении уровня. В игре семь персонажей и один дополнительный. В команду можно набирать до 5 участников. В игре можно самим варить зелья, используя собранные рецепты и ингредиенты.\n\nИгра понравилась. Очень рекомендую любителям жанра и не только им. Качественная игра. Достижения, карточки, поддержка контроллера, есть все, что надо для комфортной игры.\n\nГеймплей:\nhttps://www.youtube.com/watch?v=0cuVq98KlgQ", "timestamp_created": 1472911865, "timestamp_updated": 1472911865, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.501419", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25325660": {"recommendationid": "25325660", "author": {"steamid": "76561198074404956", "num_games_owned": 419, "num_reviews": 34, "playtime_forever": 181, "playtime_last_two_weeks": 0, "last_played": 1472915051}, "language": "russian", "review": "Игра повествует нам историю об обычном фермере по имени Jerrat который должен был оставить свою привычную работу, взять меч и пойти сражаться со злом. У него и так горе кто то убил его ребёнка и жену. Он будет бродить со своими друзьями в поисках убийцы и по пути своего следования убивать всяких мифических монстров которых в этой игре куча. Территории игры велики и за 1 час игру не пройти и это радует.\n\nГрафика представляет собой старый и всем знакомый RPG Maker который уже много лет держит свою марку и на ней делают игры. Музыкальное сопровождение так же на высоком уровне. Багов не было. Игра хорошо подготовлена к продаже и игре.\nРекомендую всем!", "timestamp_created": 1472911647, "timestamp_updated": 1472911654, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25325442": {"recommendationid": "25325442", "author": {"steamid": "76561198198657850", "num_games_owned": 1372, "num_reviews": 21, "playtime_forever": 214, "playtime_last_two_weeks": 0, "last_played": 1472914097}, "language": "english", "review": "Developers once again pleased with the new and extremely topical rpg.\nPlot of us says : On the common man who wants to avenge the murder of his wife and son .\nJust like eye pleasing graphics, very well prescribed dialogue and interesting characters .\nNormally I'm not a fan of games made ​​in the rpg maker, but this is the moment when the game really liked .", "timestamp_created": 1472910913, "timestamp_updated": 1472910913, "voted_up": true, "votes_up": 6, "votes_funny": 2, "weighted_vote_score": "0.480143", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25325423": {"recommendationid": "25325423", "author": {"steamid": "76561197977710903", "num_games_owned": 122, "num_reviews": 30, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1472915044}, "language": "finnish", "review": "Ja nii ettevõte Aldorlea Games on oma uue loomine rollimängu mis omakorda põhinev võidelda süsteemi, tehtud RPG maker , kus sa mängida, sest lihtsa inimese, põllumajandustootja nime Jerrat, mis jättis rahulikku elu huvides kättemaksu neile, kes tappis tema naise ja lapse. Ja vaata, ta võtab kätte labidas, mida siis vahetab kirves ja saadetakse otsima tapjate.\n\nMehaanika mänge praktiliselt ei erine teiste mängude selle firma, aga kui valik on väärt vahel eelmiste mängude ja uusi, värskeid kõik palju parem lihvitud ja lisada erinevaid kiipe.\nHea mäng on väärt veedetud aega.", "timestamp_created": 1472910837, "timestamp_updated": 1472910837, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25325142": {"recommendationid": "25325142", "author": {"steamid": "76561198063489584", "num_games_owned": 426, "num_reviews": 41, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1472916838}, "language": "finnish", "review": "Sankarillinen tarina!\nGerrit, oli yksinkertainen maanviljelijä, ei ritari, ei Jumala, vaan ihminen, jota ihmiset kutsuvat \"pikku ihmiset\". Mutta joskus maailma tarvitsee tavallisia ihmisiä, ja heidän toimintansa voi muuttaa hänen kohtalonsa.\nVoi Jerret saavuttaa tavoite ja ei menetä laatua, joka rakasti häntä hänen vaimonsa? Liity seikkailu, jossa kohtalo yksi henkilö on kohtalo koko ihmistä.\nMeidän täytyy voittaa pahan! Valtava viheralueet tekevät kulkee peli kauemmin kuin 1 tuntia.\nGrafiikka on piirretty hyvin, kaikki kirjan RPG Maker, ja kaikki on OK! Musiikin alkuperäinen! Ei huomannut virheen.\nArvosana 8 ulos 10 hyvää työtä.", "timestamp_created": 1472909912, "timestamp_updated": 1472909912, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.540230", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25324573": {"recommendationid": "25324573", "author": {"steamid": "76561198140908266", "num_games_owned": 1365, "num_reviews": 109, "playtime_forever": 37, "playtime_last_two_weeks": 0, "last_played": 1472904635}, "language": "russian", "review": "The Tale of a Common Man - неплохая RPG созданная на движке RPG Maker. В игре вам предстоит поучаствовать в роли обыкновенного человека у которого всего одна цель, отомстить за убийства его жены и сына. Сможет ли он достигнуть своей цели, при этом оставаясь человеком? Игра порадует вас хорошим сюжетом и отличной графикой. Также радует наличие коллекционных карточек и ачивок.\nПлюсы:\n+Графика\n+Сюжет \n+Коллекционные карточки\n+Ачивки\nМинусы:\n-Цена\n\nИгра на любителя, рекомендую брать по скидке.", "timestamp_created": 1472907749, "timestamp_updated": 1472907749, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497685", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25324045": {"recommendationid": "25324045", "author": {"steamid": "76561198114294778", "num_games_owned": 4517, "num_reviews": 78, "playtime_forever": 220, "playtime_last_two_weeks": 0, "last_played": 1472901746}, "language": "russian", "review": " The Tale of a Common Man - ролевая игра с пошаговой системой боя, выполненная в RPG-maker от  Aldorlea Games, в которой вы сыграете за простого человека, фермера по имени Jerrat, который оставил мирную жизнь ради мести тем, кто убил его жену и ребенка. И вот он берет в руки лопату (которую затем сменит топор) и отправляется живьем закапывать своих обидчиков.\n\nПлюсы игры:\n+ хороший сюжет\n+ есть возможность вручную распределять пункты характеристик как вам угодно\n+ несколько уровней сложности\n+ система вознаграждения очками характеристик при выполнении дополнительных заданий и различные секретные комнаты\n+ коллекционные карточки и достижения\n\nМинусы игры:\n- отсутствие русского языка (рекоммендуется хотя бы базовое знание английского языка)\n\nИгру рекоммендую всем любителям ролевых игр с пошаговыми боями и любителям ролевых инди-игр с хорошим сюжетом, мне лично игра понравилась.", "timestamp_created": 1472906133, "timestamp_updated": 1472906133, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.614476", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25323111": {"recommendationid": "25323111", "author": {"steamid": "76561197991299964", "num_games_owned": 647, "num_reviews": 5, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1472902527}, "language": "russian", "review": "The Tale of a Common Man-игра для любителей 16-ти битных игр, те кто еще любят ностальгировать о старых игр, очень хорошо нарисована графика, и как всегда много приключений, побочных квестов, и секретных местечек которые надо отыскать)", "timestamp_created": 1472902734, "timestamp_updated": 1472902734, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25322984": {"recommendationid": "25322984", "author": {"steamid": "76561198081592920", "num_games_owned": 645, "num_reviews": 5, "playtime_forever": 184, "playtime_last_two_weeks": 0, "last_played": 1472900928}, "language": "russian", "review": "The Tale of a Common Man-само название игры говорит что это история о самом обычном человеке) который попадет в приключения, но его качества обычного человека помогут ему преодолеть все трудности!) ведь каждый может стать героем) приятное музыкальное сопровождение, красиво нарисованные локации)", "timestamp_created": 1472902326, "timestamp_updated": 1472902326, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25322767": {"recommendationid": "25322767", "author": {"steamid": "76561198288955104", "num_games_owned": 696, "num_reviews": 8, "playtime_forever": 212, "playtime_last_two_weeks": 0, "last_played": 1472902581}, "language": "russian", "review": "очередная игра в формате 16 бит, для своих 16 бит выглядит весьма не плохо, игра очень вам понравиться если вы любите рпг, и любите игры в стиле ретро!)  по название уже понятно что игра посвящена приключениям самого обычного человека!) точнее обычного крестьянина, в путь к новым приключениям которые изменят судьбу!)", "timestamp_created": 1472901538, "timestamp_updated": 1472906628, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25322725": {"recommendationid": "25322725", "author": {"steamid": "76561198189658639", "num_games_owned": 781, "num_reviews": 10, "playtime_forever": 215, "playtime_last_two_weeks": 0, "last_played": 1472902713}, "language": "russian", "review": "The Tale of a Common Man-ролевая игра об обычном крестьянине, котором придется изменить судьбу целого народа! игра красиво нарисована, приятная озвучка озвучка) самое интересное что есть побочные квесты, и секретные помещения так что придется их поискать)", "timestamp_created": 1472901306, "timestamp_updated": 1472901306, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25322619": {"recommendationid": "25322619", "author": {"steamid": "76561198315742665", "num_games_owned": 460, "num_reviews": 188, "playtime_forever": 323, "playtime_last_two_weeks": 0, "last_played": 1472909106}, "language": "finnish", "review": "Jerrat oli lihtne põllumees, ei rüütel, ei lord, vaid tavalise inimesega, keda rahvasuus nimetatakse \"väikeste inimestega\". Kuid mõnikord maailmas on vajalikud kvaliteedi tavalised inimesed ja nende teod võivad muuta tema saatust.\nKas Jerrat saavutada eesmärki ja ei kaota kvaliteedi, kes armastas teda tema naine? Liitu seiklus, kus saatus on ühe mehe muutub saatus on kogu rahva.\nSüžee on üsna lihtne, me oleme sõbrad läheme võitlema kurjaga mis terroriseeris meie maa. Me peame läbima tohutu territooriumi ja võidelda müütilise olendi koletised.\n\nGraafika on juba standard, mis piiskopimantel teisi mänge mis on tehtud RPG Maker's tuhmiks lilled. Nii sama meeldib, on see et mängus on teatraalsusega stiilis anime. Muusika on hea 5+ sama hea esituse mõju.\nHindamine: 8.5/10 Aitäh autorile mis hoiavad meid rõõmustab mänge.\n", "timestamp_created": 1472900798, "timestamp_updated": 1472900798, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.515303", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25322474": {"recommendationid": "25322474", "author": {"steamid": "76561198228638448", "num_games_owned": 791, "num_reviews": 64, "playtime_forever": 198, "playtime_last_two_weeks": 0, "last_played": 1472912298}, "language": "english", "review": "The Tale of a Common Man - a new game made in the tradition of RPG Maker`a, in 16-bit style.\nYou have to play for an ordinary person to plunge into his adventures.\n\n+ Seven characters and one extra.\n+ The five characters in the game will provide strategic depth gameplay.\n+ The ability to move in eight directions using the mouse and keyboard.\n+ The title screen will change with each character found.\n+ 17 side quests.\n+ 30 secret rooms.\n+ Over thirty hours of exciting gameplay.\n+ Creating recipes for potions.\n+ Notable enemies, beautiful surroundings and charming music.", "timestamp_created": 1472900327, "timestamp_updated": 1472900327, "voted_up": true, "votes_up": 8, "votes_funny": 2, "weighted_vote_score": "0.499090", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25322099": {"recommendationid": "25322099", "author": {"steamid": "76561198116032731", "num_games_owned": 1372, "num_reviews": 32, "playtime_forever": 121, "playtime_last_two_weeks": 0, "last_played": 1472897049}, "language": "english", "review": "The Tale of a Common Man-a game in 16-bit format, is very well drawn chart, in the story, you the average person, the most that neither is ordinary) the ordinary farmer, whether he entrusted to him the mission. Find out the story of an ordinary farmer, who changed the fate of an entire people!", "timestamp_created": 1472898728, "timestamp_updated": 1472898728, "voted_up": true, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.483874", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25321835": {"recommendationid": "25321835", "author": {"steamid": "76561198128201856", "num_games_owned": 1198, "num_reviews": 104, "playtime_forever": 147, "playtime_last_two_weeks": 0, "last_played": 1472916263}, "language": "russian", "review": "Разработчики вновь порадовали новой и интересной rpg.\nCюжет нам рассказывает: О простом человеке который хочет отомстить за жестокие убийства его жены и сына. Сможет ли он достичь своей цели, не переставая быть человеком, это вы узнайте в этой 16bit игре.\nТак же порадовала приятная глазу графика, смогли заинтересовать хорошо прописанные диалоги, и интересные персонажи.\nОбычно я не любитель игр сделанных на rpg maker, но мне действительно понравилась.\nP.S Если вы фанат этого жанра, тогда определенно стоит брать!", "timestamp_created": 1472897592, "timestamp_updated": 1472897613, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.496241", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25321487": {"recommendationid": "25321487", "author": {"steamid": "76561198110829497", "num_games_owned": 2753, "num_reviews": 300, "playtime_forever": 114, "playtime_last_two_weeks": 0, "last_played": 1472902708}, "language": "english", "review": "New RPG game from a studio that seems to be making only rpg games - and they are getting better and better with time. This time we even have a difficulty selection - and i've never met this feature before in RPG games. Tale of a common man is a story about a usual \"little man\" that tries to change a life of a whole nation, this is about a place of a person in history, this is about moral principles and values.", "timestamp_created": 1472896122, "timestamp_updated": 1472896122, "voted_up": true, "votes_up": 8, "votes_funny": 4, "weighted_vote_score": "0.475578", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25320744": {"recommendationid": "25320744", "author": {"steamid": "76561198016096893", "num_games_owned": 6803, "num_reviews": 1069, "playtime_forever": 152, "playtime_last_two_weeks": 0, "last_played": 1472892129}, "language": "russian", "review": "Новый хит от студии Aldorlea Games, авторов многих прекрасных RPG, созданных на движке RPG Maker!\n\nДжеррат был простым фермером, не рыцарем, и не лордом, а обычным человеком, которых в народе называют «маленькими людьми». Но иногда миру необходимы качества обычных людей, а их поступки могут изменить его судьбу.\nСможет ли Джеррат достигнуть цели и не потерять качества, которые любила в нём его жена? Присоединитесь к приключению, в котором судьба одного человека станет судьбой целого народа.\n\nУзнайте историю обычного фермера, который изменил судьбу целого народа!\n\nЧто нас ждет в игре:\n• Семь персонажей и один дополнительный.\n• Пять персонажей в партии обеспечат тактическую глубину игрового процесса.\n• Возможность перемещаться в восьми направлениях при помощи мыши и клавиатуры.\n• Заглавный экран будет меняться с каждым найденным персонажем.\n• 17 побочных заданий.\n• 30 секретных помещений.\n• Более тридцати часов увлекательного игрового процесса.\n• Создание зелий по рецептам.\n• Запоминающиеся враги, красивое окружение и чарующая музыка.", "timestamp_created": 1472892664, "timestamp_updated": 1472892664, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.454508", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319812": {"recommendationid": "25319812", "author": {"steamid": "76561198039093338", "num_games_owned": 2070, "num_reviews": 23, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1473105814}, "language": "english", "review": "I've absolutely fallen in love with Aldorlea developed games, they scratch that itch for turn based JRPG's I've had since the playstation 2 stopped being supported.\nGood story, \nInteresting characters,\nController/achievement/trading card support +++\nincreasing challenge as the game progresses", "timestamp_created": 1472888441, "timestamp_updated": 1472888441, "voted_up": true, "votes_up": 31, "votes_funny": 2, "weighted_vote_score": "0.647017", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319794": {"recommendationid": "25319794", "author": {"steamid": "76561198024768130", "num_games_owned": 47, "num_reviews": 6, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1472892492}, "language": "russian", "review": "Good drawing enemies and properly chosen location betray their distinctive ability to play", "timestamp_created": 1472888366, "timestamp_updated": 1472888366, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319782": {"recommendationid": "25319782", "author": {"steamid": "76561198101725102", "num_games_owned": 21, "num_reviews": 2, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1472892485}, "language": "russian", "review": "В игре можно создавать свои зелья с помощью рецептов, а это значит что можно попросить автора создать\nещё одну игру!)", "timestamp_created": 1472888341, "timestamp_updated": 1472888341, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319778": {"recommendationid": "25319778", "author": {"steamid": "76561198145350319", "num_games_owned": 94, "num_reviews": 7, "playtime_forever": 181, "playtime_last_two_weeks": 0, "last_played": 1472890679}, "language": "russian", "review": "Красивые локации с интересными диалогами и стандартной боевой системой в подобного жанра игр", "timestamp_created": 1472888325, "timestamp_updated": 1472888325, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319773": {"recommendationid": "25319773", "author": {"steamid": "76561198029183055", "num_games_owned": 32, "num_reviews": 4, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1472892485}, "language": "russian", "review": "Кроме как просто поиграть в игру вы можете получить карты, а так же 12 достижений, а это \nувеличит пребывание в игре ещё не на много)", "timestamp_created": 1472888307, "timestamp_updated": 1472888307, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319765": {"recommendationid": "25319765", "author": {"steamid": "76561198089356224", "num_games_owned": 64, "num_reviews": 4, "playtime_forever": 181, "playtime_last_two_weeks": 0, "last_played": 1472890682}, "language": "russian", "review": "В подобных играх уже появился свой стандарт, и игра соответствует ему, правда цена всё завышена", "timestamp_created": 1472888286, "timestamp_updated": 1472888286, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319758": {"recommendationid": "25319758", "author": {"steamid": "76561198126015943", "num_games_owned": 53, "num_reviews": 6, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1472892446}, "language": "russian", "review": "I wanted a new story? So this game is for you", "timestamp_created": 1472888265, "timestamp_updated": 1472888265, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319748": {"recommendationid": "25319748", "author": {"steamid": "76561198107936558", "num_games_owned": 27, "num_reviews": 1, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1472892476}, "language": "russian", "review": "Why the game is bad? no! it is not bad, and is made in the normal course of the game made in the RPG maker", "timestamp_created": 1472888235, "timestamp_updated": 1472888235, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319693": {"recommendationid": "25319693", "author": {"steamid": "76561198067119595", "num_games_owned": 1033, "num_reviews": 51, "playtime_forever": 144, "playtime_last_two_weeks": 0, "last_played": 1493363999}, "language": "english", "review": "From Aldorlea comes this game that has everything fans of the 16 bit style RPGs could ask for.\n\n- A great story that draws you in immediately with an early terrible event that sets everything in motion ---- the murder of a \"common\" farmer's (Jerrat) family that sets him on a course of revenge that will take him on a long journey of discovery and adventure. Aldorlea always gives us great storytelling, and this one is exceptional.\n- Excellent artwork that completely matches the events that are taking place.\n- Beautiful music that supports the game without being intrusive.\n- Characters that are likeable and believable.\n- Game mechanics and controls that are flawless.\n- Custom features that add to the game play and are easy to understand.\n- Battle scenes that have depth and don't get boring.\n\nA lot of of thought and care is evident in this well crafted game from all the above mentioned to the variety it offers (difficulty level, visible/invisible enemies, secrets, side quests, etc.) to the quick level of addiction you will experience here.\n\nSo much to like about this game ---- I would give this beautifully made RPG my highest recommendation, and it's on sale. Don't overlook or pass this one by. Get it now, and see what is in store for Jarret, Aayden, Eloabeth, and the others in the world of Kelagan. Great game.\n\n\n", "timestamp_created": 1472887925, "timestamp_updated": 1472887925, "voted_up": true, "votes_up": 17, "votes_funny": 3, "weighted_vote_score": "0.557721", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319657": {"recommendationid": "25319657", "author": {"steamid": "76561198075952331", "num_games_owned": 918, "num_reviews": 114, "playtime_forever": 219, "playtime_last_two_weeks": 0, "last_played": 1473246793}, "language": "russian", "review": "The tale of a Common man - ролевая игра повествующая о приключниях совершенно обычного человека.\nИнтересная рисовка, нормальное качество звука, детально проработанные персонажи, классные строки диалогов, \nадекватная цена - вот главное качество The Tale of a Common Man.Вполне себе годная игра на 30 часов геймплея.\nРекомендую к покупке!\n", "timestamp_created": 1472887695, "timestamp_updated": 1472887695, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.483169", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319551": {"recommendationid": "25319551", "author": {"steamid": "76561198010506539", "num_games_owned": 74, "num_reviews": 6, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1472892453}, "language": "russian", "review": "И снова 16-ти битная рпг от издателей АЛДОРЕА, побродите по интересным локациям и погрузитесь\nв этот приключенченский мир", "timestamp_created": 1472887200, "timestamp_updated": 1472887200, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "4.975124", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319540": {"recommendationid": "25319540", "author": {"steamid": "76561198058485350", "num_games_owned": 57, "num_reviews": 7, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1472892469}, "language": "russian", "review": "interesting game with an interesting plot, made in the setting of a standard for this genre of games", "timestamp_created": 1472887142, "timestamp_updated": 1472887142, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319527": {"recommendationid": "25319527", "author": {"steamid": "76561198041461612", "num_games_owned": 66, "num_reviews": 7, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1472892453}, "language": "russian", "review": "\nРазнообразия комнат, а так же секретных комнат хватает. Локации сделаны совесть, если бы не 16-ти\nбитность, то актёры выглядели лучше", "timestamp_created": 1472887096, "timestamp_updated": 1472887096, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319521": {"recommendationid": "25319521", "author": {"steamid": "76561198039717858", "num_games_owned": 74, "num_reviews": 10, "playtime_forever": 181, "playtime_last_two_weeks": 0, "last_played": 1472890669}, "language": "russian", "review": "2d adventure game, in which there is a lot of interesting events", "timestamp_created": 1472887060, "timestamp_updated": 1472887060, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319442": {"recommendationid": "25319442", "author": {"steamid": "76561198133304819", "num_games_owned": 26, "num_reviews": 4, "playtime_forever": 104, "playtime_last_two_weeks": 0, "last_played": 1472898572}, "language": "russian", "review": "like pexels and hardcore rpg.like this game,realy awesome", "timestamp_created": 1472886618, "timestamp_updated": 1472886618, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.520000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319434": {"recommendationid": "25319434", "author": {"steamid": "76561198005899521", "num_games_owned": 128, "num_reviews": 10, "playtime_forever": 95, "playtime_last_two_weeks": 0, "last_played": 1472890100}, "language": "russian", "review": "Великолепная и интересная игра!Главный герой - отлично проработаный персонаж!Плавное повествование истории,от говна до \"топора\" - не оставит равнодушным никого!\n10\\10", "timestamp_created": 1472886574, "timestamp_updated": 1473063804, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.520000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319062": {"recommendationid": "25319062", "author": {"steamid": "76561198030239235", "num_games_owned": 13, "num_reviews": 12, "playtime_forever": 90, "playtime_last_two_weeks": 0, "last_played": 1472886317}, "language": "russian", "review": "очередная хорошая хардкорная игра от алдории.сюжет-весчь!да и играть интересно", "timestamp_created": 1472884227, "timestamp_updated": 1472884227, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.495095", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319053": {"recommendationid": "25319053", "author": {"steamid": "76561197965963547", "num_games_owned": 24, "num_reviews": 12, "playtime_forever": 189, "playtime_last_two_weeks": 0, "last_played": 1472892276}, "language": "russian", "review": "Великолепная игра про то,как псан к успеху шел и фортануло\nрисовка на высоте!Персонажи тоже не покачали!10\\10!", "timestamp_created": 1472884183, "timestamp_updated": 1473062688, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.499888", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319045": {"recommendationid": "25319045", "author": {"steamid": "76561198155571812", "num_games_owned": 25, "num_reviews": 12, "playtime_forever": 972, "playtime_last_two_weeks": 0, "last_played": 1472939226}, "language": "russian", "review": "Отличная игра,отличный стиль игры!История просто блеск,рисовка очень хорошая!Великолепная игра!", "timestamp_created": 1472884148, "timestamp_updated": 1473063411, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.499888", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319034": {"recommendationid": "25319034", "author": {"steamid": "76561198075907166", "num_games_owned": 16, "num_reviews": 10, "playtime_forever": 184, "playtime_last_two_weeks": 0, "last_played": 1472891978}, "language": "russian", "review": "Сторилайн - хоть и банален,но подогревает интерес!\nхорошая рисовка\nмузыка на высоте\nатмосфера тут чувствуется - в общем хорошая рпг на рпг мейкере\nсмущает только цена", "timestamp_created": 1472884094, "timestamp_updated": 1473063933, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.496901", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319026": {"recommendationid": "25319026", "author": {"steamid": "76561198068998038", "num_games_owned": 71, "num_reviews": 10, "playtime_forever": 95, "playtime_last_two_weeks": 0, "last_played": 1472886818}, "language": "russian", "review": "10\\10\nпросто \n10\\10\nсюжет - просто,но как он подается!\nпиксельная рисовка - очень крутая\nглавный герой - хорошо проработаный перс\nдиалоги - все на высоте\n10\\10", "timestamp_created": 1472884060, "timestamp_updated": 1473064986, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.499888", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319016": {"recommendationid": "25319016", "author": {"steamid": "76561198029992642", "num_games_owned": 14, "num_reviews": 10, "playtime_forever": 183, "playtime_last_two_weeks": 0, "last_played": 1472891964}, "language": "russian", "review": "хороша игра,даже очень.ожидал меньшего - получил большее\nотличная рисовка,мягкая с кучей деталей,хороший сторилайн.\nв общем рекомендую", "timestamp_created": 1472883991, "timestamp_updated": 1472974786, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.499888", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319009": {"recommendationid": "25319009", "author": {"steamid": "76561197992469679", "num_games_owned": 44, "num_reviews": 10, "playtime_forever": 95, "playtime_last_two_weeks": 0, "last_played": 1472886678}, "language": "russian", "review": "Отличная игра!прекрасная работа над сюжетом,персонаж джарета заставляет проникнуться.\nв общем хорошая игра на рпг мейкере.", "timestamp_created": 1472883958, "timestamp_updated": 1472975893, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.499638", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25319003": {"recommendationid": "25319003", "author": {"steamid": "76561198013989436", "num_games_owned": 74, "num_reviews": 12, "playtime_forever": 188, "playtime_last_two_weeks": 0, "last_played": 1472892261}, "language": "russian", "review": "sweet game,jared is awesome!music is great.like that", "timestamp_created": 1472883927, "timestamp_updated": 1472975517, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.495095", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25318998": {"recommendationid": "25318998", "author": {"steamid": "76561198058560799", "num_games_owned": 13, "num_reviews": 9, "playtime_forever": 95, "playtime_last_two_weeks": 0, "last_played": 1472886686}, "language": "russian", "review": "Великолепная игра про фермера,который смог\nхорошая 16 бит графика,отличный геймплей\nприятная музка - все на высоте", "timestamp_created": 1472883911, "timestamp_updated": 1473068946, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.452616", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25318995": {"recommendationid": "25318995", "author": {"steamid": "76561197966143275", "num_games_owned": 22, "num_reviews": 10, "playtime_forever": 213, "playtime_last_two_weeks": 0, "last_played": 1472893763}, "language": "russian", "review": "Очередная годнота от алдории!\nтут вам и колхозник-супермен,спасающий все и вся\nи хорошая музыка\nи прекрасная рисовка(не как в большенстве инди рпг говна,в которое я играл)\nВ общем пройти и насладится - вполне достаточно\nцена конечно не радует - но бл*ть кризис там,все дела", "timestamp_created": 1472883883, "timestamp_updated": 1472976030, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.499888", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25318989": {"recommendationid": "25318989", "author": {"steamid": "76561198018420592", "num_games_owned": 75, "num_reviews": 10, "playtime_forever": 182, "playtime_last_two_weeks": 0, "last_played": 1472891948}, "language": "russian", "review": "обожаю пиксельные рпг от алдории,и вот появляется это\nс незамысловатым,но эффектным сюжетом(хотя баян бабаян)\nприятной графикой со странной палитрой\nкачественными диалогами\nв общем 10\\10,мне нравится", "timestamp_created": 1472883862, "timestamp_updated": 1473070138, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25318983": {"recommendationid": "25318983", "author": {"steamid": "76561197983162942", "num_games_owned": 16, "num_reviews": 12, "playtime_forever": 187, "playtime_last_two_weeks": 0, "last_played": 1472892240}, "language": "russian", "review": "rasta says yes to this game", "timestamp_created": 1472883825, "timestamp_updated": 1472883825, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25318978": {"recommendationid": "25318978", "author": {"steamid": "76561198075157915", "num_games_owned": 63, "num_reviews": 11, "playtime_forever": 215, "playtime_last_two_weeks": 0, "last_played": 1472894089}, "language": "russian", "review": "Аллах любит харкорные инди рпг!История о моххамеде,который уверовал,бросил свою ферму и пошел убивать неверных.Он все таки дорвался в рай до гуррий,иншаллах!\n+пиксельная графика не перегружает наши древние ноутбуки в горах ИНШАЛЛАХ!\n+музыка не выдает наши позиции\n\n- в диалогах нет ответа \"Аллаху акбар\" или \"умри кяфир!\"ЭТО НЕЧЕСТНО!\n- за 250 рублей я могу купить патронов,чтоб убивать неверных", "timestamp_created": 1472883797, "timestamp_updated": 1472978267, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25318964": {"recommendationid": "25318964", "author": {"steamid": "76561198070110818", "num_games_owned": 24, "num_reviews": 9, "playtime_forever": 182, "playtime_last_two_weeks": 0, "last_played": 1472891938}, "language": "russian", "review": "coool game.i think best of aldorea!\n+nice music\n+nice jared)))\n+great dialogs(realy awesome)\n\n- coast", "timestamp_created": 1472883695, "timestamp_updated": 1472977054, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.499638", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25318959": {"recommendationid": "25318959", "author": {"steamid": "76561197990949264", "num_games_owned": 17, "num_reviews": 10, "playtime_forever": 181, "playtime_last_two_weeks": 0, "last_played": 1472891920}, "language": "russian", "review": "эхх сема сема\nты наиграл больше всех-а тебя называют ботом всякие защеканы школьники..\n\nпо сабжу - игра хорошая,сюжет слабее,чем в герлфренд рескью - но все равно хорош\nигры все так же делаются на рпг мейкере,пикльарт-хороший,добротный.не на оть**бись.\nмузычка приятная,никаких БАГОВ я не наблюдал,руки у меня прямые.\nсчитаю что стоит своих денег,ибо время убивать на роботе с гoвнo писи - самое то,хоть интересно,в отличае от принцесс лутов и прочего индидepьма.\nв общем игра хорошая", "timestamp_created": 1472883662, "timestamp_updated": 1473074242, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.499638", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25318955": {"recommendationid": "25318955", "author": {"steamid": "76561198084670271", "num_games_owned": 11, "num_reviews": 8, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1472893723}, "language": "russian", "review": "ну,молодые люди,это вам не моровинд,но все же\nграфика,сюжет(банальный на мой взгляд),музыка,баги(была порочка незначительных и вылет) - все это игру не портит.цена высокая,но я был готов отдать за это свои бабки.приятно провел время", "timestamp_created": 1472883637, "timestamp_updated": 1472977505, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.499638", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25318949": {"recommendationid": "25318949", "author": {"steamid": "76561198070340660", "num_games_owned": 9, "num_reviews": 4, "playtime_forever": 216, "playtime_last_two_weeks": 0, "last_played": 1472894008}, "language": "russian", "review": "wonderfull game?like that!", "timestamp_created": 1472883599, "timestamp_updated": 1472883599, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25318944": {"recommendationid": "25318944", "author": {"steamid": "76561198032843963", "num_games_owned": 47, "num_reviews": 10, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1472893716}, "language": "russian", "review": "great interesting game.like dialogs.like nice pixel\nperson of jared is great(from farmer to hero)great job on rpg maker", "timestamp_created": 1472883564, "timestamp_updated": 1472977725, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25318933": {"recommendationid": "25318933", "author": {"steamid": "76561198042425442", "num_games_owned": 15, "num_reviews": 9, "playtime_forever": 216, "playtime_last_two_weeks": 0, "last_played": 1472894002}, "language": "russian", "review": "великолепная игра.убиватель времени компактный!\nхорошая инди игра с интересным,но простым сюжетом.ничего лишнего", "timestamp_created": 1472883506, "timestamp_updated": 1472977804, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.477369", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25318928": {"recommendationid": "25318928", "author": {"steamid": "76561198005044667", "num_games_owned": 272, "num_reviews": 22, "playtime_forever": 119, "playtime_last_two_weeks": 0, "last_played": 1472890350}, "language": "russian", "review": "великолепная игра от алдории,как всегда-харкорный геймплей,приятный пиксельный графоний,не режущий глаз,хорошая сторилайн.качественно", "timestamp_created": 1472883492, "timestamp_updated": 1472883492, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.436165", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25318842": {"recommendationid": "25318842", "author": {"steamid": "76561198121340122", "num_games_owned": 16, "num_reviews": 9, "playtime_forever": 215, "playtime_last_two_weeks": 0, "last_played": 1472893993}, "language": "russian", "review": "господи,как же я люблю обмазаться инди и дро*ить!о божеее!\nочередная стори про сельского петуха,который разрывая жопу бежит на встречу славе.баян баянистый\nотзыв положительный только по тому,что рисовка отличная и музло доставляет\n6дробь10", "timestamp_created": 1472882922, "timestamp_updated": 1472977916, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.499216", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25318837": {"recommendationid": "25318837", "author": {"steamid": "76561198172613990", "num_games_owned": 24, "num_reviews": 13, "playtime_forever": 198, "playtime_last_two_weeks": 0, "last_played": 1472892285}, "language": "russian", "review": "великолепная игра,10\\10.История про \"из грязи в князи\"\nрисовка - огонь", "timestamp_created": 1472882897, "timestamp_updated": 1473061728, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.490010", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39153547": {"recommendationid": "39153547", "author": {"steamid": "76561198055447382", "num_games_owned": 136, "num_reviews": 6, "playtime_forever": 2852, "playtime_last_two_weeks": 208, "last_played": 1515942981}, "language": "english", "review": "Just finished Tale Of A Common Man some 47 hours later. This game does not let you down. Artwork excellent, involvement total. Characters true to life. Steam achievements. Enough main characters as the game progresses to chop and change who will be in your party (did I say characters).\n\nA most unlikely set of adventures each with their own priorities brought together. It worked for me. However, it certainly made me think about the out-come. The developers I feel got it right.\n\nFor me I would have liked to have seen more of the 3D adventures in game rather than waiting till the end. That said, an excellent idea to give you a run down on how each of your party faired in and out of battle... Nice... No spoilers. If you enjoy RPG's I would certainly recommend giving it a try.", "timestamp_created": 1515335694, "timestamp_updated": 1515335694, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}}
