{"reviews": {"39099589": {"recommendationid": "39099589", "author": {"steamid": "76561198013983371", "num_games_owned": 181, "num_reviews": 2, "playtime_forever": 280, "playtime_last_two_weeks": 49, "last_played": 1515198427}, "language": "english", "review": "One Small Fire At A Time is a really moving story about mental illnesses and also about  Girl, who can't use magic in a world where nearly everyone can use magic. The game can be played without playing an Octave Higher, but I recommend playing both as they are moving stories.", "timestamp_created": 1515192968, "timestamp_updated": 1515192968, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38572896": {"recommendationid": "38572896", "author": {"steamid": "76561198011762763", "num_games_owned": 553, "num_reviews": 14, "playtime_forever": 619, "playtime_last_two_weeks": 0, "last_played": 1514027373}, "language": "english", "review": "I hadn't realized how much I missed the world of Overture until I played this game.  The writing is as snappy and charming as the writing in An Octave Higher.  Some paths have a bit of comedy in them, and some have thoughtful dialogue about mental illness and despair.  Pretty much all the paths are emotionally wrenching, even brutal.   \n\nThere are not a *lot* of choices to make (perhaps 8-12?) but that's all right: the writing and characters carry the piece.\n\nI recommend it to anyone who enjoyed An Octave Higher.", "timestamp_created": 1514027653, "timestamp_updated": 1514027653, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38179223": {"recommendationid": "38179223", "author": {"steamid": "76561198114742602", "num_games_owned": 652, "num_reviews": 46, "playtime_forever": 3000, "playtime_last_two_weeks": 0, "last_played": 1512884104}, "language": "schinese", "review": "One Small Fire At A Time\n\nAn Octave Higher的正统前传[spoiler]同样的细思极恐[/spoiler]\n比前作更加沧海遗珠的命运。\n说真的，这个系列比大作系列一点都不差的\n可惜就是不火\n\n\n\n本作以An Octave Higher中的女龙骑兵队长为角色展开\n当然和前作比的话，剧情要短一些，剧情也相对简单一些\n不过深度依然不减少\n本座和前作中有共同的人物至少是4个\n女主，幼年时期的女队长\n教授\n领主\n还有那个当时还是教授助理的alise的妈妈，在后作中成了女心理医生的那个\n还有一个drake，印象里好像也是前作的抵抗运动的领袖吧？前作太久了有点记不清了\n\n一贯的世界观，非常吸引人\n具体不太剧透了，但是应该说和前作联系紧密\n\n女队长为什么成了龙骑兵队长，她那有点神经病的个性是怎么来的？\n领主的生意是怎么搞起来的\n教授的早期研究\n前作中有才华的魔法理论专业女助理为什么选择了做心理学医生\n\n最最关键的是\n\n围绕魔法，以及魔法来源的那个神秘的魔法药剂背后的政治，经济，社会因素\n\n\n上一次的作品讨论的是围绕魔法的社会宏观因素\n为什么会通过那个法案“剥夺”了普通人购买魔药的能力，这背后的社会因素，经济因素，海外殖民策略等等\n本座讨论的范围比较小，但是背后牵扯出了一系列的问题\n比如为何人造药水是要被禁止的——这背后深刻的政治社会经济因素，甚至牵扯到国际形势\n比如是什么促使领主去思考控制药水的法案问题\n影响魔法的因素到底是什么\n\n\n甚至于一个相当大的伏笔——领主的儿子到底怎么来的\n难道是领主和本作中她的孩子？那为什么后作中她没有出现呢？这中间发生了什么\n\n还是有太多的问题没有解决\n\n\n玩游戏很多年了，各种架空类的世界观见过不少，但是本作这样小制作还能反映出深刻世界观的就很少见了\n\n尤其是不管是前作还是本作，很多问题的讨论并不是简单的摆个问题然后用中二思维来解释一遍\n游戏中人物的很多讨论是比较有深度的，我相信有一定文化基础的人应该能感觉出来\n比如本作中对于什么是精神病人这个概念的讨论\n很深入，很具体，而且相对比较专业\n院长用的是统计理论，试图用密度分布中的两侧尖端来说明既然一侧尖端不被认为有病，那么凭什么给另一侧就要被认为有病，这不公平\n然而后来的女医生用进化论反驳了这个观点：之所以人们偏向一侧的概率而不是另一侧概率，是因为这是自然进化的选择——那些偏向错误方向的物种恐怕都消失了，所以人类成了这个样子，因此对病人”原样保护“更有意义的是个人的“进化适应”\n这样的思考很多，而且用语比较专业，让人不觉得违和感太强，这和某些中二类架空游戏是不一样的\n\n\n包括经常出现的古典乐，相当符合游戏情调，而且对于我这种喜欢古典乐的人来说也是一种享受。这也从侧面反映出制作者的品味不低。用古典乐直接做背景音乐的，好像我印象里只有文明系列还有欧陆系列吧？可见作品本身的定位格调是什么，至少从世界观背景上说，我觉得剧情配合比较成功，能感觉到作品试图勾画出的那个大的时代背景\n\n\n\n\n作品最后，一切都完结了，大家通过讨论和回忆发现其实几个主要角色都有这样或那样的精神问题\n\n那么问题来了：你是精神病吗？\n\n\n本作的核心是，一个少女怎样从无到有获得了魔法，而重新融入了社会\n前作是社会发展到极度不均衡后，男主从有魔法到失去魔法，如何爆发暴动和起义，而最后男主号召人们重新回归没有魔法的生活\n\n这时候再想想作品中那段关于社会和少数精神问题的讨论\n社会在工业化大发展下，从小农经济的个体相对富足，演化到社会阶层极度分化大部分底层沦落为事实上的魔法贫困之后，女龙骑兵队长的所作所为，和她幼年时立下的志向还一样吗？她难道没有碰上她”精神父亲“前任队长的后尘？当年她要保护那些希望能带来低价药水的人们， 而在本作中她本人却成了追杀给人们带来低价药水的走私抵抗组织的龙骑兵队长，女队长被社会排斥，融入社会，成为上层精英，最终成为特权鹰犬的过程跃然纸上两部作品遥相呼应，精神上融为一体\n\n\n\n[spoiler]如果你能看到这里，就再多看一段话吧\n\n\n其实这个系列的作品讲述的根源是：当一个社会人们赖以生存的基本的需求被政府垄断并用各种高大上的名义加以征税并形成围绕这个东西的根深蒂固的利益格局的时候，社会会发生什么————你可以把魔法药水替换成任何人们生活所必须的东西（比如衣食住行），这样的专营制度发生在你身边的话是不是很可怕，那些为了能获得工作和生存必须的魔法药水努力工作结果一天下来工资全都被那点魔法药水”日供“榨干的”药水奴“，似曾相似么？[/spoiler]", "timestamp_created": 1512824058, "timestamp_updated": 1512826697, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35164447": {"recommendationid": "35164447", "author": {"steamid": "76561198151960279", "num_games_owned": 174, "num_reviews": 5, "playtime_forever": 200, "playtime_last_two_weeks": 0, "last_played": 1506207065}, "language": "english", "review": "The game is not bad, but I also would not consider it good.\n\nWhile the concept of its magic system remains to be interesting, there is still much to be desired. As \"meaningful\" as the game's social commentaries were, just like its predecessor An Octave Higher, they feel unnecessary and ultimately detract from the various characters' emotional journey. The mental patients discussion is just as excessive as the Libertads were in the previous game. In my opinion, the game's magic system is much more suitable for exploring individual issues: in this world, one's emotional strength directly translates to his/her magic proficiency/output; how a person is feeling much directly affects his/her action as well as the progression of the story.\n\nThe game may have been better if it had focused on the interactions among the characters. Give us more interaction between Woolf and Janis, or between Janis and Candela, or (insert names of any other two characters). The supposed emotional moments of the game would have worked much better with just a little more emotional build-up.\n\nIn conclusion, playing the game was not a bad experience; it really was not a great/memorable experience either.", "timestamp_created": 1506202430, "timestamp_updated": 1506202430, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.496689", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35006159": {"recommendationid": "35006159", "author": {"steamid": "76561198275630734", "num_games_owned": 130, "num_reviews": 11, "playtime_forever": 219, "playtime_last_two_weeks": 0, "last_played": 1469402499}, "language": "english", "review": "It's been a while since I sat through this VN, but I mentioned it in a review for Highway Blossoms, which I thoroughly enjoyed. And just like that, This. Was. Something.\n\nMaybe it was the beers playing me up on that day, but I felt a great sense of emotion when reading One Small Fire At A Time. A unique (and surprisingly chilling) story, focusing on a topic that entertainment properties are starting to look at a little more in recent memory (that of psychology and 'mental illness'), and then thrusting it into a world of steampunk(ish) fantasy. Very satisfying, and yet gut-punching at the same time.", "timestamp_created": 1505592767, "timestamp_updated": 1505592767, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34953157": {"recommendationid": "34953157", "author": {"steamid": "76561198086379607", "num_games_owned": 538, "num_reviews": 11, "playtime_forever": 210, "playtime_last_two_weeks": 0, "last_played": 1505407890}, "language": "spanish", "review": "Muy buen juego, muy similar al primero aunque bastante mas corto, con menos desiciones y finales alternativos; sigue valiendo la pena.", "timestamp_created": 1505409872, "timestamp_updated": 1505409872, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34106591": {"recommendationid": "34106591", "author": {"steamid": "76561198014420856", "num_games_owned": 66, "num_reviews": 82, "playtime_forever": 243, "playtime_last_two_weeks": 0, "last_played": 1502207472}, "language": "german", "review": "Das Prequel zu An One Octave Higher. Grundsätzlich kann man bedenkenlos zuschlagen, wenn man den ersten Teil mochte. Es wird aber von einem Erwartet, das man den Vorgägner gelesen hat. Die Erklärungen der Welt fallen deshalb komplett weg. Deshalb: Finger weg für jene die planen, die Geschichte chronologisch zu geniessen, es tut dem Universum nur schlechtes und es kann seine sogwirkung verlieren.\n\nPro:\n- Schönes Artwork, ich liebe einfach den Zeichnungsstil wie die Frauen gezeichnet werden. Traumhaft schön!\n- Ein Irrenhaus in einer Fantasygeschichte ohne Horror ist eine Seltenheit.\n- Mehr vom Universum\n\nContra:\n- Extrem linear, trotz Entscheidungsbaum\n- Entscheidungen beeinflussen bis auf das Ende relativ wenig", "timestamp_created": 1502208381, "timestamp_updated": 1502208381, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33904544": {"recommendationid": "33904544", "author": {"steamid": "76561198196704053", "num_games_owned": 74, "num_reviews": 19, "playtime_forever": 276, "playtime_last_two_weeks": 0, "last_played": 1501419792}, "language": "english", "review": "As usual, the developer has created another wonderful story set in Overture. A thinking man's story, intelligent and engaging, addressing sociopolitical issues in Overture. All very well thought out.", "timestamp_created": 1501420331, "timestamp_updated": 1501420331, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.496183", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33829708": {"recommendationid": "33829708", "author": {"steamid": "76561198069159152", "num_games_owned": 720, "num_reviews": 460, "playtime_forever": 803, "playtime_last_two_weeks": 0, "last_played": 1501153827}, "language": "english", "review": "This was an interesting read. The world is glorious, the characters fully-formed, and the tale was great, if sad in a few places. Still, I would recommend this to anyone wanting a good read.\n\nApparently, this is a prequel to another visual novel, which I will have to acquire and read. Also, there is at least one loopy achievement that can only be accessed after getting the \"True\" Ending.", "timestamp_created": 1501154029, "timestamp_updated": 1501154029, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33826822": {"recommendationid": "33826822", "author": {"steamid": "76561197990025041", "num_games_owned": 4315, "num_reviews": 31, "playtime_forever": 137, "playtime_last_two_weeks": 0, "last_played": 1501143127}, "language": "english", "review": "A short and sweet visual novel with a handful of choices and some surprises.  I'd definitely play 'An Octave Higher', to which it is a prequel, first, if only to get more details on the magic system and world.\n\nIt's obvious a lot of care went into it - small touches like musical leitmotifs, screen shaking, 'animations' (crude and rare, but appreciated) and so on make the story come to life.\n\nThe writing is good, and the characters memorable.\n\nAll in all, a fun way to spend a few hours. After this and 'Octave', I'm looking forward to seeing what this studio produces next.", "timestamp_created": 1501143536, "timestamp_updated": 1501143536, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32795940": {"recommendationid": "32795940", "author": {"steamid": "76561198130727834", "num_games_owned": 100, "num_reviews": 38, "playtime_forever": 254, "playtime_last_two_weeks": 0, "last_played": 1498441250}, "language": "english", "review": "This is a good read with multiple endings and a lot to think about.  The discussions of how society decides what is lunacy and madness get a bit long winded, but can cause you to really think about it.\n\nI picked it up on-sale, but I think it would be worth full price.  Even using fast-forward while doing alt endings, I still got over 4 hours of reading time from this.  I think it's worth that.\n\nAlso, there is no nudity, H, or any other adult content.  So, if you're looking for that. look elsewhere.", "timestamp_created": 1498441546, "timestamp_updated": 1498533964, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.522059", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32178109": {"recommendationid": "32178109", "author": {"steamid": "76561198041727167", "num_games_owned": 135, "num_reviews": 5, "playtime_forever": 530, "playtime_last_two_weeks": 0, "last_played": 1496844844}, "language": "schinese", "review": "大概是第一篇中文评论？\n\n这个游戏我是从groupees的包里得到的。\n\n这个游戏与An Octave Higher有着相同的背景，本作类似与于后者的前传。虽然我并没有玩过An Octave Higher，但从商店的宣传图片来看，相比于An Octave Higher，本作的人物立绘更生动细腻。音乐方面，这款游戏的音乐中穿插了原创音乐和经典的古典音乐。原创音乐质量尚可，但数量较少。某些悬疑的地方过早的播放令人紧张的音乐，使悬疑的效果大打折扣。印象中，使用经典的古典音乐的地方，都适度地渲染了游戏的氛围。然而不知道是何种原因，游戏中使用的古典音乐通常音质较差、失真的严重，例如钢琴。\n\n英文的话，感觉并不需要太高的英文水平。我的英文不是很好，阅读这个游戏需要配合词典，但总体来讲读起来不是很吃力。借用其他英文评论的话来说，游戏的文本的写作水平很好——这一点我是可以感受的到的，当我阅读的时候有一种想继续读下去的感觉。\n\n游戏中故事最后部分的发展缺乏逻辑。当故事中的冲突爆发的时候，某些角色的行动不合理，不符合角色自身的逻辑（有一种忽然智商缺乏了的感觉）。（当然，目前我只打出了一个结局，也许作者挖的坑有在其他地方补充。）", "timestamp_created": 1496588110, "timestamp_updated": 1496823346, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.554714", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32062038": {"recommendationid": "32062038", "author": {"steamid": "76561198100450261", "num_games_owned": 842, "num_reviews": 25, "playtime_forever": 429, "playtime_last_two_weeks": 0, "last_played": 1495723797}, "language": "tchinese", "review": "劇情轉折、氛圍、音樂等都相當優異\n關於正常與異常之間的思辨也出乎意外的有意思\n\n玩完之後才發現這是 An Octave Higher 的前傳\n沿用了部分的原聲帶\n再加上 The Dark Piano, Vol. 2 專輯的樂曲\n\n期待 An Octave Higher 也有相同高水準的劇情", "timestamp_created": 1496148706, "timestamp_updated": 1496148706, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31898982": {"recommendationid": "31898982", "author": {"steamid": "76561198042401885", "num_games_owned": 56, "num_reviews": 1, "playtime_forever": 292, "playtime_last_two_weeks": 0, "last_played": 1495447624}, "language": "english", "review": "Overall, One Small Fire At A Time is a pretty good prequel to An Octave Higher. While it lacks the length and depth of its predecessor, the artwork is definitely better.\nMy only problem with this visual novel is that you can reach the true ending quite easily. I did it on my first playthrough and I like to struggle a bit, get a few alternate ones (all preferably) beforehand.\nHaving read An Octave Higher is a plus but it's not essential. I would still recommend playing AOH first. It's a fascinating story that will make make you want to know more about Overture and its people. That's when One Small Fire At A Time comes in, as a nice cherry on the cake.", "timestamp_created": 1495450334, "timestamp_updated": 1495450334, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.505868", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31896274": {"recommendationid": "31896274", "author": {"steamid": "76561198128704797", "num_games_owned": 485, "num_reviews": 59, "playtime_forever": 636, "playtime_last_two_weeks": 0, "last_played": 1495430152}, "language": "english", "review": "One Small Fire at a Time is a visual novel that is the prequel to An Octave Higher.  Although it is helpful to have played An Octave Higher, as there are familiar characters in both VNs, it is not necessary to do so.  In One Small Fire at a Time, you play as Janis, a 13-year old girl who is considered \"mad\" because she has \"magic deficiency disorder.\"  As you can guess, that means that Janis can't use magic, which is very unusual since in the world where Janis is, Overture, magic casters are the norm and anyone who can't cast magic is abnormal.  As Janis copes with the hardships of her illness (mainly dealing with bullying), she crosses paths one day with Aiden Woolf, a dragoon commander who comes to Eclipse, the madhouse where Janis is living, and he is there on a mission to investigate the owners of Eclipse.  Although Eclipse looks like the usual madhouse whose inmates include those like Janis and anyone whose behavior doesn't conform to what society expects of them, there is more behind the madhouse and it is Woolf's mission (from the king) to find out what it is.  I won't reveal anything more story-wise but I'll point out that One Small Fire at a Time does have branching paths so you can get the true ending and alternate endings.\n\nNow to my thoughts on this VN.  ;)  I truly enjoyed An Octave Higher and I was very excited when this VN came out.  I had high expectations for it and I wasn't disappointed at all.  First, I love Janis as the main character.  For those familiar with An Octave Higher, Janis is a supporting character in it and in One Small Fire at a Time, we see Janis as she was before she became a dragoon commander and it was interesting to learn that she couldn't use magic.  I loved her personality and I couldn't help laughing at times at how she addressed others.  Also, the writing itself was great.  I found myself getting really involved in the story and although we do see events from Janis' point of view, we also see another side, as when Woolf, along with his companions Professor Poe and Joff Godwin, investigates what's going on at Eclipse and its owners.  The art style is like that in An Octave Higher and if you like it then, you'll like it here as well.  Also, I love the orchestral pieces that are played and I think they fit very well with the time period that the game takes place.  (Basically, think of the US slightly before the Industrial Period.)  \n\nOverall, I truly enjoyed playing One Small Fire at a Time and getting to learn about Janis' story.  It was great to see familiar characters as well as new characters.  If you liked An Octave Higher, I believe you'll love this one, too.  Also, I'll note that for those who know what the true ending is in An Octave Higher, you may be able to take a good guess as to what the true ending is in here, too.  ;)  Congrats to the devs for making another wonderful VN and I hope we'll get to see another VN in the world of Overture in the future.  ^^", "timestamp_created": 1495432385, "timestamp_updated": 1495432385, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.662523", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31870068": {"recommendationid": "31870068", "author": {"steamid": "76561198004496922", "num_games_owned": 1862, "num_reviews": 11, "playtime_forever": 298, "playtime_last_two_weeks": 0, "last_played": 1495317321}, "language": "english", "review": "A really good visual novel game with a pretty deep story. I should mention that it didn't have a lot of choices in it.", "timestamp_created": 1495317436, "timestamp_updated": 1495317436, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.496656", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30946701": {"recommendationid": "30946701", "author": {"steamid": "76561198067189801", "num_games_owned": 284, "num_reviews": 96, "playtime_forever": 443, "playtime_last_two_weeks": 0, "last_played": 1491325881}, "language": "english", "review": "Another awesome VN from Kidalang! I liked it so much, I went through the first playthrough (5 hours) in one sitting; couldn't stop reading. I do admit that I liked An Octave Higher a bit more, but this prequel was definitely a close second. While some have suggested otherwise, I do think the VN is more enjoyable if you've read An Octave HIgher first. An Octave Higher explains the magical system and gives an overall introduction to the world in these stories. Besides, it's more interesting to see Janis's backstory while knowing who she is in An Octave Higher. \n\nLike in An Octave Higher, this story was very thought-provoking and causes the reader to consider things about life. It particularly raises questions about the treatment of those with mental illnesses in society. As someone who suffers from depression/anxiety, I did relate quite a bit to some of the rhetoric used in the story. \n\nIdeas on the time lapse: (kinda spoiler-ish)\nBased on how young Janis is in this game and how old she looks in An Octave Higher, I suspected the time between the two is maybe about 10 years or so, but thinking about it, I've decided that can't be right. Joff (another character in An Octave Higher) hasn't married or had his son in this story, and since his son was a teenager in An Octave Higher, assuming he got married (maybe to [spoiler]Ena[/spoiler]) and his wife immediately got pregnant, then maybe the time between the stories is about 15 years. Perhaps a bit more. They might even state Joff's son's age at some point in An Octave Higher, but I can't recall since I played it quite a while ago. \n\nThe joke ending was, once again, quite amusing.\n\nI HIGHLY recommend this game (as well as An Octave Higher) to those who enjoy thought-provoking VNs.", "timestamp_created": 1491327355, "timestamp_updated": 1491327355, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.709756", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29547869": {"recommendationid": "29547869", "author": {"steamid": "76561198120250598", "num_games_owned": 236, "num_reviews": 2, "playtime_forever": 624, "playtime_last_two_weeks": 0, "last_played": 1485627259}, "language": "english", "review": "Well, that was unexpectedly Great. This VN has pretty unique art style, and the characters aren't that easy to read by the looks, as they may appear to be. The choice of the music fits the scenes almost perfectly, and the music itself never got me tired. The story is decent, a bit shorter that I expected. With some sharp turns, and a lot of things that are not what they were appeared to be. It's a madhouse, after all. I like that.", "timestamp_created": 1485629714, "timestamp_updated": 1485629714, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.505515", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28455637": {"recommendationid": "28455637", "author": {"steamid": "76561198025301635", "num_games_owned": 240, "num_reviews": 1, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1482093390}, "language": "english", "review": "One Small Fire At A Time is one of those games that turns into a pleasant surprise. It is well worth the asking price for the game. Definitely a game I would recommend.\n\nIt appears this game is a standalone prequel for An Octave Higher, which is something I'll be buying here shortly.", "timestamp_created": 1482094807, "timestamp_updated": 1482094994, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27458951": {"recommendationid": "27458951", "author": {"steamid": "76561198216669089", "num_games_owned": 113, "num_reviews": 3, "playtime_forever": 53, "playtime_last_two_weeks": 0, "last_played": 1481819320}, "language": "english", "review": "Great backstory.", "timestamp_created": 1480082392, "timestamp_updated": 1480082392, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.446717", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26828851": {"recommendationid": "26828851", "author": {"steamid": "76561198055288188", "num_games_owned": 138, "num_reviews": 5, "playtime_forever": 441, "playtime_last_two_weeks": 0, "last_played": 1476012167}, "language": "english", "review": "Where should I start....\n\nI really like this game, just as I liked previous part, which is \"An Octave Higher\". The story is set some time before \"Octave\", more or less 20-30 years. We see origins of some secondary characters, most notably Janis and Joff Godwin.\n\nAnyway, you have the story explained in the summary of the game, above reviews section, and I don't want you to read the same shit all over again. I'll just tell what you can expect. You can expect well balanced story, with humour, action, sad moments, plot twists, etc. There are also many long and smart conversations about various things (mostly psychology), so if you don't like it, then I don't recommend it to you.\n\nArt. Art is very impotant factor in Visual Novels. Often in low-budget games, such as this one, artstyle is very cheesy. Thankfully this isn't a case here, character sprites and backgrounds are detailed and just well done. There are also many CGs for more complex scenes, which is very good. \n\nMusic. I'm especially sensitive on this point, and to my satisfaction, this game has very good soundtrack, I couldn't hear any generic overused stock music (well, there were few classical pieces).\n\nOverall, this game is very good, even if bit short (Better than if it was too long, then it would be quite boring), and for fair price.", "timestamp_created": 1479930179, "timestamp_updated": 1479930179, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.565296", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26729681": {"recommendationid": "26729681", "author": {"steamid": "76561198300297476", "num_games_owned": 307, "num_reviews": 35, "playtime_forever": 218, "playtime_last_two_weeks": 0, "last_played": 1479728402}, "language": "english", "review": "This game ticked all the boxes for me. Interesting and developed setting, good characters, a gripping story and nice art. I loved the short chapters which made it easy to follow - a recent spell of depression has done a number on my concentration span, so the short chapters and clear-cut scenes were really nice.\n\nThere are lots of interesting ideas explored here, particularly about mental health. I'm always a little wary when I see something set in an asylum (as in countless horror games), but the creators had some really good observations about the nature of madness.\n\nThe setting was another plus. How magic would affect society was portrayed fairly realistically, at least to my mind, and I always love to see fantasy worlds where magic is used as another form of technology or science, rather than the standard swords, dragons and wizards set-up.\n\nAlthough there is a clear 'true end', there are a number of alternates. I really enjoyed seeing how the choices affected the story, for better or worse. I like that the 'true end' is not necessarily the happiest end for all the characters...\n\nOn to characters, another plus. Although it's short, I felt the characters were well-formed. I actually liked the protagonist, so kudos is due there as likeable protagonists seem to be few and far between. I found Aidan Woolf a little lacking though, which kind of throws a spanner in the works since he's a major character...I suppose the fact that he just explains his backstory maybe made him a little flat for me. My only other complaint was the propensity for death-bed scenes - a pet hate of mine.\n\nAll in all, I really enjoyed this visual novel. Do give it a read, it's well-worth it.", "timestamp_created": 1479729484, "timestamp_updated": 1479729484, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.469880", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24946782": {"recommendationid": "24946782", "author": {"steamid": "76561198114919414", "num_games_owned": 515, "num_reviews": 8, "playtime_forever": 301, "playtime_last_two_weeks": 0, "last_played": 1471316638}, "language": "english", "review": "Some things up front: \n1) This is a prequel to [url=http://store.steampowered.com/app/352780/] An Octave Higher[/url]. This game is playable as a standalone, but knowledge from the other will be helpful and will probably make it more enjoyable.\n2) This is a visual novel. There are choices, but otherwise there is no gameplay.\n3) Just like An Octave Higher, this has some mature themes. For example, sexual violence, mental illness, and suicide are discussed, sometimes at length.\n\nThe Good:\n1) Excellent writing. It manages to be both funny and disturbing as the situation calls for it. The story moves at a quick pace without being rushed. \n2) The music is similar to (and partly the same as) An Octave Higher. I personally think this is a good thing. Classical music mixed with thematic music for kinds of scenes and situations.\n3) Great art again, both backgrounds and characters. The styling is consistent so if you like the preview images, that is what you will get.\n4) Thematically very interesting. Just like in An Octave Higher, characters tend to wax philosophical at appropriate times. They wrestle with tough questions, and the reader is invited to think about it too. This time, the focus is on the nature of mental illness.\n\nThe Not So Good:\n1) Some of the humor was funny but took me out of the story. The references broke immersion in a couple spots. It turned out okay because I got back into it just fine, but that could annoy some people.\n2) The ending is a bit jarring. Some of the characters' actions didn't feel quite right. No spoilers here, but be aware that you may not really click with the ending.\n3) A bit short. I completed the full all routes in a litle over 4 hours. \n\nThe Verdict:\nI'd recommend giving this a read after An Octave Higher if you enjoyed that visual novel. I think An Octave Higher is a bit better (at least as a standalone game). If you liked An Octave Higher, I think you'll like this one too, especially if you find the discussion of mental illness compelling.", "timestamp_created": 1471316624, "timestamp_updated": 1471316624, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24480494": {"recommendationid": "24480494", "author": {"steamid": "76561198092251834", "num_games_owned": 34, "num_reviews": 4, "playtime_forever": 225, "playtime_last_two_weeks": 0, "last_played": 1469248946}, "language": "english", "review": "As shown in the Tags, this game is a 'Visual Novel' and an 'Indie' game. There may not be any battle mechanics, but the story is a rollercoaster from near start to near finish. A total of 10 choices are presented throughout the entire game giving you a chance to change the story little by little until you either stop short for an alternate ending, or experience the entire story until the correct one. I think that $10 would be too much for the short Novel, and maybe $7.00 would be more apropriate for the lenth. The problem I experience is going back to see the other endings because of how brutal the first playthrough was to my heart... But saying that wouldn't be a review... It would be more like a ramble of feelings and thaughts...", "timestamp_created": 1469284578, "timestamp_updated": 1469284578, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.520000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "24029067": {"recommendationid": "24029067", "author": {"steamid": "76561198291542531", "num_games_owned": 57, "num_reviews": 3, "playtime_forever": 380, "playtime_last_two_weeks": 0, "last_played": 1482004451}, "language": "french", "review": "Ce jeu, ou plutot cette BD interactive est géniale. Les dessins sont superbes, les musiques de fonds sont superbes, l'histoire est géniale et le concept est tres reposant. Seule défaut (si on peut appeler ça un défaut) est qu'il en en anglais. Bref je recommande ce jeu pour ceux qui aiment et les beaux graphismes et les bonnes BD et surtout se détendre.\n\nPS: J'ai finit le jeu et j'ai faillit chialer.\nPPS j'ai fait la vraie fin.", "timestamp_created": 1467496192, "timestamp_updated": 1467651416, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23982885": {"recommendationid": "23982885", "author": {"steamid": "76561198019839359", "num_games_owned": 81, "num_reviews": 15, "playtime_forever": 367, "playtime_last_two_weeks": 0, "last_played": 1467296551}, "language": "english", "review": "This story wasn't bad at all, I even cried at some parts, so while the title itself may not appeal to most, it still is a nice enough story.  :)   Definitely loved the emotion it brought, which is rare as most other titles don't make people like me feel like that.", "timestamp_created": 1467375105, "timestamp_updated": 1470135949, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.546041", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23902065": {"recommendationid": "23902065", "author": {"steamid": "76561198084387533", "num_games_owned": 80, "num_reviews": 4, "playtime_forever": 315, "playtime_last_two_weeks": 0, "last_played": 1467138765}, "language": "english", "review": "This is a short visula novel that takes place before the events in An Octave Higher. It's pretty short, only about 5 hours with 4 different endings. If you enjoed AOH then you'll like One Small Fire At a Time, though you can read this withough having read AOH.\n\nGood story, good music, good art. The developers clearly did their reasearch on mental illness for the story. If I had one complaint it would be that there are too many characters for such a short visual novel, so some of them feel kinda flat.", "timestamp_created": 1467139947, "timestamp_updated": 1467139947, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.544160", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23640110": {"recommendationid": "23640110", "author": {"steamid": "76561198060549938", "num_games_owned": 34, "num_reviews": 2, "playtime_forever": 1200, "playtime_last_two_weeks": 0, "last_played": 1466929555}, "language": "english", "review": "Very nice game with a great story. Great for kids", "timestamp_created": 1466285516, "timestamp_updated": 1466285516, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.346744", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23549685": {"recommendationid": "23549685", "author": {"steamid": "76561198247347122", "num_games_owned": 191, "num_reviews": 64, "playtime_forever": 1024, "playtime_last_two_weeks": 0, "last_played": 1465908911}, "language": "english", "review": "This VN is about the protagonist that lives in a madhouse because she can't use magic and a group of men trying to uncover some shady activity that the owners of the madhouse might be involved in.\nIt has a true ending which lines up the protagonist's life before An Octave Higher happens and 3 alternative endings that could have happened depending on your choices in the story.\n\nYou can play this even if you haven't played An Octave Higher and only miss a couple of technical details about the world but not the story.\n\nIt was nice to see more of Joff's and Poe's character here to give perspective on their characters in the main game.\nAll in all I like this game :3", "timestamp_created": 1465898291, "timestamp_updated": 1465898291, "voted_up": true, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.689507", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23541326": {"recommendationid": "23541326", "author": {"steamid": "76561198060469890", "num_games_owned": 191, "num_reviews": 15, "playtime_forever": 327, "playtime_last_two_weeks": 0, "last_played": 1510774925}, "language": "english", "review": "OK, so I'd be writing a fairly well-written review, but I was too busy laughing at some of the dialogue, until the ending which... well... To quote Hannibal Chau, \"Holy jeez.\" Though it does provide a very good explanation to how the no-nonsense commander of the Dragoon unit in An Octave Higher got where she was (You might wanna go check that out first. Or second. That's the charm of it).", "timestamp_created": 1465845359, "timestamp_updated": 1465845359, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.435979", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23518893": {"recommendationid": "23518893", "author": {"steamid": "76561198067716202", "num_games_owned": 261, "num_reviews": 5, "playtime_forever": 317, "playtime_last_two_weeks": 0, "last_played": 1465744772}, "language": "english", "review": "A nice little VN with a good amount of Comedy and Drama at the End of it.\nIt has around 3-5 hours Playtime and shows an interesting Story of a Girl, which can't use Magic in a World, where Magic\nis everywhere. Because of that, she was brought into a Madhouse where the Story starts.\n\nPS: This Game is the Prequel of ,, An Octave Higher''\n\nCharaktere: 4/5 Stars.\n( The MC has a nice personality and the SC's aren't that bad. They have a story which will be explained to some decrease.)\n\nArt/Style:   3,5/5 Stars\n( It has a nice look, cute at some times but it can intensify the Drama and the Fights.\n\nMusik: 3/5 Stars\n( The Musik isn't special but nothing bad. It match the Story but it sometimes stops abruptly when you move forward to the next scene)\n\nStory: 4/5\n( It has a nice Story which is well told. I would have given 5 Stars if the ending wasn't so......how should I say it......odd? )\n\nI would give it around 3,5/5 Stars and recommend it.", "timestamp_created": 1465731538, "timestamp_updated": 1466020008, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.566996", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23512773": {"recommendationid": "23512773", "author": {"steamid": "76561198042757423", "num_games_owned": 88, "num_reviews": 2, "playtime_forever": 406, "playtime_last_two_weeks": 0, "last_played": 1465821270}, "language": "german", "review": "Schönen guten Abend mein name Florian \"aniFlo\" F. ich werde die \n\nIch habe heute die Ehre euch eine Review zu One Small fire At A Time zu schreiben\nund die Frage zu beantworten sind es kleine schritte bis zu einer Großen flamme der Leidenschaft\n(13 jährige dürfen jetzt lachen)\noder doch eher nur heiße Luft.\n\nStory zusammengefasst ohne namen:\n\nMädchen hat keine zauber Kräfte alle anderen haben sie das wird alls die schlimmste geistige krankheit angesehen und sie kommt in ein Irrenhaus.\nMädchen wird gemobbt und sucht nach liebe und gefühl und ist hoffnunglsoß\nDie hausbesitzter werden verdächtigt Mana potion zu schmuggeln oder zu produzieren\n3 leute 1. davon sehr relevant wird nach und nach zur Vaterfigur\nnoch etwas schneller alles wird immer komischer und niemand weis genau wer ehrlich ist und wer ein falsches Spiel\ntreibt oder das richtige tut. Dabei ist es aber zu keinem Zeitpunkt verwirrend.\nWas Prositiv gesagt werden muss ist das öffters über die geistigen krankehiten \nphilosophiert und departiert geworden istm, ohne am ende ein perfektes ergebnis zu gehabt zu haben.\nEs sind Meinung und Einstellungen manchmal verschiedene Blick winkel aber nie perfekte Lösungen\nwas diesem Spiel sehr prositiv beinflusst hat.\n\ntl.dr gut geschriebene Story mit Message \n\nGrafik und Style: Wenn man dem Spiel ein Zeitalter geben müsste wäre es warscheinlich das späte 19 oder die Anfänge des 20 Jahrunderts wobei ich mir dabei nicht sicher bin. Der Zeichenstyle ist Schwunghaft und spielerisch ein bischen Aquarell mäsig. Alle Charaktere sind schön Designed und sind teilweise einfach nur zum knuddeln oder verlieben je nachdem was ihr lieber habt. Negativ kann ich nur sagen das manche bilder extrem oft vorgekommen sind wie bei den Magiattacken.  Wobei als prositiv die Kampf koreograpien (wovon es leider nur sehr wenige gab) hervorzuhenen ist  puh ich schreib mich um kopf und Kragen reden wir doch jetz über \n\n\nSchreibstyle:\n\nSchreibstyle und tempo: die Geschichte fließt Mäsig voran nicht zu schnell aber auch nicht zu langsam (wetter vorhersage diesen abend) nur 1 mal hatte ich das gefühl das es doch ein wenig schneller voran gehen soll und das war als ich aufs klo musste^_-.\nMann nimmt im Spiel verschiedene Personenperspektiven ein, von der Protaconistin über den Erzähler bis Aussenstehenden plotrelevanten Charakteren war alles dabei. Manchmal etwas verwirrend da es so kommt als würde ein Charakter für dich reden nur um dann plötzlich zu merken das du jemand anders Representierst. Es ist aber nie wirklichlich zu schlimm, solange man ordentlich liest und beim Plot am ball bleibt. Aber ich kann Verstehen falls jemand 1 stunde täglich dieses spiel spielt und dann die Story in 5 Tagen durch hat das er sich erstmal wieder rein finden muss um nicht verloren zu gehen\n\nDie Kampfzehnen waren immer Detaltiert und sauber geschrieben. Dazu gab es auch eine Abwechslung beim Schreibstyle  das der Move erst in Bildern gezeigt wird und dann der Aufbau der Technick erklärt wird neben den normalen Kampfschreibstyle.\n\nMusik: Sehr schön und passend. Viel Klavier und klassische Musik. Viele charaktere hatten ihre eigene kleine Melodie Die sehr gut auf die charaktere gepasst haben. ich würde aber persönlich nicht die CD kaufen maximal 1-2 Lieder als Errinnerung für meine Bibliotek. Die Soundeffekte waren mittelmäsig aber inordnung.\n\nFazit: \n\nDas Spiel hat einen sehr guten Eindruck auf mich hinterlassen.\nEs war eine gute story mit einem nicht einfachen Thema was aber super umgesetzt wurde ohne dabei\nden humor zu verlieren (und keine Sorge ihr werdet auch andere Gefühle noch bekommen). Es ist vom Technischen nicht perfekt und man merkt das es manchmal am Geld gefehlt hat.\nDenoch war es für den 8 euro eine Erfahrung die Ich jedem wirklich empfehlen kann vorallem die jüngere generation\nvon 10-16 kann ich es empfehlen da es vieleicht Ihnen ein anderen Blickwinkel auf Klassenkameraden geben könnte\noder vieleicht ihnen zeigt das egal wie viele Schläge man einsteckt (philosophisch hoffentlich) und die Hoffnung schon aufgegeben hat, sich nicht selbstaufgeben kann den manchmal reicht ein lächerliches versprechen das dich am ende zum Ziel führt.\n\nOne Smal Fire At A Time bekommt von mir das predicat klein aber oho ... natürlich die Flamme!!!!\n\n\nPs: WAS DIE IST 13  MANNN Q.Q  Aniflo out\n\n\nMeine Anderen Reviews und Kurz Reviews:\nhttps://www.youtube.com/channel/UCDcsTEn4wHhfH8mvtbgFEFQ\n\nDort wird am 13.06 20:00 noch eine ausfürhliche editierte review erscheinen wenn ichs zeitlich schaffe. Ansonsten Montag vorbei schauen.", "timestamp_created": 1465697161, "timestamp_updated": 1513040012, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.513812", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23512024": {"recommendationid": "23512024", "author": {"steamid": "76561198020833136", "num_games_owned": 86, "num_reviews": 11, "playtime_forever": 169, "playtime_last_two_weeks": 0, "last_played": 1465781603}, "language": "english", "review": "The story and art are ok.", "timestamp_created": 1465692690, "timestamp_updated": 1465692690, "voted_up": true, "votes_up": 1, "votes_funny": 3, "weighted_vote_score": "0.304751", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 7, "review_score_desc": "Positive", "total_positive": 33, "total_negative": 0, "total_reviews": 33}}
