{"reviews": {"39477171": {"recommendationid": "39477171", "author": {"steamid": "76561198030926740", "num_games_owned": 102, "num_reviews": 3, "playtime_forever": 1557, "playtime_last_two_weeks": 0, "last_played": 1514636091}, "language": "english", "review": "I think you get the gist of it at the first video. \n\nAll systems are working. The cockpit looks dauting at first. I thought the barrier to entry would be too high, but it really isn't. Every single system is simple and has a clear cut part to play in the whole. The complexity is what you make of it. If you decide to not push any operational limit and just go by the book, then it's just a matter of being meticulous.\n\nIf you ever wanted to fly a space ship from within an A-10 cockpit with a lot of switches then this is a game you should have in your library. How would you plan to solve Kerbal problems with flick switches from inside the cockpit?\n\nThe big part of this game is when you are so familiarized with the cockpit that you shift your gaze from the cockpit internals and use this baby to accomplish tasks in the outside world. \n\nThe experience is so flexible that you eventually develop your individual style and habits as a pilot, but that's part of the rewarding experience. \n\nWith all the \"candy crush\" style of space flight \"sims\" out there. It's good to have a nice and quiet option where the sense of accomplishment is mastery without a clickfest with split second timing.", "timestamp_created": 1516435462, "timestamp_updated": 1516435462, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38790862": {"recommendationid": "38790862", "author": {"steamid": "76561198084286945", "num_games_owned": 61, "num_reviews": 4, "playtime_forever": 8, "playtime_last_two_weeks": 0, "last_played": 1514422450}, "language": "english", "review": "Extremely underdeveloped and at the rate the updates are coming out; and their volume don't expect it to get better anytime soon", "timestamp_created": 1514487617, "timestamp_updated": 1514487617, "voted_up": false, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.383042", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38775810": {"recommendationid": "38775810", "author": {"steamid": "76561198327292437", "num_games_owned": 70, "num_reviews": 4, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1514455196}, "language": "schinese", "review": "现阶段键盘鼠标玩家可以放弃了，视角移动完全是设计给摇杆和VR的，这游戏暂时和我们没有什么关系……\n\n已退款。", "timestamp_created": 1514459673, "timestamp_updated": 1514459673, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38702615": {"recommendationid": "38702615", "author": {"steamid": "76561197982446778", "num_games_owned": 94, "num_reviews": 5, "playtime_forever": 819, "playtime_last_two_weeks": 21, "last_played": 1515489548}, "language": "english", "review": "I'm not going to recommend buying this, and i'm not going to recommend that you dont. This sim falls into a very unique category where I believe, that at least for it's sale price of a usual 10$, offers a very interesting, unique, and immersive experience that nothing else really provides. \n\nThat said, it's an experience, not a game. Unfortunately, I do not see Rogue System ever becoming a full fledged game. It's being worked on by a single guy who refuses basically all help, and I honestly believe the scope is far too large for the one man to handle. You can see the utterly massive gaps in between updates and dev communications. It doesnt spell good things for the future of Rogue System. \n\nIf you find it on sale, and want to have a unique, immersive experience that you can mess with every so often and dont expect it to evolve much beyond that, then Rogue System is a pretty interesting buy. I dont regret the 10$ I spent, but I love space sims and this is like DCS and KSP had a baby. I hope it continues to grow.\n\n", "timestamp_created": 1514305234, "timestamp_updated": 1514305234, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.601545", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38681776": {"recommendationid": "38681776", "author": {"steamid": "76561197972790090", "num_games_owned": 859, "num_reviews": 20, "playtime_forever": 463, "playtime_last_two_weeks": 0, "last_played": 1514218423}, "language": "english", "review": "I must say for a one-man team this game is pretty good. It's light in content but what's there is promising, just learning on how to control your ship will take you a couple of days. Yes there are tutorials that explain to you what to do to get it working but to really understand what's what you need to learn it yourself. The batteries will explode, fuel cells will be depleted, everything will turn off and you'll be sitting there in a dark ship floating in space wondering what went wrong only to try again and begin with the star-up procedure. Once you really figure out on how to do all that you need to learn about orbital mechanics and automatic pilot settings.\nImagine Kerbal Space Program without the map that shows your orbit, you only get numbers and icons. Once you mange to go to a moon or planet you have to learn to rendez-vous, after that you have to learn to dock. I haven't even reached those parts yet.\nFor people with a love for realism and sci-fi.", "timestamp_created": 1514258003, "timestamp_updated": 1514258003, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38630901": {"recommendationid": "38630901", "author": {"steamid": "76561198023452047", "num_games_owned": 57, "num_reviews": 8, "playtime_forever": 740, "playtime_last_two_weeks": 23, "last_played": 1515370221}, "language": "english", "review": "This is fun, and good! It can be a bit difficult, but with practice and patience, you can improve fast! Nothing is simple in this game, and some things still feel a bit awkward, but more and better is being implemented. As far as I know development is going slow, but is a titanical task. Also, it is easy to feel intimidated by it, and I know I'm gonna need some reference manual and a few checklists, but those are still in developement.\n\nI trust the game will keep on this track, focusing on simulation and management, every single button does something, and pressing the wrong one at the wrong time can have severe consequences. In fact, I hope to see new systems and mechanics. Not really looking forward to the combat part though, but still, I'm curious to see how it handles it.\n\nHowever, a word to the wise. After some research, I found out this game has been in development for quite a while, and although playable, is still green, so far that the very cockpit feels very unfinished. But that's what EA is all about. So if you are expecting a full product, Elite: Dangerous-ish quality game, just wait. Other thatn that, very fun for harcore simmers.", "timestamp_created": 1514138004, "timestamp_updated": 1514138004, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38602388": {"recommendationid": "38602388", "author": {"steamid": "76561198103512141", "num_games_owned": 89, "num_reviews": 9, "playtime_forever": 329, "playtime_last_two_weeks": 25, "last_played": 1516324768}, "language": "english", "review": "Rogue System has a solid foundation for a great space sim, maybe the most realistic ever made. The mechanics and physics are sound, and even the propulsion systems are based on actual next-gen ideas. Theres more buttons and functions than I have room for on my whole flight sim rig, but the game content is wanting. \nAs of right now, its total sandbox, as in make up your own mission and finish it out. The dev says more is coming soon, and I can emphasize with him as its still a one man effort. Lately he has been posting more updates, which makes me more confident this sim will come to fruition. \nIf he can manage a well balanced career, with goals and commerce and NPC ships and bases, this could be the space game to contend with KSP for my favorite. The basics are there, and very well fleshed out in terms of the ship and its systems. Now we just need something to do with it. \nSupport this game and its developer, we might really have something special here.", "timestamp_created": 1514078855, "timestamp_updated": 1514078855, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37995785": {"recommendationid": "37995785", "author": {"steamid": "76561198055443670", "num_games_owned": 21, "num_reviews": 3, "playtime_forever": 951, "playtime_last_two_weeks": 0, "last_played": 1513331069}, "language": "english", "review": "There's still a lot of development needed, in game mechanics and gameplay content. But it looks promising and I like the details of the simulator. It's definitely not a one-click-to-win type of game.", "timestamp_created": 1512198772, "timestamp_updated": 1512198772, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37601181": {"recommendationid": "37601181", "author": {"steamid": "76561197976301379", "num_games_owned": 263, "num_reviews": 5, "playtime_forever": 85, "playtime_last_two_weeks": 0, "last_played": 1511659815}, "language": "english", "review": "There is a particular segment of the gaming community whose deepest love is for hard-core simulations.  These simulations are like a blend of puzzle-game and action game, where you get as much satisfaction from learning how to use the simulated systems as from achieving goals within the game.  There is an element of education, as well, because you know that what you are learning is solidly based on how things work (or might work) in the real world, without any sugar-coating or compromises for \"accessibility\".  There is no \"levelling up\" or unlocking of bonuses in games like this - the only way to improve is for you to learn and get better!\n\nRouge System is a stunning one-man effort that even in early-access sits squarely at the pinnacle of its class, for space-flight simulations.", "timestamp_created": 1511656225, "timestamp_updated": 1511656225, "voted_up": true, "votes_up": 14, "votes_funny": 1, "weighted_vote_score": "0.650191", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "37587596": {"recommendationid": "37587596", "author": {"steamid": "76561198067932916", "num_games_owned": 119, "num_reviews": 4, "playtime_forever": 688, "playtime_last_two_weeks": 0, "last_played": 1512827495}, "language": "english", "review": "After seeking an authentic 1st person space travel experience by playing KSP with prop monitors in IVA, I finally bought this game.\nThe moment I was able to dock the Flying Fox for the first time, the KSP IVA became obsolete.\nThis is THE GAME for HC space ship captains!\n\nThe game does not have that much content in yet, but it's growing steadily.\nThere are few things you can do in this game as is, but oh boy just powering up the ship does not get old!", "timestamp_created": 1511646285, "timestamp_updated": 1511646285, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37378426": {"recommendationid": "37378426", "author": {"steamid": "76561197978873370", "num_games_owned": 213, "num_reviews": 3, "playtime_forever": 423, "playtime_last_two_weeks": 0, "last_played": 1511334520}, "language": "english", "review": " I really do like the concept of this game and hope to see it become much much bigger. Right now it spacecraft checklist/ button sim. You can fly around and do evas, but more is needed.", "timestamp_created": 1511543711, "timestamp_updated": 1511543711, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36287140": {"recommendationid": "36287140", "author": {"steamid": "76561198009504997", "num_games_owned": 629, "num_reviews": 120, "playtime_forever": 3693, "playtime_last_two_weeks": 30, "last_played": 1515864799}, "language": "english", "review": "Best space ship simulator there is, period.", "timestamp_created": 1509852476, "timestamp_updated": 1509852476, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36262578": {"recommendationid": "36262578", "author": {"steamid": "76561198022692888", "num_games_owned": 125, "num_reviews": 3, "playtime_forever": 1131, "playtime_last_two_weeks": 0, "last_played": 1511839305}, "language": "english", "review": "The best button pressing simulator out in the market today and it isn't even halfway done.", "timestamp_created": 1509780728, "timestamp_updated": 1509780728, "voted_up": true, "votes_up": 5, "votes_funny": 3, "weighted_vote_score": "0.548326", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36261960": {"recommendationid": "36261960", "author": {"steamid": "76561198032724963", "num_games_owned": 78, "num_reviews": 3, "playtime_forever": 1470, "playtime_last_two_weeks": 0, "last_played": 1511360325}, "language": "english", "review": "In so many ways this is the game i was looking for all my life.\nGive it a try, but be warned:\nBe prepared to be a real smart Space Captain, or become one...\nLet's hope Micheal gets his team an can finish this game!", "timestamp_created": 1509778365, "timestamp_updated": 1509778365, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.568909", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36208025": {"recommendationid": "36208025", "author": {"steamid": "76561198003641684", "num_games_owned": 100, "num_reviews": 6, "playtime_forever": 787, "playtime_last_two_weeks": 0, "last_played": 1499987834}, "language": "english", "review": "Ehh  Where to start...  This \"game\" has so many of the things that I feel space sims have been missing...  it has SO much potential.. I WANT to love this game.. I really do..It is simulator heaven.. and as it progresses, I feel sure it will be a good sim....\n\nHowever, I can not in good conscious recomend this sim. \nNow before all the white knights start screaming \"ermagerd! erly aksess!\" and \"its just one guy\"\nYea... I get it.. its early access to a game thats not officially released yet.. However 30 dollars?? come on.. that is the price of a fully released indy title..  not .. this...  and about the \"just one guy\" thing..\n\nIf you to take a look.. at times it can be months..  in the case of the last update its been HALF A YEAR..  often with not so much as a peep from the developer.  \nIts no mystery why so many posts and updates have started with an apology of some sort.\n\nAt the end of the day, im sure the developer is a good guy..  and the sim has a LOAD of potential.. \nBut he seems unwilling to invest in a team to help with his \"hobby\"   and if he can not be bothered to invest in development, why should we be expected to?\n\nRight now, no I do not reccomend this game.. in spite of its insane potential.. \nOnce the solo developer decides to start communicating on a MUCH more regular basis with his backers, \nand invests some bank into hiring a dev team to help get the project moving..  I will change my recomendation ..\n\nSide note..  many people have said games like DayZ are why early access should not exist.. I disagree..  DayZ was kinda garbage before it started..  its games like THIS one.. which have huge potential.. and ultimately just become an alternative revenue stream for some dude who seems to have some adversion to hiring help.. \nWith nearly 8000 sales (steam spy) at a price between 10 and 30 dollars..  its safe to assume at LEAST 80k has been made in profit..  80k should easily be able to get some dev help for at least a little while..  and dump into public awaness and advertising as well..  promote through streamers and youtubers..  and the money will continue to flow in...\n\nOr.. ya know... dont.. and we will have yet another title on early access for eternity.", "timestamp_created": 1509593516, "timestamp_updated": 1509593516, "voted_up": false, "votes_up": 41, "votes_funny": 0, "weighted_vote_score": "0.685107", "comment_count": "6", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36171772": {"recommendationid": "36171772", "author": {"steamid": "76561198138803230", "num_games_owned": 119, "num_reviews": 50, "playtime_forever": 204, "playtime_last_two_weeks": 13, "last_played": 1516406663}, "language": "english", "review": ">10 minutes figuring out how to turn the ship on\n>3 minutes frantically pushing buttons trying to get the alarms to stop yelling at me\n>20 minutes trying to figure out what \"LENR\" means (Low Engergy Nuclear Reactor....meaning there's more than one NR? crap)\n>10 minutes  of \"oh I've got the hang of this\"\n>30 minutes of \"oh the alarms are back and my NR meters are all red. What have I done?\"\n>0.05 minutes exploding\n\n10/10 I have no idea what i'm doing", "timestamp_created": 1509470405, "timestamp_updated": 1509470405, "voted_up": true, "votes_up": 18, "votes_funny": 21, "weighted_vote_score": "0.653494", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35430850": {"recommendationid": "35430850", "author": {"steamid": "76561198002536794", "num_games_owned": 548, "num_reviews": 47, "playtime_forever": 112, "playtime_last_two_weeks": 14, "last_played": 1515955713}, "language": "english", "review": "I love this game OMG button heaven!", "timestamp_created": 1506987698, "timestamp_updated": 1506987698, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.473940", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34986811": {"recommendationid": "34986811", "author": {"steamid": "76561198027547616", "num_games_owned": 113, "num_reviews": 1, "playtime_forever": 2764, "playtime_last_two_weeks": 0, "last_played": 1511585087}, "language": "english", "review": "Great game! I'm excited to see this develop further!", "timestamp_created": 1505533102, "timestamp_updated": 1505533102, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.452099", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "34858349": {"recommendationid": "34858349", "author": {"steamid": "76561198014335365", "num_games_owned": 34, "num_reviews": 1, "playtime_forever": 1242, "playtime_last_two_weeks": 0, "last_played": 1504995494}, "language": "english", "review": "Rogue System is very good spaceship simulator, but as a game Rogue System is dead.\nIt has 2 missions in the game: one to dock with 1 station and you are done, second one is to explore solar system without any goals. And no new missions were added since 2015.", "timestamp_created": 1505038811, "timestamp_updated": 1505038811, "voted_up": false, "votes_up": 18, "votes_funny": 1, "weighted_vote_score": "0.533695", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33660939": {"recommendationid": "33660939", "author": {"steamid": "76561197963141903", "num_games_owned": 217, "num_reviews": 1, "playtime_forever": 3218, "playtime_last_two_weeks": 0, "last_played": 1514682446}, "language": "english", "review": "I've just put over 30 hrs into Rogue System and am loving every minute.  It has taken me this long to get a basic understanding of the ships systems and complete some of the tutorials.  This is a complex simulation but the rewards are great if you stick with it.  The developer is clearly comitted to the project and his work speaks for itself.  If you look at the games discussions and forum you will see him answering questions personally and taking onboard peoples suggestions and ideas.  Rogue System has a long way to go but even at this early stage has lots to keep you busy and thinking.  Buy it, try to complete the docking tutorial, fail, try again and again then feel the satisfaction of hearing the thud of the docking clamps.", "timestamp_created": 1500504163, "timestamp_updated": 1500504163, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 138, "total_negative": 10, "total_reviews": 148}}
