{"reviews": {"39048350": {"recommendationid": "39048350", "author": {"steamid": "76561198175912399", "num_games_owned": 32, "num_reviews": 8, "playtime_forever": 1669, "playtime_last_two_weeks": 0, "last_played": 1505837468}, "language": "spanish", "review": "Viejito pero poderoso! Este juego de estrategia es distinto a todo lo que hayan visto antes. La manera de recolectar recursos y mantener una economía estable es de las más raras y creativas que he experimentado. Hay varias formas de conquista pero me atrevo a decir que es perfecto para aquellos que disfrutan la conquista diplomática, con espías y traiciones.", "timestamp_created": 1515072777, "timestamp_updated": 1515072777, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37543719": {"recommendationid": "37543719", "author": {"steamid": "76561198286116763", "num_games_owned": 24, "num_reviews": 14, "playtime_forever": 209, "playtime_last_two_weeks": 0, "last_played": 1485613125}, "language": "english", "review": "This game is absolutely amazing, but I grew up with it. Every so often I bring it up and play it for a few hours. Would totally recommend to anyone but the biggest problem is that this particular version didn't work well on my computer, something to do with windows 10. There are offical fixes floating around on the internet.", "timestamp_created": 1511624757, "timestamp_updated": 1511624757, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37405576": {"recommendationid": "37405576", "author": {"steamid": "76561198015153950", "num_games_owned": 618, "num_reviews": 18, "playtime_forever": 355, "playtime_last_two_weeks": 0, "last_played": 1475172966}, "language": "spanish", "review": "Uno de tantos grandes juegos de estrategia que hubo en los 90's, empiezas una partida y pueden pasar 3 o 4 horas y no te das cuenta jaja. Desde aquí mi recomendación para aquellos que ya no lo recuerden o para que lo prueben los amantes de la estrategia en tiempo real y no lo conozcan", "timestamp_created": 1511552990, "timestamp_updated": 1511552990, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36716007": {"recommendationid": "36716007", "author": {"steamid": "76561197992541723", "num_games_owned": 664, "num_reviews": 11, "playtime_forever": 600, "playtime_last_two_weeks": 0, "last_played": 1511375444}, "language": "english", "review": "Still one of the most unique RTS games, if only combat was better the game would have been close to perfect.", "timestamp_created": 1511375528, "timestamp_updated": 1511375528, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36482234": {"recommendationid": "36482234", "author": {"steamid": "76561198013782852", "num_games_owned": 52, "num_reviews": 2, "playtime_forever": 9903, "playtime_last_two_weeks": 0, "last_played": 1511940353}, "language": "english", "review": "Put so many hours into this game.  Too bad they ruined the sequels.", "timestamp_created": 1510532225, "timestamp_updated": 1510532225, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36434717": {"recommendationid": "36434717", "author": {"steamid": "76561198007244756", "num_games_owned": 46, "num_reviews": 3, "playtime_forever": 1141, "playtime_last_two_weeks": 0, "last_played": 1513482897}, "language": "english", "review": "7KAA is a classic RTS with game concepts not seen in the genre before or since.\n\nI played this game 17+ years ago, and recently picked up a copy on Steam. What is it about this 1997/98 game that is so appealling?\n\n- Limited population. Manpower is a constant concern, and population growth is slow. Unlike other RTS where its simply a matter of gather resource and magically units are always produced at buildings by expending resource, in 7KAA the supply of people is constant concern and limitation. You must manage where people go. Do they work in the mines, or factories or science towers? Do they train in your forts or become spies? Will there be enough peasants to grow food? You need to manage and conserve manpower.\n\n- Expansion. Complicated and interesting. Play with neutral village resistance as high to get this point better. You can't just conqour a village at will. You need a plan. Will you build a linking fort with a high ranking general of the same nationality, and wear them down with offering good governance? Will you bribe them with grants (less effective if too frequent) will your good reputation help you? Will you sell them goods and give them jobs in a factory or science tower? Or will you just attack them and massacre all defenders? The last option means there are less peasants to make use of afterwards, but it is the quickest if your army is strong enough. Note manpower needed for conquest, and what manpower can be gained from the capture.\n\n- Loyalty and reputation. If your people's loyalty drops, they defect. Generals who go unpaid or are bribed can switch sides, taking all the troops in the fort with them. Leave people out in the open for too long and they get sick of the wet and cold and switch sides. Villages with low loyalty might defect, especially if not goverened by a general. If you run out of money or food, people willl quit your services very quickly, in addition to your buildings collapsing for want of maintenance.\n\n- Nationality and culture. Maybe since the late 1990's its become uncool to talk about differences in culture. In this game however it matters. Villages prefer a general of the same culture, and it is useful to have like with like for maintaining loyalty.\n\n- Taxation. Tax them too hard or too often and the loyalty drops and you might have a rebellion. Don't tax enough and you run out of money - very bad. You can set auto tax when loyalty reaches a level.\n\n- Trade. Best way to make money. Either mine raw materials and manufacture them, or buy raw goods and produce them for sale. You can sell to your own villages, to other kingdoms with a trade treaty, and to villages with resistance below threshold (50). You need to seize and hold resources, but be mindful that ungoarded mines can be captured if a village is planted nearby.\n\n- Espionage. Spies, everywhere. This adds interesting complexity. You need spies to counter-spy and also to find out what the other kingsdoms are up to. You can also use spies to lower resistance in neutral villages, and lower loyalty in enemy villages. There are nuetral individuals that might join your kingdom (immigration) and they might be legit or they might be spies. If I see any individual doing something I did not tell them to do, I get suss and execute them. If they were a spy this is revealed, and if not, then I have lost a person who could have been productive elsewhere. Spies can bribe an enemy general to become a spy and if successful they can defect taking the fort and troops with them. Spies can also attempt assasination but this is risky.\n\nSkill. People's skills improve over time. Soldiers train up in a fort. Leaders increase leadership. Workers, miners and scientists slkill up and produce more outputs, faster, and so do construction and spies. This is an interesting component where you can think into the future on what skills you need, or if you need to retrain people. Lower skilled generals are less effective at governing, and highly skilled spies are more effective.\n\nWar. While the combat is *very basic* and one of the least attractive features of this game, some concepts are interesting. An army can drop loyalty and switch sides. Proximity of generals to troops matters. Losing your king in battle can be devestating and cause general rebellion until a new high leadership general is made king. Seige weapons are overpowered, hoever they are balanced in that they are quite expenesive to build and maintain. Build too many and you'll run out of money, the machines collapse from lack of maintenance and soldiers defect for not being paid.\n\nFrythans. I don't find this feature all that attractive but it does add some fun to those interested in fantasy. There are monster lairs ad trasure to be found in them. One useful thing to look out for is if an enemy is fighting Frythans, it means they are not defending something or being weakened by losses or enriched by treasure. Something to keep in mind. While here, I'll comment on greater beings. I didn't find this much use other than it looks cool to build a temple and invoke a greater being from worshippers.\n\nMusic. I like the soundtrack. Nuff said. Sound effects are fairly basic but do the job.\n\nOverall:\n\nLooking past the graphics and the basic combat, its a fascinating game. Don't bother with the sequels, they're crap.\n\n8/10.", "timestamp_created": 1510377661, "timestamp_updated": 1510378068, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36418179": {"recommendationid": "36418179", "author": {"steamid": "76561198073092169", "num_games_owned": 617, "num_reviews": 599, "playtime_forever": 189, "playtime_last_two_weeks": 0, "last_played": 1476249265}, "language": "english", "review": "ok", "timestamp_created": 1510320196, "timestamp_updated": 1510320196, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.438379", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36121221": {"recommendationid": "36121221", "author": {"steamid": "76561198091573374", "num_games_owned": 45, "num_reviews": 7, "playtime_forever": 202, "playtime_last_two_weeks": 0, "last_played": 1509451681}, "language": "english", "review": "My first RTS game growing up, this game was extremely immersive and ahead of it's time with a variety of features and complex mechanics, truly a masterpiece.\n\nI still get a rush of nostalgia whenever i play it. 10/10", "timestamp_created": 1509304287, "timestamp_updated": 1509304287, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35004834": {"recommendationid": "35004834", "author": {"steamid": "76561198158630769", "num_games_owned": 64, "num_reviews": 5, "playtime_forever": 683, "playtime_last_two_weeks": 0, "last_played": 1503735169}, "language": "spanish", "review": "Todo un clasico del RTS. Para todos los que vengan buscando el Seven kingdoms que conocieron en su infancia merece la pena comprarlo, pero debo advertir que tiene mas de un glitch, a veces las tropas se paran por ningun motivo en mitad del agua y al menos en mi pc se ralentiza muy ligeramente cada x segundos. Podrian haberlo optimizado un poco para los nuevos windows (Yo lo juego en windows 7) pero es jugable al menos. Teniendo en cuenta el precio es bastante razonable, sobretodo si lo pillas de rebajas.\nComo opinion personal debo decir que las nuevas culturas estan interesantes pero descompensan ligeramente los escenarios que venian de base con el juego.", "timestamp_created": 1505588991, "timestamp_updated": 1505588991, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34803602": {"recommendationid": "34803602", "author": {"steamid": "76561198161512478", "num_games_owned": 62, "num_reviews": 9, "playtime_forever": 20, "playtime_last_two_weeks": 0, "last_played": 1494284572}, "language": "spanish", "review": "Juego de mi infancia. Gracias billiken xd.", "timestamp_created": 1504822643, "timestamp_updated": 1504822643, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.565217", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34417879": {"recommendationid": "34417879", "author": {"steamid": "76561198060449012", "num_games_owned": 12, "num_reviews": 2, "playtime_forever": 431, "playtime_last_two_weeks": 0, "last_played": 1508582782}, "language": "russian", "review": "Небольшое руководство для людей которые испытывали проблемы при запуске игры. Если после запуска экран начинает рябить зелеными точками (ощущение что ты смотришь на игру в негативе), выйдите из игры, зайдите в разрешение рабочего стола и измените его на 800*600. После этого сохраняете изменение и сново заходите. Бывает даже так: меняете разрешение на 800*600, а потом возвращаете на предыдущее (после такого фокуса игра так же запускается без всяких графических багов). Если не верите мне, то поищите в папке с игрой официальный мануал от разрабов. Там эта проблема описана.\nА об игре сказать стоит следующее - бесподобный, неумирающий шедевр. Игра из разряда \"это создано когда я был песдюганом\". \nИграть буду долго и нисколько не сожалею про заплаченные мною копейки.\nНадеюсь когда нибудь этот шедевр ждет судьба первого Старкрафта (фанатом которого я так же являюсь). С нетерпением буду ждать ремастеринга\n10/10 - обязательно к ознакомлению.", "timestamp_created": 1503414966, "timestamp_updated": 1503414966, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33865229": {"recommendationid": "33865229", "author": {"steamid": "76561198140923850", "num_games_owned": 70, "num_reviews": 1, "playtime_forever": 320, "playtime_last_two_weeks": 0, "last_played": 1512601018}, "language": "english", "review": "This was the first videogame that i ever played back when i was about 5 and still to this day I love playing it just as much as i did back then. Sue the game has a few niggles like the colours can fuck up sometimes and the AI isn't all that smart as every faction that you play against will no matter what always do the same thing but overall this game is still a solid RTS that unlike RTS's of today don't contain the usual orcs vs humans thing. This game is still a great game and still holds up well for its age but i wond not reccomend buying it on Steam as it's an open source game and can be downloaded for fee on the 7KAA website. Either way just get this game and you won't be dissapointed.", "timestamp_created": 1501274951, "timestamp_updated": 1501274951, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32861074": {"recommendationid": "32861074", "author": {"steamid": "76561198086640973", "num_games_owned": 78, "num_reviews": 5, "playtime_forever": 29, "playtime_last_two_weeks": 0, "last_played": 1466926885}, "language": "english", "review": "Just as coots as it was back in 1998.", "timestamp_created": 1498580443, "timestamp_updated": 1498580443, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.439663", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31330298": {"recommendationid": "31330298", "author": {"steamid": "76561198037660123", "num_games_owned": 132, "num_reviews": 6, "playtime_forever": 306, "playtime_last_two_weeks": 0, "last_played": 1492956169}, "language": "german", "review": "Ein alter Klassiker :)", "timestamp_created": 1492990411, "timestamp_updated": 1492990411, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31014839": {"recommendationid": "31014839", "author": {"steamid": "76561198044596819", "num_games_owned": 123, "num_reviews": 16, "playtime_forever": 177, "playtime_last_two_weeks": 0, "last_played": 1491684645}, "language": "english", "review": "My first love.First game i ever played on pc.What can i say more :)", "timestamp_created": 1491648220, "timestamp_updated": 1491648220, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.557125", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30462786": {"recommendationid": "30462786", "author": {"steamid": "76561197999694524", "num_games_owned": 73, "num_reviews": 1, "playtime_forever": 478, "playtime_last_two_weeks": 0, "last_played": 1490945038}, "language": "english", "review": "Doesnt even run. Same feature set as free version available from fans. Wasted $5 for a game I really liked when it came out a long time ago.", "timestamp_created": 1489295210, "timestamp_updated": 1489295210, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.421493", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29844199": {"recommendationid": "29844199", "author": {"steamid": "76561198072342401", "num_games_owned": 177, "num_reviews": 58, "playtime_forever": 66, "playtime_last_two_weeks": 0, "last_played": 1486845253}, "language": "polish", "review": "[h1][b]Moja ulubiona gra dzieciństwa, wcielamy się w 7 różnych królestw : \n\n-Majowie, Persja, Normanowie, Vikingowie, Niggusy, Izraelowcy, Grecy.\n\nGra polega na pokonaniu wszystkich wrogów innych królestw, można także podpisywać handel, pokój, dać złoto a nawet kupić tron. \n\nOcena 10/10", "timestamp_created": 1486809457, "timestamp_updated": 1486809457, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.624787", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29347533": {"recommendationid": "29347533", "author": {"steamid": "76561198015510027", "num_games_owned": 282, "num_reviews": 18, "playtime_forever": 749, "playtime_last_two_weeks": 0, "last_played": 1512502851}, "language": "english", "review": "Probably my favorite strategy game ever, a bit different than others in the genre. First game i've ever bought (still have the huge box here), and probably one of my games i played most.\n\nIn this strategy game manpower is your primary resource instead of wood or anything. Also unit specialization is different from most strategy games i've played; every unit regardless of there profession can fight and improve combat skills up to the same cap, with their profession level improving the thing they were meant for (i.e. researches with a high research skill level progress your weapon development a lot faster when in a tower of science).\n\nWhat this game lacks in unit variety (7 original types of people with 3 new peoples added with ancient adversaries, and each unit from the same nationality having the same combat abilities; several boats and siege weapons and a few \"greater beings\") it makes up for with its more complex attributes like espionage which this game has worked out really well.\n\nThe game originated from 1997, it's graphics have aged a fair amount yet they did not do so in a horrible way. Also this game, and it's sequel (Seven Kingoms II; frythan wars) are nothing alike to the rather horrible Seven Kingoms: Conquest, which we should forget it was ever made.\n\nI cant truly recommend this game to anyone looking for a unique RTS experience, if they don't mind playing a game that is rather old. I would advice playing the tutorial  or reading the manual (which 182 pages long, yet not everything in it is that interesting) when you first play this game (things are a bit more complex than most RTS games i've played). \n\nPrevious owner of the game might know the game has had some issues running on newer pc's/OS's (inverted colors, turning most of the screen pink). The version seems to have resolved this issue (if I recall correctly so did the latest GOG release, if not this could be fixed by a creating a .bat file ending the explorer.exe task and restarting it if the game was closed)\n\nOne last thing I want to add here is that I prefer this game over it's sequel, but that might just be for nostalgia reasons.", "timestamp_created": 1484788147, "timestamp_updated": 1484788376, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.507042", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29342029": {"recommendationid": "29342029", "author": {"steamid": "76561198133484370", "num_games_owned": 126, "num_reviews": 4, "playtime_forever": 664, "playtime_last_two_weeks": 0, "last_played": 1487845221}, "language": "english", "review": "Seven Kingdoms is an awesome \"twist\" to the traditional RTS games where you gather resources, build an army and attack.\nIn this game, there's a lot higher emphasis on economy and diplomacy (a little like turn-based strategy games, but in real time).\nI bought the game for nostalgia's sake in hopes that the Steam version fixed the various problems on newer systems (inverted colors and so on). Though it didn't, sadly, a patched EXE file is available on 7kfans.com that you can get for free and it fixes everything.", "timestamp_created": 1484764794, "timestamp_updated": 1484764794, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.505766", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "28805729": {"recommendationid": "28805729", "author": {"steamid": "76561198010950501", "num_games_owned": 379, "num_reviews": 47, "playtime_forever": 128, "playtime_last_two_weeks": 0, "last_played": 1483045849}, "language": "bulgarian", "review": "The old school say yes!", "timestamp_created": 1483047347, "timestamp_updated": 1483047347, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26759790": {"recommendationid": "26759790", "author": {"steamid": "76561198031438086", "num_games_owned": 126, "num_reviews": 11, "playtime_forever": 2001, "playtime_last_two_weeks": 0, "last_played": 1504471028}, "language": "english", "review": "10/10\n\nBeen playing this since I was a boy.  The only game I have ever played for this long (came out in '97)  Most games I play a dozen times and forget.  This game is ETCHED into my memory.  The gameplay is perfect for what I want; RTS fighting, resource based economy (resources don't end they just respawn in a different area), no pop limit, no military limit, espionage, boats, siege weapons, etc.  I like many games but I LOVE this game.  Glad to see all my other fellow 7KAA fans supporting one of, if not, the best RTS ever made.  They NEVER made another game exactly like this one.  Never.", "timestamp_created": 1479891746, "timestamp_updated": 1479891746, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26238353": {"recommendationid": "26238353", "author": {"steamid": "76561198129593114", "num_games_owned": 357, "num_reviews": 6, "playtime_forever": 26, "playtime_last_two_weeks": 0, "last_played": 1477011502}, "language": "english", "review": "Ok guys - this game is my childhood - this game represents my childhood. This is my 2nd game EVER which I have ever ran on the PC platform and yes first RTS game which I actually ran on PC platform as well! Yes, you know - this game is a legend also.\nWhy? - Don't look graph. side, graph. actually doesn't so matter in this game, but gameplay does. And this is what is game bringing actually to the public.\nI was like 11-12 years old when I was playing this game on my (still working!) almighty Pentium 133 mhz with 48mb EDO ram and 3dfx Voodoo Banshee (with Win95OSR2). And yes I spent tons of time playing this game, and funny fact is when I bought this game on Steam, when I ran it on my new PC - actually I forgot how to play this, because actually 18-19 years have passed by (now currently in the time of writing this review I am actually 30 years old). Time is passing by - but believe me, the best games are immortal - like this one.\nPlease buy this - just not only because of nostalgia matter, but because this game has a strong legend status (at least for me). \nI don't like to write negatives about this game, but only one thing is little bit problematic, you can't actually change resolution in this game, since this game is running I think 640x480 resolution (more-less) - even in full-screen which is slightly annoying if you ask me. \nSo if you play this game on big-wide TV screen like me, then believe me - you'll have some hard times to find actually what it's writing on the screen, because font is too small because of small resolution. \nBut if you're still on good old CRT monitors (just kidding you know) then you can play this without any problems.\nBut I can't still believe one thing, that this game is working on modern systems - at least it's working on my Win10 with Annivesary 2016 update - it's working WITHOUT any problems. \n\nBUY IT - GAME IS WORTH OF EVERY MONEY!\n\nCheers!", "timestamp_created": 1477525379, "timestamp_updated": 1477525379, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.465686", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26134928": {"recommendationid": "26134928", "author": {"steamid": "76561198086850278", "num_games_owned": 61, "num_reviews": 1, "playtime_forever": 1187, "playtime_last_two_weeks": 0, "last_played": 1477852029}, "language": "german", "review": "Damals ein großartiges Spiel in das bereits mehrere hundert Stunden Spielzeit flossen als noch lange nicht an Steam zu denken war. Endlos Spiel begeistert mich immernoch, Szenarien waren immer eine Herausforderung. Kenne selbst niemanden der dieses Spiel gespielt hat, online reviews und diverse game-rankings bezeichnen es aber mit Recht als eine Spiele-Perle. \nSo da nun die Mindestspielzeit von 5 Minuten geschafft ist, ok, wesentlich mehr :D möchte ich die review auch mal absenden", "timestamp_created": 1476994132, "timestamp_updated": 1480153987, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25993333": {"recommendationid": "25993333", "author": {"steamid": "76561198152397303", "num_games_owned": 189, "num_reviews": 63, "playtime_forever": 291, "playtime_last_two_weeks": 4, "last_played": 1516533601}, "language": "russian", "review": "Эта игра мне показала в далёком 1999 году что такое стратегия,строить,управлять воинами,торговать,объявлять войну,шпионить,вызывать богов...\nЗдесь все юниты одной нации одинаковые,различаются лишь иконками кто воин,а кто рабочий(в 2016 году это абсурд),но тогда на это было плевать:) всем олд фагам ИГРАТЬ без исключения!", "timestamp_created": 1476253030, "timestamp_updated": 1476253030, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.508903", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25799227": {"recommendationid": "25799227", "author": {"steamid": "76561198026062236", "num_games_owned": 23, "num_reviews": 13, "playtime_forever": 688, "playtime_last_two_weeks": 0, "last_played": 1475323920}, "language": "english", "review": "It is a great and nostalgic game for the fans of deep strategy games. Graphics are of course outdated and not promising so much but atmosphere is fantastic. If you like old strategy games from times when \"strategy\" really important to win, this game is for you! Buy, play and enjoy!", "timestamp_created": 1475324997, "timestamp_updated": 1475324997, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500227", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25364834": {"recommendationid": "25364834", "author": {"steamid": "76561198093695022", "num_games_owned": 189, "num_reviews": 15, "playtime_forever": 47, "playtime_last_two_weeks": 0, "last_played": 1473026106}, "language": "english", "review": "I have been a lover of strategy games since I was very young man in the mid 90's and have played all the greats and a lot of the lesser known. I don't know what inspired me to grab Seven Kingdoms off the store shelf in 1998 but I still consider this game one of the best I've ever played and feel sorry for all the other strategy gamers who have probably never heard of it. Imagine the depth of empire building Civilization offers mixed with the fun battles of RTS titles like Age of Empires. out of all the strategy games I have played there hasn't been another game that made me feel more like I was actually ruling a country like this game does and that has been the reason I have played it regularly for so many years. Hell it's so good I bought it off steam even though I've always owned a physical and digital copy. You can win at this game in so many different ways depending on what  you devote your focus to espionage, economy, diplomacy, pure muscle, technology just to name a few. Feel lucky you stumbled across this game on steam because this game isn't main stream but damn sure deserves to be.\n\tSeven Kingdoms can be tremendously fun to play with friends and one of the most successful ways to do that with such an aged game is through game ranger but there are other methods out there. You may have to do some googling to get the multi-player going but is very much worth the effort if you happened to know someone else who knows how to play it or is willing to learn.\n\t It really holds up to the test of time because there still hasn't been another game just like it made yet sadly. The only negative thing I can say about the game is that there is so much depth it has quite the learning curve but couldn't be more worth it so don't give up on it. Hell I still feel like I'm learning things about this game after so many years of playing it. Luckily my physical copy came with a manual to help me along when I was just started playing and I recommend keeping your PDF copy handy.\n\tjust a side note if the game starts up all rainbow colored open up your screen resolution window and leave it open in the background and reboot the game. it should cure the issue (I'm using windows 7). My buddy who is running windows 10 didn't need to do this on his machine.", "timestamp_created": 1473086534, "timestamp_updated": 1473086534, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.542351", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24737179": {"recommendationid": "24737179", "author": {"steamid": "76561198026174880", "num_games_owned": 180, "num_reviews": 15, "playtime_forever": 11, "playtime_last_two_weeks": 0, "last_played": 1499506475}, "language": "russian", "review": "Очеь шикарная игра. Мало какая стратегия похвастантся такой дипломатией и шпионажем. \nМожно:\n1-Крошить все на пролом.\n2-Обзавестись союзниками, что бы они воевали за тебя\n3-Подкупить чужую армию и заваевать ей весь МИР!!!!\n4-Устроить бунт в поселениях, народ востанит и порвет свое провительство :)\nИ многое многое другое. Очень интересно играть с друзьями по сети. \n\nЛет НАДЦАТЬ назад я провел за этой игрой тысячи часов :)", "timestamp_created": 1470464481, "timestamp_updated": 1470464481, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.618196", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24387596": {"recommendationid": "24387596", "author": {"steamid": "76561198004848612", "num_games_owned": 38, "num_reviews": 4, "playtime_forever": 340, "playtime_last_two_weeks": 0, "last_played": 1501184690}, "language": "spanish", "review": "Después de la serie Warcraft, Seven Kingdoms: Ancient Adversaries es mi juego favorito dentro del mundo de los RTS, casi 20 años han pasado desde la magnifica primera entrega Seven Kingdoms, y esta expansión solo hace hacer un juego mucho mejor, un RTS puro y duro, al que habré jugado entre el modo single player y el modo ip cuando jugaba con mi primo, más 500 horas a lo largo de los primeros años de salir el juego, donde fué una época gloriosa para este género. RTS como Warcraft, Seven Kingdoms, Starcraft, Age of Empires y muchos más inundaban de gran manera nuestros pcs y que ahora vuelvo a instalar esta gran joya para recordar viejas batallas. Para la época fué un gran juego, de los mejores, con un editor de escenarios aleatorio, diez civilizaciones, el poder espiar a tus enemigos, contratar a través de las tabernas a nuevos guerreros, poder hacer comercio con otros reinos, las reveliones, solicitar impuestos a otros reinos si no querían ser atacados o pagarles tributos para que te defendieran de otros, ver reinos casi destruidos, pero tu darles dinero y comida ya que te interesaban que no desaparecieran para contrarrestar enemigos más fuertes en la zona era algo magnifico teniendo encuenta la antigüedad del juego y en la época que salió. Un juego con un reconocimiento en la época injusto, pasando bastante desapercivido, quizá no fué gráficamente mejor que la competencia, pero su profundidad mereció estar en el top de los mejores RTS, ojalá algún día haya un juego de estrategía de esta saga sencillo como el primero, pero con profundidad, de momento a disfrutarlo de nuevo.", "timestamp_created": 1468838408, "timestamp_updated": 1468838408, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.512195", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24300579": {"recommendationid": "24300579", "author": {"steamid": "76561198020061292", "num_games_owned": 183, "num_reviews": 2, "playtime_forever": 1073, "playtime_last_two_weeks": 62, "last_played": 1515522217}, "language": "english", "review": "An overlooked classic shadowed by the simplistic RTS games of its era like Age of Empires. Espionage and diplomacy are just as important, if not more important here as sheer military prowess and economic gain.\n\nAs someone who played this game since the very first Demo version, I can't do anything but whole heartedly recommend this classic. If you haven't tried it yet and you're willing to deal with the learning curve, give it a go.", "timestamp_created": 1468434327, "timestamp_updated": 1479929981, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.580167", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24171863": {"recommendationid": "24171863", "author": {"steamid": "76561198047974752", "num_games_owned": 123, "num_reviews": 1, "playtime_forever": 742, "playtime_last_two_weeks": 0, "last_played": 1514751437}, "language": "english", "review": "I bought it just because i love this game <3\nbut personally i recommend to download it from the 7K-Fans because they upgraded  this old and great game with new features ;)\nactualy... probably 16 years playing this game lol xD", "timestamp_created": 1467943212, "timestamp_updated": 1467943212, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.576176", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23926697": {"recommendationid": "23926697", "author": {"steamid": "76561198082156712", "num_games_owned": 31, "num_reviews": 1, "playtime_forever": 166, "playtime_last_two_weeks": 0, "last_played": 1467518300}, "language": "turkish", "review": "10/10", "timestamp_created": 1467212074, "timestamp_updated": 1467212074, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503946", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23787808": {"recommendationid": "23787808", "author": {"steamid": "76561198027637734", "num_games_owned": 199, "num_reviews": 8, "playtime_forever": 8044, "playtime_last_two_weeks": 0, "last_played": 1514595547}, "language": "turkish", "review": "ve işte bugsuz bi versiyon steam versiyonu :) ne pikselleşme var ne tam ekran problemi vede oyundan atma  sorunu yaşamadan oyniya bilirsiniz :=) ah ah ilk oynadığım Strateji oyunlarindandır benim için klasikleşmiştir fazla bilinmez ama bilende iyi bilir nekadar iyi bi oyun olduğunu.\nKısacası bu versiyonu Stabil çalışıyo Çekinmeden alın :)", "timestamp_created": 1466853415, "timestamp_updated": 1466853415, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.511002", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23757847": {"recommendationid": "23757847", "author": {"steamid": "76561198150003723", "num_games_owned": 43, "num_reviews": 2, "playtime_forever": 679, "playtime_last_two_weeks": 0, "last_played": 1513215349}, "language": "portuguese", "review": "Man, i can't believe this game is here!! I hope it gets the multiplayer soon, can't wait!", "timestamp_created": 1466778815, "timestamp_updated": 1466778815, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.504876", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23655248": {"recommendationid": "23655248", "author": {"steamid": "76561198135904814", "num_games_owned": 58, "num_reviews": 4, "playtime_forever": 4866, "playtime_last_two_weeks": 0, "last_played": 1511724755}, "language": "english", "review": "Best game!", "timestamp_created": 1466356995, "timestamp_updated": 1466356995, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.419398", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23614034": {"recommendationid": "23614034", "author": {"steamid": "76561197990202234", "num_games_owned": 16, "num_reviews": 1, "playtime_forever": 1260, "playtime_last_two_weeks": 0, "last_played": 1471131741}, "language": "schinese", "review": "好久了，高中时玩的游戏，好怀念。孤单的音乐，超前的模拟经济（当时），独特的间谍和统治，太喜欢了对于当时。\n和殖民计划一样，感觉2代反而不如一代，画面没有改进，倒是加了杂七杂八的东西。一个良好的2代请只有优化内容和画面谢谢，而不需要画蛇添足加些乱七八找的东西。\n不过画面经常乱色，是游戏太老的缘故吗？", "timestamp_created": 1466170890, "timestamp_updated": 1466170913, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.608586", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22900543": {"recommendationid": "22900543", "author": {"steamid": "76561197978231677", "num_games_owned": 459, "num_reviews": 11, "playtime_forever": 36, "playtime_last_two_weeks": 0, "last_played": 1462910641}, "language": "english", "review": "As soon as I've found this game on Steam I had to buy it! It was the first game I owned so many years ago and it still feels like the better RTS I've ever played! The mechanics are wonderfully tailored! Not even 19 years make it look old! The graphics are lovely!\n\nFor sure I'll spend some more hundred hours on it!\n\nAnd it runs on Win 10! LOVELY!!!", "timestamp_created": 1462908741, "timestamp_updated": 1462908741, "voted_up": true, "votes_up": 6, "votes_funny": 2, "weighted_vote_score": "0.485977", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22635770": {"recommendationid": "22635770", "author": {"steamid": "76561198034269888", "num_games_owned": 88, "num_reviews": 1, "playtime_forever": 321, "playtime_last_two_weeks": 0, "last_played": 1495081151}, "language": "english", "review": "I love this game. I started playing it as a child. When Windows XP came out, I was sad to see that Seven Kingdoms was not compatible. I would literally set up my families ancient desk top that ran windows 98 just to play this game. A few months ago, I got seven kingdoms 2 hoping it would be just as good as the original. Saddly many of the game mechanics were over symplified in the later edittion. \n\nSeven Kingdoms is an easy game to learn yet dificult to master. Because of complex underlying mechanics, you can almost beat your enemies just to see half your army defect because you haven't maintained moral. Or your economy can stagnate because your trade agrement was broken. \nThe general gameplay is easy to pick up, but to apreciate the depth of this game, you really need to read the manual.", "timestamp_created": 1461614983, "timestamp_updated": 1461615031, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.608985", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22589555": {"recommendationid": "22589555", "author": {"steamid": "76561198013410474", "num_games_owned": 197, "num_reviews": 4, "playtime_forever": 660, "playtime_last_two_weeks": 0, "last_played": 1499516271}, "language": "english", "review": "My very first RTS-Game... Bought it in a weak moment of nostalgia. It aged much better than expected", "timestamp_created": 1461423785, "timestamp_updated": 1461423785, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.552397", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22356717": {"recommendationid": "22356717", "author": {"steamid": "76561197973822719", "num_games_owned": 91, "num_reviews": 4, "playtime_forever": 321, "playtime_last_two_weeks": 0, "last_played": 1506814581}, "language": "tchinese", "review": "好玩\n但是經濟建成比較麻煩\n軍隊也要花時間訓練\n最容易的方式製造投石車\n火砲車等等\n把AI慘虐", "timestamp_created": 1460382894, "timestamp_updated": 1460382894, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22277167": {"recommendationid": "22277167", "author": {"steamid": "76561198048828430", "num_games_owned": 505, "num_reviews": 12, "playtime_forever": 1925, "playtime_last_two_weeks": 0, "last_played": 1485001023}, "language": "koreana", "review": "To me, this was one of the greatest RTS classics of all time along with C&C and Warcraft2.\nMust-buy if you are great fan of classic RTS.\nHope it provided windowed mode, but other than that, it is perfection to me.", "timestamp_created": 1459986931, "timestamp_updated": 1459987007, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504876", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21992041": {"recommendationid": "21992041", "author": {"steamid": "76561197992175965", "num_games_owned": 1109, "num_reviews": 158, "playtime_forever": 48, "playtime_last_two_weeks": 0, "last_played": 1458757707}, "language": "english", "review": "I've always been a HUGE fan of Seven Kingdoms 2: Frythan Wars yet I never got the chance to play the original Seven Kingdoms Ancient Adversaries. I must say, as a classic games enthusiast (and a lover of 90's games) this well-polished strategy game is exactly what I would expect of a well done refurbished classic game. Want a comparison of what this is like? Take Age of Empires and merge it with Warcraft 2 and dash in the 4x-ness of Civilization. You're now probably wondering how these games weren't more popular? That's a great question... see Seven Kingdoms Conquest and you'll get your answer. Seriously though, if you're a fan of indepth RTS's or just classic games, SKAA is a great place to start! Plus I hear there is an active modding community for this game despite it being almost 20 years old!\nGameplay Footage:\nhttps://www.youtube.com/watch?v=mZqXphIwOrI", "timestamp_created": 1458691001, "timestamp_updated": 1458691001, "voted_up": true, "votes_up": 31, "votes_funny": 4, "weighted_vote_score": "0.696300", "comment_count": "6", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 7, "review_score_desc": "Positive", "total_positive": 40, "total_negative": 1, "total_reviews": 41}}
