{"reviews": {"39425996": {"recommendationid": "39425996", "author": {"steamid": "76561197967459214", "num_games_owned": 497, "num_reviews": 25, "playtime_forever": 255, "playtime_last_two_weeks": 168, "last_played": 1516316308}, "language": "english", "review": "I have been following this for some time and up unto now have had limited opportunity to play. Now that the release is imminent I thought I'd have a longer play session to get a real feel for it and I am really pleased that I did.\n\nI had such a good time trying out the various activities, getting used to my dinghy, trying out the various races and looking at some of the experimental stuff. I also took my dinghy out cruising, perched on the front of the boat while it sailed through the water, which was a real treat. \n\nIn summary this is great fun and very reflective of the recent sailing course and solo sailing that I have done. There are also some great tutorials and guidance included, which I went through before I did my sailing course and it really helped.\n\nThe developers are very active and I can't wait for the official release in a few weeks time.", "timestamp_created": 1516237066, "timestamp_updated": 1516237066, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39424656": {"recommendationid": "39424656", "author": {"steamid": "76561198091182490", "num_games_owned": 73, "num_reviews": 1, "playtime_forever": 25, "playtime_last_two_weeks": 25, "last_played": 1515985130}, "language": "english", "review": "I like sim-type games, espcially for VR. This one shows a lot of promise, but I have one big problem that will keep me from playing -- my play space is too small. The controls almost require the same amount of space as sitting in a real boat cockpit, with your arm extended behind working the tiller, and your other hand working the main sail line. I end up bumping into my desk or my racing wheel no matter where I go!\n\nI know we're all just learning about the VR experience and VR gaming, and one other consideration is that it's just not comfortable to control this way -- it's fatiguing to my arms because I have to hold them in space.\n\nWould love to see an alternate control scheme that used the Touch controllers a different way. Perhaps the tiller controlled with the right thumbstick (left/right) and the main sheet with the left thumbstick (up/down)?\n\nEither way, I'm rooting for this title, and those similar to it who are willing to give games like this a try.", "timestamp_created": 1516231307, "timestamp_updated": 1516231457, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1516233949, "developer_response": "Thank you for the review.\n\nSmall playspace can be a challenge - please have a look at this guide for some tips on how to deal with it: http://steamcommunity.com/app/468240/discussions/0/1621726179586127327/\n\nYou can use touch joysticks to control the boat.\n\nGreg"}, "39423464": {"recommendationid": "39423464", "author": {"steamid": "76561197967193986", "num_games_owned": 136, "num_reviews": 1, "playtime_forever": 122, "playtime_last_two_weeks": 122, "last_played": 1516234469}, "language": "english", "review": "I tried the demo for this game when I first got my oculus rift and it was pretty cool back then.  Just decided to check out the full version and am  impressed with how much improvement there's been.\nI've been sailing a few times in real life and this looks and feels about as close as you can get without geting in a real boat.\n\nThings I like:\n- good graphics and sounds\n- fun challenges/races\n- fair price\n- seems like new content is still being developed\n- Has multiplayer\nThings I'd like to see:\n- More maps/tracks for races\n- More boats\n- Multiplayer team racing\n- Races with/against AI", "timestamp_created": 1516226644, "timestamp_updated": 1516226644, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39251735": {"recommendationid": "39251735", "author": {"steamid": "76561198136421655", "num_games_owned": 302, "num_reviews": 79, "playtime_forever": 107, "playtime_last_two_weeks": 0, "last_played": 1511958948}, "language": "english", "review": "Most authentic sailing experience I have ever had on dry land.\n\nI want to come back to this title and really explore everything it has to offer but in my first look review I must say I was impressed and genuinely got that sailing hit I was looking for;\nhttps://www.youtube.com/watch?v=iitVroqc3GQ\nThe developers for this title are keen, enthusiastic, genuinely listening to user feedback and above all actively improving this game on a consistent basis.\n\nThere are a few little things I didn't like, fast flowing water giving you a boost during time trial races, but overall this game has the complete & authentic sailing feel to it that trumps all simulators I have tried previously.\n\n9/10 easily a positive buy for any sailing enthusiast.", "timestamp_created": 1515663439, "timestamp_updated": 1515663439, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.482872", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "39219847": {"recommendationid": "39219847", "author": {"steamid": "76561198047942474", "num_games_owned": 89, "num_reviews": 1, "playtime_forever": 38, "playtime_last_two_weeks": 38, "last_played": 1515542372}, "language": "italian", "review": "Questo gioco è forse il più bello fra quelli VR che ho provato, e li ho provati quasi tutti! In ginocchio sul pavimento guardando l'acqua trasparente vicino una spiaggia... E ancora non ho giocato che mezz'ora!", "timestamp_created": 1515542688, "timestamp_updated": 1515542688, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38779641": {"recommendationid": "38779641", "author": {"steamid": "76561197971811883", "num_games_owned": 150, "num_reviews": 2, "playtime_forever": 41, "playtime_last_two_weeks": 0, "last_played": 1514426136}, "language": "english", "review": "I am running a Windows Mixed Reality headset to play this one. The game (or simulator if you prefer) is beautiful. The visuals are great and the mechanics are what you would expect. I have only one issue with the current implementation of controls, they aren't Windows Mixed Reality Friendly.\n\nFor the Rift or Vive they probably work better. Both of these devices require you to set up sensors around the room which are used to locate the HMD and the controllers. However, for the WMR headsets, they use inside-out technology which does not require installing any external sensors in the room. This also means that any activity behind you is not available to interact with unless you are looking at it. This is the only game, so far, that I have played that requires you to look at the front of the ship while interacting with an object behind you. Since the WMR tracking system can only see 140 degrees from the front, if I try to steer the boat while looking forwards, the game will not recognize that I'm holding the steering.\n\nI would suggest to fix this one of two things. First, if the tracking system loses a controller (I look at the steering, grab it, and move it, then look back in front of me) it should keep me moving in the same direction of the last tracking position as long as I am still holding the trigger. In this state, if I let go of the trigger, the boat should auto-center steering. This would be the best option in my oppinion for Windows Mixed Reality devices.\n\nSecond option would be to have a \"virtual\" steering control in the front of the boat that will manipulate steering controls as if I was doing it from the rear. That way both controllers are in front of me and in view of the inside-out tracking system. This will lose some realism at the expense of better control.\n\nOtherwise the game is worth it.", "timestamp_created": 1514467586, "timestamp_updated": 1514467586, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38165832": {"recommendationid": "38165832", "author": {"steamid": "76561197982987444", "num_games_owned": 183, "num_reviews": 16, "playtime_forever": 75, "playtime_last_two_weeks": 0, "last_played": 1514976299}, "language": "english", "review": "Im a complete sailing novice and really enjoying this game. It gives you a simple interface for interacting with the boats and different tutorials for getting the basics.\n\nHaving this in VR is great fun. I normally play by sitting on the floor while in the Lazer boats which is quite fun.\n\nMore seasoned sailers might fun it too basic but Im really enjoying it.\n\nOne thing I would like to see is more ports to be able to sail to and a map (to find them).", "timestamp_created": 1512778543, "timestamp_updated": 1512778543, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.527897", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37922922": {"recommendationid": "37922922", "author": {"steamid": "76561198048300961", "num_games_owned": 50, "num_reviews": 54, "playtime_forever": 20, "playtime_last_two_weeks": 0, "last_played": 1511945292}, "language": "english", "review": "The Sailing Is First Rate / I Enjoyed Vr Regatta Very Much / I Wait With Anticipation For What This Developer Brings To VR s Future", "timestamp_created": 1511945432, "timestamp_updated": 1511945432, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36245213": {"recommendationid": "36245213", "author": {"steamid": "76561197970329288", "num_games_owned": 1762, "num_reviews": 968, "playtime_forever": 86, "playtime_last_two_weeks": 0, "last_played": 1513771140}, "language": "english", "review": "My Initial Thoughts:\nI have never sailed in my life so this was a cool learning experience. VR made this experience so realistic.... I now feel I could handle a sail boat in real life with confidence and knowledge. The graphics, physics, handling and atmosphere felt spot on and I look forward to honing my seamanship skills again very soon. This is a fun sailing simulator. it has a large expanse and area to explore and it does feature multiplayer. However it's still EA and I was unable to find anyone to sail around with. Having seen early footage of the game I can say this is coming along leaps and bounds.\n(See my 1st Impressions video above for my FULL review)\n\n\nGTX 1060 (6GB) Gameplay with Commentary (1st Impressions):\nhttps://www.youtube.com/watch?v=J-DodwT3dxY", "timestamp_created": 1509724051, "timestamp_updated": 1509800658, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.332494", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "36166671": {"recommendationid": "36166671", "author": {"steamid": "76561197970388132", "num_games_owned": 1100, "num_reviews": 8, "playtime_forever": 100, "playtime_last_two_weeks": 0, "last_played": 1515007627}, "language": "english", "review": "This game needs more. More boats, more islands, more options in multiplayer, more stuff to do. Here and there it is a bit rough around the edges.\nThat being said, i really enjoy it. I don't know crap about sailing but this game makes me feel like I'm actually learning it.\nYou almost can smell a breeze of freedom and you quickly forget you are sitting on your VR room floor.\n\nThe experimental features are close to unplayable for me so far, but it's nice to see what the devs are working on. The fully implemented parts look polished and clean for an early access title.\n\nThe price tag, especially for a VR game, ist more than fair.\n\nFull recommendation, even for non-sailing-enthusiasts.", "timestamp_created": 1509457405, "timestamp_updated": 1509457405, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35993536": {"recommendationid": "35993536", "author": {"steamid": "76561197971685310", "num_games_owned": 1464, "num_reviews": 27, "playtime_forever": 125, "playtime_last_two_weeks": 3, "last_played": 1516347865}, "language": "german", "review": "Tolles Spiel für Segler und Anfänger gleichermaßen geeignet. Es hat wohl schönste VR Hauptmenü das ich in einem Spiel bisher erleben durfte.\nEin gutes spiel um zugang zum Segeln zu finden. Es macht Spass auf dem Wasser das schnellste raus zu holen.\nAn jeder Ecke hat man die Möglichkeit feedback an die Entwickler zu geben.\nEin Spiel mit viel Potenzial.", "timestamp_created": 1508951742, "timestamp_updated": 1508951742, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35837439": {"recommendationid": "35837439", "author": {"steamid": "76561197968617536", "num_games_owned": 298, "num_reviews": 2, "playtime_forever": 443, "playtime_last_two_weeks": 0, "last_played": 1508245790}, "language": "english", "review": "A really great sailing simulation. Each update has added something that either makes it a little easier to control or makes it a little prettier. Fun game to learn the sailing basics and gives you enough knowledge to try sailing for real! It's a good quick fix if you can't actually get out on the water.", "timestamp_created": 1508411785, "timestamp_updated": 1508411785, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.527897", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "35666141": {"recommendationid": "35666141", "author": {"steamid": "76561197973389596", "num_games_owned": 323, "num_reviews": 34, "playtime_forever": 56, "playtime_last_two_weeks": 0, "last_played": 1510696729}, "language": "english", "review": "I have been sailing since I was 8, did some competitions mostly on lasers (and later on a proa) but had to move away from the sea some years ago so I really missed this activity. There are plenty of very complex and detailled \"flat\" sailing simulators, but none can give you the feeling you are actually sailing like VR Regata. I mean .. I was sitting on the floor, ducking to let the boom pass while hurrying to change my side during turns...now I just need someone to move a fan according to the wind direction and throw me a water bucket in the face to feel even more immersed :D\n\nI agree with the points Tristen Sinenju listed in his review. The simulation is not 100% correct and there is room for improvement, but even in its current state, if you would like to sail and are missing the opportunity to do so for real (which, by the way, you definitely should!), then this is the next best thing!", "timestamp_created": 1507837867, "timestamp_updated": 1507837923, "voted_up": true, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.563781", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "35518392": {"recommendationid": "35518392", "author": {"steamid": "76561198248616592", "num_games_owned": 27, "num_reviews": 1, "playtime_forever": 103, "playtime_last_two_weeks": 0, "last_played": 1507399426}, "language": "german", "review": "Hy,\n\nich habe dieses Spiel damals einfach testen wollen. Damals hatte alles noch Klötzchenoptik, war aber dennoch schon interessant von der Steuerung.\nNach langer Zeit habe ich es nun wieder gestartet und bin total begeistert, was daraus geworden ist. Das Feeling ist wirklich toll und idyllisch. Die Details sind super und alles ist schick gestaltet. Man kann richtig die Seele baumeln lassen und kann sogar einiges lernen :-) Ich denke, das Verhalten ist soweit autentisch (zumindest für mich als Nicht-Segler).\nWas noch eine wünschenswerte Änderung wäre: Kollisionsfähigkeit. Es ist sehr creepy, wenn man durch den Sand/die Insel fährt und darin versickert und versucht, sich daraus zu lenken ;) Ich dachte auch erst, es wäre möglich, anzulegen :D - das wäre auch nicht schlecht.\n\nAber alles in allem, bin sehr positiv überrascht von der Entwicklung :-)", "timestamp_created": 1507296786, "timestamp_updated": 1507296786, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "35015038": {"recommendationid": "35015038", "author": {"steamid": "76561197970834839", "num_games_owned": 120, "num_reviews": 14, "playtime_forever": 1321, "playtime_last_two_weeks": 0, "last_played": 1513060035}, "language": "english", "review": "VR Regatta is a excellent sailing simulator.  \n\nMore importantly Greg (one of the developers) and the whole VR Regatta team are one of the most responsive and communicative gaming companies I've ever experienced in the gaming world. Greg is extreemly responsive to all the questions and requests of the customers ask of him (extreemly rare). He's a great developer and other developers should take notice and emulate his eagerness to interact and listen to his customers.\n\n As far as the development of the game goes, the progress is moving along at a good pace getting better and better with every update. I look forward to future updates with anticipation.", "timestamp_created": 1505627272, "timestamp_updated": 1505627272, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.588106", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34909285": {"recommendationid": "34909285", "author": {"steamid": "76561198143490330", "num_games_owned": 100, "num_reviews": 1, "playtime_forever": 274, "playtime_last_two_weeks": 0, "last_played": 1514678628}, "language": "english", "review": "VR Regatta is a wonderful VR sailing sim and, in my opinion, is the most complete and engaging game of its type. When I first started I had no sailing experience whatsoever yet after a minor tutorial I was still able to catch on and get sailing on expansive bodies of water (with sparse object collision) in no time.\n\nThe steering is done by gripping a rudder behind you in with one hand and the other hand controls the rigging/rope for the mainsail. Get yourself at the right angle to the wind direction and you're off! It is a pretty slick and engaging system that, somehow, managed to never give me motion sickness.\n\nThis game has come quite a ways since it was first out in early access and the developer seems to be adding and improving it on a regular basis. Models have been upgraded, a new beach bungalow to start out in and select races or sailing experiences from (I like the relaxing open sailing mode personally), a random sheep, and a big ol yacht. The yacht did cause me to need to lower my supersampling levels for performance but it was worth it.\n\n\nI highly suggest VR Regatta, it is an immersive and relaxing experience that is only bound to get better.", "timestamp_created": 1505254085, "timestamp_updated": 1505254085, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34875053": {"recommendationid": "34875053", "author": {"steamid": "76561198063047955", "num_games_owned": 58, "num_reviews": 9, "playtime_forever": 114, "playtime_last_two_weeks": 15, "last_played": 1515250634}, "language": "english", "review": "I came back to this game and its such a hidden gem. If the devs can add storms and a survival element it would be one of the games i have always dreamed of playing in VR.  \nJust give me the small boat an small supply of food and maybe a cover you need to put up during storms. \nIf you need to get water and food once in a while. i could see myself playing this for hours.", "timestamp_created": 1505096050, "timestamp_updated": 1505096050, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34558227": {"recommendationid": "34558227", "author": {"steamid": "76561197984900311", "num_games_owned": 79, "num_reviews": 4, "playtime_forever": 251, "playtime_last_two_weeks": 0, "last_played": 1513108068}, "language": "german", "review": "Ein fantastisches Segelerlebnis in VR.\nSicherlich gibt es noch viel Potential nach oben aber VR Regatta ist eine Simulation, die wirklich Spass macht und man zwischen relaxtem Dahindümpeln oder einer Rennfahrt mit anderen wählen kann. Ich könnte mir gut vorstellen, dass gerade bei Leuten mit Motionsickness, VR Regatta einen guten Einblick in die VIRTUELLE REALITÄT ermöglichen kann.\nEs gibt zwar nur zwei bzw. drei verschiedene Boote aber die vermitteln in jedem Fall ein tolles Erlebnis. \nIch kann jedem VR Gamer VR Regatta empfehlen.", "timestamp_created": 1503941780, "timestamp_updated": 1503941780, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34452570": {"recommendationid": "34452570", "author": {"steamid": "76561198066590240", "num_games_owned": 1220, "num_reviews": 437, "playtime_forever": 45, "playtime_last_two_weeks": 0, "last_played": 1503872779}, "language": "english", "review": "I went sailing a few times about 10 years ago.  I loved it but moved away from the coastal area.  This game brings back the same joy I felt sailing across the gulf of Mexico.  Absoutely magnificent game.  This is a must buy if you have a VR headset and a if you don't have a VR this is the killer app to make you finally go get one.\n\n10/10 can't wait to sail a whole lot more, wow", "timestamp_created": 1503549792, "timestamp_updated": 1503549792, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34419782": {"recommendationid": "34419782", "author": {"steamid": "76561198011018456", "num_games_owned": 42, "num_reviews": 17, "playtime_forever": 171, "playtime_last_two_weeks": 0, "last_played": 1514748655}, "language": "german", "review": "Absolut erstaunlich. Besonders die ruhigen entspannungstouren laden zum segeln gehen ein. Wen dann der Ehrgeiz packt mag gern an den Regatten nach Rekorden jagen..\n\n+\nGroßartige Idee -dafür wurde VR gamacht!\nAnsprechende Grafik\nEinfache intuitive Steuerung\nbei der großen Yacht teleporting (keine motionsickness)\ntolles Ambiente\n\n-\nDie Schrift ist nicht immer so gut dargestellt, man muss oft sehr nah rangehen\n(noch) nur zwei Boote", "timestamp_created": 1503420852, "timestamp_updated": 1503420852, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34023199": {"recommendationid": "34023199", "author": {"steamid": "76561198064106555", "num_games_owned": 2829, "num_reviews": 234, "playtime_forever": 99, "playtime_last_two_weeks": 0, "last_played": 1506171620}, "language": "english", "review": "Played it the first time when it came out on Steam and was a bit disappointed, especially since there were no real textures in the game.\n\nOne year later I have to admit that the game made huge progress. It has now some pretty ship models, great water effects, sunsets, sunrises and an intersting, but easy way how to navigate the vessels.\n\nIt actually makes you wish you would have done this sailing licence when you were young, when your parents suggested to you they would pay for it. Now I regret that I never did it, since I grew up next to a pretty big lake, where sailing was kind of normal.\n\nI recommend this game for skippers and pirates. It is pretty and fun. Developers are great and respond quickly.\n\nI am more than curious to see what will be implemented next.\n\nRECOMMENDED!\n\n[i] Twitch Channel : https://www.twitch.tv/mrorange55\nYoutube Channel : https://www.youtube.com/channel/UC1UE5TPoF0HX0HVpF_E4uPQ/videos?view_as=subscriber [/i]", "timestamp_created": 1501877621, "timestamp_updated": 1515777374, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.672237", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "34014230": {"recommendationid": "34014230", "author": {"steamid": "76561197977833619", "num_games_owned": 273, "num_reviews": 6, "playtime_forever": 44, "playtime_last_two_weeks": 0, "last_played": 1501813613}, "language": "english", "review": "I'm a professional sailor, and i work as a sailmaker. I'm very impressed with the game. it's not very complex (yet, i hope), but the sailing feels very realistic. controls respond well, and you can shift your body weight around the dinghy to flatten the boat out when you're heeling. the speedometer is nice too, it helps fine-tune the boat.\n\nsuggestions for improvement\n* wind vane at the top of the mast\n* the foresail winch should pull in with the handle, but be released by loosening the tail of the line\n* the boats point a little higher than is realistic and still move upwind. Usually this is a deadzone it’s typically 20-40 degrees off the wind, depending on if the boat is designed for racing or cruising\n* electric winch controls could be added to a binnacle in front of the wheel\n* gps and compass, or other instruments could also bo added\n* similar displays could be added to the mast under the boom\n* the puff mechanic is a little extreme compared to the speed of the boat. the acceleration due to the puff was a little much\n* spinnakers. but i see the controls for them, so maybe it's already in the works\n\nI haven't tried multiplayer, but i think it would be really cool to do big boat racing with a couple friends, each taking a station\n\nOverall, I have really high hopes and praise for the game in the future", "timestamp_created": 1501846976, "timestamp_updated": 1502626881, "voted_up": true, "votes_up": 36, "votes_funny": 0, "weighted_vote_score": "0.810934", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33850906": {"recommendationid": "33850906", "author": {"steamid": "76561198323064387", "num_games_owned": 136, "num_reviews": 2, "playtime_forever": 94, "playtime_last_two_weeks": 0, "last_played": 1501233702}, "language": "english", "review": "Awesome game!", "timestamp_created": 1501230507, "timestamp_updated": 1501230507, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "32631934": {"recommendationid": "32631934", "author": {"steamid": "76561197970548112", "num_games_owned": 130, "num_reviews": 3, "playtime_forever": 87, "playtime_last_two_weeks": 0, "last_played": 1505822020}, "language": "english", "review": "great sim, really enjoyed the free sailing on the bigger yacht. highly recommended.", "timestamp_created": 1498095797, "timestamp_updated": 1498095797, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "32579883": {"recommendationid": "32579883", "author": {"steamid": "76561197961017729", "num_games_owned": 2666, "num_reviews": 254, "playtime_forever": 71, "playtime_last_two_weeks": 0, "last_played": 1495386681}, "language": "english", "review": "I got this game for free, I guess, when it was in it's infancy, and must have been a free to play app. Also, I could have sworn I've written this review already, but Steam is telling me I have not. The game now costs ten dollars! Lots of updates since then -- the ship was just a white block, can you believe it? Now everything is very posh. I don't know much about sailing and can't really give an informed opinion on the mechanics, but I was able to make the ship go, and that was enough for me. I'd say it is worth the asking price, if you want it. They will probably continue to add updates until they get bored. It's the best sailing simulator, ok folks? The best. Believe me. [spoiler]I could have sworn they we're selling Steam donation items for it at one point...[/spoiler] http://steamcommunity.com/sharedfiles/filedetails/?id=930640064", "timestamp_created": 1497919203, "timestamp_updated": 1497919203, "voted_up": true, "votes_up": 24, "votes_funny": 2, "weighted_vote_score": "0.669632", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "32042738": {"recommendationid": "32042738", "author": {"steamid": "76561197996194046", "num_games_owned": 648, "num_reviews": 30, "playtime_forever": 243, "playtime_last_two_weeks": 0, "last_played": 1496068646}, "language": "english", "review": "https://youtu.be/NamI6wTJY-8\n\nI don't know anything about boats or sailing, but having played VR Regatta I feel a little wiser. This game is a sailing simulator and in general a relaxing VR experience. Features of the game include learning about the different parts of the boat, learning about wind and sails, and then of course actually sailing the boat in races or just free-sail relaxation modes. There is also an experimentation mode allowing you to sail on turbulent ocean waters and another mode that lets you walk around the surface of a galleon. It is still in Early Access right now so I feels to me like the game is still finding its identity.\n\nIn terms of simulation, the game is actually not that deep. I expected to be intimidated because I had no sailing experience but really the only thing to get used to is understanding the concept of wind in the sail, and there is a tutorial lesson to help you through that. Once you have that concept, the controls are as simple as turning a rudder and pulling on a rope to manipulate the sail. The only small annoyance was on the larger ship with the steering wheel, the hitboxes can be a little shaky when you are trying to grab the wheel and I found myself clicking around a few times before I could grab the wheel. Other than that, everything is straight forward. There is locomotion in the game for walking around the bigger boats in the form of teleportation, which works perfect for this game.\n\nMaps range in times of day, including night sailing. By far my favorite map was actually the experimental ocean. The possibility to change the water turbulence is so much fun and it was very atmospheric to see huge waves come crashing down on your boat. The immersion for this mode is really fantastic. Understandably in terms of a simulation it's probably not very typical to sail a tiny boat on the ocean, but I would still love to see more stuff like this mode. As of now, there is only a limited amount of boats to sail: A small sailboat that is operated by steering the rudder, and larger yacht with a deck and steering wheel.\n\nThe graphics are overall good but weaker in some specific areas. The water is great and the rolls of the current with the light diffraction is all excellent. The weaker aspect is in the textures of some models. The boat textures are simple but totally fine as the experience is still immersive in VR. However the textures and models for some of the sea creatures popped out at me as being the weakest link. Not enough to ruin the experience or anything, but just an observation. The lighting in the sunsets and sunrises are very good and create a fantastic atmosphere for sailing around.\n\nThe sounds in game are good; great lapping waves and splashing against the boat. Overall the ambiance is quite relaxing, though some maps are seagull heavy! On the ocean map there are some audio issues with looping water sounds being obvious because of a hard clipping on the loop rather than it being seamless, likely because of the chaos of the water in that scene.\n\nAs a VR game, I felt no VR sickness which I think is thanks to the cockpit effect of the boat. Interestingly, I also didn't feel a single bit of sea-sickness despite the sway of the boat. I'm not sure if I was just lucky, but it didn't bother me at all. The closest I came to motion sickness was on the ocean, and even then that was more of an adrenaline sensation from big wave drops than actual discomfort. The immersion factor for this game is really high and if you sit on your floor you get a great sense of presence, sitting in your little boat on the water.\n\nIf you are a sailing enthusiast I think this game will definitely appeal to you. Otherwise, I think this game could be good for anyone who wants a chilled out experience of sitting on a boat, looking at the water and soaking in the environment. I anticipate a huge factor in this game's audience is going to be in the direction of its development. If the game goes further into the simulation aspect with more interaction in the realistic operation of boats, etc, I think it will lead to a more satisfying experience for sailing and boat enthusiasts who are out for an immersive experience. But if the game moves more towards letting players sail more boats, including larger ships like the galleon, and in less realistic circumstances (like the ocean or dreamscape relax mode), it could be more of a 'goofing around with boats' game, and the audience could be wider, though less dedicated.", "timestamp_created": 1496068714, "timestamp_updated": 1501711512, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.525399", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "31009099": {"recommendationid": "31009099", "author": {"steamid": "76561197992319777", "num_games_owned": 306, "num_reviews": 3, "playtime_forever": 271, "playtime_last_two_weeks": 0, "last_played": 1505082875}, "language": "english", "review": "As a novice in actually sailing this sim is pretty darn fun. Needs a bit of polish but I enjoy what exists at the moment. \n", "timestamp_created": 1491621140, "timestamp_updated": 1491621140, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "27079448": {"recommendationid": "27079448", "author": {"steamid": "76561197972054170", "num_games_owned": 357, "num_reviews": 7, "playtime_forever": 138, "playtime_last_two_weeks": 0, "last_played": 1514720604}, "language": "french", "review": "Très sympa (testé avec Oculus Rift DK2 + Razer hydra) et assez réaliste !", "timestamp_created": 1479977367, "timestamp_updated": 1479977367, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "26737760": {"recommendationid": "26737760", "author": {"steamid": "76561197970197230", "num_games_owned": 655, "num_reviews": 23, "playtime_forever": 1, "playtime_last_two_weeks": 0, "last_played": 1479601266}, "language": "german", "review": "Macht spaß und einfach in der handhabung.. wünschte allerdings noch Motorantrieb um im hafen z.b. Anlegen zu können..\n\nMakes fun and easy in the handling .. wished however still motor drive around in the harbor to get port!", "timestamp_created": 1479763905, "timestamp_updated": 1479763905, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "26719725": {"recommendationid": "26719725", "author": {"steamid": "76561198122657925", "num_games_owned": 257, "num_reviews": 8, "playtime_forever": 40, "playtime_last_two_weeks": 0, "last_played": 1486094214}, "language": "english", "review": "VR Regatta is a fantastic experience!  Realistic water and sailing mechanics with smooth frames. This is still early development but I really like what they have for a base. The Devs are very receptive and are clearly looking to flesh this title out. I highly recommend trying this. It's a free demo right now but if they added a bit more content I could easily see this get a full release. \n\nI haven't experienced any sea sickness yet, so don't worry about your sea legs. I highly recommend standing for this game though. Feels much more captain-like. \n\nI can't wait to helm the pirate ship!", "timestamp_created": 1479670631, "timestamp_updated": 1479670631, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.458141", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "26199998": {"recommendationid": "26199998", "author": {"steamid": "76561198253370176", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 12, "playtime_last_two_weeks": 0, "last_played": 1477402773}, "language": "french", "review": "Impossible de démarrer le jeu et d'obtenir des infos de configuration", "timestamp_created": 1477324374, "timestamp_updated": 1477324374, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.429967", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "25810624": {"recommendationid": "25810624", "author": {"steamid": "76561197970586421", "num_games_owned": 398, "num_reviews": 3, "playtime_forever": 39, "playtime_last_two_weeks": 0, "last_played": 1507159250}, "language": "english", "review": "Probably more fun than it sounds. Visuals are a bit sparse but so far this is the only VR game I've played where you can stand on the back of a sheep riding a galleon.", "timestamp_created": 1475366075, "timestamp_updated": 1475366075, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "25075082": {"recommendationid": "25075082", "author": {"steamid": "76561198157946832", "num_games_owned": 162, "num_reviews": 6, "playtime_forever": 17, "playtime_last_two_weeks": 0, "last_played": 1470748430}, "language": "english", "review": "Hi I really like this game. I will try to show it to a sailing club to see what they think about it.\nGreat job! \n\nAnd yeah more tutorial will be good as I would like to know how i can improve my technique at using the sail.", "timestamp_created": 1471879841, "timestamp_updated": 1471879841, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "24617853": {"recommendationid": "24617853", "author": {"steamid": "76561197970149845", "num_games_owned": 2436, "num_reviews": 268, "playtime_forever": 8, "playtime_last_two_weeks": 0, "last_played": 1469893332}, "language": "english", "review": "Wow, really cool. Great content.\n", "timestamp_created": 1469896441, "timestamp_updated": 1469896441, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "24475177": {"recommendationid": "24475177", "author": {"steamid": "76561198062231309", "num_games_owned": 91, "num_reviews": 63, "playtime_forever": 8, "playtime_last_two_weeks": 0, "last_played": 1469088529}, "language": "english", "review": "It's cool cause it feels liek you're in a boat, but it's boring as hell.", "timestamp_created": 1469261873, "timestamp_updated": 1469261873, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.478261", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "24454028": {"recommendationid": "24454028", "author": {"steamid": "76561198018500604", "num_games_owned": 273, "num_reviews": 9, "playtime_forever": 26, "playtime_last_two_weeks": 0, "last_played": 1479448992}, "language": "english", "review": "Great, lots of work to go but a really fun start.", "timestamp_created": 1469164932, "timestamp_updated": 1469164932, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "24378856": {"recommendationid": "24378856", "author": {"steamid": "76561197975827568", "num_games_owned": 36, "num_reviews": 4, "playtime_forever": 22, "playtime_last_two_weeks": 0, "last_played": 1468788669}, "language": "english", "review": "****note to Deevlopers**** Please take out the roll when you crash the boat the yaw induces simulator sickness ****\n\nInterestnig concept pretty decent job of a sailing sim no nausa apart from crashing, i guess that is a god way to stop you hitting other bioats :-)", "timestamp_created": 1468788127, "timestamp_updated": 1468788127, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "24305773": {"recommendationid": "24305773", "author": {"steamid": "76561197990446733", "num_games_owned": 401, "num_reviews": 22, "playtime_forever": 18, "playtime_last_two_weeks": 0, "last_played": 1464724761}, "language": "english", "review": "Relaxing and fun boat driving game :D", "timestamp_created": 1468455540, "timestamp_updated": 1468455540, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "23924376": {"recommendationid": "23924376", "author": {"steamid": "76561198112335919", "num_games_owned": 272, "num_reviews": 100, "playtime_forever": 182, "playtime_last_two_weeks": 0, "last_played": 1508281208}, "language": "english", "review": "I so want a good sailing sim in VR.  Hoping this becomes someting good. At present it's really crude and the boat feels way to big. So the motion control movements are way to big.   Other things I just don't get (a floating whale?).  I'd rather the boat be smaller - more like a sunfish, because it feels like sailing a picnic table in a cargo box. \nI can't recommend it now, but it's free?  so why not try it and show some support.  Also I'm not into the purple, orange boat colors.  All shades of white would be more realistic.  And isn't the goal of a sim to be as realistic as possible.\n\nUPDATE 10-14-16.  I had given this a  \"I can't recommend review\" ABOVE...  the boat has been reduced and redone and is outstanding. we now also have a main sheet.  It's quite fun has a real sailing feel...  needs work - but I SURELY can recommend it now.\n\nChanging from thumbs down to thumbs up - KEEP UP THE GOOD WORK! \nI think it's better than some of the other 2.99 VR titles out there. Maybe 4.99  Getting there!", "timestamp_created": 1467206395, "timestamp_updated": 1476490538, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.497537", "comment_count": "3", "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "23815752": {"recommendationid": "23815752", "author": {"steamid": "76561197994831363", "num_games_owned": 218, "num_reviews": 4, "playtime_forever": 9, "playtime_last_two_weeks": 0, "last_played": 1464924024}, "language": "english", "review": "Really miss virtual sailer, which wasn't VR but was the best sailing game out there.\nI jumped in to have a look at VR Regatta and like the other reviews,  I know it has great potential.\n\nIf this game goes MP, I'm in. \nEverything worked nice. A bit tiring on the steering as for a tight turn, you had to move the stick a metre but I'm sure that will all change.\nI got a little sea sick, but nothing I couldn't handle. \nFunny thing is, I stay on my boat 3 days a fortnight and never get sea sick but some VR games just get to me.\nComfort rating would be a 6 out of 10. \n\nGreat work. Stick with it.\n\n", "timestamp_created": 1466917951, "timestamp_updated": 1466917951, "voted_up": true, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.612005", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "23807653": {"recommendationid": "23807653", "author": {"steamid": "76561198005835519", "num_games_owned": 54, "num_reviews": 1, "playtime_forever": 73, "playtime_last_two_weeks": 0, "last_played": 1491362763}, "language": "english", "review": "Super relaxing and great for anyone who likes sailing!", "timestamp_created": 1466894544, "timestamp_updated": 1466894544, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "23720517": {"recommendationid": "23720517", "author": {"steamid": "76561198137123689", "num_games_owned": 190, "num_reviews": 10, "playtime_forever": 775, "playtime_last_two_weeks": 0, "last_played": 1514669104}, "language": "english", "review": "Fun little sailing game which gives you a nice feeling of motion without feeling sick (at least for me). Being that its free you might as well give it a shot.", "timestamp_created": 1466661653, "timestamp_updated": 1466661653, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "23615075": {"recommendationid": "23615075", "author": {"steamid": "76561198207832577", "num_games_owned": 54, "num_reviews": 20, "playtime_forever": 43, "playtime_last_two_weeks": 0, "last_played": 1505641621}, "language": "schinese", "review": "看起来画面简单的不愿意尝试对吧，但是当你进入游戏后，在那片水上操纵这个帆船，利用风向做出各种转向和加速的动作，你会发现，其实很有趣的。很逼真。我觉得很值得尝试，当然，如果把画面加强海景美丽，帆船也美化一下，是特别享受的", "timestamp_created": 1466175324, "timestamp_updated": 1466175324, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "4.980100", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "23605205": {"recommendationid": "23605205", "author": {"steamid": "76561198025435075", "num_games_owned": 79, "num_reviews": 27, "playtime_forever": 30, "playtime_last_two_weeks": 0, "last_played": 1471732066}, "language": "english", "review": "Fun, simple boating race.", "timestamp_created": 1466120505, "timestamp_updated": 1466120505, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "23488202": {"recommendationid": "23488202", "author": {"steamid": "76561198010458971", "num_games_owned": 248, "num_reviews": 26, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1464744452}, "language": "english", "review": "I have this tendency to kind of sway back and forth a bit unconsciously when I'm just standing in one place for a while. Doing that while in this game made me feel like I was actually on a boat in the water, which was an amazing feeling. It's free, it's relaxing, and it doesn't make you sick. Try it!", "timestamp_created": 1465581936, "timestamp_updated": 1465581936, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "23416819": {"recommendationid": "23416819", "author": {"steamid": "76561198039738544", "num_games_owned": 153, "num_reviews": 57, "playtime_forever": 11, "playtime_last_two_weeks": 0, "last_played": 1477433372}, "language": "english", "review": "There's a bit learning curve and the graphics might not be optimized to the position of controller but if you get used to these, it's actually a pretty neat free game for both relaxing and challenges.", "timestamp_created": 1465213952, "timestamp_updated": 1465213968, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "23383347": {"recommendationid": "23383347", "author": {"steamid": "76561198025740440", "num_games_owned": 85, "num_reviews": 9, "playtime_forever": 12, "playtime_last_two_weeks": 0, "last_played": 1495182932}, "language": "english", "review": "I like sailing, and I love the idea of a VR sailing game. I mean, it could be an issue with motion sickness for some people, but it's a cool idea.\n\nThis is pre-alpha though. Don't expect anything else. But I can see it could form into something pretty cool! It needs lots of work first though.\n\nObservations:\n-Boats have no momentum and will turn on the spot. Makes tacking weird, where you don't need to gather speed before making a tack, nor does carrying speed seem to help.\n-No way of knowing the direction of the wind, no gusts (dark patches on water, arrows over water, etc)\n-I rammed someone while on Port and didn't need to do a 360/720 (BONUS!), this is a feature.\n-The guy I rammed proceeded to push my boat underwater with his epic downwind power, like an asshat.\n-No mainsheet/jibsheet, but fair enough for simplicities sake.\n-Switch of hands with tiller doesnt work.\n-Downwind/running is like 5 times faster than upwind, should be 0.2 to 2 depending on how much of a bathtub you're sailing.\n-Reaching is slower than running.\n-Hmm, actually, change the last 2 points for no apparent wind mechanic.\n\nRegardless, I appreciate the free content, and wish you well on your development!", "timestamp_created": 1465058681, "timestamp_updated": 1465058681, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.546614", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "23368516": {"recommendationid": "23368516", "author": {"steamid": "76561197971896207", "num_games_owned": 314, "num_reviews": 40, "playtime_forever": 7, "playtime_last_two_weeks": 0, "last_played": 1464982283}, "language": "english", "review": "I don't want to click 'No' because it's free and there's no reason not to try it. It's not unpleasant. It just feels like it was thrown together in an afternoon and there's really not much at all to it. It has flying whales though, so if you're into flying whales, it's a must have.", "timestamp_created": 1464988850, "timestamp_updated": 1464988850, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "23353700": {"recommendationid": "23353700", "author": {"steamid": "76561198021170365", "num_games_owned": 462, "num_reviews": 39, "playtime_forever": 25, "playtime_last_two_weeks": 0, "last_played": 1467944550}, "language": "english", "review": "a good little sailing sim, this has a ton of potential.  I made a three minute review here: https://www.youtube.com/watch?v=X-PhQK8re-4&feature=youtu.be", "timestamp_created": 1464915109, "timestamp_updated": 1464915109, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.548872", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "23325688": {"recommendationid": "23325688", "author": {"steamid": "76561198275508709", "num_games_owned": 25, "num_reviews": 2, "playtime_forever": 6, "playtime_last_two_weeks": 0, "last_played": 1464742025}, "language": "english", "review": "Nice proof of concept. It is quite relaxing.  \n\nI can\\'t tell if this game makes me sea sick or vr sick.  Something about the way you are gliding over the water unsettles me.  If there were actual waves causing an up and down motion I would surely vomit within the first 2 minutes.  \n\nI would recommend this game to people who enjoy sailing because the maneuvering seems logical, I don\\'t know if it is accurate because I\\'ve never been in an actual sail boat, and there is definitely a strategy to this game though I have struggled to figure it out.", "timestamp_created": 1464782752, "timestamp_updated": 1464782752, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "23316932": {"recommendationid": "23316932", "author": {"steamid": "76561198032177308", "num_games_owned": 242, "num_reviews": 12, "playtime_forever": 38, "playtime_last_two_weeks": 0, "last_played": 1476613798}, "language": "english", "review": "Having played this a week or so prerelease, I have to say this early access version has improved this experience no end, it's a really immersive sailing feeling now.\n\nWith the free to play price, I can't really complain, it's quite relaxing if you ignore the race, and quite fun if you are into yacht racing, however the textures and models are pretty mismatched and it could do with a bit more content (I really want to throw in a line and fish - or have some islands to sail around in relaxation mode) if it wants to be taken seriously.\n\nAt the moment it is a fine free experience, and well worth a try, but has real potential if kept updated in the future.", "timestamp_created": 1464732465, "timestamp_updated": 1464732465, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.587758", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "23315896": {"recommendationid": "23315896", "author": {"steamid": "76561198015456405", "num_games_owned": 114, "num_reviews": 7, "playtime_forever": 134, "playtime_last_two_weeks": 0, "last_played": 1464780208}, "language": "english", "review": "If you love sailing and dealing with wind  and finding the perfect line, you will like this..its simple and good fun....\nWould love to see other sailing ships,", "timestamp_created": 1464728091, "timestamp_updated": 1464728091, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "23315091": {"recommendationid": "23315091", "author": {"steamid": "76561197970866188", "num_games_owned": 312, "num_reviews": 92, "playtime_forever": 9, "playtime_last_two_weeks": 0, "last_played": 1480887746}, "language": "english", "review": "Please note: At the point of writing this, this is day one of early access of this game (and it shows). \n\nThe potential here is fantastic but a lot of work needs to be done.  The premise is simple. You sail a dingy. You can race or sail in a relaxing manner. The mechanics work well if not overly realistic (water is rarely that smooth). However the simplisic graphics (and whales floating above the water) let the game down. Much better visuals would do a lot for the game (especially in relaxing mode). \n\nIf the game remains \"as is\" then it's great proof of concept idea. VR sailing could work well with the right styles and enviroments. If however the devs keep working on the game then you've set up some intersting foundations for what could be a very interesting VR game . \n\n", "timestamp_created": 1464724985, "timestamp_updated": 1464724985, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "23312667": {"recommendationid": "23312667", "author": {"steamid": "76561198134387731", "num_games_owned": 103, "num_reviews": 24, "playtime_forever": 25, "playtime_last_two_weeks": 0, "last_played": 1481354785}, "language": "english", "review": "The mechanics are very good. It's a fun experience.", "timestamp_created": 1464716624, "timestamp_updated": 1464716624, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.478548", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 53, "total_negative": 1, "total_reviews": 54}}
