{"reviews": {"39489569": {"recommendationid": "39489569", "author": {"steamid": "76561197979928405", "num_games_owned": 198, "num_reviews": 44, "playtime_forever": 339, "playtime_last_two_weeks": 339, "last_played": 1516437288}, "language": "english", "review": "So I ran into a problem with the game when trying to start from Oculus dash without steam vr running. The game would start but have no sound. If i start it from steamvr it works fine.\nWith all that said, the game is fun to play and really its not a game per-say but a story you can interact with to some degree. Interesting take on some characters from history.", "timestamp_created": 1516471343, "timestamp_updated": 1516471343, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39483018": {"recommendationid": "39483018", "author": {"steamid": "76561198055482048", "num_games_owned": 47, "num_reviews": 1, "playtime_forever": 365, "playtime_last_two_weeks": 365, "last_played": 1516413832}, "language": "english", "review": "Had a blast with this game, unique VR experience.", "timestamp_created": 1516454548, "timestamp_updated": 1516454548, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39473707": {"recommendationid": "39473707", "author": {"steamid": "76561198019937330", "num_games_owned": 97, "num_reviews": 13, "playtime_forever": 528, "playtime_last_two_weeks": 450, "last_played": 1516284974}, "language": "japanese", "review": "時間や場所を自由に行き来して、限られた空間で同時多発的に起こる出来事を目撃することが目的、という一風変わったVRゲームです。人や物に干渉できないと聞いて、それって面白いのかな？と疑問でしたが、ストーリーの巧妙さ、システムの快適さ、VRの没入感との相性等が上手くかみ合わさって非常に面白かったです。気になる方は、Quanero VRという2016年の無料作品をやってみることをオススメします。システムが似ていて、その斬新さで当時結構話題になった作品です。Quanero VRは1分ほどの出来事ですが、本ゲームでは作り込まれた1時間以上の群像劇を追いかける事になります。\n\nまず、仕掛け・伏線・ミスリードらが巧みに配置されていたシナリオがとても良く出来ていました。古い時代の洋館で起こる地味な事件…と思いきや、物語は意外な展開をみせます。人物の行動には何度もええっ！と思わされました。シーンやテキストを集め、なるほどそうだったのか、とバラバラだったパズルのピースがハマっていく感覚は快感です。同じ時間を何度も繰り返すのですが、ラストシーンにたどり着くまで飽きることはありませんでした。クリア後おまけ要素と思われるシーンも面白かったのですが、そこは自力発見が困難で、もうちょっとヒントがあっても良かったと思います。\n\nワープ移動・時間操作・ものを掴むなどの操作性は良好です。巻き戻し速度が少し遅いかな。全体を通して見ていないシーンを把握することも簡単で、進行にストレスを感じることはありませんでした。画質はデフォルトだと解像度が低いのですが、ゲーム内オプションで上げてしまえば背景にもボケなどは感じず綺麗です。gtx1070で最高値まで上げても問題はありませんでした。人物のアートスタイルは好みが別れるところかもしれません。\n\n残念ながら日本語は非対応。システム上進行に詰まるということはありませんが、英語が全くできないと楽しめないのは確かです。ただ、字幕は見やすく、一時停止や巻き戻しが自由自在のため、ヒアリングが不得手でも大丈夫。拾って読むメモやニュースも一つ一つはそれほど長くないので、ダレにくいです。むしろ英語の勉強したいな～と思ってる方に丁度いいかもしれません。立ち位置が悪いと字幕が人や物の後ろに隠れちゃうのはちょっと不便でした。\n\nVRアドベンチャーの発展の可能性も感じる一本。Ever17VRとか作られないかな…日本語非対応がつくづく惜しい。\n事前知識として、ほざくかッ！テスラーッ！でググっておくといいかもしれません。", "timestamp_created": 1516420546, "timestamp_updated": 1516420546, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39404538": {"recommendationid": "39404538", "author": {"steamid": "76561198009385242", "num_games_owned": 733, "num_reviews": 6, "playtime_forever": 682, "playtime_last_two_weeks": 614, "last_played": 1515733451}, "language": "english", "review": "Absolutely wonderful and unique experience! The acting was great and the ability to watch the story unfold by altering time makes this truly a one-of-a-kind form of theatre. I hope to see more like this in the future.", "timestamp_created": 1516159292, "timestamp_updated": 1516159292, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500780", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39377390": {"recommendationid": "39377390", "author": {"steamid": "76561197972123857", "num_games_owned": 114, "num_reviews": 3, "playtime_forever": 908, "playtime_last_two_weeks": 908, "last_played": 1516217833}, "language": "english", "review": "Damn, this was a well executed... experience. Think of it as a movie where you can place the camera exactly where you want and rewind the time if you think you missed something. The developers have found a very sweet spot and hit it almost perfectly. Voice acting is top notch. About the only thing I can complain about is that some graphics can be slightly clunky, but that is of very little consequence when you compare it to the rest. Do I want more of this? Oh yes!", "timestamp_created": 1516059178, "timestamp_updated": 1516059178, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500780", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39349077": {"recommendationid": "39349077", "author": {"steamid": "76561197972337172", "num_games_owned": 347, "num_reviews": 112, "playtime_forever": 359, "playtime_last_two_weeks": 359, "last_played": 1515966109}, "language": "english", "review": "Cool story which keeps you guessing. The voice acting is decent, but the animations are sort of awkward at times. The controls are quite janky (on the vive anyway), and the game is also very buggy - both which make the game frustrating to play. Still overall it's an interesting VR experience, which will appeal to those who like story rich experiences.", "timestamp_created": 1515963480, "timestamp_updated": 1515963480, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500780", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39345438": {"recommendationid": "39345438", "author": {"steamid": "76561197972320403", "num_games_owned": 92, "num_reviews": 9, "playtime_forever": 234, "playtime_last_two_weeks": 0, "last_played": 1513027919}, "language": "english", "review": "Well written dialogues, several nice twists in the story. I enjoyed this game together with my wife, one of us in front of the TV, one of us with the headset. \nLet's hope there will be more \"VR-movies\" like this in the future. It's a great experience.", "timestamp_created": 1515954208, "timestamp_updated": 1515954208, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500780", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39320161": {"recommendationid": "39320161", "author": {"steamid": "76561198040654274", "num_games_owned": 500, "num_reviews": 54, "playtime_forever": 643, "playtime_last_two_weeks": 643, "last_played": 1516160160}, "language": "english", "review": "This is a phenomenally well put together experience.  Immersive theatre really is the best description.  Without VR, the closest way to emulate this experience would be hiring a troupe of actors to play out an elaborate murder mystery in an abandoned mansion.  If that sounds awesome... I honestly think you're actually getting a better experience with The Invsisible Hours.  WIth the ability to rewind or speed up time, you don't need to miss a single detail.  You are free to view as little or as much of each of the various storylines as they wind in and out of each others paths.  It is only over when you feel that you have sufficiently understood all of its mysteries.\n\nMy only criticism is that this story's particular structure does not provide room for a traditional denoument.  I would love a greater sense of resolution for the remaining characters.  That being said, I would gladly sign up for more should the developer create similar immersive theatre in the future.  Different settings/genres are ripe for exploring in this exceptionally engrossing new 4D storytelling medium.\n\nI would recommend this experience to anyone with access to a capable VR rig.  If you are into theater, murder mysteries, or new storytelling mediums, find a way to experience this.\n\n(I've played about 6 hrs and still haven't quite found 100% of secrets)", "timestamp_created": 1515876898, "timestamp_updated": 1515877020, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500780", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39195812": {"recommendationid": "39195812", "author": {"steamid": "76561197986674001", "num_games_owned": 539, "num_reviews": 1, "playtime_forever": 755, "playtime_last_two_weeks": 284, "last_played": 1515457243}, "language": "english", "review": "The greatest VR experience I had so far", "timestamp_created": 1515459453, "timestamp_updated": 1515459453, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500780", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39164506": {"recommendationid": "39164506", "author": {"steamid": "76561198286016394", "num_games_owned": 28, "num_reviews": 14, "playtime_forever": 431, "playtime_last_two_weeks": 138, "last_played": 1515342419}, "language": "english", "review": "That was an incredible experience, one I wish continued into a sequel. I’m itching for another gripping story like this one. Please produce more. Highly recommended.", "timestamp_created": 1515359539, "timestamp_updated": 1515359539, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.546099", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39099498": {"recommendationid": "39099498", "author": {"steamid": "76561198027647796", "num_games_owned": 532, "num_reviews": 60, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1515135535}, "language": "english", "review": "Full Review URL - http://www.htcvivegamereviews.com/all-review-list/the-invisible-hours/\nFull Lets Play(ALL CHAPTERS) - http://www.htcvivegamereviews.com/video-list/the-invisible-hours/\n\n9/10\n\nMurder? Intrigue? Following people around? Welcome to the Invisible Hours. The Invisible Hours is a game best described as a VR movie with multiple scenes happening simultaneously. To handle all the things going on and watch them, you will find yourself pausing and rewinding time. Time is a big part of what this game is about.\n\nThe game reminded me a bit of your typical Clue setup – A bunch of guests are at a mansion and the host has been murdered. Who did it?! That’s the premise for the Invisible Hours. For $29.99, you will get quite a bit of game time – myself I clocked in about 3-4 hours. I would normally not say this is enough play time but to be fair, this is 3-4 hours of constant dialogue. In a strange way, I would consider the Invisible Hours more of a “play” than a “movie”. It’s lacking special effects and focuses more upon the stories of each character and their own interactions – not flashy effects.\n\nPlaying the game – it looks good and sounds good. My only problem, initially, was the movement but that was because I didn’t understand I could rotate myself when teleporting by holding down the button. I didn’t figure this out until Chapter 4. Another problem of the game is the “object” mechanic. It works fine when you’re used to it but at the start of a game – there is a lever you must pull to start the game. In any other VR game in existence, you would instinctively grab the lever and pull it down. In this game, you need to think of your hand as a laser pointer and instead point at objects and pull the trigger from a relative distance. Needless to say, starting the game should never be an issue. It’s not as miserably cryptic as Euclidean but still never a good start to the game.\n\nCompared to other games, the “weight” of the VR is felt more in this game. Since much of the game is played passively(ie standing and watching), I’d almost suggest playing it seated. I try to play all my games standing but you really feel a bit of VR fatigue while waiting in this game. For $29.99, it may be a tricky purchase. It’s not a game – you don’t win or lose. In fact, you’re pretty much invisible(ironically). The best way to think of it as a super-special 3d MOVIE – is it worth buying? That’s what it comes down to. I personally enjoyed the game but I also purchased it on sale. $29.99 feels fair for an asking price from the developer due to the presentation and amount of dialogue but as a buyer – it comes down to personal preference. Do you want to play a game you win? Skip this. If you want to have a VR play – here you go.\n\nThe Invisible Hours - The Good\nLooks great\nSounds great\nTons of plot\nInteresting game that keeps you guessing\nThe Invisible Hours - The Bad\nNot a game you win(or lose) - bad to some\nStarting the game(lever mechanic)\nA fairly high priced game depending upon your genre preference\nTeleportation is a little wonky to me(rotation)", "timestamp_created": 1515192711, "timestamp_updated": 1515192711, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500780", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39097591": {"recommendationid": "39097591", "author": {"steamid": "76561198019855603", "num_games_owned": 201, "num_reviews": 1, "playtime_forever": 45, "playtime_last_two_weeks": 0, "last_played": 1514397459}, "language": "english", "review": "If only I were able to delete just one line from the game code this game would probably be great. It's the line that updates the player-Z-rotation-value every time you teleport.\n\nThere is litteraly just one small little feature that ruins the entire game. It's that the game forces me to do an artificial rotation everytime I teleport. When you press the teleport button you will get an arrow to specify what direction you want to face at the new teleport destination. It's impossible to end up in the exact same direction as before the teleport.\n\nI feel like the following reddit post does a great job of summing up my thoughts about this mechanic:\nFor me it moves the game towards \"traditional video game\" and away from \"immersive experience\". It's another artificial motor skill to learn and one that doesn't correlate with my intuitive spacial awareness.\n\nFor me good VR is about reducing the number of artificial factors. The ideal VR experience would be the one where I just moved naturally like I do in the real world. As much as that's currently unobtainable it doesn't excuse adding in kludges that were only really invented because of the limitations of front-facing setups. (random guy on reddit) \n\nEverytime I teleport I have to actively think about how to reorient the entire world and this constantly reminds me that the world is not real. The worst thing is that if you happen to look to the side before teleporting the world orientation will become even more offset. This greatly discourages me from ever looking anywhere else than straight ahead. In the real world we want to look around while we locomote. We never just look straight ahead.\n\nLuckily probably over 99 % of all teleport games does teleportation the right way, by only changing location and not rotation. It would be extremely easy for the TIH-devs to make an update that atleast made this OPTIONAL. I have done a refund but should they fix this in the future I might re-buy the game and then I would be happy to update this review.", "timestamp_created": 1515188035, "timestamp_updated": 1515188035, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.477612", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39080738": {"recommendationid": "39080738", "author": {"steamid": "76561198010253551", "num_games_owned": 118, "num_reviews": 6, "playtime_forever": 172, "playtime_last_two_weeks": 0, "last_played": 1514121925}, "language": "english", "review": "This is something completely new and interesting. It's not realy a game but more of a immersive story unfolding in and around a house. A murder mystery you the player can solve by being an observer. You don't have influence over the story or the characters. You can however rewind and fast forward time. You can move freely in and around the house as the story unfolds.  It's a great experience and you should buy it if you want to do something different in vr", "timestamp_created": 1515151903, "timestamp_updated": 1515151903, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500780", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39060991": {"recommendationid": "39060991", "author": {"steamid": "76561197968496198", "num_games_owned": 439, "num_reviews": 12, "playtime_forever": 524, "playtime_last_two_weeks": 0, "last_played": 1515138382}, "language": "english", "review": "This is... a really fantastic experience for anyone that has the slightest appreciation for a murder mystery. It's a good story and script, with a unique multi-faceted presentation, and multiple interwoven threads of intrigue that don't fully resolve until you've seen the show from every angle.\n\nIt's a really intriguing experiment, and largely successful - I hope to see more experiences like this in future - although it isn't without its rough edges. There are some performance issues, as well as issues with the timeline system. Some items can lose sync with the actor they're paired with, and at least on a couple occasions, actors just disappeared off the timeline.\n\nAdditionally, jumping around between the actors can be a tedious process, find them, rewind until you get to the point where you last left off.\n\nStill, the annoyances are minor, and doesn't really hamper the overall experience. While it's not really the sort of thing that the current demographic of early adopter VR users seem to be fawning over - it's nonetheless a highly recommended experience that anyone that appreciates good art and theatre will find to be uniquely enriching.", "timestamp_created": 1515096516, "timestamp_updated": 1515096516, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.524517", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39059115": {"recommendationid": "39059115", "author": {"steamid": "76561197964889006", "num_games_owned": 678, "num_reviews": 44, "playtime_forever": 91, "playtime_last_two_weeks": 0, "last_played": 1513322734}, "language": "english", "review": "It was an interesting one time 90 minute experience, but not quite interesting enough to bother with the achievements or unlocking \"secrets\" - ie learning a piece of mundane character backstory.", "timestamp_created": 1515093097, "timestamp_updated": 1515093097, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.499220", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39054914": {"recommendationid": "39054914", "author": {"steamid": "76561198049475866", "num_games_owned": 252, "num_reviews": 6, "playtime_forever": 17, "playtime_last_two_weeks": 0, "last_played": 1515042047}, "language": "schinese", "review": "好游戏，推荐！", "timestamp_created": 1515085262, "timestamp_updated": 1515085262, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39040165": {"recommendationid": "39040165", "author": {"steamid": "76561198053210555", "num_games_owned": 323, "num_reviews": 84, "playtime_forever": 160, "playtime_last_two_weeks": 0, "last_played": 1515050950}, "language": "english", "review": "This is a great little whodunit. It's hard to give a length because how long the story takes will be determined by who you chose to follow and how well you piece together the puzzle. I followed the right people at the right times on my first run and so it didn't even take me 3 hours to figure everything out, although I'm still missing some diary entires and a letter that I'm very curious to read so I'll be going back to hunt those down. \n\nIf you don't follow the right people you could end up playing through the chapters multiple times and it could end up taking you 2 to 3 times longer than it did me. Or if you're just curious what everyone was doing, you could replay it just to follow every single person.\n\nOne thing that plesantly surprised me was how much investigating you get to do. I knew you couldn't take part it the story so I figured you just watched everyone and that was it but you get to pick up clues, examine evidence, read letters and diary entires, jump in and out of the story at any time... Even though you're not playing an active role in the story, you do get to do a little bit of detective work which is fun.\n\nOne thing that mildly disappointed me was that a few characters weren't all that useful or important. I expected more staged incidents that would throw you off the scent or suspect the wrong people and while there are a couple of incidents like that, the few characters I'm talking about spent too much time tucked in a corner and not involved in anything so you really had no reason to even pay attention to them.\n\nOverall, it's a great little story that could last you 3-6 hours or more but it is a once-and-done so keep that in mind.", "timestamp_created": 1515052508, "timestamp_updated": 1515052568, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.526564", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39039458": {"recommendationid": "39039458", "author": {"steamid": "76561198070623527", "num_games_owned": 209, "num_reviews": 27, "playtime_forever": 385, "playtime_last_two_weeks": 0, "last_played": 1515113540}, "language": "english", "review": "This game is a MASTERPIECE!\n\n9/10 -F@&% Edison.", "timestamp_created": 1515050316, "timestamp_updated": 1515050316, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500780", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39000612": {"recommendationid": "39000612", "author": {"steamid": "76561198024882388", "num_games_owned": 90, "num_reviews": 2, "playtime_forever": 101, "playtime_last_two_weeks": 0, "last_played": 1515285456}, "language": "english", "review": "Can't even get into the game.  I can't seem to grab the lever that must be grabbed.  Someone said something ridiculous, along the lines of pointing a beam at the lever, but surely that couldn't be the solution.  This is VR after all.  If something asks you to grab it, you simply reach out and grab it, right?", "timestamp_created": 1514959299, "timestamp_updated": 1514959299, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.434138", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38996387": {"recommendationid": "38996387", "author": {"steamid": "76561197972149583", "num_games_owned": 152, "num_reviews": 3, "playtime_forever": 498, "playtime_last_two_weeks": 0, "last_played": 1515281892}, "language": "english", "review": "Wow!! I've never experienced anything quite like it. A murder mystery where the you play the observer in an excellent play of sorts. Four chapters where you can pay attention to every minor detail throughout the \"game\", follow the characters throughout, repeating scenes and interacting with your surroundings. Amazing and constantly suprising. \n\nDon't think this as a short experience, each of the four chapters is 15 minutes but there are a eight characters to follow around throughout the story. This means multiple playthroughs to fully appreciate the interaction between the characters and what their motives and secrets you may find. Not only that, but there is an entire detailed island to discover and all the clues and objects to find to fully complete the story. There are a number of interesting ideas where you may find yourself standing in an upper window and looking down on the interactions through the rain in a different way than standing right next to a group of talking characters. Sound also plays a major part, stand by a wall and hear characters talking in the next room. The only thing missing is smell for a full immersive experience. \n\nPart play, part game, part experience, part puzzler, part traditional adventure, there is so much to discover. I love it.", "timestamp_created": 1514946431, "timestamp_updated": 1515127560, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.506091", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38959502": {"recommendationid": "38959502", "author": {"steamid": "76561197960477697", "num_games_owned": 2136, "num_reviews": 27, "playtime_forever": 42, "playtime_last_two_weeks": 0, "last_played": 1514862489}, "language": "english", "review": "Very interesting piece of interactive entertainment by Tequila Works :)\nGood acting and visuals. Exploring the mansion is pretty cool, with all its secrets.\nTotally recommended!\n\n[Played on VIVE]", "timestamp_created": 1514862677, "timestamp_updated": 1514862677, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.546099", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38900504": {"recommendationid": "38900504", "author": {"steamid": "76561198120420546", "num_games_owned": 12, "num_reviews": 1, "playtime_forever": 394, "playtime_last_two_weeks": 0, "last_played": 1514905710}, "language": "english", "review": "surely this has set a presedent for vr games, excellent game well thought out. my only gripe.........graphics........its a little blurry, any way to correct this?\n9/10.  would have given it 10/10 but for the graphics.", "timestamp_created": 1514725042, "timestamp_updated": 1514725042, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.495453", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38877186": {"recommendationid": "38877186", "author": {"steamid": "76561198016915978", "num_games_owned": 82, "num_reviews": 5, "playtime_forever": 160, "playtime_last_two_weeks": 0, "last_played": 1514669534}, "language": "english", "review": "What a game! Loved it! Fantastic use of VR. \n\nTechnically flawless.\n\nWell done to the devs, and everyone looking for a break from shooting stuff in VR please try this game. Great experience ;)", "timestamp_created": 1514669724, "timestamp_updated": 1514669724, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.506091", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38870977": {"recommendationid": "38870977", "author": {"steamid": "76561197970334132", "num_games_owned": 61, "num_reviews": 9, "playtime_forever": 327, "playtime_last_two_weeks": 0, "last_played": 1514658646}, "language": "finnish", "review": "great game/experience  9/10", "timestamp_created": 1514658850, "timestamp_updated": 1514658850, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38867115": {"recommendationid": "38867115", "author": {"steamid": "76561197964035205", "num_games_owned": 285, "num_reviews": 4, "playtime_forever": 11, "playtime_last_two_weeks": 0, "last_played": 1513978987}, "language": "english", "review": "The game tries to rotate you automatically every time you teleport. This means you have to fix your position every time you move. It's infuriating. Maybe it works in 180 degree seated play, but for standing or roomscale when I'm perfectly capable of moving my real legs, trying to help me out is too obnoxious to ignore.", "timestamp_created": 1514652258, "timestamp_updated": 1514652258, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.476612", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38843734": {"recommendationid": "38843734", "author": {"steamid": "76561197960566229", "num_games_owned": 189, "num_reviews": 4, "playtime_forever": 397, "playtime_last_two_weeks": 0, "last_played": 1514682650}, "language": "english", "review": "Wow!  One of the best and unique VR \"games\" I've ever played.  It's hard to clasify what this is.  It's not quite a game but it's not really a movie either.  The best way to describe it is that it's like a non-interactive Holodeck Novel (from Star Trek).  The \"movie\" plays out around you between the different characters regardless of what room you're in.  If you follow one character around the house, you'll miss what other characters are doing at the same time.  \n\nAs for the \"gameplay\", you can pause, rewind, and fast-forward through the story.  You can teleport around the house.  And there's also a useful map and timeline to keep track of where people are when\n\nThe story is really good!  I had no idea who did it until the end - I won't spoil anything here though.  I started out mostly following Gustav, the detective, around the house; which gave a good backdrop to the main story (i.e. figuring out who murdered Tesla).  But you'll definately want to see what other characters are up to in other areas of the house in order to get the full experience.  There were many times where a character's actions either didn't make sense, or took on an entirely different meaning, once I had gone back and seen a previous scene that I had missed before.  \n\nThere's also a number of achievements and collectibles to find, if you like that sort of thing.  I'd recommend trying to look for most of the collectibles because they do add important background information; these would be various letters, newspaper articles, and Tesla's diaries scattered around.  They're mostly not too hard to find.\n\nMy only negative is about the graphics.  Some movement seems a little stiff and it can look a little awkward when characters interact with objects.  And facial animations aren't so great.  Make sure to look at the in-game Options to increase the settings if you're computer can handle it.\n\nYou should definately buy this if the idea sounds even remotely interesting or if you enjoy story-heavy games.  I'm looking forward to seeing more \"games\" like this!", "timestamp_created": 1514602592, "timestamp_updated": 1514602978, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.612591", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38798138": {"recommendationid": "38798138", "author": {"steamid": "76561197970216799", "num_games_owned": 93, "num_reviews": 8, "playtime_forever": 190, "playtime_last_two_weeks": 0, "last_played": 1515194760}, "language": "english", "review": "Wow. I've played for little more than an hour and I'm still less than 10 minutes into the story, but I'm completely bowled over by it.\n\nThe characters are all great - a sinister bunch with lots to hide. The mansion setting and the look of the game is perfect for the story. The way it develops into all these parallel threads that you can dip in and out of, moving time as you see need to fit the pieces together, is brilliant.\n\nThe voice acting and characterisation is fantastic and the whole thing really draws you in. You really do feel like you're eavesdropping on an unfolding saga. Technically, it's also very good. The default settings are very blurry (temporal anti-aliasing) but thankfully you can change this to msaa and / or super-sampling to make it look nice and crisp - the performance is good too.\n\nI think this is exactly what VR is for - new and engrossing ways of story telling that only work in VR. Worth every penny", "timestamp_created": 1514501989, "timestamp_updated": 1514501989, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.561699", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38753420": {"recommendationid": "38753420", "author": {"steamid": "76561197976355953", "num_games_owned": 352, "num_reviews": 1, "playtime_forever": 387, "playtime_last_two_weeks": 10, "last_played": 1515848977}, "language": "english", "review": "This was the most fun i've had in VR in a long time.\nThe invisible hours are a very immersive and exciting piece of fiction.\nI loved my time with it and now i just want more of this type of storytelling.\nI recommend this to anyone that want an interesting story and exploration.\nThis is a perfect example how storytelling can be done right in VR.", "timestamp_created": 1514408179, "timestamp_updated": 1514408179, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.529337", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38674868": {"recommendationid": "38674868", "author": {"steamid": "76561198043914425", "num_games_owned": 65, "num_reviews": 4, "playtime_forever": 461, "playtime_last_two_weeks": 0, "last_played": 1514320840}, "language": "english", "review": "Increadible! Especially eith VR games where it seems like everybody trying to make as little content as possible and sell as high as they can, awesome to see how much attention went into it. Just awesome, can't recommend enough. Intriguing story, interesting characters, great voice acting.", "timestamp_created": 1514240562, "timestamp_updated": 1514240562, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38614794": {"recommendationid": "38614794", "author": {"steamid": "76561198033294708", "num_games_owned": 110, "num_reviews": 2, "playtime_forever": 306, "playtime_last_two_weeks": 0, "last_played": 1514564072}, "language": "english", "review": "A beautifully executed story with lots of details and possibilities to immerse deep into it - the \"theatre-button\" setting and the tools in there are great. Really true: It's not a film and it's not a theatre; there's something in between. I hope there will be commiing other stories in some different environments, too. For everyone who enjoys studying, watching and exploring and is happy to see a game, that can run backwards literally, too. Thanks to the developers, for that lovely made game.", "timestamp_created": 1514108418, "timestamp_updated": 1514108418, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.537037", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38608894": {"recommendationid": "38608894", "author": {"steamid": "76561198278904140", "num_games_owned": 174, "num_reviews": 23, "playtime_forever": 585, "playtime_last_two_weeks": 0, "last_played": 1515259775}, "language": "english", "review": "This is highly underrated. Bought this on release date but shelved due to a bluriness issue. It's been resolved now in settings. Set AA to MSAA and adjust supersampling slider to 2.0 and now the game looks great. What a fun experience. Be sure to follow all characters throughout each chapter, and keep a close eye on the spirit radio in chapter 4.", "timestamp_created": 1514095892, "timestamp_updated": 1515345584, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500780", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38576085": {"recommendationid": "38576085", "author": {"steamid": "76561198027932402", "num_games_owned": 177, "num_reviews": 25, "playtime_forever": 141, "playtime_last_two_weeks": 47, "last_played": 1516033274}, "language": "english", "review": "The Game works perfect in VR. i hope we get more games like this soon!", "timestamp_created": 1514032877, "timestamp_updated": 1514032877, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.524517", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38566975": {"recommendationid": "38566975", "author": {"steamid": "76561198011391785", "num_games_owned": 543, "num_reviews": 11, "playtime_forever": 291, "playtime_last_two_weeks": 0, "last_played": 1515126481}, "language": "english", "review": "I've always wanted a movie where you could freeroam around and look at what you want. That's what this is. If that concept appeals to you, get this product.", "timestamp_created": 1514017018, "timestamp_updated": 1514017018, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.571506", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38497644": {"recommendationid": "38497644", "author": {"steamid": "76561197973483579", "num_games_owned": 203, "num_reviews": 42, "playtime_forever": 306, "playtime_last_two_weeks": 0, "last_played": 1508360828}, "language": "english", "review": "Love it, I very different experence", "timestamp_created": 1513878760, "timestamp_updated": 1513878760, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37733307": {"recommendationid": "37733307", "author": {"steamid": "76561197996312787", "num_games_owned": 55, "num_reviews": 1, "playtime_forever": 197, "playtime_last_two_weeks": 0, "last_played": 1512084834}, "language": "english", "review": "This game has excellent story telling, voice acting, body acting, and stylization. As a virtual reality mystery game it leaves you hours to observe all scenes from many angles and investigate many clues. Being able to investigate what people are doing at the same time by rewinding time is a lot of fun and adds a new dimension to the game. I recommend turning the graphical settings to Ultra to get the most out of the game. Expect to sit down and savor the game. It is not a fast paced play through but something you want to immerse yourself in.", "timestamp_created": 1511741824, "timestamp_updated": 1511741824, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500780", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37600371": {"recommendationid": "37600371", "author": {"steamid": "76561197971540812", "num_games_owned": 4482, "num_reviews": 24, "playtime_forever": 362, "playtime_last_two_weeks": 0, "last_played": 1511903894}, "language": "english", "review": "Incredible experience, not really a game but very entertaining.\nGreat voice acting but not so great visuals (blurry in VR thanks to an old version of the Unreal engine).\n\nHighly recommended for fans of Agatha Christie stories (the setting feels like such but has some surprises).", "timestamp_created": 1511655536, "timestamp_updated": 1511655536, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.567514", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37332081": {"recommendationid": "37332081", "author": {"steamid": "76561198096412999", "num_games_owned": 293, "num_reviews": 121, "playtime_forever": 300, "playtime_last_two_weeks": 0, "last_played": 1510420101}, "language": "english", "review": "2 Minute Video Review → https://youtu.be/srwXLUwEp9w\n\nI've been looking forward to a VR murder mystery like this for a long time.\nThe experience is mostly about observing the characters, but there is some interaction in the form of item hunting for achievements. The mansion is large with many secrets so for the completionist there's a lot to find.\n\nIf you enjoyed Quanero VR, then you'll love this.\nThis feels like the future of entertainment, I recommend it.", "timestamp_created": 1511529929, "timestamp_updated": 1511529929, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.456171", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37205907": {"recommendationid": "37205907", "author": {"steamid": "76561197989600918", "num_games_owned": 501, "num_reviews": 6, "playtime_forever": 389, "playtime_last_two_weeks": 0, "last_played": 1512859254}, "language": "german", "review": "Einer der besten Titel, den man sich zur Zeit für VR kaufen kann.\nIch bin mir selbst noch nicht sicher, wie stark dabei VR eine Rolle spielt und nicht viel mehr das großartige Drehbuch. Chapeou an den oder die Autor/in. Ein Aha-Erlebnis jagt das andere.\nMMn ein Muss für Fans von Agatha Christie oder aktuellere Beispiele wie Memento oder Prestige.\n\nIch habe bis auf 5-6 Sammelitems übrigens alles angeschaut/gefunden, was das Spiel zu bieten hatte. Mehr als die 5 1/2 Stunden, die ich gebraucht habe, wird man also nicht rausholen können. Weniger sollten es aber auch nicht sein - denn jede Sekunde in Teslas Haus ist es wert, von euch erlebt zu werden!", "timestamp_created": 1511471524, "timestamp_updated": 1511471524, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36773911": {"recommendationid": "36773911", "author": {"steamid": "76561197974532003", "num_games_owned": 451, "num_reviews": 3, "playtime_forever": 359, "playtime_last_two_weeks": 0, "last_played": 1510946263}, "language": "spanish", "review": "Estupenda experiencia en VR, espero que tengamos más parecidas en un futuro", "timestamp_created": 1511381006, "timestamp_updated": 1511381006, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36684792": {"recommendationid": "36684792", "author": {"steamid": "76561197971249727", "num_games_owned": 643, "num_reviews": 17, "playtime_forever": 365, "playtime_last_two_weeks": 0, "last_played": 1511236852}, "language": "english", "review": "Loved this format for VR. I like just being a passive witness and watching the story unfold from multiple points of view and I really liked following the characters around to see what they were up to when left alone. \n\nI seriously hope they make more games like this. It was awesome!", "timestamp_created": 1511304658, "timestamp_updated": 1511304658, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.621139", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36683079": {"recommendationid": "36683079", "author": {"steamid": "76561197972939059", "num_games_owned": 596, "num_reviews": 8, "playtime_forever": 141, "playtime_last_two_weeks": 0, "last_played": 1511248182}, "language": "english", "review": "Too Blurry (Supposedly fixed)\n\nTeleport Only\n\nRequires you to stand in order to avoid Frustrating Camera Angles that constantly change what \"Forward\" direction is.\n\n\n Playing it from a seated 180 perspective, will make it obvious how awful it is.", "timestamp_created": 1511296985, "timestamp_updated": 1514273981, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.285273", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36633905": {"recommendationid": "36633905", "author": {"steamid": "76561198027423390", "num_games_owned": 264, "num_reviews": 6, "playtime_forever": 482, "playtime_last_two_weeks": 0, "last_played": 1511640356}, "language": "english", "review": "I absolutely love this game, though it's not for everyone.  It is a niche game for a niche audience.  Having said that, I don't wish to detract that this is an experience that most people who have purchased VR can enjoy.  This is a passive experience, not a shoot-em up.  They have successfully created a world that you want to inhabit for hours to explore and study.  With good voice and character acting.  VR still has a long way to go, but this is a step in the right direction.\n\nIf you are new to VR and want an exprience to help you clock in some hours to help get accustomed to the helmet, controls, and not worry about nausea, then I definetly recommend this to you.", "timestamp_created": 1511127808, "timestamp_updated": 1511127808, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36624552": {"recommendationid": "36624552", "author": {"steamid": "76561198015339281", "num_games_owned": 582, "num_reviews": 30, "playtime_forever": 644, "playtime_last_two_weeks": 0, "last_played": 1511100687}, "language": "english", "review": "The Invisible Hours is a very solid, narrative-based VR title (it is NOT a game) that is more like a VR theatre play where you can view the story unfold from various angles and various places. There are 8 characters, one of whom died at the start of the game, so you can follow any of the character, see them interact with other character etc. you really have to view the plot from the perspectives of all the characters to get the whole story (which will take about 7 to 8 hours in total). You can rewind, fast forward or pause, and there are also files and photos scattered in the area for you to collect and learn more about the backstory of the characters.\n\nThe story is top notched, and very well written. I have silence gasps as I learn all the secrets being uncovered, the shocking twists, and the ending is certainly a surprise. \n\nIf you love murder mystery story, and has a VR headset, you have no excuse not to get it. I highly recommend it.", "timestamp_created": 1511101662, "timestamp_updated": 1511101662, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36584807": {"recommendationid": "36584807", "author": {"steamid": "76561197970059898", "num_games_owned": 112, "num_reviews": 3, "playtime_forever": 326, "playtime_last_two_weeks": 0, "last_played": 1511013923}, "language": "english", "review": "This is the what VR is great for: immersive storytelling.  Consumers are always begging for games, because that's what they know from decades of flat screens, but this is the way forward: an entirely new form of entertainment!\n\nSuperbly done for an initial effort!  I really enjoyed how the developers solved some of the complex technical issues involved in a multi-character time-fluid storyline, and how they made it fun too.  Completely worth the price of admission!  Wonderful setting, intriguing characters, good attention to detail in each storyline.\n\nNow that the engine's been built, I hope we'll see new stories soon!\n\n(Loved the nod to Lovecraft, and the hats, btw...)\n\nAs far as nitpicks go, I wish the characters didn't fade to black as you get close.  (The camera collision bubble can be much smaller.)  There's a floating lamp in the upper-right room on a bedside table.  Also, in future stories, I hope the way characters speak/interact with one-another is a bit more natural and less \"scripted\" looking.  (It might be worth looking into that Microsoft tech used in the Blade Runner 2049 experience to reduce the animation workload.)\n\nThose niggles aside, this is an outstanding experience that everyone should own!", "timestamp_created": 1510968592, "timestamp_updated": 1510968592, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500780", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36557022": {"recommendationid": "36557022", "author": {"steamid": "76561198000790392", "num_games_owned": 305, "num_reviews": 20, "playtime_forever": 99, "playtime_last_two_weeks": 0, "last_played": 1512930908}, "language": "english", "review": "The Invisible Hours is like a 21st century mutation of theater. The presence afforded through VR is very similar to the sensation of live performance, except even MORE intimate, being a part of a scene and being able to scrutinize it from different perspectives. The ability to interact with props, follow specific characters, take the action backward or forward, all of this is what I want from next gen television, really. \n\nThis is also wonderfully written, with an engaging story, and TESLA! More please!", "timestamp_created": 1510859957, "timestamp_updated": 1510859957, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.546099", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36507796": {"recommendationid": "36507796", "author": {"steamid": "76561198010817612", "num_games_owned": 143, "num_reviews": 9, "playtime_forever": 696, "playtime_last_two_weeks": 0, "last_played": 1510526188}, "language": "french", "review": "oui ca manque d'interactivité, c'est le principe! mais c'est franchement bon! \nun veritable média reinventé: une nouvelle maniere de regarder une serie de la maniere la plus immersive qui soit!\nj'aimerais vraiment voir ce concept poussé encore plus loin!\n\npetit bemol: j'aurais bien aimé plus de musique d'ambiance, mais ca c'est un choix artistique.\n\nje recommande (chaudement)", "timestamp_created": 1510649799, "timestamp_updated": 1510649799, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36388344": {"recommendationid": "36388344", "author": {"steamid": "76561198004281923", "num_games_owned": 285, "num_reviews": 136, "playtime_forever": 414, "playtime_last_two_weeks": 0, "last_played": 1510196404}, "language": "german", "review": "The Invisible Hours ist ein sehr gut inszeniertes Kriminalstück, in welchem man sich frei (Teleport) bewegt, um das Geschehen zu beobachten, Beweise einzusammeln und daraus letztendlich seine persönlichen Schlüsse ziehen kann.\nThe Invisible Hours ist mal ein ganz anderes VR Erlebnis, als die bisher erlebbaren. Grafik (finde ich auf Ultra Einstellung gut genug), Sprache (danke für die deutsche Sprachausgabe) und Sound sind sehr gut gelungen.\nWer sich beim Spielen auch gerne mal entspannen möchte und Spaß am Beobachten hat, der wird The Invisible Hours sehr mögen. Wer Action sucht ist hier definitiv falsch.\nThe Invisible Hours hast mich positiv beindruckt.\nMeinen Dank an die Entwickler und gerne mehr davon...\n\nPunkte 9/10", "timestamp_created": 1510198043, "timestamp_updated": 1510198392, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36303800": {"recommendationid": "36303800", "author": {"steamid": "76561197970609438", "num_games_owned": 61, "num_reviews": 1, "playtime_forever": 261, "playtime_last_two_weeks": 0, "last_played": 1509814687}, "language": "german", "review": "Agatha Christie VR. The best thing is, that You can choose the way to discover the characters, the story and the whole beautiful place. Follow a Person or walk alone through the building and find some secrets to finish the puzzle. Fun, fun, fun. :)", "timestamp_created": 1509902455, "timestamp_updated": 1509903291, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500780", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36166921": {"recommendationid": "36166921", "author": {"steamid": "76561197981632712", "num_games_owned": 405, "num_reviews": 8, "playtime_forever": 372, "playtime_last_two_weeks": 0, "last_played": 1509313294}, "language": "english", "review": "This game is not really a game, but also far away from an \"experience\", it's something different and it's incredibly fun.\nBasically you are just an observer, nobody knows you're there, and you can pause, rewind and fast forward time. You can also \"pick up\" various objects to examine them closer. There are several characters and the story happens simultaneously for everyone. If you choose to follow one, you will miss actions of another, the results of which you might come across later. The voice acting is great (English, don't know about the other languages). The interesting story, which has several twists, takes place over the span of one hour. Though to witness everything you will probably spend about six hours in the game.\nI hope it's a success, because I really really want to see more of this type of game.", "timestamp_created": 1509458013, "timestamp_updated": 1509458013, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500780", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36144915": {"recommendationid": "36144915", "author": {"steamid": "76561198088579320", "num_games_owned": 192, "num_reviews": 7, "playtime_forever": 477, "playtime_last_two_weeks": 0, "last_played": 1509417440}, "language": "english", "review": "This \"game\" is a must have for any VR owner and even though it is technically not a game it is still one of my all time favorite VR titles right now.\nI have so far only completed chapter 2 out of 4 and yet I already have nearly 6 hours in this title.\n\nIf you are unsure whether this is for you, then I would suggest giving quanero vr demo a try, as the story telling and rewind mechanics are very similar to that demo except that this has much more content and proper story.", "timestamp_created": 1509381112, "timestamp_updated": 1509381112, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500780", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36127059": {"recommendationid": "36127059", "author": {"steamid": "76561198063942102", "num_games_owned": 219, "num_reviews": 160, "playtime_forever": 560, "playtime_last_two_weeks": 0, "last_played": 1514008513}, "language": "english", "review": "It's like Quanero VR but not nearly as much rewinding.  You don't need to study each scene in great detail.  The rewinding is really only incase you missed something.\nIf you do miss something you can just play the entire scene again and follow someone else.  \n\nThere's a map that shows all characters locations on the timeline and how much of their activity you \"witnessed\"\n\nIt's fun to follow the characters as they creep around the house to see what they are up to.\nI was really getting into putting myself in a perfect camera postion to maximize the drama.\nit's pretty neat how the characters are all involved in complex situations at all times even when you're\nnot watching.\n\nDecent amount of content if you're gonna crack the case wide open and unlock all the achievements.", "timestamp_created": 1509320640, "timestamp_updated": 1509381564, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.601945", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36102512": {"recommendationid": "36102512", "author": {"steamid": "76561198029543473", "num_games_owned": 54, "num_reviews": 9, "playtime_forever": 282, "playtime_last_two_weeks": 0, "last_played": 1509357072}, "language": "french", "review": "bonjour je voudrais etre remboursée car je ne peux y jouer je n'ai pas le casque d'avance merci", "timestamp_created": 1509262743, "timestamp_updated": 1509262743, "voted_up": true, "votes_up": 0, "votes_funny": 2, "weighted_vote_score": "0.415335", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36101381": {"recommendationid": "36101381", "author": {"steamid": "76561198021130002", "num_games_owned": 670, "num_reviews": 1, "playtime_forever": 341, "playtime_last_two_weeks": 0, "last_played": 1508907571}, "language": "english", "review": "This is awesome! Not only is it a complex and tense mystery, it's also an engaging storytelling experience that, for all of the limitations of VR technology right now, feels innately natural. This is one of the first VR games that I've found myself wanting to play for hours on end.\nCan we get more of this?", "timestamp_created": 1509259575, "timestamp_updated": 1509259575, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500780", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36042517": {"recommendationid": "36042517", "author": {"steamid": "76561198016622757", "num_games_owned": 462, "num_reviews": 11, "playtime_forever": 191, "playtime_last_two_weeks": 0, "last_played": 1509124313}, "language": "english", "review": "I really recommend this, even for this price tag.\n\nGood story and good plot twits.", "timestamp_created": 1509108026, "timestamp_updated": 1509108026, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.470576", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36030188": {"recommendationid": "36030188", "author": {"steamid": "76561198068519995", "num_games_owned": 18, "num_reviews": 10, "playtime_forever": 503, "playtime_last_two_weeks": 0, "last_played": 1510974968}, "language": "english", "review": "This is really cool.  I'm having fun exploring the \"movie\" from various perspectives.   I'm almost done thoroughly exploring chapter 1.   I will probably watch the rest of this from one person's perspective next and then go back and explore again.  The bluriness wasn't as bad as I imagined it would be from what I was hearing other people say.  Characters faces are blurry from a distance but that doesn't bother me.   When they get up close to each other and you are watching them talk to each other, its fine.", "timestamp_created": 1509073383, "timestamp_updated": 1509073383, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500780", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36027642": {"recommendationid": "36027642", "author": {"steamid": "76561197997374644", "num_games_owned": 96, "num_reviews": 35, "playtime_forever": 307, "playtime_last_two_weeks": 0, "last_played": 1509009454}, "language": "english", "review": "This is a very cool piece of \"immersive theatre\", where you get to watch a VR movie play out, but you can fast forward and rewind time and move around the location and track the actors as they play out their parts, while you try to determine who the murderer is (the gameplay is similar to Quanero VR).\n\nIt took me about 4 hours to complete all the scenes with all of the actors, and there is not much replayability unless you want to find all of the collectibles. However, it's a nice non-gaming experience for VR", "timestamp_created": 1509065229, "timestamp_updated": 1509065229, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.522453", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35907896": {"recommendationid": "35907896", "author": {"steamid": "76561198299261178", "num_games_owned": 39, "num_reviews": 6, "playtime_forever": 424, "playtime_last_two_weeks": 0, "last_played": 1508637573}, "language": "english", "review": "This games is awesome! It felt like I was watching a movie play out right in front of me. Great story too with some good twists and suprises. I hope we see more games like this.", "timestamp_created": 1508638702, "timestamp_updated": 1508638702, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.582295", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35898160": {"recommendationid": "35898160", "author": {"steamid": "76561197969101080", "num_games_owned": 320, "num_reviews": 141, "playtime_forever": 304, "playtime_last_two_weeks": 0, "last_played": 1508618271}, "language": "italian", "review": "The Invisible Hours è un esperimento narrativo riuscito ed importante. Il fatto di poter assistere alla rappresentazione da qualsiasi luogo ed in qualsiasi momento vi rende partecipi al cento per cento: non dovrete aspettare che il regista mostri l’assassino, sarete voi a seguirne le tracce. Tanto di cappello a Tequila Works, ha probabilmente inventato un nuovo genere videoludico.\n\n\n[url=https://www.vr-italia.org/the-invisible-hours-review/] Leggi la recensione completa su VR Italia[/url]", "timestamp_created": 1508608073, "timestamp_updated": 1508608073, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.523770", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35884372": {"recommendationid": "35884372", "author": {"steamid": "76561197973513500", "num_games_owned": 209, "num_reviews": 18, "playtime_forever": 105, "playtime_last_two_weeks": 0, "last_played": 1508523766}, "language": "english", "review": "Encore!", "timestamp_created": 1508573104, "timestamp_updated": 1508573104, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500780", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35853891": {"recommendationid": "35853891", "author": {"steamid": "76561198058401985", "num_games_owned": 698, "num_reviews": 13, "playtime_forever": 585, "playtime_last_two_weeks": 0, "last_played": 1511905136}, "language": "german", "review": "Ganz großes Kino! Obwohl, es ist ja kein Film... Aber auch kein Spiel?\n\nEgal, Spaß macht es auf jeden Fall. Über sieben Stunden hat es meine Frau und mich in seinen Bann gezogen - und wir haben trotzdem noch nicht alles entdeckt und gesehen.\n\nGeniales Konzept, großartig umgesetzt, mal was ganz anderes. Und ein Spiel, das auch meine Frau voll fesselt, das ist schon mal ein ganz dickes Lob wert.\n\nWer Krimi oder Mystery mag, wird hier perfekt bedient. Definitiv eins der besten VR-Erlebnisse, die wir bisher hatten, daher klare Kaufempfehlung!", "timestamp_created": 1508465813, "timestamp_updated": 1508465813, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.600000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35847082": {"recommendationid": "35847082", "author": {"steamid": "76561197986622049", "num_games_owned": 235, "num_reviews": 68, "playtime_forever": 504, "playtime_last_two_weeks": 0, "last_played": 1508607337}, "language": "russian", "review": "Шикарный сюжет, необычное и очень интересное представление...\nАнглийский язык тут не очень сложный (делали испанцы). Есть титры.\nРекомендую, очень понравилось.\n\nДаже на Ульта настройках UE движок мылит. Но как то это не очень важным мне показалось именно тут, в любой другой игре наверно бы бесило, но тут нет. Игра не сильно требовательна к железу на Ульра настройках, могли бы разработчики сделать возможность пользователям самостоятельно устанавливать значение суперсэмплинга и отключить тип используемого сглаживания из-за которого мыльное изображение.", "timestamp_created": 1508440400, "timestamp_updated": 1508440604, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.620797", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35830147": {"recommendationid": "35830147", "author": {"steamid": "76561198077708945", "num_games_owned": 156, "num_reviews": 28, "playtime_forever": 272, "playtime_last_two_weeks": 0, "last_played": 1509754446}, "language": "english", "review": "Takes around 4 hours to play through completely without searching for all the collectables. I normally wouldn't recommend something this short for $30 but it was such a good experience. Think of it as a premium movie ticket and justify yourself in buying this game. I'm cheap as hell and I don't regret this purchase.", "timestamp_created": 1508376277, "timestamp_updated": 1508376277, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.563438", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35779996": {"recommendationid": "35779996", "author": {"steamid": "76561198035403697", "num_games_owned": 178, "num_reviews": 1, "playtime_forever": 151, "playtime_last_two_weeks": 0, "last_played": 1508165875}, "language": "french", "review": "Génial ! C'est un cluedo en VR ! \nLa durée de vie du jeu est très courte pour le prix... Mais il y a beaucoup de choses cachées dans le manoir qui augmente considérablement la durée de vie du produit.\n\nPetit bémol sur certains personnages complètement inactif pendant certaines scènes (On peut suivre n'importe quel PNJ dés le début du jeu, mais c'est aussi là que l'on voit le manque de budget, certain PNJ ne font absolument rien pendant qu'une scène importante se déroule ailleurs).\n\nMais malgré cela l'expérience reste unique !", "timestamp_created": 1508184275, "timestamp_updated": 1508184323, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.563492", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35764898": {"recommendationid": "35764898", "author": {"steamid": "76561197978266558", "num_games_owned": 1465, "num_reviews": 231, "playtime_forever": 303, "playtime_last_two_weeks": 0, "last_played": 1508212611}, "language": "english", "review": "Wow! Very impressive! The writing and acting in this are extremely well done and the story really sucked me in. No matter which characters I followed I felt like there was a perfect pace of new secrets being revealed. At the end of each chapter I would watch a different character which would answer and raise new questions. The premise in the end is very clever. I managed to guess the killer correctly the first time for the 'true ending', but going back to see where the other characters end up is an interesting way to tie up loose ends.\n\nThe characters look pretty good most of the time, with lots of recorded details like fabric. But the game itself is very blurry. Increasing the quality helps, but then performance suffers. There's also a strange system that causes compression artifacts in the character faces. They become semitransparent in places and it's really weird seeing through their lips and eyebrows to the scenery behind.\n\nDefinitely check this out if you're interested in murder mysteries and want to see a very new take on telling stories in VR.", "timestamp_created": 1508128499, "timestamp_updated": 1508128499, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.466783", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "35750376": {"recommendationid": "35750376", "author": {"steamid": "76561198239866726", "num_games_owned": 52, "num_reviews": 9, "playtime_forever": 244, "playtime_last_two_weeks": 0, "last_played": 1513908855}, "language": "english", "review": "Wow ...Just ...Wow. This vr experience is absolutely amazing!!!", "timestamp_created": 1508080615, "timestamp_updated": 1508080615, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.546099", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35745219": {"recommendationid": "35745219", "author": {"steamid": "76561197999119601", "num_games_owned": 138, "num_reviews": 30, "playtime_forever": 208, "playtime_last_two_weeks": 0, "last_played": 1509275562}, "language": "english", "review": "Enorats review encompasses very much all of the detail of The Invisible hours. The point of following the characters couldn't be enthersized enough. Just playing through chapter one, doing so reveals both mystery elements, interwoven relationships, backstories, and ofcourse motives for all the characters. All of which is futher fueled by notes, diaries, relating objects, even static objects that seem to have meaning get glanced at by the suspects that fuel intriguing notion.\n\nFull discloser, normally this type of game has a hard job holding my interest, i find cutscenes even a jar to follow through, and at the start of deciding to purchase this, it was very much with the intent of supporting the developer. The first chapter has very much won me over though, beyond just justifing my purchase, which wouldn't have included a review if that was the case.\n\nEnorats highlighted the graphical issues, something i'll futher more by saying that when following the characters, you might miss facial expression as the camera follows at a distance in a resident evil manner. Certainly when the characters are conversing, you must move closer to both see and hear.\n\nEverything else seem to be funtional fair, everything thats readable has been done with an audio, the immersion of the house and setting works, the developers have gone all out to set a high bar going forward.\n\nI couldn't recommend it enough if story/mystery games are your thing, and a game worth getting a VR set for, which is something i've not recommended before in any review.\n", "timestamp_created": 1508067850, "timestamp_updated": 1508067850, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.524517", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35743232": {"recommendationid": "35743232", "author": {"steamid": "76561197970389866", "num_games_owned": 142, "num_reviews": 2, "playtime_forever": 161, "playtime_last_two_weeks": 0, "last_played": 1508062135}, "language": "english", "review": "Brilliant! - of course you need to like a good story and murder mystery.\nYou play an invisible follower of this story, and after just 5 minutes, I get caught up in the story, following the different persons in the house. Its a facinating way to get in deep with the story, and so far I am greatly entertained.\nTook me about 2 hours to follow everyone in the first chapter, so with 4 chapters, I expect a good 8 hour story. I hope for a lot more of this later.", "timestamp_created": 1508062659, "timestamp_updated": 1508062659, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.524517", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35740026": {"recommendationid": "35740026", "author": {"steamid": "76561198003316479", "num_games_owned": 482, "num_reviews": 44, "playtime_forever": 114, "playtime_last_two_weeks": 0, "last_played": 1508299001}, "language": "english", "review": "What sets this apart from all other vr \"games\" i've experienced to this date is how well the facial animations and eye movements are done in this vr game. I don't think any other vr game out there is that attentive to the details of their art assets, and really does a great job of alleviating the \"uncanny valley\" concern that comes with VR storytelling. This \"game\" has set the bar quite high, in my opinion. I hope to see more games do this.", "timestamp_created": 1508053387, "timestamp_updated": 1508053387, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500780", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35739249": {"recommendationid": "35739249", "author": {"steamid": "76561198042238818", "num_games_owned": 164, "num_reviews": 24, "playtime_forever": 454, "playtime_last_two_weeks": 0, "last_played": 1508049610}, "language": "english", "review": "Essentially this is a movie that plays out around you. There are no real objectives, there is no real gameplay. You can't \"beat\" it, or even affect the world in any way. \n\nWhat you can do is fast forward, rewind, and pause time. You can also go back to the \"theater\" you're watching the whole thing from to see a timeline, map, and the locations of each character at each point in time on the map (provided you've actually seen them at that point in time before). Using this you can quickly travel between points in time.\n\nThe entire game takes place over roughly two hours, with about an hour of that being seen by the player. This stretches out a lot more than you'd think however, as characters are moving about the manor interacting with things and each other. If you're thorough you'll end up following each character around for each \"chapter\" to ensure that you see every scene. The story plays out as a very \"Clue\" like murder mystery, with the player either passively watching or (if you're like me) actively trying to catch characters in lies and figure out who the killer is before the end.\n\nAs you play, you'll find yourself marvelling at things you managed to miss. Characters will take actions, leave evidence behind, and you'll probably miss changes made by characters you haven't followed yet.\n\nThis is definitely a unique experience with excellent voice acting. You can really feel the emotions of the characters.\n\nThere are two drawbacks to this game however - The ending, while certainly satisfactory did leave me with questions. I can't really say more than that without spoilers, and spoilers would ruin the entire experience - so I'll leave it at that. I hope that there will be a sequel in the future. The second drawback is the graphics. Up close (such as a foot or two away), things look fairly crisp but with a very low texture resolution. More than a foot or two away though, and things get blurry. Faces become indistinct when someone is merely across a table from you, even on Ultra settings. Perhaps this will get some work done on it, perhaps not - either way, it certainly didn't hamper the experience much.\n\n", "timestamp_created": 1508050904, "timestamp_updated": 1508050904, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.621595", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35723607": {"recommendationid": "35723607", "author": {"steamid": "76561197974737904", "num_games_owned": 59, "num_reviews": 3, "playtime_forever": 347, "playtime_last_two_weeks": 0, "last_played": 1511467787}, "language": "english", "review": "Not a game, per se.  Instead, it's an experience, and a mighty fine one at that.  A written explanation of Invisible Hours really doesn't do it justice.  The title is a bit expensive, but good entertainment has a price.  For anyone on the fence, I recommend downloading Quanero VR (free).  It's also a time manipulation experience that's very similar, but very very much shorter.  If you like Quanero VR with the locomotion of Budget Cuts, you'll likely love this title.", "timestamp_created": 1507999887, "timestamp_updated": 1507999887, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.551910", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35700654": {"recommendationid": "35700654", "author": {"steamid": "76561198052316959", "num_games_owned": 110, "num_reviews": 23, "playtime_forever": 118, "playtime_last_two_weeks": 0, "last_played": 1515079288}, "language": "english", "review": "Good Job!  Hopefully there is another in the making.", "timestamp_created": 1507926746, "timestamp_updated": 1507929100, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.488612", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35689057": {"recommendationid": "35689057", "author": {"steamid": "76561198293216975", "num_games_owned": 133, "num_reviews": 32, "playtime_forever": 225, "playtime_last_two_weeks": 0, "last_played": 1507885910}, "language": "english", "review": "Wow! What a story.", "timestamp_created": 1507892102, "timestamp_updated": 1507892102, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.464911", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35683933": {"recommendationid": "35683933", "author": {"steamid": "76561198191246109", "num_games_owned": 134, "num_reviews": 9, "playtime_forever": 258, "playtime_last_two_weeks": 0, "last_played": 1515209843}, "language": "english", "review": "great experience. The game involves a bit of rewinding/forwarding through different parts of the story, but i actually recommend just letting things play out and exploring, then starting things again and taking a different route. Great quality story and environments.", "timestamp_created": 1507868723, "timestamp_updated": 1507868723, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500780", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35680001": {"recommendationid": "35680001", "author": {"steamid": "76561197970633502", "num_games_owned": 108, "num_reviews": 2, "playtime_forever": 368, "playtime_last_two_weeks": 0, "last_played": 1508621893}, "language": "english", "review": "Very cool concept. Many different plots happen and a scene can read in so many different ways depending on how much information you've gathered from witnessing other character's actions. You get to experience scene both with the feeling that you know what's coming because  you know more than the characters involved in the scene about what has happened before, but also sometimes can be shocked by a surprising twist revealed in a scene, and it's amazing feeling to know you can just stay there and rewind and see what happened and find out the truths. There are lots of twist and turns, and even though you can think of it as one murder mistery story, there's actually 7 characters you can follow around, each with their own unique story thread. \n\nI was dissapointed with the lack of real Occulus support on the steam version fo the game. I played it on a rift with touch controls, and it works but the controls are definitely on the clunky side. Hopefully oculus support can be enabled in a future update since I don't see why the steam verison couldn't support both VIVE and Oculus. \n\nI played this game also on vive, in a bigger room-scale setup and it makes a big difference in the immersion to have more freedom to walk around a scene while observing, rather than relying solely on teleportation. \n\nAll in all this \"game\" was excellent. Looking forward to more of these innovative uses of VR. Growing tired of wave-shooters and horror titles.", "timestamp_created": 1507851294, "timestamp_updated": 1507851294, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.546099", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35668689": {"recommendationid": "35668689", "author": {"steamid": "76561198048615656", "num_games_owned": 269, "num_reviews": 55, "playtime_forever": 889, "playtime_last_two_weeks": 0, "last_played": 1508442867}, "language": "english", "review": "Even if the blur problem isn't sorted out, the game is totally worth its price", "timestamp_created": 1507846317, "timestamp_updated": 1507846317, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.508151", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35665404": {"recommendationid": "35665404", "author": {"steamid": "76561198029279964", "num_games_owned": 1767, "num_reviews": 4, "playtime_forever": 320, "playtime_last_two_weeks": 0, "last_played": 1507790770}, "language": "english", "review": "I'm all for original video games experiences and this kind of game is the reason why I'm glad I picked up VR.\n\nI won't spoil anything regarding the story (game's strong point) and I highly suggest you don't watch anything about the game if you're interested in it as that might deteriorate your experience.\n\nHow to sum up The Invisible Hours ? I'd say it is The prestige (movie) meets And there were none (crime novel) meets The Sexy brutale (game) meets The Last Express (game). So, pretty much my dreamgame on paper.\n\nThe game is around 5 hours long, without trying to find the collectibles. It's biggest strength is not holding the player's hand : you can play the game in whatever way you see fit, rushing through the several chapters following only 1 character, or going through each chapter on a quiet pace while following all the characters. You can also not use the time control powers like rewind or fast-forward at all, or take full advantage of it, it's up to you.\n\nStory, characters, graphics, sound design, voice-acting, controls : everything is pretty good.\n\nThe game has a few problems tho :\n\n- poorly integrated subtitles : the translations are good and use different colors for each character. However, the subtitles vanish if they are in the way of a character, making it really hard to find a good angle to listen closely to any conversation between the characters while reading the subtitles. An easy fix would be to make the subtitles always appear on top of anything it comes across.\n- game is a bit blurry.\n- poorly integrated oculus touch controllers on the steam version : which is especially and incredibly annoying regarding the thumbstick warp as you will accidentally move with it, pretty much all the time.\n- a bit short : the story is about 1h long for a single run, and 5+ hours if you try to discover all the scenes. But the concept is so good that it leaves you wanting more.\n- achievements don't seem to work yet but i don't care (i know some people care about achievements)\n\n\nWhat I thought was especially neat is how you have to find the location of the characters by yourself at any given moment (which you do by exploring the house, looking for them) to be able to follow them. For instance, at a certain chapter of the game, I had lost 2 characters and had no idea of where they were / what they were doing. At first I was angry I couldn't teleport instantly on them in the game's menu with the map and characters icons, but it's actually much better to find them yourself.\n\nI just wish the game was longer as a AAA-game with high budget would have been probably a GOTY solid contender. It's still a very good game worthy of its price. Definitely one of the best VR games out there !", "timestamp_created": 1507835415, "timestamp_updated": 1507835742, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.482700", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35654613": {"recommendationid": "35654613", "author": {"steamid": "76561197970789745", "num_games_owned": 56, "num_reviews": 5, "playtime_forever": 480, "playtime_last_two_weeks": 0, "last_played": 1508592418}, "language": "english", "review": "We have finaly come to a point in VR development, when we start to see really great games released which are both very fun and exiting to play all while using the VR medium to it's full potential. \nAt the the time of writing this review, I'm 1.2 hours in to the game, still in the first act, and I am already completely drawn in to this story. \n\nThe game mechanics are easy to use, yet feels intuitive and very well developed. In essence, you can manipulated time by rewinding, pausing and fast forwarding through the story as well as pick up objects around the mansion and it's suroundings. Many objects, like Teslas Diary pages and photos are important clues needed to solve the murder.  In order to figure this thrilling murder mystery out, you need to follow each person around and collect clues as to how they all fit in to the overal story line. Expect some very interesting plot points!\n\nThe story is great and the voiceacting likewise. All characters feels believable in an Agahta Christie kind of way, very intriguing.\n\nGraphics are good once you set them to \"Ultra\", though as there seems to be no current support for SuperSampling, there is a slight blurry-ness to it. After a while though, you dont' really notice this since the game takes over and you'll be fully imersed in the story. All other aspects of the grahics, except the slight blur, is great with good animations, very well crafted house and suroundings with lots of details and good lightning effects to show.\n\nThere could have been a tutorial to ease the players in; however, after 1 hour you will have understood how it works. Remember to go back to the \"Theater\" to review the clues found and re-play important story plot points. These are all gathered in one room, easy to access. \n\nI highly recommend this game to anyone with a VR headset. This game together with games like Lone Echo assures me that we have a great VR future ahead of us!\n\nA must buy!", "timestamp_created": 1507795185, "timestamp_updated": 1507912694, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35652069": {"recommendationid": "35652069", "author": {"steamid": "76561197973182900", "num_games_owned": 296, "num_reviews": 28, "playtime_forever": 74, "playtime_last_two_weeks": 0, "last_played": 1507780609}, "language": "english", "review": "A very unique and new experience in VR for me. To explain what this experience really is and how it works; essentially you are free to do what ever you want and travel where-ever you want while the story unfolds every-where around you. You feel like some type of time traveller ghost who's inside an 18th century crime drama. It is very well done, as you listen on one conversation you can hear other events/conversations unfolding in other locations if you are close enough. The voice acting is nothing to complain about either. I recommend it.", "timestamp_created": 1507781300, "timestamp_updated": 1507851497, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.524517", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35647290": {"recommendationid": "35647290", "author": {"steamid": "76561197983019438", "num_games_owned": 134, "num_reviews": 4, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1508782300}, "language": "english", "review": "What a great great theater like experience. This is what VR is made for. Exciting story, beautifully written and acted. And a lot of dark secrets to uncover. Great music as well. The english voice acting could be a little better. But the GErman version is great with some good voices. Love this game. Still havn't figured out what's going on. But worth the price.", "timestamp_created": 1507757874, "timestamp_updated": 1507757874, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.583875", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35641814": {"recommendationid": "35641814", "author": {"steamid": "76561198041830822", "num_games_owned": 832, "num_reviews": 7, "playtime_forever": 376, "playtime_last_two_weeks": 0, "last_played": 1509805846}, "language": "english", "review": "One of my favorite VR titles to date. Definitely one of those game you think \"This is why I bought a VR headset\".", "timestamp_created": 1507738908, "timestamp_updated": 1507738908, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.524517", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35633108": {"recommendationid": "35633108", "author": {"steamid": "76561197982933202", "num_games_owned": 537, "num_reviews": 9, "playtime_forever": 56, "playtime_last_two_weeks": 0, "last_played": 1507689153}, "language": "english", "review": "Positives:  So far I really like this concept (just finished ACT 1).  The game plays like a story, although you are allowed free roam of the area and uncover stories about each character.  You find clues and notes around the house and every note is voice acted.  You also have control of time so that you can rewind and watch scenes playout.  The acting is well done and the animation is impressive.  It's really quite a great idea for a game, and well excuted.\n\nNegatives:  The game, even on highest graphical setting, seems a bit blurry / not quite clear.  I'm hoping this can be addressed.  My changes to graphical settings appear to not save as well after restarting the game.  \n\nThe game doesn't appear in my VR games list and thus I can't find it when in SteamVR.  I had to launch from desktop to get it to work.", "timestamp_created": 1507704913, "timestamp_updated": 1507704913, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.528240", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35629888": {"recommendationid": "35629888", "author": {"steamid": "76561197963489560", "num_games_owned": 1087, "num_reviews": 54, "playtime_forever": 102, "playtime_last_two_weeks": 0, "last_played": 1508310146}, "language": "english", "review": "I didn't really think this game would be my jam, but I picked it up solely based on the praises I'm seeing left and right on VR review sites and VR forums talking about how 'fresh' this game is.\n\nI'm an hour in, and this experience gets *very* solid thumbs up from me so far. (Note: the graphics look ugly when you first start, but that's because they're set to 'low' by default- make sure to turn them up in the options menu!)\n\nTo me, this game feels like it marks a point where experiences with more polish are finally starting to do more with VR than just variations of flying/driving around shooting at stuff. This feels like an experience you simply couldn't have outside of VR. (I mean, you *could*, but it just wouldn't be the same).\n\nI love, love, *love* how the house feels alive, each character having their own schedules, motivations, and goals, all moving and acting at once like clockwork, while the game gives you the freedom uncover (or not) as many hidden details as you like. \n\nIf you're merticulous, you can take the time to rewind the clock and follow each and every character to see what they're getting up to, or you can just tail or two, getting a (potentially very different) story about what's going on from their unique perspective on the events.\n\nI thought it was *really* cool how I watched a scene with one set of characters, then they left, and another group wandered into the area, then *completly* misinterpeted the aftermath of the first event. Had I not seen the earlier event myself, this later happening would have meant something *totally* different to me than they ended up meaning.", "timestamp_created": 1507688091, "timestamp_updated": 1507688350, "voted_up": true, "votes_up": 24, "votes_funny": 2, "weighted_vote_score": "0.711363", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35626268": {"recommendationid": "35626268", "author": {"steamid": "76561197966247510", "num_games_owned": 209, "num_reviews": 61, "playtime_forever": 224, "playtime_last_two_weeks": 0, "last_played": 1514310153}, "language": "german", "review": "[table]\n    [tr]\n        [th] [/th]\n        [th]Oh no[/th]\n        [th]Maybe[/th]\n        [th]Great[/th]\n    [/tr]\n    [tr]\n        [td][b] RATING [/b][/td]\n        [td] [/td]\n        [td] [/td]\n        [td][h1] -X- [/h1][/td]\n    [/tr]\n   \n[/table]\n\n[b] Gameplay- und Test- Video: [/b]\nhttps://youtu.be/h-rUzSV86oc\n\n[b] Spielerlebnis: [/b]\nIhr seit Teil eines Theater Stücks welches ihr als Interaktives VR Adventure erlebt. \nIn wie weit Ihr ein Aktiver Teil dieses Spiels seit kann ich momentan noch nicht sagen.\nIhr seit ein unsichtbarer Beobachter einer Krimi Geschichte. Agatha Christie lässt grüssen.\nMit dem Boot angekommen auf der Insel von Herrn Tesla, betritt der Hauptcharakter das Haupthaus.\nDie Tür ist offen, und Herr Tesla liegt tot auf dem Boden. Es sind einige weitere Personen \nals Gäste auf der Insel eingeladen gewesen. Einer muss der Mörder sein. Aber wer?\n\nIhr könnt immer die Zeit anhalten, die Zeit vorspulen oder auch zurückspulen. Jeder der Charakter war zu den verschiedenen Zeiten an anderen Orten. Das geniale ist, dass ihr euch \"jederzeit\" in der Zeit und im Raum bewegen könnt. Somit erhaltet ihr als unsichtbarer Gast die Möglichkeit, zu jeder Zeit an jedem Ort zu sein.\n\nGenial? Ja!\n\n\nBewegungsprofile:\nIhr könnt euch mit Room Scale in euerm Bereich frei bewegen.  Sonstige Fortbewegung wird mit freier Teleportation erreicht. Zudem gibt es einen Verfolgungs Modus in dem die Sichteinstellungen immer an das Geschehen automatisch angepasst werden.\n\n\n[b] Besonderheiten: [/b]\nDieses Spielkonzept bringt euch in ein Krimi Erlebnis  wie ihr es noch nie erlebt habt.\n\n[b] Pro: [/b]\n- Room Scale\n- packende Story\n- Zeit Veränderungs Konzept\n- Packende Atmosphäre\n- Sehr schöne Grafik\n\n\n\n\n[b] Kontra: [/b]\n- kleinere Bugs \n-  [strike] Spiel nicht in VR Bibliothek (Spiel lässt sich mit Brille nicht starten, muss vom Desktop gestartet werden) [/strike] Durch Update behoben.\n- Grafik unscharf auch auf höchster Stufe. (Wahrscheinlich antialiasing Bug)\n\n[b] In aktueller Version gut spielbar?: [/b]\nJa, bis auf leicht unscharfe Grafik\n\n\n[b] Wünsche: [/b]\nMacht das Bild Schärfer ;-)\n[b] Gespielt mit: [/b]\n\nIntel I7 7700K\nGTX 1080Ti\n16GB Ram", "timestamp_created": 1507670492, "timestamp_updated": 1508182073, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.660819", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35624759": {"recommendationid": "35624759", "author": {"steamid": "76561198068633638", "num_games_owned": 116, "num_reviews": 75, "playtime_forever": 241, "playtime_last_two_weeks": 0, "last_played": 1508131892}, "language": "english", "review": "Edit: before you red this review, i wrote it when i had .6 hours of playtime. this is after 2.4 hours now and im about half way through, i still have no idea who the murderer is but im so intrigued by this story line and concent that I have to say this is an absoultely must have. this is so well done, please trust me this is worth your money its something special..(averything afterthis point in my review was written after .6 hours playtime) ...  this is NOT a game, this is an interactive film. Its a brand new concept and its so incredibly fucking cool. Ive barely scratched the surface and im already so damn into this. ITS DONE SO WELL WOW!!! I heard about this a few weeks ago and wasnt sure if it would catch my interest but it most certainly has. The acting and motion capture is so brilliant and the story line has me so damn curious and interested. \n\nmake sure to set the graphics to ultra as they are kinda blurry, its a bummer knowing some people will not appreciate what this seeming materpeice of an idea for VR this is beacuse the game is so blurry. Dont let that stop you from trying this, its certainly so so so much more than some blur. this is a masterpiece you NEED to buy this now to see what i mean, especially if you like movies. YOU ARE INSIDE THE DAMN MOVIE. \n\ncant wait to go back in and see what the heck is going on, this is blowing my mind right now. fucking crazy cool. I have class now but im going to be sitting there thinking about this, i cant wait to uncover the truth!", "timestamp_created": 1507664649, "timestamp_updated": 1507778801, "voted_up": true, "votes_up": 25, "votes_funny": 1, "weighted_vote_score": "0.582131", "comment_count": "12", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 80, "total_negative": 4, "total_reviews": 84}}
