{"reviews": {"39385632": {"recommendationid": "39385632", "author": {"steamid": "76561198070128568", "num_games_owned": 164, "num_reviews": 1, "playtime_forever": 260, "playtime_last_two_weeks": 156, "last_played": 1516094922}, "language": "english", "review": "Don't let the title fool you. This monster isn't sweet, she's downright diabetes inducing if you aren't careful. On a serious note this visual novel is surprisingly really well told. Although it is short. I finished it in 4 hours but I believe it can be finished quicker. The main grip is the plot twist at the end, and if you aren't paying attention enough in the story you will probably be staring at the screen with your jaws to the floor for a hot minute. And a warning: the ending is reaaaaaly disturbing. I mean disturbing enough to make you eye cats through your peripheral for the rest of your life. Especially if they have green eyes. All I have left to say is that she really is the Sweetest Monster.", "timestamp_created": 1516094877, "timestamp_updated": 1516094877, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39380003": {"recommendationid": "39380003", "author": {"steamid": "76561198076655396", "num_games_owned": 163, "num_reviews": 2, "playtime_forever": 180, "playtime_last_two_weeks": 180, "last_played": 1516067341}, "language": "english", "review": "This game is amazing, but the ending has definitely shaken me!", "timestamp_created": 1516070211, "timestamp_updated": 1516070211, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39293308": {"recommendationid": "39293308", "author": {"steamid": "76561197979514852", "num_games_owned": 799, "num_reviews": 6, "playtime_forever": 66, "playtime_last_two_weeks": 66, "last_played": 1515622274}, "language": "english", "review": "The cats aren't what they seem. \n\nShort and sweet horror story, doesn't really explain the inner workings of its own world too much but it doesn't have to. It's like a Lovecraft story in that way, the mechanics aren't important, the happenings are.  The music is a good tone setter too.", "timestamp_created": 1515798147, "timestamp_updated": 1515798147, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39274343": {"recommendationid": "39274343", "author": {"steamid": "76561198121939499", "num_games_owned": 197, "num_reviews": 41, "playtime_forever": 206, "playtime_last_two_weeks": 206, "last_played": 1515738484}, "language": "english", "review": "Just a nice, cute vn where a catgirl calls you Daddy.", "timestamp_created": 1515738827, "timestamp_updated": 1515738827, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.487770", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39227863": {"recommendationid": "39227863", "author": {"steamid": "76561198122589316", "num_games_owned": 28, "num_reviews": 4, "playtime_forever": 148, "playtime_last_two_weeks": 148, "last_played": 1515578697}, "language": "english", "review": "The story was riding upon the reveal at the end, but the foreshadowing gave it away for me too early on. That would've been fine if there was more to it than that, but, for two hours or so of reading, it's only enough to set this up and hope that it pays off for the reader. If you're too perceptive, then there's no point. Nothing is fleshed out enough for the story to survive without that impact at full force.\n\nAlso, the VN doesn't really answer / delve into the elements which set up the twist, and so you're left with more questions than answers. It's understandable for such a short story to leave some things unsaid, but I felt as though the things left unexplored were more interesting than what was given to me. This must have been intentional to decieve people and set up the end, but it wasn't to my tastes. Right at the end of the VN is where the most interesting things could have started to happen, but, again, that's the end.\n\nThere were no choices in this VN, and so there was no reason to save in different slots or to go back or anything like that. It made the already short VN quite a bit shorter. The one path route makes sense with the main character's weak personality, but it was boring for me. It was repetitive. It plays out in a predictable path. Well, maybe not so predictable if you dont' figure out that one thing, but, aside from that, it's quite easy to guess what will happen next.\n\nThe sound effects aren't as good as they could be. Footsteps in certain scenes don't match up with the actual scene at all. They sound out of place, to be exact. So, instead of bringing me into the writing, they took me out of it. The only part where that actually worked is when there are kids talking and screaming and being annoying in the background of a certain scene.\n\nThe art was so-so. It didn't leave a lasting impression on me.\n\nOverall, I wouldn't say it's bad, just... rushing towards that certain scene? It wants to be over too quickly. It makes me think that perhaps that's all the writer had figured out and so that's where it had to end, for better or worse.", "timestamp_created": 1515579391, "timestamp_updated": 1515579391, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39221110": {"recommendationid": "39221110", "author": {"steamid": "76561198025540438", "num_games_owned": 4907, "num_reviews": 489, "playtime_forever": 205, "playtime_last_two_weeks": 0, "last_played": 1515056777}, "language": "english", "review": "Wonderfully well written, at no point was i bored. The writer knows exactly how much detail to give a scene to keep the reader drawn in.\n\nThe twist hit me like a baseball bat to the gut and I enjoy the story to a far greater degree because of it. However, if you're the type who can't suspend their disbelief too much, you may find it fall a bit flat for you, as for as much as I liked it it's a pretty far-fetched scenario.\n\nPersonally, I feel it works a bit better if you just read the book as-is, without self-inserting into the main character's shoes as most other VNs would intend you to do.\n\nFor those concerned, there -is- tidder, but you'll probably feel uncomfortable about googoogiting your gishmoigen to it.\n\nUnless you're like, a really fetishy degenerate or something. Then you'll probably dig it.\n\nAlso, the soundtrack is dope.\n\n9.5/10", "timestamp_created": 1515548409, "timestamp_updated": 1515548409, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39213057": {"recommendationid": "39213057", "author": {"steamid": "76561198083030373", "num_games_owned": 160, "num_reviews": 66, "playtime_forever": 186, "playtime_last_two_weeks": 186, "last_played": 1515520917}, "language": "english", "review": "Mid-life crisis game.", "timestamp_created": 1515521050, "timestamp_updated": 1515521050, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.456587", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39198013": {"recommendationid": "39198013", "author": {"steamid": "76561198073555160", "num_games_owned": 46, "num_reviews": 10, "playtime_forever": 5, "playtime_last_two_weeks": 5, "last_played": 1515467537}, "language": "english", "review": "It took several attempts to get this game to load up, and when it finally did I had to turn my speakers down to 10%.  DAYUM talk about loud.  Don't start this game at night when you're wife's sleeping, because it'll get you hurt!  Anyway, I didn't enjoy the start up quirks, the sound options are all but non existent and the flow is just Click Click Click.", "timestamp_created": 1515467688, "timestamp_updated": 1515467688, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39188717": {"recommendationid": "39188717", "author": {"steamid": "76561198033938564", "num_games_owned": 50, "num_reviews": 7, "playtime_forever": 314, "playtime_last_two_weeks": 161, "last_played": 1515435196}, "language": "english", "review": "You can play it with one hand!\n10/10\n\n\n\nNah I'm joking. Review isn't over yet!\n\nSweetest Monster is Kinetic Visual Novel. What means that you don’t have any choices which can change story. \nBut don’t you worry! It isn’t bad! Sweetest Monster is really good novel!\nIt’s well written.(With great plot twist which will make you  like WHAT? No seriously read it and you will find out! ) Descriptions are really precise which is good especially for this story! It help us readers to dive into world of novel more easily!\n Heroes are interesting and deep so You can love/hate them more passionately!\nArts are really good and enjoyable.\nIt is really fun to read! Music is on point! It makes story more “deep”.\nBut.\nIt’s a bit short. It took me like 5hours but I think it is possible to end it in 4?\nDon’t mind it! It is totally worth playing! I will recommend it to all visual novel fans! \n", "timestamp_created": 1515437183, "timestamp_updated": 1515437183, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39173805": {"recommendationid": "39173805", "author": {"steamid": "76561198028618483", "num_games_owned": 351, "num_reviews": 3, "playtime_forever": 715, "playtime_last_two_weeks": 715, "last_played": 1515389599}, "language": "english", "review": "I've been playing/reading a lot of Visual Novels lately. Not sure why. I guess they pretty low impact but can still have a lot of fun and possibly even depth built into them.\n\nThe author's notes say (minor spoiler) that this is a fanservice-filled VN that sort of punishes enjoying that fanservice, undermining the way most VNs slavishly service the male gaze (my phrasing, not hers).\n\nAs an older male, I think she wrote an old, world-weary man surprisingly well. But then, women aren't taught to ignore the thoughts and feelings of men the way men are taught to ignore those of women. ;-P\n\nI digress, tho. Is the game any good?\n\nWell, it's not really a game. It's a \"kinetic\" visual novel, which means there are no choices to be made. Just words and pictures and sound / music. It really is a [b]visual novel[/b]. It's not exactly an electronic comic book or picture storybook... The author is a VN veteran, and makes good use of the software to tell the story in a way that's different from how it would be told in other media.\n\nSo, given you're just buying a story told in a very particular medium, is the story good? Yes. \n\nThe other horror VN I read recently is [i]Doki Doki Literature Club[/i], and while I'm comparing apples and oranges here, while [i]Doki Doki Literature Club[/i] had more seriously creepy moments (and actually had choices), [i]Sweetest Monster[/i] has a much better, and more personal, story, with much more depth. (On the apples and oranges thing, we're talking personal horror for [i]Sweetest Monster[/i] rather than surreal horror in [i]DDLC[/i]. Very different.)\n\nI [i]did[/i] guess where the story was going about halfway through, so when the climactic moment of horror came, I was able to remove myself from the story enough to enjoy the fanservice, perhaps more than the author would have liked. That said, it was still genuinely creepy/disturbing and afterward, I wasn't 100% sure where the author was going with the epilogue until the end, which drew me back in and put a capstone on the protagonist's damnation.\n\nI already said she wrote the protagonist really well. She wrote the other major character, Bell, equally well, and they play off each other excellently. I don't think anyone reading this is going to get the idea this is a \"typical\" fanservice vehicle from the very start. While some might argue that things went on with Bell longer than should be possible, I suspect the author, like me, was enjoying the interaction so much she didn't care. I didn't care either. It strained credibility a little, but it was so fun and creepy it didn't matter.\n\nSo, it's good. Is it good enough to be worth the money? Well, I guess it depend on how much you got it for. Google tells me the typical horror novel is 80K words or so, and this is 40K words long, and took me about an evening to read. But normal novels don't have excellent atmospheric art and music. So YMMV. \n\nI got [i]Sweetest Monster[/i] for $6 and [i]The Atrocity Archives[/i] is $3 on Kindle and [i]It[/i] is like $12 on Kindle, but that's more apples and oranges. It [i]felt[/i] maybe it was overpriced for the amount of play/reading time I got out of it, but (A) I've been consuming a lot of free VNs, so my sense of cost/value may be super off-kilter and (B) I really liked the story, so even at this price,  I ultimately didn't regret buying it.", "timestamp_created": 1515391790, "timestamp_updated": 1515391790, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39109099": {"recommendationid": "39109099", "author": {"steamid": "76561197996890063", "num_games_owned": 240, "num_reviews": 17, "playtime_forever": 396, "playtime_last_two_weeks": 181, "last_played": 1515221778}, "language": "english", "review": "That was seriously fucked up.", "timestamp_created": 1515221825, "timestamp_updated": 1515221825, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39036506": {"recommendationid": "39036506", "author": {"steamid": "76561198053215759", "num_games_owned": 131, "num_reviews": 9, "playtime_forever": 138, "playtime_last_two_weeks": 0, "last_played": 1515039100}, "language": "english", "review": "This game truly seperates [i]Horror[/i] from [i]Psychological Horror.[/i] (This probably isn't a spoiler but I'll do it just to be safe) [spoiler] Despite not having a single jumpscare or \"scary\" images, it still will haunt my mind far more than a quick startle. [/spoiler] The game is truly disturbing and was definitely worth the money, (actual spoilers) [spoiler] despite the fact that I'll never fully get the image of him fucking his daughter out of my head. [/spoiler]", "timestamp_created": 1515041251, "timestamp_updated": 1515041251, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39004389": {"recommendationid": "39004389", "author": {"steamid": "76561198045529811", "num_games_owned": 304, "num_reviews": 5, "playtime_forever": 145, "playtime_last_two_weeks": 0, "last_played": 1514968341}, "language": "english", "review": "At first I skipped over this one after reading the reviews but the reviews were so positive and they kept talking about a disturbing twist. Eventually my curiousity got the better of me and I purchased this. I would not recommend this VN to the faint of heart.\n\nHm... what to say, what to say. First things first, the twist in this VN is not overhyped in the slightest, I ended up puking in the back of my mouth and it will more than likely haunt me for quite some time and has changed my perception on fanservice in general. Needless to say it made me extremely uncomfortable.\n\nThis VN is a kinetic novel meaning it is just one storyline with no alternate branching paths and while it is short it makes up for it with well written characters, subtle foreshadowing, pretty pictures and a soundtrack that does a good job of tying the atmosphere together.\n\nI really appreciate the author's note at the end of the novel and will definitely be watching the movie recommended by the author.\n\nI had one recurring albiet annoying technical issue. The VN crashed every 5-10 minutes. I was able to fix the crashing by validating my cache. So for me the novel was broken up by the software constantly crashing and me having to re-validate. This seems to be an isolated incident and judging by the crash logs it was the autosave feature that was breaking it, these crashes prevented me from getting 1 of the game's 3 achievements, but I am not a stickler when it comes to achievements so it isn't that big of a problem for me I'm just satisified I got to find out the twist and satiate my curiousity.", "timestamp_created": 1514970917, "timestamp_updated": 1514971679, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38993717": {"recommendationid": "38993717", "author": {"steamid": "76561198143514859", "num_games_owned": 58, "num_reviews": 3, "playtime_forever": 82, "playtime_last_two_weeks": 0, "last_played": 1514915283}, "language": "english", "review": "I brought this thinking it was gonna be a suttle story about a dysfunctional family and ended up being quite disgusted.\n\n10/10 Incest is Wincest", "timestamp_created": 1514939416, "timestamp_updated": 1514939452, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.454545", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38945149": {"recommendationid": "38945149", "author": {"steamid": "76561198090150167", "num_games_owned": 71, "num_reviews": 8, "playtime_forever": 452, "playtime_last_two_weeks": 0, "last_played": 1514158624}, "language": "english", "review": "This was a great novel. \nThe characters are brilliantly written and the pacing is absolutely well timed. There is a lot to like in this VN, you might get annoyed here and there but it's all on purpose. Just like Sally's insistent whining and Robin's noncommittal attitude towards his own family, all leave touching nuances once you take some time to digest it all.\n\nThe story is going more for a immensely obsessive and corrupt route. A good deal of might find this element to be very off putting but, I would still recommend this for it's engaging story. There are some like me that absolutely adore these kinds of \"uncommon\" narrative exploring themes that society might deem gross and disturbing. The ride only ever got sweeter and savory as it goes. \n\nCharacters are magnificently flawed, as in they are nicely fleshed out in time and are relatable. Just like how I mentioned previously with Sally's nagging being her way to reclaim control over her marriage and to assure herself that there is still loved somewhere. Robin's cowardice born from events in his life shrinking his overall confidence and self-esteem. Bell is probably the highlight in this story, she fits in this story almost too perfectly in fact.\n\nAn immensely thought provoking experience that forces you to reconsider what your \"heart\" says and what your fickle moral compass says.", "timestamp_created": 1514830273, "timestamp_updated": 1514830273, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38924502": {"recommendationid": "38924502", "author": {"steamid": "76561197982594293", "num_games_owned": 723, "num_reviews": 19, "playtime_forever": 191, "playtime_last_two_weeks": 5, "last_played": 1515194085}, "language": "english", "review": "I'm ready for the sequel.", "timestamp_created": 1514782588, "timestamp_updated": 1514782588, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38861137": {"recommendationid": "38861137", "author": {"steamid": "76561198163954579", "num_games_owned": 70, "num_reviews": 4, "playtime_forever": 409, "playtime_last_two_weeks": 0, "last_played": 1514281550}, "language": "english", "review": "Sweetest Monster displays an attractive yet slightly eerie art style. It has a well paced, captivating storyline which blends in harmony with the soundtrack to create a haunting atmosphere. \n\nIn Sweetest Monster we get the perspective of Robin: a middle aged man who is struggling to maintain a healthy marriage and has a pitiful relationship with his extremely reserved daughter. He meets a mysterious girl who changes everything for him. You could feel Robin's internal turmoil as the writing conveying his thoughts feels very realistic.  \n\nWhat makes this game so memorable to me is the disturbing, perfectly executed plot twist. Totally sickening and unexpected..\nAnother thing to note is how the sexual content in this game is well thought out; pretty tame, only used to advance the story and not really as fan service.\n\nProps to the devs for creating such an impact with this interesting, messed up story.", "timestamp_created": 1514642191, "timestamp_updated": 1514642191, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38803755": {"recommendationid": "38803755", "author": {"steamid": "76561197990689610", "num_games_owned": 1733, "num_reviews": 29, "playtime_forever": 961, "playtime_last_two_weeks": 0, "last_played": 1514507719}, "language": "english", "review": "A very good little KN. Great art, enjoyable soundtrack, solid writing - though everyone being casually Brittish threw me for  a bit of a loop until I figured out/decided it was on purpose. It's short, of course, as most KN are, and the story is a bit controversial- some people seem to take the message as sanctimonious, but I didn't take it that way at all. A story not being happy isn't the same thing as attacking happy stories. I felt the author's notes were fairly thoughtful. Then there's the people saying it's too obvious- a fair complaint, but when doing the balancing act of providing hints in the narrative to make it not \"out of nowhere,\" it's okay when a story like this errs on the side of caution. \n\nAlso, I must say, that the author seems fairly interested in fan response, and has posted several lengthy, thoughtful replies to player (reader?) comments, and seems to be a very likable person. No bearing on the quality of the work, of course, but it does make the decision to spend money supporting them easier. \n\nAll in all, I thoroughly enjoyed this read, and felt it well worth my time and money. If you go in with reasonable expectations, I suspect you'll feel the same.\n\nwhy did i enjoy the [spoiler]melody menu screen [/spoiler] so much what is wrong with me", "timestamp_created": 1514516065, "timestamp_updated": 1514516065, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.578813", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38759962": {"recommendationid": "38759962", "author": {"steamid": "76561198232506416", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 210, "playtime_last_two_weeks": 0, "last_played": 1498356976}, "language": "english", "review": "i can't say i disliked this game but i found the foreshadowing to be way too obvious and the main character was unbelievably oblivious. [spoiler] i mean he doesn't know what his own daughter looks like? what? [/spoiler]\n\ni have mixed feelings about this one. the disturbing content itself didn't exactly bother me, but how it ufolded did. i expected to be surprised somehow but the whole ending was predictable and i swear i've seen it before. i guess i've seen it all, because this game's ending didn't surprise or impress me one bit.\n\npros:\n[list]\n[*] wonderful (but repetitive) music\n[*] the interesting, complex catgirl\n[*] nice art\n[/list]\n\ncons:\n[list]\n[*] the insufferable main character\n[*] the editing\n[/list]\n\nbut i'll give credit where credit is due. the music and art are nice, and Bell was the only reason i decided to play this game until the end. \n\ni don't know what i expected, but i at least expected Robin to be written better than he was. i dunno. he didn't sound like someone going through a mid-life crisis, he sounded more like a moping teenage girl imo. throw in a couple of cliche things older people routinely say, a few cliche things guys say and there you have it.\n\nanyway i think i might give this another try to see if my opinions change but i doubt it.", "timestamp_created": 1514420857, "timestamp_updated": 1514420857, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.489876", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38737015": {"recommendationid": "38737015", "author": {"steamid": "76561198032552003", "num_games_owned": 584, "num_reviews": 21, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1514238905}, "language": "french", "review": "J'ai apprécié l'histoire et les graphismes.\n\nC'est juste dommage que ce soit une histoire linéaire sans aucun choix à faire :/\n\nCa aurait pu donner une meilleure durée de vie, obtenir plus de détails sur les personnages ...\n\nEnfin bon, il reste bien malgré tout.", "timestamp_created": 1514379858, "timestamp_updated": 1514379858, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38711988": {"recommendationid": "38711988", "author": {"steamid": "76561198099781056", "num_games_owned": 13, "num_reviews": 3, "playtime_forever": 210, "playtime_last_two_weeks": 0, "last_played": 1514858838}, "language": "english", "review": "A really well-written, captivating psycological VN that fans of Saya no Uta will enjoy. Highly reccomend.", "timestamp_created": 1514322325, "timestamp_updated": 1514322325, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38689360": {"recommendationid": "38689360", "author": {"steamid": "76561198326553115", "num_games_owned": 53, "num_reviews": 6, "playtime_forever": 116, "playtime_last_two_weeks": 0, "last_played": 1514277475}, "language": "english", "review": "Had a bit of extra money left over, and saw this. Looked like an interesting kind of thing. I was expecting psychological horror- something like Doki Doki Literature Club.\n\nBUT NOPE.\n\nThere's a very interesting, but DISTURBING AF storyline, that tackles a lot of heavy subjects... but... this story is VISCERAL. From a writer's perspective, this story is masterfully composed, the pacing, the detail, the interaction... I could really feel the internal struggle of Robin (the main character).\n\nThe final twist of the story is... just... it's disturbing. On every possible level, it's just absolutely gut wrenching. I kinda started to see it coming.... but the execution, HOW the twist happens... it is probably one of the best plot twists I've ever seen written, even if it made me sick to my stomach, want to bleach my eyes, and take a shower with my toaster.\n\nHowever- this is a kinetic novel. There's NO choices. It's literally just watching the story unfold. Gameplay itself is nonexistent- you simply immerse yourself in the story. If you're looking for a graphic novel, to just watch as it unfolds, I'd highly recommend you ruin any remaining innocence you have left with this. If you want gameplay... go somewhere else.\n\nAlso, the music is wonderful. It seems a bit repetitive at times, but it's not too annoying, and the music always fits the scenario.\n\nThere is ONE scene with nudity, but there's quite a bit of sexual references going on. And, I have to say, it's actually done pretty tastefully- meaning, sorry boys, this ain't porn. It actually exists to further the plot and develop the characters- something that is pretty hard to do from a writer's perspective. (Just don't get too attached to Bell, please. It WILL get disturbing.)\n\nAll in all, I'd like to say it'd was worth it just to have the experience,. It's an interesting story that does very well, and it's strangely insightful, though very disconcerting as it progresses. But, I doubt I'll run through it again- like I said, there's no choices or anything, so there's nothing else to achieve, and the impact and shock value will likely not hit me quite the same way. It's a good product, but perhaps a bit overpriced, even on sale.\n\nI would like to see more from the devs though, they clearly know how to handle a good story.", "timestamp_created": 1514278672, "timestamp_updated": 1514278672, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.678805", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38686931": {"recommendationid": "38686931", "author": {"steamid": "76561198286573115", "num_games_owned": 27, "num_reviews": 1, "playtime_forever": 175, "playtime_last_two_weeks": 0, "last_played": 1514351737}, "language": "english", "review": "Though the soundtrack gave me a headache 2 hours in, it is still a very good story game and i recommend it to people who love story visual novels.", "timestamp_created": 1514271794, "timestamp_updated": 1514271794, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38679612": {"recommendationid": "38679612", "author": {"steamid": "76561198064679662", "num_games_owned": 243, "num_reviews": 11, "playtime_forever": 255, "playtime_last_two_weeks": 0, "last_played": 1514251548}, "language": "german", "review": "Ein wahrlich besonderes Spiel auf jeglicher Ebene...\n\nDieses Spiel ist in keinster Weise wie die meisten Visual Novels die man so kennt. Es ist dunkel, mysteriös und die Handlung ist außerordentlich gut umschrieben. Jeder Charakter ist auf seine eigene Art und Weise nachzuvollziehen, was jeden irgendwie Liebenswert erscheinen lässt. Wunderbar fand ich auch die Musik, denn auch wenn es nicht so viele Stücke gab hat jedes Lied immer perfekt gepasst.\n\nDie Geschichte, vorallem zum Ende rum, wird immer zugespannter und das Ende vergisst man nun wirklich nicht so schnell...\n\nAlles in allem war Sweetest Monster auf jeden Fall sein Geld wert und ich kann es nur jedem empfehlen der auf die etwas andere Art von Visual Novel steht.", "timestamp_created": 1514252318, "timestamp_updated": 1514252318, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38558486": {"recommendationid": "38558486", "author": {"steamid": "76561198047102190", "num_games_owned": 226, "num_reviews": 9, "playtime_forever": 144, "playtime_last_two_weeks": 0, "last_played": 1514036971}, "language": "english", "review": "Well made game with nice visuals and beautiful music. It's been a while since I've been disturbed by a VN. 10/10 would be disturbed again. <3", "timestamp_created": 1513997393, "timestamp_updated": 1513997393, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38127911": {"recommendationid": "38127911", "author": {"steamid": "76561198139354189", "num_games_owned": 1963, "num_reviews": 4, "playtime_forever": 111, "playtime_last_two_weeks": 0, "last_played": 1500580567}, "language": "russian", "review": "1) Продукт добротный\n2) Английский текст понятен\n3) Сюжет довольно интересный \n\nВ общем фишку сюжета можно описать 4 ассоциациями:\n- Цитатой \"Гоблина\" из м/с \"Робоцып\"- <Вот это !!!!!!!!от>\n- Склейкой Bad Comedian'а на цитату, приведенную выше с кадрами из Зены - <Вот это Surpriiiiiise>\n- Фрагментом из фильма \"Сводные братья\" - <А какого х@ена>\n- Слоганом из рекламы иностранных языков - <ЧЕго б\"\"\"\"?>", "timestamp_created": 1512650866, "timestamp_updated": 1512650866, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.543568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38100565": {"recommendationid": "38100565", "author": {"steamid": "76561198081364369", "num_games_owned": 141, "num_reviews": 7, "playtime_forever": 233, "playtime_last_two_weeks": 0, "last_played": 1512559272}, "language": "english", "review": "I have always been a fan of stories. Most of my childhood was comprised of nothing but reading. This passed on to my videogame tastes as well. \n\nSweetest Monster tells the story of a middle aged father who is having a rough time in his marriage, his relationship with his wife is borderline loveless, and his only daughter most likely hates him. \n\nTo make matters even more complicated though, he meets a seductive and possibly dangerous girl one night. His life is turned even further upside-down from their meeting.\n\nThe story is quite good. Kept me interested the entire way through. It is charming, in a haunting kind of way. If you are a fan of visual novels I see no reason why you shouldnt give this a try. It is on the shorter side, roughly 3ish hours or so.\n\nEnjoy! I know I did! \n\n", "timestamp_created": 1512559876, "timestamp_updated": 1512559876, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38026913": {"recommendationid": "38026913", "author": {"steamid": "76561198040286052", "num_games_owned": 446, "num_reviews": 33, "playtime_forever": 245, "playtime_last_two_weeks": 0, "last_played": 1511874780}, "language": "english", "review": "Very disturbing. Not entirely sure why it's tagged 'psychological horror,' so please don't let that fool you. It's disturbing, yes, but it isn't a scary story in the slightest.\n\nWithout spoiling too much, it's a kinetic visual novel about a middle-aged guy named Robin (that's you!) who's having typical middle-aged family troubles. This all changes, for better or worse, when we meets this adorable catgirl who reminds him of his past.\n\nThe 'revelation' honestly made me feel a little sick to my stomach - but don't let that sway you, it's meant to (you'll also see it coming before so, you'll be a little prepared. There are hints). I definitely liked the darker tones in the story and liked how you play a middle-aged man, not a stupid teenager who can't take a hint as seems to be typical of visual novels. This visual novel will take everything you know about fanservice and shove it in your face and make you feel bad about it. \n\nThere are some typos and a few grammatical errors but they're not hard to look past at all. Probably the only flaw with the game. I would've listed 'kinetic' as a con, as well but it honestly changed my mind about kinetic VNs.\n\nGive it another read after you finish it and you can spot a lot of hints throughout, which is great, I didn't catch them at all the first time. [spoiler] Example: Just why Bell wears certain uniforms at certain times... [/spoiler]\n\nIn all, I'd give it a 9/10 - must read.", "timestamp_created": 1512290907, "timestamp_updated": 1512291101, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.532020", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37920116": {"recommendationid": "37920116", "author": {"steamid": "76561198061188349", "num_games_owned": 34, "num_reviews": 3, "playtime_forever": 570, "playtime_last_two_weeks": 0, "last_played": 1511964950}, "language": "english", "review": "thanks", "timestamp_created": 1511933542, "timestamp_updated": 1511933542, "voted_up": true, "votes_up": 1, "votes_funny": 4, "weighted_vote_score": "0.478261", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37747668": {"recommendationid": "37747668", "author": {"steamid": "76561198075957876", "num_games_owned": 27, "num_reviews": 2, "playtime_forever": 70, "playtime_last_two_weeks": 0, "last_played": 1511757160}, "language": "english", "review": "Interesting game, ending caught me by surprise. xD", "timestamp_created": 1511757431, "timestamp_updated": 1511757431, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37707360": {"recommendationid": "37707360", "author": {"steamid": "76561198303884222", "num_games_owned": 34, "num_reviews": 3, "playtime_forever": 1101, "playtime_last_two_weeks": 0, "last_played": 1511723145}, "language": "english", "review": "I want sequel.", "timestamp_created": 1511723212, "timestamp_updated": 1511723212, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37596502": {"recommendationid": "37596502", "author": {"steamid": "76561198080460851", "num_games_owned": 219, "num_reviews": 1, "playtime_forever": 92, "playtime_last_two_weeks": 0, "last_played": 1511652239}, "language": "english", "review": "Only writing this for the steam badge thingy. Visual novel is pretty damn good though. Will write a review when I can be bothered~", "timestamp_created": 1511652514, "timestamp_updated": 1511652514, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.478261", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37417952": {"recommendationid": "37417952", "author": {"steamid": "76561198236212924", "num_games_owned": 7, "num_reviews": 1, "playtime_forever": 168, "playtime_last_two_weeks": 0, "last_played": 1511641184}, "language": "english", "review": "I feel that the best way to describe this VN would be the infamous Johnny Bravo quote \"I'm sickened but curious\"  It has really pretty art, great music, and a surprisingly stomach churning plot. I bought this game for about 5 dollars during the autumn sale along with some normal visual novels (I.E Nekopara Vol. 0\") and was expecting just basic visual novel stuff\nBOY WAS I WRONG. The story threw me for a loop and made me feel nasty just reading it. So if youre into stories where beyond f*cked up events occur I highly recommend Sweetest Monster.", "timestamp_created": 1511558010, "timestamp_updated": 1511558010, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37328855": {"recommendationid": "37328855", "author": {"steamid": "76561198097268084", "num_games_owned": 227, "num_reviews": 10, "playtime_forever": 253, "playtime_last_two_weeks": 0, "last_played": 1511529009}, "language": "russian", "review": "Masterpiece", "timestamp_created": 1511528814, "timestamp_updated": 1511528814, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37315239": {"recommendationid": "37315239", "author": {"steamid": "76561198297466454", "num_games_owned": 19, "num_reviews": 1, "playtime_forever": 133, "playtime_last_two_weeks": 0, "last_played": 1511523617}, "language": "english", "review": "amazing music brilliant atmosphere and artwork despite the short length", "timestamp_created": 1511523864, "timestamp_updated": 1511523864, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36691426": {"recommendationid": "36691426", "author": {"steamid": "76561198047520016", "num_games_owned": 353, "num_reviews": 7, "playtime_forever": 230, "playtime_last_two_weeks": 0, "last_played": 1511337190}, "language": "english", "review": "fucked up 10/10", "timestamp_created": 1511337227, "timestamp_updated": 1511337227, "voted_up": true, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.517073", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36686318": {"recommendationid": "36686318", "author": {"steamid": "76561198069322101", "num_games_owned": 176, "num_reviews": 3, "playtime_forever": 187, "playtime_last_two_weeks": 0, "last_played": 1510747943}, "language": "english", "review": "10/10 True story, it happened to me when I was 12.", "timestamp_created": 1511313010, "timestamp_updated": 1511313010, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.515003", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36384537": {"recommendationid": "36384537", "author": {"steamid": "76561198096126925", "num_games_owned": 237, "num_reviews": 7, "playtime_forever": 368, "playtime_last_two_weeks": 0, "last_played": 1510642408}, "language": "english", "review": "Before the main bit of this review starts I want to say this, this Vn is a kinetic one that means there are no choices. It moves in one direction only in a way it’s a canon way of the story. Now that’s out of the way let’s begin, the main story revolves around the main character robin Hawkins. Robin is a middle aged man living with his wife, and his daughter who he cannot connect with. Then just as his life began to in a way plummet he meets a curious girl named bell. Now bell in a way throughout the story attempts to (seduce) in a way robin. And as time passes you can see just how much that is affecting him now that may seem kind of cliché but the novel doesn’t follow the *plot* that other Vns follow like say the sakura series. Which goes with the let’s say tits for the win strat but not this one no this novel follows a real plot how I feel novels should be. Now you can say all you want about how you can’t have choices but honestly for me it doesn’t change how good the story is especially the twist at the end some may notice it some may not. But that’s all for this review I say it’s worth it enjoy.", "timestamp_created": 1510179416, "timestamp_updated": 1510179416, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36335105": {"recommendationid": "36335105", "author": {"steamid": "76561198055498625", "num_games_owned": 860, "num_reviews": 37, "playtime_forever": 256, "playtime_last_two_weeks": 0, "last_played": 1510024288}, "language": "english", "review": "I've read quite a few ebi-hime VNs now, and this one has been my least favorite to date. It's not that it's bad, just that I loved their other stories, and this one was a lot less enjoyable in my book. It's a relatively short (~3 hours of read time), kinetic VN. It tells the story of a man who's pretty much going through a mid-life crisis, when he meets a young woman/cat/spirit who professes her love to him because of an event in his childhood. The rest of the story revolves around the struggle between his family and this new \"love\". I think most of the reason for my not liking this story as much as other ebi-hime VNs stems from just how spineless and dislikeable the protagonist is. I never grew to care what happens to him as I did other ebi-hime main characters. The story itself if interesting, if not gripping, with a bit of a twist at the end. The art is well done, if not as good as others they have done. There is no voice acting, and the music is average. There are Steam achievements (3) that are earned just playing through to the finish, as well as trading cards for those interested in them. So, while not their greatest, still recommended as a good, short read. I'd encourage anyone who hasn't read any of ebi-hime's other VNs to not judge any of the other works by this one (if you didn't like this one), as the others really are wonderful reads. I hope this review helps. Thanks.", "timestamp_created": 1510026029, "timestamp_updated": 1510026029, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36209213": {"recommendationid": "36209213", "author": {"steamid": "76561198086782843", "num_games_owned": 13, "num_reviews": 1, "playtime_forever": 218, "playtime_last_two_weeks": 0, "last_played": 1511440835}, "language": "english", "review": "11/10 would ring that Bell again.", "timestamp_created": 1509599055, "timestamp_updated": 1511442047, "voted_up": true, "votes_up": 5, "votes_funny": 11, "weighted_vote_score": "0.600000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36030544": {"recommendationid": "36030544", "author": {"steamid": "76561198137018717", "num_games_owned": 262, "num_reviews": 23, "playtime_forever": 162, "playtime_last_two_weeks": 0, "last_played": 1509083894}, "language": "schinese", "review": "I Love The Charming Girl...\n\nI Love Creepy Love Stories...\n\nLove must be a horrible movie,filled with sex, blood and tears.........then we just sigh...\n\nI even sweep off my foot.\n\nAfter all,  Love is just fancy...even though I will be chasing her all the time~", "timestamp_created": 1509074649, "timestamp_updated": 1509074857, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35981543": {"recommendationid": "35981543", "author": {"steamid": "76561197973968423", "num_games_owned": 532, "num_reviews": 13, "playtime_forever": 271, "playtime_last_two_weeks": 0, "last_played": 1510356553}, "language": "english", "review": "This was a really fun VN, I loved the ending!\nWorth the price of admission, I think. No regrets here.", "timestamp_created": 1508910778, "timestamp_updated": 1508910778, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35895285": {"recommendationid": "35895285", "author": {"steamid": "76561198053581714", "num_games_owned": 206, "num_reviews": 5, "playtime_forever": 102, "playtime_last_two_weeks": 0, "last_played": 1508601021}, "language": "english", "review": "This is the third Visual Novel by ebi-hime that I have read and I really love her writing!\nShe always takes the time to explain the reasons she's making a game and I think it's especially great this time around.\n\nIt's not a very long story but it leaves a very lasting impression, at least it did for me.\nThe artwork is nice, the music fitting and the writing superb!\nSo if you're interested in a VN that isn't all fluffy, which you have probably guessed by all the other reviews and pictures, then go for it. It's worth it. Just don't spoil yourself the ending, please.", "timestamp_created": 1508601594, "timestamp_updated": 1511599310, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35757923": {"recommendationid": "35757923", "author": {"steamid": "76561198136268281", "num_games_owned": 351, "num_reviews": 10, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1508098655}, "language": "russian", "review": "Визуальная новелла.\nРисовка местами вызывает нарекания.\nСюжет, при некотором опыте в подобные игры, предсказуем.\nТем более что автор оставил скрытые ( или нет ) намёки.\nМузыка вполне подходит.\nНо вот некоторые звуковые эффекты раздражают. ( особенно звук ходьбы )\nНаписать что-либо ещё значить заспойлерить.\nПоэтому напишу мерзостную чушь: Угощайте девушек с кошачьими ушками мороженным, дадут под хвост.", "timestamp_created": 1508099607, "timestamp_updated": 1508099607, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.510502", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35738086": {"recommendationid": "35738086", "author": {"steamid": "76561198094129268", "num_games_owned": 384, "num_reviews": 15, "playtime_forever": 180, "playtime_last_two_weeks": 0, "last_played": 1508046582}, "language": "english", "review": "I found this game to be well worth purchasing.  I enjoyed the story a lot.  A lot of visual novels on steam are not worth buying just for the story as this one is.  The atmosphere of the game is very creepy and the artstyle is dark and gloomy.  It is very fitting for the story that occurs in the game.  The ending is certainly unexpected but there are hints throughout as to what is going on.  I highly recommend this game in general for anyone interested in VNs.", "timestamp_created": 1508046800, "timestamp_updated": 1508046800, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.581749", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35715501": {"recommendationid": "35715501", "author": {"steamid": "76561198024268230", "num_games_owned": 341, "num_reviews": 2, "playtime_forever": 225, "playtime_last_two_weeks": 0, "last_played": 1508081509}, "language": "english", "review": "To me its the kind of VNs that steam really misses. Has everything and more thats written in the describtion. 10/10", "timestamp_created": 1507979945, "timestamp_updated": 1507979945, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35710978": {"recommendationid": "35710978", "author": {"steamid": "76561198309612853", "num_games_owned": 164, "num_reviews": 10, "playtime_forever": 603, "playtime_last_two_weeks": 0, "last_played": 1507959925}, "language": "english", "review": "[u] Damn.[/u]\n\nThis VN is very well written; leaving the reader unaware of what is to come, yet still managing to provoke an unsettling feeling throughout. The twist is highly disturbing- something the author intended from the beginning, and executed quite well.\n\nThe story is not for the faint of heart. I've already read some reviews of this game with people complaining about the upsetting twist. But I would argue that if the author's intent was to disturb the reader, he did a pretty damn good job of doing so and deserves credit.\n\nAll in all, this VN is definitely not for everyone ([spoiler] especially if you want this just for the h-scene [/spoiler]), but if you're looking for a cheap, well written visual novel that is sure to suprise and upset you, look no further then \"Sweetest Monster.\"", "timestamp_created": 1507966058, "timestamp_updated": 1507966404, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35516149": {"recommendationid": "35516149", "author": {"steamid": "76561198065637255", "num_games_owned": 116, "num_reviews": 22, "playtime_forever": 253, "playtime_last_two_weeks": 0, "last_played": 1507288407}, "language": "english", "review": "This game is gross, Once I got to the \"twist\" I was done and uninstalled and deleted it from my steam library. Frankly I'm surprised it hasn't been removed by steam. I should have asked for my money back but did not want to deal with the company.", "timestamp_created": 1507289299, "timestamp_updated": 1507289299, "voted_up": false, "votes_up": 6, "votes_funny": 3, "weighted_vote_score": "0.340416", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35484135": {"recommendationid": "35484135", "author": {"steamid": "76561198149491974", "num_games_owned": 192, "num_reviews": 3, "playtime_forever": 426, "playtime_last_two_weeks": 0, "last_played": 1507165772}, "language": "russian", "review": "Sweetest Monster - это отличная визуальная новелла, с хорошим и непредсказуемым сюжетом и ещё парой своих фишек. Не сильно растянутая и интересная история, хорошая графическая составляющая и отличное аудио сопровождение (очень понравился один из треков, до сих пор переслушиваю). \n\nЕдинственное, наверное некоторых смутит отсутствие русского языка, но для тех кто хоть немного знает английский это вообще не будет проблемой.\nЛично я прошёл данную новеллу на одном дыхании (~6,5 часов безпрерывного прочтения), после прохождения остаётся много эмоций, как после просмотра любимого фильма или прочтения книги.\n\nТем, кто ищет действительно интересную новеллу, не похожую на большинство других, то обязательно рекомендую к прохождению.", "timestamp_created": 1507167831, "timestamp_updated": 1511423202, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.615385", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35431247": {"recommendationid": "35431247", "author": {"steamid": "76561198160589412", "num_games_owned": 139, "num_reviews": 7, "playtime_forever": 377, "playtime_last_two_weeks": 0, "last_played": 1506989411}, "language": "english", "review": "good story line", "timestamp_created": 1506989455, "timestamp_updated": 1506989455, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497367", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35413930": {"recommendationid": "35413930", "author": {"steamid": "76561197997424809", "num_games_owned": 261, "num_reviews": 10, "playtime_forever": 586, "playtime_last_two_weeks": 0, "last_played": 1506947556}, "language": "english", "review": "This is a great, short, sweet visual novel. If you enjoy a game with some messed up moral issues, definitely check this one out. Gotta say it's a fantastic story. Been playing the other VNs by this author, and they're also about as good. But this one hit home. Plus, nudity is just 👌", "timestamp_created": 1506947789, "timestamp_updated": 1506947789, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35319367": {"recommendationid": "35319367", "author": {"steamid": "76561197983416895", "num_games_owned": 207, "num_reviews": 9, "playtime_forever": 114, "playtime_last_two_weeks": 0, "last_played": 1506736540}, "language": "english", "review": "I came here for the cute catgirl and stayed because I like being punched in the gut.\n\nMore seriously, this little VN is short, but that's because it's succinct and doesn't waste time with meaningless padding.  It's a good story, and I won't give any details for fear of spoiling it, but it's one that will leave you a bit disturbed and introspective.", "timestamp_created": 1506737260, "timestamp_updated": 1506737260, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35284684": {"recommendationid": "35284684", "author": {"steamid": "76561198013020221", "num_games_owned": 542, "num_reviews": 49, "playtime_forever": 177, "playtime_last_two_weeks": 0, "last_played": 1506667405}, "language": "english", "review": "A considerate review will say nothing about the plot. So I will just say WOW!  Excellent writing!", "timestamp_created": 1506667918, "timestamp_updated": 1506667918, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35198166": {"recommendationid": "35198166", "author": {"steamid": "76561198093610478", "num_games_owned": 241, "num_reviews": 3, "playtime_forever": 298, "playtime_last_two_weeks": 0, "last_played": 1506324204}, "language": "english", "review": "Okay. I both like and hate this Visual Novel. \n\nThe writing is pretty consistent with most other VNs while having it's own style, and the artwork is good.\n\nHowever... this messed me up a little bit more than I usually am. It starts off with domestic problems, and that stuff stays throughout the story, and that's not even what got me.\nFor any who are planning on getting this, be prepared to feel weird for the rest of the day. The author even states in the extras that it's meant to mess you up.\n\nAnd I guess for what it's worth, the game did what was intended, so I'm gonna give it a good vote.", "timestamp_created": 1506325202, "timestamp_updated": 1506325202, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34914796": {"recommendationid": "34914796", "author": {"steamid": "76561198062301817", "num_games_owned": 278, "num_reviews": 133, "playtime_forever": 201, "playtime_last_two_weeks": 0, "last_played": 1499677123}, "language": "english", "review": "It's great to have a VN that deals with difficult relationships. Whereas in many of them, mainly dating-sims, you see a new relationship blossoming, in this one you see a middle-aged man discontent with his love life and his work, and unable to connect with his daughter. Those are all pretty mature themes that may ring close to home for many people, but then he is being introduced to a young and seductive girl full of secrets, and things slowly get out of his hands, and OH GOD THAT AWFUL YET PERFECT TWIST. I did see it coming, but it's not that obvious, and I still was shocked when it was disclosed. \n\nHave a terrible yet great read!", "timestamp_created": 1505287360, "timestamp_updated": 1505287360, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.611892", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34889238": {"recommendationid": "34889238", "author": {"steamid": "76561198195177270", "num_games_owned": 87, "num_reviews": 4, "playtime_forever": 153, "playtime_last_two_weeks": 0, "last_played": 1504236234}, "language": "english", "review": "Great game with a good story. It takes the \"cute catgirl falls in love with the main character\" trope and turns it into something uncomfortable and horrific (which was the intention). This is a pure visual novel and there are no choices in game, but it didn't need any to tell the story. Even without choices, this game is interesting and unique. Reccommended if you like psychological horror.", "timestamp_created": 1505159532, "timestamp_updated": 1505159532, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34858650": {"recommendationid": "34858650", "author": {"steamid": "76561198283702927", "num_games_owned": 30, "num_reviews": 3, "playtime_forever": 304, "playtime_last_two_weeks": 0, "last_played": 1505039114}, "language": "english", "review": "As someone who has has Saya no Uta and Kana Imouto as some of his most treasured VNs, and who also has first hand dealt with... issues, I think this work was majestic. Thank you very much for the experience. I've also read Lily and I'm currently reading other pieces of the bunddle; count me as a fan.", "timestamp_created": 1505039780, "timestamp_updated": 1505105335, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34785318": {"recommendationid": "34785318", "author": {"steamid": "76561198149208409", "num_games_owned": 101, "num_reviews": 13, "playtime_forever": 216, "playtime_last_two_weeks": 0, "last_played": 1504741375}, "language": "english", "review": "So I have a lot of mIXED feelings about this game... it's made me incredibly uncomfortable at times and it was hard to get through the beginning because it's kind of boring and hard to finish it till the end. Since this visual novel is kinetic and there isn't any decision making; it's essentially like reading a book. With that being said, if there isn't going to be any decision making, I think this game needs to have more interesting events because it's too long for its story and I feel like there is a lot of unnecessary dialogue. However, it became a lot more interesting at the end of the game and the plot twist really surprised me. It's not a terrible game, I just think that there could be improvements made. If you like nekomemes, you'll probably enjoy this visual novel.", "timestamp_created": 1504742367, "timestamp_updated": 1504742436, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34632120": {"recommendationid": "34632120", "author": {"steamid": "76561198214223295", "num_games_owned": 120, "num_reviews": 2, "playtime_forever": 39, "playtime_last_two_weeks": 0, "last_played": 1504177604}, "language": "english", "review": "Warning: You can't make choices in this game (which to me is the main point of a VN). I've only played through the beginning, and found the story uninteresting and the main character unlikable. I don't know if it gets better, but I did skip to the end so I know you can't make choices.", "timestamp_created": 1504178109, "timestamp_updated": 1504178109, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.297948", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34622377": {"recommendationid": "34622377", "author": {"steamid": "76561198059709452", "num_games_owned": 147, "num_reviews": 2, "playtime_forever": 196, "playtime_last_two_weeks": 0, "last_played": 1504140533}, "language": "english", "review": "Great story through and through. First VN by Ebi-Hime I have done. Going to have to check out her other work. Would definitely reocmmend!", "timestamp_created": 1504140767, "timestamp_updated": 1504140767, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.505650", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34501544": {"recommendationid": "34501544", "author": {"steamid": "76561198009901921", "num_games_owned": 217, "num_reviews": 23, "playtime_forever": 782, "playtime_last_two_weeks": 0, "last_played": 1503743733}, "language": "schinese", "review": "慢慢读，挺有意思。人物刻画比较到位，不像日式游戏人物脸谱化", "timestamp_created": 1503743473, "timestamp_updated": 1503743473, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34411569": {"recommendationid": "34411569", "author": {"steamid": "76561198187621529", "num_games_owned": 53, "num_reviews": 3, "playtime_forever": 199, "playtime_last_two_weeks": 0, "last_played": 1503026722}, "language": "english", "review": "What i have to say about this game .... ho no, it's not a game, it's like an animated book but with lot of sensations.\nIt's the first time i buy something like that on steam and i am so freaking happy to find it. The story is unbellievable with an end that you could never know. If i could erase my memory and play it back like it was the first time, i will do it !", "timestamp_created": 1503392831, "timestamp_updated": 1503392831, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.505300", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34405725": {"recommendationid": "34405725", "author": {"steamid": "76561198144507776", "num_games_owned": 16, "num_reviews": 1, "playtime_forever": 256, "playtime_last_two_weeks": 0, "last_played": 1503361478}, "language": "english", "review": "I enjoyed the writing style of this game, and the art is fantastic. You can relate with the main charicter all the way though. You can really feel his strugle.", "timestamp_created": 1503362905, "timestamp_updated": 1503362905, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34381900": {"recommendationid": "34381900", "author": {"steamid": "76561198019734235", "num_games_owned": 253, "num_reviews": 17, "playtime_forever": 218, "playtime_last_two_weeks": 0, "last_played": 1505308815}, "language": "french", "review": "Une histoire envoutante servie par une belle musique ainsi qu'une qualité artistique excellente. Je recommande si vous aimez les récits dérangeants et \"mystérieux\".", "timestamp_created": 1503261628, "timestamp_updated": 1503261628, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34364169": {"recommendationid": "34364169", "author": {"steamid": "76561198132885404", "num_games_owned": 43, "num_reviews": 1, "playtime_forever": 175, "playtime_last_two_weeks": 0, "last_played": 1505085316}, "language": "english", "review": "It's rare that I come across a piece of art such as this which is capable of fundamentally making me [i] feel [/i] different.\n\nSweetest Monster is immersive.  It's visceral.  It's strange.  This one will stay in my mind for awhile, and I'm sure it will do the same for you.  \n\nI applaud the creators of this work for producing something which is horrifyingly beautiful.  I wish I could find more work painted in this unnerving tone of melancholy. \n\n I highly recommend this purchase.", "timestamp_created": 1503198574, "timestamp_updated": 1503198574, "voted_up": true, "votes_up": 22, "votes_funny": 1, "weighted_vote_score": "0.719951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34363719": {"recommendationid": "34363719", "author": {"steamid": "76561198054407635", "num_games_owned": 205, "num_reviews": 2, "playtime_forever": 109, "playtime_last_two_weeks": 0, "last_played": 1503195390}, "language": "english", "review": "Great story. Totally worth the two hours it'll take you to finish reading.", "timestamp_created": 1503196543, "timestamp_updated": 1503196543, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34350557": {"recommendationid": "34350557", "author": {"steamid": "76561197982572424", "num_games_owned": 1019, "num_reviews": 63, "playtime_forever": 140, "playtime_last_two_weeks": 0, "last_played": 1503148695}, "language": "english", "review": "I bought this entirely on the strength of the previous works of the author, Ebi-hime, and I'm happy to say it lives up to her legacy. She tends to take common VN/anime tropes (cat girls!) and subvert them or twist them in unique ways. This is essentially a drama about a miserable middle-aged man in a fading marriage, combined with psychological horror and unhealthy obsession. By midway through reading you'll probably have an idea of where it's all heading, but you're powerless to stop it from reaching its inevitable conclusion. This VN made me feel [b][i]incredibly[/i][/b] uncomfortable, which was the intended goal of the author.\n\nIf you're just looking for catgirl fanservice, you should probably look elsewhere. If instead you want a smartly written horror/drama and don't mind feeling really uncomfortable afterwards, this was certainly an interesting read.", "timestamp_created": 1503149566, "timestamp_updated": 1503149566, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.685485", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34324146": {"recommendationid": "34324146", "author": {"steamid": "76561198005615118", "num_games_owned": 268, "num_reviews": 3, "playtime_forever": 189, "playtime_last_two_weeks": 0, "last_played": 1503047427}, "language": "english", "review": "A fucking Masterpiece, had me up till 4 AM, page turning goodness! The ending will you have you all mixed up and dying for more. This is what Visual Novels should strive for, a griping story that conveys real feelings and lessons but will leave you gasping at every turn. By far one of my favourite Visual Novels.", "timestamp_created": 1503046943, "timestamp_updated": 1503046943, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34318654": {"recommendationid": "34318654", "author": {"steamid": "76561198026498963", "num_games_owned": 219, "num_reviews": 8, "playtime_forever": 146, "playtime_last_two_weeks": 0, "last_played": 1503020032}, "language": "english", "review": "10/10 Great story\nI can not explain in words how amazing this story is.", "timestamp_created": 1503019552, "timestamp_updated": 1503020188, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34269580": {"recommendationid": "34269580", "author": {"steamid": "76561198059158300", "num_games_owned": 152, "num_reviews": 1, "playtime_forever": 406, "playtime_last_two_weeks": 0, "last_played": 1502887261}, "language": "english", "review": "i really enjoyed this VN i thought i had it figured out at first but i was wrong which made it even more interesting.  A short story with a very interesting cat girl. Good art and music to go with it too.", "timestamp_created": 1502859457, "timestamp_updated": 1502859457, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34259855": {"recommendationid": "34259855", "author": {"steamid": "76561198183956818", "num_games_owned": 1875, "num_reviews": 31, "playtime_forever": 523, "playtime_last_two_weeks": 0, "last_played": 1502818448}, "language": "english", "review": "So twisted. \n10/10.", "timestamp_created": 1502817096, "timestamp_updated": 1502817096, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.481050", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34254521": {"recommendationid": "34254521", "author": {"steamid": "76561198119659321", "num_games_owned": 93, "num_reviews": 6, "playtime_forever": 302, "playtime_last_two_weeks": 0, "last_played": 1502797815}, "language": "brazilian", "review": "Visual Novel onde os personagens interagem um com o outro e você tem parte em suas escolhas, este em si é um sem essas escolhas, porem extremamente tangivel nas escolhas que o personagem faz, quase como se ele escolhesse exatamente o que você escolheria. Sweetest Monter ganha de lavada para mim como um dos melhores Visual Novels que eu já joguei. Tendo jogado mais de uma centena deles posso confirmar o carinho e dedicação do desenvolvedor nessa obra.  Estou surpreso até o momento com profundidade do trama, criando para si um universo complexo ao final da mesma.\n\nMuito obrigado pela jogatina, e eu recomendarei o seu jogo a muitos outros aficionados pelo gênero assim como eu ! <3", "timestamp_created": 1502798133, "timestamp_updated": 1502798133, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502262", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34194754": {"recommendationid": "34194754", "author": {"steamid": "76561198040247823", "num_games_owned": 133, "num_reviews": 33, "playtime_forever": 402, "playtime_last_two_weeks": 0, "last_played": 1502651638}, "language": "german", "review": "Definitiv zu empfehlen :D Mit einer sagen wir überraschenden Wende die ich aber dennoch in Betracht gezogen habe.", "timestamp_created": 1502554763, "timestamp_updated": 1502554763, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.462046", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34069436": {"recommendationid": "34069436", "author": {"steamid": "76561198056701760", "num_games_owned": 550, "num_reviews": 32, "playtime_forever": 758, "playtime_last_two_weeks": 0, "last_played": 1500698511}, "language": "english", "review": "Playing this VN made me depressed. Intrigued, but depressed. 10/10, would hate myself again.", "timestamp_created": 1502055820, "timestamp_updated": 1502055820, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.533574", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34054576": {"recommendationid": "34054576", "author": {"steamid": "76561198152429972", "num_games_owned": 91, "num_reviews": 30, "playtime_forever": 624, "playtime_last_two_weeks": 0, "last_played": 1502122300}, "language": "english", "review": "This actually a quite Messed up. I feel somebody actually watching me ;-;", "timestamp_created": 1502004634, "timestamp_updated": 1502004634, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.549204", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34008815": {"recommendationid": "34008815", "author": {"steamid": "76561197996027961", "num_games_owned": 166, "num_reviews": 8, "playtime_forever": 476, "playtime_last_two_weeks": 0, "last_played": 1501824530}, "language": "english", "review": "Wasn't sure what to expect, but it was cheap, and somehow it... aroused my curiosity. I was not disappointed. Well worth the price. Wonderfully written story.", "timestamp_created": 1501825081, "timestamp_updated": 1501825081, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33999175": {"recommendationid": "33999175", "author": {"steamid": "76561198142782042", "num_games_owned": 210, "num_reviews": 9, "playtime_forever": 180, "playtime_last_two_weeks": 0, "last_played": 1499405748}, "language": "english", "review": "bought it for the plot twist, stayed for the cat girl\n\n\n10/10 would bang again", "timestamp_created": 1501785877, "timestamp_updated": 1501785877, "voted_up": true, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.499546", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33819739": {"recommendationid": "33819739", "author": {"steamid": "76561198004383873", "num_games_owned": 403, "num_reviews": 23, "playtime_forever": 101, "playtime_last_two_weeks": 0, "last_played": 1501105574}, "language": "english", "review": "A twisted story but at the same time, it is revealed with a deeper meaning than what you think at first.", "timestamp_created": 1501110453, "timestamp_updated": 1501110453, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.504868", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33800850": {"recommendationid": "33800850", "author": {"steamid": "76561198043787903", "num_games_owned": 160, "num_reviews": 53, "playtime_forever": 209, "playtime_last_two_weeks": 0, "last_played": 1502693676}, "language": "english", "review": "nice short ntr vn", "timestamp_created": 1501043161, "timestamp_updated": 1501043175, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.481050", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33759460": {"recommendationid": "33759460", "author": {"steamid": "76561198027931977", "num_games_owned": 384, "num_reviews": 5, "playtime_forever": 273, "playtime_last_two_weeks": 0, "last_played": 1500873836}, "language": "english", "review": "If you can read a book, or have played a visual novel, or have watched a movie, and felt something from it (the feels as some call it); for $6 (current price) you can buy this 'game' and experience something you almost certainly have not experienced before.\n\nThis isn't a game; it's a story. There are no decisions to be made. There is no way for you to affect the outcome. What you have are beautiful visuals, haunting music, and realistic personalities. You will probably see the end coming a mile away, and like so many reviewers have said before me, you won't want to admit it until you have to face it. \n\nI would rate this 8/10 because it's only flaw is the length. It doesn't need to be long to be great, but with steam's 2 hour refund policy, people might not how it is a short story.\nBut in my personal book, this gets a 10/10. I don't regret even a single minute I spent on this story, from the beginning to the scene after the credits, to reading the authors notes in the extras menu.\n\n8/10 Amazing though short. A true psychological horror story / thriller.", "timestamp_created": 1500875308, "timestamp_updated": 1500875308, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.534397", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33758564": {"recommendationid": "33758564", "author": {"steamid": "76561198136886006", "num_games_owned": 256, "num_reviews": 14, "playtime_forever": 228, "playtime_last_two_weeks": 0, "last_played": 1500869747}, "language": "english", "review": "Sweetest Monster is hard to define correctly. I'm sure the average user on Steam saw the nudity tag and immediately goes to crack a joke about it, but it's far more than that. \n\nIt's a visual novel that is more of a dark tale of obsession than a romance, more of a depressing look into how relationships can sour over the years than an average slice of life story.  Feelings of dread and emptiness are littered throughout, a feeling like that main character, Robin, can never escape from his predicament no matter how hard he tries. \n\nHaving difficulty giving a review without spoiling the entire thing, I'll say this: Despite being somewhat short (at three hours and I usually tab out and do stuff while playing), this VN held a heavy punch right to the gut. The use of haunting soundtrack over excellent art that is torn between being cheerful and homely to gloomy and moody reaches that perfect balance. The characters were believable in their relationships, and the ending was truly top-notch. \n\nThis is a winner from the developer ebi-hime, and I look forward to their future work.", "timestamp_created": 1500870363, "timestamp_updated": 1500870363, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.435481", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33725599": {"recommendationid": "33725599", "author": {"steamid": "76561198067725186", "num_games_owned": 276, "num_reviews": 26, "playtime_forever": 388, "playtime_last_two_weeks": 0, "last_played": 1500744003}, "language": "english", "review": "Excellent.\nI had mistakenly thought this a story with a decision tree, but it truly is a visual novel. One path, one story.\nThe writing is great, clearly this was well edited prior to release.\nThanks for sharing your story, and making this \"game\".", "timestamp_created": 1500744136, "timestamp_updated": 1500744136, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33710055": {"recommendationid": "33710055", "author": {"steamid": "76561197963920659", "num_games_owned": 537, "num_reviews": 3, "playtime_forever": 104, "playtime_last_two_weeks": 0, "last_played": 1495085796}, "language": "english", "review": "This game was kickass. All the femme fatale allure you could ever want, and what a twist at the end. :3 Stop reading this, just buy it and play it already.", "timestamp_created": 1500687533, "timestamp_updated": 1500687533, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33706939": {"recommendationid": "33706939", "author": {"steamid": "76561198274525216", "num_games_owned": 231, "num_reviews": 2, "playtime_forever": 250, "playtime_last_two_weeks": 0, "last_played": 1500674778}, "language": "english", "review": "Such intresting story, but short as well.", "timestamp_created": 1500674915, "timestamp_updated": 1500674915, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33647687": {"recommendationid": "33647687", "author": {"steamid": "76561197978726384", "num_games_owned": 379, "num_reviews": 65, "playtime_forever": 128, "playtime_last_two_weeks": 0, "last_played": 1514309222}, "language": "english", "review": "At last, a good occidental VN.\n\nSure it would have been even better with voice over and some more sprite and art, but it still an enjoyable game with strong story and characters.\n\n7/10\n\nUnfortunately, by buying this game, you allow the cancer that is Sekai Project to thrive. This is not a good thing. Don't allow this company to waste more good Japanese VN. Vote with your wallet.", "timestamp_created": 1500455983, "timestamp_updated": 1507598259, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.467146", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33595344": {"recommendationid": "33595344", "author": {"steamid": "76561198286454673", "num_games_owned": 168, "num_reviews": 14, "playtime_forever": 175, "playtime_last_two_weeks": 0, "last_played": 1500243102}, "language": "english", "review": "An interesting story with a suprisingly end.", "timestamp_created": 1500243011, "timestamp_updated": 1500243011, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33558172": {"recommendationid": "33558172", "author": {"steamid": "76561198018564413", "num_games_owned": 514, "num_reviews": 16, "playtime_forever": 315, "playtime_last_two_weeks": 0, "last_played": 1508638736}, "language": "english", "review": "I brought this VN as a part of the Ebi-Hime bundle and completed it in about 4 hours. All i can say was i was pleasantly surprised by it, especially with the creepy / unnerving story and unexpected Plot Twist/s.\n\nOverall, it was a enjoyable read for the price and i even purchased the OST to boot. \n\nInteresting to see a story / plot outside of the mainsteam trends\n\n8/10", "timestamp_created": 1500121074, "timestamp_updated": 1500121074, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33544602": {"recommendationid": "33544602", "author": {"steamid": "76561198063661579", "num_games_owned": 69, "num_reviews": 4, "playtime_forever": 198, "playtime_last_two_weeks": 0, "last_played": 1500057395}, "language": "english", "review": "Let me just start by saying this is very different than what I'm used to from ebi-hime, which isn't a bad thing by any means, it was actually super refreshing for me because I had gotten used to patterns in other works by them and it got to the point where I kind of had expectations for every subsequent title I played. So this game did well in not really setting up a ton of that. I didn't feel like I already knew the story or that I had an idea of where the characters were going to end up from too early on when, ideally, I shouldn't know that kind of information just yet. \n\nFor anyone who has played Asphyxia, Empty Horizons, Strawberry Vinegar, ect.. this story doesn't have quite the same feel and so the usual quirks you'd expect from those titles won't really be around either, aside from a few references to romantic poets and such. For example, the male character isn't very feminine in the slightest, which is a distinct change and I must commend ebi-hime for that. Not that feminine males are a bad thing, it just seems as if that was something they felt they struggled with in the past and I think they managed to really nail a neutral or more masculine guy in this story. \n\nTo accompany some changes in quirks and writing style, the art style is different and it works for this tale. I'm not quite sure what I would feel if I were playing this game and it had Silly Selly's art in it. It would certainly be interesting, but I've come to recognize them more for heartwrenching adorableness, purity, or melancholia than something very eerie, disturbing, or explicitly sexual in any way.\n\nOnto the story itself, I feel it accomplished exactly what the writer was going for. I both empathized with and was at times infuriated by certain characters exactly when I should have been and by the end I felt very unsettled when everything I didn't yet know finally revealed itself. And there was such a helpless feeling to it, too. I'm so used to having choices in these stories, but in this one.. there really is nothing you can do to change the outcome. There isn't supposed to be. It leaves a lasting impact and sometimes that's much better than having multiple endings where one can overshadow and perhaps even make you forget all the others. \n\nI would talk more on the characters, but personally I'm fearful of saying a little bit too much about them. They're probably best met during a playthrough rather than in a review, especially since there are so few of them in this story.\n\nOverall, the game is just delightfully upsetting. That's the best way to describe the experience in my opinion. If you enjoy messed up stuff and you're good with visual novels, I'd definitely recommend giving this one a go. Similarly, if you're already a fan of ebi-hime's work, I'd also recommend it as long as a change in formula doesn't turn you off.", "timestamp_created": 1500065604, "timestamp_updated": 1500065915, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33439196": {"recommendationid": "33439196", "author": {"steamid": "76561198035294703", "num_games_owned": 212, "num_reviews": 11, "playtime_forever": 287, "playtime_last_two_weeks": 0, "last_played": 1499715822}, "language": "english", "review": "i dont think i have ever been wanting to be so wrong of my guesses while reading a story.. this VN left me slightly traumatised and scared..", "timestamp_created": 1499716139, "timestamp_updated": 1499716139, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33432577": {"recommendationid": "33432577", "author": {"steamid": "76561198152308686", "num_games_owned": 145, "num_reviews": 31, "playtime_forever": 205, "playtime_last_two_weeks": 0, "last_played": 1499696974}, "language": "english", "review": "creepy and disturbing. \n", "timestamp_created": 1499697739, "timestamp_updated": 1499697739, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33408964": {"recommendationid": "33408964", "author": {"steamid": "76561198145327122", "num_games_owned": 73, "num_reviews": 3, "playtime_forever": 256, "playtime_last_two_weeks": 0, "last_played": 1499618486}, "language": "english", "review": "This VN may have had a slow start but i shit you not the end is well worth it, though its a bit short the quality is still pretty damn good. Overall i give this VN a 8/10 and is bound to go to my fav list\n\n\n\n[spoiler]The plot twist was really something, guess not all families know each other well[/spoiler]", "timestamp_created": 1499618877, "timestamp_updated": 1499618877, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33405747": {"recommendationid": "33405747", "author": {"steamid": "76561197993550586", "num_games_owned": 64, "num_reviews": 5, "playtime_forever": 245, "playtime_last_two_weeks": 0, "last_played": 1499610994}, "language": "french", "review": "J'ai trouvé ça un peu long, la fin est assez surprenante, mais je me suis plutot ennuyé pendant 4h", "timestamp_created": 1499611074, "timestamp_updated": 1499611074, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33386147": {"recommendationid": "33386147", "author": {"steamid": "76561198059971262", "num_games_owned": 1222, "num_reviews": 297, "playtime_forever": 221, "playtime_last_two_weeks": 0, "last_played": 1499554010}, "language": "english", "review": "It was truly a short read (~2 hours for me) but it was honestly worth it.\n\nI did saw the twist coming a mile away, but just like the protagonist, I didn't want to accept it as the truth until I had to confront it.", "timestamp_created": 1499548872, "timestamp_updated": 1499548893, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.563342", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33357630": {"recommendationid": "33357630", "author": {"steamid": "76561198095024734", "num_games_owned": 136, "num_reviews": 6, "playtime_forever": 196, "playtime_last_two_weeks": 0, "last_played": 1499470242}, "language": "english", "review": "What a way to begin my foray into the world of visual novels :| ...", "timestamp_created": 1499470565, "timestamp_updated": 1499470728, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.523899", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33348600": {"recommendationid": "33348600", "author": {"steamid": "76561198027014929", "num_games_owned": 92, "num_reviews": 8, "playtime_forever": 371, "playtime_last_two_weeks": 0, "last_played": 1499446896}, "language": "english", "review": "Disturbing, but epic.", "timestamp_created": 1499447284, "timestamp_updated": 1499447284, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.516971", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33302699": {"recommendationid": "33302699", "author": {"steamid": "76561198036436114", "num_games_owned": 128, "num_reviews": 2, "playtime_forever": 267, "playtime_last_two_weeks": 0, "last_played": 1499324520}, "language": "english", "review": "Just finished the VN(this was my first) and it took me about 2.5-3 hours, fell asleep at some point so tacked on a bit of extra time, though that's no knock against the novel itself. Overall I'd give it a 7 or 7.5. It starts off slow and innocent, with some charming moments sprinkled here and there but because of some questionable writing at points as well as flat out retarded decision making on the part of the main character in the latter bits, the ending didn't really pull it up to an 8 for me. That said the ending was just W O W. I figured as much at some point but the full revelation still hit me like a truck, and the events immediately following it only add to the shock. I'd defintely recommend the game if you have a few bucks to spare, though if you're anything like me you may want to put it down around 60-75% of the way through because trust me when I say that the setup for the climax and the plot in it's entirety has a few weak spots. Again, I'd still recommend it but this isn't a must buy in my book.\n\nSome quick notes about the art and music:\nThe art was quite well done, there was only one classroom shot I wasn't a fan of, the rest was great.\nThe music did a good job of setting the atmosphere, albeit it was a little repetitive at times.\nMy only gripe here was really the sound effects, they were played on a constant loop and often didn't match some of the scenery. The bridge footstep sound effect comes to mind especially, but this isn't a huge issue either way as you'll only hear them for a brief time.", "timestamp_created": 1499324013, "timestamp_updated": 1500747648, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33264746": {"recommendationid": "33264746", "author": {"steamid": "76561198032621014", "num_games_owned": 271, "num_reviews": 1, "playtime_forever": 192, "playtime_last_two_weeks": 0, "last_played": 1499240684}, "language": "english", "review": "ಠ~ಠ\n", "timestamp_created": 1499241059, "timestamp_updated": 1499241059, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33262502": {"recommendationid": "33262502", "author": {"steamid": "76561198009586772", "num_games_owned": 386, "num_reviews": 45, "playtime_forever": 71, "playtime_last_two_weeks": 0, "last_played": 1499142869}, "language": "english", "review": "This game...wow. Slow start...bit creepy. Not exactly normal horror...but i def think the protaganist counts as evil..(trust me you will get it at the end of the game). Only played 1.2 hours but figured out plot a bit early and verified via lets play videos...super twisted at the end..you may feel weird about it (the guy reviewing/playing the lets play sure as hell did). \n\nThis game also has a slow burn to it...like things that happen don't always make sense right away, but when you figure out what is going on it makes things more terrible/horrifying (again not typical evil but def some psychological horror and other stuff *don't want to get too much into detail and ruin the story. \n\nLets just say the overall story is well told, conveys evil and is pretty damn twisted. You will feel revulsion, possibly some terror and definitely some grotesque interest as the story unfolds and then at the end you will feel pretty terrible. lol quite the rollercoster ride...can't believe i am saying this but i still recommend the game. \n\nnot for the faint of heart though..you were warned.", "timestamp_created": 1499235571, "timestamp_updated": 1499316675, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33253063": {"recommendationid": "33253063", "author": {"steamid": "76561198062713203", "num_games_owned": 247, "num_reviews": 18, "playtime_forever": 251, "playtime_last_two_weeks": 0, "last_played": 1499258944}, "language": "english", "review": "Women are [i]scary[/i], don't go near them.", "timestamp_created": 1499211211, "timestamp_updated": 1499211211, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33213869": {"recommendationid": "33213869", "author": {"steamid": "76561198026875702", "num_games_owned": 62, "num_reviews": 2, "playtime_forever": 180, "playtime_last_two_weeks": 0, "last_played": 1499267918}, "language": "english", "review": "Ok so first thing, this is a oretty good one if you like watching car crashes in slow motion. trying to not spoil too much here is my review:\n\nSHORT: fits together well, doesnt seem too far out realm of possibility, except maybe the monster part, i can see some shape or form of this going down. you can feel the character's feelings and also their soon to be uttter ruin.  \n\n\n\nmechanics : a true linear VN, so... none, no branchng stories, just one well written one. in many ways this is good, it doesnt need to account for sudden changs or anything, so writercould focus on making just one really good story. \n\nart: has its own thing going, looks rough in a way, yet really not, word... but given the setting is one of uncertainty and \"something is off\", this fits very well.\n\ncharacters: the game excels here, the characters feel like they have actual personaties rather than just enough to fit story, that being said, the lack of length or sides to this story hinders this greatly, some interations feel likrthey needed more time, but maybe thats the point. the main character is a bit typical in a way, but the way they were written makes you able to feel the axiety and pressure of his situations.\n\nstory: like i said, train/car wreck in slow motion, ready to ruin your own life? i sure am! its a bit interesting with the twist(s) at end, i really would like to see a second one, however its likely best to keep it one of those \"hey there is no continuation so just make it up in your head!\" deals.   Main character is a typical protag from VNs, however, they have enough depth where its not all entirely accidental as much as a lack of will, i feel many people will be able to relate in some way, especaly though with lower impulse control. the situations they get into are not completely unbaliveable/ cpincidence, you can see why thiings are being done, and in many places where it is going (untill the end, unless you really paid attention). \n\nbonus: yes there is sex, you filthy aimals. and yes its a main point of the VN so im not excluded from statement.\n\noverall: d say upper 20% of games, for those who like the \"x out of 10\" ill say : 8.7-9.3 depending on my mood, i always give fluxuating scores, im a bit of an indecisive person.", "timestamp_created": 1499140718, "timestamp_updated": 1499141721, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33212516": {"recommendationid": "33212516", "author": {"steamid": "76561198287476086", "num_games_owned": 109, "num_reviews": 8, "playtime_forever": 419, "playtime_last_two_weeks": 0, "last_played": 1499136753}, "language": "english", "review": "Wow, just wow... \nIt's a very long time ago that a story had hit me that hard and \nleft me that speechless as in \"Sweetest Monster\"...\n\nFirst of all it's a very well written VN and the plot twists almost killed me.\nIt gets more and more disturbing and unsettling by every chapter you read...\nEspecially the end of this VN left me with my mouth wide open \nas my brain slowly tries to get a grab about what just happened.\n\nI really love this short little thrilling, yandere themed Visual Novel!\n... Would buy it again at anytime!\n\nBelieve me, that girl, really is a monster, but even more like the devil person!", "timestamp_created": 1499137427, "timestamp_updated": 1499137427, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33151227": {"recommendationid": "33151227", "author": {"steamid": "76561198103047064", "num_games_owned": 480, "num_reviews": 16, "playtime_forever": 140, "playtime_last_two_weeks": 0, "last_played": 1499027122}, "language": "english", "review": "*shivers*", "timestamp_created": 1499027137, "timestamp_updated": 1499027137, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.486823", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33069610": {"recommendationid": "33069610", "author": {"steamid": "76561198231133148", "num_games_owned": 89, "num_reviews": 10, "playtime_forever": 169, "playtime_last_two_weeks": 0, "last_played": 1496812720}, "language": "schinese", "review": "很不错的一款视觉小说，个人比较喜欢这类黑暗风格的作品，求个中文版，繁体也行，英文玩的很难受。", "timestamp_created": 1498888001, "timestamp_updated": 1498888001, "voted_up": true, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.642857", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33020684": {"recommendationid": "33020684", "author": {"steamid": "76561198061139792", "num_games_owned": 727, "num_reviews": 3, "playtime_forever": 130, "playtime_last_two_weeks": 0, "last_played": 1506030532}, "language": "english", "review": "The developer and writer [url=http://steamcommunity.com/id/ebihime]Ebi-hime[/url], in conjunction with the artist DarkSin [url=https://twitter.com/_sinsystem_](@_SinSystem_ [twitter])[/url] may leave you dumbfounded with how the melancholy narrative strings you along through an air of dissarray until it is simply. Too. Late.\n\n---\n\nIt is a joy to say that I am overly impressed with the 'Sweetest Monster' VN. I was drawn in, and during this time, I was in love.\nTruly in love through and through, as much as I was perturbed by the end of it all.\n\nThe author's comments in addition to the notes commenting on the inspiration for the characters and the like really serve the reader a little bit of a treat at the end to help unwind, just that little extra bit. (And mercy, thank you for it!)\n\n---\n\nBy all means, it is to my recommendation that you pick this up if psycological thrillers are up your alley - whether it is, or is not on sale. [url=http://store.steampowered.com/search/?developer=ebi-hime] Ebi-hime [/url] has my support.", "timestamp_created": 1498792639, "timestamp_updated": 1498792762, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.530465", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33013483": {"recommendationid": "33013483", "author": {"steamid": "76561198075985753", "num_games_owned": 76, "num_reviews": 2, "playtime_forever": 162, "playtime_last_two_weeks": 0, "last_played": 1498806199}, "language": "english", "review": "I found this game captivating from the start, and enjoyed a refreshing take in a VN. As they state in the notes, they wanted to make something different from the normal cute lovey VN, and they succeeded really well. Though I felt I knew what was coming and could see the plot points, I continuously was proven wrong. Amazingly written, beautifully composed, with a lovely creepy feel.", "timestamp_created": 1498776323, "timestamp_updated": 1498776323, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32960699": {"recommendationid": "32960699", "author": {"steamid": "76561198026507791", "num_games_owned": 798, "num_reviews": 7, "playtime_forever": 532, "playtime_last_two_weeks": 0, "last_played": 1498687901}, "language": "english", "review": "[h1]TL;DR[/h1]\n\n[b]Holy F***ing S**t! :V[/b]\n\nLong version:\n\nSo I played through the game together with a friend; we were both sitting in front of my PC, playing, discussing and laughing our asses off.\nWe'd play it in \"real\" time – finishing one in-game day per day, that made it more interesting, as we'd have constant cliffhangers.\nWe laughed so much it's unreal.\nThere were so many instances where we'd jokingly \"guess\" the next line, making it something super lulzy but improbable. And when we'd see that's the line we'd get. MEEMZ!\nOverall the story was very, very intriguing and captivating.\nBut then sh^t hit the fan. This is THE most disturbing thing I have ever read or seen. And I've seen some serious sh*t through the years.\n\nThis game is worth every penny and then some. Money well spent.\n\nThe story is just damn brilliant and priceless, yo!\n\nP.S. [spoiler]Poor Sally Pally...[/spoiler]", "timestamp_created": 1498687245, "timestamp_updated": 1498702268, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.544174", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32949814": {"recommendationid": "32949814", "author": {"steamid": "76561198024173809", "num_games_owned": 1411, "num_reviews": 8, "playtime_forever": 251, "playtime_last_two_weeks": 0, "last_played": 1498664622}, "language": "english", "review": "One of the most well-written VNs I've played. No choices at all, just a very gripping story lasting about 4 hours. Try not to read any spoilers because that ending was mostly unexpected and really disturbing. The author's notes you unlock after playing through the story summarize it pretty well: it's meant to make you uncomfortable.", "timestamp_created": 1498673449, "timestamp_updated": 1498673449, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.590549", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32923660": {"recommendationid": "32923660", "author": {"steamid": "76561198044991051", "num_games_owned": 242, "num_reviews": 3, "playtime_forever": 170, "playtime_last_two_weeks": 0, "last_played": 1498644250}, "language": "english", "review": "A short visual novel, but very well written. Holy crap I did not see that reveal coming.\n\nThe reveal was more disturbing than anything I remember experiencing. That sounds overdramatic, but the reveal was so sudden, so much of an \"OH\" moment that the more I thought about it, the more horrifying it became. This game is worth playing. Anything that can invoke emotion like this is worth experiencing. In hindsight, the signs were there; I just didn't even consider the possibility.\n\nDon't let the flirting catgirl cover fool you. If you don't see it coming, this game will hit you, and hit you hard.", "timestamp_created": 1498642887, "timestamp_updated": 1498642887, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32902044": {"recommendationid": "32902044", "author": {"steamid": "76561197997573541", "num_games_owned": 182, "num_reviews": 5, "playtime_forever": 136, "playtime_last_two_weeks": 0, "last_played": 1498611514}, "language": "english", "review": "This was...disturbing. \n\nVery thought-provoking, an enthralling read that had me going \"Holy shit..\" towards the end as it all tied together in a terrifying way. And the final scene...punched me right in the stomach. \n\nIf you're interested in reading something twisted, dark, and yet utterly interesting, I would recommend this. Well worth the price and 2-3 hours of reading.", "timestamp_created": 1498611796, "timestamp_updated": 1498611796, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.516971", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32754334": {"recommendationid": "32754334", "author": {"steamid": "76561198044481032", "num_games_owned": 263, "num_reviews": 18, "playtime_forever": 366, "playtime_last_two_weeks": 0, "last_played": 1498360477}, "language": "english", "review": "Not a visual novel you can recommend to a stranger, but it's well written. Intense and so, so unsettlingly sweet.\n\nNot nearly as disturbing as some Japanese visual novels out there, but consider yourself warned.", "timestamp_created": 1498362667, "timestamp_updated": 1498362819, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32743840": {"recommendationid": "32743840", "author": {"steamid": "76561198087332642", "num_games_owned": 164, "num_reviews": 30, "playtime_forever": 154, "playtime_last_two_weeks": 0, "last_played": 1498338535}, "language": "english", "review": "I came in expecting another Sakura Fanservice VN and went out with a cool story, good characters and a great developer!\nThe story is great (a bit too short) and the characters are enjoyable.\n\nWhat made me love this developer in particular were the Author's Notes.\nDefinetly recommend this VN and other VNs from this developer more than Sakura XXXXXXX things that come out!", "timestamp_created": 1498338963, "timestamp_updated": 1498338963, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32721769": {"recommendationid": "32721769", "author": {"steamid": "76561198025337752", "num_games_owned": 205, "num_reviews": 7, "playtime_forever": 147, "playtime_last_two_weeks": 0, "last_played": 1498300961}, "language": "english", "review": "Having played an assortment of visual novels, this one has to take the cake thus far. Story wise, you play as a 40 year old father who is having a difficult time with his wife and daughter. But right after, he meets forementioned Sweetest catgirl. From there, the story just ramps up feeling heavily inspired from Catherine and abit of Lolita. Even the theming of the whole Kinetic Novel just felt right with this ominous tone of dread and uncertainty. But the ending takes cake.. oh god, that was something. But overall, I heavily recommend this VN for those who want a unique read.", "timestamp_created": 1498302044, "timestamp_updated": 1498302044, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32715357": {"recommendationid": "32715357", "author": {"steamid": "76561198110858152", "num_games_owned": 228, "num_reviews": 99, "playtime_forever": 175, "playtime_last_two_weeks": 0, "last_played": 1498801346}, "language": "english", "review": ".....\n\nwhere do I even begin?\n\nFirst off, this was very well written. The write obviously has some bit of esoteric knowledge in novels as I can tell by the quality and diction of the script. \n\nThe story gave me a Catherine mixed with old boy vibe to it. It is very unique and well worth the read.\n\nNow, the art. The artist who drew the sprites and background is very talented. Abosolutely beautiful and enticing to look it.\n\nI'm trying to write more but the story left me too dumbfounded to think\n\n10/10 VN", "timestamp_created": 1498289610, "timestamp_updated": 1498289610, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.433203", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32712811": {"recommendationid": "32712811", "author": {"steamid": "76561198132747427", "num_games_owned": 69, "num_reviews": 8, "playtime_forever": 273, "playtime_last_two_weeks": 0, "last_played": 1498285594}, "language": "english", "review": "I'll keep it short and straight to the point. This game is great, the story is great, and the soundtrack is great. Yes, it's a little on the short end but i'd prefer a short good story over a long boring story any day. Quality over quantity. If you like messed up VN's like Saya no Uta (Which i have yet to see be outdone) then you will enjoy this. The author does an excellent job of creating the atmosphere and feelings he intended and there isn't a single bad thing i can say about it. I finished this in 4.5 hours, one sitting. Well worth the $6. Not as much fanservice as in most, but unlike most VN the little fanservice there is actually plays a role in the story and isn't overtly ridiculous.\n\nNow, stop being hesitant and just buy this story. You won't regret it.... Unless you are new to this sort of thing and in that case i'd say this is one of the more approachable ones as compared to Saya no Uta. So buy it anyways and make that midway fap that you may or may not regret at the end.\n\n[spoiler] Stuck between fucking your daughter and your aunt's cat? Why not both?\t[/spoiler]", "timestamp_created": 1498283879, "timestamp_updated": 1506236656, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32520828": {"recommendationid": "32520828", "author": {"steamid": "76561198348999904", "num_games_owned": 133, "num_reviews": 14, "playtime_forever": 298, "playtime_last_two_weeks": 0, "last_played": 1511400428}, "language": "english", "review": "It took me a little bit more than 4 hours to finish it, but it was time well spent. The writing is really well done and let's be honest, for what other reason would you play a VN? [spoiler]Unless you are a dirty pervert who came here because of the \"sexual content\" tag. But who would do such a thing? R-Right?[/spoiler]\nAlso read the author's notes once you finished. It's always nice to have some insight on the thought process behind such work.", "timestamp_created": 1497741311, "timestamp_updated": 1497792387, "voted_up": true, "votes_up": 9, "votes_funny": 4, "weighted_vote_score": "0.605277", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32271943": {"recommendationid": "32271943", "author": {"steamid": "76561198204341185", "num_games_owned": 99, "num_reviews": 17, "playtime_forever": 294, "playtime_last_two_weeks": 0, "last_played": 1496945111}, "language": "english", "review": "After finishing Sweetest Monster about a half hour ago, I feel honestly very disturbed. Any sane person would after finishing that. I will say I was extremely intrigued in the story and the soundtrack went beautifully in setting the atmosphere, however that ending. My god, that ending. Part of me slightly guessed after [spoiler]seeing the daughter for the first time[/spoiler], but I was honestly hoping it was a coincidence and that it wasn't true.\n\nDespite how horrid the ending made me feel, the story was extremely immersive and the writer did an excellent job in writing the story. If you're a fan of creepy but well written VNs, I would recommend this. However, if you're not a fan of fucked up scenarios, I would just avoid this completely.\n\n", "timestamp_created": 1496946551, "timestamp_updated": 1496946551, "voted_up": true, "votes_up": 30, "votes_funny": 0, "weighted_vote_score": "0.740807", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32215830": {"recommendationid": "32215830", "author": {"steamid": "76561198141804718", "num_games_owned": 173, "num_reviews": 64, "playtime_forever": 333, "playtime_last_two_weeks": 0, "last_played": 1496882843}, "language": "english", "review": "very  short  visual novel   has one  nude scene .  In it  for whatever reason  I kept on thinking so what exactly is the problem here .  This thing is designed to unsettle you .   \nquote from the authors notes  \"My general aim was to  write a visual novel  with fan service elements but who's primary goal was to unsettle the reader .    \nUm yea sorry did not unsettle me in the least .    \n   The one criticism i have about the visual  novel  Other than it is way to short . Its not really about  About the visual novel   I know it is a fantasy novel with all kinds of symbolism involved.  But virgin  girls don't really bleed when they have sex for the first time . unless they are on their period . I really dislike it when authors  . Perpetuate myths about  physical anatomy and sexuality.    Please get a copy of the guide to getting it on if you plan on doing  any more henti . If  normal sex hurts the first time and your bleeding  your doing something wrong .\n    \n    \n Due to the lack of nudity  one very brief nude picture .  And A  very short predictable story line I recommend purchase on sale.  in the one to two dollar range .", "timestamp_created": 1496737393, "timestamp_updated": 1496783420, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.361914", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32196502": {"recommendationid": "32196502", "author": {"steamid": "76561198219608804", "num_games_owned": 76, "num_reviews": 7, "playtime_forever": 240, "playtime_last_two_weeks": 0, "last_played": 1511098741}, "language": "schinese", "review": "cute kitty , nice", "timestamp_created": 1496659821, "timestamp_updated": 1496659821, "voted_up": true, "votes_up": 1, "votes_funny": 3, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32188016": {"recommendationid": "32188016", "author": {"steamid": "76561198147558949", "num_games_owned": 27, "num_reviews": 12, "playtime_forever": 190, "playtime_last_two_weeks": 0, "last_played": 1496709174}, "language": "english", "review": "I thought Bell was the monster, but actually, it was I...", "timestamp_created": 1496621341, "timestamp_updated": 1496621341, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.387022", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32126298": {"recommendationid": "32126298", "author": {"steamid": "76561198070954777", "num_games_owned": 253, "num_reviews": 6, "playtime_forever": 136, "playtime_last_two_weeks": 0, "last_played": 1496400788}, "language": "english", "review": "I don't.. I can't.. What did I just play? Is the big twist that.. I am the monster? I wanted to throw up. I don't know how to feel about the plot in this game.", "timestamp_created": 1496400695, "timestamp_updated": 1496400695, "voted_up": false, "votes_up": 7, "votes_funny": 3, "weighted_vote_score": "0.227004", "comment_count": "11", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31920867": {"recommendationid": "31920867", "author": {"steamid": "76561198121005401", "num_games_owned": 775, "num_reviews": 4, "playtime_forever": 219, "playtime_last_two_weeks": 0, "last_played": 1486577100}, "language": "german", "review": "I like the game very much, except the ending. This is kinda \"Japanese\" ...", "timestamp_created": 1495558864, "timestamp_updated": 1495558864, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497512", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31832481": {"recommendationid": "31832481", "author": {"steamid": "76561198062037559", "num_games_owned": 156, "num_reviews": 3, "playtime_forever": 68, "playtime_last_two_weeks": 0, "last_played": 1494645859}, "language": "english", "review": "i cant live normally after this, why did this happen.", "timestamp_created": 1495158112, "timestamp_updated": 1495158112, "voted_up": false, "votes_up": 7, "votes_funny": 3, "weighted_vote_score": "0.410840", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31783628": {"recommendationid": "31783628", "author": {"steamid": "76561198081536121", "num_games_owned": 191, "num_reviews": 14, "playtime_forever": 317, "playtime_last_two_weeks": 0, "last_played": 1495019116}, "language": "english", "review": "I didn't expect this game to be that good.", "timestamp_created": 1494925390, "timestamp_updated": 1494925390, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504951", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31744068": {"recommendationid": "31744068", "author": {"steamid": "76561197990347787", "num_games_owned": 469, "num_reviews": 45, "playtime_forever": 151, "playtime_last_two_weeks": 0, "last_played": 1494754527}, "language": "french", "review": "Nekopara: The Line\nLa fin se voit venir à 10 kilomètres malheureusement", "timestamp_created": 1494755084, "timestamp_updated": 1494755084, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31667115": {"recommendationid": "31667115", "author": {"steamid": "76561198326213075", "num_games_owned": 154, "num_reviews": 24, "playtime_forever": 448, "playtime_last_two_weeks": 0, "last_played": 1494428747}, "language": "english", "review": "Sweetest Monster is a Kinetic Novel (= no choices involved) presenting a ~3 hour long read accompanied by eerie music and sound effects which will lead you to a mysterious yet nostalgic universe.\nThe art is really well done, both character sprites and scenery are awesome. The story presents some plot twists, yet, from another perspective it's quite realistic and relatable.\nI'd say the main topic of this game is life. How some choices might alterate the situation you are living (and sharing with your surroundings) significantly, and, eventually bring you a dreadful sense of guilt.\nCharacters are well presented, relatable personalities, interesting traits, nice coloring. \n+Also, some fanservice is presented but it's not the main point of the story.\n\n8.5/10", "timestamp_created": 1494429876, "timestamp_updated": 1494429953, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.566434", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31521433": {"recommendationid": "31521433", "author": {"steamid": "76561198273866948", "num_games_owned": 90, "num_reviews": 30, "playtime_forever": 94, "playtime_last_two_weeks": 0, "last_played": 1510644194}, "language": "english", "review": "Definietely good written plots, perfect music and astonishing art.\nOHHHHH BELL I WILL YOU BE MY KITTY!!!", "timestamp_created": 1493806775, "timestamp_updated": 1493806775, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.442665", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31501746": {"recommendationid": "31501746", "author": {"steamid": "76561198231592808", "num_games_owned": 24, "num_reviews": 1, "playtime_forever": 143, "playtime_last_two_weeks": 0, "last_played": 1493711180}, "language": "english", "review": "A very short, yet good VN. The artwork kind of threw me off, but I warmed up to it quickly. I loved the music, it matched the story greatly. I enjoyed it, in fact I finished in one sitting.", "timestamp_created": 1493711326, "timestamp_updated": 1493711326, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497512", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31496284": {"recommendationid": "31496284", "author": {"steamid": "76561197990355102", "num_games_owned": 417, "num_reviews": 1, "playtime_forever": 212, "playtime_last_two_weeks": 0, "last_played": 1493600182}, "language": "english", "review": "This story leaves a strange aftertaste of being \"not enough\", \"not quite there\". A swing for a dollar and a hit for a nickel.\n\nLast time i felt it was with the \"Eternity she wished for\". It is not the thing you drop out in the middle and forget next day. It has \"it\". But it has it \"not enough\" to be suggested or told about.\nThat also means if you read the \"Eternity\" and enjoyed it and it left you with nothing like that \"reader's remorse\", that perhaps this story would be a smooth ride with you too. And if you read the latter and then wished you would not, then perhaps you skip this one too. \n\nIt is not that their plots are similar or anything, it is just the same irrational \"Oh, it could be a perfect story, if it only would\" feelign they both leave in me.\n\nIt frankly is not easy to describe the feelings without goinf into details, and details would be spoilers. So, i guess this review would seem biased and unsibstantiated, and perhaps it is.\n\n1. If the author's point was to unnerve the reader by making a micro Summer Days, by submerging him into \"some games hurt\" - then it was reached, absolutly. Though, my personal uncanny valley started with \"the family that still may be rescued\" emotional chasm, not the fan-service culmination itself. So, i kind of was untouched by the scene that was planned as the most shocking and cruel.\n\n2. Let me say, the story was too short for all the content the author tried to squeeze into it. It is a \"constructed\" story, ratehr than \"born\" one. It feels like when one developes One Great Plan and then when some narrative starts flowing from it he jsut squeezes it into \"what it must be\". \n\nIt kind of works. Kind of. Because some natural sincirity gets lost in those hard work hours. Chekov's guns are way too exposed, without any lampshading. Tolstoy syndrome happens here and there: crucial events are getting happening not out of natural development, but because the point in the One True Plot had to be proven and ends jsutify means.\n\nThat very \"willing suspencion of disbelief\" was burst a bit too often, and when the athor tried hastily to knot few threads together, he/she left their ends standing out.\n\nMaybe one day the author would dare to make 3-4 times longer the story over those ideas, so the bines would get overed by some curvy flesh, dunno. As of now, sorry, to me this story feels like \"Oh, those fair people did so try to make this journey pleasant for us, it is a shame we ere less happy than their efforts were worth. Though i know 3-4 times more would be much more exhaustive, and perhaps much less on ROI scale, and the plot with get more and mroe runaway tendency as the character would be getting the breathe of their own. So, it is veeery easy to me to make suggestions like that investing nothing.\n\nJust, this story does have a potential, but not in this short form where it became too much obviousy \"constructed\".\nIf it was not worth notincing, ig it was just \"an obvious miss and nothing to talk about\" that would make it mmuch less complicated :-D\n\n3. And my personal thing, damn it, when the same team makes text and background graphics, when they are not best matches copypasted from chans or devianart, then why they do contradict one another? sigh... Perhaps i should not be even noticing those discrepancies, but... that willing suspension of mine, it was all like an old tire not patched enough....\n\nOTOH, i was noticing picture mismatches even in Ame no Marginal. So perhaps i am just a picky reader and this time i pick on Ebi-hime, having nothign better to do :-D", "timestamp_created": 1493678692, "timestamp_updated": 1493678692, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31496265": {"recommendationid": "31496265", "author": {"steamid": "76561198029304262", "num_games_owned": 48, "num_reviews": 4, "playtime_forever": 177, "playtime_last_two_weeks": 0, "last_played": 1493678043}, "language": "english", "review": "This was awesome. Reminded me of some of the darkness of Saya No Uta. This story does a good job of not being too fanservicey verus telling a unique disturbing story that will get you excited in a \"yay, not another typical story\" high feeling. I appreciated the extra menu section after finishing the story to get a perspective on where the author was coming from while writing it. She has a decent understanding in why people say the things that they do and not just that they say them and it sounds good (this makes the characters more believable). I did get bored and did some speed reading through some of the conversations that seemed typical and predicatble, but for some people, it may be neccessary to have these conversations in order to contrast the other areas of the story that are not predictable (suspense and unexpectedness).", "timestamp_created": 1493678598, "timestamp_updated": 1493678598, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31380524": {"recommendationid": "31380524", "author": {"steamid": "76561198062350216", "num_games_owned": 255, "num_reviews": 40, "playtime_forever": 186, "playtime_last_two_weeks": 0, "last_played": 1493244842}, "language": "english", "review": "A visual novel that while relatively short has more fleshed out characters than most long visual novels that I read. In this you do not make choices, the tale is linear however it is one that will likely take you in quickly.\n\nI wasn't sure what to expect going into this and I am glad I didn't do any research. The plot kept me wanting to read more just to see what would happen next.\n\nTher characters are not riddled with tropes and feel like real people in their quirks and most importantly [b]flaws[/b].\n\nThe music is excellent at setting the atmosphere and the sound effects are no exception, the two working together to keep you immersed in the moment.\n\nI won't say too much more but I can't suggest you give this a read enough. It's n ot extremely expensive and even at full price I would say this work of art is worth your money.", "timestamp_created": 1493231311, "timestamp_updated": 1493231311, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.540693", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31370060": {"recommendationid": "31370060", "author": {"steamid": "76561198049491696", "num_games_owned": 111, "num_reviews": 28, "playtime_forever": 290, "playtime_last_two_weeks": 0, "last_played": 1493170461}, "language": "english", "review": "1/10\n\nSweetest Monster is a visual short story about Robin, a middle-aged man who is in the generic Mid-life crisis. He feels trapped in a job he doesn't like, he's constantly at odds with his wife and is alienated from his daughter. \n\nHe meets Belle, a spirit manafesting itself as a teenaged cat-girl. She seduces him, and being a weak man who lets life happen to him, goes along for the ride.\n\nI found his character to be a little one-dimensonal and rather predictable. He doesn't do the things he knows he should, doesn't own his actions and lets his testicles lead him deeper into trouble. The other characters are uninteresting, not at all fleshed out, and very boring.\n\nThe story reminds me of an old pulp thriller. A smiple storyline spiced up with forbidden love and capped a shock ending.\n\nSwetest Monster is a story. it's not interactive and you just sit and read. A book or T.V. would be better. The art is a let down. Not that it's bad. They use  the same pictures over and over making it very uninspiring.\n\nIn closing, even though Belle is an ancient spirit/ teenage cat-girl, this is a pretty thin smoke screen to cover the fact that Sweestest Monster is little more than a story about an adult who has a sexual relationship with a child. \n\nI give this VN one out of ten Pedophiles.", "timestamp_created": 1493184007, "timestamp_updated": 1502482878, "voted_up": false, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.442020", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31353775": {"recommendationid": "31353775", "author": {"steamid": "76561198030848718", "num_games_owned": 44, "num_reviews": 1, "playtime_forever": 452, "playtime_last_two_weeks": 0, "last_played": 1493116177}, "language": "english", "review": "This game completely fails to deliver on its appeal. This isn't going to sell you what you're looking for.\n\nA story about an 40 year oldman driven down to a broken wheel, facing increasing difficulty to manage his family relationships. Finding himself indulging spirital/physical temptation to betray his wife and child. You expect to peer into the insights of a older man with life expierance/morals/tradition silently choosing whether or not to fall down the path of depravity. Instead this is written as if the story was simply about a deadbeat loser 26 yearold, recently married yet having an afffar with a greedy sweet16 hottie with daddy issues. \n\n\nThree reasons you won't be able to immerse yourself into this story:\n\n1) The characters appear fully on screen in as if they are backed against a blank wall then copy pasted into a background, while you are expected to believe that they doing all these actions that require them to be sitting down or interacting in a way where they can't possibly be just standing infront of the screen. Better off just drawing their heads and tagging it at the end of their dialogue in conversation with nothing else but a wall of text to scroll down. \n\n2) Breaks  up some segments of the story with date and month transions that were too sparsed to keep track of anyway. \n\n3) Breaks immersion often by cutting right into the middle of the next scenes ahead, so you are left thinking, what? how did we get here? Guess I'll just assume what happened myself.", "timestamp_created": 1493112162, "timestamp_updated": 1493112162, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.520203", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31327655": {"recommendationid": "31327655", "author": {"steamid": "76561198210437765", "num_games_owned": 60, "num_reviews": 3, "playtime_forever": 101, "playtime_last_two_weeks": 0, "last_played": 1492977647}, "language": "english", "review": "I saw the twist coming but still enjoyed seeing it play out. Usually don't go for option free VNs but this one had good writing and the sense of dread it creates was worth it. Recommend it for the experience. Don't spoil it for yourself even if you think you know what goes down-trust me!", "timestamp_created": 1492978392, "timestamp_updated": 1492978392, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31289371": {"recommendationid": "31289371", "author": {"steamid": "76561197988159983", "num_games_owned": 176, "num_reviews": 3, "playtime_forever": 344, "playtime_last_two_weeks": 0, "last_played": 1491267143}, "language": "english", "review": "Great Visual Novel. Well written and a very interesting story that I'm guilty of wanting more of which has got me thinking about different mediums that this story could continue or be transferred too. (I could totally see this being a weird ITV3 mid-day movie starring David Tennant as the lead.\n\nDeffinitely interested to experince other stuff from this auther and even more interested if there is more to this story to come.", "timestamp_created": 1492838243, "timestamp_updated": 1492838243, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502678", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31230783": {"recommendationid": "31230783", "author": {"steamid": "76561197997667732", "num_games_owned": 963, "num_reviews": 7, "playtime_forever": 98, "playtime_last_two_weeks": 0, "last_played": 1486826878}, "language": "english", "review": "Who is this Dev and how did they get ahold of my internet browser history?\n10/10, would read again.", "timestamp_created": 1492575611, "timestamp_updated": 1492575611, "voted_up": true, "votes_up": 1, "votes_funny": 4, "weighted_vote_score": "0.505238", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31090532": {"recommendationid": "31090532", "author": {"steamid": "76561198119123853", "num_games_owned": 143, "num_reviews": 22, "playtime_forever": 194, "playtime_last_two_weeks": 0, "last_played": 1491968277}, "language": "english", "review": "i really liked the thems on this game it was dark and intersting and oh that ending.\nthings i didnt like that it felt a bit too short would have liked it to be longer.\nother than that i higly recomend this game it was very good", "timestamp_created": 1491968996, "timestamp_updated": 1491968996, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30975652": {"recommendationid": "30975652", "author": {"steamid": "76561198018881080", "num_games_owned": 90, "num_reviews": 1, "playtime_forever": 340, "playtime_last_two_weeks": 0, "last_played": 1491469411}, "language": "english", "review": "Kinetic Visual Novel\nCute Cat Girl\nGuy with Mid-Life Crisis\nWhat can possibly go wrong?\nHint: A lot\nBut it's fun reading the ride.\n\nP.S. Pretty good visuals and Soundtrack\n\n7.5/10\n\nWould read again", "timestamp_created": 1491470118, "timestamp_updated": 1491470118, "voted_up": true, "votes_up": 7, "votes_funny": 2, "weighted_vote_score": "0.583558", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30948732": {"recommendationid": "30948732", "author": {"steamid": "76561198070920223", "num_games_owned": 126, "num_reviews": 5, "playtime_forever": 139, "playtime_last_two_weeks": 0, "last_played": 1491336173}, "language": "english", "review": "I, personally, really enjoyed this VN. As a matter of fact, I'm having a slightly hard time seeing the ending as anything but possitive. But hey, thats just me. And apparently I'm a sicko.", "timestamp_created": 1491334587, "timestamp_updated": 1491334587, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.486765", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30939446": {"recommendationid": "30939446", "author": {"steamid": "76561198019914060", "num_games_owned": 265, "num_reviews": 3, "playtime_forever": 151, "playtime_last_two_weeks": 0, "last_played": 1491300591}, "language": "english", "review": "Easily one of the best stories I've read in a long time.  I strongly suggest this to everyone.", "timestamp_created": 1491300647, "timestamp_updated": 1491300647, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30939412": {"recommendationid": "30939412", "author": {"steamid": "76561198126535571", "num_games_owned": 448, "num_reviews": 9, "playtime_forever": 166, "playtime_last_two_weeks": 0, "last_played": 1491300944}, "language": "english", "review": "Those who do not fancy reading, beware! You have entered the land of kinetic novels where gameplay plays (pun intended) no role. This specific novel packs beautiful art, fitting music and story that will keep you playing, I mean reading. The twist at the end is heavily hinted at and therefore hardly a surprise, but that fact doesn't make it any less disturbing. It may leave foul taste in your heart and visceral feeling of disgust thorough your body. This can be achieved through 3 hours of reading, which I consider to be a good amount of content for the 3 euros I paid for the game. Although I think it would still be wroth buying at its current price, 6 euros.\nProceed at your own caution. \n", "timestamp_created": 1491300514, "timestamp_updated": 1491300514, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30916707": {"recommendationid": "30916707", "author": {"steamid": "76561198049086053", "num_games_owned": 177, "num_reviews": 3, "playtime_forever": 286, "playtime_last_two_weeks": 0, "last_played": 1491625226}, "language": "english", "review": "If you are looking for a quick and quite frankly unnerving read. This is a good choice. 10/10 would have a cat girl ruin my life again.", "timestamp_created": 1491199499, "timestamp_updated": 1491199499, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.508232", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30885340": {"recommendationid": "30885340", "author": {"steamid": "76561197979153841", "num_games_owned": 102, "num_reviews": 5, "playtime_forever": 268, "playtime_last_two_weeks": 0, "last_played": 1510398036}, "language": "english", "review": "This visual novel was so good I downloaded it for free and bought it when I finished it even though I didn't have any intention of re-reading it (even though I probably will in the future), money well spent.", "timestamp_created": 1491077994, "timestamp_updated": 1491077994, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504728", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30884488": {"recommendationid": "30884488", "author": {"steamid": "76561198260422119", "num_games_owned": 147, "num_reviews": 3, "playtime_forever": 185, "playtime_last_two_weeks": 0, "last_played": 1491075029}, "language": "english", "review": "This story was so good it made me sick. \n\nI did call it from the very beginning, the ending, the reasons leading up to it; The explanation.\n\nBut what got me was the delivery. The lack of shame leading to, and the bluntness of the event itself. The characters were colorful, and honest.\n\nOpen.\n\nAnd all of the hints, if you didn't catch on from the beginning, were just subtle enough to be just that; Hints.\n\nThis is, and I can say this with complete honesty, a story that is so bad. It's good.\n\n I guess what I'm trying to say is, You've disgusted me.\n\nGood job. \n\n10/10", "timestamp_created": 1491075432, "timestamp_updated": 1491075498, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30873267": {"recommendationid": "30873267", "author": {"steamid": "76561198061529255", "num_games_owned": 648, "num_reviews": 135, "playtime_forever": 243, "playtime_last_two_weeks": 0, "last_played": 1490961875}, "language": "english", "review": "i dislike writing long reviews but oh god how i wish i knew what to write for this one\n\nwithout spoiling anything, sweetest monster will have you questioning what happens next and your eyes will be glued on the screen as each day passes and the bar is raised even more\nit's a short experience that should take you around 3 hours to finish, the music and the sound effects are far from great, but they can still complement the plot's atmosphere at times, especially when you factor the budget constrains. it's also not the most original thing ever, especially if you're part of the horror-theme VNs niche, but it manages to distance itself a bit from the rest, making it feel unique to some extent\nby the end of it, you may get sad or angry if you didnt like how things turned out, or have a stupid grin on your face as you scream \"CALLED IT\"\nit's definetly not one of urobutcher's works, but if you happened to find this little gem by accident, be sure to give it a try.\nit may even leave you happy for the rest of the day, if you're into that sort of thing, that is\n\njust be sure to read the author's notes once you finish it!\n\ncongratulations on the great job you've done ebi!", "timestamp_created": 1491043144, "timestamp_updated": 1491043144, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502626", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30856341": {"recommendationid": "30856341", "author": {"steamid": "76561198201467087", "num_games_owned": 88, "num_reviews": 21, "playtime_forever": 175, "playtime_last_two_weeks": 0, "last_played": 1490945488}, "language": "english", "review": "Robin Hawkins is an older man who has a deteoriating relationship with his wife and daughter. He can't seem to get a break due his problems, but his cowardly actions don't make the situation better. He meets a cat-girl named Bell. She knows everything about him. That's creepy. This spirit is irresistable to Robin, so he tries to see her as often as he can. Things start to become rather strange. This visual novel is short. You'll be able to finish it within 2-4 hours depending on how fast you read. It might be pricey if you expect something a bit more longer. Wait for it to be on sale. The vn is psychological horror and it can be disturbing once you reach the ending. You have been warned! Highly recommended.", "timestamp_created": 1490976498, "timestamp_updated": 1491015773, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.598151", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30803323": {"recommendationid": "30803323", "author": {"steamid": "76561198038104239", "num_games_owned": 83, "num_reviews": 7, "playtime_forever": 322, "playtime_last_two_weeks": 0, "last_played": 1490740844}, "language": "english", "review": "This is honestly an amazing story. I highly recommend reading the author's notes afterwards.", "timestamp_created": 1490743380, "timestamp_updated": 1490743380, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.560347", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30796947": {"recommendationid": "30796947", "author": {"steamid": "76561197973144769", "num_games_owned": 145, "num_reviews": 4, "playtime_forever": 466, "playtime_last_two_weeks": 0, "last_played": 1496669124}, "language": "english", "review": "This novella gave me a number of emotional responses, aggravation, disgust, and sorrow. The writer knows exactly where she/he wants to take the reader and does so well. \"You've been warned.\" I've read very few visual novels and none that are linear. I did not know what I was getting into, so it was shocking not having any choices and just reading. However the story was compeling enough to keep me reading to find out what happens to the characters. I found this to be a great read/experience in the evening with the lights turned off and headphones on. I read it for about an hour or so over the course of a few nights. The music while repetitive at times is deeply captivating and helps set the sinister mood. I found the art to be superb although I wish there had been more of it. It just needed a few more facial expressions on the two main characters rather than the writer having to describe the reactions. If you are buying this because of the \"nudity\" tag in steam, don't. You'll be disappointed. If you are looking for a good read and something different then I recommend this. If you go into it as a novella or graphic novel you won't be disappointed. Watch as the events unfold in your mind and on the screen and the emotions that go with it.", "timestamp_created": 1490719872, "timestamp_updated": 1490720578, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30684331": {"recommendationid": "30684331", "author": {"steamid": "76561198238180386", "num_games_owned": 117, "num_reviews": 8, "playtime_forever": 300, "playtime_last_two_weeks": 0, "last_played": 1514718887}, "language": "schinese", "review": "感觉很棒 就是看的不太懂", "timestamp_created": 1490272543, "timestamp_updated": 1490272543, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502238", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30663734": {"recommendationid": "30663734", "author": {"steamid": "76561198001263587", "num_games_owned": 1152, "num_reviews": 73, "playtime_forever": 425, "playtime_last_two_weeks": 0, "last_played": 1490161285}, "language": "russian", "review": "Interesting story and drawing that looks very good. It's short but give you some serious plot, and strong dramatic moments. I'm really like if it would be ever full length VN. My gratitude to writer and artist. It's definitely worth buying and reading.", "timestamp_created": 1490161825, "timestamp_updated": 1490161825, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.540322", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30624300": {"recommendationid": "30624300", "author": {"steamid": "76561198072924779", "num_games_owned": 135, "num_reviews": 2, "playtime_forever": 198, "playtime_last_two_weeks": 0, "last_played": 1489956150}, "language": "english", "review": "I am not going to spoil the story, but I did like it to a point. Overall, I hated this visual novel, but that doesn't mean it was of poor quality. I've read many dark themed stories, and this one kind of left a bad taste in my mouth. Or, more specificaly, a cold burning in my chest. The creators did a magnificent job with this story, and definately accomplished their goals. So, weak of heart be warned. I thought that I would be fine but I don't know any more. \n\nThat being said, if a part 2 comes out, I will probably purchase it.", "timestamp_created": 1489957166, "timestamp_updated": 1489957166, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.549942", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30535533": {"recommendationid": "30535533", "author": {"steamid": "76561198020268890", "num_games_owned": 130, "num_reviews": 31, "playtime_forever": 184, "playtime_last_two_weeks": 0, "last_played": 1489643280}, "language": "english", "review": "SPOILERS\n\n\nOkay, I just re-read my review, it's not very Spoiler-specific, but y'know.. Theme spoilers?\n\n\nI'm not recommending this because I like the story. As a matter of fact, words cannot accurately express my disgust and outrage at the conclusion of this story. The only, ONLY f*cking reason I recommend this is because it's compelling in it's f*cked-up nature and dark theme, and just how extreme the tonal shift is near the end; it is not often that I can say a visual novel of all things could make my stomach turn and my blood run cold, those are the genuine feelings that ran through me at the surprise reveal. These are feelings not even 300+ page novels have given me in my many years of being an obsolete nerd that still reads books. I don't often go for this kinda' story, particularly in how far beyond rational limits this author went into taboo and twisted topics, but it still somehow strikes me as artistic, and well-worthy of being purchased.\n\nIf the above piques your interest, carry on and buy it, as a matter of fact I encourage it. Despite my cursing at the start of my review, i'm now typing THIS a few hours after publishing this review, my outrage and disgust having worn off enough to actually somehow admire the fact that I fell head-first into the trap the writer had laid. Despite having read other reviews saying there was a 'twist' at the end, I had thought to myself \"Cat girl is gonna' have him kill his family or something to claim him as her own, pshh, I got this in the bag.\".... Nah dawg, nuh-uh, sh*t gonna' get exponentially more f*cked than you was anticipatin'.\n\nIf you are buying this explicitly because it has a domineering and dark cat girl in it, for the love of God and all that is Holy, RUN. THE F*CK. AWAY.\n\n\n\nP.S. Moral of the story? Do not argue with your wife, go out into near-torrential rains in the middle of the night, and allow a creepily alluring gothic Catgirl-Neko-Whatever aggressively, yet coyly come onto you.", "timestamp_created": 1489634092, "timestamp_updated": 1489685576, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.660102", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30503337": {"recommendationid": "30503337", "author": {"steamid": "76561198064889161", "num_games_owned": 276, "num_reviews": 82, "playtime_forever": 16106, "playtime_last_two_weeks": 0, "last_played": 1497557709}, "language": "english", "review": "stupid bitch took the bait and fucked his daughter", "timestamp_created": 1489476057, "timestamp_updated": 1489476057, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.214454", "comment_count": 0, "steam_purchase": true, "received_for_free": true, "written_during_early_access": false}, "30342486": {"recommendationid": "30342486", "author": {"steamid": "76561198047481915", "num_games_owned": 208, "num_reviews": 1, "playtime_forever": 178, "playtime_last_two_weeks": 0, "last_played": 1488736031}, "language": "russian", "review": "К прочтению обязательна, а к покупке тем более! Этот милый Монстр возьмёт вас за руку и не отпустит до самого конца... 10 из 10.", "timestamp_created": 1488736867, "timestamp_updated": 1488736867, "voted_up": true, "votes_up": 4, "votes_funny": 3, "weighted_vote_score": "0.528475", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30330525": {"recommendationid": "30330525", "author": {"steamid": "76561198028060745", "num_games_owned": 142, "num_reviews": 1, "playtime_forever": 177, "playtime_last_two_weeks": 0, "last_played": 1488689918}, "language": "english", "review": "'Sweetest Monster' leaves me grasping for words to do it justice.  The characterizations, allusions and themes are deeply rooted in the realities of life and the desperation to escape those realities. \n\nThough the game contains nudity and sexual content, I would argue that it is not meant for arousal.  Those play neatly into the author's themes of loneliness, vulnerability, inadequacy and seduction as a weapon.  Despite the fantastical nature of the main antagonist, the issues faced remain rooted in daily life and are sadly relatable.  \n\nI do not consider this a game, instead I look upon it as a short story.  It is a story well worth the time to read.  The sexual psychology at work here and the way it is implemented by the antagonist is superbly and subtly wicked.  The end had me shocked in horror as I was dimly putting the pieces together, but remained unsure of their greater picture.  The final realization cemented the fall into madness for our poor, lonely bird.\n\nI wholeheartedly recommend this title to anyone who likes a good story, especially psychological horror.  This gem of a story belongs in any literature lover's library.", "timestamp_created": 1488694222, "timestamp_updated": 1488694579, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.472103", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30277046": {"recommendationid": "30277046", "author": {"steamid": "76561198031688678", "num_games_owned": 528, "num_reviews": 3, "playtime_forever": 224, "playtime_last_two_weeks": 0, "last_played": 1488402137}, "language": "english", "review": "A very well written story with a dramatic twist! \n\nIf you don't mind the small playtime of around ~4 Hours, then you totally should go for it.\n\nI would really like to see a second part of this unique visual novel! \n\n\n\n", "timestamp_created": 1488458950, "timestamp_updated": 1488458950, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.538283", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30190121": {"recommendationid": "30190121", "author": {"steamid": "76561198072845064", "num_games_owned": 159, "num_reviews": 8, "playtime_forever": 121, "playtime_last_two_weeks": 0, "last_played": 1488098868}, "language": "english", "review": "Great novel. Really invokes a sense of dread. If you want to play a amazing, unique visual novel, check this out.\n\n\n\n", "timestamp_created": 1488099013, "timestamp_updated": 1488099013, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.498771", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30188479": {"recommendationid": "30188479", "author": {"steamid": "76561198043288687", "num_games_owned": 270, "num_reviews": 6, "playtime_forever": 390, "playtime_last_two_weeks": 0, "last_played": 1488092460}, "language": "english", "review": "I'm going to try and keep this as spoiler free as possible.\n\nSweetest Monster is not your typical VN, which is something that people who read these things might be interested to see, and quite literally got me back in and wanting to see how things played out.\nWhile the story isn't very long (but longer than others), it manages to condense all of the feelings and struggles that the MC is going through.\nI must say that, for the most part of my time reading this, I thought that the story was rather predictable, and in Day #3, it was 95% confirmed that I was right, but in the final chapter (not the epilogue), I may as well have been dancing in the 50's because there was twist after twist.\nThe ending (Epilogue) was rather good, as it kept things open ended, and now I'm genuinely interested in seeing a sequal, or bonus DLC in order to see how the choices of the MC impact him in the end.\n\nWhat really would have been nice: \n1. Able to choose actions of the MC (I know it states that this isn't one of those). I feel like the MC is a bit of a fool, but understandably so\n1.a. Different endings based on MC choices\n2. Harem ending, because that totally makes sense~", "timestamp_created": 1488093194, "timestamp_updated": 1488093483, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.503155", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30112617": {"recommendationid": "30112617", "author": {"steamid": "76561198121955630", "num_games_owned": 178, "num_reviews": 3, "playtime_forever": 493, "playtime_last_two_weeks": 0, "last_played": 1487825517}, "language": "english", "review": "what a twist! -M. Night Shyamalan\n\n\n\nsome one kill me", "timestamp_created": 1487825671, "timestamp_updated": 1487825671, "voted_up": true, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.540238", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30034733": {"recommendationid": "30034733", "author": {"steamid": "76561197984432681", "num_games_owned": 377, "num_reviews": 5, "playtime_forever": 231, "playtime_last_two_weeks": 0, "last_played": 1487510733}, "language": "german", "review": "Eine schöne und traurige Geschichte zur gleichen Zeit, ich danke dir das ich Sie miterleben dürfte.", "timestamp_created": 1487510844, "timestamp_updated": 1487510844, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497512", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30029529": {"recommendationid": "30029529", "author": {"steamid": "76561198022363785", "num_games_owned": 468, "num_reviews": 1, "playtime_forever": 169, "playtime_last_two_weeks": 0, "last_played": 1487495085}, "language": "english", "review": "A short but interesting journey about a man and a cat that keeps the mind occupied all the while, I would recommend this to anyone who craves a spine-tingling experience", "timestamp_created": 1487495592, "timestamp_updated": 1487495592, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.517045", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29989672": {"recommendationid": "29989672", "author": {"steamid": "76561198042941314", "num_games_owned": 199, "num_reviews": 1, "playtime_forever": 233, "playtime_last_two_weeks": 0, "last_played": 1490221534}, "language": "english", "review": "Very engaging story, with a big twist.\n\nVery much recommend reading.\n\nps: I (really) hope they make a part 2", "timestamp_created": 1487353842, "timestamp_updated": 1487353842, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29983682": {"recommendationid": "29983682", "author": {"steamid": "76561198152096623", "num_games_owned": 19, "num_reviews": 6, "playtime_forever": 110, "playtime_last_two_weeks": 0, "last_played": 1487296690}, "language": "english", "review": "Sweetest Monster was a story meant to decontruct some things (which is probably obvious from its description) and it does so wonderfully. It touches on a lot of issues, from marriage and family to darker themes that you wouldn't expect. It's the sort of story that you know will end in ruin, but you can't tear yourself away. The art in this VN is very nice, with only a few important characters directly featuring in (and having sprites in) the story.", "timestamp_created": 1487336564, "timestamp_updated": 1487336564, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.540615", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29956474": {"recommendationid": "29956474", "author": {"steamid": "76561198006530009", "num_games_owned": 208, "num_reviews": 2, "playtime_forever": 294, "playtime_last_two_weeks": 0, "last_played": 1487135798}, "language": "english", "review": "Synopsis:\nAs an example of a story that doesn't need to be 'enjoyable' in the traditional sense to be compelling, Sweetest Monster is ultimately a story of failures in communication and the tradgedy a person can bring upon himself.\n\nAs stated in the description, Robin Hawkins has a very poor relationship with both his wife, Sally, and his daughter, Melody.  Beyond this, it's pretty easy to see how Robin is very much responsible for the deterioration in these relationships.  He has arguements with his wife, but rather than try to work through his issues with her, he chooses to run from the confrontations.  He doesn't understand how to relate to his daughter, and again, he tries to ignore the problems she has rather than talk to her about them.  Compounded with the other stresses in his life, the ultimate result is a man in the midst of a midlife crisis, which is right when this story properly begins.\n\nWhile Robin's meeting with the mysterious and peculiar Bell is what sets the tragedy in motion, it's easy to see the places where Robin could have taken hold of his future.  Instead, he reveals himself to be a weak man, easily manipulated by Bell, as she draws him in with impossible tales and suggestive acts.  What begins as mere escapism quickly transforms into something more, much darker and more sinister than Robin ever suspected.\n\nI won't spoil the conclusion, as Ebi-hime has done a good job making sure that it's not a complete surprise.  Astute readers will see what is coming, but the conclusion is well earned.\n\nArt:\nThe aesthetic fits with the story, with dark backdrops in the moments of mystery and unease, but brightly colored settings in the places where Robin feels most comfortable.  The few character CGs are all of Bell, and they all do a good job of conveying just how peculiar a person she is.  At other times, character stills of Bell or Sally will take center stage, and they are always well drawn; no gonk faces to be found here.\n\nMusic and Sound:\nThe soundtrack was provided by Mock Off, and he has done a great job of helping communicate the tone of the scenes through his music.  Many of the tracks are very sparsely arranged, staccato piano or synth melodies over eerie, airy backgrounds with a small amount of percussion to help keep the pieces moving.  The title track, Sweetest Monster, is probably the standout piece in the short OST, doing a fantastic job of generating a sensation of mystery and unease.\n\nThe sound effects are perhaps the only criticism I can find to level at this visual novel.  While some of them are appropriately subdued, I found that the effects used for falling rain, people walking, or children playing were overpowering to the point of distraction.  Thankfully they don't occur often, but a softer, more subdued set of sounds would have worked better with the soundtrack and the tone of the story.\n\nConclusion and Recommendation:\nSweetest Monster, admittedly, is not a story that everyone will appreciate.  It is a story about a confident young woman, a weak-willed man, conflicting emotions and obligations.  This is not a story to read when you're looking for something to perk you up.  If you are looking for something different from the majority of visual novels, however, something that doesn't simply give fanservice for fanservice sake, but uses sexuality as an integral part of its story, you will find something special here.\n\nI highly recommend Sweetest Monster, and though I have not read any of her other works to date, I plan to do so, and will provide recommendations for similar tales at that time.", "timestamp_created": 1487226806, "timestamp_updated": 1487226806, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.563492", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29948053": {"recommendationid": "29948053", "author": {"steamid": "76561197992053136", "num_games_owned": 73, "num_reviews": 1, "playtime_forever": 297, "playtime_last_two_weeks": 0, "last_played": 1487306496}, "language": "english", "review": "A short but well written visual novel that I highly recommend.  The characters, the dialogue, and the atmosphere are much more grounded and real than what you normally receive in the VN medium.  I would like to say this was something of a breath of fresh air; many of the common anime/VN tropes are dispensed with and instead you are given something more immersive.  The ending blew my mind and I really hope ebi_hime continues the story as I can only wonder how the protagonist will continue after such a shocking turn of events.  I plan to recommend this to my friends.  ^_^", "timestamp_created": 1487187521, "timestamp_updated": 1487187521, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29929334": {"recommendationid": "29929334", "author": {"steamid": "76561198009283048", "num_games_owned": 1551, "num_reviews": 26, "playtime_forever": 172, "playtime_last_two_weeks": 0, "last_played": 1487108155}, "language": "english", "review": "Dude. I mean . . . . . DUDE.\n\nThat was . . . something.  It was good? I guess?\n\nThe story is short( 2-3 hours tops), but well written and the characters are all interesting - despite the fact that I honestly found every single one a bit unlikable.  But that's what made them interesting. It is a kinetic novel, as there are no choices.  But given the story, it sort of had to play out as it did.\n\nThe art is . . . different. It suited the story quite well.  Not flashy or fancy. No large chested anime girls.  But that would have been sorely out of place.\n\nThe music was passable. It got a tad repetitive by the time I was done, but that's okay.  No voice overs, and that was also fine.  This is a VN I feel wouldn't have necessarily benefitted from voice acting.\n\nFinal thought, I suppose is [spoiler]Ewwwwwwwwwwwwwwwwwwwwwwwww[/spoiler] with a side of [spoiler]EWWWWWWWWWWWWWWWWW[/spoiler]\n\nGet it on sale and enjoy the weird ride.\n\nP.S. - I had no intentions of writing a review [spoiler]until the ending. *shudder*[/spoiler]", "timestamp_created": 1487108727, "timestamp_updated": 1487108788, "voted_up": true, "votes_up": 17, "votes_funny": 1, "weighted_vote_score": "0.685592", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29908878": {"recommendationid": "29908878", "author": {"steamid": "76561198357464764", "num_games_owned": 2, "num_reviews": 5, "playtime_forever": 696, "playtime_last_two_weeks": 0, "last_played": 1487282397}, "language": "german", "review": "i love hot loli eroge. Please more. The focus about age play is perfect for me and my mr. willy. For this price, is free =)", "timestamp_created": 1487018850, "timestamp_updated": 1487018850, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.494827", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29908459": {"recommendationid": "29908459", "author": {"steamid": "76561198079715634", "num_games_owned": 8448, "num_reviews": 13, "playtime_forever": 148, "playtime_last_two_weeks": 0, "last_played": 1486989370}, "language": "english", "review": "No matter how rewarding it can be much of the time, a full family life comes with its own hardships, especially as the years wear on. Routine can smother the spark, if no effort is made to keep it alive. The protagonist of this story feels unloved and abandoned, his wife argues with him day in and day out, his daughter avoids him altogether. So when a pretty young girl appears, seemingly out of nowhere, and offers him a new perspective, [url=https://www.youtube.com/watch?v=KY5hR7z5wWE]will his familial loyalty manage to subdue his base desires[/url]?\n\n[b]Sweetest Monster[/b] is the newest kinetic novel born of [i]ebi-hime[/i]'s quill and published on Steam by [i]Sekai Project[/i]. Its 40 000 words of non-branching story translate to three hours of reading time, give or take one. It boasts widescreen visuals (although the assets are not quite 1080p) as well as a custom original soundtrack and all the quality-of-life features we are used to from modern VNs, like multiple save slots and a skip-read-text mode. It's available on all three major platforms, and as always, I'll note that the presence of a Linux version makes it that much more convenient for me personally.\n\nIt's difficult to talk about [i]Sweetest Monster[/i]'s technical and artistic choices without delving right into [url=http://steamcommunity.com/sharedfiles/filedetails/?id=863497606]the atmosphere[/url]. Every piece of artwork and music in this title is bespoke, and the resulting coherence and intensity of the mood is something that would be impossible to achieve with the stock sprites and elevator music often seen in the lower priced VN market segment. Everything is gloomy and eerie, not so far outside the norm that it would scare you away immediately, but just far enough to make you doubt your own judgment. [url=http://steamcommunity.com/sharedfiles/filedetails/?id=863497645]Bell[/url] is a very interesting take on the [i]femme fatale[/i], the art as well as the writing convey very clearly that there is more to her than meets the eye.\n\nSpeaking in terms of genres, what [i]can[/i] one expect from [i]Sweetest Monster[/i]? I'd say that \"psychological horror\" is a good enough fit, even though it paints an incomplete picture. There are also slight allusions to cosmic horror, and if you like your stories to make you feel small and insignificant, this one may be a decent bet. There is character drama, of course, and a story centered around a young seductress may be particularly appealing to some. Though no matter your expectations going into it, and even if you pick up on more details than I did, the final act should still leave you thoroughly disturbed.\n\nThose who have read my other reviews may already be aware that I'm generally fond of genre subversions. Granted, if [i]Sweetest Monster[/i] were nothing more than a boring rehash of moege catgirl clichés, I wouldn't be writing about it in the first place, but just as a general note: I like being surprised by the fiction I read, and this VN managed to keep me on my toes, even though it was nothing if not upfront about where its story would be headed. On the contrary, watching the main character slide [url=http://steamcommunity.com/sharedfiles/filedetails/?id=863497680]from one careless mistake into the next[/url] and seeing the [url=http://steamcommunity.com/sharedfiles/filedetails/?id=863497714]potential consequences pile up[/url], it comes with all the morbid fascination of [url=http://steamcommunity.com/sharedfiles/filedetails/?id=863497748]watching a train derail in slow motion[/url].\n\nI'm going to dwell on Robin Hawkins a bit more, just because apart from his being rather timid and indecisive, he is pretty far outside the norm for male VN protagonists as well. He is around 40 years old, has a full-time job and a family. He's not a blank slate at all, we start the story learning about his life, his hopes and worries, and it's made very clear that he is a full-fledged character. This also opens him up to being potentially unlikable, depending on how well the reader's views align with his own. Reading some other reviews of this VN, I found that the whole gamut was covered from \"very relatable main character, highly immersive\" to \"implausibly dumb protagonist\" and everything in between. Even though Robin likes to prop himself up as a hapless victim, I fall into the faction that thinks the story might have unfolded very differently if someone had told him earlier and more often that his problems are [url=http://steamcommunity.com/sharedfiles/filedetails/?id=863497772]largely his own damn fault[/url].\n\nAny discussion of [i]Sweetest Monster[/i] would be decidedly incomplete without an intertextual perspective. By the author's own admission, popular moege like [i]Nekopara[/i] were a major influence on this title, but – again – if this were a mere attempt at going with the flow and pandering to market forces, I wouldn't be writing about it. Nor is it a shallow dismissal of the genre or of its audience – it's a tough balancing act, but this VN manages to deliver a rewarding story in its own right while also calmly holding up a mirror from time to time, but without becoming overtly preachy. (If there is an Aesop in here that goes deeper than \"don't trust strange catgirls\", it has evaded me.)\n\nAre there any negatives to this VN? Well, on a technical level, I'll say that the highly ambitious sound design was perhaps just slightly too ambitious for its own good. It makes very good use of rain, of heavy footsteps and other sound effects to build its atmosphere, but there were a few spots where the attention to detail took a momentary dip, such as when outside footsteps sound like they're happening in a closed room because of too much reverb. But as I often seem to say, if that's the heaviest criticism I can come up with, then that already speaks volumes about the work as a whole. Everything else is largely a matter of opinion: some people might find the story distasteful, others may have wished it to be longer. If you like your catgirls only when padded with cotton candy fluff, chances are you've already figured out that this isn't one of those cases. But if you're yearning for something disturbing that can be finished in an afternoon, then be sure to give it a shot.", "timestamp_created": 1487017509, "timestamp_updated": 1487017509, "voted_up": true, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.684295", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29890128": {"recommendationid": "29890128", "author": {"steamid": "76561198066472377", "num_games_owned": 367, "num_reviews": 7, "playtime_forever": 441, "playtime_last_two_weeks": 0, "last_played": 1486954554}, "language": "english", "review": "I will vouch for this VN, it is kinetic, as stated above. I feel like it would be best to go into this blind so you can formulate your own unbiased thoughts and opinions. All I'll say is that I enjoyed the eirie settings and the emotional tug of war that goes on while reading this work of art. It's far from your typical happy slice of life bs, that's for sure. So if you like more serious and darker themed media I would highly recommend picking this up.", "timestamp_created": 1486957434, "timestamp_updated": 1486957434, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29889158": {"recommendationid": "29889158", "author": {"steamid": "76561198111777001", "num_games_owned": 185, "num_reviews": 18, "playtime_forever": 205, "playtime_last_two_weeks": 0, "last_played": 1486950711}, "language": "english", "review": "Do yourself a favour and Read this game (well, buy it first of course!)\nThe writing is spot on, the story is really compelling and quite disturbing in places.\n\nOST is beutiful and fits in quite nicely with the awesome artwork.\n\nMost importantly, contains a cute catgirl! ❤", "timestamp_created": 1486954194, "timestamp_updated": 1486954194, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.471381", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29887876": {"recommendationid": "29887876", "author": {"steamid": "76561198014373952", "num_games_owned": 417, "num_reviews": 6, "playtime_forever": 181, "playtime_last_two_weeks": 0, "last_played": 1486885840}, "language": "english", "review": "Easily would recommend this game. It's short, but very enjoyable. Any sexual content is fairly brief, which is not a negative in my mind. The story is excellent.", "timestamp_created": 1486950390, "timestamp_updated": 1486950390, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.517045", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29867698": {"recommendationid": "29867698", "author": {"steamid": "76561198069704876", "num_games_owned": 191, "num_reviews": 9, "playtime_forever": 1399, "playtime_last_two_weeks": 0, "last_played": 1486888892}, "language": "english", "review": "Very appealing art-style and solid writing.\n\nI don't recommend this if you're looking for something lighthearted and cute. The story is arguably very depressing and the finale is one of the more disturbing conclusions to a VN I've witnessed in awhile.\n\nYou can spot the plot twist a mile away, but that doesn't make it any less unnerving.", "timestamp_created": 1486888979, "timestamp_updated": 1486889189, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.569261", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29862951": {"recommendationid": "29862951", "author": {"steamid": "76561198018178569", "num_games_owned": 51, "num_reviews": 3, "playtime_forever": 171, "playtime_last_two_weeks": 0, "last_played": 1486863139}, "language": "english", "review": "-This is a long, spoiler-filled, rant like review which expresses my full and critical, personal opinion of this VN. It isn't meant to be a direct attack on the author, their content, their views, or anyone that enjoys this work. It is me merely collecting my thoughts on how I felt about this story, which I DID enjoy, but also had some fundamental issues with. Thanks for understanding-\n\nIt’s certainly disturbing, to say the least!\nSweetest Monster had me caught like a moth to a flame, because at a particularly tender spot in my life, I yet again run into something macabre. My morbid curiosity with this VN was particularly with its base plot, and the themes. And the reviews seemed to give it even more of a fascinating persona.\n\n[SPOILERS TO FOLLOW]\nWhat I got in the end, was still something I didn’t expect, even after I had prepared myself for all eventualities. I wasn’t too shocked by the plot twist; in fact I had openly guessed it all long. However, it still caught me off guard.\n\nThe VN itself is incredibly well written, and I had plenty of chuckles and grimaces in equal measure, due to the vivid descriptions of UK life (which I understand all too well). The characters are believable and the dialogue feels right. The overall plot can most certainly be considered “horror”, especially due to the ending. There’s a genuinely unsettling feeling throughout, and the whole thing is set up in a way to lead towards an insane conclusion.\n\nI did feel that this VN accomplished what it set out to do, which was to make you feel unsettled/uncomfortable, and the author’s notes certainly made me aware of such. However, a part of me can’t help but feel somewhat miffed, almost as if I was being punished due to the author’s personal feelings about certain types of Vns, and fanservice being the main target. Which is perfectly fine for them to feel that way, and it’s reasonable to separate the art from the artist of course. It’s not that I think this was any kind of political/social agenda, but it may have also been presented in a way that’s meant to make you bad feel for liking fanservice, and the plot twist exists to execute that very act. This could be the case, or it might not be, I will probably never know. But I hope not, because it would be a shame if that was the goal when the story was hitting such incredible high notes on its own.\n\nTaken in isolation, this is a short but detailed story about a man with a mid-life crisis with his wife and estranged daughter, with supernatual elements, and themes of commitment, obsession and infidelity. It reminds me a lot of the game Catherine in that respect, which is probably what also drew me to this VN. I just couldn’t help but feel like the plot twist, and the author’s intent behind it, sit in direct opposition to this stellar and horrific story, because it seemed less about presenting this horrid truth for the sake of the plot, and more about cheapening the whole experience. That is, the plot twist (at least superficially) appears to be an ‘aha, got you’ moment that is meant to pull the rug from underneath the feet of the reader, and take away what made the plot so engaging. Or put into more words: “That’s what you get for liking cat-girls and fanservice; now don’t you just feel terrible?” At least based upon the author’s notes (and perhaps their intent?) because otherwise it’s just a damn good horror twist, haha. On its own the ‘art’ has a good story to tell, but I’m just concerned by what the ‘artist’ intended us to feel about it. But I could also just not be seeing the forest for the trees in this case.\n\nI was genuinely enthralled by this story of a man potentially ‘cheating’ with a spirit, and I was so sympathetic to his wife and I wanted them to resolve their differences, and for him to be closer with his daughter. The aspect of Bell’s one-sided love and persistence felt like the perfect foil for the main character’s development in this direction, and it would shape him to either be a complete douchebag who ruins his family, or the man who overcomes this midlife crisis and does something about it. Or some twisted area inbetween. It’s clever really; how the interactions with Bell, and the main character’s descriptions of her, are clearly meant to represent one specific thing, which will be the constant hints that lead towards the plot twist. I can openly admit that I was so hooked and invested in the conflicted feelings of the main character, and his divided thoughts between his clear love for his wife, and his bedazzlement by this young cat girl who had so much love for him. It felt like that story was never truly resolved, and maybe it was never meant to be.\n\nPut simply; I was perhaps expecting a story where the infidelity with the cat girl spirit was being used as a plot device for the main character’s reflections on his current life, and what he should do moving forward. So again, the plot twist sort of feels destructive to that, and ‘cheapens’ the experience by making it seem more like it wanted to play a dirty trick on you, and the seemingly deep and emotional story was nothing but the literal pre-text. But that is just my feelings about it, and I am in no way suggesting the author wanted to do that. And at the end of the day you’re free to form your own opinions on the whole thing.\n\nI fully admit that I was captivated by Bell’s character, and I was expecting the inevitable intimate scene, but not out of purely perverted reasons but rather because it would be the apex of this messed up story. And the plot twist was good yes, but I wonder if it just makes the whole theme of infidelity, family and self-improvement just fall apart in the face of it. I was expecting to feel bad, sure, but only due to how far gone the main character was in his infidelity, and how it would affect his family going forward. And whether the supernatural element would feed into that, or perhaps take a whole different direction. Because I really appreciated the story up until that point, and I just personally think that the plot twist’s shock factor is hampered by what it does to the rest of the story preceding it. The plot twist (I personally feel) made me feel bad for all the wrong reasons, and suddenly the story arc is shattered. \n\nThe narrative, at least I thought, seemed to be headed towards a scenario where the main character would have to finally choose between this sick twisted romance with a cat girl, and his shaky but real family, and while the ‘choice’ wouldn’t be an in-game one, and one that just happens as it was meant to be written, I was excited to see whichever choice it would be. I understand that this was all just my expectation, and even projection to a certain extent, and I was actually ok with having none of these fulfilled.\n\nDon’t take any of this to mean that I disliked this story, or that I don’t recommend it. Well, it’s hard to really sell this to most people due to it being a non-interactive VN, with VERY mature themes (plot twist not-withstanding). But I think it’s a worthwhile read if you, like myself, are a moth dancing around a flame and you’re looking for something different, and very very dark. It’s well written, the art is nice, the characters do well and it’ll certainly leave you thinking. I want to stress that nothing I’ve said here is a direct attack on the author, their personal views, their work or anything like that. I actually fully respect the effort that went into this VN, and I respect the bravery to tell such a dark, twisted story, with whatever intent they may have had behind it all. I think Sweetest Monster was a tiny little pocket of disturbing but enjoyable narrative, and I just wanted to fully express my fundamental disappointment with the overall direction of the closing act. Beyond that, I think it’s well worth picking this VN up and deciding for yourself how you feel about it.", "timestamp_created": 1486867961, "timestamp_updated": 1486867961, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29862625": {"recommendationid": "29862625", "author": {"steamid": "76561198071563190", "num_games_owned": 153, "num_reviews": 2, "playtime_forever": 386, "playtime_last_two_weeks": 0, "last_played": 1499179796}, "language": "english", "review": "Do yourself a favour and just buy it already.", "timestamp_created": 1486866604, "timestamp_updated": 1486866604, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.494888", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29858510": {"recommendationid": "29858510", "author": {"steamid": "76561198097727278", "num_games_owned": 152, "num_reviews": 47, "playtime_forever": 251, "playtime_last_two_weeks": 0, "last_played": 1486848932}, "language": "english", "review": "[h1]Background[/h1]\nSweetest monster is a kinetic visual novel ( As in it has no choices or multiple endings) which takes around 3-5 hours to finish depending on how fast of a reader you are. Robin Hawkins is a middle aged man. His relationship with his wife, Sally, is in shambles and his daughter, Melody, no longer speaks to him.\nStuck in an endless cycle, until he meets the mysterious cat girl in the middle of a rainy night, Bell.\nHowever, there is a lot more to Bell than meets the eye,  and His 'dreams' will eventually turn into 'nightmares'.\n\n[h1]Thoughts about the novel[/h1]\n[spoiler]First off, the game contains some fanservice, nudity/sexual content as well as some physchological horror elements, so it's not for anyone who gets triggered easily or finds things of similar elements to be disturbing. [/spoiler]\n\nThe writing is done beautifully as it gets you to sympathize with Robin, and it basically portrays how any normal guy would act in a situation like the one he faced. The novel was an emotional rollercoaster, it's not your typical happy romance visual novel, the story made me feel quite a lot. mostly negative emotions, however i dont mind that. Not every story has to be happy. \n\nI have the greatest respect to Ebi-Hime (the creator of the novel) for being able to create such a story that gets you upset and mad about the actions going on, yet have you hooked to the story and have you end up being glad that you read it.\nAlso among my favorite elements of this novel was the creepy tone of many of the conversations with the female lead, Bell. You never know what she is up to or what her intentions are.\n\nOverall, a great short novel for a reasonable price. I recommend it to anyone who might be interested in this genre, or even if you're new to this genre. I'll be looking into ebi-hime's other works surely and you should too c:\n\nAlso the novel contains a cute catgirl ;)  we all know you like those.", "timestamp_created": 1486850700, "timestamp_updated": 1486892512, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.565003", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29858131": {"recommendationid": "29858131", "author": {"steamid": "76561197982645488", "num_games_owned": 112, "num_reviews": 2, "playtime_forever": 288, "playtime_last_two_weeks": 0, "last_played": 1486849274}, "language": "german", "review": "Ein wirklich sehr gutes VN.", "timestamp_created": 1486849365, "timestamp_updated": 1486849365, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497512", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29849608": {"recommendationid": "29849608", "author": {"steamid": "76561198062232589", "num_games_owned": 354, "num_reviews": 4, "playtime_forever": 249, "playtime_last_two_weeks": 0, "last_played": 1487453941}, "language": "english", "review": "An interesting VN. With quite a story.\n\nThere is nothing else though, as the only gameplay involved is pressing a button to continue the story.\nStill I would higly recomend for story alone.\n\nAnd yes this has uncensored sex and nudity, but it isn't graphic in pictures and more of the reading about the expirience.", "timestamp_created": 1486825220, "timestamp_updated": 1486825220, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29844112": {"recommendationid": "29844112", "author": {"steamid": "76561198272042968", "num_games_owned": 243, "num_reviews": 12, "playtime_forever": 144, "playtime_last_two_weeks": 0, "last_played": 1498604529}, "language": "english", "review": "Even though I had some suspicions about the trajectory of the story as it unfolded, the plot twist struck just as hard as the one in the Sixth Sense. I yelled “No $^#^ing way” quite loud. This is probably one of the most depraved visual novels I've ever read. And because of that, it is one of the most memorable. I’m most likely going to be thinking about this one for the rest of the evening, and probably much longer. Per the Author's notes, it was their goal to make the reader feel uncomfortable. They succeeded. That's not a bad thing though. There is a reason I own everything ebi-hime has written that is available on Steam.  Most of the works are not very long, but they always leave a lasting impression. \n\n10/10\n", "timestamp_created": 1486809171, "timestamp_updated": 1486809171, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29821879": {"recommendationid": "29821879", "author": {"steamid": "76561198036780589", "num_games_owned": 182, "num_reviews": 1, "playtime_forever": 217, "playtime_last_two_weeks": 0, "last_played": 1486728507}, "language": "english", "review": "This game has a story that will pull you in hard than take you though a emotional rollercoaster . And i will also make a qote from Lisa's deiscription \"Featurs A life ruining gaming experience.\"", "timestamp_created": 1486727857, "timestamp_updated": 1486728410, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.534884", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29819017": {"recommendationid": "29819017", "author": {"steamid": "76561198053210555", "num_games_owned": 323, "num_reviews": 84, "playtime_forever": 370, "playtime_last_two_weeks": 0, "last_played": 1486711852}, "language": "english", "review": "This was a pretty decent story, albeit short. On the plus side, the story had me feeling some genuine emotions. Most of those were negative emotions but I appreciate it just the same as positive emotions. Not every story has to be a pleasant one. It's not easy to write a story that's likely to upset the reader and still have them feeling they were glad to have read it. I respect that.\n\nI found the main character, Robin, rather frustrating throughout most of the story. While most VNs are fine with a generic male protag who's friendly, agreeable, easy-going, etc so that the player can self-insert, here the author is brave enough to write one that you probably won't agree with. I certainly didn't. I couldn't self-insert here even with a 6 foot long shoehorn. It's all very deliberate and well-written, though, and that's the main difference between the good kind of frustrating and the kind that makes you genuinely dislike the story.\n\nAlso among my favorite negative emotions was the unnerving/creepy tone of many scenes. The female lead, Bell, is very difficult to trust. You never feel like you understand her motives or intentions and you really just want Robin to interrogate her but, as I mentioned above, he's not the type to act the way you would like so you're stuck being unnerved. I like it.\n\nDon't get me wrong, though. There were some positive emotions, too, and I don't only mean the sexy kind. There are a bunch of happy scenes and a smiling Sally is a treasure.\n\nOne mark against it is that I would have liked more time to be spent on the characters and their preexisting relationships. Enough is given for the reader to fully understand their situations and motives but a little bit more fleshing out would have been appreciated (and it would have helped with the length a little, too).\n\nOverall, a great read. A bit short at like 2+ hours but for about $5, that's not bad. I recommend it and I know I'll be looking into the author's other works, myself.", "timestamp_created": 1486715717, "timestamp_updated": 1486715733, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.615850", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29814780": {"recommendationid": "29814780", "author": {"steamid": "76561198070359418", "num_games_owned": 44, "num_reviews": 1, "playtime_forever": 114, "playtime_last_two_weeks": 0, "last_played": 1486693336}, "language": "english", "review": "I've never felt particularly compelled to read VNs (and usually make fun of them for being rife with fanservice, appealing to weeb culture, etc.) until I saw a let's player do the opening chapter of Sweetest Monster recently. After enjoying the writing style of the opening scene, I decided to give it a go. \n\nThis VN contains no dialogue choices and is basically a picture book but written in Python. Soundtrack is barebones, but sets the right mood for the scenes that transpire. Writing is pretty genre-saavy, and while some things may be cringy to read as someone who typically avoids VNs and H-games, I thoroughly enjoyed much of the dialogue and characterizations. I was not a huge fan of the sex scenes, but they definitely fit well into the story and could be considered \"necessary\" to the advancement of the plot. \n\nThe whole story took me only ~2 hours to finish, but it was a very enjoyable, small scale psychological thriller/relationship drama. I'm feeling a Strong 6/Light 7 on this one.", "timestamp_created": 1486694308, "timestamp_updated": 1486694308, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29813607": {"recommendationid": "29813607", "author": {"steamid": "76561198043974515", "num_games_owned": 82, "num_reviews": 1, "playtime_forever": 248, "playtime_last_two_weeks": 0, "last_played": 1486794023}, "language": "english", "review": "It's not about th cat girl. It's about the plot", "timestamp_created": 1486688766, "timestamp_updated": 1486788482, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.436457", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29810322": {"recommendationid": "29810322", "author": {"steamid": "76561198120348301", "num_games_owned": 873, "num_reviews": 389, "playtime_forever": 201, "playtime_last_two_weeks": 0, "last_played": 1486594701}, "language": "english", "review": "A great kinetic (no choices, you only read) visual novel with horror elements. But there was a scene (a CG, actually) that made me guess the ending (more or less, but still)… It’s fine tho, I’m still pretty satisfied of reading this vn! The art style is different, and fits the story. The BGM is okay, short tracks but they also merge with the weird atmosphere of that world. I enjoyed the writing quite a lot, Robin gave me this feeling of being submissive to his desires, and despite doing what he did, I still liked him? I don’t know exactly how to put this, I guess. But I liked to read a male point of view where the man didn’t had the control of the situation. There’s some fan service (which I don’t mind), and the story’s idea definitely shines through all of it. \n\n8/10. I’d love if Shrimp Princess could write more stories like this one. <3", "timestamp_created": 1486674729, "timestamp_updated": 1486674729, "voted_up": true, "votes_up": 36, "votes_funny": 2, "weighted_vote_score": "0.783255", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29809381": {"recommendationid": "29809381", "author": {"steamid": "76561198078045769", "num_games_owned": 32, "num_reviews": 1, "playtime_forever": 246, "playtime_last_two_weeks": 0, "last_played": 1486684758}, "language": "english", "review": "This was my first VN and I loved it through and through, the story was intrenching.  Sweetest monster also had a great pace to it.  As it was my first VN it seemed to have ended rather suddenly, but I guess thats how it goes.", "timestamp_created": 1486671398, "timestamp_updated": 1486671398, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29803874": {"recommendationid": "29803874", "author": {"steamid": "76561198174821091", "num_games_owned": 117, "num_reviews": 5, "playtime_forever": 282, "playtime_last_two_weeks": 0, "last_played": 1486654680}, "language": "english", "review": "Want a VN that can mess your mind and make you rewind the story to wrap your head around it? Buy this. It will, most definitely, mess with your head. If you are a fan of slow built small thrillers, Sweetest Monster will be worth your time", "timestamp_created": 1486654905, "timestamp_updated": 1486654905, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29803056": {"recommendationid": "29803056", "author": {"steamid": "76561198042473726", "num_games_owned": 229, "num_reviews": 3, "playtime_forever": 113, "playtime_last_two_weeks": 0, "last_played": 1486714029}, "language": "english", "review": "I admit, at first I was not sure what to make of the game - these sorts of \"stories\" have been popping up all over Steam lately. This, however, was a fantastic tale. Put me on the train with other reviewers who said it ended too soon. Yes, there is some nudity to the story, but in the narrative, it isn't just thrown out there for a quick buck - it fits. I started reading intending to stop for the night, but didn't finish until the story returned to the main menu.\n\nI had suspicions up until the end, and then I nearly yelled aloud. Now if only I could forget so I could read it again!\n", "timestamp_created": 1486652715, "timestamp_updated": 1486652715, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29800835": {"recommendationid": "29800835", "author": {"steamid": "76561198131524273", "num_games_owned": 72, "num_reviews": 11, "playtime_forever": 97, "playtime_last_two_weeks": 0, "last_played": 1486645639}, "language": "german", "review": "Amazing Story - 10/10 worth to read.", "timestamp_created": 1486645696, "timestamp_updated": 1486645696, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497512", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29798440": {"recommendationid": "29798440", "author": {"steamid": "76561198031752714", "num_games_owned": 193, "num_reviews": 9, "playtime_forever": 310, "playtime_last_two_weeks": 0, "last_played": 1486634640}, "language": "english", "review": "Do you like well written stories? \nDo you like good drama? \nDo you like interesting characters? \nDo you enjoy cool art styles in your vn's?\nDo you enjoy good pacing?\n\nWell stop reading this review and download Sweetest Monster!\n\n", "timestamp_created": 1486634869, "timestamp_updated": 1486634869, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.486111", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29795882": {"recommendationid": "29795882", "author": {"steamid": "76561198039579705", "num_games_owned": 90, "num_reviews": 6, "playtime_forever": 399, "playtime_last_two_weeks": 0, "last_played": 1486621702}, "language": "english", "review": "I didn;t expect mnuch but I mostly liked the music and thought it'd be interesting when a friend showed this.  and it turned out darker than I ever expected for the ending.  now I want more goddamnit.", "timestamp_created": 1486621339, "timestamp_updated": 1486621339, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29794917": {"recommendationid": "29794917", "author": {"steamid": "76561198025047055", "num_games_owned": 117, "num_reviews": 12, "playtime_forever": 224, "playtime_last_two_weeks": 0, "last_played": 1488348545}, "language": "english", "review": "At one point the story was leading up to what in a more cliché VN would be an important dicision point. I worried, with this being a kinetic novel (no choices), if I would be left disatified with the route it took. Then I remembered that Ebi-Hime wrote it and knew I would not be disappointed. She has yet to betray my confidence.\n\nAnd don't forget to read the authros notes afterwards; as alwayse they were interesting!", "timestamp_created": 1486615866, "timestamp_updated": 1486615922, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29794791": {"recommendationid": "29794791", "author": {"steamid": "76561198089947518", "num_games_owned": 144, "num_reviews": 3, "playtime_forever": 554, "playtime_last_two_weeks": 0, "last_played": 1492902687}, "language": "english", "review": "Your gonna cut your dick off after the good 'ol sex scene. I sat there for quite a while contemplating suicide after that fuck mothering plot twist 10/10 would play again", "timestamp_created": 1486615119, "timestamp_updated": 1486615119, "voted_up": true, "votes_up": 3, "votes_funny": 3, "weighted_vote_score": "0.451489", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29794554": {"recommendationid": "29794554", "author": {"steamid": "76561198029218729", "num_games_owned": 69, "num_reviews": 1, "playtime_forever": 218, "playtime_last_two_weeks": 0, "last_played": 1486666739}, "language": "english", "review": "So good.", "timestamp_created": 1486613648, "timestamp_updated": 1486613648, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29794071": {"recommendationid": "29794071", "author": {"steamid": "76561197991281007", "num_games_owned": 658, "num_reviews": 5, "playtime_forever": 157, "playtime_last_two_weeks": 0, "last_played": 1486610201}, "language": "english", "review": "This actually managed to disturb me a little.", "timestamp_created": 1486611105, "timestamp_updated": 1486611105, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29793362": {"recommendationid": "29793362", "author": {"steamid": "76561198118210921", "num_games_owned": 40, "num_reviews": 1, "playtime_forever": 301, "playtime_last_two_weeks": 0, "last_played": 1486715163}, "language": "english", "review": "No Insurance Fraud here.", "timestamp_created": 1486606973, "timestamp_updated": 1486606973, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29787691": {"recommendationid": "29787691", "author": {"steamid": "76561198171390022", "num_games_owned": 122, "num_reviews": 23, "playtime_forever": 474, "playtime_last_two_weeks": 0, "last_played": 1486606234}, "language": "english", "review": "Holy Christ this game is a pearl\nThe writing is of quality and descriptive, Ost far from bein' obnoxious and the whole mix create an atmospheric alchemy that I'm really fond off.\nThe characters definitively have relatable personalities, I didn't get into the NSFW area yet and I couldn't care less, it's an experience in itself.\nI know, well, more like I feel like it's going to end up badly and in tears, it's that kind of story, but I enjoy it so greatly that I hardly believe this game cost less than 6 bucks atm.\n\nThanks for it, really.\nI'll recommend it without a shade of hesitation to anyone.\n\nEdit - I almost forgot the sweet and what feels like an handcrafted art-style, definitively improving the already amazing mix of Writing + Ost combo .\n\nEdit² - Just finished it and OH BOY THAT ENDING, Jesus. Fucking. Christ.\nI love it in some twisted ways.", "timestamp_created": 1486581513, "timestamp_updated": 1486606317, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.571270", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29786557": {"recommendationid": "29786557", "author": {"steamid": "76561198053559483", "num_games_owned": 145, "num_reviews": 33, "playtime_forever": 452, "playtime_last_two_weeks": 0, "last_played": 1486576858}, "language": "schinese", "review": "剧情不错的小品级视觉小说，是个稍许黑暗的故事，带有一些哥特的味道，有点像《沙耶之歌》，但是没有什么重口的画面。作者说这个故事就是要恶心人的，我看是的，透过画面、音乐与文字的配合，我可以切实感受到家庭冷淡和中年危机，这种生活现实带来的压抑感非常沉重，搞得我整个人都有点不好[spoiler]，还好猫娘有福利[/spoiler]。这个游戏剧透多了就没意思了，总之如果英语阅读能力还不错的话还是可以入的。我虽然记录显示用了七个小时打通，但其实包括了部分待机时间，流程实际上不长，游戏也不包含任何选择支，如果阅读快的话，像老外两个小时就可以结束了。", "timestamp_created": 1486577433, "timestamp_updated": 1486623667, "voted_up": true, "votes_up": 21, "votes_funny": 2, "weighted_vote_score": "0.753710", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29784762": {"recommendationid": "29784762", "author": {"steamid": "76561197975720642", "num_games_owned": 361, "num_reviews": 8, "playtime_forever": 206, "playtime_last_two_weeks": 0, "last_played": 1486555087}, "language": "english", "review": "This is my first visual novel I've bought in Steam and let's just say I'm very happy with this. I don't really know how to review novels, especially ones with a length like this one (it took me 3.4hrs). But I can say that the price it's at, it definitely delivers an fulfilling experience. \n\nYou can't make any choices or go for different routes, but I think it would've hurt it more if it had things like that. It may sound weird that there's not any kind of interaction, but since it's not too long, it didn't really bother me. Let's just say that if there's ever a sequel or DLC, w/e, I'd buy it. (in all honesty, I'd LOVE to see more of this world! Maybe an entirely different situation, that'd be interesting!)\n\nBut as it stands, it's a nice, tight package. If I had to mention some faults, I'd say that some of the sound effects could use some work. It's a nitpick for me, but I don't think a sound like that comes from when closing a wooden door. Other than that, good stuff!\n\nEDIT: I forgot to mention this: the Extra mode is a great inclusion after you're done with the game. The notes section was a good read. :)", "timestamp_created": 1486571453, "timestamp_updated": 1486571873, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29783781": {"recommendationid": "29783781", "author": {"steamid": "76561198006944307", "num_games_owned": 292, "num_reviews": 14, "playtime_forever": 146, "playtime_last_two_weeks": 0, "last_played": 1486563940}, "language": "english", "review": "is pretty gud, also ew.", "timestamp_created": 1486568169, "timestamp_updated": 1514515171, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29781357": {"recommendationid": "29781357", "author": {"steamid": "76561198021823625", "num_games_owned": 299, "num_reviews": 3, "playtime_forever": 539, "playtime_last_two_weeks": 0, "last_played": 1514929885}, "language": "english", "review": "A dark mirror to NekoPara, I really enjoyed this short but sweet (its a cruel sort of sweetness though) VN, good artwork, a great sountrack that goes well with the unsetling parts of the story.\n\nBell is a great character, i kinda hope i get to see her again someday.", "timestamp_created": 1486560097, "timestamp_updated": 1486560097, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.513311", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29778479": {"recommendationid": "29778479", "author": {"steamid": "76561198031055453", "num_games_owned": 173, "num_reviews": 7, "playtime_forever": 156, "playtime_last_two_weeks": 0, "last_played": 1486548420}, "language": "english", "review": "Hell hath no fury", "timestamp_created": 1486548545, "timestamp_updated": 1486548545, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.495346", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29776805": {"recommendationid": "29776805", "author": {"steamid": "76561198044779587", "num_games_owned": 179, "num_reviews": 2, "playtime_forever": 169, "playtime_last_two_weeks": 0, "last_played": 1486539521}, "language": "english", "review": "best VN ive played in awhile\nliterally mind fucked me", "timestamp_created": 1486539553, "timestamp_updated": 1486539553, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.447368", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29775677": {"recommendationid": "29775677", "author": {"steamid": "76561198049872460", "num_games_owned": 243, "num_reviews": 2, "playtime_forever": 132, "playtime_last_two_weeks": 0, "last_played": 1511764993}, "language": "english", "review": "I might not reccomend this to people who aren't familiar with visual novels in general - but it is a very fucked up, very interesting story that twists visual novel tropes heavily.\n\nAlso, 18+, just a heads up.", "timestamp_created": 1486533018, "timestamp_updated": 1486533018, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.479772", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29774035": {"recommendationid": "29774035", "author": {"steamid": "76561198010730629", "num_games_owned": 188, "num_reviews": 1, "playtime_forever": 159, "playtime_last_two_weeks": 0, "last_played": 1486524676}, "language": "english", "review": "UPDATE: Just completed the story. Phew, that was a trip. As mentioned below, don't expect much in terms of fanservice here. Just a good, dark, disturbing story.\n\nOkay, that twist. I was not expecting that. Holy shit...\n\nI'm not even done and I'm enjoying the hell out of this story. The art style is actualy rather well done for game's budget. The writing, while it does have some holes here and there, is very solid. The characters all feel very \"human,\" (for what that's worth for one in particular) and sympathetic. The MC in particular is quite believable. His flaws, strengths, concerns, reactions, and feelings strike as more of a real person than any sort of anime cliche.\n\nSure, it's a kinetic novel and as such as no replayability, but it's a strong story that makes good use of tension. This is no VN made for the sake of fanservice. This is a VN meant to tell a story, and it's a good story that's told.", "timestamp_created": 1486523840, "timestamp_updated": 1486524785, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.535898", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29773451": {"recommendationid": "29773451", "author": {"steamid": "76561198044748373", "num_games_owned": 222, "num_reviews": 5, "playtime_forever": 197, "playtime_last_two_weeks": 0, "last_played": 1486519712}, "language": "english", "review": "This story has a twist that will take anyone by surprise; well written story with satisfying visuials and moral conflicts. \nThis is a VN and not really a game, there are no choices or diffrent paths you can take \n\nFor anyone feeling a little more adventurous This is a nice VN to add to your collection.\n\nPersonally I found the the looming suspense and relatable characters as an overall enjoyable experience and would recommend it to anyone who wanted a story with some diffrent messages and morals\n\n9/10", "timestamp_created": 1486520691, "timestamp_updated": 1486520691, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29772488": {"recommendationid": "29772488", "author": {"steamid": "76561197999122925", "num_games_owned": 265, "num_reviews": 22, "playtime_forever": 602, "playtime_last_two_weeks": 0, "last_played": 1495903734}, "language": "english", "review": "Spoiler\nhttps://www.youtube.com/watch?v=CxVDnpsGTZY", "timestamp_created": 1486515801, "timestamp_updated": 1486515801, "voted_up": true, "votes_up": 0, "votes_funny": 3, "weighted_vote_score": "0.443518", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29771066": {"recommendationid": "29771066", "author": {"steamid": "76561198092708539", "num_games_owned": 203, "num_reviews": 12, "playtime_forever": 172, "playtime_last_two_weeks": 0, "last_played": 1486502100}, "language": "english", "review": "Sweetest Monster is different in that it tells a mature story that isn't coated in sugary fantasy. The themes of faded feelings and guilty pleasure pervade every corner of its short but well-written story. I came into this game expecting whimsical fan-service as a catgirl sensually posed before me on the title screen, but what I came away with after my two hours were profound questions pertaining to commitment, my own transient existence, and what it really means to live for myself. Thanks to strong usage of vivid language and consistent word choices, the tone remains suspense and deep throughout its many scenes. \n\nThe protagonist Robin is equally mature, being a pleasure deprived professor of music with a nagging wife and a daughter who hardly peeps at him. This dysfunction is painted early thanks to the quaint setting and melancholic tunes that play during his in-home conversations. The monotony that has gone on for much of his life  changes almost instantaneously, however, during a lone walk across a lakeside bridge. There he meets the spirit Bell, who so happens to be a cat girl simply trying to return a huge favor. Everyone in Sweetest Monster possess humanly goals that are relatable which made the reading all the more satisfying. They tend to revolve around the idea of being alive as lines like, \"cats don't have nine lives,\" \"I could be one of those statistics someday,\" to Bell thanking Robin for her own existence showoff expertly injected  subtlety into the reader's subconscious. \n\nRobin's in-home predicament is further accentuated by the dichotomy between the scenes spent in sadness with his wife Sally and those spent in frolick with catgirl Bell. The music does a fantastic job striking this cutoff as if bipolar, almost symbolic of Robin's inner thoughts as he struggles to sustain his relationships with Sally and daughter Melly. The toxic environment he puts up with is convincing. This is amplified by the contrasting personality and aesthetic appeal that Bell brings to his life. It makes for a fun trek into a grown man's cognitive state, oozing with dissonance as something so palatable awaits him in exchange for a foregone commitment that deep down still tugs his heart. \n\nHow quickly can love dissipate, and how quickly does it rekindle? Sweetest Monster turned out to be anything other than what I had labeled it to be. It is an introspective tale about the value of life. It seeks to evoke emotion rather than please. It will also leave the reader with questions, and not because it is left unfinished, but because it is a thought-provokingly good rendition of what it means to be human. I enjoyed my time spent in Robin's head as the questions he tackled could very well be one that any of us may one day experience. If you are like Robin, in need of fresh scenery and some much deserved respite, Sweetest Monster will gladly provide with well-written characters and eye-raising developments.", "timestamp_created": 1486508066, "timestamp_updated": 1486508469, "voted_up": true, "votes_up": 14, "votes_funny": 1, "weighted_vote_score": "0.622411", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29770707": {"recommendationid": "29770707", "author": {"steamid": "76561198050396928", "num_games_owned": 672, "num_reviews": 12, "playtime_forever": 99, "playtime_last_two_weeks": 0, "last_played": 1486506296}, "language": "english", "review": "Ebi-hime is one of my favourite visual novel writers—my personal favourites of hers are [url=http://store.steampowered.com/app/585880/]Once on a Windswept Night[/url] (which is free if you haven't heard of her and want to check out her writing!) and [url=http://store.steampowered.com/app/386990]Asphyxia[/url]—so I had been looking forward to Sweetest Monster for a while, and I read it as soon as I could. I would definitely recommend it to anyone who likes her other VNs, or who just wants to read something short and creepy!\n\nSweetest Monster is about a man who's unhappy with his life; he constantly argues with his wife, he's frustrated with his job, and he doesn't know how to patch up his damaged relationship with his depressed teenage daughter. This unhappiness leaves him vulnerable to the seduction attempts of a mysterious cat girl, and the ensuing relationship is a dark and unsettling mirror of common plot elements in lighter, more “fanservice-y” VNs—make sure you read ebi-hime's detailed author's notes, which unlock after completing the story, if you want more insight about the thought process behind all of that. Ebi-hime's poetic descriptions, along with great choices of art, music, and sound effects, make reading this VN an experience that's both enjoyable and disturbing.", "timestamp_created": 1486506553, "timestamp_updated": 1486506609, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.612196", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29770637": {"recommendationid": "29770637", "author": {"steamid": "76561198110880731", "num_games_owned": 173, "num_reviews": 8, "playtime_forever": 150, "playtime_last_two_weeks": 0, "last_played": 1486510481}, "language": "english", "review": "Im not very good at reviewing but i have read quiet a good amount of VNs on steam so hopefully my input can be helpful.\nI wont mention much about the details of the story as its rather short (i finished it all in 1 sitting).\n\nKeep in mind that this novel doesnt have any routes or multiple endings i.e u simply read through it like a book.\n\nIn general, the theme of the story is rather dark. The atmosphere in the plot involves alot of rain and nights with the music fitting the mood really well. I was getting anxious due to how fitting the music was. ofcourse its not all dark as it rotates with the various characters situation and events so theres a fair amount of sarcastic comedy, intimate romance and so on.\n\nDue to how short the novel is, there wasnt much CGs or arts involved but whatever was used was pretty well drawn and pleasant to watch.\n\nIf you are expecting fanservice there is a small share of it but its so well presented compared to those other VNs that literally throw it on your face. It feels so natural when its shown that it doesnt sink in that well that this is fanservice as your mostly engrossed in the story.\n\nkeep in mind that the story might not be everyone's cup of tea as the goal of the writer was to cause discomfort (as per author notes in the Novel, yes i read those, thats how much i love this VN) and he reached his goal in my case in a good way. \n\nthe characters are very well-written that you can sympathize with them and i didnt find many if any translation mistakes or anything cringe-worthy.\n\nhonestly this novel left me with such complex feelings. i like it so much and hate it for giving me what i did not expect if that makes any sense. its like when you watch an ending to an anime that its a good ending (good as in likeable but not necessarlily positive) but not the ending you were hoping for.\n\nOverall:\nStory: 4/5\nArt: 3.5/5\nMusic: 5/5 (the main theme is so good)\n\ni seriously recommend this VN to any one who is bored of the generic VNs on steam and would like a more dark / different VN and is rather open-minded on plot.", "timestamp_created": 1486506320, "timestamp_updated": 1486506711, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.513147", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29769845": {"recommendationid": "29769845", "author": {"steamid": "76561197970508318", "num_games_owned": 403, "num_reviews": 7, "playtime_forever": 251, "playtime_last_two_weeks": 0, "last_played": 1486496202}, "language": "english", "review": "Lovely short VN! ~4hr playthrough. The music, art, and writing compliment each other well. Story is dark and finishes on a strong note.", "timestamp_created": 1486502963, "timestamp_updated": 1486502963, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.510676", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29760250": {"recommendationid": "29760250", "author": {"steamid": "76561198031916735", "num_games_owned": 306, "num_reviews": 4, "playtime_forever": 167, "playtime_last_two_weeks": 0, "last_played": 1486468319}, "language": "english", "review": "It's not a game, it's an illustrated story.\n\nDisturbing, & Dark. And perhaps a bit controversial. In that you'd never see a story like this on TV, or put to a movie. Which isn't to say it's a bad story.\n\nIf your looking for something Neurotic, or Romantic. You might want to skip this little tragedy. But if you brave it to the end, you might find a moral to the story is something like, Beware overly possessive mischievous cat girls that say they love you.\n\nThe Forshadowing kinda gave away the end, and I was not surprised when the reveal came. Horrified yes. But not surprised. If you ever watched a scary movie, and was like. \"Don't go into the woods!\" \"don't do it!\" \"Nooooo! you fool!\" Yeah.' it was kinda like that.\n\nI kinda wish there was a rating system.\nThe presentation, and art was nice.\nThe music was ok.\nThe writing was a bit drawn out. And could have been edited down a bit. I found myself skipping past some of the dialogue, which at times felt superfluous.\nWith the forshadowing, I found myself just wanting to get to the end.\nOtherwise it wasn't a bad story. and made me think about moraliy, right, wrong, And evil Cat girls. Any story that makes you think is a good story. So. I'll give it a thumbs up.", "timestamp_created": 1486469813, "timestamp_updated": 1486469813, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.513712", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29757149": {"recommendationid": "29757149", "author": {"steamid": "76561198203337561", "num_games_owned": 163, "num_reviews": 7, "playtime_forever": 265, "playtime_last_two_weeks": 0, "last_played": 1486452866}, "language": "english", "review": "“I want to tell you something. Something really important.”\n\nSweetest Monster is a kinetic novel (a visual novel without choices). Although it doesn't have choices, which some might be looking for in a game, it does have a very intricately designed/tightly-knit story that more than made up for the lack of interactivity, in my opinion. I can't bring myself to tell you anything about the story because it is very hard to put to words without spoiling anything, much like Ebi-Hime's other works, but I will say that it leans more toward the horror genre than romance (though it arguably pulls bits from both) and that the story itself is very bold. Beyond that, the best I can offer story-wise, is pointing you toward the author's description of the game. \n\nThe artwork is beautiful, yet carries an air of creepiness to it. Meanwhile, the music is both vibrant and classical, a perfect compliment to the art (especially some of the objects that appear washed-out/antique by intended design). I also found the sound effects to be on point and fitting with the somewhat eerie theme. There isn't any voice acting, but I'm glad because I feel that it might have worked against the dark feel that the artwork and score provided, not to mention how it might have cut over the excellent soundtrack. \n\nThere are also quite a few extras: Art Gallery, Music Box, and Author's Notes. As with the other Ebi-Hime titles I have played, I found the Author's Notes to be very informative, well written, and interesting. I really like what the author set out to do, and accomplished, with Sweetest Monster. The game does indeed have uncensored nudity (I've seen questions posted about this, but couldn't figure out where to place mention of it in my review, so I chose to post it in the most ironic spot I could think of). I'd say that the VN is a bit short as it took me around 4 hours to finish, but I am a somewhat quick reader.  \n\nIn closing, I found Sweetest Monster to be a more than worthwhile and thought provoking read. I would definitely recommend it at its normal price. If you are still unsure, then maybe wait for it to go on sale or pick it up as part of the Ebi-Hime Bundle when that goes on sale.", "timestamp_created": 1486454805, "timestamp_updated": 1486454805, "voted_up": true, "votes_up": 29, "votes_funny": 0, "weighted_vote_score": "0.692107", "comment_count": "6", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29756046": {"recommendationid": "29756046", "author": {"steamid": "76561198067739990", "num_games_owned": 95, "num_reviews": 1, "playtime_forever": 153, "playtime_last_two_weeks": 0, "last_played": 1486588665}, "language": "english", "review": "make a sequel now that was to good to just end like that\n", "timestamp_created": 1486448838, "timestamp_updated": 1486448838, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.402174", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29755277": {"recommendationid": "29755277", "author": {"steamid": "76561198067711512", "num_games_owned": 128, "num_reviews": 1, "playtime_forever": 269, "playtime_last_two_weeks": 0, "last_played": 1487282987}, "language": "english", "review": "This is easily the best VN ive read in a long time if ever.", "timestamp_created": 1486444356, "timestamp_updated": 1486444356, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.415856", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29754195": {"recommendationid": "29754195", "author": {"steamid": "76561197999346452", "num_games_owned": 156, "num_reviews": 24, "playtime_forever": 91, "playtime_last_two_weeks": 0, "last_played": 1503923548}, "language": "english", "review": "The story of a father and his bitch wife and his neglected daughter. Then he meets a cat spirit in a new human body.\n\nYou may find it weird that you don't see your daughter until the end of the game, but that only makes it hotter BABY! WEW!", "timestamp_created": 1486438361, "timestamp_updated": 1486438361, "voted_up": true, "votes_up": 2, "votes_funny": 5, "weighted_vote_score": "0.215144", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29754077": {"recommendationid": "29754077", "author": {"steamid": "76561198259419864", "num_games_owned": 257, "num_reviews": 9, "playtime_forever": 59, "playtime_last_two_weeks": 0, "last_played": 1486437519}, "language": "english", "review": "CAT GIRL IS GREAT", "timestamp_created": 1486437740, "timestamp_updated": 1486437740, "voted_up": true, "votes_up": 8, "votes_funny": 6, "weighted_vote_score": "0.459372", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29753424": {"recommendationid": "29753424", "author": {"steamid": "76561198011106126", "num_games_owned": 90, "num_reviews": 1, "playtime_forever": 97, "playtime_last_two_weeks": 0, "last_played": 1486433609}, "language": "english", "review": "Welp just finished the story, and the writing is done beautifully. It makes you sympathise with the MC and acurately portrays what a typical male would feel in such a situation. Then massive plot twist out of no where that really made my jaw drop.\n\n10/10 would recommend to every one just for the plot twist alone.\n\nEnjoyed it thoroughly\n\nThough a heads up, this isnt a dating sim. But rather a kinetic linear novel, as in there are pictures and a story to read, but you dont have any choices to alter the story path for multiple endings like a visual novel.", "timestamp_created": 1486434411, "timestamp_updated": 1486434538, "voted_up": true, "votes_up": 38, "votes_funny": 3, "weighted_vote_score": "0.695564", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29752774": {"recommendationid": "29752774", "author": {"steamid": "76561197982599663", "num_games_owned": 258, "num_reviews": 37, "playtime_forever": 42, "playtime_last_two_weeks": 0, "last_played": 1486428588}, "language": "english", "review": "So this VN is actually well written! Like, surpisingly well written, which was a nice change of pace. The conversations are pretty realistic, if overly dramatic, the art is nice, and the music is pleasant. I actually played the first 40 min here, narrating everything but the intro if youd like to see:\nhttps://youtu.be/DifZXpRTEi8\nThe cat girl is in the last 15 min or so!\n\nI usually dont like VNs, but found this one to be better put together than others I have looked at in the past. Did not see any of the \"choices\" that the dev said were in the game however in my time, and also did not see any catgirl boobs if thats what you are looking for. Seriously, at the end of the video I went click crazy skipping through the words and still didnt see any. lol.", "timestamp_created": 1486430993, "timestamp_updated": 1486430993, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.275637", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29752488": {"recommendationid": "29752488", "author": {"steamid": "76561198088423268", "num_games_owned": 557, "num_reviews": 4, "playtime_forever": 27, "playtime_last_two_weeks": 0, "last_played": 1510556721}, "language": "english", "review": "A cat is fine too...\n\nActually, it's preferable, in this case.", "timestamp_created": 1486429464, "timestamp_updated": 1486429464, "voted_up": true, "votes_up": 23, "votes_funny": 32, "weighted_vote_score": "0.524251", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39504806": {"recommendationid": "39504806", "author": {"steamid": "76561198354616562", "num_games_owned": 20, "num_reviews": 2, "playtime_forever": 635, "playtime_last_two_weeks": 74, "last_played": 1516524372}, "language": "english", "review": "yes\n\n\n\n\n\n\nkms", "timestamp_created": 1516524429, "timestamp_updated": 1516524429, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 207, "total_negative": 11, "total_reviews": 218}}
