{"reviews": {"36247699": {"recommendationid": "36247699", "author": {"steamid": "76561197997335149", "num_games_owned": 2371, "num_reviews": 76, "playtime_forever": 213, "playtime_last_two_weeks": 12, "last_played": 1516334118}, "language": "english", "review": "This game is shockingly excellent. Like, amazingly so. My friend and I played some single player, and while that was fun, we were just outright blown away by how much more fun this is in multiplayer.\n\nhttps://www.youtube.com/watch?v=NUVBqFzeq7M\n\nMultiplayer was easy to set up (unlike some other non-Steamworks games we've tried of late. I'm looking at you, Lux Alliance), and we had a BLAST playing through what was a fun, vibrant and energetic campaign with tons of little puzzles and tactical challenges.\n\nOverall, if you have friends, you all need to get this game. Seriously, it's just disgustingly fun.", "timestamp_created": 1509730365, "timestamp_updated": 1509730365, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.613192", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "35846920": {"recommendationid": "35846920", "author": {"steamid": "76561198046466112", "num_games_owned": 285, "num_reviews": 245, "playtime_forever": 234, "playtime_last_two_weeks": 0, "last_played": 1509885395}, "language": "english", "review": "I liked it more when it was still \"Subvein\". Since \"Mutant Factions\" it's been a heap of anger and defeat. And he messed up the Survival mode (yes, everything except music is done by 1 guy)", "timestamp_created": 1508439958, "timestamp_updated": 1508439958, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.184268", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35536186": {"recommendationid": "35536186", "author": {"steamid": "76561198147532445", "num_games_owned": 145, "num_reviews": 6, "playtime_forever": 320, "playtime_last_two_weeks": 0, "last_played": 1507371333}, "language": "schinese", "review": "不到100MB的小游戏制作，操作模式惊奇，上帝视角居然还有跳跃，有人会问，上帝视角你都无法看到你跳多高，游戏体验极差，但是，最牛逼的地方在于，他把能跳上去的地方点了高亮,不仅需要技术还需要头脑，当你玩几局突然发现，你还不由自主的抖起腿来，居然还可以跑酷？？？反复横跳yo ~come on秦王绕柱？？？我有RPG你看清楚!!!\n\n\n正经说加入地图编辑器激发了游戏的潜力，我看到了这款游戏未来的可能性\n\n战斗要素可潜可肛，拥有战争迷雾，所以也可以有阴点一说，所以游戏也可以充满乐趣\n\n地图内自由度超高，技能加点系统类似RPG游戏又主动也有被动\n\n可解锁武器也很丰富，更可耻的是还有丰富的载具系统\n\n也有比赛数据系统[spoiler]emmmmmmmmm由于玩的人少吧，我通关数据各项都有在世界前十甚至第一第二的哦（滑稽脸）[/spoiler]\n\n\n[h1]那么接下来我要批评一下此款游戏最大的失误\n\n你什么时候偷偷的加了中文！！！却又不说！！！\n你什么时候偷偷的加了中文！！！却又不说！！！\n你什么时候偷偷的加了中文！！！却又不说！！！[/h1] \n\n\n最后\n[spoiler]这款游戏有点模仿CF啊又杀人又杀僵尸的（抠鼻）[/spoiler]", "timestamp_created": 1507359840, "timestamp_updated": 1507359840, "voted_up": true, "votes_up": 0, "votes_funny": 3, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34090744": {"recommendationid": "34090744", "author": {"steamid": "76561197970634992", "num_games_owned": 312, "num_reviews": 9, "playtime_forever": 58, "playtime_last_two_weeks": 0, "last_played": 1502144202}, "language": "english", "review": "Bought for multiplayer,\n\nyet to find anyone online playing it.\n\nbuy a chess set instead!", "timestamp_created": 1502144252, "timestamp_updated": 1507142401, "voted_up": false, "votes_up": 2, "votes_funny": 3, "weighted_vote_score": "0.208797", "comment_count": "9", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34081764": {"recommendationid": "34081764", "author": {"steamid": "76561198152914485", "num_games_owned": 422, "num_reviews": 11, "playtime_forever": 147, "playtime_last_two_weeks": 0, "last_played": 1502117264}, "language": "schinese", "review": "游戏不错，要是和朋友一起联机耍就更好玩了，希望尽快加入中文。", "timestamp_created": 1502112467, "timestamp_updated": 1502280777, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.532967", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33953571": {"recommendationid": "33953571", "author": {"steamid": "76561198271868510", "num_games_owned": 44, "num_reviews": 4, "playtime_forever": 38, "playtime_last_two_weeks": 0, "last_played": 1501631877}, "language": "english", "review": "This game is very fun, and definitly worth a playthrough.", "timestamp_created": 1501608459, "timestamp_updated": 1501608459, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.476464", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "33747035": {"recommendationid": "33747035", "author": {"steamid": "76561198053204160", "num_games_owned": 160, "num_reviews": 24, "playtime_forever": 576, "playtime_last_two_weeks": 0, "last_played": 1501169611}, "language": "english", "review": "it's okay, i guess\n\nyeah\n\nmaybe\n\nsure", "timestamp_created": 1500825466, "timestamp_updated": 1500825760, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.372715", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33617705": {"recommendationid": "33617705", "author": {"steamid": "76561198065857063", "num_games_owned": 431, "num_reviews": 14, "playtime_forever": 106, "playtime_last_two_weeks": 0, "last_played": 1497908563}, "language": "english", "review": "The below review is taken from my original post at www.gamesfreezer.eu\n\nGeneshift is a top-down shooter video game made by Nik Nak Studios (Ben Johnson). \nThis is another case of a top quality game being released by one man and the fact that the game has such strong, rounded single player and multiplayer modes is a testament to his skill as a developer. \nGeneshift is a game that has taken eight years for Ben to complete and was definitely worth the wait.\n\nThe story in Geneshift focuses on a zombie outbreak which your character is trying to stop with the help of his fellow ‘Yellowjackets’, whereas the multiplayer aspect focuses on battles between the various factions in the game.\nGeneshift has been compared to the first GTA game but from my experience of playing it, it has more in common with a more tactical Alien Breed in that it’s not so much about open-world mayhem but instead it’s a more focused romp in a near-future setting. \nThe controls are quite complicated but this is to be expected due to the layers on offer, WASD controls your character and the mouse controls the aiming, it’s not quite a twin-stick shooter as distance is also important here, careful aiming is required as opposed to a bullet-hell massacre. Various keyboard shortcuts deal with your weapons, skills, upgrades etc.\n\n\nThe game is split into a ten-level campaign which can be completed either in single player or cooperatively up to four players (on-line only) each stage takes a good half-hour or so to get through so there is longevity here and along with the online leaderboards and other modes, replayability levels are also high. There is also a large online multiplayer community with a plethora of different modes. Although the game is only a few weeks old it has already amassed a healthy amount of players and I had no issues joining in online matches.\nGeneshift’s music has a ‘Perfect Dark / Goldeneye’ quality to it, in that it’s gently ominous and ambience-building without being intrusive. The sound effects in the game are satisfying, each gunshot carrying weight and the incidental sounds adding to the immersion.\nVisually, Geneshift is a very crisp game. Sometimes in top-down shooters the detail on items and characters can be lost but that’s not an issue here, the only moments of trouble I had were a couple of seconds where the view wasn’t resting in an ideal position for me to make my next move or plan a specific jump but on the whole, it’s a very smoothly animated environment with an intelligent in-game camera.\nYour fellow Yellowjackets follow you through the game, giving tips on how to progress and providing cannon fodder and covering fire, some of the dialogue is funny and occasionally fourth-wall breaking although this is very much a game about action, the story exists purely to move the game forwards.\n\nThe AI in the game is fair and the danger comes from mistakes the player makes as opposed to feeling cheated by the computer. Your allies don’t take as much health off the enemy as you do whilst shooting them so you can’t lazily hide behind a wall whilst they do all the work, you need to get involved, preferably with a gun the size of a Rover 800 and a wheelbarrow full of bullets.\nAs previously mentioned, I got an ‘Alien Breed’ vibe from Geneshift but also mixed with RPG elements, for instance the use of mana to cast spells such as healing yourself or to become temporarily invisible, unlocking of skill points and there are checkpoints scattered around the levels that allow you to buy more guns and equipment. This isn’t a game that you could just plough through guns blazing; tactics and forethought are definitely needed. The addition of a fully-fledged skill upgrade system really adds to the depth of Geneshift, some sections of the game are rendered much easier by having the right upgrade installed, (you will be using the force field A LOT.)\nWhilst items that you’ve unlocked carry across to the next stage for purchase, your money and equipped weapons reset after each stage so spend it all whilst you can. You never know when you’ll chew through your ammo during a sudden, intense shootout.\nThere are a couple of things that will hopefully be addressed in future updates, One thing I noticed is that every time you make a purchase in the store, it kicks you out back to the game so you have to press ‘b’ to re-enter the shop to buy other items, it’s a minor gripe but there were a few occasions when I desperately needed ammo to kill approaching enemies and it wasted precious seconds going in and out of the menu resulting in losing a lot of health. Another issue for me was that when I was using the self-healing and my health reached 100%, it didn’t stop burning through my mana, so some of it was wasted. It would make sense for the healing to stop when it reaches the maximum.\n\nYou can create some awesome set-pieces in Geneshift. One section of the game had me driving down a corridor mowing down the enemy before skidding to a halt and diving out of the car as it exploded (thanks to a horde of machine-gun toting enemies), I then hid behind the husk of the burning car and lobbed a grenade into the enemies to deliver the coup de grace. In another part of the game I crept into an enemy building, jumped into a car and ran over everyone like a frenzied Mad Max…before a boss entered, cornered me and utterly mowed me down in a barrage of gunfire.\nThere are some other great sections in the game that have you killing dozens of zombies in a single room and collecting their ‘souls’ to power a bomb to blow them all up in one fell swoop. These sections combined with the boss battles reminded me of Mean Arenas and Super Smash TV (this is a good thing) with the need for tactical strafing and ammo management a top priority.\nThe later levels really open up once you leave the complex and although there is a linearity to them, it’s a positive as it reduces aimless wandering and gives the game a focus, feeling like you can carve your own way around the expansive city maps without feeling lost.\nThe multiplayer aspect of the game is also a strong draw here, the servers are lively and bountiful and deathmatches takes the game to new heights, the money is more abundant than in the single player campaign and so you can ‘Arnie up’ much quicker and get involved with some serious firepower. The sheer amount of modes really does give Geneshift a heck of a replayability factor.\nThere’s a free demo for Geneshift available through Steam if you are on the fence about it or fancy a crack before you lay your money down, it contains some multiplayer maps and the first mission of the campaign.\n\nI’ve been having some conversations recently with regards to people lamenting the loss of ‘the golden age of gaming’ when individuals or small groups of people could complete a game at their own pace without the threat of a crunch, artistic integrity intact. Geneshift is the result of one man’s dedication to his artistic vision and it shows in how uniformly the game is put together, all aspects of Geneshift add up to a remarkably well-designed whole. To those people who think the ‘golden age’ of gaming has gone, I shove Geneshift into your mouth and tell you to jump on the awesome indie game bus, may it never stop rolling.", "timestamp_created": 1500330431, "timestamp_updated": 1500330431, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.519309", "comment_count": "3", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "33609017": {"recommendationid": "33609017", "author": {"steamid": "76561198303001980", "num_games_owned": 66, "num_reviews": 2, "playtime_forever": 4235, "playtime_last_two_weeks": 0, "last_played": 1504819197}, "language": "english", "review": "One of my favorite games currently!\n\nThis game has a great story and an overall awesome flow of action, highly reccomend if you like intense firefights and explosive scenes!", "timestamp_created": 1500301975, "timestamp_updated": 1500301975, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.540582", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33578323": {"recommendationid": "33578323", "author": {"steamid": "76561198044717842", "num_games_owned": 712, "num_reviews": 15, "playtime_forever": 1832, "playtime_last_two_weeks": 0, "last_played": 1499518907}, "language": "russian", "review": "Я очень большой фанат GTA 2, до сих пор иногда переигрываю и надеюсь, что когда-нибудь найдётся разработчик, который разовьёт имеющиеся там идеи. Поэтому когда я услышал про Geneshift, многими сравниваемую с одной из моих любимых игр, конечно взял даже не раздумывая. Но присмотреться всё-таки стоило. Во-первых, буквально ничего из того, что давала GTA здесь нет: локации тесные, наполненные только врагами, сюжет уровня научно-фантастического рассказа от четвероклассника но при этом на серьёзных щах, отталкивающее внешнее оформление без своего стиля, кривые геймплейные фичи (самое разочаровывающее, это стелс в стиле Колды: есть враги, к которым разработчики разрешили подкрадываться, а есть те, которые агрятся сразу) и бесконечная, однотипная нудятина — пройди по маленьким комнатушкам, прокатись по узким улицам, перебей толпу зомби в конце. Покупка оружия и транспорта на чекпоинтах тоже убивает всякую необходимость экономить патроны, думать, стоит ли взять вместо своего оружия трофейное. Бои с врагами также испорчены, не получилось сделать ни приятные размеренные позиционные перестрелки, ни какой-нибудь ураганный экшн — враги тупые, толстокожие и обременяются всякими суперсилами, про которые я подробно вообще говорить не хочу, настолько они унылые. Остаётся надеяться, что к релизу разработчики получше продумают игровой процесс, сюжет и стилистику игры. \n\nНесмотря на то, что многое в игре мне не понравилось, по словам разработчика, эти элементы также будут улучшаться. Так что есть неиллюзорная надежда, что при выходе из раннего доступа Geneshift станет гораздо круче.", "timestamp_created": 1500187659, "timestamp_updated": 1500495492, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.503759", "comment_count": "7", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33089121": {"recommendationid": "33089121", "author": {"steamid": "76561198359782425", "num_games_owned": 113, "num_reviews": 42, "playtime_forever": 148, "playtime_last_two_weeks": 0, "last_played": 1499005383}, "language": "schinese", "review": "建议有中文", "timestamp_created": 1498924240, "timestamp_updated": 1498924240, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.518017", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32996755": {"recommendationid": "32996755", "author": {"steamid": "76561198158918871", "num_games_owned": 29, "num_reviews": 6, "playtime_forever": 2989, "playtime_last_two_weeks": 25, "last_played": 1516305746}, "language": "english", "review": "Being an old player of the game i highly recommend it , if you are a Classic Player this game is for you ;)", "timestamp_created": 1498751223, "timestamp_updated": 1498751223, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.571697", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32875666": {"recommendationid": "32875666", "author": {"steamid": "76561197993996277", "num_games_owned": 235, "num_reviews": 5, "playtime_forever": 577, "playtime_last_two_weeks": 0, "last_played": 1503015815}, "language": "english", "review": "noice!", "timestamp_created": 1498588977, "timestamp_updated": 1498588977, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.346714", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32846555": {"recommendationid": "32846555", "author": {"steamid": "76561198041154065", "num_games_owned": 125, "num_reviews": 2, "playtime_forever": 441, "playtime_last_two_weeks": 0, "last_played": 1498833674}, "language": "english", "review": "awesome game", "timestamp_created": 1498551562, "timestamp_updated": 1498551562, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.453499", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32665267": {"recommendationid": "32665267", "author": {"steamid": "76561198107412985", "num_games_owned": 1372, "num_reviews": 48, "playtime_forever": 2479, "playtime_last_two_weeks": 0, "last_played": 1507424299}, "language": "schinese", "review": "[b]利益相关声明：本人是作者的好基♂友，商店页面的中文翻译[spoiler]和将来可能的游戏汉化[/spoiler]由本人捉刀。以下评测，均为明显的PY交♂易产物，请注意分辨，谨慎剁手，谢谢。[/b]\n\n\n[h1][独立游戏开发者：不忘初心 工匠精神][/h1]\n作者是位澳洲小哥，本游戏是他历时8年，反复打磨，精益求精的作品。当前版本在过往8年里，被全世界玩家各种狂玩，已经高度可玩、高度平衡、几无bug，而且还在反复快速迭代开发、不断追加新功能中。[b][i]尤其良心的是，游戏最精华的多人模式完全免费，并没有国内同行常见的氪金套路或是任何的功能限制。[/i][/b]付费版的国区价格也并不高，而且由于仍在EA阶段的缘故，可以享受更优惠的价格和第一时间的游戏更新推送。\n\n\n[h1][游戏试玩体验：免费联机 乐趣无穷][/h1]\n作为主推联机向的本游戏，其游戏背景和剧情老实讲并不算特别惊艳，流畅的联机体验才是王道啊：末世之后，主动成为变种人，给自身加上各种buff，装备各种脑洞大开的武器、防具和载具，或与朋友合作闯关，或把他人轰杀至渣渣，可各种暴力肛♂正面，亦可各种流氓招数阴人，其间的乐趣…哎呀，观赏过再多的爱情动作片，也不如亲身体验一♂发来得爽对不对？所以，先下载试玩版爽一波喽？又不会怀孕…\n\n\n[h1][幕后花絮：人生赢家 重度虐狗][/h1]\n[b][前方高能预警]重度虐狗提示！单身人士可能即将受到一万点暴击！[/b]\n\n[quote=量子大蛇]好气啊，为什么要一群单身狗掏钱支援人生赢家去泡妞啊[/quote]\n\n[list]\n[*]澳洲小哥大学毕业后，就一直在独立开发本游戏。\n[*]他凭借一笔小小的积蓄、一张信用卡、一份坚定的信心，周游世界，同时不间断地开发本游戏。\n[*]最终，在逗留南美小国秘鲁期间，收获了一位荷兰萌妹的真爱，两人幸福地在一起，继续开发本游戏，[spoiler]以及许多不可描述的细节。[/spoiler]\n[*]此刻，澳洲小哥已经回到悉尼，荷兰萌妹也经由欧洲、辗转来到了澳洲小哥身边，两人继续他们[strike]幸福的[/strike][spoiler]没羞没臊的虐狗[/spoiler]生活，游戏的正式版也快问世啦！\n[/list]\n\n澳洲小哥的梦想，是开发完本游戏，攒钱来中国旅游，看古迹，坐高铁；\n荷兰萌妹的梦想，是宣传和支持本游戏，一并来中国旅游，抱熊猫，吃美食。\n澳洲小哥的传奇故事[spoiler]以及金发长腿荷兰萌妹真人靓照[/spoiler]，详情可阅读专栏文章，由游研社 夜语 大大执笔：[url=zhuanlan.zhihu.com/p/27323295]《这位程序员花两万元一边环游世界一边做游戏，顺便还找了个女朋友》[/url]。", "timestamp_created": 1498193606, "timestamp_updated": 1498193928, "voted_up": true, "votes_up": 23, "votes_funny": 3, "weighted_vote_score": "0.747331", "comment_count": "12", "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "32624805": {"recommendationid": "32624805", "author": {"steamid": "76561198139882434", "num_games_owned": 23, "num_reviews": 1, "playtime_forever": 822, "playtime_last_two_weeks": 0, "last_played": 1506379950}, "language": "english", "review": "The tits!", "timestamp_created": 1498071314, "timestamp_updated": 1498071314, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.339000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32535533": {"recommendationid": "32535533", "author": {"steamid": "76561197970329288", "num_games_owned": 1762, "num_reviews": 968, "playtime_forever": 45, "playtime_last_two_weeks": 0, "last_played": 1497787533}, "language": "english", "review": "GTX 1060 gameplay:\nhttps://www.youtube.com/watch?v=oXTnQGSJmGM\n\nMy Thoughts:\nThis cool top down shooter feels like a modern mixture of Alien Breed and Gauntlet. The game offers plenty of cool power-ups, weapons and features fast, frantic and bloody gameplay, with a bit of stealth thrown in for good measure.\n\nGame Details:\nGeneshift is a top-down shooter bursting with brutal gunplay and insane vehicle action. Unlock mutant skills and outplay friends in tactical online combat. Then go invisible, explode car bombs and complete stealth missions in the online co-op campaign.", "timestamp_created": 1497788182, "timestamp_updated": 1497976191, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.438922", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "32399291": {"recommendationid": "32399291", "author": {"steamid": "76561198062609598", "num_games_owned": 2049, "num_reviews": 64, "playtime_forever": 1633, "playtime_last_two_weeks": 0, "last_played": 1506399158}, "language": "english", "review": "This game is amazing.  I'm only about an hour in and I love it.   I will update this review when I put more time in.", "timestamp_created": 1497393181, "timestamp_updated": 1497393181, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "32380469": {"recommendationid": "32380469", "author": {"steamid": "76561198134693698", "num_games_owned": 85, "num_reviews": 10, "playtime_forever": 1112, "playtime_last_two_weeks": 13, "last_played": 1515651660}, "language": "english", "review": "Noice\n\n\n...all i gotta say", "timestamp_created": 1497327402, "timestamp_updated": 1497327402, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.375541", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32345435": {"recommendationid": "32345435", "author": {"steamid": "76561198124133410", "num_games_owned": 41, "num_reviews": 6, "playtime_forever": 142, "playtime_last_two_weeks": 0, "last_played": 1504149263}, "language": "english", "review": "Great! And please add character customizations for more action! and Thanks.", "timestamp_created": 1497195164, "timestamp_updated": 1497195164, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "32181601": {"recommendationid": "32181601", "author": {"steamid": "76561198084635692", "num_games_owned": 1180, "num_reviews": 173, "playtime_forever": 350, "playtime_last_two_weeks": 0, "last_played": 1496502748}, "language": "russian", "review": "[code][h1]Полноценный обзор со скриншотами вы можете прочитать здесь: [url=https://doggamingsite.wordpress.com/2017/06/04/geneshift/] Dreams of Genesis Gaming: Geneshift[/url][/h1][/code]\n\nGeneshift - многопользовательский зубодробительный экшен. Если верить обзорам людей, то игра уже довольно продолжительное время бороздит браузерное пространство (самолично не проверял). Разработчиками данного проекта занимаются Nik Nak Studios.\n\n[h1][i]ПОЗИЦИОНИРОВАНИЕ И СЮЖЕТ[/i][/h1]\nИгра позиционирует себя как кооперативный / мультиплеерный экшен. Изначально игра представлялась как некая копия COD или CS:GO, но с видом сверху. Очень смелое и довольно интересное решение было принято разработчиками этого проекта. На самом деле мне удалось поиграть лишь в командный ДЕЗМАТЧ, так что не знаю есть ли еще режимы (уж простите ребята, но я действительно не мог попасть на другие сервера). И вот представьте что вы допилили мультиплеер до практически идеального состояния... Чем же еще удивить современного игрока? Конечно же компанией. И вот этого я действительно не ожидал. Только представьте, что у подобной игры присутствует сюжет. Да, он слегка стандартный и до жути линейный, но сам факт! Итак, нам выпадает честь влезть в шкуру бравого вояки, который защищает честь своей родины! Приказы выдает некий командор... и они довольно странные. Уничтожение вражеского войска, это один из нормальных приказов, а теперь представьте, что еще придется отбиваться от толпы зомби. ВНИМАНИЕ СПОЙЛЕРЫ!!! Ну и как водится в стандартных Голливудских боевиках, главный командор нас придает и заявляет нечто подобное: \"Теперь я властелин мира и на револьвере я вертел нашу страну!\". После начинается довольно не хилая по накалу драка с главным боссом игры. По окончании он говорит нечто подобное: \"Люк, я твой СВИНЕЦ... ой... не то. Доверши дело, начатое мной, уничтожь мир и покори власть над нежитью\". Такое ощущение что я смотрю второсортный боевичек 90-х годов.\n\n[h1][i]ГЕЙМПЛЕЙ[/i][/h1]\nДвоякое впечатление по себе оставил геймплей. С одной стороны он довольно насыщен. Повсюду стрельба, есть возможность использовать машины для быстрого передвижения и давления противников. На самом деле арсенал оружия довольно большой. Здесь вам и пулемет, узи, дробовик, бесшумный пистолет, ракетница, коктейль молотова, калашник и многое другое. Способы убийства врагов также очень много, можно зарубить с ножа, расстрелять с пулемета, снять со снайперки, выстрелить со спины с дробовика, или воспользоваться одной из скиллов. Да, у каждого игрока есть активные скиллы, которые можно применять несколько раз на раунд (они просят ману, которую также можно поднимать по карте в виде синих шариков). Эти способности очень разнообразны, тут вам щит, лечение, лезвия, ядовитый выстрел, телепортация и многое другое. На самом деле возможностей довольно много и вариации их применения просто потрясают. Ну а теперь хотелось бы задать вопрос. А вытягивает ли все разнообразия оружия и способностей до невозможности скучный и однообразный геймплей? Мой ответ: \"Больше нет, чем да\". \n\n[h1][i]ГРАФИКА И ЗВУКИ[/i][/h1]\nГрафическая составляющая - это именно то, за что можно дать жирнейший плюсик разработчикам. Да, пиксель. Да, вид сверху. Да, кажется слегка простоватой. Но в сочетании всех мелких \"плюшек\" в виде разлетающихся голов противника, взрывов гранат, размазывание врагов по асфальту машиной, огромное разнообразие оружия, зомби сурвайвор мод с контролем точки - это все выглядит довольно красиво и радует глаз игрока. Мне очень понравилась постановка боев и расстановка зданий и укрытий. Хорошую детализацию можно заметить на постройках, машинах и полностью окружающей среде. Слегка разочаровывает прорисовка всех персонажей, они уж сильно однообразны, даже если учесть тот факт, что вид сверху. Отдельную похвалу можно дать за прорисовку каждого умения. Звуковое сопровождение в целом не уступает графической составляющей и в мультиплеерной части даже дополняет атмосферу. НО!!! Опять же - компания. Я не устану повторять, что ее нужно было сделать либо иной, либо вообще не делать его, ведь в принципе мультиплеерной части более чем хватает. В целом во время прохождения компании я выключал музыку полностью, потому что меня уже начинало все напрягать и до неприличия отбитый сюжет и даже оригинальный саундтрек. В целом мне игра понравилась, и я представляю как будет бомбить у любителей этой игры.\n\n[h1][i]ПЛЮСЫ И МИНУСЫ[/i][/h1]\nПлюсы:\n+ Хороший геймплей в мультиплеерной части\n+ Атмосфера Рембо и Джона Мэтрикса передана в полной степени\n+ Большой арсенал оружия и сверхвозможностей\n+ Возможность управления транспортом\n+ Довольно престижная графическая и звуковая составляющая\n\nМинусы:\n- Отвратительная сюжетная линия\n- Атмосфера полностью загублена в сюжетке\n- Скучные диалоги, которые можно предугадать с 90% вероятностью\n\nGeneshift - в целом мне игра понравилась. Это довольно живенький, я даже сказал бы зубодробительный экшен, но разработчики уделили довольно мало времени сюжету. Только из-за понравившегося мультиплеера ставлю игре 7 из 10.\n\n[b][i][url=http://store.steampowered.com/curator/11769719/]Больше обзоров в нашей кураторской группе: Dreams of Genesis [/url]", "timestamp_created": 1496598669, "timestamp_updated": 1496600907, "voted_up": true, "votes_up": 25, "votes_funny": 1, "weighted_vote_score": "0.646086", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "32114405": {"recommendationid": "32114405", "author": {"steamid": "76561198004550992", "num_games_owned": 693, "num_reviews": 13, "playtime_forever": 1297, "playtime_last_two_weeks": 0, "last_played": 1501142647}, "language": "english", "review": "The most fun multiplayer top-down shooter experience I've ever had. Quite a lot of fun. No need to take my word for it, try out the demo that has a fully functioning multiplayer gamemode (the core part of the game) and the first mission of the campaign.", "timestamp_created": 1496347127, "timestamp_updated": 1496347127, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "32080547": {"recommendationid": "32080547", "author": {"steamid": "76561198055433022", "num_games_owned": 28, "num_reviews": 1, "playtime_forever": 127, "playtime_last_two_weeks": 0, "last_played": 1496070261}, "language": "english", "review": "This is a great game. Imagine a combination of Counter-Strike, Diablo 3 and top-down GTA. Cars, guns, abilities, single player campaign, multi-player, co-op, there is a lot of depth to it, especially so for an indie! Well-worth the $10!", "timestamp_created": 1496218900, "timestamp_updated": 1496218900, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32075525": {"recommendationid": "32075525", "author": {"steamid": "76561198067608206", "num_games_owned": 3058, "num_reviews": 130, "playtime_forever": 218, "playtime_last_two_weeks": 0, "last_played": 1496110213}, "language": "brazilian", "review": "http://steamcommunity.com/sharedfiles/filedetails/?id=936421138\n\nGeneshift é uma pérola baseada nos GTAs clássicos, que ainda possuíam visão de cima, mas já contavam com um combate de armas de fogo intenso e uso livre de veículos.\n\nAlém da experiência de violência clássica, o jogo oferece novos recursos, como sistema de habilidades ativas e passivas e diversos modos de jogo.\n\nA campanha permite cooperação online ou em LAN para até 4 jogadores, mas existem também outros modos multijogador variados.\n\nParticularmente, achei a campanha meio massante e limitada pelo estilo das fases. Como o jogo está em acesso antecipado, certamente é algo que pode melhorar muito!\n\nJá o mata-mata multiplayer é muito rápido e divertido, e pode valer bem a pena ser curtido desde já!", "timestamp_created": 1496194341, "timestamp_updated": 1496194341, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.613774", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "32060955": {"recommendationid": "32060955", "author": {"steamid": "76561198009770395", "num_games_owned": 294, "num_reviews": 35, "playtime_forever": 23, "playtime_last_two_weeks": 0, "last_played": 1496144314}, "language": "english", "review": "One of the best top down shooters I've played yet !", "timestamp_created": 1496144354, "timestamp_updated": 1496144354, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.503226", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32052144": {"recommendationid": "32052144", "author": {"steamid": "76561198142668490", "num_games_owned": 153, "num_reviews": 11, "playtime_forever": 79, "playtime_last_two_weeks": 0, "last_played": 1496462920}, "language": "english", "review": "I haven't played this game very much but I like it quite a bit already. The multiplayer gets pretty intesnse with a lot of pretty cool weapons. Where yo point your cursor also plays a role in aiming,  so if you're trying to shoot a guy on top of a building you can't just point at the groung in front of it. The driving is pretty smooth. The mutant abilities are really useful, withouth them this game would be like Hotline Miami. The campaign is fun, it has a sense of humor and it's a good way to figure out how to play the game. If you don't want to learn the game through a campaign there's newbie servers that do a great job with explaining the game too.", "timestamp_created": 1496100873, "timestamp_updated": 1496101047, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32050846": {"recommendationid": "32050846", "author": {"steamid": "76561198095580448", "num_games_owned": 157, "num_reviews": 9, "playtime_forever": 8, "playtime_last_two_weeks": 0, "last_played": 1496095390}, "language": "english", "review": "If you like the Grand Theft Auto series, then get this game because it's basically overhead GTA!  I heard about it on /r/PCMasterRace and I figured I would give it a try and it's worth it! :)", "timestamp_created": 1496095478, "timestamp_updated": 1496095665, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502653", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32050786": {"recommendationid": "32050786", "author": {"steamid": "76561198066095464", "num_games_owned": 185, "num_reviews": 3, "playtime_forever": 29, "playtime_last_two_weeks": 0, "last_played": 1496095274}, "language": "english", "review": "Really cool game!", "timestamp_created": 1496095316, "timestamp_updated": 1496095316, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502841", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32042450": {"recommendationid": "32042450", "author": {"steamid": "76561197971397487", "num_games_owned": 759, "num_reviews": 46, "playtime_forever": 96, "playtime_last_two_weeks": 0, "last_played": 1496071918}, "language": "english", "review": "So I haven't played too much yet as the multiplayer runs off of direct connections (understandably!) for the campaign, and my buddy and I want to coop the campaign. However, I did solo the first level and my impressions are that this is a very smooth and competently put together game. A good bit of time was put into it to make it run well and run predictably. I enjoy the gunplay, and the humor that is in the game. I was on a normal difficulty and I did die a couple of times, which bodes well for the game. Furthermore, the price is appropriate for what it is doing.\n\nOverall, recommended!", "timestamp_created": 1496067786, "timestamp_updated": 1496067786, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.565217", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32037586": {"recommendationid": "32037586", "author": {"steamid": "76561198152760885", "num_games_owned": 5154, "num_reviews": 343, "playtime_forever": 296, "playtime_last_two_weeks": 0, "last_played": 1496043413}, "language": "english", "review": "[h1]Introduction[/h1]\nUntil yesterday, I knew nothing of Geneshift. I read an article online about the developer’s odyssey-like experience while working on their first and so far only Steam project. It was all the information I needed, before making the decision to contact them asking for a press copy. Nik Nak Studios is precisely the type of indie dev I like supporting through my writings. Creative and determined folks who manage to share their gaming vision with their potential players and customers, despite time or budgetary constraints. Can’t deny their ambitious debut, a review and they were kind enough to indulge me.\n\n[h1]Story [/h1]\nFor a title that’s been eight years in the making and still launches on Steam in Early Access form, I believe this speaks greatly about Nik Nak Studios’ commitement to deliver a game that gets shaped in equal measure by its player base as well. Geneshift’s story or campaign mode, is currently featuring 10 fairly diversified levels of decent length and complexity. Sure, there could have been more and perhaps this number may grow in time. The plotline is straightforward: two groups fight for control over both territory and a biological weapon capable of turning humans into horrific mutants.\n\nI saw folks comparing Geneshift to the first titles from the GTA series (and predominantly, GTA 2), yet just by focusing on the story, it reminds me more about Resident Evil. And you kinda help out the “Umbrella Corporation” in this game. They’re the good guys, right? Well you (and up to 3 more friends in co-op) are part of the security detail to the Scientist faction, represented in-game by the yellow color. Your opponents from the Rebel faction, are donning purple and their main objective is stopping the Scientists (and you) from conducting any further research, while also unleashing waves upon waves of already transformed test subjects for an ultimate goal that has eluded me so far.\n\nYou’ll be too busy shooting at most things that move, to actually care what some scientists wish to do with their experiments gone wrong. You’re a nameless (and faceless) bodyguard who must survive this ordeal while being assisted by a vast arsenal of firearms and powers. And you’ll need all the help you can get, since the friendly AI cannot really provide more than target practice for the Rebels. I strongly suggest you play the game in co-op with your friends or with strangers on some of Geneshift’s public servers. No matter how much I prefer singleplayer mode in general, I have to admit that some titles are best experienced when you’re cooperating with another human mind.\n\n[h1]Graphics[/h1]\nI honestly thought this might be another Unity-powered game but it’s apparently not. Geneshift is running on a custom engine and it looks great. From shadows, lighting, misc effects and textures, it’s all carefully placed and tested. Being stuck in development for so many years, seems to have been beneficial in this case at least. Fully 3D environments which were also spared from any frame rate instability. Took 55 screenshots so far and running Geneshift in 4K resolution has been met by no performance issues at all.\n\n[h1]Audio[/h1]\nThe truly underwhelming part in an otherwise great title, is the lack of diversified sounds or a convincing soundtrack. And obviously no voice acting either, despite dialogue between certain NPCs. The songs playing in the background became stale long before I finished the 10 official levels within Geneshift but perhaps the dev team can add some well deserved variety even for the audio department. Looks need to be complemented by sounds too, in the case of quality video games.\n\n[h1]Gameplay[/h1]\nThe gameplay is naturaly the main feature and saving grace for Geneshift. It took many years to reach this not yet final stage and I can imagine that the game had its fair share of trial & error. From what I have played so far, in co-op with a friend, I declare myself more than pleased by the mix of action and strategy. The shooting mechanics and sheer weapon diversity are among the best I’ve ever played in a top-down shooter on Steam or elsewhere. Couple that with a rich selection of power-ups and vehicular combat, in order to form a clear picture and understand why many gamers compare Geneshift to GTA 2.\n\nApart from the main goals such as clearing an area of enemies or setting up a bomb detonation, you have secondary objectives that are not mandatory yet they yield both experience and in-game currency through which players may gain access to far better equipment. No enemy type seems overpowered but by playing in singleplayer campaign mode, I can imagine that it’s fairly difficult since the Artificial Intelligence seems developed only on the enemy Rebel side. With the presence of so many vehicle choices across the maps, I’d certainly like to see them used more often and not just by human players. So far, they’re mostly used to shield you from enemy fire (until the cars explode, of course). Full-on vehicular combat seems like a missed opportunity, in my opinion.\n\nOnce you’ve completed the Standard Campaign you can reattempt it in Hardcore mode and only after you’ve seen that through, you can try beating the game again on the final, Insane difficulty. Quite a bit of grinding over there, just for unlocking more Achievements while playing on the same 10 official maps. Luckly, you can always try out the levels made by enthusiast players. I do believe that once Geneshift gains more notoriety, there won’t be a shortage of custom levels to enjoy. It’s mostly just a matter of time and I think that by labeling the game as Early Access, customers won’t be disappointed by the current lack of more stages.\n\n[h1]Verdict[/h1]\nFor all the content it currently holds and the large potential for more, I’d say that Geneshift is fully worth its price tag. The gameplay even as it stands now, sets it apart from most of its genre competitors on Steam. That’s no easy feat, considering the rookie developer. And that’s more of an euphemism since Geneshift had all the time in the world, to reach its current state. Some games really benefit from the trip to “Development Hell”, provided they return determined to prove their detractors wrong.\n\n[h1]Strong Points[/h1]\n+ Beautiful graphics.\n+ Plenty of customization options.\n+ Level editor ensures replay potential.\n+ Steam Trading Cards & Achievements.\n\n[h1]Weak Points[/h1]\n- Few official levels in the current Early Access stage.\n- Limited sound selection.\n\n[b]Rating 85/100 [/b]\n \n[quote]This review was submitted for [url=http://steamcommunity.com/groups/ImperialReviews]Imperial Reviews[/url] through the generous contribution of the game’s developer.[/quote]", "timestamp_created": 1496047051, "timestamp_updated": 1496130922, "voted_up": true, "votes_up": 51, "votes_funny": 3, "weighted_vote_score": "0.768461", "comment_count": "2", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "32037125": {"recommendationid": "32037125", "author": {"steamid": "76561198038959398", "num_games_owned": 1243, "num_reviews": 35, "playtime_forever": 414, "playtime_last_two_weeks": 0, "last_played": 1513619866}, "language": "english", "review": "It may have took the developer many years to complete it, but he did it and the result is the best you could get.\nWell designed levels, good control, nice graphics, smooth, simple yet interesting and fun gameplay with a small touch of complicated, Geneshift is that game that keeps you playing on and on, it just doesn't get you bored. First thing I did was to dive into multiplayer mode and play with a friend and I must say I was pleased and realised this game was meant to be played with your friends.", "timestamp_created": 1496044494, "timestamp_updated": 1496044494, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "32012146": {"recommendationid": "32012146", "author": {"steamid": "76561198001653893", "num_games_owned": 488, "num_reviews": 4, "playtime_forever": 88, "playtime_last_two_weeks": 0, "last_played": 1496370930}, "language": "english", "review": "There's not much of a playerbase but its a cool, small community of people that enjoy the game and want to work with the developer on improving it.\n\nThe gameplay itself is a lot of fun. Top-down shooter with some great combat mechanics. Even if I won't play the game much, I'm glad I bought it to support the developer.", "timestamp_created": 1495949056, "timestamp_updated": 1495949056, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.476052", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32009176": {"recommendationid": "32009176", "author": {"steamid": "76561198121511358", "num_games_owned": 11, "num_reviews": 1, "playtime_forever": 28, "playtime_last_two_weeks": 0, "last_played": 1495934119}, "language": "english", "review": "I read a little AMA on /r/PCMR about a game that took a long time to make while the programmer coded portions of it in Peru in hostels.  I have not played much yet, but it is a great title so far.  I like the style and what looks like the heart that has gone into it.", "timestamp_created": 1495934929, "timestamp_updated": 1495934929, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.595184", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31993828": {"recommendationid": "31993828", "author": {"steamid": "76561198098578597", "num_games_owned": 317, "num_reviews": 7, "playtime_forever": 180, "playtime_last_two_weeks": 0, "last_played": 1495881273}, "language": "english", "review": "Pros:\n- Smooth Gameplay\n- Easy to learn\n- Easy control\n- Good character movement\n- Good bullet physics\n- Fun, Easy to follow story line\n- Vehicle movement is smooth\n- Runs well (60+FPS Always)\n- Fun Multiplayer and Coop\n- Well Thought out, good level design\n- Decent graphics\n- Very 3D feel for a top down\n- Several difficulties\n\nCons\n- AI can be a bit dumb at times\n- Music can get a bit repetitive\n- Dialogue can be easily missed, However pressing Enter shows that was said\n\n\nGeneshift is a great way to spend a few hours having fun. Time flies when you play this game and you feel as though you become part of the story. The multiplayer, although sparsely populated, is fun and the coop is great! Not to mention that you get to drive cars like a maniac!\n\nI would highly recommend this game to anyone who is looking for a fun, 3D indie game and even if top down games aren't your thing i would still give this a purchase. I personally am not a fan of top down games but after playing this i have to say it beats most others in the category and i do genuinely enjoy the gameplay.", "timestamp_created": 1495882093, "timestamp_updated": 1495882093, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "31991457": {"recommendationid": "31991457", "author": {"steamid": "76561198062461355", "num_games_owned": 103, "num_reviews": 2, "playtime_forever": 187, "playtime_last_two_weeks": 0, "last_played": 1495804594}, "language": "english", "review": "Had a great night playing this with a bunch of mates. Definitely bringing my other friends into another weekend session some time. Fast paced gameplay, diverse gun selection/playstyles/skill builds.", "timestamp_created": 1495873699, "timestamp_updated": 1495873699, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31990218": {"recommendationid": "31990218", "author": {"steamid": "76561198097453075", "num_games_owned": 67, "num_reviews": 1, "playtime_forever": 224, "playtime_last_two_weeks": 0, "last_played": 1495804819}, "language": "english", "review": "Very compelling multiplayer, great for maps with lots of players. Versitile game play with differnt builds and item options", "timestamp_created": 1495868889, "timestamp_updated": 1495868889, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31990210": {"recommendationid": "31990210", "author": {"steamid": "76561198096590334", "num_games_owned": 67, "num_reviews": 1, "playtime_forever": 443, "playtime_last_two_weeks": 0, "last_played": 1495804553}, "language": "english", "review": "I love this game, I know a lot of people are comparing this to GTA 2 or Counter Strike however there is enough new ideas in this game to call it unique. 4-5 houir story campaign plus multiple multiplayer modes.\n\nWould definitely recommended.", "timestamp_created": 1495868861, "timestamp_updated": 1495868861, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31990161": {"recommendationid": "31990161", "author": {"steamid": "76561197961767732", "num_games_owned": 79, "num_reviews": 1, "playtime_forever": 130, "playtime_last_two_weeks": 0, "last_played": 1495799396}, "language": "english", "review": "This game is awesome! So awesome it makes me want to touch myself!", "timestamp_created": 1495868617, "timestamp_updated": 1495868617, "voted_up": true, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.464646", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31990089": {"recommendationid": "31990089", "author": {"steamid": "76561197966309301", "num_games_owned": 122, "num_reviews": 1, "playtime_forever": 213, "playtime_last_two_weeks": 0, "last_played": 1495876429}, "language": "english", "review": "Loved the game - Had a LAN party with about 20 of my good friends - We essentially played for about 3 hours non stop (Last night). \n\nCouldn't recommend a more \"SMASH BROTHERS\" for the PC type of game, where you **** each other up! -  There's a whole campaign apparently too. Mental. \n\nCould use some improvements - like perhaps a \"Crouch\" perspective view gives you a better sight ability. Also the UI/UX could use some polishing. \n\nOther than that though, hell of a lot of fun!!! Highly bloody recommend.", "timestamp_created": 1495868330, "timestamp_updated": 1495868330, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31982579": {"recommendationid": "31982579", "author": {"steamid": "76561197966446818", "num_games_owned": 1111, "num_reviews": 56, "playtime_forever": 404, "playtime_last_two_weeks": 0, "last_played": 1497357252}, "language": "english", "review": "I'll be honest, after reading the reviews, I thought \"Sure, why not, it's $7\" and when I first started I had a thought that I wouldn't like it.  Well after playing 3 hours straight I realized that I really enjoy this game.  I actually found myself wanting to come back and play. \n\nThere are enough mechanics to keep it interesting and varied.  The multiplayer seems to go in waves, sometimes it's full of people and other times it's dead...and it depends on the time of day from what I noticed.  \n\nThis will be the first weekend coming up for it, so I hope a lot of people jump on - I will.\n\nIt's got the driving mechanics of old school GTA or 'Zombie Driver HD' + twin stick shooterness of 'Running w/ Rifles'.", "timestamp_created": 1495834270, "timestamp_updated": 1495834270, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31973833": {"recommendationid": "31973833", "author": {"steamid": "76561198084221355", "num_games_owned": 1187, "num_reviews": 4, "playtime_forever": 350, "playtime_last_two_weeks": 0, "last_played": 1495806877}, "language": "english", "review": "Awesome!!! fun multiplayer match tonight and I lost track of time in the single player.\n", "timestamp_created": 1495807169, "timestamp_updated": 1495807169, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31959276": {"recommendationid": "31959276", "author": {"steamid": "76561197961578185", "num_games_owned": 189, "num_reviews": 3, "playtime_forever": 73, "playtime_last_two_weeks": 0, "last_played": 1495879988}, "language": "english", "review": "Was very impressed with the honesty of the developer and his community outreach on Reddit and Discord, which not many people are doing these days except indies (go indie scene!)\nThis is one of the best early access games i've played in the last 4 years, is well polished, fun and tough to play and immensely rewarding.\nLove the nostalgia, love the storyline and I can't wait to sink my teeth into multiplayer!", "timestamp_created": 1495744417, "timestamp_updated": 1495744417, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31955541": {"recommendationid": "31955541", "author": {"steamid": "76561197992607982", "num_games_owned": 177, "num_reviews": 3, "playtime_forever": 2557, "playtime_last_two_weeks": 0, "last_played": 1505697838}, "language": "english", "review": "Starts off seeming like a pretty ordinary top-down shooter.\nBut then you get to skills, which adds another layer of interconnected mechanics to the game.\nAnd Then you get to chemicals, which are another layer of mechanics and mindgames on top of that.\n\nBut you can just ignore all of that and run around shooting people in the face with a shotgun and do perfectly fine.\n\nOh right can't forget the cars, always a laugh to speed around the map and flatten some poor sap.", "timestamp_created": 1495731525, "timestamp_updated": 1495731525, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.470085", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31951572": {"recommendationid": "31951572", "author": {"steamid": "76561198045099985", "num_games_owned": 857, "num_reviews": 3, "playtime_forever": 87, "playtime_last_two_weeks": 0, "last_played": 1502837448}, "language": "english", "review": "Amazing if I had to use one word. Will be telling my friends list and other people. Its fine by me but some might have trouble with all the keys you need to learn.  I highly recomend this game.", "timestamp_created": 1495718771, "timestamp_updated": 1495718771, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.487105", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31949782": {"recommendationid": "31949782", "author": {"steamid": "76561198052337670", "num_games_owned": 95, "num_reviews": 1, "playtime_forever": 64, "playtime_last_two_weeks": 0, "last_played": 1495998265}, "language": "english", "review": "Hands down the best top down shooter.", "timestamp_created": 1495711102, "timestamp_updated": 1495711102, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.434736", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31948373": {"recommendationid": "31948373", "author": {"steamid": "76561198016096893", "num_games_owned": 7020, "num_reviews": 1097, "playtime_forever": 177, "playtime_last_two_weeks": 0, "last_played": 1495632428}, "language": "russian", "review": "Данная игра явилась для меня открытием и я был очень удивлен, что она уже 8 лет в разработке. Обычно за такое время игра очень сильно устаревает, но такая модель игры, выполненная под ретро не устареет никогда. В невероятно маленьком размере дистрибутива игры скрты невероятные возможности. Графика очень и очень приличная: трехмерное изображение ландшафтов выглядит впечатляюще. Есть схожесть с играми Hotline Miami, но тут интереснее управление, а про разнообразие отдельый разговор. \n\nИгра представляет собой шутер с видом сверху от третьего лица. Куча взрывов, кровавых убийств, в том числе и в ближнем бою, перемещение на транспорте - все это выполнено на высоком уровне. Отличие от других похожих игр в невероятном разнообразии возможностей: огромный выбор оружия, скилы, которые улучшаются с уровнем и много всяких наворотов. Так же огромным плюсом является возможность игры по сети: как прохождение в кооперативе, так и соревновательные режимы.\n\nРазработчик пишет, что игра планирует быть в раннем доступе еще около двух лет, и что еще много будет чего добавлено, хотя чего там только нет. Если вам понравится стилистика игры, то скучать вам точно не придется, всегда можно найти чем там заняться. Огромным сюрпризом стало наличие русского языка.\n\nЕще вы можете посмотреть обзоры на другие игры:\nhttp://store.steampowered.com/curator/25737869/\nТак же подписывайтесь на нашу группу с халявными раздачами:\nhttps://steamcommunity.com/groups/freeekeys", "timestamp_created": 1495704254, "timestamp_updated": 1495704254, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.303769", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "31948057": {"recommendationid": "31948057", "author": {"steamid": "76561198108416722", "num_games_owned": 36, "num_reviews": 1, "playtime_forever": 190, "playtime_last_two_weeks": 0, "last_played": 1514960239}, "language": "english", "review": "Enjoyed driving a lot, the grenade mechanics are interesting and useful. The community are friendly and polite, really like it.", "timestamp_created": 1495702470, "timestamp_updated": 1495702470, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.460199", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31948012": {"recommendationid": "31948012", "author": {"steamid": "76561198255826538", "num_games_owned": 5217, "num_reviews": 499, "playtime_forever": 149, "playtime_last_two_weeks": 0, "last_played": 1495661652}, "language": "russian", "review": "Большинство подобных игр даже если красивые достаточно скучны. Геймплей настолько наполнен различными мелочами, которые не могут не удивлять. Появилось огромное желание основательно опробовать мультиплеер, но чтобы разобраться во всем нужно пройти компанию. В игре ного союзников, можно проходить игру вместе с друьями. Возможности прокачки персонажа не уступает хорошим мморпг. Все нарисовано в красивых тонах, и подбор цветов мне лично очень по душе. Понравилась система комбо, возможность убивать врагов впритык и с возвышенности и много что еще. К минусам можно отнести достаточно лительную загрузку, во время нее идет опись загруженных элементов, хотя это не сильно критично.", "timestamp_created": 1495702275, "timestamp_updated": 1495702275, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.385265", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "31947468": {"recommendationid": "31947468", "author": {"steamid": "76561197974770053", "num_games_owned": 474, "num_reviews": 34, "playtime_forever": 531, "playtime_last_two_weeks": 0, "last_played": 1497767572}, "language": "english", "review": "This game is fantastic. There are a lot of great ideas behind it and there is a ton of value here for just $10.\n-Great shooting\n-Deep skill system\n-Fun Campaign\n-Crisp graphics \n\nI look forward to seeing what is added in the future. Generally, I don't recommend most games in early access. However, this game has more than enough content to justify the price at this point.\n\nVERY CRISP", "timestamp_created": 1495699484, "timestamp_updated": 1495702062, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.517045", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31945157": {"recommendationid": "31945157", "author": {"steamid": "76561198253333336", "num_games_owned": 21, "num_reviews": 2, "playtime_forever": 444, "playtime_last_two_weeks": 0, "last_played": 1497132656}, "language": "english", "review": "Game is super fun, just almost no one on multiplayer ever, seems dead already", "timestamp_created": 1495683441, "timestamp_updated": 1495683441, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.460199", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31944959": {"recommendationid": "31944959", "author": {"steamid": "76561198036769743", "num_games_owned": 112, "num_reviews": 6, "playtime_forever": 94, "playtime_last_two_weeks": 0, "last_played": 1496007679}, "language": "english", "review": "Fun game so far! The begginer checklist you get helps out a lot to learn the mechanics of the game. Like everyone else has said, really has that gta1 and 2 vibe. Worth picking up!", "timestamp_created": 1495682015, "timestamp_updated": 1495682015, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31944763": {"recommendationid": "31944763", "author": {"steamid": "76561198039776037", "num_games_owned": 14, "num_reviews": 1, "playtime_forever": 89, "playtime_last_two_weeks": 0, "last_played": 1495681992}, "language": "english", "review": "What can i say about this game, The entire thing was written animated and designed by 1 person. Having said that the game is solid. Fun gameplay, Servers are very stable, Everything runs smoothly. The game itself has a twin stick shooter vibe mixed in with gta style gameplay with cars and guns. The multiplayer is fast paced and has a balanced gameplay style that allows you to turn a spawn camp into a win instead of a all out massacre.\n\n11/10 Game is awesome. Will be playing it a lot.", "timestamp_created": 1495680714, "timestamp_updated": 1495680714, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.460199", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "31943337": {"recommendationid": "31943337", "author": {"steamid": "76561198029328265", "num_games_owned": 517, "num_reviews": 4, "playtime_forever": 71, "playtime_last_two_weeks": 0, "last_played": 1498617299}, "language": "english", "review": "Fun game thats easy to learn but hard to master", "timestamp_created": 1495671505, "timestamp_updated": 1495671505, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.517045", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31942345": {"recommendationid": "31942345", "author": {"steamid": "76561198063399564", "num_games_owned": 594, "num_reviews": 12, "playtime_forever": 394, "playtime_last_two_weeks": 0, "last_played": 1498933693}, "language": "english", "review": "This is an amazing game which can make top-down games better by giving the infinite amount of things to do - like giving us the jumping ability, the explosions, the powers, the cars and other experiences, rather than having a completely 2D slim game. It's a good mixing of GTA1/2 and shooting games.\n\nI recommend it.", "timestamp_created": 1495665475, "timestamp_updated": 1495665475, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31941780": {"recommendationid": "31941780", "author": {"steamid": "76561198013939549", "num_games_owned": 26, "num_reviews": 2, "playtime_forever": 1608, "playtime_last_two_weeks": 0, "last_played": 1507708458}, "language": "english", "review": "With great gameplay mechanics and a truly uniqe skill tree that allows you to truly be your own unique lethal weapon.  Without a doubt this game brings some nice fast paced tactical fun! \n\nMy favorite highlights: \n\nTopdown viewing perspective isnt limited to just your box, snipers for example allow you to look further onward unlike games like CS2D!\n\nCars! you can drive around with some friends doing drive bys! my personal favorite is the pick-up truck where someone can be in the bed and shoot in any direction!\n\nSkills, the combinations are endless when it comes to this games skill trees! you can stay dedicated to one, or mix it up for a personally unique playing styles\n\nBuilt in editor allows for plenty of user generated content!\n\nLow sys requirments, High amount of fun!\n\nFriendly community, aswell as a dev that actually listens to players and is dedicated! \n\nI would for sure recommend this game to a friend! 10/10 in my book for an amazing top down shooter", "timestamp_created": 1495662259, "timestamp_updated": 1495662259, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31938848": {"recommendationid": "31938848", "author": {"steamid": "76561198025695367", "num_games_owned": 45, "num_reviews": 3, "playtime_forever": 303, "playtime_last_two_weeks": 0, "last_played": 1504609371}, "language": "english", "review": "Loving this game already.\n\nNext to nostalgia, it's actually really fun on it's own. A really neat little game. \nJust did a few multiplayer games and had tons of fun. You can even create your own maps, but I haven't gotten to that yet.\n\nI'll be playing the campaign now, to see how that goes - but multiplayer will be my main outlet anyway. Superb!", "timestamp_created": 1495650002, "timestamp_updated": 1495650002, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31938127": {"recommendationid": "31938127", "author": {"steamid": "76561198066248283", "num_games_owned": 533, "num_reviews": 205, "playtime_forever": 5, "playtime_last_two_weeks": 0, "last_played": 1495647350}, "language": "english", "review": "Does anyone play this?", "timestamp_created": 1495647376, "timestamp_updated": 1495647376, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.425532", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31937081": {"recommendationid": "31937081", "author": {"steamid": "76561197984393240", "num_games_owned": 145, "num_reviews": 7, "playtime_forever": 1635, "playtime_last_two_weeks": 0, "last_played": 1496896814}, "language": "english", "review": "Pretty good game, I give it a 7.  (7 Being the highest rating a game can be given)", "timestamp_created": 1495643403, "timestamp_updated": 1495643403, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.401417", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31933185": {"recommendationid": "31933185", "author": {"steamid": "76561198053788131", "num_games_owned": 5134, "num_reviews": 207, "playtime_forever": 380, "playtime_last_two_weeks": 0, "last_played": 1495622748}, "language": "english", "review": "[h1]OVERVIEW[/h1]\nNote: Geneshift is currently in Early Access. The version reviewed was current at the date of this review.\n\nGeneshift is a single- and multi-player top-down twin-stick shooter from new indie developers, Nik Nak Studios.\n\nIn Geneshift, you play a cybernetic mutant combat monster, practiced at dealing swift punishment to anything in your path. Well, that's the way you're portrayed, but really you just seem to be one of the majority, no more or less practiced at death-dealing than any of the many mutants around you.\n\n[h1]Graphics[/h1]\nGames in the top-down shooter genre often have difficulty in breathing life into the graphics, due to the somewhat-limited perspective. Characters, in particular, can often look like little more than coloured blobs with little parts that wiggle when they walk.\n\nGeneshift renders everything in 3D from a camera looking straight down, but sadly fares no better than most in this regard. The characters -- mutants, apparently -- are less than impressive. Animations are functional, though quite slow, and with no real 'wow' factor. The character models themselves have no personality at all; each one is the same as almost all of the others.\n\nThe environments look quite nice, though, particularly with the excellent dynamic lighting, even if they do all look the same after a while. Everything moves smoothly, even when there's a lot going on at once. Graphics and game options abound, too, so there's a fair bit to customise if the defaults don't quite suit.\n\nThe interface is busy and overly confusing, with a general lack of tooltips that makes working out (and then remembering) what everything means more difficult than it should be. Even after hours of play I'm still finding tabs and options hidden away that I didn't know were there, and still have trouble finding things that should be straightforward. There's some help, sure, but it's hidden away in a separate section of the interface (press F10) and any useful titbits are swamped in the great walls of text therein.\n\n[h1]Sound[/h1]\nThe title/menu music track suits the game well, but becomes quite repetitive. In-game music only seems to start playing at certain times -- I'm not sure if it's scripted or pseudo-random -- and is similarly themed.\n\nSound effects are pretty good, with some nice gunshots. They get the job done well. There are no voices.\n\n[h1]Gameplay[/h1]\nGeneshift is a science-fiction top-down twin-stick shooter that eschews the rogue-like elements becoming very common to the genre and instead focuses on arena-style multiplayer mayhem. Although Geneshift has a single-player campaign, there's essentially no continuity between its levels: it plays like a series of multi-player arena maps, with bots instead of human players, and scripted events to move the fairly rudimentary story along. If you're after an enthralling single-player twin-stick shooter, Geneshift is not the game for you.\n\nThe game plays essentially like any other twin-stick shooter, with left hand controlling movement and right hand controlling aiming and shooting. Mouse and keyboard controls are good for 'core' actions, but there are lots of other keys to remember for help, activating or swapping skills, using shields, and so on, so it can become overwhelming at first. I didn't try using a controller.\n\nPrimary weapons are purchased or can be picked up. You start only with your knife, and the old saying about bringing a knife to a gunfight holds true here; you'll quickly want to buy or find something else. You can only hold one weapon of each size and ammunition is in short supply, often cutting prolonged battles or guerrilla-style raids short as you turn tail and run for the nearest resupply point.\n\nSkills are powered by mana, which I really can't understand, given the mutant and cybernetic focus of the game. But plot isn't Geneshift's strong point. Once you unlock these and spend skill points on them you have quite a good selection available, with multiple levels of upgrades for each. Each one comes with a downside, though, so using a skill at the wrong time can both drain your mana, making your other skills unavailable, and also leave you exposed from the skill's drawbacks.\n\nProbably the most welcome addition to the genre from my point of view is that of vehicles that you can enter, and drive around. Get a team of your guys together and you can do some serious damage to your opponents, both from running them over and also shooting from the various seats in the car. These handle quite well, too, and can easily turn the tide in a large melee.\n\nAs far as the single-player campaign goes, you can choose from four difficulty levels, with only the first two available when you first start. Once you've completed the campaign once, the third difficulty unlocks, and a further completion at that level unlocks the final difficulty. Honestly, though, I think I'd rather eat a raw ghost chilli than sit through the entire campaign four times! As well as the general feeling of the campaign being 'tacked on' to make the game appeal to non-multi-player gamers, the script is pretty terrible (though with fairly good grammar, I must say) and there's no saving mid-level, so make sure you can spare the time if you sit down to play it.\n\nMulti player provides a number of game modes, but they mostly feel pretty similar to each other, even though they may have different victory conditions. At the moment there's only one official server available (in the USA), and it was the only server to which I was able to connect. With no useful error messages available for the failed connections, I can't even begin to investigate why. Ping times are high across the board, too, with the best I saw being about 250 ms -- a huge disadvantage in a competitive multi-player action game. Given the multi-player focus of the game, though, I would expect server availability and the general experience to improve as the game moves through Early Access.\n\nWith the game still being in Early Access, one might expect some bugs and stability issues, but that doesn't seem to be the case here; it's very stable and seems essentially bug free. I'm not sure what else is planned for EA, but given the focus of the game, I think much more time spent on single player is probably going to be wasted, unless it is completely redesigned from scratch; the multi-player arenas are where the appeal of the game lies.\n\n[h1]PROS AND CONS[/h1]\nPros:\n+ Plenty of skills and improvements\n+ Good server browser information\n+ Good dynamic lighting\n+ Cars are fun\n+ Good grammar\n+ Steam Achievements and Trading Cards\n\nCons:\n- Game is designed for multi player; single-player campaign feels tacked on\n- Difficulties with server connections; high ping\n- With the limited mana available, skills are a bit naff\n- Platform-style elements are annoying\n\n\n[h1]CONCLUSION[/h1]\nGeneshift is a mindless, but mildly entertaining single-player game. If you're looking for the next campaign-based twin-stick shooter, then Geneshift probably isn't it. But if you're a fan of arena shooters and you're in your element in top-down environments, then it's probably worth watching.\n\nAutosave\nSave\n[h1]Save for Later[/h1]\nPause\nQuit\nRage Quit\n\nNote: I received this game for free for review purposes. This did not influence my review.\n\n[code]For more game reviews, visit [url=http://saveorquit.com/]Save or Quit[/url].[/code]\n\n", "timestamp_created": 1495627115, "timestamp_updated": 1495627115, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.583203", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "31931845": {"recommendationid": "31931845", "author": {"steamid": "76561198030245514", "num_games_owned": 93, "num_reviews": 2, "playtime_forever": 401, "playtime_last_two_weeks": 0, "last_played": 1495939874}, "language": "english", "review": "I've been playing this game since its conception. I've seen the game change in so many ways from its humble beginnings. It has always been a great, fun game to play.  The developer has put his whole heart into this game and will continue to do so. So you can expect that this game will continue to evolve and receive updates on a regular basis.", "timestamp_created": 1495620242, "timestamp_updated": 1495620242, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.465686", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31931656": {"recommendationid": "31931656", "author": {"steamid": "76561198077450609", "num_games_owned": 3, "num_reviews": 1, "playtime_forever": 21, "playtime_last_two_weeks": 0, "last_played": 1495619015}, "language": "english", "review": "Just finished the opening mission !\nyesssssssss, reminds me of my platform shooters and top down shooters from my highschool days. \n\nrefreshing sense of nostalgia here, cant wait to see what else this game has! \n\nTHANKYOU\n\n", "timestamp_created": 1495619124, "timestamp_updated": 1495619124, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31931398": {"recommendationid": "31931398", "author": {"steamid": "76561198392472948", "num_games_owned": 1, "num_reviews": 1, "playtime_forever": 117, "playtime_last_two_weeks": 0, "last_played": 1495845392}, "language": "english", "review": "Love the above shooters! this one really stays true to the genre. Sooo many weapons!!!!", "timestamp_created": 1495617621, "timestamp_updated": 1495617621, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31931012": {"recommendationid": "31931012", "author": {"steamid": "76561198390394720", "num_games_owned": 1, "num_reviews": 1, "playtime_forever": 11, "playtime_last_two_weeks": 0, "last_played": 1495615049}, "language": "english", "review": "I'm really enjoying this game! Awesome graphics and features. So refreshing to have such a dedicated and passionate developer, who clearly just wants to make the game as fun as possible for everyone. My rating 5/5!", "timestamp_created": 1495615261, "timestamp_updated": 1495615602, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31930735": {"recommendationid": "31930735", "author": {"steamid": "76561198011955186", "num_games_owned": 15, "num_reviews": 1, "playtime_forever": 4004, "playtime_last_two_weeks": 6, "last_played": 1516307944}, "language": "english", "review": "Wow! This game is great. Essentially like GTA on steroids and with a certain 3D feel. First played it when it was named Subvein, but since then it has come a long way and now looks astonishing. What I like most are the fast multiplayer games, that can be very casual. But the game has a decent leaderboard now with ranked games so you can even compete with the best players. Nice!\nSkills, weapons and cars are all very well made, especially because the developer is always ready to listen to the community and also willing to smoothen out any rough edges. On the discord channel were already many ideas and feature suggestions posted, some of them will surely find their way into the game.\n\nSome things are still a work of progress: the included level editor could be more user friendly.\n\nOverall this game provides great multiplayer action with a lot of casual and serious fun. And it even has a singleplayer mode that is more story like and can be completed as a speedrun for even more competition.\n", "timestamp_created": 1495613488, "timestamp_updated": 1495613488, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31930014": {"recommendationid": "31930014", "author": {"steamid": "76561198045995785", "num_games_owned": 723, "num_reviews": 10, "playtime_forever": 20, "playtime_last_two_weeks": 0, "last_played": 1499252424}, "language": "russian", "review": "да здрастрвует subvein... эм что то не так... mutant faction...эм... опять что то не так... да здраствует geneshift который мы так долго ждали (~8-9 лет)\n\nэто GTA 2 направленная на пвп с интересной системмой скилов", "timestamp_created": 1495608058, "timestamp_updated": 1495690950, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.524612", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31929755": {"recommendationid": "31929755", "author": {"steamid": "76561198043784845", "num_games_owned": 118, "num_reviews": 5, "playtime_forever": 1920, "playtime_last_two_weeks": 0, "last_played": 1506076260}, "language": "english", "review": "I've played the game for about a year now. Personally I'd have stuck with the demo, as the other gamemodes you unlock from purchase aren't quite worth it imo, not yet. But then again, I've already played them from before the game got on steam.\n\nThe game itself has some great PvP to it, the weapons are easy to understand with a bit of hidden depth to them. And then you throw in the mutant abilities, vehicles, chemicals... It becomes hilariously chaotic. You may be dissuaded by the learning curve as well, but, if you can snipe or use a shotgun, you don't 'need' to learn much more.\n\nThe game is good casually, but I've seen the balance changes. The game could be competetive if there were people for it. Balance is tight and keeps moving towards everything is viable in it's own way over the others. Though I do miss the days of tank builds, it's for the better they're nerfed... Maybe a little much though.\n\nI'd have bought it just to support the awesome developer, but a friend bought me the game before I did, so eh.", "timestamp_created": 1495606445, "timestamp_updated": 1495606445, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "31928778": {"recommendationid": "31928778", "author": {"steamid": "76561197961174637", "num_games_owned": 178, "num_reviews": 1, "playtime_forever": 317, "playtime_last_two_weeks": 0, "last_played": 1502076355}, "language": "english", "review": "Solid game all around, a lot of different tactics and weapons to be had.  +1", "timestamp_created": 1495599814, "timestamp_updated": 1495599814, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31928714": {"recommendationid": "31928714", "author": {"steamid": "76561198053544051", "num_games_owned": 20, "num_reviews": 1, "playtime_forever": 1154, "playtime_last_two_weeks": 0, "last_played": 1496185978}, "language": "english", "review": "Remarkably balanced and enjoyable to play.  Can't say enough about how much fun i've had playing this game so far.  Great price, tons of detail.  You've outdone yourself Bencelot.", "timestamp_created": 1495599470, "timestamp_updated": 1495599470, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.504910", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31928248": {"recommendationid": "31928248", "author": {"steamid": "76561198019342148", "num_games_owned": 23, "num_reviews": 2, "playtime_forever": 2135, "playtime_last_two_weeks": 0, "last_played": 1512367389}, "language": "english", "review": "I played back in July 2009 when it was called Subvein/Mutant Factions, and I'm a forum moderator.\n\nIf you're looking for a [b]topdown shooter inspired by GTA2 with a variety of weapons/spells/skills to pick & make a build for[/b], then I would highly recommend this game. While the game has singleplayer (which is really a glorified tutorial, but worth playing nevertheless), multiplayer is the main focus of the game. Multiplayer combat is quick & decisive, though one-shot kills are pretty rare & situational, and so its more focused on clever positioning & skill usage rather than raw run & gun ability. Multiplayer matches generally last anywhere between 30min to 1 hour, while the singleplayer can last about 4 hours for your first playthrough, with replay value in unlocking higher difficulties & getting a better speedrun record.\n\nSpeaking from my experience as a player in Singapore connecting to USA or Europe, the game remains very [b]playable even in 300 ping lag[/b]. \n\nI find that the [b]main learning curve is knowing what skills to use or pick in a given situation[/b] - once you get past that you can pretty much do anything, and its fortunately pretty easy to figure out with the in-game descriptions. Don't worry about permanently screwing up your character's build - servers are usually set to Quickmatch (all players are reset to level 5). If you bought the game, you do have permanent mutants you can use on Permanent servers, but you can easily reset your build at no cost as long as you're under level 20 (max level is 50 for context), and even past that it only costs you an hour of gameplay for every skillpoint you wish to put elsewhere.\n\nSeeing as the game is in early access, I can assure you that the [b]sole developer[/b] has put his heart & soul into polishing the game for the past 8 years and won't be abandoning it anytime soon. He is very receptive to community feedback; in fact the idea of zombies and a singleplayer campaign came from the regular player community. There won't be any pay to win nonsense and he would recommend that you try to free demo to make sure it clicks for you before you buy the game.\n\nOverall, a fun indie game with a dedicated developer and plenty of decent content & solid gameplay!", "timestamp_created": 1495596665, "timestamp_updated": 1495596954, "voted_up": true, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.617206", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31927274": {"recommendationid": "31927274", "author": {"steamid": "76561197982324524", "num_games_owned": 1218, "num_reviews": 26, "playtime_forever": 104, "playtime_last_two_weeks": 0, "last_played": 1495670455}, "language": "english", "review": "Pretty cool. I have played most top-down shooters on steam, the fact the developer went through so much to make his game over 8 years kinda gives a special plus. I haven't even touched the multiplayer but still had lots of fun.", "timestamp_created": 1495590593, "timestamp_updated": 1495590593, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31926763": {"recommendationid": "31926763", "author": {"steamid": "76561198133296514", "num_games_owned": 10, "num_reviews": 1, "playtime_forever": 50, "playtime_last_two_weeks": 0, "last_played": 1495588660}, "language": "english", "review": "Very clean and well made. Could use a little more tutorial but with a little time its in depth and alot of fun.", "timestamp_created": 1495587339, "timestamp_updated": 1495587339, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.530279", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31926155": {"recommendationid": "31926155", "author": {"steamid": "76561197972272450", "num_games_owned": 273, "num_reviews": 4, "playtime_forever": 39, "playtime_last_two_weeks": 0, "last_played": 1501554245}, "language": "english", "review": "This is an amazing game made by an amazing developer. A friendly guy with a good heart and a real passion for making quality games. He genuinely cares about the community that formed around this game since it's initial release in 2009, and has never stopped engaging positively with everyone involved. His passion has really shone through in how he interacts with his dedicated players and in the artistry of his game. Please give this breakout work of art a chance and please support this awesome developer!\n\n-Avid player since 2009", "timestamp_created": 1495583491, "timestamp_updated": 1495584177, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.570617", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31925977": {"recommendationid": "31925977", "author": {"steamid": "76561198031893208", "num_games_owned": 93, "num_reviews": 1, "playtime_forever": 106, "playtime_last_two_weeks": 0, "last_played": 1497123215}, "language": "english", "review": "Very fun game, both singleplayer and multiplayer.", "timestamp_created": 1495582512, "timestamp_updated": 1495582512, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31925942": {"recommendationid": "31925942", "author": {"steamid": "76561198082980116", "num_games_owned": 138, "num_reviews": 35, "playtime_forever": 156, "playtime_last_two_weeks": 0, "last_played": 1506215098}, "language": "english", "review": "I will update this review over time.\n\nI like it, i like the premise, but there is some issues.\n\nI was kind of surprised when there wasnt controller support, this would make something like co-op a lot more fun if you had friends over. The graphics, oh god, it looks like this game was made from roblox models, not a HUGE issue but something that should be addressed. So far though, so good, its pretty fun. The controls with KB+M are surprisingly tight and fun to use, the moderatly fast paced combat is pretty fun and I could see this game getting pretty big if continuely updated.", "timestamp_created": 1495582340, "timestamp_updated": 1495582340, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31925847": {"recommendationid": "31925847", "author": {"steamid": "76561198043209558", "num_games_owned": 518, "num_reviews": 7, "playtime_forever": 2800, "playtime_last_two_weeks": 0, "last_played": 1510023992}, "language": "english", "review": "Because this game is still considered early access (Although it's a solid game), I'm going to preface this by saying that I've been following the development of this game for a little over 6 years and the progress that has happened in the past few years has been enormous, the sole developer tries his best to be active in the community and actually listens to the players. As a matter of fact, the Zombie Survival gamemode and Stealth gamemodes were actually suggested by normal players on the forums, and the developer worked his hardest to get those gamemodes into the game. He put his heart and soul into this fantastic indie game and wont be abandoning it anytime soon.\n\n\nIf you're looking for a fast paced top down multiplayer shooter, then Geneshift is the game for you. There's such a wide variety of weapons and skills so every playstyle has a way of expressing itself. \n\n[b] Want to be a sneaky assassin? [/b]\nUse Invisibility to sneak up behind someone before blinding them with Smoke Bomb and slicing them up with Blade Fury.\n[b] Want to be rambo? [/b]\nRev up your minigun with Frenzy Fire and your foes will cower behind cover in fear. With Bloody gains, you'll get stronger with each kill!\n[b] Want to be a sniper?[/b]\nWith long ranged Plasmaballs you'll blow the enemy apart, and pick the runners off with your Energized rifle.\n\nThe actual gameplay is fantastic. Allies and Enemies casting skills and doing drivebys with vehicles makes multiplayer hectic fun. It's got a nice playgroundy feel to it, as you can expirement various combinations of weapons and skills, or even just drive around and jump ramps.\n\n It's got a wide selection of gamemodes, such as:\nThe standard Deathmatch where you run and gun everything that moves.\nThe classic Extraction where you you have to escort Flags, Radios, and even Bomb trucks to their destination.\nThe fast paced Checkpoint gamemode where you do drivebys in an attempt to stop the enemy racer while your own driver tries to speed to the finish line.\nThe exciting Conquest gamemode where you work with your team to capture chemical points and prevent your foes from doing the same.\nThe stressful Zombie Survival gamemode where you activate bombs and stop an outbreak as zombies pour in on you from all sides.\n\nOverall, it's a solid indie game with a fantastic community and developer. It's got plenty of fun content, and minimal bugs.", "timestamp_created": 1495581057, "timestamp_updated": 1495581057, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.601712", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31925737": {"recommendationid": "31925737", "author": {"steamid": "76561198119532645", "num_games_owned": 60, "num_reviews": 4, "playtime_forever": 3329, "playtime_last_two_weeks": 2, "last_played": 1516246968}, "language": "english", "review": "[b]Disclaimer[/b]: I have stuck around this game for about 4 years before it's release with 230 hours played within that time. Take that as you will, but know that I'm trying to be as honest as I can here.\n\nGeneshift is a multiplayer top-down shooter that is unlike any other of it's kind that I have seen. It combines a very unique spell system with solid gunplay and throws in vehicles on top of all that. This makes for a very fun experience while also having a high skill ceiling. And to top it all off, it's being developed by the most active and friendly developer I have encountered.\n\nThere is a minor flaw that deserves mentioning: in it's current state, the game has some problems delivering info to the player with tutorials and such. Some advanced but necessary features are not properly covered by the tutorial and require reading through a large amount of text. Thankfully this is partially mitigated by the friendly group of long time players that are happy to help anyone in need.\n\nPS: Don't let the early access tag fool you, this is definitely a fully featured game.", "timestamp_created": 1495580347, "timestamp_updated": 1495955698, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.539474", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "31925550": {"recommendationid": "31925550", "author": {"steamid": "76561198004398992", "num_games_owned": 110, "num_reviews": 3, "playtime_forever": 159, "playtime_last_two_weeks": 0, "last_played": 1495743613}, "language": "english", "review": "It's a refreshing game with a passionate developer and an already established community. I hope it lifts off as the multiplayer aspect is very rewarding! For the price, it's also good value. Play the demo and see for yourself!", "timestamp_created": 1495579075, "timestamp_updated": 1495579075, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504910", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31925164": {"recommendationid": "31925164", "author": {"steamid": "76561198017246524", "num_games_owned": 881, "num_reviews": 54, "playtime_forever": 58, "playtime_last_two_weeks": 0, "last_played": 1495524264}, "language": "english", "review": "This is a solid entry into the Top Down Shooter Genre. Its not as fast as many that Ive played both free and premium. But it makes up for this with strong gunplay, a variety of guns, and a shield you can use if you find yourself caught out in the open. \n\nThe story was also rather fun in a cartoonish sort of way. The standard company messing with genes and mutants which can give you additional powers and unlocks. \n\nOverall good stuff and It should be interesting to see where it goes.\n\nhttps://youtu.be/CjxeB_Z-1u4", "timestamp_created": 1495576665, "timestamp_updated": 1495576665, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.460272", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "31925124": {"recommendationid": "31925124", "author": {"steamid": "76561198045538646", "num_games_owned": 11, "num_reviews": 1, "playtime_forever": 237, "playtime_last_two_weeks": 0, "last_played": 1495806769}, "language": "english", "review": "This sort of reminds me of top-down GTA! It can a similar feel to the good old GTA days when you could run people over with cars and run around shooting that bad guys... Except this one is a multi-player, which I always prefer. With mutant-zombies! I also really like the wide variety of weapons, and how you can unlock new abilities. I definitely recommend!", "timestamp_created": 1495576476, "timestamp_updated": 1495576476, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31924366": {"recommendationid": "31924366", "author": {"steamid": "76561198051084556", "num_games_owned": 474, "num_reviews": 40, "playtime_forever": 138, "playtime_last_two_weeks": 0, "last_played": 1497033804}, "language": "english", "review": "I played Geneshift back in the days, when it had a different name: Subvein (and then, Mutant Factions), since it was in development for few years already. Nonetheless, even then it was a lot of fun! Imagine the good old GTA2, Counter Strike 2D and Diablo skill tree system combined together. As crazy as it sounds, it's a recipe for an action packed multiplayer gameplay, that requires skill and teamwork in order to win! Top-down shootings, explosions, driving and spellcasting is an extremely entertaining mix! The game features various multiplayer combat gamemodes as well as a singleplayer or coop campaign. Definitely give it a go!", "timestamp_created": 1495572758, "timestamp_updated": 1495572758, "voted_up": true, "votes_up": 9, "votes_funny": 2, "weighted_vote_score": "0.525828", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31924288": {"recommendationid": "31924288", "author": {"steamid": "76561198076460549", "num_games_owned": 6, "num_reviews": 1, "playtime_forever": 205, "playtime_last_two_weeks": 0, "last_played": 1496541307}, "language": "english", "review": "Played the demo and loved it and now I'm loving the full version! Top-down shooter meets zombies meets skill-tree upgrades. Great multiplayer!", "timestamp_created": 1495572450, "timestamp_updated": 1495572450, "voted_up": true, "votes_up": 14, "votes_funny": 1, "weighted_vote_score": "0.594471", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31924039": {"recommendationid": "31924039", "author": {"steamid": "76561198097569582", "num_games_owned": 359, "num_reviews": 21, "playtime_forever": 58, "playtime_last_two_weeks": 0, "last_played": 1495569287}, "language": "english", "review": "As an early-access game, this is solidly-impressive. Even as a 1.0, this is solidly-impressive.\n\nThe only immediate faults I find come in the form of feature-requests: joystick support, and local multiplayer. \n\nAs a technical accomplishment, the game appears absolutely solid in what I've seen (feature-request aside). Insofar as story-arc, it's a good one and can lead down a lot of roads, all of which make for good shooter-with-moral-elements-lurking-in-the-shadows gameplay. \n\nI enjoyed the hour that I've spent thus far, and will spend many more hours here--especially if I can un-tether from my PC and move to a television via joystick control / Steam Big Screen support. \n\nTL;DR: pick this one up. It's a solid buy at the $9.99 mark.\n\nI am looking forward to 1.0 and the success of Nik Nak Studios!", "timestamp_created": 1495571313, "timestamp_updated": 1495571313, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31923423": {"recommendationid": "31923423", "author": {"steamid": "76561197960756061", "num_games_owned": 344, "num_reviews": 1, "playtime_forever": 42, "playtime_last_two_weeks": 0, "last_played": 1495569665}, "language": "english", "review": "Cool top down shooter with a lot of content! Brings back the good old days playing GTA at LAN even though this is more of a shooter then a car game.", "timestamp_created": 1495568723, "timestamp_updated": 1495568723, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.485693", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31923054": {"recommendationid": "31923054", "author": {"steamid": "76561198012106301", "num_games_owned": 423, "num_reviews": 1, "playtime_forever": 21, "playtime_last_two_weeks": 0, "last_played": 1495566987}, "language": "english", "review": "Great game. Extremely dedicated developer.", "timestamp_created": 1495567230, "timestamp_updated": 1495567230, "voted_up": true, "votes_up": 26, "votes_funny": 2, "weighted_vote_score": "0.650331", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31922007": {"recommendationid": "31922007", "author": {"steamid": "76561198359188750", "num_games_owned": 30, "num_reviews": 1, "playtime_forever": 326, "playtime_last_two_weeks": 0, "last_played": 1496612263}, "language": "german", "review": "Top Kek 9/11", "timestamp_created": 1495563085, "timestamp_updated": 1495563085, "voted_up": true, "votes_up": 3, "votes_funny": 2, "weighted_vote_score": "0.465263", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31921036": {"recommendationid": "31921036", "author": {"steamid": "76561198038340115", "num_games_owned": 35, "num_reviews": 1, "playtime_forever": 4896, "playtime_last_two_weeks": 0, "last_played": 1498293337}, "language": "english", "review": "This is the best top-down shooter I have ever played.\n\nI have been playing this game since 2009 in the beta and have over 100 hours logged, and am so glad the dev finally released it on Steam. Ignore the Early Access warning, this game has been polished for years. I personally have suggested many of the features in the game right now, and have been very heavily involved in the balancing discussions as well. If you kill someone with Plasma Ball you can thank ME for asking the dev to buff it! Anyway go get this game.\n\nPerfect 5/7 with rice.", "timestamp_created": 1495559488, "timestamp_updated": 1495559488, "voted_up": true, "votes_up": 50, "votes_funny": 9, "weighted_vote_score": "0.659797", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31920908": {"recommendationid": "31920908", "author": {"steamid": "76561197984712587", "num_games_owned": 181, "num_reviews": 89, "playtime_forever": 69, "playtime_last_two_weeks": 0, "last_played": 1495505449}, "language": "english", "review": "First Impressions Campaign Coop: https://www.youtube.com/watch?v=eMV3Q-4Za8E\n(Developer gave me 4 keys to play this with friends)\n\nA top-down shooter with some real spunk.  Play with 3 other friends through the campaign, or 5v5 in online matches.  You can equip a large range of weapons and unlock some pretty neat abilities (like spinning shurikens, fireballs, team healing, bouncing bullets, and much much more).  A real neat aspect to this game is the ablility to drive around in vehicles and run over bad guys.\n\nThe object of the campaign appears to be the destruction of mutated zombies.  Levels typically start off with you fighting your way through a heavily armed task force and pushing your way to some kind of paranormal bomb.  Once you activate the bomb, hoardes of ever-increasing undead swarm you and your allies until you have collected enough souls to power the paranormal bomb.\n\nThe gameplay is fast paced, fluid, and a hell of a lot of fun (especially with friends).\n\n[h1]PROS[/h1]\n-Fast paced action\n-Ability to play with friends through the campaign\n-Awesome soundtrack\n-Decent graphics\n-Multiple online game modes\n-huge assortment of weapons and abilities\n-Driving mechanic is fun\n-Controls are very fluid\n\n[h1]CONS[/h1]\n-Grouping with friends can be a chore if you don't know how to forward ports.  \n-The matchmaking system for the campaign is difficult to figure out in general.\n-Encountered a bug where a friend joining my campaign was stuck being my character and was unable to do anything (only happened once and was fixed by disconnecting and reconnecting)\n-Enemies have a lot of HP.  No satisfying one shots (from the weapons I've tried so far including the sniper rifle)\n", "timestamp_created": 1495559010, "timestamp_updated": 1495559010, "voted_up": true, "votes_up": 40, "votes_funny": 1, "weighted_vote_score": "0.679158", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "31920727": {"recommendationid": "31920727", "author": {"steamid": "76561198182475418", "num_games_owned": 172, "num_reviews": 2, "playtime_forever": 846, "playtime_last_two_weeks": 0, "last_played": 1497485420}, "language": "german", "review": "10/10 Playing this since 6 years with a little break between.", "timestamp_created": 1495558341, "timestamp_updated": 1495558341, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.430024", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 86, "total_negative": 2, "total_reviews": 88}}
