{"query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 103, "total_negative": 1, "total_reviews": 104}, "reviews": {"38926135": {"recommendationid": "38926135", "author": {"steamid": "76561198261939594", "num_games_owned": 43, "num_reviews": 1, "playtime_forever": 378, "playtime_last_two_weeks": 378, "last_played": 1514784562}, "language": "japanese", "review": "日本語訳はされてませんが、ゲーム自体それほど難しくなく、英文が理解できなくてもサクサク進みます(ストーリーについてはもうお一方のレビューを見ていただければ判るかと)\nボスクラスの敵の前の部屋には、オートセーブしてくれる回復箱や弾薬箱が置いてあったり、ダンジョンの難易度を示すレベルが表示されたりと親切設計です。\n基本的にダンジョンは低いレベルから順にクリアしていけばオーケー。各ダンジョンやフィールドには隠し部屋や隠しマップがあり、冒険を進める上で役に立つ物や主人公を強化するアイテムがあります。壁や木をよく観察すれば判るかも？\nアイテムを売ってくれる商人も地下にいるので、とりあえず階段を見つけたら降りてみるべし。\nまた所持アイテムには、本来の用途以外の使い道があったりするので、気になったら色々試してみた方がいいでしょう。\nフィールドはそれほど広くありませんが、クリアのために隅々まで探索する必要があります。しかしキャラの移動スピードが速いのでそれほどストレスにはなりません。\n値段の割りにボリュームはちょっと少なめかなと思いますが、セールの時などに買ってみてはいかがかと。", "timestamp_created": 1514787787, "timestamp_updated": 1514787787, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38923361": {"recommendationid": "38923361", "author": {"steamid": "76561198032345390", "num_games_owned": 188, "num_reviews": 62, "playtime_forever": 139, "playtime_last_two_weeks": 139, "last_played": 1514788437}, "language": "english", "review": "As an old-school die-hard original Legend of Zelda fan (first game, still play occasionally, including Master Quest), this is a nice homage. Not only that, it actually doesn't need that kind of a reference to do it justice. This is a good game in its own right. Shops aren't totally static, map uses some different methods and slight puzzles. Very simple and easy to understand even without a tutorial. Well done, sir, well done.", "timestamp_created": 1514778826, "timestamp_updated": 1514778826, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38883288": {"recommendationid": "38883288", "author": {"steamid": "76561198312823380", "num_games_owned": 272, "num_reviews": 48, "playtime_forever": 116, "playtime_last_two_weeks": 116, "last_played": 1514768662}, "language": "english", "review": "Really fun, retro, Zelda-like nes rpg! Would totally recommend this game to anyone who likes classic pixel-graphics rpgs. Keep it up Jonathan! Your games are awesome!", "timestamp_created": 1514682519, "timestamp_updated": 1514682519, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38878964": {"recommendationid": "38878964", "author": {"steamid": "76561198029878870", "num_games_owned": 368, "num_reviews": 13, "playtime_forever": 85, "playtime_last_two_weeks": 85, "last_played": 1514728488}, "language": "english", "review": "It's fun, it's hard, but I definitely wouldn't buy it for full price \n\nIf you like the classic Legend of Zelda, you will probably enjoy this quite a lot", "timestamp_created": 1514673173, "timestamp_updated": 1514673173, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38876034": {"recommendationid": "38876034", "author": {"steamid": "76561198127123702", "num_games_owned": 64, "num_reviews": 1, "playtime_forever": 342, "playtime_last_two_weeks": 342, "last_played": 1514667480}, "language": "english", "review": "I'm a sucker for throwback indie games like these and this was a fun little time killer.", "timestamp_created": 1514667622, "timestamp_updated": 1514667622, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38875291": {"recommendationid": "38875291", "author": {"steamid": "76561198104426020", "num_games_owned": 412, "num_reviews": 1, "playtime_forever": 45, "playtime_last_two_weeks": 45, "last_played": 1514712932}, "language": "english", "review": "Review 50.\n\nI'd write more but it's launch time.", "timestamp_created": 1514666267, "timestamp_updated": 1514666365, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38869878": {"recommendationid": "38869878", "author": {"steamid": "76561197999610114", "num_games_owned": 2056, "num_reviews": 10, "playtime_forever": 284, "playtime_last_two_weeks": 284, "last_played": 1514649944}, "language": "english", "review": "Shotgun Legend closely imitates the original Legend of Zelda, and you already know what that is, so let's talk about the shotgun. What makes TLoZ's combat distinct from its successors is the combination of a short sword and grid-locked movement. Fights are a unique kind of scramble for position as Link tries to get right up to the enemy to line up hits, without getting into a vulnerable position himself. Swapping the sword for a shotgun is an effective twist on the design that gives Shotgun Legend its own feel despite how it follows Nintendo's design in other places. Because of the gun's wide spread, you still need to get in close to deal the most damage, but the ability to deal decreasing damage at increasing range allows a lot more flexibility in how enemies and encounters can be designed. Shotgun Legend fully exploits that flexibility with some of the more deviously challenging room layouts I've seen in this genre. It's gaming comfort food, but has enough distinct ideas to be worth checking out.", "timestamp_created": 1514656909, "timestamp_updated": 1514656909, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38848150": {"recommendationid": "38848150", "author": {"steamid": "76561198032102200", "num_games_owned": 67, "num_reviews": 3, "playtime_forever": 95, "playtime_last_two_weeks": 95, "last_played": 1514615401}, "language": "english", "review": "A fun game with mechanics like the old NES. Anything that might be a flaw in the controls or game seems more like a feature of difficulty just like the classics. Really fun and enjoyable.", "timestamp_created": 1514614262, "timestamp_updated": 1514614262, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38767704": {"recommendationid": "38767704", "author": {"steamid": "76561198288666120", "num_games_owned": 88, "num_reviews": 4, "playtime_forever": 45, "playtime_last_two_weeks": 45, "last_played": 1514438257}, "language": "english", "review": "I'd like to see the developer meet his review goal, and so I'll post this review earlier than I normally would.\n\nThis game is an homage to the original Legend of Zelda, and it wears its influences right on its sleeve. From the scrolling text in the opening scene, to the old man in a cave, and no explanation for anything beyond finding some special object - it's all there. I have to get some more time in to really gauge this as a whole, but I can definitely say that if you're looking for something like the NES classic, this game seems to have you covered.\n\nParticularly satisfying is the shotgun blast while playing with a controller. Every enemy is a pleasure to splat. I'm just through the second dungeon (I haven't found the first one yet...somehow) and enjoying myself. I'll update this when I get further on!", "timestamp_created": 1514438615, "timestamp_updated": 1514438615, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38761074": {"recommendationid": "38761074", "author": {"steamid": "76561198125045540", "num_games_owned": 35, "num_reviews": 6, "playtime_forever": 120, "playtime_last_two_weeks": 120, "last_played": 1514423286}, "language": "english", "review": "Awesome, haven't made it very far but the game looks like the pirce is well worth it, you ahve some talent and I think you could go beyond even this. recommended!", "timestamp_created": 1514423461, "timestamp_updated": 1514423461, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38711022": {"recommendationid": "38711022", "author": {"steamid": "76561197960404946", "num_games_owned": 1240, "num_reviews": 14, "playtime_forever": 150, "playtime_last_two_weeks": 150, "last_played": 1514336600}, "language": "french", "review": "[i]***J’ai gagné ce jeu gratuitement sur le site orlygift.com mais mon avis n’est pour autant pas biaisé. Cette review est basée sur la version Early Access v0.9.10.***[/i]\n\nShotgun Legend est un jeu indé qui rend hommage à The Legend of Zelda sur NES sauf qu'ici on n'incarne pas Link mais Eugene avec son fusil à pompe. Ce dernier a été aspiré par un vortex alors qu'il venait de trouver la jante de camion qu'il cherchait à la décharge (vous avez bien lu xD). Se retrouvant sur une île dans un monde inconnu, il ne se laisse pas démonter et cherche dorénavant à retrouver la jante te camion car elle semble être son seul moyen de rentrer.\n\nEn plus d'être visuellement très semblable à The Legend of Zelda, ce dernier partage pas mal d'éléments de gameplay dont la map, les donjons et la progression qui se fait en trouvant des nouveaux objets (passifs ou actifs dont de nouvelles armes) qui permettront d'avancer dans le jeu ou pour faciliter la vie de Eugene en améliorant notamment son fidèle fusil à pompe.\n\nLe jeu est sympathique et semble pas trop long (j'ai obtenu 9 des 31 achievments en 30 minutes). Pas grand-chose à lui reproché (actuellement en réduction à 0,5€) au vu de son petit prix si ce n'est la musique sur la map principale qui fait un peu musique d’ascenseur. A noter que je recommande ce jeu surtout aux \"vieux de la veille\" qui apprécieront pouvoir jouer à un The Legend of Zelda like. Pour ma part, j'attends qu'il sorte de Early Access pour continuer ma partie sachant que le dev a annoncer du contenu avant la sortie 1.0 dont des cartes à ramasser des monstres du jeu.", "timestamp_created": 1514320635, "timestamp_updated": 1514466780, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525140", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "38677932": {"recommendationid": "38677932", "author": {"steamid": "76561198165480221", "num_games_owned": 48, "num_reviews": 18, "playtime_forever": 444, "playtime_last_two_weeks": 0, "last_played": 1513448103}, "language": "english", "review": "Back in the 80's The Legend of Zelda was my very first NES cartriage. Years later I played the freeware title Zelda Classic and beat it in 2 hours remembering where every dungeon was except for 2 which got frustrating concidering I need to get only that piece of the triforce. Otherwise I would have beat it in much shorter time. \n\nIt isnt one my favorite NES games anymore especially when you remember where almost everything is which gets boring. \nShotgun Legend changed everything. I was very reluctent to buy this game concidering I thought it was just a Zelda clone.\nBut I actually enjoyed it and was quite impressed. Especially for the low price. \n\nMore challenging than the NES classic. And it doesnt have those annoying pauses when you move from screen to another. Highly reccomended and not just for nostagia reasons. This game is actually fun as well as Broken Amor the other 8 bit game created by the same company.", "timestamp_created": 1514247911, "timestamp_updated": 1514247911, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38669345": {"recommendationid": "38669345", "author": {"steamid": "76561198025018402", "num_games_owned": 322, "num_reviews": 11, "playtime_forever": 314, "playtime_last_two_weeks": 314, "last_played": 1514265439}, "language": "english", "review": "Like Legend of Zelda but with a shotgun. So far there haven't been any very difficult puzzles, but the enemies and especially the bosses are definitely more challenging than LoZ.", "timestamp_created": 1514229349, "timestamp_updated": 1514229349, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.474359", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38647858": {"recommendationid": "38647858", "author": {"steamid": "76561197967571564", "num_games_owned": 397, "num_reviews": 24, "playtime_forever": 642, "playtime_last_two_weeks": 0, "last_played": 1509689655}, "language": "english", "review": "A great little throwback to the action adventure titles of nostalgia past.\n\nThe Good:\n+Clean and crisp graphics don't leave you trying to figure out what's what.\n+A good soundtrack.\n+A nice tongue in cheek story that feels apropos for the game.\n+Easy to get used to controls.\n+Plenty of Items and weapons to play with.\n+An interesting take on co-op.\n\nThe Bad:\n-Can be tough to figure out where to go.\n\nThe Ugly:\n-I can't really think of anything to put here.\n\nAltogether I found this title to be very interesting and fun even before full release and have played through whats availble a couple of times.", "timestamp_created": 1514184199, "timestamp_updated": 1514184199, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.513619", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38642390": {"recommendationid": "38642390", "author": {"steamid": "76561197996495980", "num_games_owned": 3975, "num_reviews": 59, "playtime_forever": 362, "playtime_last_two_weeks": 362, "last_played": 1514163956}, "language": "english", "review": "An excellent old-school action-adventure in the vein of the original Zelda.  \n\nYou have your primary weapon - the titular shotgun, and find a number of secondary weapons and passive equipment along the way.  While the shotgun's range isn't too bad, it has a pretty large spread so you want to be relatively close to your target for maximum damage.  1-2 close up shotgun blasts will take care of most normal monsters, or you can keep picking away at the enemies' invisible healthbars from the relative safety a few meters grant.  Most of the secondary weapons require ammo, that randomly drops from enemies, and can also be bought from some vendor or replenished for free from the occasional ammo station.  Regaining lost \"hearts\" (HP) works the same way - loot drops, vendors, health stations.  As you progress, you also find heart container (max health) upgrades, ammo capacity upgrades, and shotgun upgrades (adding additional pellets to the shotgun blast).  You can switch secondary weapons by cycling through them while playing, or from the inventory screen which pauses the game play so you don't get hurt while picking the best weapon for the current situation.\n\nThe map is open world, littered with monsters and dungeons.  Plenty of secrets in both the map and the dungeons, most of them blocked off by obstacles that require a weapon or item found in the dungeons, so it's best to note down where you come across the (quite obvious) obstacles so you know where to revisit later.   The monsters respawn after you move a few screens away (not sure how many, maybe 4-5), but the cleared obstacles remain cleared.\n\nThe vendor at the starting location has a compass costing 10 coins (drops from monsters).  You should buy it quickly, as it gives your character's relative position on the minimap for both the overmap and the dungeons.  However the actual dungeon rooms/features will not be visible until you find the dungeon's map somewhere inside, and the overmap features will not be visible for quite a while longer.  Again, note taking would be encouraged, though there's no real need to actually draw a square-by-square map of your own like some games pretty much required in ye olden times.\n\nThe game controls great with the Xbox 360 pad, so I never tried the keyboard controls.  One thing to keep in mind is that this is [b]not[/b] a twin-stick shooter.  The only direction you can fire your weapon is the one in which your character is facing, and the only way (as far as I know) to face in that direction is to move in that direction, which adds a level of difficulty when trying to blast nearby enemies without colliding with them and losing health.\n\nThere is a hardcore mode, where you only get the one life and if you die it's Game Over.   I did not even attempt it, considering how many times I died on my play through.  In non-hardcore mode, if you die, you get sent back to the save point.  There is only the one save slot, but that never presented much of a problem to me.  Save points are placed at all dungeon entrances/exits, health & ammo stations, some in-dungeon transitions, and whenever you find an item/upgrade.   If the save is made when your health is too low, reloading it will bump you up to 3 HP or about half your max HP, whichever's greater. \n\nI had a lot of fun in then 5.5 hours or so that it took me to complete the game.  I did miss one passive item and a few ammo upgrades along the way, hunting them down without a guide would probably take another hour or two, and I'm not enough of a completionist to do that.\n\nHonestly, I'm not sure why Shotgun Legend still in Early Access - I played it from the beginning to end without encountering any bugs.", "timestamp_created": 1514166758, "timestamp_updated": 1514166758, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.625784", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "38608994": {"recommendationid": "38608994", "author": {"steamid": "76561197988850970", "num_games_owned": 158, "num_reviews": 3, "playtime_forever": 48, "playtime_last_two_weeks": 48, "last_played": 1514184214}, "language": "english", "review": "I love this game for real... it's a taste of old school meeting where I'm from.. as a new world Samurai and a redneck none the less... Keep these games coming.", "timestamp_created": 1514096127, "timestamp_updated": 1514096127, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38608881": {"recommendationid": "38608881", "author": {"steamid": "76561198057487235", "num_games_owned": 173, "num_reviews": 1, "playtime_forever": 591, "playtime_last_two_weeks": 591, "last_played": 1514505865}, "language": "english", "review": "This is the first \"Early Access\" game that I've purchased, and I had some reservations about doing so.  \"Early Access\" to me indicates buggy and/or unfinished games, that I would basically be paying to be a playtester for.  I can gladly say that this is not the case with Shotgun Legend, and the game is fully completed, and I haven't encountered any bugs during the four hours that I've played the game.  That being said, on to the review of the gameplay:\n\nLet's start by getting the obvious out of the way.  This game is \"heavily influenced\" by the original Legend of Zelda, to say the least.  That being said, it manages to do something unique with the formula, including some fairly creative powerups and combat strategies.  If you're a fan of the original LoZ, then you should have no problems jumping right into this game.  \n\nWhile there are many similariites between the two titles, Shotgun Legend offers a new take on the Action-RPG combat by equpping the protagonist with a shotgun instead of a sword.  This allows you to attack enemies from farther away, while decreasing the amount of damage you depending on how far away from the enemy you are.  While this might not seem like a huge deal, it complelety alters the way that you play the game because it is no longer a simple hack-and-slash mechanic that you're dealing with.\n\nThe game provides a very basic concept for a story during the intro, but this becomes more fleshed out as you advance and find various notes left around the world that add more to the game's backstory.  All in all, it provides a fairly interesting plot to go along with the basic LoZ exploration concept.\n\nI picked this game up during the Winter Sale for $.49 today, and I honestly didn't have high hopes for it.  Gladly, I have been proven wrong, and have already put 4 hours into playing it.  This is one of those games that you want to keep .playing and advancing in when you start it.  I highly recommend it, and since the game offers trading cards,  you can pick it up for the $.49 sale price, and most likely make back most of, if not all of your money by selling the cards.  \n\nHere's a quick breakdown of the Pros and Cons:\n\nPros:\n- Borrows heavily from the original Legend of Zelda, while paying homage to the same\n- Heavy on exploration- lots of secrets to be found, and doesn't hold you hand throughout the whole game\n- Replacing the sword with a shotgun offers a unique approach to playing a familiar action-rpg\n- Secondary items are creative and help to enhance the different ways in which to play the game\n- Despite being an \"early access game,\" offers a complete game, that seems to be free of any major bugs\n- Very cheap, especially if you can get it during a sale\n- Offers Steam trading cards, which can potentially get you back all or some of the money you spent on it\n\nCons\n- Difficulty spikes with some of the dungeon bosses.  While most are fairly easy to beat after learning their pattern, ther are a couple that really ramp up the difficulty\n- As someone with red/green colorblindness, I sometimes got killed because I failed to see a bat that blended into the background, or because I couldn't tell the differece between a normal enemy or its poisonous (green?) counterpart.\n\n\nAll in all I definitely recommend this game, especially to any Legend of Zelda fans out there.  I've played many ROM hacks of the original LoZ, and this game manages to do what most of the don't- introduces something fresh and avoids becomign stale and repetative.  \n\n", "timestamp_created": 1514095849, "timestamp_updated": 1514095849, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38587019": {"recommendationid": "38587019", "author": {"steamid": "76561198025041613", "num_games_owned": 623, "num_reviews": 1, "playtime_forever": 176, "playtime_last_two_weeks": 176, "last_played": 1514055446}, "language": "english", "review": "It's fun. It's cheap. It's not without flaws.\n\nAs of writing this, I've conquered the first four dungeons of the game and I'm excited to see what remains.\n\nControls are, unfortunately, *non-customizable* as far as I can tell. The game recommends a joypad but I felt much more at home using keyboard controls. The controls are a bit floaty for my liking but not so bad that it is anything other than a small annoyance.\n\nI like the game, though. It has a decent level of polish and a lot of heart.\n\nAnd a shotgun.", "timestamp_created": 1514049214, "timestamp_updated": 1514049214, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38562126": {"recommendationid": "38562126", "author": {"steamid": "76561198149950143", "num_games_owned": 286, "num_reviews": 13, "playtime_forever": 21, "playtime_last_two_weeks": 13, "last_played": 1514007757}, "language": "english", "review": "This is a really cool game, it is very Zelda-Like in the design and the idea but the gameplay is completely different.\n\nFor every Zelda-Fan who doesn't want to wait for a legal version of Zelda on the PC, a good alternative :)\n\nGood music and cool soundeffects are available in the game.", "timestamp_created": 1514006886, "timestamp_updated": 1514006886, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38382746": {"recommendationid": "38382746", "author": {"steamid": "76561197996681866", "num_games_owned": 343, "num_reviews": 77, "playtime_forever": 347, "playtime_last_two_weeks": 0, "last_played": 1513548052}, "language": "english", "review": "[b]Shotgun Legend[/b] is a tribute to the Legend of Zelda, but instead of Link, you are Eugene, a shotgun wielding hillbilly. In this retro 2D RPG, you explore an unfamiliar world that is plagued with evil aliens who are trying to resurrect their leader. As a result, the lands are swarming with the undead and other challenges you must face to get back home. Overall, Shotgun Legend is a great example of a retro RPG done well. Exploration is fun and rewarding, dungeons are challenging, and combat is exciting. \n\n[h1][u]Positive:[/u][/h1]\n[list]\n[*]Notes are scattered all over the world and provide just enough information for you to figure out what to do next. As such, plenty of exploring is expected and required, but the game isn’t cryptic to the point of frustration. In fact, exploration often rewards you with upgrades. This is a refreshing break from games that hold your hand from start to end. \n[*]Blasting crabs, bats, and skeletons with a shotgun is so satisfying. I also enjoyed the trade-off you have to consider when using a shotgun. The further away you are from your enemies, the safer you are, but you do less/no damage. Whereas if you want to do maximum damage, you must position yourself dangerously close to your foes. Finding the ideal balance is necessary to complete the game, as it is fairly easy to die and somewhat difficult to kill enemies.\n[*]You have a good selection of secondary weapons that have different strengths and weaknesses. This becomes especially fun towards the end of the game, where you can adjust your playstyle and weapon choices depending on the enemies or map design. [spoiler]The banjo made me crack up.[/spoiler]\n[*]All the hidden rooms and locations can be found if you pay enough attention. The cracks in the stones/walls are always clear, and walkable paths, through trees for example, are of a different colour. \n[*]At first I didn’t like that Cedric’s shotgun was placed as a secondary item instead of replacing and strengthening your main shotgun. However, once I started dual wielding shotguns, I felt like a madman on steroids. Very nice. \n[/list]\n\n[h1][u]Negative:[/u][/h1]\n[list]\n[*]Very few music tracks; there were only 2 or 3 different tracks, as far as I could tell. As a result, it gave the game an unnecessarily tedious feel. I ended up turning the music off and listening to other songs while playing. I think the addition of tracks that are specific to each area/dungeon would vastly improve the playability of Shotgun Legend.\n[*]In most Legend of Zelda games, the boss at the end of the dungeon requires you to use your newly acquired item to defeat it. This is not the case in Shotgun Legend. I don’t think any boss requires you to use anything besides your shotgun. While I don’t think this is a huge flaw, I would have liked if this was incorporated (perhaps in the next Shotgun Legend game?). \n[*]I think it would be nice if the keys could be remapped, especially for those playing with a keyboard. It would also be great if the player could assign the secondary weapons to specific keys to avoid having to scroll through each item individually.\n[*]The order in which you enter/complete dungeons doesn’t seem to matter much. I didn’t really pay attention to which dungeon I was in and just went with a first-find-first-go approach. There was one situation where I needed the shield generator but didn’t have it yet because I went to the wrong dungeon. I managed to progress by simply tanking shots. I think it would be good to somehow enforce a certain dungeon completing order. \n[/list]\n\n[h1][u]Conslusion:[/u][/h1]\n[h1]★★★★☆ Surprisingly great[/h1]\n\nIf I were browsing the Steam store, it is very likely that I wouldn’t have taken a second look at Shotgun Legend. Luckily, this game was recommended to me, so I gave it a try. I’m happy to say that I was not disappointed in the slightest. Shotgun Legend was a thoroughly enjoyable experience, so it would have been a tragedy if I simply chose to ignore it. As a Steam community I think it’s important to support the small indie developers that really care about making great games. Without these pioneers we wouldn’t have the opportunity to play such unique titles. Jonathan Tindell did (and is still updating/fixing the game) an excellent job with this game, so I urge you to put your scepticism to the side and try Shotgun Legend. \n\n[table]\n[tr]\n[th][h1]If you enjoyed this review please follow me on my [url=http://store.steampowered.com/curator/26827738-%27b-Reviews/?appid=241930]curator page[/url] and [url=http://steamcommunity.com/groups/breviews]group[/url]. Your time and support is greatly appreciated![/h1][/th]\n[/tr]\n[/table]", "timestamp_created": 1513534232, "timestamp_updated": 1513534232, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.715054", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38312998": {"recommendationid": "38312998", "author": {"steamid": "76561198195702999", "num_games_owned": 49, "num_reviews": 8, "playtime_forever": 138, "playtime_last_two_weeks": 32, "last_played": 1513908968}, "language": "english", "review": "gg +1", "timestamp_created": 1513298050, "timestamp_updated": 1513298050, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38292589": {"recommendationid": "38292589", "author": {"steamid": "76561198053638794", "num_games_owned": 108, "num_reviews": 3, "playtime_forever": 537, "playtime_last_two_weeks": 337, "last_played": 1514683796}, "language": "english", "review": "Top down Zelda goodness.  It's moderately difficult- which I love- with a good sense of humor.  The shotgun mechanics are innovative as well.  The closer the better, but more dangerous at close range. I've played for 3 hours straight without a break.  Get it so this person can make more games, please!  8.75/10 at the 3 hour mark!\n\nEdit- Just realized this was early access, and it's still great. Better than most \"finished\" indie games I've played.", "timestamp_created": 1513218063, "timestamp_updated": 1513218308, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38248339": {"recommendationid": "38248339", "author": {"steamid": "76561198246600384", "num_games_owned": 142, "num_reviews": 16, "playtime_forever": 28, "playtime_last_two_weeks": 0, "last_played": 1513048343}, "language": "english", "review": "Great game. If you enjoy legend of zelda there's no reason for you to not get this.", "timestamp_created": 1513048433, "timestamp_updated": 1513048433, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38228048": {"recommendationid": "38228048", "author": {"steamid": "76561198250605988", "num_games_owned": 347, "num_reviews": 5, "playtime_forever": 63, "playtime_last_two_weeks": 0, "last_played": 1512967545}, "language": "english", "review": "This game definitely has the feel of the first Legend of Zelda. You will get lost and you will die a lot. Progression is slow and you have to kill a lot of monsters for money. For modern gamers, this might be a turn off. But this is how the first Zelda was. Games of yesteryear were like this and Shotgun Legend captures that feeling. I bought this game during the sale but would gladly pay the full price for it.", "timestamp_created": 1512968237, "timestamp_updated": 1512968237, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38203771": {"recommendationid": "38203771", "author": {"steamid": "76561198039025070", "num_games_owned": 334, "num_reviews": 93, "playtime_forever": 882, "playtime_last_two_weeks": 0, "last_played": 1512920440}, "language": "english", "review": "I've thoroughly enjoyed what I've played so far. The progression in this game is what kept me hooked and I love the way it feels and controls like a Genesis/SNES game.  The developer is clearly passionate about the game and it's heritage. You control Eugene who falls into a portal opening with a truck rim and he ends up in a dark kind of inverted version of zelda with aliens, oh and you have a shotgun but you've lost the rim and you MUST get it back.\n\nThe world is fun to explore, the few dungeons I go into were quite challenging and provided worthy rewards for the level of difficulty. The split-screen is also a pretty cool take on risk .vs. reward as you summon a doppelganger that shares it's health with yours. This can potentially increase the damage dealt, but damage taken as well. Apparently I get to dual-wield shotguns a bit later into the game. \n\nHidden Gem, let's change that. Love your work.\n\nhttps://youtu.be/bNNgDnC984U\n", "timestamp_created": 1512894511, "timestamp_updated": 1512894511, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.507187", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38199394": {"recommendationid": "38199394", "author": {"steamid": "76561198194409181", "num_games_owned": 139, "num_reviews": 2, "playtime_forever": 90, "playtime_last_two_weeks": 0, "last_played": 1513382800}, "language": "english", "review": "I played through the first level and this looks pretty good.  Shotgun Legend is very obviously inspired by the original Zelda on the NES, and it reminds me of the first time I played the 8-bit classic when I was a child.", "timestamp_created": 1512879612, "timestamp_updated": 1512879612, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38190462": {"recommendationid": "38190462", "author": {"steamid": "76561197979282685", "num_games_owned": 1179, "num_reviews": 19, "playtime_forever": 286, "playtime_last_two_weeks": 0, "last_played": 1512867505}, "language": "english", "review": "Has the proper feel of an old-school Zelda game - even the weak monsters are dangerous, you don't know where you're going, and no grind (except maybe a small grind for money if you want to).", "timestamp_created": 1512850448, "timestamp_updated": 1512850448, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.507187", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38187261": {"recommendationid": "38187261", "author": {"steamid": "76561198254306990", "num_games_owned": 49, "num_reviews": 1, "playtime_forever": 77, "playtime_last_two_weeks": 0, "last_played": 1513027007}, "language": "english", "review": "Very fun game to play in a short period of time. Although I only played 30-ish minutes, I would definitly recommend this game + the developer seems to be pretty cool.", "timestamp_created": 1512842640, "timestamp_updated": 1512842640, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.507187", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "38168452": {"recommendationid": "38168452", "author": {"steamid": "76561197970012429", "num_games_owned": 738, "num_reviews": 6, "playtime_forever": 358, "playtime_last_two_weeks": 116, "last_played": 1513660212}, "language": "english", "review": "Zelda with a shotgun.  I bought it on sale, what a deal!  Having a great time with it.", "timestamp_created": 1512788862, "timestamp_updated": 1512788862, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.468368", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38165820": {"recommendationid": "38165820", "author": {"steamid": "76561197968548545", "num_games_owned": 360, "num_reviews": 46, "playtime_forever": 813, "playtime_last_two_weeks": 0, "last_played": 1512854008}, "language": "english", "review": "Great title. I'm throughly enjoying it. How do I get off of the island where Dungeon Level 8 is?", "timestamp_created": 1512778472, "timestamp_updated": 1512778472, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38160262": {"recommendationid": "38160262", "author": {"steamid": "76561198288598113", "num_games_owned": 24, "num_reviews": 2, "playtime_forever": 191, "playtime_last_two_weeks": 0, "last_played": 1513033538}, "language": "english", "review": "Excelent little game especially for the price.\nthe game sort of throuws you in with no context or instructions but as you go along you figure out the controls and learn more about the story.\nThe dungeons can be quite difficult if you accidentally start them out of order but it is well worth the effort.\n10/10", "timestamp_created": 1512759593, "timestamp_updated": 1512759593, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38135674": {"recommendationid": "38135674", "author": {"steamid": "76561198212408483", "num_games_owned": 525, "num_reviews": 2, "playtime_forever": 141, "playtime_last_two_weeks": 0, "last_played": 1506969968}, "language": "german", "review": "Diese Spiel ist optimal für all jene, die früher The Legend of Zelda auf dem NES gespielt haben.\n\nSehr zu empfehlen", "timestamp_created": 1512673403, "timestamp_updated": 1512673403, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38127203": {"recommendationid": "38127203", "author": {"steamid": "76561198015030667", "num_games_owned": 384, "num_reviews": 2, "playtime_forever": 669, "playtime_last_two_weeks": 0, "last_played": 1512728371}, "language": "english", "review": "Only a bit into the game right now, but as of late I've had nothing that just gripped me, pulled me in, and made me feel welcome.\n\nOther games I played recently had too much going on, they tried too hard with new systems that were too new to truly shine. Even games that are out of early access, I found issues with the fairness of it all. I prefer my games challenging, but not so the point where I feel anxious half the time I'm sending out crew for a mission, knowing the heavy casualties which cannot be undone, since every dev seems to LOVE autosave now.\n\nNot trying to stray too far, but I think my mindset in writing this is a bit relevant. Coming upon this game on sale for so cheap ($0.49) and looking well enough in the bit of preview footage I saw, along wtih positive comments, I had to try it.\n\nSo far I feel like I'm back on the SNES, jumping into some random adventure, being shown where I can't access yet, and knowing that I need to search around more to further my quest.\n\nI have high hopes for the game as the present state it is in. I would LOVE to help the development team in any way possible. Gaming all my life, but never having got my foot in the door to be part of a project, I would prove a boon to any team. I have a plethora of ideas and insights I could bring to the discussion, even if just to open up some development or expansion prospects.\n\nReach out on here if you guys are seeing there, and wouldn't mind asking for some feedback or help. I'm all ears.", "timestamp_created": 1512648722, "timestamp_updated": 1512648722, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38105402": {"recommendationid": "38105402", "author": {"steamid": "76561198153556449", "num_games_owned": 9, "num_reviews": 1, "playtime_forever": 65, "playtime_last_two_weeks": 0, "last_played": 1512582232}, "language": "brazilian", "review": "Ele é muito bom pra joga melhor jogo que joguei tem bastante coisa pra faze é bem legal recomendo vocês comprarem.", "timestamp_created": 1512572844, "timestamp_updated": 1512572844, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38088689": {"recommendationid": "38088689", "author": {"steamid": "76561198117674830", "num_games_owned": 837, "num_reviews": 369, "playtime_forever": 296, "playtime_last_two_weeks": 0, "last_played": 1512937342}, "language": "english", "review": "Great Game!", "timestamp_created": 1512507242, "timestamp_updated": 1512507242, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.432811", "comment_count": 0, "steam_purchase": true, "received_for_free": true, "written_during_early_access": true}, "38087359": {"recommendationid": "38087359", "author": {"steamid": "76561197996286978", "num_games_owned": 60, "num_reviews": 12, "playtime_forever": 376, "playtime_last_two_weeks": 0, "last_played": 1512677068}, "language": "english", "review": "- Shooting the weapons in this game feels so damn satisfying and I like the items you can find.\n- Also, I really like how the game saves your progress. Makes me play carefully but also doesn't leave me frustrated if I die from a dumb mistake.\n- I haven't progressed far into the story, yet, so I'm still a bit confused what the world is about.\n- Right now I focus mostly on finding dungeons.", "timestamp_created": 1512503012, "timestamp_updated": 1512503012, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.507187", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38070903": {"recommendationid": "38070903", "author": {"steamid": "76561198278736442", "num_games_owned": 33, "num_reviews": 8, "playtime_forever": 136, "playtime_last_two_weeks": 0, "last_played": 1512684908}, "language": "english", "review": "To me this game is like a tiwst on zelda. I love everything about this game so no real complaints. I give it an 9/10", "timestamp_created": 1512444550, "timestamp_updated": 1512444550, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.507187", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38063669": {"recommendationid": "38063669", "author": {"steamid": "76561198328629655", "num_games_owned": 352, "num_reviews": 32, "playtime_forever": 131, "playtime_last_two_weeks": 0, "last_played": 1512514372}, "language": "english", "review": "This is a fun reimagining of the original zelda. Havent played too long yet, Ive beat the second dungeon, tried the third, think i need a candle to make the boss a bit more managable and havent found the first dungeon one yet. It has some cool ideas like the cooler that lets you carry around extra hearts for use when you need them. Instead of a sword you have a shotgun and upgrading it adds more pellets. If you are a retro enthusiast like myself or just enjoyed the original zelda you will not be dissapointed. Looking forward to completing my first playthgrough and trying hardcore mode or rougelite mode.", "timestamp_created": 1512415451, "timestamp_updated": 1512415451, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.507187", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38038916": {"recommendationid": "38038916", "author": {"steamid": "76561197983990724", "num_games_owned": 3745, "num_reviews": 37, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1505104918}, "language": "english", "review": " Got this for free and dev seems like a nice guy so have a +1", "timestamp_created": 1512322452, "timestamp_updated": 1512322452, "voted_up": true, "votes_up": 6, "votes_funny": 2, "weighted_vote_score": "0.491537", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "36743279": {"recommendationid": "36743279", "author": {"steamid": "76561198273381477", "num_games_owned": 31, "num_reviews": 10, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1512147305}, "language": "english", "review": "I always wanted to play zelda xd :>", "timestamp_created": 1511377929, "timestamp_updated": 1511377929, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.507187", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36385881": {"recommendationid": "36385881", "author": {"steamid": "76561198321712805", "num_games_owned": 59, "num_reviews": 32, "playtime_forever": 121, "playtime_last_two_weeks": 0, "last_played": 1509771437}, "language": "koreana", "review": "병1신같지만.. 아니.. 병1신이지만 재밌어", "timestamp_created": 1510185887, "timestamp_updated": 1510185887, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36177609": {"recommendationid": "36177609", "author": {"steamid": "76561198083036421", "num_games_owned": 77, "num_reviews": 8, "playtime_forever": 9, "playtime_last_two_weeks": 0, "last_played": 1509488611}, "language": "english", "review": "Very old style game. Good for a challenge but not so interesting just to play through for fun. Large room for exploration and a difficulty setting that starts and hard and goes up. Not for everyone, but certainly good for those looking for a retro game.", "timestamp_created": 1509488617, "timestamp_updated": 1509488617, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.492813", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36060343": {"recommendationid": "36060343", "author": {"steamid": "76561198121545884", "num_games_owned": 29, "num_reviews": 11, "playtime_forever": 164, "playtime_last_two_weeks": 0, "last_played": 1509999248}, "language": "english", "review": "Got this game for .50 cents. Great game, from how much I have played so far. Game worth a buy on sale, but I don't know if its worth the full $5.", "timestamp_created": 1509149709, "timestamp_updated": 1509149709, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.492813", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35996370": {"recommendationid": "35996370", "author": {"steamid": "76561197985993195", "num_games_owned": 1272, "num_reviews": 59, "playtime_forever": 229, "playtime_last_two_weeks": 0, "last_played": 1506021459}, "language": "brazilian", "review": "Link com uma Shotgun!\nhttps://www.youtube.com/watch?v=y-isF3pOWyw", "timestamp_created": 1508960731, "timestamp_updated": 1508960731, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "35681775": {"recommendationid": "35681775", "author": {"steamid": "76561197994002775", "num_games_owned": 3223, "num_reviews": 656, "playtime_forever": 83, "playtime_last_two_weeks": 0, "last_played": 1497120575}, "language": "english", "review": "Prett sweet game!\nI gotta admit, the games gives you impressions of the old zelda games\naltough i hoped that the soundtrack would be catchy like the soundtrack of zelda\nbut its really a nice top bottom dungeon game!\n\nhttps://www.youtube.com/watch?v=R9i2-HZrh1o", "timestamp_created": 1507859065, "timestamp_updated": 1507859065, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.460279", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "35557435": {"recommendationid": "35557435", "author": {"steamid": "76561198077898343", "num_games_owned": 295, "num_reviews": 19, "playtime_forever": 441, "playtime_last_two_weeks": 0, "last_played": 1510468130}, "language": "english", "review": "This is my second go at reviewing this game. At first, I gave it a negative review because of the problems I had and bugs I encountered. Since that review was posted, the developer addressed the issues and has pledged to fix them. \n\nWith that having been done, I can now say that this is a game worth playing. It's a fun tribute to the classic NES era of gaming. The game is chock full of challenging obstacles and enemies, and requires plenty of patience, dedication, and a healthy amount of trial-and-error to achieve success. \n\nMy only real complaints now are with the checkpoints, which seem random and could stand to be more forgivingly placed. I'm also still not too sure about my overall objective. Also, the keyboard controls are still awkward, but plug in a controller and you'll be good to go. \n\nAll in all, this is a really fun game.", "timestamp_created": 1507417687, "timestamp_updated": 1507439508, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.546158", "comment_count": "7", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35504276": {"recommendationid": "35504276", "author": {"steamid": "76561198244923904", "num_games_owned": 9, "num_reviews": 1, "playtime_forever": 407, "playtime_last_two_weeks": 0, "last_played": 1507312265}, "language": "english", "review": "An excellent Zelda-esque shooter with good design & decent sound. Hits all the high points of a classic game. Would highly recommend.", "timestamp_created": 1507238461, "timestamp_updated": 1507238461, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35135328": {"recommendationid": "35135328", "author": {"steamid": "76561198261723136", "num_games_owned": 116, "num_reviews": 2, "playtime_forever": 6, "playtime_last_two_weeks": 0, "last_played": 1506106750}, "language": "english", "review": "I've only played a very little so far but here are my first impressions\n\n+ The art style looks great\n- Some textures do repeat too much, texture variety goes a long way in making a much more appealing art style. Not something to rework the whole game over, just something to take on board\n+ Sound is pretty good, evrything sounds like it belongs\n- Very few options, even the option between full screen and windowed would be nice\n+ Although for what it is the keyboard layout is fine, nothings too far away nor cramped for an unconventional layout.\n- Moving the player seems very inexact, it's difficult to describe, haven't had a chance to play with a controller just though.\n\nEven in spite of these the game is certainly fun, even if i'm not very good at it", "timestamp_created": 1506107178, "timestamp_updated": 1506107178, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.507187", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35091138": {"recommendationid": "35091138", "author": {"steamid": "76561198286200379", "num_games_owned": 1521, "num_reviews": 1443, "playtime_forever": 541, "playtime_last_two_weeks": 0, "last_played": 1503664560}, "language": "brazilian", "review": "Legalzin", "timestamp_created": 1505937340, "timestamp_updated": 1505937340, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35087585": {"recommendationid": "35087585", "author": {"steamid": "76561198025651149", "num_games_owned": 894, "num_reviews": 27, "playtime_forever": 26, "playtime_last_two_weeks": 0, "last_played": 1505225069}, "language": "german", "review": "Zelda 1... mit Schrotflinte\n\nFirst Impression (1. Videohälfte): https://youtu.be/QNwZsf_6ANw\n\nPro:\n- versucht dicht am großen Vorbild zu sein\n- offene Welt zum selbst erkunden\n- nimmt sich nicht ernst\n\nContra:\n- versteift sich zu sehr auf seine Wurzeln\n- außer der Schrotflinte kaum eigene Ideen erkennbar", "timestamp_created": 1505925106, "timestamp_updated": 1505925106, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35075761": {"recommendationid": "35075761", "author": {"steamid": "76561198067608206", "num_games_owned": 3035, "num_reviews": 126, "playtime_forever": 168, "playtime_last_two_weeks": 0, "last_played": 1505872373}, "language": "brazilian", "review": "Imagine The Legend of Zelda do Nintendinho. Agora, tire toda a rica ambientação e história de Hyrule, e substitua por um prólogo sem pé nem cabeça onde um cara estava procurando uma roda para seu carro num ferro velho, e foi abduzido por alienígenas e levado para uma ilha bizarra, e peças da roda que ele queria foram espalhadas pelo mundo, lotado de mortos-vivos. E pra que uma espada, se uma escopeta faz o trabalho melhor?\n\nShotgun Legend é um jogo bem retrô em muitos aspectos, utilizando a visão top-down clássica, a jogabilidade meio travada, e o mínimo de botões. O combate não é difícil, mas é dificultado pela limitação na mobilidade do personagem, que também só pode atirar no sentido em que anda - como nos jogos antigos. Tudo fica mais difícil ainda pela escopeta dar mais dano a inimigos mais próximos, então você é incentivado a se colar em risco para matar inimigos rapidamente.\n\nFora isso, se você morrer (e acredite, você vai morrer), terá que aguentar a tela de Game Over para te desmoralizar, e depois dar \"Continue\" e voltar do ultimo save automático, que ocorre entre certas telas com frequência. Ao morrer e continuar, todos os inimigos respawnam no mundo, ou seja, mais emoção e chance de morrer!\n\nO jogo contém vários elementos do clássico também, onde você entrará em dungeons, procurará chaves, adquirirá itens que irão permitir o acesso de novas áreas e salas anteriormente inacessíveis, e ao final da dungeon enfrentará um chefe, que te dará uma vida extra, e um pedaço da tão sonhada roda.\n\nEssa é a proposta básica do jogo, colocada de forma bem crua, com sons desagradáveis, música simples, e uma roupagem bem cafona - mas divertida!\n\nFora isso, a primeira habilidade que você pega é a skill Doppelganger, que ao ser usada, irá habilitar/desabilitar o cooperativo local, portanto você pode trazer um clone seu para a aventura em coop para 2 jogadores, tendo ambos uma mesma vida compartilhada!", "timestamp_created": 1505872869, "timestamp_updated": 1505921084, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.618768", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35074581": {"recommendationid": "35074581", "author": {"steamid": "76561198107730274", "num_games_owned": 33, "num_reviews": 1, "playtime_forever": 34, "playtime_last_two_weeks": 0, "last_played": 1505866641}, "language": "german", "review": "Shotgun Legend ist ein würdiges Tribut zu der Legend of Zelda Reihe, ein Haufen Quests, witzige Gegner. \nIch würde jedem Fan von Legend of Zelda empfehlen das Spiel zu probieren. Die Grafik ist def. an die früheren Teile orientiert, was in keinster Weise stört, es ist sehr ästhetisch. Alles in allem ein sehr gelungenes Spiel!", "timestamp_created": 1505866603, "timestamp_updated": 1505866603, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35067351": {"recommendationid": "35067351", "author": {"steamid": "76561198044713299", "num_games_owned": 470, "num_reviews": 21, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1505835896}, "language": "english", "review": "Unfinished game is unfinished!\nThis is NOT a game woth $9.99 USD.\nIt reminded me of why I avoid Early Access games.\n\nK&M controls are shite.\nNot able to rebind controls.\nNo explanation of what key equates to what function.\nNo explanation for gamepad key bindings either.\n\nPlayed using K&M and gamepad. \nThe idea of LoZ with a shotgun sounded awesome.\nI don't remember LoZ having so little fun.\nDev said it was hard and it is.\nI don't mind hard, if it's fun, and I fell like I'm getting somewhere with it.\n\n15 minutes was enough wasted time.\nRequested a refund.", "timestamp_created": 1505836996, "timestamp_updated": 1508369478, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.430321", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35059776": {"recommendationid": "35059776", "author": {"steamid": "76561197994700960", "num_games_owned": 229, "num_reviews": 20, "playtime_forever": 281, "playtime_last_two_weeks": 0, "last_played": 1508254822}, "language": "english", "review": "I finished and collected everything up to the final unfinished level in just over 3 hours. I will admit I did get confused a few times so it can definitely be finished in under 3 hours. I did enjoy it and would reccomend it but not at the current price. I payed $1 and if I had payed more than $3 I would not be reccomending it at all.  I understand the developer has put a lot of time into this and when I had a question he replied almost instantly in the forums but even with the last dungeon included this just doesn't feel like a game that should cost $10. \n\nThe game itself was enjoyable and did make me scratch my head a few times but the enenies were lackluster at best. The only enemys that seem to know you're even there are the ones that shoot projectiles. All the others including bosses just randomly move around as if you don't even exist. The Boss battles themselves are way too easy as well. I only found out I was even fighting a boss on more than one occasion after defeating them. I just thought it was a new enemy being introduced. \n\nThe map is basically useless as well in my opinion. It may be more useful if it wasn't the size of a thumnail and introducing  a second map only made things more confusing. I enetered a dungeon at one point that I had already been in but had to turn back because I needed another item. When I returned later I turned back again thinking I had already finished it but that was only becasue the map was completed. An X or something on the map once completed would probably help or just have seperate dungeon maps in each dungeon. I honestly don't understand the second map at all unless I'm missing something.\n\nAll in all I'm glad this was on sale for a dollar. I had fun but can't ever see myself going back to play it again.", "timestamp_created": 1505807046, "timestamp_updated": 1505807046, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35059715": {"recommendationid": "35059715", "author": {"steamid": "76561198022041814", "num_games_owned": 53, "num_reviews": 13, "playtime_forever": 2059, "playtime_last_two_weeks": 54, "last_played": 1514672941}, "language": "english", "review": "If you haven't even seen the original zelda you will probably be very confused with this game, especially in the very beginning.  That said it definitely gets the feeling of the original zelda down.  The monsters in the beginning that pop out of the ground to attack are a pain in the butt to kill and I died many times to them before I just gave up trying to kill them and ran on by instead.  Honestly the blobs and skeletons are easier to deal with than the burrowed ones.\n\nAs of the posting most of the dungeons are not very complex, by far the best dungeon is the fish shaped one (number 5).  It is less linear than the other dungeons and makes you solve a maze to get through (albeit a simple one).  The final dungeon was difficult but not impossible and it still allowed for more surprises from the developer.\n\nUsing a shotgun to fight definitely takes some practice because of the random spread and how it doesn't knock enemies away like swords do in other games.  However the shotgun mechanic creates a good risk/reward situation everytime you engage an enemy.  Another good thing to see is that the NPCs will defend themselves if you attack them.  And it will hurt when they fight back.\n\nWhen I have seen problems with the game, the developer was quick to fix any issues like crashes or problem areas.  For example I commented that when you get a rim fragment it shouldn't teleport you to the entrance of the dungeon becuase there might still be things in the place you need to collect.  So he fixed it almost the next day.\n\nI know this review seems to be scatter brained but that's probably becuase I just need to improve my writing.\n\nSome improvements I recommend if the developer has time and resources to do them.\n[list]\n[*]-Most dungeons could use a few more updates to make them harder to solve.  Not by adding more enemies but forcing the player to think more about how to get through them instead of the linear setup for most underground areas.\n[*]-Leave more clues in the world about the background story.  It's an action game and story isn't critical but it can add more appeal if you have time.\n[*]-Add more hidden areas in the overworld.  Not necessarily for more equipment (unless you want to) but maybe some collectibles you can get an achievement for.\n[*]-Maybe include an in-game timer for people that want to speed run the game.  You can show the time for completion after the credits and end story dialog.  Just have the time start when you first appear on the map and then end just as you trigger the ending dialog.\n[/list]\n\nI really recommend this game.\n\n*edited to add bullets and update critiques as changes were made.", "timestamp_created": 1505806693, "timestamp_updated": 1513484489, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.530333", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35057466": {"recommendationid": "35057466", "author": {"steamid": "76561198025967342", "num_games_owned": 183, "num_reviews": 5, "playtime_forever": 200, "playtime_last_two_weeks": 0, "last_played": 1505792970}, "language": "english", "review": "I would put this on par with the original legend of zelda. However there are some things that do need a little fixing as the invisible ghost guys throwing knives should probably be moved to level 8 and the plain wizards that can be seen moved to level 6.", "timestamp_created": 1505793218, "timestamp_updated": 1505793218, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35055190": {"recommendationid": "35055190", "author": {"steamid": "76561197982879578", "num_games_owned": 431, "num_reviews": 2, "playtime_forever": 181, "playtime_last_two_weeks": 0, "last_played": 1505512859}, "language": "english", "review": "(Early Access) I enjoyed playing this game.  As a youngster, I played Zelda on NES.  This does not have the polished feel of that game, but it reminds me of it, but with a shotgun.  The shotgun is satisfying and you get to upgrade the power of it as you go.  It is not overly easy or hard.  \n\nPositives\n- Zelda feel\n- Shotgun\n- Upgraded weapons feel satisfying and add to exploration\n- Save is enabled at just the right times\n\nNegatives\n- Weak Story with very little purpose\n- I get lost and forget what levels I conquered (see recommendations)\n\nRecommendations:\n- Difficulty of each dungeon should progress and feel fluid \n- Create a real town with friendly people\n- More sidequests?  \n", "timestamp_created": 1505779767, "timestamp_updated": 1505779767, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.507187", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "35041280": {"recommendationid": "35041280", "author": {"steamid": "76561198077444306", "num_games_owned": 673, "num_reviews": 35, "playtime_forever": 65, "playtime_last_two_weeks": 0, "last_played": 1505803949}, "language": "english", "review": "Its a really fun throwback to NES Zelda, but with a shotgun, the plot is silly, the enemies generic, and I have no idea where I'm going...yep feels like an NES classic. Honestly it feels like something that would be on a NES rom and put out years later, and thats in a good way. I think its worth the cash however at the moment not 10 bucks, when more content is added I'd go for 10 bucks for now its more like a 5 dollar product, still a good 5 dollar product I can tell the creator put honest to god effort into this game unlike the deluge of crap going through steam. \n\nI rate this Game 6 out 10 Shotgun shells\n\nA well above average game, nice to play, but currently needs more content to get up to a 7 or 8 or even above\n", "timestamp_created": 1505723210, "timestamp_updated": 1505723210, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "35038596": {"recommendationid": "35038596", "author": {"steamid": "76561198307832415", "num_games_owned": 1759, "num_reviews": 12, "playtime_forever": 109, "playtime_last_two_weeks": 0, "last_played": 1512896056}, "language": "english", "review": "It's fun. It's got charm. The controls may be better with more than four directions but it is a zelda tribute and Zelda only had four direction movement. This could be a great game when complete. Get it now before it goes full price though.", "timestamp_created": 1505708031, "timestamp_updated": 1505708031, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34973103": {"recommendationid": "34973103", "author": {"steamid": "76561198190230574", "num_games_owned": 72, "num_reviews": 6, "playtime_forever": 232, "playtime_last_two_weeks": 2, "last_played": 1514214069}, "language": "brazilian", "review": "Zelda com tio sergio e shotgun nervosa. gg", "timestamp_created": 1505485369, "timestamp_updated": 1505485369, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.470588", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34958429": {"recommendationid": "34958429", "author": {"steamid": "76561198034146831", "num_games_owned": 1984, "num_reviews": 14, "playtime_forever": 202, "playtime_last_two_weeks": 0, "last_played": 1505425215}, "language": "english", "review": "A nifty little Zelda-inspired action adventure. It took me a bit over 3 hours to reach the 10th (final) dungeon, which at the time of writing is incomplete.\n\nPros:\n+Shotgun is fun, and encourages getting close to enemies\n+Some non-linearity\n+Map is easy to navigate, but big enough to give that exploration feeling\n\nCons:\n-Too many enemy types rely on random movement to make them harder to shoot\n-Mages bouncy projectiles are somewhat annoying\n-Invisible mages are _really_ annoying", "timestamp_created": 1505425751, "timestamp_updated": 1505425751, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34909879": {"recommendationid": "34909879", "author": {"steamid": "76561197980715227", "num_games_owned": 327, "num_reviews": 5, "playtime_forever": 141, "playtime_last_two_weeks": 0, "last_played": 1506048829}, "language": "english", "review": "Excellent game. Original Zelda with a Shotgun. I'm thoroughly enjoying it so far.", "timestamp_created": 1505257181, "timestamp_updated": 1505257181, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.428236", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34513801": {"recommendationid": "34513801", "author": {"steamid": "76561197967576610", "num_games_owned": 115, "num_reviews": 20, "playtime_forever": 153, "playtime_last_two_weeks": 0, "last_played": 1504213939}, "language": "english", "review": "If you played the original Zelda for the NES, you will find this game similar. As the dev refers to it, it is Zelda with a shotgun. The game can be very frustrating at times and I have no idea wher I am going, but I am still loving the game. Great job.", "timestamp_created": 1503779856, "timestamp_updated": 1503779856, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "34447996": {"recommendationid": "34447996", "author": {"steamid": "76561197965709530", "num_games_owned": 945, "num_reviews": 73, "playtime_forever": 762, "playtime_last_two_weeks": 0, "last_played": 1507787140}, "language": "english", "review": "I blast my way threw creatures of all imagination however I lack purpose and goal. Shooting the shotgun and the world is done really nice with many dungeons to explore.\n\nI would have loved to have someone to play this with coop.", "timestamp_created": 1503527395, "timestamp_updated": 1503527395, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.472855", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "34430279": {"recommendationid": "34430279", "author": {"steamid": "76561198299753121", "num_games_owned": 24, "num_reviews": 15, "playtime_forever": 37, "playtime_last_two_weeks": 0, "last_played": 1505588078}, "language": "polish", "review": "Gra bardzo fajna tylko nie wiem o co chodzi łaże se po mapie i zabijam wrogów i nic xD", "timestamp_created": 1503464715, "timestamp_updated": 1503464715, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "34426886": {"recommendationid": "34426886", "author": {"steamid": "76561198009037942", "num_games_owned": 355, "num_reviews": 57, "playtime_forever": 69, "playtime_last_two_weeks": 0, "last_played": 1505092806}, "language": "english", "review": "When given a key I always go into the game blind, not knowing what to expect....\n\nthis game hits my memories like a sack of goombas, back to the old NES days of kid icarus and other 8 bit legends, but it hits the best game of my life, my childhood, where my gaming all started... Zelda, I have not even touched the surface of my 8 bit adventure when I decided to turn off the recording and play on my own, this game tho I may not suggest it's price tag... I do say the game is a lot of fun, it has old school deign with tracking smooth mechanics to boot, and the multiplayer feature is a BRILLIANT idea, I just wish I had someone to play it with.\n\nBe prepared if you are an old fart or just love retro games, because it is your classic Link Story with a twist, you don your pickup truck and shot gun and head out on an otherworldy adventure out to ... collect a hubcap. Redneck... it is time to meet your destiny!\n\nthis is also a game I refused to paste my video in, because with all this information you do not need to see me play it to know you want it!", "timestamp_created": 1503448381, "timestamp_updated": 1503448381, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.443829", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "34403281": {"recommendationid": "34403281", "author": {"steamid": "76561198069613158", "num_games_owned": 921, "num_reviews": 14, "playtime_forever": 8, "playtime_last_two_weeks": 0, "last_played": 1503354841}, "language": "brazilian", "review": "Se você gosta de Zelda e old school games em geral, mas também gosta de dar uns tiros com espingarda, por favor compre esse jogo, não vai se arrepender.\n\nIf you like Old school games, Zelda games and simillar, but in another hand you like to shot with shotguns, please, buy this. Very funny and nice to play.\n\n", "timestamp_created": 1503351556, "timestamp_updated": 1503351556, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "34354960": {"recommendationid": "34354960", "author": {"steamid": "76561198283763713", "num_games_owned": 94, "num_reviews": 10, "playtime_forever": 6, "playtime_last_two_weeks": 0, "last_played": 1503163071}, "language": "english", "review": "Thanks for giving me a key to play the game the game is very good but it lacks optimization for the game I am going to more than 60 fps and sometimes I know that stuck and also a Spanish translation would be well and I will probably do a gameplay for YouTube", "timestamp_created": 1503163117, "timestamp_updated": 1503163117, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "33963222": {"recommendationid": "33963222", "author": {"steamid": "76561198131130492", "num_games_owned": 662, "num_reviews": 15, "playtime_forever": 1234, "playtime_last_two_weeks": 0, "last_played": 1501658095}, "language": "english", "review": "(I leave my games open to get trading cards, I've actually played this 3 hours tops)\n\nThis game is a gem for a remake of a classic. It is difficult from the brute force of the enemies. If you're lost and stumble upon somewhere you keep dying at, chances are you shouldn't be there yet. Take the dungeons in order, stop at shops regularly, remember where the Med Kits are on the map (Which heals you, fills your health inventory, and saves your game) and all will be fine. \n\nThat being said, Spoiler alerts (Even though this game obviously isn't one to play for the storyline)\n\nPros: \nClassic feel with smooth gameplay (nostalgia)\nController support\nNo bugs to report (This reviewed before Dungeon 10 was finished)\nThe progression on the map can be felt by the enemies, and they do get harder to fight even though you're getting stronger, so the balance is there.\nIt's the original Zelda, with a SHOTGUN!!!\n\nCons:\nLacking in puzzle aspect (almost all dungeons and secrets are very straightforward)\nStoryline very sparatic and doesn't really match the game at all (You're a redneck with a shotgun... fighting wizards, giant crabs, and skeletons... and it talks about aliens, like whaaa?)\nSome items feel pointless (like they're just there so you can't go out of sequence for levels, then you never have to use them again), and getting a master map over halfway through the game just feels lazy. \nThe main map (Of this side of the island... hinting that there's another side, but there isn't yet) Is very lacking in puzzles, there was one thing that really wasn't a puzzle, just had to force your way through, and everything else is just waiting for one item to pass that area. (Yes, I already said puzzle aspect, but it's lacking so much that I feel it necessary to mention it again)\n\nOverall rating IMO: 6/10\nI bought it on sale so I feel it was worth what I paid, but I can understand it being $10.\nIf you like older games then this is definitely for you\n", "timestamp_created": 1501646808, "timestamp_updated": 1501646808, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.504945", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33524984": {"recommendationid": "33524984", "author": {"steamid": "76561197997741024", "num_games_owned": 6474, "num_reviews": 38, "playtime_forever": 539, "playtime_last_two_weeks": 0, "last_played": 1499986383}, "language": "english", "review": "I was a little wary of all of the positive reviews at first, but let me say that this is a game that really does grow on you.\n\nWhen I first kicked-off the game I had a basic knowledge of the NES Legend of Zelda games, but I found myself dying a fair bit, more than I expected. And it wasn't until I persisted and got to the first dungeon (after having died a fair bit in the Level 4 dungeon without realising it!) - that I began to understand what the game was about.\n\nSuffice it to say, that as a tribute, this does indeed check all the right boxes. It's still in early access as I write this, but I was lucky enough to be able to talk to the developer as I was playing, and provided a little feedback, and he is adamant that he takes all feedback into consideration, which to me is already a win.\n\nI have currently gotten to the point where I am in the final dungeon, which in its present state is only three rooms, but this is actively being worked-on, and I am told will be done fairly soon, at which point I would love to come back and try again.\n\nAll of this said, there are a couple of points I hope are addressed in the near future:\n\n- Smart Bomb / Wave Cannon sound effects are a lot louder than expected, and can put folks off, I have found.\n- When I originally walked through the evil forest to get to what I thought was the next dungeon, I found I was mistaken, and getting back was a nightmare, as every time I died it reset me back to that dungeon. Cue 20 minutes of me desperately trying to make it out alive..! Not sure whether I should just suck that one up though...\n- Final Dungeon location is not immediately obvious, nor was the hint to its location (which I never found, but was told about)\n- Grid-based movement is a little cumbersome when fighting enemies in tight corners, but not sure how you could get around this.\n- Some respawn locations are right on top of enemies, so when you restart with three hearts, unless you are moving and shooting immediately, you often lose some health.\n\nOther than that, a very enjoyable title, and one I fully intend on playing again when it has been finished!\n\n୧༼ಠ益ರೃ༽୨", "timestamp_created": 1499992102, "timestamp_updated": 1499992102, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.597364", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "33315128": {"recommendationid": "33315128", "author": {"steamid": "76561198053779952", "num_games_owned": 356, "num_reviews": 8, "playtime_forever": 711, "playtime_last_two_weeks": 174, "last_played": 1514315615}, "language": "english", "review": "i dont alway support idea game that look like it made by older game but i say this is ok. i do enjoy this even it is a rip off of older game. it still fun to play.", "timestamp_created": 1499355238, "timestamp_updated": 1499355238, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.451505", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "33259483": {"recommendationid": "33259483", "author": {"steamid": "76561197989126693", "num_games_owned": 85, "num_reviews": 1, "playtime_forever": 190, "playtime_last_two_weeks": 0, "last_played": 1500930620}, "language": "german", "review": "Wer kein Problem mit der Grafik hat und das erste Zelda oder ähnliche Spiele mochte, dem wird wohl auch dieses Spiel gefallen. Auf dem einfachen Schwierigkeitsgrad kann man es relativ zügig durchspielen, während der Hohe dank dauerhaftem tot durchaus seine Zeit und ein wenig spielerisches Geschick (oder einfach nur viel Glück) benötigt. Aufgrund des Early Access Status hat es noch den einen oder anderen Fehler, welche beim melden allerdings schnell vom Entwickler behoben werden. \nFunktioniert bei mir mit Wine auch problemlos unter Debian.", "timestamp_created": 1499227621, "timestamp_updated": 1499227621, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "32840616": {"recommendationid": "32840616", "author": {"steamid": "76561198277984478", "num_games_owned": 361, "num_reviews": 134, "playtime_forever": 133, "playtime_last_two_weeks": 0, "last_played": 1505337525}, "language": "english", "review": "A pretty good homage to the classic 8-Bit LOZ game on NES and FAmicom, except you trade a sword for a shotgun ^^\n\nIt's well made, the world seems pretty large - and the look of the graphics is perfect for this style of game \n\nWorth a look, the developer has put alot of work into this homage !", "timestamp_created": 1498534477, "timestamp_updated": 1498590330, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.412670", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "32520674": {"recommendationid": "32520674", "author": {"steamid": "76561198072840320", "num_games_owned": 129, "num_reviews": 4, "playtime_forever": 103, "playtime_last_two_weeks": 0, "last_played": 1496093257}, "language": "english", "review": "Challenging yet perfectly tribute-tastic!\n\nYou'll find if you remember the \"original\" Shotgun Legend will be something you're quick to get going in. If you don't recall the \"Original\" well, you may find yourself a bit perplexed. Either way, it's quite nostalgic, challenging, and most importantly - FUN!\n\nAs a streamer it was amazingly neat to have its creator pop into stream and chat about the game and listen to feedback.\n\nIf you're looking for something fun and retro, this is a gem.", "timestamp_created": 1497740810, "timestamp_updated": 1497740810, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "32357796": {"recommendationid": "32357796", "author": {"steamid": "76561198168257345", "num_games_owned": 357, "num_reviews": 12, "playtime_forever": 321, "playtime_last_two_weeks": 0, "last_played": 1497445436}, "language": "english", "review": "Great Legend of Zelda game, you can check out my play here: https://www.youtube.com/watch?v=psjWbVNGLYE\n\nI've been spending way too much time on this altogether. It's not perfect, but it's also still being worked on. I've contacted the dev several times and he's very receptive to feedback. I expect more great things out of Shotgun Legend.", "timestamp_created": 1497241689, "timestamp_updated": 1497246299, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "32329534": {"recommendationid": "32329534", "author": {"steamid": "76561198053422627", "num_games_owned": 1081, "num_reviews": 316, "playtime_forever": 82, "playtime_last_two_weeks": 0, "last_played": 1497134386}, "language": "english", "review": "Okay people, when the developer handed me a free copy of this game for review for exposure on my Youtube channel, I looked at it and the price tag of $9.99 USD with a feeling of \"pffft.  Legend of Zelda huh?  Right!  ...$10 huh?  Really??\"\n\nWatch my first impressions review and experience with this outstanding retro style game HERE:\nhttps://www.youtube.com/watch?v=yQPbhw_EZag\n\nThose doubts after my first livestream first impressions have been more than erased by the sheer amount of FUN this game delivers!  This game feels and behaves just like you'd expect a Legend of Zelda shooter to!  It's awesome fun, and a lot of that fun, much like an old school Zelda classic is exploring the world, the dungeons, and figuring out how to best defeat all the different monsters and bosses that you will encounter.\n\nFinding new weapons and items is super fun as well, and even how best to use them in ways you might never expect to open secret walls and doors is much more exciting than you might expect a game with graphics this retro to be!\n\nIt's pretty hard to grade this game really precisely without knowing how many hours of content it will deliver, but at a $10 price tag I feel pretty confident in my first impressions video scoring where I calculated a whopping 89% score for this game, even considering what some may thing is expensive for this kind of a game!  I also give it a high recommend, especially to those of you who enjoy an old school game with classic gameplay that this game delivers in abundance!  \n\nHigh praise to the developer!  Thanks for an outstanding classic Zelda style game done very well, and I can certainly feel the passion you poured into this game!  Awesome stuff!\n\nNOTE: A controller, while not required is highly recommended as well for this game!", "timestamp_created": 1497135487, "timestamp_updated": 1497136677, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.507610", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "32271959": {"recommendationid": "32271959", "author": {"steamid": "76561198069477033", "num_games_owned": 618, "num_reviews": 22, "playtime_forever": 161, "playtime_last_two_weeks": 0, "last_played": 1497388056}, "language": "french", "review": "Autant habitellement les remake de titres legendaires comme zelda sont loupé ou au contraire de tel plagiat que'on prefere jouer a l'original, autant la le developpeur est parti dans un delire pleinement assumé nous offrant un bel hommage a ce titre mythique qu'est Legend Of Zelda (nes)\n\nEn gros pour faire simple on as un zelda mais en lieux et place de la master sword on as un shotgun, aussi difficile qu'un zelda dont il reprends tout les codes en y ajoutant une touche personelle sincerement si vous avez aimé l'opus original foncez c'est juste magique :)\n\nhttps://youtu.be/5mg--7uXPSc", "timestamp_created": 1496946608, "timestamp_updated": 1496946608, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "32258850": {"recommendationid": "32258850", "author": {"steamid": "76561198154299846", "num_games_owned": 375, "num_reviews": 276, "playtime_forever": 13, "playtime_last_two_weeks": 0, "last_played": 1496882610}, "language": "english", "review": "I got this game from the dev and was windering if I should even bother, truth is the game pays good homage to Zelda back in the days of Nintendo! But if you are looking for a little adventure and fun, what better wat to do this game then with a SHOTGUN!", "timestamp_created": 1496882744, "timestamp_updated": 1496882744, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.480833", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "32231137": {"recommendationid": "32231137", "author": {"steamid": "76561198082075176", "num_games_owned": 95, "num_reviews": 6, "playtime_forever": 11, "playtime_last_two_weeks": 0, "last_played": 1497652785}, "language": "english", "review": "Great little game if you enjoy running around little old school characters. With the little time I had with the game, I'm enjoying it. I wish I had a bit more health to start with, but other than that, great game. Easy to play. Could easily spend a lot mindless time wasting playing this. Brings back my old Zelda days!", "timestamp_created": 1496801836, "timestamp_updated": 1496801836, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "32196933": {"recommendationid": "32196933", "author": {"steamid": "76561198103252321", "num_games_owned": 386, "num_reviews": 9, "playtime_forever": 59, "playtime_last_two_weeks": 0, "last_played": 1496568977}, "language": "english", "review": "Shotgun legend is a tribute to the legend of zelda. It is early access, has some problems, but most are subject to change. In my honest opinion it is the best zelda esc game on the market.", "timestamp_created": 1496661682, "timestamp_updated": 1496661682, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.454545", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "32175270": {"recommendationid": "32175270", "author": {"steamid": "76561198066693064", "num_games_owned": 262, "num_reviews": 6, "playtime_forever": 133, "playtime_last_two_weeks": 0, "last_played": 1496357974}, "language": "brazilian", "review": "Jogo Bom, realmente cumpre sua promessa de ser um tributo ao tão lindo Zelda <3\n\nPros:\n\n- Realmente parecido com o primeiro Zelda\n- Boa Jogabilidade\n\nCons:\n\n- Chefões não muito criativos\n\nEu gostei do game no geral, mas eu sou suspeito ja que gosto de games retro e amo Zelda, mesmo assim não sei se vale o seu preço, talvez com um descontinho seja melhor!", "timestamp_created": 1496579567, "timestamp_updated": 1496579567, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "32112982": {"recommendationid": "32112982", "author": {"steamid": "76561198282929183", "num_games_owned": 94, "num_reviews": 2, "playtime_forever": 23, "playtime_last_two_weeks": 0, "last_played": 1496083658}, "language": "spanish", "review": "Ante todo agradecer a Jonathan Tindell y a Wastebasket Games por adelantarme una KEY del juego que se estrena el próximo jueves día 1.\n \n¿Os imagináis si link en el primer Legend of Zelda para NES en lugar de la clásica espada llevara una escopeta recortada?............. Pues esta es la respuesta ;)\n \nShotgun Legend nos sitúa frente a un homenaje en toda regla al clásico juego de NES, no en vano así se promociona el mismo, y la verdad es que razón no le falta.\n \nTomamos el control de nuestro personaje recortada en mano, y le disparamos a todo bicho que se nos cruce en el camino, aunque eso sí, pese a la recortada el juego es difícil. Los enemigos son bastante resistentes, y se ha limitado la visibilidad en las mazmorras, siendo más complejo localizar a los enemigos y las trampas en cada habitación, por lo que moriremos irremediablemente una y otra vez hasta aprendernos las habitaciones de memoria, como en los viejos tiempos.\n \nGráficamente se muestra como un clásico de 8 bits, sin mucho que achacar en este aspecto, tiene su gracia la animación de los cartuchos tras cada disparo.\n \nLa música es agradable, y los efectos de sonido están bien, sobre todo la contundencia de la recortada al disparar.\n \nEl control (una vez configurado) es bastante sencillo y no requiere de muchos botones o combinaciones extrañas. Y es que el control es su principal talón de aquiles, ya que aunque se indica “COMPATIBILIDAD TOTAL CON CONTROLADOR”, prácticamente me he pasado medio video ingeniandomelas para hacerlo funcionar. Llama mucho la atención que mientras en los menus funciona correctamente, en el juego no funciona nada, y se trata de una mando con los drivers del de xbox 360, con el que prácticamente todos los juegos funcionan perfectamente.\nTambién se echa en falta la posibilidad de configurar la disposición de los botones desde el juego, ya que el estándar por defecto en teclado usa las flechas para moverse, y los botones A,Z,S,X, convirtiéndose en una configuración muy muy rara, casi como la que diseñe yo mismo para Destiny Emeralds XD\n \nSolo me queda agradecer de nuevo por la KEY, y animaros a que lo probéis en Steam el próximo día 1 de Junio.", "timestamp_created": 1496341978, "timestamp_updated": 1496341978, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.520548", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "32107705": {"recommendationid": "32107705", "author": {"steamid": "76561198016432817", "num_games_owned": 256, "num_reviews": 2, "playtime_forever": 49, "playtime_last_two_weeks": 0, "last_played": 1496108854}, "language": "english", "review": "Slipped back to my NES days while playing this game. Felt like a true game from the past. I'm still playing it but like what I see so far.", "timestamp_created": 1496325717, "timestamp_updated": 1496325717, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.419845", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "32106770": {"recommendationid": "32106770", "author": {"steamid": "76561198310818587", "num_games_owned": 751, "num_reviews": 14, "playtime_forever": 95, "playtime_last_two_weeks": 1, "last_played": 1513953821}, "language": "english", "review": "Ah man Shotgun Legend. I was able to get a code from the wonderful dev Jonathan Tindell. I entered the game kinda sceptical about what I was getting myself into but I delve into it anyways and while my expectations were low the game was actually really fun. I somehow did better in One Life mode than I did in normal mode.\n\n~Pros~\nPlays like an old Zelda game!\nOption to make the game look more or less like an old TV or completely getting rid of the TV Effect.\nThe Skeletons aren't Castlevania style skeletons (THANK GOD!)\nReally fun time passer.\nGreat Soundtrack\n~Cons~\nNo way to speed up or just flatout skip the beginning story line cutscene. \n\nFinal Verdict - 8/10 Stays true to the old Zelda style while also putting its own twist on things. I'd say you should give this game a try!", "timestamp_created": 1496322353, "timestamp_updated": 1496322353, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.520548", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "32102179": {"recommendationid": "32102179", "author": {"steamid": "76561197993473791", "num_games_owned": 616, "num_reviews": 52, "playtime_forever": 425, "playtime_last_two_weeks": 0, "last_played": 1496226890}, "language": "japanese", "review": "ベータ版0.8.6をプレイ\n\n[h1]良い点[/h1]\n\n・トラックのリムをジャンクヤードで探していたら何時の間にか異世界へ飛ばされたオッちゃんが主役のFC版「ゼルダの伝説」にインスパイアされた見下ろし型視点の2Dアクションゲーム。オッちゃんは何故がショットガンを持った状態で開始する。きっと常に持ち歩いているのだろう。ストーリーがぷっとんでいるのも長所だと思うんだ。\n\n・システム周りはシンプルで、HP（ハート）が初期は五個あり、メインウェポンとサブウェポンを使い分けつつプレイしていく。他にも攻略に役立つアイテムも。ハートの最大値上昇用のアイテムやサブウェポンはダンジョン等で入手可能。初期のお店で売っているキャンドルは絶対に買おう。いや、マジで。\n\n・自由度が高く序盤で行ける場所が多い。特定のアイテムを所持していた方が攻略が簡単になるが、持っていなくても攻略可能な場所が多いように感じた。\n\n・マップ上にダンジョンが存在していて、中に入るとダンジョンの難易度がレベルで表示されるので、難しいと思ったら後回しにすることも可能。初回プレイ時は気付かなかったので、レベル4のダンジョンを攻略した後にレベル1を攻略したのは私です。難しいわけや。\n\n・初期から所持しているショットガン以外にもサブウェポンや攻略に使用するアイテムが存在している。いくつかのサブウェポンはダンジョンの仕掛けを起動させるのに使用することも。\n\n・ダンジョンやマップ等で特定のアイテムを入手することで武器は強化可能。初期から所持しているショットガンなら、一撃ごとの散弾の数が上がるので単純に攻撃力が上がり使い勝手が良くなる。このおかげで初期装備がゲーム終盤で使い物にならなくなるということが無い。他のサブウェポン等はゼル伝よろしく弾薬の最大所持数がアップする。\n\n[h1]悪い点[/h1]\n\n個人的には特に無いがあえて気になった点を二つほど。\n\n・自由度が高いこともあり、初回プレイ時にはどこから攻略を始めていいかわからない可能性もある。迷うのも楽しみの一つではあるが人にもよるかと。\n\n・慣れるまではショットガンを何処から撃てば敵に当たるのかわかりづらい。序盤は反撃を受けてしまう事が多かった。慣れてくると遠くから当てられるし、逆に近づいて高ダメージ叩きだすことができるので完全に慣れの問題。\n\n[h1]総評[/h1]\n\nここまでに何度も「ＦＣ版ゼル伝」を引き合いに出しているが、「ゼルダの伝説」に影響を受けて開発をされただけはあり、制作陣の「愛」を感じる出来になっているので好きな方は購入して損はないだろう。ちょっとした謎解きなどもある。\n\n逆にＳＦＣ版「ゼルダの伝説」に似ていると思って購入を検討している方は気を付けてほしい。肩透かしを食らうかも。\nちなみにこのレビューを書いている時点ではまだ試していないが主人公のドッペルゲンガーを召喚して協力プレイ（2Ｐ）も可能とのこと。その場合はHP(ハート)はプレイヤー間でシェアされる。友達とプレイするとまた違った楽しみがありそうだ。\n\nプレイ動画をアップしているので、気になった方は[u][url=https://youtu.be/aD7JWW9r8aw]こちら[/url][/u]を参考までにどうぞ。", "timestamp_created": 1496303505, "timestamp_updated": 1496555447, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.651894", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "39353752": {"recommendationid": "39353752", "author": {"steamid": "76561198078484367", "num_games_owned": 225, "num_reviews": 1, "playtime_forever": 55, "playtime_last_two_weeks": 55, "last_played": 1516070584}, "language": "english", "review": "Wonderful original concept, challenging, but not overwhelming.", "timestamp_created": 1515979458, "timestamp_updated": 1515979458, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39342007": {"recommendationid": "39342007", "author": {"steamid": "76561197993213000", "num_games_owned": 229, "num_reviews": 12, "playtime_forever": 117, "playtime_last_two_weeks": 0, "last_played": 1514403704}, "language": "english", "review": "Short version: Imagine the original Legend of Zelda, but instead of a sword, you wield a shotgun.\n\nLong version: Check out my review on Youtube for more info and a final declaration of its worth!\n\nhttps://youtu.be/pYb6ui-2Vek", "timestamp_created": 1515945833, "timestamp_updated": 1515945833, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "39331928": {"recommendationid": "39331928", "author": {"steamid": "76561198375911132", "num_games_owned": 3, "num_reviews": 1, "playtime_forever": 357, "playtime_last_two_weeks": 357, "last_played": 1515947064}, "language": "japanese", "review": "SSを見ればゲーム好きな人にはピンとくると思いますが、LegendはLegendでもあのLegendですw\nモチーフ先への愛が感じる意外とやりがいのある内容でなかなかハマります。", "timestamp_created": 1515917404, "timestamp_updated": 1515917404, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39305710": {"recommendationid": "39305710", "author": {"steamid": "76561198039064662", "num_games_owned": 496, "num_reviews": 19, "playtime_forever": 532, "playtime_last_two_weeks": 532, "last_played": 1516109514}, "language": "english", "review": "Do you like Zelda, and games similar to Zelda? If so, I think you'll be mostly pleased with Shotgun Legend as it clearly pays homage to the original Legend of Zelda on the NES - albeit with some changes to suit the more gun-based weaponry system.\n\nThe main cons that I can think of - if I'm being purely nitpicky is that the shotgun often feels like it doesn't have a set damage due to the spread of the pellets. Sometimes you'll one shot kill an enemy. Another time the same enemy will take four shots because the crab keeps piroetting out of the way of your shots while you're low on health and don't really want to tempt fate by running up and shooting him directly in the face. Movement also felt a little floaty at times - it doesn't feel like it has weight to each step like Zelda does. \n\nStill if you're coming into this for a Zelda-like experience you're gonna find items. You're gonna fight bosses at the end of a dungeon and get a heart container. There's a vague plot in the background that you can almost completely ignore if you're more worried about just shooting things. Overall I'd recommend it for the intended audience.\n\nAt the time of this review I completed four dungeons - and since the game asks you to review the game at the end of dungeon three I figured I'd do it ... even if putting a declaration of wanting steam reviews in the game itself is a bit too mobile game-esq for my tastes.", "timestamp_created": 1515842280, "timestamp_updated": 1515842280, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39265348": {"recommendationid": "39265348", "author": {"steamid": "76561198143529190", "num_games_owned": 34, "num_reviews": 1, "playtime_forever": 177, "playtime_last_two_weeks": 177, "last_played": 1515550477}, "language": "english", "review": "It's a nice game. Well designed. Reminiscent of the NES first zelda game. I have enjoyed playing it in early access.  Cant wait to play the finished version.", "timestamp_created": 1515704142, "timestamp_updated": 1515704142, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39239919": {"recommendationid": "39239919", "author": {"steamid": "76561198321385080", "num_games_owned": 96, "num_reviews": 48, "playtime_forever": 96, "playtime_last_two_weeks": 96, "last_played": 1515632697}, "language": "english", "review": "Awesome Legend of Zelda like game with tons of items to collect and easy to play. It's made on fusion i think, fusion makes one of the best pixel animations.\n\nPros:\n+Good pixel graphics\n+Amazing story\n+Nostalgic\n\nCons:\n-sometimes bosses are a chore\n\nFinal Thoughts: 8/10\nThis game is absolutely great, it's a surprise that it's cheap plus i really enjoy good fusion games, Temmieneko recommended this game and i'm so glad i received this product for free!", "timestamp_created": 1515615486, "timestamp_updated": 1515615486, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "39228290": {"recommendationid": "39228290", "author": {"steamid": "76561198182774543", "num_games_owned": 178, "num_reviews": 7, "playtime_forever": 127, "playtime_last_two_weeks": 116, "last_played": 1515788817}, "language": "english", "review": "It's like old school zelda with guns. You start out with a shotgun, and then pick up other guns on the way as you explore dungeons. It's not really deep, but if you liked zelda, you might like this game.", "timestamp_created": 1515581174, "timestamp_updated": 1515581174, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39196851": {"recommendationid": "39196851", "author": {"steamid": "76561198050096508", "num_games_owned": 708, "num_reviews": 7, "playtime_forever": 50, "playtime_last_two_weeks": 50, "last_played": 1515463156}, "language": "english", "review": "This game is goofy, this game is hard, this game is a love letter to classic NES zelda games. The game gives me the same wonderful feeling of being dropped into a world and haveing someone stick there middle finger up my ass and scream GO FIND IT JACKASS. It is however, quite enjoyable and i found my self BEGGING for one more chance after every death. $5 well spent.", "timestamp_created": 1515463314, "timestamp_updated": 1515463314, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39168585": {"recommendationid": "39168585", "author": {"steamid": "76561198802083763", "num_games_owned": 12, "num_reviews": 1, "playtime_forever": 554, "playtime_last_two_weeks": 554, "last_played": 1515719794}, "language": "english", "review": "I just beaten Castle 3 or Level 3 anyhow, man I am really enjoying this game if you are a fan of classic zelda just cool games that resemble them types of games do get this I am having fun and them good feelings playing this so THUMBS UP DEVS.....", "timestamp_created": 1515371638, "timestamp_updated": 1515371638, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39162622": {"recommendationid": "39162622", "author": {"steamid": "76561198055031656", "num_games_owned": 138, "num_reviews": 1, "playtime_forever": 78, "playtime_last_two_weeks": 27, "last_played": 1516059547}, "language": "english", "review": "Fun game", "timestamp_created": 1515355201, "timestamp_updated": 1515355201, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39162385": {"recommendationid": "39162385", "author": {"steamid": "76561197977611568", "num_games_owned": 152, "num_reviews": 4, "playtime_forever": 143, "playtime_last_two_weeks": 143, "last_played": 1516062577}, "language": "english", "review": "So far so good, I loved the original Zelda so this is very nostalgic and fun.", "timestamp_created": 1515354699, "timestamp_updated": 1515354699, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39129655": {"recommendationid": "39129655", "author": {"steamid": "76561198236145596", "num_games_owned": 42, "num_reviews": 6, "playtime_forever": 356, "playtime_last_two_weeks": 356, "last_played": 1515327002}, "language": "russian", "review": "Игра явно стоит своих денег. Даже не играя с кем-то еще в режиме сплит-скрин, вы будете затянуты в увлекательное иследования мира и познавания сюжета, разбитого на множество записок, разбросаных по уровнях и локациях. Сама игра является более динамичной и разширеной версией игры The Legend of Zelda. В итоге, любителям хардкорных аркад, фанатам серии игры о Zeld'е и любителям веселого кооператива рекомендуется.", "timestamp_created": 1515269281, "timestamp_updated": 1515269281, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39112360": {"recommendationid": "39112360", "author": {"steamid": "76561198041029795", "num_games_owned": 683, "num_reviews": 7, "playtime_forever": 441, "playtime_last_two_weeks": 353, "last_played": 1516195202}, "language": "english", "review": "Pretty solid little game though I have had a few issues.  The usual, save corruption and crashing a few times randomly but as this is early access I assume these things will be buffed out before actual release.  I suggest giving it a try, even with the E.A. quirks.", "timestamp_created": 1515231980, "timestamp_updated": 1515231980, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39082104": {"recommendationid": "39082104", "author": {"steamid": "76561198087925072", "num_games_owned": 420, "num_reviews": 3, "playtime_forever": 197, "playtime_last_two_weeks": 197, "last_played": 1515160617}, "language": "russian", "review": "Линк с дробовиком.\nИгра в духе первой Зельды, пока что попроще, как в плане прохождения, так и наполнения контентом, но мне нравится.", "timestamp_created": 1515155570, "timestamp_updated": 1515155570, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39078409": {"recommendationid": "39078409", "author": {"steamid": "76561197981581538", "num_games_owned": 2578, "num_reviews": 31, "playtime_forever": 349, "playtime_last_two_weeks": 196, "last_played": 1515145191}, "language": "english", "review": "A fun LoZ remake. Exactly what it seems like on the tin: Legend of Zelda with a shotgun.", "timestamp_created": 1515145271, "timestamp_updated": 1515145271, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39067802": {"recommendationid": "39067802", "author": {"steamid": "76561198012072743", "num_games_owned": 208, "num_reviews": 6, "playtime_forever": 52, "playtime_last_two_weeks": 4, "last_played": 1515112004}, "language": "english", "review": "This is a fun title, hearkening back very closely to the original Zelda, but WITH A SHOTGUN.\n\nBuy it.", "timestamp_created": 1515112048, "timestamp_updated": 1515112048, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39037480": {"recommendationid": "39037480", "author": {"steamid": "76561198116289490", "num_games_owned": 74, "num_reviews": 7, "playtime_forever": 60, "playtime_last_two_weeks": 60, "last_played": 1515043534}, "language": "english", "review": "Its really fun and challenging, even if you repeatedly die in game it sends you back to an understandable point back. You can quickly get hang of it, but its still challenging going foward. Even in the beginning you can one shot kill an enemy if you are right in front of it, but its still hard to get close enough to the faster movine enemies to shoot them before they get to you. Good Legend of Zelda style game, decent enough dungeons. I´d suggest you get it when its on sale.", "timestamp_created": 1515044219, "timestamp_updated": 1515044219, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38977253": {"recommendationid": "38977253", "author": {"steamid": "76561198313714320", "num_games_owned": 540, "num_reviews": 2, "playtime_forever": 262, "playtime_last_two_weeks": 0, "last_played": 1514906433}, "language": "schinese", "review": "《猎枪传说》是对FC上的《塞尔达传说》的一款致敬作，一进入游戏你就能从各种地方找到《塞尔达传说》的影子——左上方的小地图、A键主武器B键（X键）副武器、半颗半颗扣心的血条，还有最重要的迷宫探索部分。游戏的主要玩法也如出一辙，在大地图上获取金钱、升级与小部分关键道具并寻找迷宫，在迷宫中获取关键道具以前往新地点、打败boss、收集通关道具以前往最终boss处。可以说《猎枪传说》在外形与游戏机制上对《塞尔达传说》的还原是很成功的。\n那么《猎枪传说》是对《塞尔达传说》单纯的借鉴与模仿吗？事实上在画面的提升之外它也有一些新东西。比如游戏标题中的猎枪，作为主武器的它有着距离敌人越近伤害便越高、无法快速连续射击的特性，这就使游戏的战斗节奏与《塞尔达传说》略有不同了；再比如双人模式，在游戏初期就能得到一个叫“二重身”的道具，持有这个道具时只要在另一个控制器上（我是用键盘和手柄，不知道其他情况下是怎样的）按下开始键便可两个人同屏合作进行游戏（此时HP是共用的），无疑是加强了游戏的趣味性与战斗的策略性。不过《猎枪传说》现阶段还是没有跳脱出《塞尔达传说》的游戏模式，希望游戏中有什么重大创新与特色的玩家可能要失望了。\n此外，这款游戏也有一些缺点：BGM十分单调，听得头疼；数量不多的隐藏要素（也可能是我智商太低找不到），所有隐藏区域都有明显提示，不太有惊喜感；很平淡的地图设计，基本就是主路上加上一两条走到头后只能原路返回的岔路，要么就是不小心走进去就得绕一大圈回来的单向门，偶尔再来一两个传送门；道具的用途太过单一，游戏中后期除了开机关外基本全程双持猎枪，其他副武器的特点没有凸显出来；键盘的键位略微有点奇怪，习惯了《洞窟物语》那种AS切换ZX使用的操作方式的话会非常难受，但又没办法改键位等等。但考虑到这款游戏还在抢先体验阶段，这些问题今后可能会有改进。\n总的来说，这款游戏还是很有趣的，流程也不长，难度也不是很高，五到六个小时就能通关，对FC《塞尔达传说》各方面的还原也很好，如果你是塞尔达系列的忠实玩家不妨一试，新玩家也可从中略微窥见塞尔达传说的魅力所在。对于成就党来说，目前全成就还是很容易的，包括收集全部道具和升级、通关。如果你是想挑战自我，也可以试试游戏提供的取消自动存档，要求一命通关的硬核模式。诚然这不是一款十分优秀的作品，但也能让玩家度过几小时愉快的时光了。（本评测基于v0.9.10版本）", "timestamp_created": 1514907187, "timestamp_updated": 1514907187, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38957361": {"recommendationid": "38957361", "author": {"steamid": "76561197978888874", "num_games_owned": 394, "num_reviews": 8, "playtime_forever": 328, "playtime_last_two_weeks": 200, "last_played": 1515463203}, "language": "english", "review": "I've completed three of the dungeons thus far and am very pleased with how the game plays.  It definitely wears it's LoZ influence on it's sleeve with the quirk of using a shotgun instead of a sword and it makes for an interesting play mechanic so far though.  Plays very smoothly and haven't run into any issues with the game thus far and for it's current price it's darn near impossible to complain about too much.  If you get an hour out of it (though it definitely will take at least a few hours for a playthrough), then it's money well spent if you are looking for a throwback 8-bit adventure game.", "timestamp_created": 1514856639, "timestamp_updated": 1514856639, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39583010": {"recommendationid": "39583010", "author": {"steamid": "76561198144267313", "num_games_owned": 738, "num_reviews": 11, "playtime_forever": 462, "playtime_last_two_weeks": 462, "last_played": 1516806863}, "language": "english", "review": "If you ever wanted to play The Legend of Zelda with a shotgun, this game is for you. The screenshots and videos give you a good idea of what the game is like.", "timestamp_created": 1516806646, "timestamp_updated": 1516806646, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}}
