{"query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 60, "total_negative": 0, "total_reviews": 60}, "reviews": {"38656489": {"recommendationid": "38656489", "author": {"steamid": "76561198057870647", "num_games_owned": 55, "num_reviews": 7, "playtime_forever": 8191, "playtime_last_two_weeks": 157, "last_played": 1514491382}, "language": "french", "review": "Gameplay-wise, it's one of the best platformers I've played.The impressive physics allows for countless possibilities and every level can be rediscovered many times. Graphically it's far from the best 16 bits game, but the atmosphere, universe and music are lovely and unique. It's a shame western kids couldn't play this game back in the day, when I think of all the stupid games I bought on the SNES. \nAlso, it's worth getting the steam version instead of emulating because of the very useful practice mode and the lack of slowdowns.", "timestamp_created": 1514205464, "timestamp_updated": 1514205464, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38504673": {"recommendationid": "38504673", "author": {"steamid": "76561198174270189", "num_games_owned": 47, "num_reviews": 3, "playtime_forever": 1928, "playtime_last_two_weeks": 1501, "last_played": 1514835754}, "language": "english", "review": "hmm, it's maybe the best game i've ever played. it has fish hook action!", "timestamp_created": 1513891578, "timestamp_updated": 1513891578, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38070083": {"recommendationid": "38070083", "author": {"steamid": "76561198257401028", "num_games_owned": 15, "num_reviews": 3, "playtime_forever": 143, "playtime_last_two_weeks": 34, "last_played": 1513906540}, "language": "french", "review": "ce jeu n'est pas aussi facile qu'il en a l'air. la courbe d'apprentissage pour s'habituer à bien utiliser le grappin est quand même assez raide. sinon les niveaux sont sympas, la musique et les graphiques très mignons l'atmosphère est comfortable. si vous êtes bons en platformers ça devrait être du gâteau, sinon ça peut aller il vous faut juste de l'entraînement et de la patience.", "timestamp_created": 1512440965, "timestamp_updated": 1512440965, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37742235": {"recommendationid": "37742235", "author": {"steamid": "76561197992334290", "num_games_owned": 266, "num_reviews": 24, "playtime_forever": 81, "playtime_last_two_weeks": 0, "last_played": 1513497892}, "language": "english", "review": "tl;dr Overall a solid little indie game that somehow was revived and spawned a small franchise (and is getting a 4th game for the Switch). 7/10\n\nA port of an obscure SNES physics-based platformer that was later vindicated by history, and is now a cult classic (the original studio actually died shortly after releasing this game, but I guess they were revived as Studio Saizensen down the road). Play as a cute girl swinging in a surreal fish-man landscape. The kind of game where you want to replay and get better.\n\nHG101 review of the series.\nhttp://hg101.kontek.net/umihara/umihara.htm\nCreator interview:\nhttp://www.usgamer.net/articles/indie-before-it-was-cool-the-umihara-kawase-story\nhttp://gosokkyu.com/post/79416970057/odd-odyssey-the-story-of-umihara-kawase-in-this\n\nGraphics:\nBasically an emulation. Fullscreen support that you can stretch horizontal or vertical. Default at the normal aspect ratio will have black bars on the side obviously since it's 4:3. There are a couple filters (hard and soft), but I just play on default. The game's pixel art still looks nice and charming, but the backgrounds are just really ugly pixelated photos. You probably won't notice the background that much anyway, the pixel art itself is vibrant enough to keep your attention. Sometimes the water will have a flickering glitch, but it only happened for a couple seconds to me.\n\nTechnical:\nController support works fine, but you have to use the toolbar options rather than the in-game options. The original SNES game suffered from lag due to the heavy physics engine, but this runs smoothly without any problem. I seem to have a problem where Explorer.exe will crash every time I alt-tab the game, though. Also the settings don't seem to save, so I have to fullscreen it again every time I play.\n\nMusic:\nSoundtrack is decent but not really noteworthy, which is good because you're going to be hearing it a lot as you make your way through 50+ levels.\n\nGameplay:\nFun, but it takes getting used to. You can toss your grapple hook fishing line in all directions. Up and Down reel you in or out. There's a short tutorial demonstration of skills that you should develop and enemies that you'll encounter before each level. You're given 10 lives, and you have to reach the end (stage 51 or so). Difficulty slowly ramps up, so you're expected to get good early on. You can walk like a normal 2D platforming game for the early levels, but you will have to know how to fling yourself over and through the level by slinging yourself via the fishing line. There are multiple paths you can take, and two endings. Some of the hidden paths will skip entire chunks of the game (or bosses), but they're also usually hard to access (and/or completely offscreen - there's a feature where you can move your camera to the side a bit to try and see what might be hiding). You will need to master techniques that involve exploiting your rubber fishing line + your momentum + the fishing line tension, such as \"rocket jumps.\" This is how you access some of the more hidden paths. You'll also need to master those techniques if you want to see all the levels, because there's a 30-minute timer in this game. If you're too slow and go over it, you're automatically sent to the last stage.\n\nEnemies spawn randomly on the map. You can catch them and put them in your sack for points. There are also some cut enemies that should still be in the game's code, so it might be possible to reimplement them if you want.\n\nhttps://tcrf.net/Umihara_Kawase_(SNES)\n\nIf you enjoy replaying the game to get faster and swinging like a madman, then this won't be a problem. You can also save and share replays to make yourself and others feel inferior (if you really want to feel inferior, look up the AGDQ run of this game).", "timestamp_created": 1511751243, "timestamp_updated": 1512184037, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37643789": {"recommendationid": "37643789", "author": {"steamid": "76561198201993536", "num_games_owned": 170, "num_reviews": 20, "playtime_forever": 248, "playtime_last_two_weeks": 11, "last_played": 1514099956}, "language": "spanish", "review": "Un gran juego que lamentablemente parece que no ha tenido tantas ventas pese a ser todo un clasico (probablemente porque la mayoría prefiere jugarlo en un emulador de supernintendo)", "timestamp_created": 1511689693, "timestamp_updated": 1511689693, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36897401": {"recommendationid": "36897401", "author": {"steamid": "76561197998370867", "num_games_owned": 636, "num_reviews": 1, "playtime_forever": 575, "playtime_last_two_weeks": 0, "last_played": 1512867845}, "language": "spanish", "review": "Entretenido juego de culto aparecido originalmente en Super Famicom. El objetivo es alcanzar las puertas de salida de cada nivel, haciendo uso de una caña de pescar que permite a la protagonista capturar enemigos y balancearse por los techos y paredes.\n\nLas mecánicas del juego son sencillas pero no fáciles de dominar. Con un comienzo facil, pronto aparecen las dificultades:  lugares aparentemente imposibles de alcanzar, enemigos que aparecen de improvisto e incluso imposibles de atrapar. Sin embargo con practica, paciencia y a veces un poco de suerte se va avanzando en el juego.  \n\nAprender las físicas del juego es parte de la entretención. Al aprender a balancearse se abren múltiples posibilidades para llegar a una de las salidas del nivel y con ello ir desbloqueando las múltiples rutas que tiene el juego. Partir con 10 vidas parece suficiente, pero aprender a pasar cada nivel requerirá perder muchas de esas vidas. De todos modos, existe un modo de práctica que permite jugar las veces que se quiera una etapa jugada anteriormente.\n\nEl apartado gráfico es curioso, mezclando fotografías monocromaticas con coloridas plataformas, enemigos y elementos decorativos por los cuales uno se pregunta ¿qué se fumaron sus creadores?. En este aspecto no sobresale con respecto a otros juegos de su época, pero tiene su encanto. En cuanto a la música, posee pocos pero pegajosos temas. Si lo juegas por mucho tiempo se quedaran dando vueltas en tu cabeza.\n\nEn resumen, un juego clásico que premia la persistencia volviendose muy disfrutable. Es una lástima que tardara tanto en llegar a occidente, pero nunca es tarde para conocerlo.", "timestamp_created": 1511403151, "timestamp_updated": 1511403151, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36845121": {"recommendationid": "36845121", "author": {"steamid": "76561198023721166", "num_games_owned": 192, "num_reviews": 2, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1511391236}, "language": "english", "review": "Pretty good game, but i'm pretty bad at it.", "timestamp_created": 1511391192, "timestamp_updated": 1511391192, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36656035": {"recommendationid": "36656035", "author": {"steamid": "76561198074318760", "num_games_owned": 97, "num_reviews": 9, "playtime_forever": 683, "playtime_last_two_weeks": 0, "last_played": 1506989496}, "language": "english", "review": "you..would be surprise", "timestamp_created": 1511221012, "timestamp_updated": 1511221012, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503870", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36622590": {"recommendationid": "36622590", "author": {"steamid": "76561198215533865", "num_games_owned": 27, "num_reviews": 2, "playtime_forever": 137, "playtime_last_two_weeks": 23, "last_played": 1514637828}, "language": "japanese", "review": "ラバーリングアクションの決定版\n\n移植もなんとかポータブルみたいなのではなく完璧なので当時のプレイヤーは勝って損はないはずです", "timestamp_created": 1511096521, "timestamp_updated": 1511096521, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36542613": {"recommendationid": "36542613", "author": {"steamid": "76561198050191641", "num_games_owned": 58, "num_reviews": 8, "playtime_forever": 212, "playtime_last_two_weeks": 0, "last_played": 1509510361}, "language": "english", "review": "if you're willing to put the time in to learning a game's complex physics to really just kick ass at it, this game is amazing\nif you just want to pick up a game and be able to fully enjoy it without needing to be an astronomical physicist, this game is amazing\n\nthis game's controls aren't tough to learn at all, and with a little practice (which is easy because there's very little downtime in this game) you can figure them out pretty easily\nphysics on the other hand are pretty difficult to learn, but the most basic techniques can come naturally\n\nit's my game to play if i'm in a group call with my friends and i just want to relax, it's fun", "timestamp_created": 1510796278, "timestamp_updated": 1510796278, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36355435": {"recommendationid": "36355435", "author": {"steamid": "76561198045122771", "num_games_owned": 225, "num_reviews": 6, "playtime_forever": 431, "playtime_last_two_weeks": 0, "last_played": 1512469492}, "language": "english", "review": "I first found out about this game from an episode of Game Center CX I watched some years ago. Since this was a japanese exclusive game for the SNES (and a somewhat rare one at that), I never had the opportunity to play it until now. It's a cute platformer where the gimmic is that you traverse the level via a grappling hook (fishing line). The controls take some time to get used to but once you have them down it's a really fun game.\n\nFor the price it's well worth it. I highly recommend it.\n\nEDIT: After playing the game for a while I do have one major criticism and that's the enemy spawns. When you defeat an enemy it will respawn about 3 seconds later. It's really frustrating when you're tring to make a tricky jump because you barely have any time to react. Sometimes when you land on a platfrom an enemy will randomly spawn right when you start to get on the platform and intsntly kill you. If it weren't for this glaring issue this game would have been perfect, but thanks to the extremely unfair enemy spawns and respawns it starts to get frustrating the longer you play and the further you progress through the game, since you have no continues (at least none that I know of).", "timestamp_created": 1510103230, "timestamp_updated": 1511399765, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36122145": {"recommendationid": "36122145", "author": {"steamid": "76561198089105290", "num_games_owned": 155, "num_reviews": 20, "playtime_forever": 319, "playtime_last_two_weeks": 0, "last_played": 1511789874}, "language": "spanish", "review": "No mames q dificil  xd\n", "timestamp_created": 1509306451, "timestamp_updated": 1509306451, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35563565": {"recommendationid": "35563565", "author": {"steamid": "76561198007242512", "num_games_owned": 52, "num_reviews": 7, "playtime_forever": 162, "playtime_last_two_weeks": 0, "last_played": 1491798159}, "language": "english", "review": "An excellent port of a delightful game. In my opinion, this is the best way to play Umihara Kawase: it plays with (to my lightly-experienced eyes) perfect fidelity to the original, and the addition of a level select feature makes the game much more approachable. \n\nThis is a game where you swing around platforming levels on a stretchy fishing line. Levels are short, and many of them have multiple exits that lead to different levels, forming branching paths through the game. The fishing line is at first difficult to control, but with time and practice you will discover all kinds of maneuvers you can use it for. The game is built to accommodate your growing skill and comfort; over time, long and difficult levels become short and easy, and seemingly impossible alternative paths become easy and obvious. If that learning process sounds exciting to you, I highly recommend this game. It has many rough spots - a bizarre and capricious enemy-spawning system, an abrupt and unceremonious non-ending, a slightly steeper difficulty curve than I would have liked - but none of them obscure the appeal of learning, practicing, and mastering a novel kind of movement through space.", "timestamp_created": 1507442152, "timestamp_updated": 1507442152, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35165808": {"recommendationid": "35165808", "author": {"steamid": "76561198160868511", "num_games_owned": 562, "num_reviews": 338, "playtime_forever": 713, "playtime_last_two_weeks": 0, "last_played": 1506206737}, "language": "english", "review": "A fantastic physics based platformer with pixelated graphics brought to us by Degica.", "timestamp_created": 1506207414, "timestamp_updated": 1506207414, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.569969", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34738541": {"recommendationid": "34738541", "author": {"steamid": "76561198011413256", "num_games_owned": 250, "num_reviews": 3, "playtime_forever": 80, "playtime_last_two_weeks": 0, "last_played": 1482264121}, "language": "english", "review": "Gud game", "timestamp_created": 1504542441, "timestamp_updated": 1504542441, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.496630", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33816287": {"recommendationid": "33816287", "author": {"steamid": "76561198051083217", "num_games_owned": 2073, "num_reviews": 389, "playtime_forever": 24, "playtime_last_two_weeks": 0, "last_played": 1501098175}, "language": "english", "review": "It´s a cute hell!", "timestamp_created": 1501098195, "timestamp_updated": 1501098195, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.470933", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33272530": {"recommendationid": "33272530", "author": {"steamid": "76561197989605792", "num_games_owned": 1499, "num_reviews": 8, "playtime_forever": 25, "playtime_last_two_weeks": 0, "last_played": 1475062487}, "language": "english", "review": "Excellent physics platformer that really has no clones or other similar games.\nIt's harder than most 2D platformers, not only due to being old-school in some aspects (timer, one hit kills, etc), but also due to the controls and character behaving differently thanks to the rope physics. That said, it's still really fair, and just pushes you to learn the controls.\nThe port itself is decent, it's a SNES game without much options, but the workshop allows you to check replays from other players, which is really helpful at becoming better and going for better runs. Always amazing techniques to discover.\n\nIn my opinion the best game of the trilogy, but it's really worth grabbing all three!", "timestamp_created": 1499256896, "timestamp_updated": 1499256896, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33068956": {"recommendationid": "33068956", "author": {"steamid": "76561198328467965", "num_games_owned": 54, "num_reviews": 8, "playtime_forever": 28, "playtime_last_two_weeks": 0, "last_played": 1509977139}, "language": "japanese", "review": "YouTubeやニコニコ動画のスーパープレイを見て、面白そうだと思ったら大間違い！\n独特の挙動に翻弄されっぱなしで、１面クリアもままなりません。\n\n例えるなら、\n\n「音楽のアニメが流行ってるから、私もやってみよう」\nで、ギターを買って、押し入れに…というパターン。\n\nでもさすがに、スーパープレイは一朝一夕では難しいけど\n極めると、ゴムのびよ～んがクセになります。\n", "timestamp_created": 1498886281, "timestamp_updated": 1498886281, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.568965", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32952970": {"recommendationid": "32952970", "author": {"steamid": "76561198020572239", "num_games_owned": 388, "num_reviews": 12, "playtime_forever": 1077, "playtime_last_two_weeks": 0, "last_played": 1511244197}, "language": "english", "review": "This is an extremely good port of the cult classic SNES game. I'm using a logitech f310 and the game controls without any noticable issues. \n\nUmihara Kawase is a difficult but very fun puzzel platformer. One aspect that suprised me when I booted it up was that you cannot save your progress during a run- you get 10 lives and that's it. Every time you reach a new area that area is unlocked in practice mode so if you are having trouble on a particular part you can give it some practice before trying to make progress. The result of this system is that you get through the game by actually improving- not by getting lucky or grinding up stats. It feels increadibly satifying to sail through levels that seemed impossible before. \n\nSomething that I really love about this game is its focus. The entire game is built around the mechanic of the fishing-line and it is almost shocking how much depth and variety exist whithin that one seemingly simple tool.\n\nGreat music, great art, great gameplay- this game has really supassed my expectations and become my favourite platformer. I'm only really writing this review because I feel the game deserves to be listed as overwhelmingly positive.", "timestamp_created": 1498677128, "timestamp_updated": 1498677128, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32890399": {"recommendationid": "32890399", "author": {"steamid": "76561198058179485", "num_games_owned": 314, "num_reviews": 10, "playtime_forever": 424, "playtime_last_two_weeks": 0, "last_played": 1510243426}, "language": "english", "review": "Excellent platformer with some great grappling hook physics. Once you master the physics you can do some insanely cool stuff. Brutally difficult game but super satisfying, get the trilogy.", "timestamp_created": 1498599071, "timestamp_updated": 1498599071, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32761687": {"recommendationid": "32761687", "author": {"steamid": "76561198249422902", "num_games_owned": 18, "num_reviews": 1, "playtime_forever": 14785, "playtime_last_two_weeks": 0, "last_played": 1499674717}, "language": "japanese", "review": "個人的にSteamで発売されてる川背さんシリーズでは一番、移植の出来がいい。\n次点でそのまま移植な感じのさよなら。旬は残念な感じ・・", "timestamp_created": 1498378594, "timestamp_updated": 1498378594, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32392111": {"recommendationid": "32392111", "author": {"steamid": "76561198040771152", "num_games_owned": 311, "num_reviews": 10, "playtime_forever": 140, "playtime_last_two_weeks": 0, "last_played": 1499647662}, "language": "english", "review": "A challenging platformer, but one that rewards mastery and movement with more exploration.", "timestamp_created": 1497370072, "timestamp_updated": 1497370072, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30985163": {"recommendationid": "30985163", "author": {"steamid": "76561198026753348", "num_games_owned": 427, "num_reviews": 13, "playtime_forever": 2997, "playtime_last_two_weeks": 0, "last_played": 1491963827}, "language": "english", "review": "Amazing game. Umihara Kawase is a platformer where most of the gameplay revolves around using an elastic fishing line to get around the level and attack enemies. Think the grappling hook from worms - except the elasticity adds a huge amount of complexity. Combined with the rock-solid physics, this leads to a very fun game that ramps up the difficulty to insane levels, requiring serious speedrunner rubberband tactics to just pass later levels. \nThe fishing line has a seemingly infinite learning curve, 40 hours in and I'm still learning new techniques. Initially you'll be using it to swing across pits and climb upwards, but soon you'll find yourself using the tension to slingshot yourself across levels, or 'rocket jump' over hazards. The layout of the levels make this as much puzzle as platforming: particular levels can take forever to figure out, though if you are having difficulty you can consult the library of replays that the community shares through the steam workshop integration.\nGameplay progression is handled like Super Mario Bros: you get 10 lives, and if you run out of lives it's game over and you must start again from the beginning. However, reaching a level once will unlock it in practice mode, where you get unlimited tries at it. So you'll soon fall into a cycle of Progressing through levels -> getting stuck and dying -> replaying the hard level in practice mode until confident -> and repeat. The great thing about this system is that come the end game, you have traversed the first ~10 levels several hundred times, and so you'll have an optimum route mapped out, shaving milliseconds off every time.\nThe levels don't follow a linear structure either - some levels have multiple exits, and you must choose which path to pursue. I ended up making a game map on paper to keep track of which levels I had completed. Some of the toughest levels are the Boss Fields. These usually feature a large enemy that must be avoided for a certain time or destroyed before the exit will open.\nAll in all, I've never quite played a platformer that utilises it's main mechanic this well. Definitely the best \"grappling hook\" physics of any game I've played, which is amazing considering this is almost a direct port of the super famicom version. \nIf you enjoyed Cave Story, La Mulana, or Spelunky, you'll feel at home with the platforming. If you enjoyed FEZ or Braid, you'll feel at home with the puzzle aspects. I don't think enough people know about this gem of a game, so give it a try. I'm looking forward to trying out the sequels!", "timestamp_created": 1491507817, "timestamp_updated": 1491507817, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.676280", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30025207": {"recommendationid": "30025207", "author": {"steamid": "76561198138745733", "num_games_owned": 46, "num_reviews": 3, "playtime_forever": 2664, "playtime_last_two_weeks": 0, "last_played": 1511924789}, "language": "english", "review": "Nice playful music and visuals are there to mask the fact you're about to go through hell and back. The game starts you with 10 lives, which makes you think \"what could possibly go wrong?\". Well, you'll need those 10 lives, boy. Maybe more.\n\nThis game has surprisingly deep physics, even more so if you consider it came out in 1994. You jump, hook and swing your way across many many stages, some of which have 2 possible exits (one of them even has 3, but good luck with those).\n\nThe game is simple enough to learn (there are some neat lil cutscenes that give you tips here and there), but it takes a while to get used to what you can and can't do with the rubber band.\n\nAs both an upside and a downside, the game takes you to a specific ending if you have gone 30 minutes without getting a game over and without reaching any other particular ending. It's nice if you wanted to get to an ending and were having trouble, but if you were trying to get to a particular stage and took too long... well, though luck.\n\nThe controls are responsive and rarely do I feel like I failed due to bad controls.\n\nOnly problem I have is the game has respawning enemies, some of which like to appear right where you're about to land. The protagonist only has one hit point. You do the math.\n\nAside from that, it's a very enjoyable experience with high replay value. After you get used to the physics and learn a couple of tricks, early levels become your own little playground to try more zany antics.\n\nI also recommend watching the Game Center CX episode about this game. It can show you both how funny and how evil this game can get.\n\nPS.- I absolutely hate crabs now.", "timestamp_created": 1487477821, "timestamp_updated": 1487477821, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.570983", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30023519": {"recommendationid": "30023519", "author": {"steamid": "76561198094083996", "num_games_owned": 1806, "num_reviews": 76, "playtime_forever": 511, "playtime_last_two_weeks": 0, "last_played": 1490403516}, "language": "english", "review": "My favorite of the Umihara Kawase games, through the least forgiving.  UK is a purely arcade experience, with no story or any other unnecessary trappings.  The game is presented in stages, where you start at point a and try to get to point b, mainly by experimenting with the physics of your fishing hook.  \n\nThe big draw is that a lot of the stages have multiple exits and/or can be beaten in a different manner depending on the level of your skill with the fishing hook.  The hook has some cool physics, especially considering how the old game is.  The original UK has the best gameplay \"feel\" to me; it feels faster and the hook physics just seem more springy in a good way than the sequels.  Learning how to use the hook to throw Umi all over the place in very rewarding.\n\nUK is probably the best looking game in the series, though that's some faint praise.  The artstyle is unique at least and quite surreal.  There's not a lot to compare it to visually, it's an ugly game but ugly in it's own way.  Even the in-game UI has a weird, very centered placement.\n\nThe downside to UK is that it's an arcade experience.  There are no continues and you have a limited amount of lives with not too many ways to get more.  This means you'll be replaying early levels [i]a lot[/i].  The levels get more difficult as the game goes on and unless you're okay with the repetition of practicing levels and building up enough skill with the hook, you'll probably never beat the game.  Some levels also have really tight windows for clearing them, the giant seahorse level for one example.  UK also has the occasional boss level which might be interesting the first time but fall flat on repeated playthroughs.\n\nI'll probably never beat UK but it's a fun and frustrating arcade experience.  I tend to boot it up, play until I get a couple of game overs and then put on the digital shelf for a few months and then rinse and repeat.  It does seem like a cool game with a lot of speed-running potential, too, if you're into that.  The port is solid enough and I didn't have any issues with it.", "timestamp_created": 1487470454, "timestamp_updated": 1487526954, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.566038", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29294833": {"recommendationid": "29294833", "author": {"steamid": "76561198085253511", "num_games_owned": 96, "num_reviews": 2, "playtime_forever": 1927, "playtime_last_two_weeks": 41, "last_played": 1514469055}, "language": "japanese", "review": "とくに不具合もなく、完璧な移植\nいつまでも遊べる名作ゲーム　RTAもできるぞ！", "timestamp_created": 1484570306, "timestamp_updated": 1484570306, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28201055": {"recommendationid": "28201055", "author": {"steamid": "76561198268520273", "num_games_owned": 39, "num_reviews": 3, "playtime_forever": 3446, "playtime_last_two_weeks": 0, "last_played": 1504312650}, "language": "japanese", "review": "輪ゴムのような弾力性を持つ釣り糸を用いて、ゴールであるドアまでたどり着くというシンプルなゲームです。\nシンプルなのですが、釣り糸の機能や主人公である海腹川背ちゃんの釣り針を投げる能力によって様々な動きを可能とした意外な自由度の高さが中毒性を生み出しています。マルチエンディングではなくエンディングというものもないようなものですが、コース分岐も多く、エンディングが見れる最終到達地点も複数あります。\n\nこのゲーム「海腹川背」はスーパーファミコンの移植のため、内容を知っている人も多いと思います。\n昔ながらのゲームにありがちなコンティニューがなく、攻略が難しいものとなっています。\n\n個人的な評価としましては実に満足できるものでした。\n昔から存在は知っていて興味は持っていたのですが、触れる機会がなく今回のプレイは初見のものとなりました。\n難易度が高かったにも関わらず私が攻略を見ずに全クリをすることができたのは、れんしゅうモード（侵入したコースの練習ができるモード）のおかげだったと思います。一つのコースを何時間も練習したこともありました。\n\n満足できなかった部分もありました。\n満足できないというよりも不具合の類なのですが、プレイ時間が10時間ほど経ったころからハイスコアが更新されなくなりました。\n不具合なのかわからない点としましては、魚を全種類捕獲するという実績が達成されないことです。ゲーム内での情報では1匹足りないとありました。\nこれに関してはSFC版の攻略サイトを確認して魚全種類確認しましたが、20種類いるのかも不明でした。以下魚一覧となります。\n\n[list]\n　[*][spoiler]アジ[/spoiler]\n　[*][spoiler]イシダイ[/spoiler]\n　[*][spoiler]磯貝（青い貝）[/spoiler]\n　[*][spoiler]イソギンチャク[/spoiler]\n　[*][spoiler]カエル[/spoiler]\n　[*][spoiler]金魚[/spoiler]\n　[*][spoiler]子ガニ[/spoiler]\n　[*][spoiler]コバンザメ（サメが投げる魚）[/spoiler]\n　[*][spoiler]サメ[/spoiler]\n　[*][spoiler]タコ[/spoiler]\n　[*][spoiler]タツノオトシゴ[/spoiler]\n　[*][spoiler]タナゴ（バケツから出るカラフルな魚）[/spoiler]\n　[*][spoiler]タニシ（茶色い貝）[/spoiler]\n　[*][spoiler]どじょう[/spoiler]\n　[*][spoiler]トビウオ[/spoiler]\n　[*][spoiler]フナ[/spoiler]\n　[*][spoiler]ホタテ[/spoiler]\n　[*][spoiler]ヤマメ[/spoiler]\n　[*][spoiler]カバン（？）[/spoiler]\n　[*][spoiler]バケツ（？）[/spoiler]\n[/list]\n\n攻略サイトを見ずに実績を開放するまでの時間は1000時間ほどだと思います。\n一つだけ不可能な実績がありますが、それ以外は50時間ほどでなんとかなると思います。\n\n不満な点もありましたが、長時間に渡り非常に楽しめたのでおすすめさせていただきたいと思います。", "timestamp_created": 1480934580, "timestamp_updated": 1480934764, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28137684": {"recommendationid": "28137684", "author": {"steamid": "76561198122658119", "num_games_owned": 171, "num_reviews": 4, "playtime_forever": 1610, "playtime_last_two_weeks": 0, "last_played": 1481013079}, "language": "english", "review": "This is a physics based platformer where your goal is to get to the end of the level. You are armed with a fishing hook and use this to swing around and about and defeat enemies or evade them. This game makes great use of it's complex physics and creates challenging puzzles based on your abilities. There is much content hidden behind movement mechanics, and there are many difficult bosses. That said there is a lot to do, I have played over 50 hours at least and still have not found everything, and still finding things and figuring things out. The Steam version has workshop support, leaderboards, and a level select option once you have found a level. The game has always featured a demo playback function, but for this release you can save your replay and upload it to the workshop for other people to see.\n\nI dislike many of the bosses. Some are just boring and long, for example the first tadpole boss. And others are just unfair and frustrating, like the second tadpole boss and the crab. From what I have played, I think the sequel Umihara Kawase Shun handled bosses better, making them shorter, though not necessarily easier as that TWIN TADPOLE BOSS EXISTS. Needless to say, I don't play this game for the boss battles, though I do really like the two school of fish bosses and the seahorse boss is creative and adds even more variety as it's solution is neither combat nor evasion. I also dislike enemies randomly spawning, though if you play long enough you figure out how it works and it is pretty fair, they spawn in specific zones and it isn't like they will spawn under you or anything but will spawn ahead of you. If this is a dealbreaker for you, they have changed this behavior for the third game, Sayonara Umihara Kawase, which is also a great game which would function well as an entrypoint in the series.\n\nI love this game, it is easily my favorite platforming series, you cannot go wrong with it but make sure you use a controller with a good dpad like the Buffalo Classic USB pad", "timestamp_created": 1480682251, "timestamp_updated": 1480682251, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27766509": {"recommendationid": "27766509", "author": {"steamid": "76561198233348248", "num_games_owned": 54, "num_reviews": 1, "playtime_forever": 510, "playtime_last_two_weeks": 18, "last_played": 1514816574}, "language": "brazilian", "review": "Excelente jogo!", "timestamp_created": 1480216464, "timestamp_updated": 1480216464, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "27579666": {"recommendationid": "27579666", "author": {"steamid": "76561197972431417", "num_games_owned": 204, "num_reviews": 6, "playtime_forever": 11, "playtime_last_two_weeks": 0, "last_played": 1451669771}, "language": "japanese", "review": "シンプルな操作性、慣れてくるとキマる移動が指先と脳を直結してコントロールする快感に痺れる！", "timestamp_created": 1480124083, "timestamp_updated": 1480124083, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "27541535": {"recommendationid": "27541535", "author": {"steamid": "76561198116789424", "num_games_owned": 26, "num_reviews": 1, "playtime_forever": 1182, "playtime_last_two_weeks": 0, "last_played": 1501600787}, "language": "japanese", "review": "Oppai.", "timestamp_created": 1480106186, "timestamp_updated": 1480106186, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.495192", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27253543": {"recommendationid": "27253543", "author": {"steamid": "76561198080883775", "num_games_owned": 163, "num_reviews": 10, "playtime_forever": 1075, "playtime_last_two_weeks": 0, "last_played": 1501701352}, "language": "english", "review": "A game that we did not get to experience in the West until very recently (or... well you've played it a long time ago if you're into emulation).  A solid port from the classic SNES title, Umihara Kawase is challenging, engaging and endearing all in one neat little package.\nCute visuals with an interesting use of colour, catchy tunes, and an interesting game mechanic is having me coming back for more and more.", "timestamp_created": 1480009026, "timestamp_updated": 1480009026, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "27248655": {"recommendationid": "27248655", "author": {"steamid": "76561198189249125", "num_games_owned": 1697, "num_reviews": 11, "playtime_forever": 125, "playtime_last_two_weeks": 0, "last_played": 1477182271}, "language": "japanese", "review": "「海腹川背」シリーズの原点。SFCで発売された1作目を移植したもの。\nSteam版ではそれに加えてワークショップに対応し、リプレイデータのアップロードや、他のプレイヤーがアップロードしたリプレイデータのダウンロード、再生が手軽にできる。（これはSteamで出ている他の2作も共通）\n\nゲーム内容は非常にシンプルで、\n・歩く\n・ジャンプ\n・ルアーを投げる\n・ゴムを縮める、伸ばす\nというだけの操作（十字キーと2ボタンのみ）で、各ステージにあるドアを目指すというもの。\n\nそれだけなのに、その動作の組み合わせで多彩な動きが可能で、練習することで縦横無尽に動き回れるようになる。\n緻密に練られたステージ構成も相まって、やればやるほど上達できるのが実感できるので、プレイヤースキル重視のゲームが好きな人にはおすすめ。\n\nただクリアするだけではなく、タイムアタックや魅せプレイを追及するのも熱い。\n前述の通りワークショップでリプレイの共有が手軽にできるようになったことがSteam版最大の功績だと思う。", "timestamp_created": 1480008196, "timestamp_updated": 1480008196, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.505785", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26182169": {"recommendationid": "26182169", "author": {"steamid": "76561198005708553", "num_games_owned": 251, "num_reviews": 4, "playtime_forever": 364, "playtime_last_two_weeks": 0, "last_played": 1477320809}, "language": "japanese", "review": "子供の頃にやりたかったけどできなかったやつだったので、感激です。\n他の方のレビューにある「下ボタン押してもリール巻き上がらない現象」ですが、ちょっとでも「斜め下からの下」という入力になると巻き上がらないように思います。\n箱コンでは頻発していたんですが、本日スーファミ形状のパッド買ってきたら解消されました。\n", "timestamp_created": 1477228183, "timestamp_updated": 1477228183, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.501513", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25949318": {"recommendationid": "25949318", "author": {"steamid": "76561198149105857", "num_games_owned": 121, "num_reviews": 24, "playtime_forever": 603, "playtime_last_two_weeks": 0, "last_played": 1500751857}, "language": "english", "review": "if you came the first time you realized you could skip spore spawn in super metroid, this game is for you. not only are there multiple ways to get to the exit, there are multiple exits for each level, and multiple ways to get to the end. on top of that, the platforming is momentum-based swinging (my favorite), which gets very hard but not unfair. it's an old game but it's very good. i've had no problems with the port.\n\nim never going to beat this game", "timestamp_created": 1476025830, "timestamp_updated": 1476025830, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25879334": {"recommendationid": "25879334", "author": {"steamid": "76561198041690955", "num_games_owned": 655, "num_reviews": 2, "playtime_forever": 3790, "playtime_last_two_weeks": 0, "last_played": 1486171990}, "language": "english", "review": "Cult classic 2D platformer -- Umihara Kawase is basically *the* grappling hook game. Don't be fooled by the cutesy graphics and laid-back music. It's cold-blooded and brutally difficult.", "timestamp_created": 1475726506, "timestamp_updated": 1475726506, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25662960": {"recommendationid": "25662960", "author": {"steamid": "76561198041017157", "num_games_owned": 252, "num_reviews": 51, "playtime_forever": 1398, "playtime_last_two_weeks": 0, "last_played": 1511387302}, "language": "english", "review": "The Umihara Kawase series, which is about a cute girl armed with a fishing hook and avoiding giant fish, and stayed in Japan for about 19 years, are my top favorite platformers, let alone favorite games.  This first game when it came out on Super Famicom certainly had a lot of competition, with the many platformers such as Big N's having the spotlight, but it managed to shine through and gain a cult following with its unique grappling gameplay and high difficulty.\n\nThe main gimmick of the game, and the series, is Umihara's fishing hook, which can latches on just about any surfaces, pressing down and up readjusts the length, and unlike the swinging mechanics in most games, it's far more sophisticated as the line is very rubbery and the game has a more complex physics/inertia system.  As you're latching on surfaces, you'll have to be swinging all around, putting a lot of weight on the fishing line, and then release the hook from said surface at the right time, to be able to launch yourself in many angles to cross gaps, go under levels, rocketing up walls, and avoiding spikes and many other traps, as well as the ill-mannered fish.  The game uses this one mechanic to its fullest, just as I like my platformers, and mastering it was one of my most rewarding experiences in my gaming life.\n\nThe world of Umihara Kawase isn't some linear trip, but instead is structured like some sort of maze, each Fields (levels) has a door that you have to find to proceed, some of which forks with two doors; it's impossible to see every Fields and access every doors in one playthrough, so coupled with the never-ending learning curve of the physics, there's tremendous replay value.\n\nDespite their size, the levels themselves are pretty open-ended, as you can tackle them however you want; the game may have you take some specific path, but you can skip a lot of it by just scaling up walls, so the gameplay can perfectly reflect your playstyle, and this lack of restrictiveness promotes further the fishing hook's abilities.  The levels can have interesting gimmicks, one of which is fully made of conveyor belts, the other has you propelling yourself using only seahorses, and another has enemies respawing at a faster rate.\n\nCompared to the next 2 entries, the oversized enemy fish have a slight more importance in the level design, as they are more in numbers, and while you can dispatch most of them by stunning them with your fishing hook and pulling them in your backpack, you still have to approach them strategically.  They all have some simple patterns that you have to react accordingly; eels throw some sort of acorn that stuns you, snails circle around platforms, and octopi spit ink that also stuns you and can only be disposed of by yanking them off walls with your weight.  There are also bosses, such as the ever persistent tadpole and flying fish, also requiring strategy, and keeping you on your toes.\n\nAs I've said before, this game is very hard, but it's good difficulty.  Already, mastering the controls would be quite the feat in itself, but level gimmicks certainly give you a run for your money, and enemies may have simple patterns, but they are usually placed in the most troublesome of places.  It certainly doesn't run out of juice for creativity though, as the fshing hook is again used to its fullest, and the game uses the most of its assets.\n\nThere may be a few nitpicks I have, the most notable problem being the tadpole boss in Field 8, which is really not hard and takes about 3 minutes (it's a fixed \"battle\", so you can't do it any faster), you'll have to be fighting him many times if you wish to do 100%, it gets rather tedious.  Speaking of completion, in the SFC version, there wasn't really an incentive to do all of the levels, and unless you were making a map, it was hard anyway keeping track of what you've done.  That also didn't helped with trying to get the best times for replays, as it meant having to do the whole game each time to practice on that one late level.  Thankfully, the map and progression system for this Steam version got a major improvement, the game actually has a Practice Mode, which shows each doors and backpacks you've found, and allowed you to just keep trying for best times.  You still have to go through the classic mode to unlock stages, but that's completely fine.  There may be the occasionnal times when enemies respawn pretty much in you face, but that mostly happens through some very bad luck.  Overall, these issues doesn't make such a negative impact on the whole experience.\n\nAs briefly glossed over, it has a replay feature which, back in 1994, was very impressive, despite of the limited memory size, and the drafts using limited RAM.  In the Steam Version, there's a more friendly interface, more replays can now be saved, and you're no longer likely to lose some precious drafts due to RAM shortage (unless you close the game).  There are also leaderboards for the best times in levels, and the Steam Workshop to share replays.\n\nThe theme of the game is mostly about water locales, oversized aquatic animals, and a strange mixture of assets such as checkerboard tilings on platforms, school supplies and giant veggies in the backgrounds, and photorealistic backgrounds, giving the series a very unique, quirky flair.  The soundtrack is cheerful and enjoyable.\n\nI really want Umihara Kawase to get the acclaim it so deserves, this type of gameplay is rarely ever explored, let alone executed so well.  Mastering the controls is a commitment that I can assure you is well worth it.  Please, spread the word, this game deserves all the love it can get.", "timestamp_created": 1474691274, "timestamp_updated": 1511387270, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.540070", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23961962": {"recommendationid": "23961962", "author": {"steamid": "76561198149146392", "num_games_owned": 204, "num_reviews": 13, "playtime_forever": 160, "playtime_last_two_weeks": 0, "last_played": 1501892429}, "language": "english", "review": "After playing it, you'll understand why it didn't leave Japan for twenty years. Only asians can beat this game", "timestamp_created": 1467310414, "timestamp_updated": 1467310414, "voted_up": true, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.460432", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23012214": {"recommendationid": "23012214", "author": {"steamid": "76561198043764455", "num_games_owned": 122, "num_reviews": 8, "playtime_forever": 452, "playtime_last_two_weeks": 0, "last_played": 1463363805}, "language": "english", "review": "closest i've ever come to breaking a controller in frustration. some of the most absolutely sadistic level design i've ever seen in a platforming game, definitely not for the faint of heart despite its cutesy aesthetic and cheery music.", "timestamp_created": 1463361510, "timestamp_updated": 1463362564, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22738559": {"recommendationid": "22738559", "author": {"steamid": "76561198003518278", "num_games_owned": 348, "num_reviews": 14, "playtime_forever": 19, "playtime_last_two_weeks": 0, "last_played": 1462092802}, "language": "english", "review": "This is a seriously fantastic game. Go check out Arino play this on GameCenterCX.", "timestamp_created": 1462091285, "timestamp_updated": 1462091285, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500760", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22728785": {"recommendationid": "22728785", "author": {"steamid": "76561198011479103", "num_games_owned": 344, "num_reviews": 1, "playtime_forever": 118, "playtime_last_two_weeks": 0, "last_played": 1462062940}, "language": "english", "review": "Umihara Kawase is a pleasantly simple and surprisingly difficult game. It's a platformer with a fishing rod mechanic that is both unique and very well implemented. It's essentially a grappling hook which you use to traverse each level. While it's easy to learn how to use the fishing rod and get yourself moving, a much more experienced player can use the rod to quickly maneuver through levels and take tricky shortcuts. The platforming physics combined with the fishing rod's flexible wire gives you a very free range of motion. I highly recommend watching some speedruns of this game to get an idea of how much freedom of movement the fishing rod can allow. It's a fantastic game for anybody that likes tough platforming, skill-based movement, and a steep curve in difficulty.", "timestamp_created": 1462043106, "timestamp_updated": 1462043106, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502790", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22715174": {"recommendationid": "22715174", "author": {"steamid": "76561198200702853", "num_games_owned": 385, "num_reviews": 84, "playtime_forever": 26, "playtime_last_two_weeks": 0, "last_played": 1461985265}, "language": "schinese", "review": "海腹川背，硬核平台游戏，FC和MD时代的游戏总是有着纯粹的乐趣（与难度）。\n虽然发行商Agatsuma解散了，所幸制作组最前线还在，重新登陆steam。搭载了创意工坊，简直不能更良心。\n让我们帮助这个渔家小姑娘安全回家吧。\nThey say fish is brain food. You’re going to need it!", "timestamp_created": 1461984825, "timestamp_updated": 1461985454, "voted_up": true, "votes_up": 7, "votes_funny": 2, "weighted_vote_score": "0.617725", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22268529": {"recommendationid": "22268529", "author": {"steamid": "76561198088306773", "num_games_owned": 82, "num_reviews": 4, "playtime_forever": 3910, "playtime_last_two_weeks": 0, "last_played": 1510253620}, "language": "english", "review": "I recommend it to anyone interested in challenging 2d platformers.\nThe fishingrod grapple has unique physics and takes some time to\nget used to but that is a good thing.\nPrepare to be annoyed by enemy spawns.", "timestamp_created": 1459948762, "timestamp_updated": 1459948762, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.505287", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22061501": {"recommendationid": "22061501", "author": {"steamid": "76561198127118897", "num_games_owned": 164, "num_reviews": 36, "playtime_forever": 845, "playtime_last_two_weeks": 0, "last_played": 1457803221}, "language": "japanese", "review": "海腹川背シリーズ記念すべき１作目。のSteam版。\n\n難易度としては旬＞これ＞さよならだと思います。\nネズミ返しやカニなど難しいところもありますが、簡単な面が多いかと。\n\nどのシリーズでもそうですが、下を押してもルアーを引っ張れないタイミングがある。", "timestamp_created": 1458992154, "timestamp_updated": 1458992154, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.510702", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21821280": {"recommendationid": "21821280", "author": {"steamid": "76561198130212420", "num_games_owned": 195, "num_reviews": 19, "playtime_forever": 3976, "playtime_last_two_weeks": 0, "last_played": 1492143984}, "language": "spanish", "review": "Umihara Kawase es mi videojuego favorito.\n\nPuedes quejarte de sus mecánicas. Que el salto no abarca el suficiente espacio, que las físicas con la caña de pescar son difíciles de manejar y que la aparición repentina de enemigos cerca de ti es injusta. \nPuedes gritarle al juego, enojarte y decir que es una porquería, pero al final, lo único que podrá quitarte esta frustración y lo único que te va a llevar a vencer el juego y a explorarlo en su totalidad es; incluso por encima de la habilidad, la paciencia.\n\nRelájate, piensa bien lo que vas a hacer e inténtantalo.\nSi no funciona vuelve a intentarlo una vez más.\nSi eso tampoco funciona a lo mejor lo que necesitas es reflexionar y mirar las cosas desde una perspectiva distinta.\n\nY en algún momento, tarde o temprano acabarás por entender que la culpa no la tenia el juego, si no tú.\nAcabas aprendiendo su naturaleza y lo único que puede hacer uno es sentir un profundo respeto ante la sencillez, pero también ante la complejidad de la misma.\n\nUna que establece que nada se consigue de la manera sencilla, y que los objetivos más deseados son aquellos que más trabajo requieren. \nSi eres capaz de pasar por todo éste proceso, al final acabas por dominarlo y cuando ves como consigues pasar fases que antes te resultaban imposibles en apenas unos instantes es cuando sientes que todo ha valido la pena. \n\nY de cómo queda plasmada a la perfección ese axioma tan mayestático que solemos olvidar: \nEl trabajo duro, la paciencia y las ganas de vencer, prevalecen ante todo.\n\n\nAl fin y al cabo, solo uno decide cuándo acaba el juego", "timestamp_created": 1457896997, "timestamp_updated": 1479940760, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.583333", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21199177": {"recommendationid": "21199177", "author": {"steamid": "76561197970056310", "num_games_owned": 434, "num_reviews": 10, "playtime_forever": 138, "playtime_last_two_weeks": 0, "last_played": 1485937812}, "language": "english", "review": "Its the Dark Souls of fishing games.", "timestamp_created": 1455433309, "timestamp_updated": 1455433309, "voted_up": true, "votes_up": 5, "votes_funny": 5, "weighted_vote_score": "0.508105", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19578874": {"recommendationid": "19578874", "author": {"steamid": "76561198111005348", "num_games_owned": 126, "num_reviews": 42, "playtime_forever": 94, "playtime_last_two_weeks": 0, "last_played": 1509349305}, "language": "japanese", "review": "キーボードだと難しい。keyZ=jump keyX=action で矢印キーが移動ね\n\nコントローラーでやること必須", "timestamp_created": 1449647272, "timestamp_updated": 1449647272, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19378967": {"recommendationid": "19378967", "author": {"steamid": "76561198079028361", "num_games_owned": 554, "num_reviews": 46, "playtime_forever": 595, "playtime_last_two_weeks": 0, "last_played": 1511629239}, "language": "koreana", "review": "우미하라카와세의 초대작\n지금 들어도 음악은 촌스럽지 않다. 동화풍의 아기자기한 BGM이 게임내내 당신의 귀를 즐겁게 해줄 것이다.\n낚시를 좋아하는 사람이라면 환장할만한 요소가 다 나온다. 물론 액션게임의 요소도 빠지지 않는다.\n당신의 낚시스킬에 따라서 게임의 재미와 난이도는 천차만별로 변할 것이다.\n액션게임을 좋아하고 낚시를 좋아하면 당장 구매해라\n키보드보다는 패드를 추천!", "timestamp_created": 1448845978, "timestamp_updated": 1448845978, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.513376", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19281300": {"recommendationid": "19281300", "author": {"steamid": "76561197973011829", "num_games_owned": 263, "num_reviews": 1, "playtime_forever": 333, "playtime_last_two_weeks": 0, "last_played": 1457834061}, "language": "english", "review": "Without a doubt my favorite platform game of all time. I've been playing the original Super Famicom version of Umihara Kawase for over 10 years, and it still remains a game I come back to with surprising frequency. This series has a lot to offer with challenging and immensely satisfying rope physics that enable you to do all sorts of gravity defying moves. There's a large selection of levels with ever increasing challenge and multiple exits allow you to carve your own path through the game. The controls can be challenging at first, but if you stick with it you'll soon be able to pull off all manner of elaborate stunts using Kawase's stretchy fishing line.\n\nThis Steam version offers many improvements over the original including a practice mode, leaderboards, eliminating slowdown, and other niceties. \n\nHighly recommended to all platfomer fans. And be sure to check out the other games in this series for more fun with Kawase and the Darwinian nightmare fish.", "timestamp_created": 1448523873, "timestamp_updated": 1448523873, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.585062", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19046003": {"recommendationid": "19046003", "author": {"steamid": "76561198051554085", "num_games_owned": 201, "num_reviews": 6, "playtime_forever": 377, "playtime_last_two_weeks": 61, "last_played": 1513827984}, "language": "english", "review": "girl gets gangbangged by raw fish", "timestamp_created": 1447393219, "timestamp_updated": 1447393219, "voted_up": true, "votes_up": 2, "votes_funny": 3, "weighted_vote_score": "0.387544", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19021549": {"recommendationid": "19021549", "author": {"steamid": "76561198000470993", "num_games_owned": 105, "num_reviews": 5, "playtime_forever": 25, "playtime_last_two_weeks": 0, "last_played": 1449446586}, "language": "english", "review": "Took you TWENTY years to leave Japan, Umihara! Was it a trip by sea, only for those mutated fish to continuously delay your departure by biting holes in your boat or what? Either way, you finally got here. Not that your game was that heavy of a story to really need a full English translation, but the emulation is very solid.\n\nStretching the game to 1080 is a breath of fresh air. Most emulation never made this game look as good as it does right now on Steam. After so many years, we finally have real English menus of this Super Famicom hti that I wanted to play for so long, but just could not properly emulate to run and look good before.\n\nThe controls are MUCH tighter than the other Steam release of Sayonara UmiharaKawase, so much so that I already love this version over that one. The music is bright and cheerful and the cryptic backgrounds look just as disturbing as ever! Truly, this is a very splendid port of a great and fun platforming game.\n\nI wish more Super Nintendo games could be ported to Steam in such a similar fashion. They could easily import more games on here that never saw release overseas. This game is just the start of that very thing happening here. Playing this with my 8Bitdo SFC30 controller is the best experience.", "timestamp_created": 1447278987, "timestamp_updated": 1447278987, "voted_up": true, "votes_up": 13, "votes_funny": 2, "weighted_vote_score": "0.626193", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18998605": {"recommendationid": "18998605", "author": {"steamid": "76561198000124510", "num_games_owned": 151, "num_reviews": 19, "playtime_forever": 300, "playtime_last_two_weeks": 0, "last_played": 1474769400}, "language": "english", "review": "Listen to the music!  https://www.youtube.com/watch?v=U5DLI9muO3w\n\nThis game is super difficult and fun. It's a puzzle platformer where you use a rubber fishing line as a hookshot to get around places, while avoiding puzzle-traps and rad enemies. The fishing line's length can be adjusted during use, and it can be used to pull enemies to their deaths. If you pull an enemy off a ledge and you're still holding on as he falls, he'll also pull you to your death. It's pretty funny. Most levels have multiple exits that will progress you one stage further, or let you skip stages if the exit is either harder to get to or a secret. Anything else I can tell you is obvious information you can learn from watching the store video.\n\nAnyway, if you like Mario Bros. 3 for the challenge, this game is for you. It's a classic.", "timestamp_created": 1447192128, "timestamp_updated": 1447192128, "voted_up": true, "votes_up": 9, "votes_funny": 1, "weighted_vote_score": "0.579332", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18934916": {"recommendationid": "18934916", "author": {"steamid": "76561198020905060", "num_games_owned": 106, "num_reviews": 5, "playtime_forever": 829, "playtime_last_two_weeks": 0, "last_played": 1451651727}, "language": "japanese", "review": "まだ日本語のレビューが無いから紹介がてらレビューを。\n\n諸般の事情かクレジット表記がないですが、元はスーパーファミコンで\n発売されたアクションゲームです。\n\n主人公の名前、海腹川背がそのままゲームタイトルになっているのは、\nステージ内容が心の中の世界という裏設定からなのでしょうか。\nそのくせ、主人公が操るルアーアクションは妙に生々しく、\n様々な物理の法則をくすぐってきます。\nコントローラーの十字キーを巧みに動かし、ルアーを使えば\n歩く、ジャンプ、投げるの基本動作だけで思った以上の\nアクションであなたの想像以上に動きまくれます。\n\nなので、魚が歩いてるとか、おたまじゃくしがカエルを産んでるとか、\nそういう世界観への冷ややかなツッコミは、とりあえずおいといて、\nまずは自由自在に主人公を操れるよう、しっかり練習しましょう。\n\n旧作ゆえに、スーパープレイの動画が沢山ネットにあがっていますが、\nネタバレしても再現できないくらいの超絶プレイだったりするので、\nまあ、それらは参考程度にとどめ、いずれ海腹川背さんへの愛で\nそこまでなれるという風に想いながらルアーに慣れていってください。\n\nSteam版の、このゲームに関して特に操作で不都合はないですが、\n\n・BGM音量が初期値の30だと鳴らない（50あたりが適正）※11/09追記\n・ゲーム画面以外を選ぶとBGMが鳴らない\n・シーンの切り替わりでBGMの切り替わりが遅い\n\nといったBGMがらみで気になる点があります。\nまあ気が向いたらオプション等、対応していただけたらいいな程度です。\n\n恐らくはマイナーな部類の海腹川背シリーズ。\n実は結構いろんなゲーム機で発売されています。\n\nその中で一番基本に忠実、まさしく原点となっているのが本作です。\nもしも今風のゲームシステムを望むなら、新作の「さよなら海腹川背」もあるし、\n本作の続編、プレイステーションで発売された「海腹川背・旬」も\nSteamに移植されるとの噂があるので、そちらにも手を出してみては如何でしょうか。\n\n最後に。このゲームでコントローラーは実質”必須”です。\nそのため左親指を酷使しすぎて腱鞘炎にならないよう、\n気を付けながら、海腹川背ワールドを存分に楽しみましょう。", "timestamp_created": 1446917846, "timestamp_updated": 1447068613, "voted_up": true, "votes_up": 38, "votes_funny": 2, "weighted_vote_score": "0.808830", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18933873": {"recommendationid": "18933873", "author": {"steamid": "76561198020235865", "num_games_owned": 312, "num_reviews": 7, "playtime_forever": 40, "playtime_last_two_weeks": 0, "last_played": 1462857583}, "language": "english", "review": "The best SNES game is now available on Steam and it's the definitive version too. It's more than just a port. It's fully-trnaslated, lagless and has an option to practice stages like in Shun and Sayonara. Practicing stages records your IL times too, with a leaderboard that is implemented seamlessly. I've put so many hours into this game on emulators that I just had to buy it legit. You should too.", "timestamp_created": 1446914477, "timestamp_updated": 1446914477, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502297", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18855806": {"recommendationid": "18855806", "author": {"steamid": "76561197999753191", "num_games_owned": 361, "num_reviews": 11, "playtime_forever": 348, "playtime_last_two_weeks": 0, "last_played": 1506828794}, "language": "english", "review": "First, Sayonara Umihara Kawase (3rd game) was ported to steam. Now the first game in the Umihara Kawase series is finally on steam and Umihara Kawase Shun (2nd game) is on it's way before the end of 2015. What a time to be alive.\n\nUmihara Kawase originally came out on the Super Famicom in December 1994 but never got a proper English release until 2015 when it was included as a bonus game with the PS Vita version of Sayonara (and now the PC version as a stand alone release). \n\nThe objective of this game is to go from the beginning of a stage and get to a door (sometimes there's 2 doors that you can choose from, the harder to reach one being a shortcut to later fields) via your trusty fishing rod and by that I mean you gotta grapple, swing and fling yourself across wacky platfoming levels all the while avoiding enemies (fish with legs and a boss or two) and using your crazy rubberband physics skills to get to the exit fast (if you want to speedrun or impress your friends). The game ends either when you run out of lives or you reach one of the final exit doors.\n\nBefore some levels, the game shows you a thing you can do to get through that level, either how to get across some gap or dealing with an enemy or just stuff to help you win at the game.\n\nI don't recommend playing this on keyboard as it has controller support and it feels much better imo playing any of the games in the series with a controller/handheld system. But if you can master keyboard controls then you're a pretty cool person.\n\nMusic is nice, pretty simple but catchy I guess.\n\nOne thing this game had going for it back when it first came out was the ability to save replays. That feature is still around but you also have leaderboards too so if you like leaderboard stuff then you're good to go.\n\nIt's easy to learn for most, a lifetime to master for some. It's Umihara Kawase.", "timestamp_created": 1446554205, "timestamp_updated": 1446554205, "voted_up": true, "votes_up": 24, "votes_funny": 3, "weighted_vote_score": "0.761081", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18854744": {"recommendationid": "18854744", "author": {"steamid": "76561198015730671", "num_games_owned": 505, "num_reviews": 8, "playtime_forever": 374, "playtime_last_two_weeks": 0, "last_played": 1448399609}, "language": "french", "review": "SHUT UP AND TAKE MY MONEY !\n\nUn jeu très peu connu en dehors du Japon, sortie sur Super Famicom (Super Nintendo chez nous) et oui ce jeu a donc plus de 20 ans.\n\nC'est un jeu de plateforme, on utilise une canne à pêche comme un grapin et le but est d'arrivé, avant la fin du chrono, à la porte de sortie du niveau.\n\nPourquoi acheter ce jeu plutôt que de DL la version SNES sur émulateur ? est bien plusieurs raison !\n\n- Succès Steam (bon ça osef mais ne soyons pas sectaire)\n\n- Cartes Steam histoire d'avoir des centimes en plus sur le wallet ou bien avoir la classe avec un badge que personne ne verra car, franchement le nombre de personne qui trainent sur le Steam Activity sont aussi nombreux que les utilisateurs Linux sur Steam (troll gratuit dsl :p)\n\n- Classement en ligne et sauvegarde dans le Nuage de Vapeur, histoire de ne pas laissé allumée pendant 20 ans la SNES pour ne pas perdre la sauvegarde à cause de la pile de la cartouche SNES (Oui oui, faites un tour sur le net, vous verrez qu'un Japonais à laissé sa console allumée pendant 20 ans ^_^)\n\n- Steam Workshop, histoire partager notre esprit masochiste aux heureux possesseur de cette petite perle vidéoludique <3\n\nEt d'après un communiqué de press, la version Shun (sortie sur PS1) verra aussi le jour sur Steam \\o/\n\nBref, sort ta CB du porte feuille et valide l'achat d'un clic franc et avec pleins d'étoiles dans les noeils :3\n", "timestamp_created": 1446548624, "timestamp_updated": 1446548624, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18842509": {"recommendationid": "18842509", "author": {"steamid": "76561198212719924", "num_games_owned": 12, "num_reviews": 2, "playtime_forever": 596, "playtime_last_two_weeks": 0, "last_played": 1446902556}, "language": "english", "review": "An amazing game.\nPrepare to buy a new controller. These fish are gonna walk all over you. This game sure has a quaint sense of humor. \nThis game, It reminds me of how simple and superficial most modern games are. In this game the focus is the gameplay. I can't stress this enough. The gameplay is challenging but there is more to it than simply being hard. It feels balanced and well thought out. If you are looking for a game that doesn't try to wow you with fancy new paint job on a well known trite formula that you've seen two dozen times, then this is a game for you.\n* Have a strong dislike to fish and aquatic life forms?\n* Like sending a small child to cling off a cliff with a rubbery fish line and possibly let her descent to her death (repeatedly)?\n* Always felt tadpoles give birth to frogs and not the other way around?\nIf you answered yes to any of this questions go see a doctor but either way buy this game and play it, it's good.", "timestamp_created": 1446488578, "timestamp_updated": 1446488578, "voted_up": true, "votes_up": 14, "votes_funny": 9, "weighted_vote_score": "0.667578", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18837584": {"recommendationid": "18837584", "author": {"steamid": "76561197996299194", "num_games_owned": 131, "num_reviews": 7, "playtime_forever": 9, "playtime_last_two_weeks": 0, "last_played": 1446605847}, "language": "english", "review": "I bought it because because of the cute fishies.", "timestamp_created": 1446472467, "timestamp_updated": 1446472467, "voted_up": true, "votes_up": 12, "votes_funny": 20, "weighted_vote_score": "0.334822", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18834761": {"recommendationid": "18834761", "author": {"steamid": "76561198014925671", "num_games_owned": 327, "num_reviews": 8, "playtime_forever": 47, "playtime_last_two_weeks": 0, "last_played": 1447248393}, "language": "english", "review": "[h1]if your only experience with grappling rope based platformers is bionic commando, beware: you don't know nothin about swingin[/h1]\n\nthe original umihara kawase is one of the most deceptively cryptic and brutally punishing platformers ive ever played and under its cutsey aesthetic lies only deception, horror, and the judging eyes of strange aquatic life who will trot back and forth over your charred decimated remains after this rubbering action game is done with you\n\nits got everyones favorite waifu though so its super cool", "timestamp_created": 1446459999, "timestamp_updated": 1446460650, "voted_up": true, "votes_up": 60, "votes_funny": 37, "weighted_vote_score": "0.745468", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39112526": {"recommendationid": "39112526", "author": {"steamid": "76561198034306697", "num_games_owned": 1089, "num_reviews": 477, "playtime_forever": 1738, "playtime_last_two_weeks": 1179, "last_played": 1515233688}, "language": "english", "review": "[b]A very difficult physics-based puzzle-platformer originally released exclusively in Japan on the Super Famicom and was included as an extra game in some of its sequels.[/b] The gameplay overall is still exactly the same as the SuFami version with many performance improvements. This Steam version in particular is supposedly closer to the Vita version. \n\nPlaying with a controller is strongly recommended if just for the facts that the keyboard controls take a bit to get used to in the menus & even in-game, and that I've never figured out how to rebind the keys if it's even possible.\nGraphics and sounds are exactly the same as the SuFami version if not extremely similar. The title of the game in the main menu and the entirety of the end-credits are in Japanese, but the rest of the game—the important aspects—are in English.\nThe music & theme of the game are pretty cheery, however they only lighten the mood a bit for the incredible difficulty in the gameplay.\nIt's not actually a hindrance, but for whatever reason, they decided to keep the interface such as the score & timer close to the middle of the screen just like in the SuFami version.\n\nThe game is simply about going through a level as a backpack-wearing girl in a very surreal, sea-themed environment to reach an exit door using a unique style of platforming where you swing around with a hook and rubber fishing line. The hook & line is also your only method of attacking. All the enemies are sea creatures of some kind and they can be hooked, often stunning them, and then \"captured\" if you touch them with the hook still on.\nIt isn't at all like other games with \"swinging\" mechanics; the elasticity of the fishing line can look simple on the outside, but actually using it takes skill. Its physics can be downright irritating to get the hang of because of how bouncy and confusing the rubber fishing line seems at first, but it can be manipulated and used to get through the game in unique ways. The only trouble is that it may take a while to even get a familiar grasp on how the mechanics work. There are only a few tutorials in the game that show you how you can use the fishing line, though they're all just basic techniques for getting through the first few levels. Everything else will have to be self-taught one way or another. Even watching walkthrough videos may likely not be helpful enough; it's one thing to see what someone does and how they pass an obstacle, it's another to actually execute what they do as simple as they may make it look.\nThe better you get with the the mechanics, the faster and more inventive you can be in getting through a level, and progression throughout the game absolutely requires you to improve.\nThere's a Practice Mode available for levels you've unlocked where you can practice a particular level as many times as you want. The only way to unlock more levels for Practice Mode is to reach them when doing a new playthrough.\n\nThe main goal of the game is to reach one of the \"Ending\" stages where the game's done when you beat said stages. There are 49 total levels—or \"Fields\"—in the entire game. They're numbered \"Field 0\" to \"Field 57\" but 9 of the numbers don't exist for some reason. It's actually impossible to go through all of them in one single playthrough. Field 2 can take you to Field 10, Field 11 can take you to Field 8, Field 15 to Field 40, 40 to 26, and so on, meaning that higher numbers don't necessarily mean you're closer to the end of the game.\nThe levels start off linear for the first few levels, but very shortly multiple exits will start to appear, which grants one of the game's non-linear styles of level progression. The basic gist of these multiple exits is that the harder it is to reach them, the harder the levels behind the doors usually are, and some of these exits are behind some serious skill-walls. This can lead to immense frustration without the right knowledge of how the physics work.\nWithout memorization or a map of some kind, there's no way to know what level is behind the next door.\n\nEach new playthrough starts you off with 10 lives, which can easily vanish due to the game's difficulty. Extra lives, in the form of backpacks, can only be acquired in specific Fields in specific locations, often behind skill-walls themselves. Acquiring them and then dying doesn't respawn them. \nThere's a timer for each stage, usually around 5 minutes. If you've spent over 30 minutes in a playthrough and haven't reach an Ending Field by that point, then the next exit you take will take you to one of the 4 Ending Fields. One of the Ending Fields can only be accessed this way; depending on the player's skill and choice in doors, they'll probably come across the secret Field naturally anyway.\nThere's no real ending to the game. All the \"Ending\" doors just brings up the untranslated credits and then the game's over.\n\nThere are a few bosses in the game and only 2 that you have to \"fight\", but the rest are pretty much just about surviving until they leave or they make the exit door accessible; one of those bosses isn't even a real boss anyway as all it does is attack and gets in your way, like a giant, barely mobile attack-sentry.\n\nOverall, the game's just a test of one's skill. There's no real story as far as I know since reaching an Ending just brings up the credits. Successful playthroughs don't often take more than an hour.\nThere's not actually a whole lot to do aside from unlocking all of the levels and doing the achievements. It's great for those who want a serious challenge and a unique style of platforming.", "timestamp_created": 1515232436, "timestamp_updated": 1515233776, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}}
