{"reviews": {"39419617": {"recommendationid": "39419617", "author": {"steamid": "76561198118853077", "num_games_owned": 539, "num_reviews": 31, "playtime_forever": 2771, "playtime_last_two_weeks": 0, "last_played": 1511419098}, "language": "english", "review": "Review originally posted [url=https://www.backlog-assassins.net/posts/w795pjl]here.[/url]\n\n10/10\n\nAll of Higurashi is good, but Meakashi is when it gets really good.\n\nThe fifth arc of the eight-arc visual novel series marks the transition from the first half’s ‘question’ arcs to the second half’s ‘answer’ arcs. It starts off with a bang, placing the reader in Shion Sonozaki’s shoes rather than the previous protagonist, Keiichi Maebara. The game starts off a year before the first three arcs do, and then continues on to follow the plot of the second arc up until its conclusion, all from Shion’s perspective.\n\nThis is wonderful. Shion, the one main character introduced in the second arc rather than the first, had always been a bit of a dark horse. By seeing things from her perspective, the narrative opens up and 07th Expansion begins to give readers answers to their questions as well as rounding out her character and her twin sister Mion’s as well. The end of this arc shows us a change that starts a pattern that will repeat in the upcoming answer arcs, eventually setting the state for the finale arc.\n\nI’ve read through all of Higurashi once before, so reading it again lets me pick out all of the foreshadowing I didn’t see the first time. Shion is probably my favorite character, so of course I’m going to love a whole episode from her perspective! That perspective isn’t always a good one, though - while her situation is sympathetic, Shion takes things way out of line by the end. She’s an interesting, complex character and it shows how far someone can go when pushed - but how that same someone can be so single-minded to forget incredibly important things that end up making the situation way way worse by their own hand.\n\nThis is all, of course, meaningless taken on its own. Higurashi is meant to be read all together in order. If you’re at all interested in Higurashi, start with the first chapter and go on from there. Each one is better than the last (well, except the fourth one, but that’s an extra one anyway).\n\nNote on graphics: I dislike the MangaGamer sprites and used the PS3 sprites and Voices patch to play with the PS3 release’s sprites, which I love. I also want to note here how lovely the background art is - it’s very detailed and lively in a very appealing way.", "timestamp_created": 1516214680, "timestamp_updated": 1516214680, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39314128": {"recommendationid": "39314128", "author": {"steamid": "76561198050637112", "num_games_owned": 176, "num_reviews": 31, "playtime_forever": 699, "playtime_last_two_weeks": 699, "last_played": 1515860152}, "language": "english", "review": "Don't worry after this chapter according to the author there would be another one called Tsumiboroshi- the only regret I have so far is I watched all seasons of the anime including OVA's and I think everything I read so far is portrayed in the anime, but this was many years ago so I can't tell it for sure. So coming back to the story and everything else. What can I say.. It really moved me- I knew this story but I did forget about it but even tho the memories were coming back I still cried and lamented for the outcome. I'm going to answer the simple question asked by the author and that is well- when people commit murder depending on the motive I could sympathise, since sometimes even the worst serial killer would have certain motives that we can't hope to understand unless we are them. Sometimes psychopathy is totally induced because of a dysfunction in the brain which can happen at birth, cerebral injury and all sorts. Sometime's that not even the case the environment just contributes you to loose yourself. \n\nThis arc is the most depressing one and the most interesting and it STILL does not answer the most anticipated question the readers want to know. However, will clear out certain doubts you may have. And at some point (if you have not watched the anime at all) then this must be one of the biggest plot twists of all time for you. Also as Watanagashi this chapter may also strike twice as gorey than the latter so prepare yourself. The story mainly focuses on well how the pain of loosing someone close to you would end up tearing you apart and also how normal human beings could sometimes turn to be a demon. Humans at the same time can be either angels, demons or even humans. It's their choice sometimes it's not. But, whatever the situation is in this chapter it's obvious that there is more under the rug than the surface. So this would just make you speculate more things than solving. After all it's just one answer arc so don't get disappointed yet lol. You'd get to see in depth the mystery around Houjou Satoshi's disappearance as well as Keiichi Maebara coming to Hinamizawa. The chapter answers the most vague questions related to Watanagashi. The story is also a bit longer than others I think. \n\nIn terms of art it was really good. You can see the character arts of people you haven't seen before. Make sure the graphic and voice patch is on for this chapter- since Higurashi mainly is famous for it's superior voice acting, you would miss a lot if you don't put it on. The music thankfully is much more better than the other higurashi chapters thank god! It's so suited than the previous music and I hope the music stays improved in the next chapters as well. There isn't an All Cast Review Session as in the previous chapters and a new thing called staff room is there instead. The tips should be carefully read too, even after the ending new tips would be unlocked and it would shed more light into the mystery bits of the story. At the ending scenario it felt like even tho I was depressed- just to increase it more I got another kick in the stomache lol. \n\nLastly, I would want to thank the people who made the graphics and voice patches, (it's a lot of work really and it's tough so please if you are good at programming help the 7mods guys at Github) and my kind boy friend who bought me this chapter and my friend who gifted the third chapter for me. I hope the next chapter will be awesome! :D", "timestamp_created": 1515862393, "timestamp_updated": 1515862393, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.530201", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39197521": {"recommendationid": "39197521", "author": {"steamid": "76561198013571522", "num_games_owned": 678, "num_reviews": 385, "playtime_forever": 594, "playtime_last_two_weeks": 0, "last_played": 1514206054}, "language": "german", "review": "Nice Everything!", "timestamp_created": 1515465814, "timestamp_updated": 1515465814, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39130535": {"recommendationid": "39130535", "author": {"steamid": "76561198199461541", "num_games_owned": 152, "num_reviews": 30, "playtime_forever": 441, "playtime_last_two_weeks": 223, "last_played": 1515269770}, "language": "japanese", "review": "長かった…祟殺しレベルで長い。単に物語に感情を爆発させるシーンが多いから時間感覚が狂ってるだけかも知れません。\n綿流しの解決と言うか裏で起こった出来事が中心で回ります。大体の出来事の解答が書かれていました。\nただ、まだまだ残っている謎とより強調された謎が出てきます。\n\n終わって思ったのは　　は”哀れ”とかでしたが最初だけでよくよく考えるとあいつのほうが踏んだり蹴ったりでホントかわいそかわいそ。", "timestamp_created": 1515271219, "timestamp_updated": 1515272359, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39067468": {"recommendationid": "39067468", "author": {"steamid": "76561198075499494", "num_games_owned": 117, "num_reviews": 8, "playtime_forever": 827, "playtime_last_two_weeks": 0, "last_played": 1505873929}, "language": "english", "review": "TOO. MUCH. READING. Higurashi When They Cry Hou - Ch. 5 Meakashi showed up in my reccomended games because I had played Huniepop, it was an instant buy because of the hot girl on the preview image and I was hoping for a similar pleasure-filled experience. While I did get some hot girls (Shion is my favorite), I had to sit through hours of boring dialogue to get to the h-scene near the end. I reccomend this game to those who enjoy big breasted girls like myself and $7.99 for the erection this game gives me is well worth it. I just hope MangaGamer cuts out most of the dialogue in the next game and gets right to the good stuff.", "timestamp_created": 1515111103, "timestamp_updated": 1515111103, "voted_up": true, "votes_up": 0, "votes_funny": 3, "weighted_vote_score": "0.366620", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39004871": {"recommendationid": "39004871", "author": {"steamid": "76561198139127613", "num_games_owned": 23, "num_reviews": 23, "playtime_forever": 103, "playtime_last_two_weeks": 0, "last_played": 1514279584}, "language": "german", "review": "Auch das 2. Kapitel Meakashi ist ein gelungenes Werk und liefert natürlich wieder eine ansehnliche Menge an Details die der Anime ausgelassen hat.", "timestamp_created": 1514972148, "timestamp_updated": 1514972148, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.464135", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38898778": {"recommendationid": "38898778", "author": {"steamid": "76561198057520830", "num_games_owned": 325, "num_reviews": 29, "playtime_forever": 655, "playtime_last_two_weeks": 0, "last_played": 1500956571}, "language": "english", "review": "Boy.", "timestamp_created": 1514721552, "timestamp_updated": 1514721552, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.492537", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38878134": {"recommendationid": "38878134", "author": {"steamid": "76561198109193310", "num_games_owned": 268, "num_reviews": 8, "playtime_forever": 617, "playtime_last_two_weeks": 0, "last_played": 1514832783}, "language": "brazilian", "review": "Higurashi When They Cry Hou - Meakashi, oque dizer desse jogo? F - A - N - T - A - S - T - I - C - O, se prepare para descartar tudo o que você achava que sabia que ocorreu no volume 2, e levar um dos maiores plot twist da sua vida, COMO ESSE JOGO É BEM ESCRITO, A TRILHA SONORA N FICA ATRAS..\n\nNÃO TENHO O QUE DIZER 10/10 JOGUEM HIGURASHI", "timestamp_created": 1514671530, "timestamp_updated": 1514671530, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38864623": {"recommendationid": "38864623", "author": {"steamid": "76561198287763289", "num_games_owned": 1593, "num_reviews": 165, "playtime_forever": 121, "playtime_last_two_weeks": 0, "last_played": 1514640954}, "language": "tchinese", "review": "全成就+1。\n\n+劇情有意思\n+壞掉\n\n-沒中文\n\n基本上看過動畫，遊戲沒中文就懶了。\n趁著HB出組包入手收藏。\n做為龍騎士07的成名作，純視覺小說沒有選項。\n作為推理故事但是沒有解答的設計很有趣。\n1~4章是為出題篇，在不同的時間軸上去分析內幕。\n第5章後才是解答篇，也是在不同的時間軸。\n\n遊戲設定上可以改成看角色原始模樣，很有趣。\n在詳細上遊戲應該比動畫要好。\n不過這部要看獵奇，要看顏藝跟壞掉，還是要看動畫或漫畫阿。\n\n壞掉好棒啊~~\n", "timestamp_created": 1514648093, "timestamp_updated": 1514648093, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38757631": {"recommendationid": "38757631", "author": {"steamid": "76561198050821024", "num_games_owned": 78, "num_reviews": 15, "playtime_forever": 559, "playtime_last_two_weeks": 0, "last_played": 1514352866}, "language": "english", "review": "Loved it.", "timestamp_created": 1514415865, "timestamp_updated": 1514415865, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38692075": {"recommendationid": "38692075", "author": {"steamid": "76561198102676841", "num_games_owned": 660, "num_reviews": 5, "playtime_forever": 131, "playtime_last_two_weeks": 0, "last_played": 1514048474}, "language": "schinese", "review": "我们需要中文\nWe need Chinese\n中国語は必要\nNous avons besoin de chinois\nWir brauchen chinesisch\nNecesitamos chino\npotrzebujemy chin\nPrecisamos de chinês\nНам нужно китайский \nเราต้องการภาษาจีน\nΧρειαζόμαστε κινέζικα", "timestamp_created": 1514285223, "timestamp_updated": 1514285223, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.345327", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38660131": {"recommendationid": "38660131", "author": {"steamid": "76561198367885179", "num_games_owned": 606, "num_reviews": 7, "playtime_forever": 215, "playtime_last_two_weeks": 0, "last_played": 1514380243}, "language": "schinese", "review": "想念那一个个消逝的夏天，想念那耀眼的阳光、温暖的风，以及...那一次次清脆悠曳的蝉鸣。\n或多或少的牵挂，或悲或喜的命运，好似树上形状各异的叶；有些色泽鲜艳，有些枯黄暗淡，但却有着一样的经络分明，在树上缀满，在风中摇曳。叶的间隙，掩不住阳光，盖不过蝉鸣，更藏不住一次次熟悉的故事，熟悉的人、朋友...\n       寒蝉鸣泣之时，关于追溯真相，还原事实的故事。它还原的不仅仅是死亡的真实样貌，更是还原了人性的本来面目。\n　　\n　　雏见泽,在这个人口不足2000人的小村子里，每年都会发生一些奇怪的事情。\n　　雏见泽村连续怪死事件(1979年～1983年)：每年6月的某日，一定会有1人死亡，1人消失，十分离奇。围绕着巨大水库的争斗死亡的惨案连续发生，隐藏在昭和中期的怪事逐个清晰起来了。\n　　这是阴谋，是偶然，还是有什么东西在作祟。\n　　应该存在的人消失了，不应该存在的人出现了。\n　　昨夜相会的人已经死了，现在活着的人也死了。\n　　\n　　惨剧不可避免。除了屈服别无他法。\n　　但是，不能屈服。\n　　只有你才能去面对。\n　　\n　　夜蝉的鸣声依旧，仿佛宣告着这个早来的夏日。\n　　\n　　人性，是比死亡更让人恐慌且避之不及的存在。\n　　每一篇章，都会有一段极其冷静的陈述。\n　　每集片尾，都会有一段预告词在进行着极度迫切的追问。\n　　\n　　《鬼隐篇》\n　　请你不要哭泣。\n　　即使世间不能原谅你的罪恶，我也将会宽恕。\n　　请你不要哭泣。\n　　即使你不能原谅这个世界，我也将会从容。\n　　所以 请告诉我。\n　　我要怎样做 才能得到你的饶恕。\n　　1.\n　　能相信吗 亲眼所见的事实\n　　能相信吗 所发生的事实\n　　能相信吗 我\n　　寒蝉鸣泣之时 鬼隐篇 其之二 隐情 你 能相信吗？\n　　2.\n　　你所能看到的 只是虚伪的居所\n　　在那能看到的 只是空虚的眼神\n　　我所能看到的 只是重演的悲剧\n　　寒蝉鸣泣之时 鬼隐篇 其之三 疑心 你 能相信吗？\n　　3.\n　　请不要畏惧 明日的彼方\n　　请不要伤害 你的心灵\n　　请不要道歉 昨日的一切\n　　寒蝉鸣泣之时 鬼隐篇 其之四 歪 你 能相信吗？\n　　4.\n　　希望你能凝视 真正的自我\n　　希望你能原谅 无常的你\n　　希望你能理解 另一个我\n　　寒蝉鸣泣之时 绵流篇 其之一 嫉妒 你 能相信吗？\n　　\n　　《绵流篇》\n　　不能治愈你的饥渴。\n　　因为追求真实的你 不能认同。\n　　不能治愈你的饥渴。\n　　因为你所的追求真实 并不存在。\n　　尽管如此 还是渴望着满足你的希望。\n　　因为把你扔进沙漠的人 正是我自己。\n　　1.\n　　想见到的 是黑暗中的形状\n　　想听到的 是迟疑的脚步声\n　　想知道的 是真正的居所\n　　寒蝉鸣泣之时 绵流篇 其之二 鹰野 你 能相信吗？\n　　2.\n　　正在颤抖的 是你的心灵\n　　正在靠近的 是黑暗之影\n　　正在冻结的 是虚伪的我\n　　寒蝉鸣泣之时 绵流篇 其之三 谎言 你 能相信吗？\n　　3.\n　　无法终结的 后悔\n　　无法致歉的 故事\n　　铭刻在那的 是另一个我\n　　寒蝉鸣泣之时 绵流篇 其之四 愿望 你 能相信吗？\n　　4.\n　　已经忘却的是 你的那份温柔\n　　不断重复的是 悲伤的脚步声\n　　邀你进门的是 记忆的小碎片\n　　寒蝉鸣泣之时 崇杀篇 其之一 哥 你 能相信吗？\n　　\n　　《崇杀篇》\n　　井底的青蛙是幸福的。\n　　因为它不理会井外的世界。\n　　井底的青蛙是幸福的。\n　　因为井外的世界与它无关。\n　　然而你也是幸福的。\n　　因为你对世界一无所知。\n　　1.\n　　无法全部拯救的 是一行泪水\n　　无法完全阻止的 是向绝望的呐喊\n　　将来拜访的 是仇恨的连锁\n　　寒蝉鸣泣之时 崇杀篇 其之二 羁绊 你 能相信吗？\n　　2.\n　　所寻求的 是往昔所拥有的安睡\n　　所听到的 是充斥着恶意的雨声\n　　所流入的 是通向黑暗的门扉\n　　寒蝉鸣泣之时 崇杀篇 其之三 分界 你 能相信吗？\n　　3.\n　　诱惑的是 后悔的脚步声\n　　追赶的是 疑惑的脚步声\n　　彷徨的是 另一个自己\n　　寒蝉鸣泣之时 崇杀篇 其之四 失物 你 能相信吗？\n　　5.\n　　脚步声 是由过去而来的细语\n　　所看见的 是迷雾之中的真实\n　　所听到的 是给予你的宽恕\n　　寒蝉鸣泣之时 崇杀篇 其之五 谢罪 你 能相信吗？\n　　6.\n　　来访的，是黄昏的光辉。\n　　闯入的，是时光的黑暗。\n　　邂逅的，是过去与未来的间隙。\n　　寒蝉鸣泣之时 暇溃篇 其之一 雏见泽 你 能相信吗？\n　　\n　　《暇溃篇》\n　　问我谁是真凶？\n　　这不正是寻找它的故事吗？\n　　问我真凶是谁？\n　　知道那是“什么”的真凶吗？\n　　谁是凶手？\n　　将要杀死我的凶手是谁？\n　　1.\n　　所追求的 是不变的容貌\n　　所寻找的 是阳光的退路\n　　被给予的 是如旧的悲伤\n　　寒蝉鸣泣之时 暇溃篇 其之二 征兆 你 能相信吗？\n　　2.\n　　邂逅的 是指向温柔的代价\n　　坠落的 是通向悲伤的迷宫\n　　焦虑的 是走向憎恨的思绪\n　　寒蝉鸣泣之时 明目篇 其之一 初恋 你 能相信吗\n　　\n　　《目明篇》\n　　波珠遗失在沙漠里 少女哭泣着。\n　　百年间少女在沙漠里搜寻。\n　　或许是海洋而不是沙漠 少女哭泣着。\n　　百年里少女在海洋间搜寻。\n　　或许是山丘而不是海洋 少女哭泣着。\n　　存在或不存在 还要质疑几百年？\n　　1.\n　　所失去的 是平日的归路\n　　无法守护的 是与你的约定\n　　无法消去的 是我的回忆\n　　寒蝉鸣泣之时 明目篇 其之二 区别 你 能相信吗\n　　2.\n　　被消去的 是记忆的芬芳\n　　所看到的 是仇恨的伤痕\n　　所响起的 是过去的足音\n　　寒蝉鸣泣之时 明目篇 其之三 鬼之血脉 你 能相信吗\n　　3.\n　　所追求的 是仅有的安稳\n　　所见到的 是仇恨的回廊\n　　所堕落的 是黑暗的彼方\n　　寒蝉鸣泣之时 明目篇 其之四 复仇 你 能相信吗\n　　4.\n　　所碰触的 是摇曳的面容\n　　所响彻的 是悲伤的回音\n　　所散发的 是烧毁的回忆\n　　寒蝉鸣泣之时 明目篇 其之五 冰冷的手 你 能相信吗\n　　5.\n　　所路过的 是往常的歧路\n　　所驰骋的 是黑暗的拐角\n　　所到达的 是破灭的深穴\n　　寒蝉鸣泣之时 明目篇 其之六 断罪 你 能相信吗\n　　6.\n　　被束缚住的 是过去的残像\n　　被邀请的 是来自未来的假像\n　　在那里的 是另一个恶作剧\n　　寒蝉鸣泣之时 罪灭篇 其之一 幸福 你 能相信吗\n　　\n　　《罪灭篇》\n　　“下次一定” 如果是第一次，我也会这样期待。\n　　——面对这不可回避的惨剧。\n　　“还是这样吗” 如果是第二次，我还会这样叹息。\n　　——面对这不可回避的惨剧。\n　　如果是第三次，期待将超越叹息成为痛楚。\n　　数第七次，悲剧也会变得如此的荒唐而可笑。\n　　1.\n　　所贯穿的 是幸福的回忆\n　　所立下的 是与朋友的誓言\n　　所挽救的 是片刻的犹豫\n　　寒蝉鸣泣之时 罪灭篇 其之二 归所 你 能相信吗\n　　2.\n　　所驰骋的 是平日的归路\n　　所蠢动的 是不幸的饿通知\n　　被打开的 是欺骗的剪报\n　　寒蝉鸣泣之时 罪灭篇 其之三 34号文书 你 能相信吗\n　　3.\n　　渗出的血 是过去的回忆\n　　察觉到的 是罪孽的深重\n　　在那里的 是终结的未来\n　　寒蝉鸣泣之时 罪灭篇 其之四 地球侵略 你 能相信吗\n　　4.\n　　所误入的 是回忆的教室\n　　所响起的 是通向绝望的计时器\n　　所到达的 是起始的终结\n　　寒蝉鸣泣之时 罪灭篇 其之五 重摄 你 能相信吗\n\n       在这寒蝉鸣泣之时，哪天，我会被杀", "timestamp_created": 1514212473, "timestamp_updated": 1514216546, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38568520": {"recommendationid": "38568520", "author": {"steamid": "76561198423035617", "num_games_owned": 109, "num_reviews": 11, "playtime_forever": 166, "playtime_last_two_weeks": 0, "last_played": 1514031795}, "language": "schinese", "review": "为最爱的日本游戏之一补个票，学生时代的一大回忆。当初真是惊为天人，那种跟着神级的bgm完全投入到剧本里的感觉，那种跟着主角的视角思考问题，为每个人物的性格和能力做笔记，分析剧本里线索，认真考虑解法的激情。那种看着自己的推论和解题篇互相对比的成就感，或许以后都不会再有了吧。\n\n\n[h1] 我爱龙绘！\t[/h1]", "timestamp_created": 1514019851, "timestamp_updated": 1514019851, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38369461": {"recommendationid": "38369461", "author": {"steamid": "76561198141499729", "num_games_owned": 1167, "num_reviews": 123, "playtime_forever": 563, "playtime_last_two_weeks": 0, "last_played": 1500526918}, "language": "english", "review": "The first answer is very rad.", "timestamp_created": 1513494025, "timestamp_updated": 1513494025, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38310176": {"recommendationid": "38310176", "author": {"steamid": "76561198001172291", "num_games_owned": 194, "num_reviews": 13, "playtime_forever": 334, "playtime_last_two_weeks": 0, "last_played": 1513296236}, "language": "english", "review": "boring AF chapter 5... hopefully  the last one?", "timestamp_created": 1513286870, "timestamp_updated": 1513286870, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.157771", "comment_count": "7", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38275244": {"recommendationid": "38275244", "author": {"steamid": "76561198116460816", "num_games_owned": 3424, "num_reviews": 46, "playtime_forever": 71, "playtime_last_two_weeks": 0, "last_played": 1514621009}, "language": "schinese", "review": "所失去的 是平日的归路\n无法守护的 是与你的约定\n无法消去的 是我的回忆\n\n《寒蝉鸣泣之时》是日本同人社团07th Expansion制作的同人游戏系列，《寒蝉鸣泣之时 暇溃篇》是《寒蝉鸣泣之时》同人系列游戏的第五作，发行于2004年12月30日。《寒蝉鸣泣之时》目前登陆PC,PlayStation 2,PlayStation 3,PlayStation Vita,Nintendo DS,IOS,Android平台，并含有广播剧，电视剧，漫画，小说，动画，真人电影等相关产物。\n\n《寒蝉鸣泣之时》用平行的次元轮回的形式，深刻体现了存在于人们内心深处的罪恶，只有团结一致，才能克服困难，了解一切。游戏没有任何选项，出题篇中通过平行世界的各种角度给出谜题和线索提示，玩家利用线索进行推理，解答篇中玩家才能了解到真正的答案。\n\n《寒蝉鸣泣之时 目明篇》为解答篇的第一部，事件为《绵流篇》的解答篇，角色角度为园崎诗音，昭和57年，诗音逃出学校后和魅音取得联络，并和北条悟史相遇。诗音将魅音击昏后关在地牢，杀死园崎魉和公由村长，假扮魅音。梨花发现异常后想偷袭诗音，但却被抓住，于是自杀。沙都子因寻找梨花来到园崎家，被诗音杀死。诗音将圭一骗进地牢中击昏，杀死了魅音，随后又杀死了圭一。最后，诗音坠楼身亡。\n\n昭和58年的初夏。\n现在是6月，对比前几年，夏天仿佛来的更早。\n白天可以听到蝉鸣，晚上则有蟋蟀相伴。\n\n我们在一个叫做雏见泽的小村庄。\n这个村庄有不到2000人，但每年都会发生一个事件。\n这个事件是神秘的死亡。（从1979年到1983年）\n在6月的某一天，有人死亡，有人失踪。\n一系列的死亡事件和水坝建设项目引起的变动有关。\n一个被掩盖的谋杀事实正在重新上演。\n这是阴谋？巧合？还是诅咒？\n\n应该出现在那里的人没有出现在那里。\n不应该出现在那里的人却出现在了那里。\n昨天还活着的人现在已经死了。\n本来应该死去的人却站在了我们的面前。\n\n悲剧无法避免，除了放弃好像没有任何机会。但是请不要放弃。\n只有你才能勇敢的面对这些。\n\n被消去的 是记忆的芬芳\n所看到的 是仇恨的伤痕\n所响起的 是过去的足音\n\n所追求的 是仅有的安稳\n所见到的 是仇恨的回廊\n所堕落的 是黑暗的彼方\n\n所碰触的 是摇曳的面容\n所响彻的 是悲伤的回音\n所散发的 是烧毁的回忆\n\n所路过的 是往常的歧路\n所驰骋的 是黑暗的拐角\n所到达的 是破灭的深穴\n\n被束缚住的 是过去的残像\n被邀请的 是来自未来的假像\n在那里的 是另一个恶作剧", "timestamp_created": 1513153432, "timestamp_updated": 1513153432, "voted_up": true, "votes_up": 12, "votes_funny": 3, "weighted_vote_score": "0.630495", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38044487": {"recommendationid": "38044487", "author": {"steamid": "76561198268853545", "num_games_owned": 60, "num_reviews": 11, "playtime_forever": 484, "playtime_last_two_weeks": 0, "last_played": 1512338206}, "language": "english", "review": "This chapter left me with depression, a sick feeling and an irrational fear of having my nails ripped out.", "timestamp_created": 1512338784, "timestamp_updated": 1512338784, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.547325", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37803592": {"recommendationid": "37803592", "author": {"steamid": "76561198078690394", "num_games_owned": 51, "num_reviews": 3, "playtime_forever": 1964, "playtime_last_two_weeks": 0, "last_played": 1511803485}, "language": "russian", "review": "игра для психов анимешников лучше нормальным людям не читать\nв конце нам дают надежду, но пока это самая грустная глава\nкак обычно пробирает очень сильно, очень сильное чувство", "timestamp_created": 1511803440, "timestamp_updated": 1511803440, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.478261", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37348582": {"recommendationid": "37348582", "author": {"steamid": "76561198083199715", "num_games_owned": 146, "num_reviews": 11, "playtime_forever": 252, "playtime_last_two_weeks": 0, "last_played": 1507426029}, "language": "english", "review": "Quite possibly the best of the chapters so far, if youve read all of the others OF COURSE GET THIS ONE TOO! if you havent, what are you waiting for?", "timestamp_created": 1511534966, "timestamp_updated": 1511534966, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.515152", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37051903": {"recommendationid": "37051903", "author": {"steamid": "76561198246262880", "num_games_owned": 123, "num_reviews": 17, "playtime_forever": 156, "playtime_last_two_weeks": 0, "last_played": 1511443181}, "language": "russian", "review": "10/10", "timestamp_created": 1511441704, "timestamp_updated": 1511441704, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36345280": {"recommendationid": "36345280", "author": {"steamid": "76561198144331484", "num_games_owned": 61, "num_reviews": 5, "playtime_forever": 48434, "playtime_last_two_weeks": 6067, "last_played": 1516287074}, "language": "koreana", "review": "메아카시는 사실 용기사07이 쓴 게 아니라 신이 주신 선물입니다.", "timestamp_created": 1510068520, "timestamp_updated": 1510461995, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36050395": {"recommendationid": "36050395", "author": {"steamid": "76561198200715447", "num_games_owned": 46, "num_reviews": 1, "playtime_forever": 702, "playtime_last_two_weeks": 51, "last_played": 1516314682}, "language": "russian", "review": "Наишевральнейшая часть. Хочу стереть себе память и прочесть заново.", "timestamp_created": 1509123471, "timestamp_updated": 1509123471, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35928066": {"recommendationid": "35928066", "author": {"steamid": "76561197998887445", "num_games_owned": 398, "num_reviews": 31, "playtime_forever": 469, "playtime_last_two_weeks": 0, "last_played": 1509537380}, "language": "english", "review": "The real mystery is why a completely linear series of visual novels has a difficulty level.", "timestamp_created": 1508696237, "timestamp_updated": 1508696237, "voted_up": true, "votes_up": 33, "votes_funny": 49, "weighted_vote_score": "0.755136", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35587714": {"recommendationid": "35587714", "author": {"steamid": "76561198199694447", "num_games_owned": 17, "num_reviews": 5, "playtime_forever": 504, "playtime_last_two_weeks": 0, "last_played": 1506992864}, "language": "english", "review": "shions a babe", "timestamp_created": 1507517476, "timestamp_updated": 1507517476, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.493155", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35579717": {"recommendationid": "35579717", "author": {"steamid": "76561198051331486", "num_games_owned": 20, "num_reviews": 2, "playtime_forever": 643, "playtime_last_two_weeks": 0, "last_played": 1507410425}, "language": "german", "review": "I really did like Shion when I first came accross Higurashi.\nNow reading the VN thoroughly, her character was kinda hard to stomach and everything she pulled afterwards.\n\n[spoiler] Meakashi was great, and what made it this way obv was Ryukishis way of retelling the story from \"shions\" perspective (putting that in quotes, because for obvious reasons. Strongly recommend to reread it if you didn't catch that). She's sly, sick and a really fucked up garbage can. CH 2 showed us what Keiichi actually is capable of. Her talking him down to the utmost just... felt so wrong. Her arrogance slightly slows down during the end, but from all of the characters so far, her mindset was the most godlike.\n\nNow you'd probably think I'm talking about the parts after she gets \"fucked up\".\nHoney, no. As stated above, I adored Shion and that was mostly due to Satoshi and her caring personality towards him. Only through the VN honestly I saw how obsessive she's over him and thats before shit goes down. Ryukishi prob wrote it that way on purpose, but the more it disturbed me when I realised how sick her situation was beforehands.\nAll of her violent acts only add up to that and highlight her worst traits - which always makes you question the character at hand (AND I love that the most abt his novels because yes).\nHer jealousy towards satoko is completely uncalled for, given the situation the houjous have to fight through. The reader learns how satoko actually is aware of her own faults, which is so sad and I had to put the game down a few hours because it was so harsh. So good, but so harsh. You get what I want to say. [/spoiler]\n\nIn conclusion, I prob liked CH 5 the most because of the way it made me feel. The after party also brought up questions the reader prob had through mid-reading.\nGood stuff, very good, even though I now want to throw Shion down a cliff.", "timestamp_created": 1507486138, "timestamp_updated": 1507486138, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.469799", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35375562": {"recommendationid": "35375562", "author": {"steamid": "76561198156500439", "num_games_owned": 464, "num_reviews": 17, "playtime_forever": 96, "playtime_last_two_weeks": 0, "last_played": 1503425540}, "language": "english", "review": "Higurashi is my city <3", "timestamp_created": 1506852659, "timestamp_updated": 1506852659, "voted_up": true, "votes_up": 2, "votes_funny": 8, "weighted_vote_score": "0.375137", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35201451": {"recommendationid": "35201451", "author": {"steamid": "76561198191918903", "num_games_owned": 43, "num_reviews": 6, "playtime_forever": 1178, "playtime_last_two_weeks": 0, "last_played": 1497183616}, "language": "english", "review": "Love this series.\nVery intelligently written and stays with you well after reading.", "timestamp_created": 1506341457, "timestamp_updated": 1506341457, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.516037", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34843825": {"recommendationid": "34843825", "author": {"steamid": "76561198048268849", "num_games_owned": 270, "num_reviews": 69, "playtime_forever": 630, "playtime_last_two_weeks": 0, "last_played": 1493839855}, "language": "english", "review": "If you liked the others, it's more of the same, jump in.  It's my least favourite of the series, though; it's even slower and wordier and taking longer to get to the point than any of the rest, which is a hell of an achievement.", "timestamp_created": 1504981971, "timestamp_updated": 1504981971, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.521108", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34735808": {"recommendationid": "34735808", "author": {"steamid": "76561198354945549", "num_games_owned": 169, "num_reviews": 18, "playtime_forever": 107, "playtime_last_two_weeks": 0, "last_played": 1505919157}, "language": "schinese", "review": "大爱寒蝉，期待中文\n\n轮回，死亡\n\n无数次的重复\n\n朋友，亲人\n\n又靠谁来拯救\n\n既然可以重来\n\n放弃\n\n是不是太过辜负\n\n眼泪早已干涸\n\n鲜血早已凝固\n\n在无尽的黑暗中苦苦挣扎\n\n在永恒的轮回中蹒跚前行\n\n命运，神明\n\n轮回，必死\n\n除了笑，还能怎样\n\n再忧伤，也只能遗忘\n\n不能放弃，也没有希望\n\n不能逃脱，就只好绝望\n\n千百年的努力\n\n长大怎能只是奢望\n\n一点点的改变\n\n命运怎能选择遗忘\n\n在这寒蝉鸣泣之时\n\n让我看看太阳\n", "timestamp_created": 1504535061, "timestamp_updated": 1504535061, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.601449", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34640408": {"recommendationid": "34640408", "author": {"steamid": "76561198173853078", "num_games_owned": 54, "num_reviews": 5, "playtime_forever": 1141, "playtime_last_two_weeks": 0, "last_played": 1504104184}, "language": "english", "review": "Mmmm... Tingling at the fingertips.\n\nPS3 patch (yeah, game is strongly recommended to be played with PS3 patch) failed me at the end of the last day. Well, Meakashi is short-released, so it can`t be helped. \"So sad, so sad~\" – Rika`s patting on the head.", "timestamp_created": 1504203647, "timestamp_updated": 1504209612, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.533644", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34282204": {"recommendationid": "34282204", "author": {"steamid": "76561198246909816", "num_games_owned": 115, "num_reviews": 1, "playtime_forever": 1783, "playtime_last_two_weeks": 5, "last_played": 1516127959}, "language": "russian", "review": "10/10 \n(Я просто оставлю это здесь)", "timestamp_created": 1502910298, "timestamp_updated": 1511529638, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.566327", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34131099": {"recommendationid": "34131099", "author": {"steamid": "76561198018844962", "num_games_owned": 130, "num_reviews": 7, "playtime_forever": 746, "playtime_last_two_weeks": 0, "last_played": 1502302477}, "language": "russian", "review": "Эта часть выглядит лучшей из пристуствующих в настоящее время в магазинчике Габена. Рюкиши завозит прекрасную психологию, и по-настоящему [spoiler] драматический финал [/spoiler]. Рекомендуется для ознакомления всем, хотя очевидно, что браться сразу с пятой части смысла нет.", "timestamp_created": 1502305465, "timestamp_updated": 1502305465, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.525862", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33961533": {"recommendationid": "33961533", "author": {"steamid": "76561198041993574", "num_games_owned": 61, "num_reviews": 17, "playtime_forever": 1992, "playtime_last_two_weeks": 0, "last_played": 1501619649}, "language": "english", "review": "As all the other chapters, this is an amazing artpiece. It's got thrilling parts, cruel parts, sad parts, beautiful parts, and an ending that is breathtaking and capable of pull out some tears from your eyes. Comparing it to the anime, it doesn't give that much importance to the gore and focuses on the psychologic scenario of Shion, allowing you to understand better why everything happens, and I've mentioned earlier the ending, that differs from the ending of the arc in the anime, not in what happens, but in how the protagonist sees everything (In fact, that can be applied to the whole game) making an incredible moment in all the series.\nThe problem with the OST that I mentioned in other analysis (in arcs 2-4 the OST is really terrible) is solved. The new songs match perfectly the sad, intense, and grotesque moments. \nOnly thing left to say is that this is another wonderful and marvelous game that you must play if you loved the last ones.\n\nOne little SPOILER:\nKeiichi's updated sprite is a little bit lame. He should be able to put down his fist in tense situations, and he has a kinda goofy face that doesn't suit him at all.", "timestamp_created": 1501638507, "timestamp_updated": 1501638507, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545713", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33842434": {"recommendationid": "33842434", "author": {"steamid": "76561198066074860", "num_games_owned": 81, "num_reviews": 4, "playtime_forever": 17, "playtime_last_two_weeks": 0, "last_played": 1493593794}, "language": "english", "review": "Very fun had to wash dishes whilst playing :)", "timestamp_created": 1501193395, "timestamp_updated": 1501193395, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502772", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33758931": {"recommendationid": "33758931", "author": {"steamid": "76561198096210523", "num_games_owned": 81, "num_reviews": 25, "playtime_forever": 1290, "playtime_last_two_weeks": 0, "last_played": 1500869733}, "language": "russian", "review": "Вот и 5 глава))И что либо рассказывать о ней смысла нету) Сюжет снова выше всяких похвал. Особенно порадовало это добавление романтической ветки в эту жуткую атмосферу \"Higurashi When They Cry\".В этой главе гораздо больше мяса и кровопролитий, на многие вопросы ты получаешь ответы,но и вопросов появляеться все больше чем ты думаешь.Очень жду 6 часть и если посмотреть по статистике выхода данных игр в стим, то ранее конца 2017 года или начала 2018 мы 6 часть не увидим...( Но что поделать. Пойду сейчас смотреть аниме по данному произведению. Всем спасибо за внимание.)", "timestamp_created": 1500872479, "timestamp_updated": 1500872479, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.572127", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33748319": {"recommendationid": "33748319", "author": {"steamid": "76561198143517109", "num_games_owned": 120, "num_reviews": 18, "playtime_forever": 1686, "playtime_last_two_weeks": 0, "last_played": 1500828192}, "language": "english", "review": "I didn't think any of the Higurashi games could beat Chapter 3, and I was right. This game is as equally good. Although this game is amazing, there was one plot point that confused me. Massive spoilers for the ending: [spoiler] Why did Shion (The REAL Shion inside the well with a stun gun to her head) not reveal the information that Granny had nothing to do with the murders until the ending? She could have told Mion (The REAL Mion. Or \"Shion\" in Chapter 2) when she was being tortured. Maybe Mion never asked the actual question, maybe I misread something earlier, maybe the anime will explain this, or maybe a future game will explain this.\t[/spoiler]", "timestamp_created": 1500829260, "timestamp_updated": 1500829260, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33625778": {"recommendationid": "33625778", "author": {"steamid": "76561198119342164", "num_games_owned": 718, "num_reviews": 50, "playtime_forever": 1181, "playtime_last_two_weeks": 0, "last_played": 1500164340}, "language": "english", "review": "Absolutely nothing puts my intellect and emotions through the wringer like this series.\n\nWhat to say without spoilering ? I was right about some things; I was very wrong about others, including motives. The whole \"I laughed and cried\" cliche? Oh God, yes. Some bits were funny and gleeful, but the ending wrecked me. I also shuddered with tension and revulsion. Amazing writing and music.\n\nMy brain is teeming with theories. Desperate for the next release. Please hurry up, Manga Gamer!\n\nA note: This was the first in the series for which I used the PS2 art and voice mod--otherwise I've read on Steam with Steam graphics or the iPad version with the original art--and I wish I'd started sooner. The voice acting, for the twins in particular, is stellar. And oh, to get rid of those awful filtered backgrounds. Well worth the mod.\n", "timestamp_created": 1500368623, "timestamp_updated": 1500368623, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33340330": {"recommendationid": "33340330", "author": {"steamid": "76561198161936754", "num_games_owned": 74, "num_reviews": 14, "playtime_forever": 709, "playtime_last_two_weeks": 0, "last_played": 1500563682}, "language": "english", "review": "Protect Satoshi!!!!\nLet my ship sail pls", "timestamp_created": 1499427697, "timestamp_updated": 1499427697, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.497942", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33068347": {"recommendationid": "33068347", "author": {"steamid": "76561198099477299", "num_games_owned": 40, "num_reviews": 1, "playtime_forever": 1464, "playtime_last_two_weeks": 0, "last_played": 1506655470}, "language": "schinese", "review": "you也加进来了,确定不买么？（笑", "timestamp_created": 1498884819, "timestamp_updated": 1498884819, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.563492", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33004509": {"recommendationid": "33004509", "author": {"steamid": "76561198130228143", "num_games_owned": 90, "num_reviews": 7, "playtime_forever": 1030, "playtime_last_two_weeks": 0, "last_played": 1499090563}, "language": "english", "review": "This has always been my favorite arc, it's nice to finally 'own' a copy of it- so thanks for that steam. ♥", "timestamp_created": 1498761890, "timestamp_updated": 1498761890, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.575804", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33002316": {"recommendationid": "33002316", "author": {"steamid": "76561198272538113", "num_games_owned": 935, "num_reviews": 240, "playtime_forever": 107, "playtime_last_two_weeks": 0, "last_played": 1498759068}, "language": "english", "review": "Q_Q I'll never forget Satoshi-Kun Q_Q", "timestamp_created": 1498758920, "timestamp_updated": 1498758920, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.503364", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32891127": {"recommendationid": "32891127", "author": {"steamid": "76561198142580204", "num_games_owned": 169, "num_reviews": 46, "playtime_forever": 423, "playtime_last_two_weeks": 0, "last_played": 1493492193}, "language": "russian", "review": "✔✔✔", "timestamp_created": 1498599673, "timestamp_updated": 1498599673, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32795000": {"recommendationid": "32795000", "author": {"steamid": "76561197971481674", "num_games_owned": 120, "num_reviews": 29, "playtime_forever": 200, "playtime_last_two_weeks": 0, "last_played": 1501939871}, "language": "english", "review": "Good game.", "timestamp_created": 1498439052, "timestamp_updated": 1498439052, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.535011", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32617049": {"recommendationid": "32617049", "author": {"steamid": "76561198052417714", "num_games_owned": 26, "num_reviews": 13, "playtime_forever": 174, "playtime_last_two_weeks": 162, "last_played": 1516436927}, "language": "russian", "review": "Шедевр", "timestamp_created": 1498049293, "timestamp_updated": 1498049293, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32359860": {"recommendationid": "32359860", "author": {"steamid": "76561198023008403", "num_games_owned": 94, "num_reviews": 9, "playtime_forever": 1582, "playtime_last_two_weeks": 0, "last_played": 1497137114}, "language": "english", "review": "The 5th installment of the legendary Higurashi series and by far my favorite. In this chapter, we follow Shion as the main protaganist and is the direct answer arc to chapter 2.", "timestamp_created": 1497253182, "timestamp_updated": 1497253182, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32329857": {"recommendationid": "32329857", "author": {"steamid": "76561198199434633", "num_games_owned": 158, "num_reviews": 2, "playtime_forever": 191, "playtime_last_two_weeks": 0, "last_played": 1498397411}, "language": "koreana", "review": "드디어 나왔습니다. 해답편 !!\n\n와타나가시편의 진실을 확인해보세요.  \n\n\n보이스 패치와 그래픽 패치를 매번 만들어주시는 해외 팬들에게... 감사합니다 !", "timestamp_created": 1497136778, "timestamp_updated": 1497136778, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32282202": {"recommendationid": "32282202", "author": {"steamid": "76561197980221014", "num_games_owned": 2775, "num_reviews": 77, "playtime_forever": 2378, "playtime_last_two_weeks": 0, "last_played": 1496943780}, "language": "thai", "review": "[b]คำเตือน - ซีรี่ย์นี้ไม่ควรอ่านข้าม chapter ควรอ่าน chapter ก่อนหน้ามาก่อน โดยเฉพาะ Chapter 2 เพราะนี่คือบทเฉลยโดยตรงของบทดังกล่าว[/b]\n\nchapter นี้จะเล่าเรื่องจากมุมมองของ Shion แฝดของ Mion ซึ่งขอบอกเลยว่าคนแต่งเล่นประเด็นที่ว่าทั้งสองเป็นฝาแฝดกันอย่างเต็มที่ เรียกได้ว่าคนที่อ่านและเดาเนื้อเรื่องจะมีอยู่แค่ 2 ประเภทเลย นั่นก็คือ 1. คนที่เดาผิด กับ 2. คนที่คิดว่าตัวเองเดาถูกแน่ๆ แต่ก็ดันผิด! เอ๊า!\n\nหากคุณอ่าน Ch2 มาแล้ว และคุณยังพอจำเนื้อเรื่องได้ ขอแสดงความยินดีด้วย ที่คุณจะได้อรรถรสในการอ่าน ch นี้อย่างเต็มที่ (ถ้าจำไม่ได้เลย แนะนำให้กลับไปอ่านก่อนอีกรอบ ถถถ) โดย ch นี้จะเล่าเรื่องก่อน Keiichi (ตัวเอก ch1-3) ย้ายเข้ามาใน Hinamizawa 1 ปี ซึ่งผู้อ่านจะได้รับรู้เหตุการณ์ก่อนหน้านี้เพิ่มเติม และจะเล่าเรื่องเสริ่มจากอีกมุมของ ch2 ผ่านตัวละคร Shion เพื่อคลายปม(เกือบ)ทุกปมที่ค้างคาไว้ [spoiler]ก่อนจะตบหน้าคนอ่านก่อนจบเรื่อง ด้วยการบอกว่า \"ที่แกคิดว่าใช่มาตลอดทั้งเรื่องน่ะ มันไม่ใช่ว่ะ\"[/spoiler]\n\nCh นี้ มีความรุนแรงอยู่มาก ไม่ว่าจะเป็นการฆ่า การทรมานร่างกายและจิตใจ เรียกได้ว่า ch นี้มีฉากให้ระทึกเยอะที่สุด และน่าติดตามที่สุด (นับแค่ ch1-5 นะ) ถึงแม้จะเป็นแค่ Visual Novel ที่ไม่มีภาพประกอบฉากโหดๆ ดังกล่าว แต่เมื่ออ่านฉากดังกล่าวไปแล้ว ก็สามารถนึกภาพตามได้ไม่ยาก บอกเลยว่าอ่านแล้วก็รู้สึกพะอืดพะอมอยู่นิดๆ เหมือนกัน\n\nที่สำคัญ ใน ch นี้ Keiichi มี Sprite ตัวละครแล้ว! รวมถึงตัวละครหลักบางคนด้วย\n\nและสุดท้ายนี้ ขอใช้ประโยคสุดคลาสสิกที่ผมพิมพ์ในรีวิวของทุก ch ที่ว่า \"ถ้าคุณเล่น ch ก่อนหน้านี้มาแล้ว โดยเฉพาะ ch2 คุณก็ห้ามพลาด ch5 นี้เด็ดขาด\"\n\n-----------------------------------------------\nส่วนด้านล่างนี้เป็นเรื่องย่อของ ch นี้ ผมพยายามจะไม่ให้มีการ spoil แต่อย่างใด แต่เพื่อความปลอดภัย ผมขอคาดดำไว้ก่อนก็แล้วกัน\n[spoiler]เรื่องราวจะเริ่มตั้งแต่ก่อนงานเทศกาล Watanagashi 1 ปีก่อน Keiichi (ตัวเอก ch1-3) ย้ายเข้ามาใน Hinamizawa และเป็นปีก่อนที่ตัวละครสำคัญอีก 1 ตัว ซึ่งก็คือ Satoshi จะหายตัวไป\n\nShion ซึ่งเป็นตัวเอกใน ch นี้ ถูกบังคับให้เรียนในโรงเรียนประจำ ซึ่งเป็นโรงเรียนคุณหนู เธอถูกฝึกให้ทำทุกอย่างเพื่อให้เป็นคนเรียบร้อย และเข้าสังคมได้ แต่นั่นไม่ใช่ตัวเธอเลย จนวันนึงเธอไม่สามารถทนได้อีกต่อไป จึงวางแผนหนีออกมาจากโรงเรียนประจำ โดยได้รับความช่วยเหลือจาก Kasai คนสนิทของพ่อของเธอ\n\nเธอเข้ามาอาศัยอยู่ในเมือง Okinomiya เพราะไม่สามารถบอกทางบ้านได้ว่าหนีออกมา หากทางบ้านรู้เรื่องนี้ เธออาจได้รับการลงโทษอย่างโหดเหี้ยม ระหว่างที่เธออาศัยอยู่ในเมืองข้างๆ Hinamizawa นี้ เธอคอยแอบติดต่อกับแฝดของเธอ Mion อย่างลับๆ เพื่อหาเวลาที่จะออกมาหางานพิเศษทำ โดยแกล้งปลอมตัวเป็น Mion (ทั้งสองคนไม่สามารถปรากฏตัวพร้อมกันได้ จึงต้องนัดเวลากัน)\n\nแล้ววันที่ทุกอย่างเริ่มต้นขึ้นก็มาถึง วันนั้น Shion ได้พบกับ Satoshi โดยบังเอิญ เพราะ Satoshi เข้ามาช่วย Shion ไว้จากกลุ่มอันธพาล (โดยที่ Satoshi คิดว่าเธอคือ Mion) หลังจากนั้นทั้งสองก็เริ่มสนิทกันจนเกิดความรักขึ้นในใจของ Shion แต่ด้วยความที่ทั้งสองตระกูล ซึ่งก็คือตระกูล Houjou ของ Satoshi และตระกูล Sonozaki ของ Shion มีปัญหากันมาตั้งแต่แรก จึงทำให้ความสัมพันธ์ของทั้งสองคนไม่ราบรื่น และเกิดปัญหาเรื่อยมา\n\nปัญหาทวีความรุนแรงขึ้นเรื่อยๆ จนมาถึงวันที่ Satoshi ได้หายตัวไป ใจของ Shion แหลกสลาย และภายหลัง ปีศาจในตัวเธอก็ถูกปลุกขึ้น...ปีศาจที่ต้องการฆ่า และล้างแค้นคนที่ทำกับ Satoshi...[/spoiler]", "timestamp_created": 1496978961, "timestamp_updated": 1496979261, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.512195", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32001845": {"recommendationid": "32001845", "author": {"steamid": "76561198084101505", "num_games_owned": 225, "num_reviews": 50, "playtime_forever": 1025, "playtime_last_two_weeks": 0, "last_played": 1495845993}, "language": "english", "review": "This is the first answer arc in the series; focusing on the events that take place in the Watanagashi-hen arc. \n\n[b]Graphics: 8/10[/b]\nApart from a few new locations and Keiichi finally getting a character portrait, the graphics had remained the same and consistent. \n\n[b]Storyline: 9/10[/b]\nThis arc is told in the shoes of Shion Sonozaki (Mion’s twin sister) as she escapes from her private school and returns to Hinamizawa; she is assisted by Kasai Tatsuyoshi in her escape. She then later meets Satoshi Hōjō when she surrounded by thugs. We later find out that Shion would often switch identities and would often refer to herself as Mion, one of the only way of distinguishing them apart is the demon tattooed on her back. The rest story is revolved heavily around Shion’s love for Satoshi Hōjō and his disappearance, as Shion figures out how the ‘curse system’ works. \n\n[b]Sound: 8/10[/b]\nIt seems that there is a bit more variety of soundtracks in this arc compared to the previous 4 that were released which is a good thing as they were kinda “off” in the 3rd arc. It’s only a minor improvement, but it sure does make the gameplay more engaging. \n\n[b]Gameplay: 7/10[/b]\nThe first thing I noticed was the menu UI, it looks much cleaner than the other novels, but it remains as functional. Although the game didn’t crash, there were still minor spelling and grammar mistakes here and there (hopefully the devs will consider this and make an update).\n\n[b]Price: 10/10[/b]\nFor only £5.59, this is a great investment. If you’ve read the other 4 novels, this is highly recommended as it will clear up the (most of the) questions that you’ve might have been asking yourself. \n", "timestamp_created": 1495906809, "timestamp_updated": 1495906809, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.565454", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31942848": {"recommendationid": "31942848", "author": {"steamid": "76561198034301775", "num_games_owned": 147, "num_reviews": 73, "playtime_forever": 599, "playtime_last_two_weeks": 0, "last_played": 1495427414}, "language": "english", "review": "First of the 'Answer Arc' chapters, it sheds light on one of the previous scenarios by following it through a different point of view. Gory and crazy goodness we all know and love.", "timestamp_created": 1495668463, "timestamp_updated": 1495668463, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31826908": {"recommendationid": "31826908", "author": {"steamid": "76561198013216634", "num_games_owned": 122, "num_reviews": 18, "playtime_forever": 554, "playtime_last_two_weeks": 0, "last_played": 1495009509}, "language": "english", "review": "a tiddie tale about smug grannies, insanity and needles", "timestamp_created": 1495132569, "timestamp_updated": 1495132664, "voted_up": true, "votes_up": 3, "votes_funny": 2, "weighted_vote_score": "0.536508", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31819944": {"recommendationid": "31819944", "author": {"steamid": "76561198025119092", "num_games_owned": 755, "num_reviews": 45, "playtime_forever": 845, "playtime_last_two_weeks": 0, "last_played": 1495076765}, "language": "japanese", "review": "[h1]最愛の殺人鬼[/h1]\n\n待ってましたと言わんばかりの一番好きなシナリオ目明し編。綿流し編の事件の全貌が明らかになる解答編となります\n綿流し編とは若干状況が異なってる場面がいくつかあるが、大筋は変わりません。しかし綿流し編とは違う世界です\n主人公は園崎詩音なので最後以外立ち絵はありません。主人公の座から陥落した前原圭一の立ち絵が初登場となる\n\nSteam版の変更点は割愛しますが、出題編と解答編の違いはBGM\n出題編は主にフリーのBGM素材を使用されてましたが、解答編はひぐらしのファンであるdai氏が作曲したBGMが使用されてます\n中でもThanksとyouはひぐらしを代表する曲と言っても過言ではない。youに至っては癒月氏や魅音と詩音の声優を担当した雪野五月氏が歌ったボーカルverがある等、ひぐらしの事はあんまり知らなくてもこの曲だけは知ってる人は少なくないはず\n\nEDでそのyouが使われてるのだが、肝心のEDが流れないのだ\n正常であれば雛見沢村連続殺人事件関係者一覧が表示されながらyouが流れるはずになってるのだが…\n人気がある曲だけに権利関係かと思って中身を確認すると、ちゃんとyouの音楽データがありましたし壊れてもいなかった\n雛見沢村連続殺人事件関係者一覧の画像データは英語版はあったが日本語版だけは無かった。試しに英語表示でやり直してみたがEDは流れなかった\n\nローカライズ元のミスで流れないとなると一刻も早いアップデートで流せるようにしてほしいところだ\n自分はこの目明し編で涙を流した後、EDが流れない事にまた涙を流した…", "timestamp_created": 1495106440, "timestamp_updated": 1496495231, "voted_up": true, "votes_up": 48, "votes_funny": 3, "weighted_vote_score": "0.841320", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31819171": {"recommendationid": "31819171", "author": {"steamid": "76561198061529255", "num_games_owned": 648, "num_reviews": 135, "playtime_forever": 1059, "playtime_last_two_weeks": 0, "last_played": 1495361820}, "language": "english", "review": "finally the first chapter of the answer arc\na new perspective, some new sprites and more soundtrack\ngreat as aways", "timestamp_created": 1495102283, "timestamp_updated": 1495102283, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31809608": {"recommendationid": "31809608", "author": {"steamid": "76561198028375811", "num_games_owned": 1737, "num_reviews": 19, "playtime_forever": 14535, "playtime_last_two_weeks": 0, "last_played": 1495044952}, "language": "english", "review": "Again, a great and enjoyable chapter. \n", "timestamp_created": 1495045783, "timestamp_updated": 1495045783, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.577619", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31788613": {"recommendationid": "31788613", "author": {"steamid": "76561198042281799", "num_games_owned": 177, "num_reviews": 9, "playtime_forever": 908, "playtime_last_two_weeks": 0, "last_played": 1497300739}, "language": "russian", "review": "лучая часть серии, патамушта пра любафь\n10 яндере/ 10", "timestamp_created": 1494946909, "timestamp_updated": 1494946980, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.483171", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31716197": {"recommendationid": "31716197", "author": {"steamid": "76561198069054871", "num_games_owned": 1562, "num_reviews": 11, "playtime_forever": 887, "playtime_last_two_weeks": 0, "last_played": 1494652782}, "language": "english", "review": "This chapter was my favorite so far.", "timestamp_created": 1494652859, "timestamp_updated": 1494652859, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31713125": {"recommendationid": "31713125", "author": {"steamid": "76561198120348301", "num_games_owned": 873, "num_reviews": 389, "playtime_forever": 1418, "playtime_last_two_weeks": 0, "last_played": 1494365002}, "language": "english", "review": "The first part of the answer arc of the series, and honestly, it’s amazing and addicting. After you start to read Meakashi, you won’t stop until you’ve read everything. Each chapter makes you so curious that at least to me it was impossible to wait a while before reading the rest. \n\nThis “Eye Opening” chapter is directly related to Watanagashi, showing us another perspective of what happened on the second game and its answers (at least most of them). Ryukishi07 (creator/writer) did an excellent job here. So far, Meakashi is one of the best Higurashi chapters I’ve read so far, not only because it helps to answer several questions, but because it’s so well written and connects so perfectly to Watanagashi that once you reach the end you’ll feel that you [b]need[/b] more of this series, but you have to wait for the next translations. Damn.\n\n∞/10. [spoiler]Also there’s a mention of the best girl during Rika’s death. ♥[/spoiler]", "timestamp_created": 1494636644, "timestamp_updated": 1494636644, "voted_up": true, "votes_up": 57, "votes_funny": 1, "weighted_vote_score": "0.861475", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31668516": {"recommendationid": "31668516", "author": {"steamid": "76561198001276873", "num_games_owned": 283, "num_reviews": 4, "playtime_forever": 741, "playtime_last_two_weeks": 0, "last_played": 1494433716}, "language": "english", "review": "An incredible, beautiful, heart-wrenching depiction of a tragedy, while still keeping true to the series trend of answering questions but asking more. As a first-time reader of the series, I would've almost been happy with as an ending to the series simply out of how emotional and even touching it was; if all the hours put into the first four chapters of the series had to pay for something, I'm so, so glad it was for this. It's my favorite visual novel to date and might be the thing I regret never having a chance to experience for the first time again the most.\n\nI really can't put into words how much I enjoyed Meakashi. It blew my prior favorite visual novel, fate/stay night, well and truly out of the water. I'm both very, very much looking forward to the future instalments and very, very much not emotionally prepared for them. \n\nThank you for sharing this story, Ryukishi07. An absolute steal for 8 dollars.", "timestamp_created": 1494434496, "timestamp_updated": 1494434526, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.518545", "comment_count": "7", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31661067": {"recommendationid": "31661067", "author": {"steamid": "76561198002522469", "num_games_owned": 107, "num_reviews": 6, "playtime_forever": 1075, "playtime_last_two_weeks": 0, "last_played": 1494403290}, "language": "english", "review": "I'm really sorry, everybody.\nI really am.\nI'm sorry.", "timestamp_created": 1494403609, "timestamp_updated": 1494403609, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.500000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31648060": {"recommendationid": "31648060", "author": {"steamid": "76561198020941605", "num_games_owned": 168, "num_reviews": 7, "playtime_forever": 137, "playtime_last_two_weeks": 0, "last_played": 1494276866}, "language": "english", "review": "Just as good as the previous entries in the series. Gives a great insight upon the events of the second chapter.", "timestamp_created": 1494342749, "timestamp_updated": 1494342749, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31620933": {"recommendationid": "31620933", "author": {"steamid": "76561198173425026", "num_games_owned": 65, "num_reviews": 3, "playtime_forever": 489, "playtime_last_two_weeks": 0, "last_played": 1494232492}, "language": "english", "review": "Just beautiful", "timestamp_created": 1494231914, "timestamp_updated": 1494231914, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31619998": {"recommendationid": "31619998", "author": {"steamid": "76561198128704797", "num_games_owned": 484, "num_reviews": 59, "playtime_forever": 854, "playtime_last_two_weeks": 0, "last_played": 1494225373}, "language": "english", "review": "Higurashi When They Cry Hou-Ch.5 Meakashi is a kinetic visual novel and, as the title states, it is the fifth episode in the Higurashi series.  Meakashi is the first of the answer arcs, and this time, Shion is the main character.  Story-wise, it takes place about June 1982, so a year before the main events that have happened in regards to the first three question arcs.  We are given a look into Shion's life, from the time she runs away from boarding school to return to Okinomiya (being physically close to Hinamizawa) all the way up to the events at the end (but I won't reveal what those events are, as they are spoilers lol).  So there are really two arcs told in this episode.  The first one is from June 1982 when Shion runs away from her boarding school and the events include meeting Satoshi (yes, Satoshi finally appears!) to shortly after the end of the Watanagashi festival held that year.  The other one recalls the events that are told specifically in Higurashi Ch.2 Watanagashi, as Meakashi is the answer arc for it.  So basically, it's best to have played and read through Watanagashi first (and probably Onikakushi, since it is the prologue question arc, as well as maybe Tatarigoroshi, since Satoshi is mentioned in it quite a number of times).  As for the story itself, I won't reveal any more than what I've already detailed here.  ;)\n\nNow as to my thoughts on Meakashi, I truly enjoyed reading this answer arc.  I liked Shion's character and it was interesting to see how her character developed and what ended up happening to her.  It's difficult to explain my exact opinions without spoiling things but I'll give a mild spoiler here so beware.  [spoiler]In the end, I did truly feel sorry for Shion/Mion.  Suffice it to say that she was dealt a bad hand and it didn't help that her older family members had archaic punishments that needed to be handed out.  Of course, I do take into account the time that this takes place but still, it was the late 20th century and times had definitely changed to a point although I guess that being in a small village makes some people still narrow-minded.[/spoiler]  There were grammatical mistakes here and there and I felt that they could have been polished more but the writing was great and the deaths and torture were definitely gruesome.  It was interesting to find out the parts that some people played in regards to Oyashiro's curse, and the end of Meakashi does still leave us with questions to ask.  Although it answers some questions, we end up having more and I suppose the following answer arcs will help us to get those answers, hopefully.  ;)\n\nOverall, I enjoyed Meakashi a lot and I'm excited that the answer arcs are finally making their way onto Steam.  Next up is Tsumihoroboshi and it'll be the answer arc for Onikakushi and I'm totally excited for it.  ^^", "timestamp_created": 1494226915, "timestamp_updated": 1494226915, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.692048", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31619613": {"recommendationid": "31619613", "author": {"steamid": "76561198197896761", "num_games_owned": 235, "num_reviews": 71, "playtime_forever": 1225, "playtime_last_two_weeks": 0, "last_played": 1493996784}, "language": "english", "review": "Higurashi When They Cry Meakashi is the fifth chapter in the Higurashi series.\n\nThis chapter was really good. Shion is the star for Meakshi.\n\nI just loved everything about Meakashi. The new music was awesome. It took some time getting used to as I was used to the ones for four chapters. Once I got used to the music I really enjoyed the music a lot. One thing I also noticed right away was the quality of the music was much much much better than the previous four chapters, For some reason the other four chapter's music quality is low. Also there are two tracks in particular that I enjoyed a lot. I don't know what the tracks are called. One track I guess best to describe (In my opinion) is suspense/intense. I don't think this track played a lot. Maybr three or four times. I wish I heard the track more as it was really good. The other track which os my favorite that I relly like is the sad one. Now this track plays a lot more. This track played a lot more towards the end of the game.\n\nOMG seeing a sprite for Satoshi was awesome. But man it felt super weird to finally see a Keichii sprite. I was like yes it's great to finally see Keichii's sprite in the game. I really love Satashi's and and Keichii's new sprite a lot:) I swear Keichii looks like he works out a lot LOL.\n\nThe story without spoiling a lot was amazing. This chapter is an answer arc and answers question's for the second chapter Watanagashi. I found out there is a reason why the answer arc's are not in order. So it makes sense that Onikakushi is not first.\n\nBut there are still some questions raised and left unanswered. I'm pretty sure those left unanswered and new questions will get answered. I just don't know when that will happen.\n\nDefinetly get chapter five Meakashi and play:) It was a very good chapter and I cannot wait to get the next chapter. To bad as always it's probably going to take a while to come to Steam:(", "timestamp_created": 1494224598, "timestamp_updated": 1494224598, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31592882": {"recommendationid": "31592882", "author": {"steamid": "76561198087647750", "num_games_owned": 134, "num_reviews": 60, "playtime_forever": 879, "playtime_last_two_weeks": 0, "last_played": 1494116072}, "language": "english", "review": "As a first time reader of the series, the first answer arc blew my expectations out of the water. The first half takes place a year before the Chapters 1-3, and while it answers a lot of questions regarding Satoshi & Shion, I didn't find it that interesting. The second half in comparison, takes place during the same timeline as Chapter 2, and absolutely blew me away. If, like me, it's been a year or more since you've read Chapter 2, I recommend pulling up a Let's Play of Chapter 2 when you get to the 2nd half of this story. Any time both Keeichi & Shion are in a scene together in chapter 5, watch the scene first in the chapter 2 Let's Play, and have your mind blown.", "timestamp_created": 1494116571, "timestamp_updated": 1494116622, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.505242", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31566871": {"recommendationid": "31566871", "author": {"steamid": "76561198012023582", "num_games_owned": 805, "num_reviews": 97, "playtime_forever": 426, "playtime_last_two_weeks": 0, "last_played": 1493671383}, "language": "english", "review": "If you got this far you know you'll like it.", "timestamp_created": 1494016704, "timestamp_updated": 1494016704, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.582746", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31517532": {"recommendationid": "31517532", "author": {"steamid": "76561198061039434", "num_games_owned": 258, "num_reviews": 40, "playtime_forever": 364, "playtime_last_two_weeks": 0, "last_played": 1493781845}, "language": "thai", "review": "\"เล่นจบลบเกมทิ้ง\" ไม่ได้หมายความว่ามันไม่ไดีนะ ....แต่มันดีจนเกือบทำตัวคนเขียนอยากโดดออกทางหน้าต่างจริงๆให้ตายสิ  แปลรอบนี้ทำออกมาได้ดีกว่าบทก่อนๆ  ถ้าอ่านมังงะรึดูเมะมาแล้ว กลับมาเล่นอีก ฉากต่างๆนี่ไหลมาไม่หยุด ทั้งอารมณ์ทั้งเสียง  โดยเฉพาะเสียงหัวเราะของมี่จังที่ดังก้องอย่างบ้างคลั้งนี่ ติดหูไม่เคยลืมเลย เป็นแฟนซีรี่ย์นี้ก็กดซื้อไปเถอะไม่ต้องคิดอะไรเลย เล่นจบแล้วจิตตกเป็นบ้า", "timestamp_created": 1493782683, "timestamp_updated": 1493782683, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504728", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31504802": {"recommendationid": "31504802", "author": {"steamid": "76561198150027057", "num_games_owned": 101, "num_reviews": 1, "playtime_forever": 641, "playtime_last_two_weeks": 0, "last_played": 1511971843}, "language": "schinese", "review": "邂逅的 是指向温柔的代价\n坠落的 是通向悲伤的迷宫\n焦虑的 是走向憎恨的思绪", "timestamp_created": 1493726488, "timestamp_updated": 1493726488, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.654511", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31496213": {"recommendationid": "31496213", "author": {"steamid": "76561198027554665", "num_games_owned": 318, "num_reviews": 27, "playtime_forever": 706, "playtime_last_two_weeks": 0, "last_played": 1493656562}, "language": "english", "review": "[i]This review: contains no spoilers[/i]\n\n[h1]Pros[/h1]\n[list]\n\t[*][b]Character perspective[/b] --- A refreshingly unique perspective from one of the other major characters that has appeared in previous chapters.\n\t[*][b]Resolution to mysteries[/b] --- Aside from a couple cheap tricks, this chapter offers satisfying answers for Ch. 2's mysteries. They fit naturally, make sense, and could have been deduced ahead of time by studying Ch. 2 carefully. This chapter also delivers the missing piece to the puzzle – the motivation – which also covers an important, often mentioned period of time that took place before the main series.\n[/list]\n\n[h1]Cons[/h1]\n[list]\n\t[*][b]Soundtrack[/b] --- Lower quality sound and music returning from previous chapters; muffled and lacking the same impact. Some tracks were also hard to listen to and featured very high pitched screeching.\n[/list]\n\n[h1]Conclusion[/h1]\nCh. 5 serves as the companion piece to Ch. 2, retelling its major events from a different character's perspective while simultaneously resolving its mysteries. Not as shocking now by knowing how it will all eventually conclude, the journey is made just as fun by finally being able see everything fall into place in a way that stays true to Higurashi's themes.\n\nNovel length is roughly [b]10 hours[/b] depending on reading speed. It's recommened to [b]buy Higurashi Ch. 5[/b] only after reading at least Ch. 1 and Ch. 2 while also being able to recollect what happened in the latter.", "timestamp_created": 1493678391, "timestamp_updated": 1493678391, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31494324": {"recommendationid": "31494324", "author": {"steamid": "76561198032325414", "num_games_owned": 24, "num_reviews": 5, "playtime_forever": 27, "playtime_last_two_weeks": 0, "last_played": 1493668709}, "language": "english", "review": "This trash game is complete and utter HERESY. Within the first few minutes of the game the protagonist Shion says that she dislikes the Bible, God and the catholic school she attends. I wouldn't be too surprised if the creator of the game Ryukishi07 was expressing his own dislike for christianity through the protagonist.\n\nTo any christians and especially catholics reading this: STAY LIGHTYEARS AWAY from this heretical garbage! It's trash. It's not worth your money. A real christian doesn't read this visual nothingness.", "timestamp_created": 1493670038, "timestamp_updated": 1493670038, "voted_up": false, "votes_up": 7, "votes_funny": 108, "weighted_vote_score": "0.077043", "comment_count": "20", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31492103": {"recommendationid": "31492103", "author": {"steamid": "76561198045289119", "num_games_owned": 164, "num_reviews": 23, "playtime_forever": 730, "playtime_last_two_weeks": 0, "last_played": 1493828607}, "language": "english", "review": "Why can't we go back to those old days?\n", "timestamp_created": 1493661961, "timestamp_updated": 1493661961, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.471311", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31481781": {"recommendationid": "31481781", "author": {"steamid": "76561198012727270", "num_games_owned": 455, "num_reviews": 52, "playtime_forever": 1822, "playtime_last_two_weeks": 0, "last_played": 1494450616}, "language": "english", "review": "Orange>Green", "timestamp_created": 1493628147, "timestamp_updated": 1494510912, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.420405", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31480709": {"recommendationid": "31480709", "author": {"steamid": "76561198283573809", "num_games_owned": 37, "num_reviews": 1, "playtime_forever": 357, "playtime_last_two_weeks": 0, "last_played": 1510662298}, "language": "russian", "review": "Писать понравился ли мне продукт или нет - нет надобности, ведь я пишу мнение о уже пройденной ранее арке о Раскрытии Тайн. Хотелось бы сказать, в первую очередь, что глава стоит своего названия - в ней действительно обличается \"Древнее Предание уууу\", хотя могут найтись и те, кто после и этой арки будут веровать в магическую основу событий после Ватанагаши. Дело не моё, разумеется. Впервые появляется Кейти уже как персонаж второго плана, впервые мы видим заботливого брика Сатоки. Но особо хотелось бы выделить то, насколько хорошо автор передал в этой главе чувства страдающей от одиночества девушки. Рю не ставит своей целью показать [spoiler]  бесчеловечность её поступков [/spoiler], наоборот. [spoiler] За зверскими убийствами [/spoiler] он показывает насколько подвержено девичье сердце ранними потерями и... [spoiler] неизлечимой болезнью [/spoiler]. Трогательная история, берущая прямо за душу. Рекомендую.", "timestamp_created": 1493623327, "timestamp_updated": 1493640262, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31461623": {"recommendationid": "31461623", "author": {"steamid": "76561198011087718", "num_games_owned": 53, "num_reviews": 8, "playtime_forever": 16, "playtime_last_two_weeks": 0, "last_played": 1496000986}, "language": "english", "review": "Holy damn the feels in this chapter.", "timestamp_created": 1493552246, "timestamp_updated": 1493552246, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.557385", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31455334": {"recommendationid": "31455334", "author": {"steamid": "76561197965049785", "num_games_owned": 653, "num_reviews": 390, "playtime_forever": 636, "playtime_last_two_weeks": 0, "last_played": 1513174567}, "language": "english", "review": "The first of the \"Answer Arcs\" of Higurashi has finally arrived... and it does not disappoint. \n\nMeakashi tells roughly the same story as the second chapter of Higurashi, Watanagashi, but from the perspective of Shion Sonozaki. Through this change of perspective, you find out what really was going on during that earlier storyline and why. And that story, the story that Meakashi tells, is probably the best one in Higurashi. It also is one of the most depressing tragedies I have ever come across.\n\nKeeping this review free of spoilers means I can't get into things in any real detail, but Meakashi affected me quite alot when I first came across it. While earlier storylines in Higurashi have a similar pattern of watching a pleasant world crumble, before you didn't really have a clear sense of what was going on. Here, you know exactly why things go wrong, and it is easy to understand the motivations behind it all. The villain's actions are horrific, but you are able to see the road that led them there and how something that started so sweet turned into an inescapable nightmare fueled by madness, paranoia, and grief. \n\nWhile some other arcs like Tsumihoroboshi or Tatarigoroshi come close, Meakashi ultimately is my favorite of the eight main Higurashi storylines. It can be incredibly disturbing and hard to stomach, but to me that is just proof of how well-written it really is. Obviously, you should play the first four before getting to this one, but it is all very much worth it. As far as I am concerned, this is among the best that VN's and storytelling have to offer.\n\nHope things go better... in another world.", "timestamp_created": 1493527493, "timestamp_updated": 1493527620, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.678009", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31454725": {"recommendationid": "31454725", "author": {"steamid": "76561198048654414", "num_games_owned": 1385, "num_reviews": 92, "playtime_forever": 1909, "playtime_last_two_weeks": 0, "last_played": 1493710173}, "language": "russian", "review": "Продолжение шедевра от Ryukishi07. MangaGamer на забвает о фанатах и на этот раз в мы узнаем историю близняшек, а именно младшей из близняшек сестер Соноздаки.\nЭта часть арки ответов более кровавая чем приведущие, более загадочная и интригующуя. Для мененя Рикка всегда будет лучшей девочкой, но и Шион я тоже очень люблю. На этот раз наконец в Цикадах лично можно будет поговрить и с Сатоши, брате рены. \nОпертивный переовд пятой главы http://steamcommunity.com/sharedfiles/filedetails/?id=915855813\nЗа что большое спасибо автору, а так же переводы предудущих глав и японскую озвучку вы можетет скачать тут у моего друга Ariguma \n\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=472162724\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=583690973\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=781243196\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=795893594", "timestamp_created": 1493524569, "timestamp_updated": 1493524569, "voted_up": true, "votes_up": 12, "votes_funny": 2, "weighted_vote_score": "0.554450", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31452457": {"recommendationid": "31452457", "author": {"steamid": "76561198096005295", "num_games_owned": 61, "num_reviews": 3, "playtime_forever": 875, "playtime_last_two_weeks": 0, "last_played": 1511003731}, "language": "english", "review": "Just marathoned through the game, another great entry for the Higurashi series. It does a really good job answering a lot of questions (it is the first Answer arc after all) but does an even better job creation new questions that will hopefully be answered in the next arcs. It really does a good job at giving another perspective of events of past games and helping understand what happened, all coupled with great story and great character development. Definitely recommend it if you have played 1-4 and if not, do yourself a favor and go buy them and play them!", "timestamp_created": 1493513334, "timestamp_updated": 1493513334, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.612808", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31451170": {"recommendationid": "31451170", "author": {"steamid": "76561197994421651", "num_games_owned": 173, "num_reviews": 24, "playtime_forever": 1120, "playtime_last_two_weeks": 0, "last_played": 1493758160}, "language": "english", "review": "Cool chapter, scary moments and so forth...\n\nBut why does Kasai look like Adam Jensen??", "timestamp_created": 1493507496, "timestamp_updated": 1493507496, "voted_up": true, "votes_up": 1, "votes_funny": 6, "weighted_vote_score": "0.490099", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31444264": {"recommendationid": "31444264", "author": {"steamid": "76561198012676859", "num_games_owned": 236, "num_reviews": 16, "playtime_forever": 692, "playtime_last_two_weeks": 0, "last_played": 1493621926}, "language": "english", "review": "Reading this is like watching a horrible train wreck in slow motion.  From the very beginning, it's obvious something's going to go wrong.  But despite knowing that, or maybe because of that, the tension hurts so much more.", "timestamp_created": 1493484428, "timestamp_updated": 1493484428, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.572727", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31441603": {"recommendationid": "31441603", "author": {"steamid": "76561198325899538", "num_games_owned": 169, "num_reviews": 35, "playtime_forever": 260, "playtime_last_two_weeks": 0, "last_played": 1493476491}, "language": "schinese", "review": "相比前作本作加入了优秀的配乐（重要的是有you的改编曲子)，一些cg也让表现力比原来更丰富，希望制作方接下来让海猫和寒蝉系列加入语音。\n\n我希望将来能支持中文\n——来自一名中国粉丝的愿望", "timestamp_created": 1493477112, "timestamp_updated": 1493477112, "voted_up": true, "votes_up": 9, "votes_funny": 1, "weighted_vote_score": "0.642424", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31437552": {"recommendationid": "31437552", "author": {"steamid": "76561198116826387", "num_games_owned": 243, "num_reviews": 10, "playtime_forever": 404, "playtime_last_two_weeks": 0, "last_played": 1493577426}, "language": "schinese", "review": "好作品 终于来了", "timestamp_created": 1493464703, "timestamp_updated": 1493464703, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31432681": {"recommendationid": "31432681", "author": {"steamid": "76561198059883840", "num_games_owned": 951, "num_reviews": 127, "playtime_forever": 388, "playtime_last_two_weeks": 0, "last_played": 1493470900}, "language": "russian", "review": "Вот и арка ответов подъехала. \nТут нам рассказывают, как [spoiler]Шион дошла до убийств[/spoiler]. Годно. Эх, ностальгия. Прекрасные задники и звуки. Присуствует руссификатор. Ждём выхода остальных частей.", "timestamp_created": 1493446148, "timestamp_updated": 1493529848, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.553829", "comment_count": "6", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31432477": {"recommendationid": "31432477", "author": {"steamid": "76561198043087117", "num_games_owned": 152, "num_reviews": 13, "playtime_forever": 438, "playtime_last_two_weeks": 0, "last_played": 1494819006}, "language": "english", "review": "By far my favorite arc of the entire series, Meakashi is probably the spoopiest and most mind blowing Higurashi gets (based on the anime and manga, that is). As the first answer arc, you begin to see similar events to past chapters but from a different perspective, with huge differences in understanding because of it. This factor makes Meakashi incredibly satisfying on account of the new information and plot twists, while Ryukishi does an excellent job of posing questions that even the characters who drive the story can't properly answer. I obviously wouldn't recommend it unless you've experienced chapters 1-4, but picking it up should be a priority for fellow moe/comedy/horror/mystery fans.", "timestamp_created": 1493445313, "timestamp_updated": 1493445313, "voted_up": true, "votes_up": 24, "votes_funny": 0, "weighted_vote_score": "0.751173", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31430178": {"recommendationid": "31430178", "author": {"steamid": "76561198059971262", "num_games_owned": 1222, "num_reviews": 297, "playtime_forever": 447, "playtime_last_two_weeks": 0, "last_played": 1494047041}, "language": "english", "review": "Oh boy! Here comes the first Answer arc! \n\nGetting this one after the fourth one is a no brainer. At this point, it's too late to turn back, or else you'll suffer Oyashiro-sama's curse.", "timestamp_created": 1493436102, "timestamp_updated": 1493436102, "voted_up": true, "votes_up": 18, "votes_funny": 9, "weighted_vote_score": "0.671768", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31427978": {"recommendationid": "31427978", "author": {"steamid": "76561198281036688", "num_games_owned": 138, "num_reviews": 15, "playtime_forever": 10, "playtime_last_two_weeks": 0, "last_played": 1493424346}, "language": "schinese", "review": "看完寒蝉和海猫的故事之后就决定steam出一部买一部，支持dai神和龙骑士！鸣泣厨等着你们出新作呐！\nPS：虽然是寒蝉的评测页面，但我还是想问：《海猫鸣泣之时·散》何时登录steam？相比寒蝉解篇的平铺直叙陈述真相，我心中更爱海猫那种更富有深意的故事哲学和无限开放的世界观。\n\n更新评测：海猫·散已经登录steam！买买买！", "timestamp_created": 1493425945, "timestamp_updated": 1511443231, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.665406", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31427256": {"recommendationid": "31427256", "author": {"steamid": "76561198148966981", "num_games_owned": 162, "num_reviews": 26, "playtime_forever": 1628, "playtime_last_two_weeks": 0, "last_played": 1498634830}, "language": "english", "review": "shion is best girl", "timestamp_created": 1493422817, "timestamp_updated": 1493422817, "voted_up": true, "votes_up": 23, "votes_funny": 3, "weighted_vote_score": "0.516773", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31427222": {"recommendationid": "31427222", "author": {"steamid": "76561198085022434", "num_games_owned": 189, "num_reviews": 11, "playtime_forever": 40141, "playtime_last_two_weeks": 2492, "last_played": 1516294709}, "language": "english", "review": "I love Rena Ryuuguu.", "timestamp_created": 1493422688, "timestamp_updated": 1493422706, "voted_up": true, "votes_up": 50, "votes_funny": 5, "weighted_vote_score": "0.647800", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31427093": {"recommendationid": "31427093", "author": {"steamid": "76561198016010438", "num_games_owned": 810, "num_reviews": 69, "playtime_forever": 1036, "playtime_last_two_weeks": 0, "last_played": 1493617317}, "language": "english", "review": "I love Shion Sonozaki", "timestamp_created": 1493422022, "timestamp_updated": 1493422288, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.494183", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31427090": {"recommendationid": "31427090", "author": {"steamid": "76561198013414625", "num_games_owned": 1288, "num_reviews": 135, "playtime_forever": 1129, "playtime_last_two_weeks": 0, "last_played": 1499376506}, "language": "english", "review": "Fantastic. Best chapter so far.", "timestamp_created": 1493422014, "timestamp_updated": 1499364142, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.521298", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 85, "total_negative": 3, "total_reviews": 88}}
