{"reviews": {"39447393": {"recommendationid": "39447393", "author": {"steamid": "76561198092708437", "num_games_owned": 51, "num_reviews": 4, "playtime_forever": 192, "playtime_last_two_weeks": 192, "last_played": 1516315958}, "language": "czech", "review": "Jedna z těch horších her od Artifex Mundi. \nKdyž to máte na Casual dohráno za 2 hodiny bez jediného skipu, tak je to fakt blbý :D\nCelkem dobrý nápad, co se příběhu týče, ale bohůmžel realizace hodně špatná.. Hádanky taktéž až  moc jednoduché.. I ta bonusová kapitola mi přišla zajímavější než celá hra, což je také celkem smutné... :/", "timestamp_created": 1516317876, "timestamp_updated": 1516318142, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39330819": {"recommendationid": "39330819", "author": {"steamid": "76561198279585280", "num_games_owned": 243, "num_reviews": 11, "playtime_forever": 272, "playtime_last_two_weeks": 272, "last_played": 1515910691}, "language": "schinese", "review": "对希腊神话的演绎，虽然历史文化背景不是很了解，总的来说让人有探究的兴趣。游戏进程中规中矩，解密难度也不大，对新手来说还是很友好的一款解密类上手游戏。", "timestamp_created": 1515913284, "timestamp_updated": 1515913284, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39192513": {"recommendationid": "39192513", "author": {"steamid": "76561198135438892", "num_games_owned": 2275, "num_reviews": 3315, "playtime_forever": 236, "playtime_last_two_weeks": 240, "last_played": 1515486132}, "language": "romanian", "review": "Very nice game", "timestamp_created": 1515448089, "timestamp_updated": 1515448089, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39147764": {"recommendationid": "39147764", "author": {"steamid": "76561198052738655", "num_games_owned": 31, "num_reviews": 5, "playtime_forever": 366, "playtime_last_two_weeks": 0, "last_played": 1515274437}, "language": "russian", "review": "Чрезвычайно залипательно,даже для квестоскептика. Хотя местами могло бы быть посложнее,а графониум - получше.", "timestamp_created": 1515322394, "timestamp_updated": 1515322394, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38975914": {"recommendationid": "38975914", "author": {"steamid": "76561198151487252", "num_games_owned": 84, "num_reviews": 6, "playtime_forever": 741, "playtime_last_two_weeks": 586, "last_played": 1515516817}, "language": "russian", "review": "*За игру огромное спасибо [url=http://steamcommunity.com/profiles/76561198042548940/] ему [/url]\n\nПрежде чем я перейду к этому обзору, я собираюсь сказать, что это очень хорошая игра, и если вам нравятся игры с поиском скрытых объектов, то стоит задуматься о покупке. Игра предлагает массу разнообразного геймплея и отличной графикой (для такого жанра-то), и история не так уж плоха; это забавный опыт для новичков этого жанра, а также старых поклонников. Прежде чем узнать что-либо об игре, я была привлечена названием, как поклонник мифологии, перспектива вникать в мир древнегреческих бесенок очаровала меня. По правде говоря, я не слишком много знала про легенду о Минотавре, пока не сыграла в эту игру.\n\nИгра начинается с краткой версии легенды минотавра. Эту легенду рассказывает Памела - главный герой игры. Действия сначала происходят в музее. Вскоре действия уходят на юг, когда люди с капюшонами атакуют ГГ. Позже выяснилось, что они являются частью культа, пытающегося возродить Минотавра. Памела узнаёт о том, что она Избранная, потомок Ариадны, которая помогла герою Тесею победить Минотавра. Здесь много действий с большим количеством магии и мистики, моя единственная реальная жалоба заключается в том, что Памела не очень хорошо сформирована как персонаж, а Минотавр - не очень страшная угроза, культ более опасен и они появляются только дважды.\n\nБольше всего мне понравился игровой процесс, есть много скрытых объектов, и я не могу вспомнить второго посещения одной и той же сцены. Есть также большое количество головоломок, большинство из которых не слишком сложны. \n\nУ игры графика наравне с большинством других игр в этом жанре. Сцены хорошо сделаны, разноцветные фоны и хорошо нарисованные персонажи. Анимация гладкая, персонажи ходят и хорошо разговаривают с участием роликов. Вам не придется беспокоиться о том, чтобы прищуриться, предметы в поисковообъектных сценах легко видны и не являются тяжелой задачей для поиска. Звук хорош, музыка подходит к сюжету хорошо, а голос, сышимый нами в течении большей части игры, хорошо сделан. Моя единственная проблема была с Гефестом, его уровень звука был ниже, чем другие персонажи, когда он говорил. Кроме того, иногда качество звука в целом в игре становилось очень низким, при переходе из одной области в другую.\n\nБесконечные басни: Проклятие Минотавра - очень хорошая игра, почему вы все еще это читаете, идите покупать! С освежающим количеством разнообразия в своих поисковообъектных сценах, в сочетании с прекрасной эстетикой эта игра предлагает несколько часов развлечений с её основной сюжетной линией, а также интересную бонусную главу. Есть много достижений в Steam, на которые нужно охотиться после. Если вы поклонник игр с скрытыми объектами, советую преобрести.\n\n\n*Хорошая игра для покупки, но только для любителей такого жанра.", "timestamp_created": 1514904729, "timestamp_updated": 1515516457, "voted_up": true, "votes_up": 22, "votes_funny": 0, "weighted_vote_score": "0.734003", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38881686": {"recommendationid": "38881686", "author": {"steamid": "76561198799677287", "num_games_owned": 25, "num_reviews": 1, "playtime_forever": 100, "playtime_last_two_weeks": 0, "last_played": 1514377879}, "language": "german", "review": "Schönes Spiel für einen Abend. Ich war in 100 Minuten durch.", "timestamp_created": 1514678590, "timestamp_updated": 1514678590, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38408265": {"recommendationid": "38408265", "author": {"steamid": "76561198056223771", "num_games_owned": 554, "num_reviews": 54, "playtime_forever": 287, "playtime_last_two_weeks": 0, "last_played": 1513621623}, "language": "english", "review": "In Endless Fables: The Minotaur's Curse, you are the descendant of Ariadne and must keep the minotaur's spirit from re-animating its body and doing naughty things.  Along the way, you must also defeat Medusa and learn to harness the power of the Ariadne's legendary thread.\n\nThe graphics are pretty.  The plot is somewhat interesting with its own version of Greek mythology.  The puzzles are not difficult, but still manage to be fun.  The voice actors sound like they are ready for a nap.  However, my main complaint, is that there is a heck of a lot of crap to collect for the achievement inclined.\n\nAll told, the game is neither great nor awful.  It does not really stand out among Artifex Mundi's usual offerings, but it's not a bad way to spend a few hours.", "timestamp_created": 1513633134, "timestamp_updated": 1515092264, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38091077": {"recommendationid": "38091077", "author": {"steamid": "76561198158004807", "num_games_owned": 125, "num_reviews": 52, "playtime_forever": 227, "playtime_last_two_weeks": 0, "last_played": 1512516178}, "language": "english", "review": "A somewhat interesting story. I like the style and variety of puzzles, though they were on the easier side (but maybe that's because I've played so many of this type of game). Music and voices are nice. Lots of different types of special objects to find, which is the hardest thing in the game. Some achievements require playing the bonus chapter.", "timestamp_created": 1512516338, "timestamp_updated": 1512516338, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37919543": {"recommendationid": "37919543", "author": {"steamid": "76561198427947336", "num_games_owned": 54, "num_reviews": 2, "playtime_forever": 1187, "playtime_last_two_weeks": 0, "last_played": 1510054834}, "language": "schinese", "review": "剧情牵强画风牵强但是玩玩还是不错的", "timestamp_created": 1511931291, "timestamp_updated": 1511931291, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36607529": {"recommendationid": "36607529", "author": {"steamid": "76561198120567690", "num_games_owned": 322, "num_reviews": 45, "playtime_forever": 333, "playtime_last_two_weeks": 0, "last_played": 1482732287}, "language": "english", "review": "Endless Fables: The Minotaur's Curse is an exceptionally well done hidden object game full of excellent puzzles and ancient Greek mythology. The mythological snippets are present in basically all of the puzzles, just like they are in the story of course, which is about the well-known legend of Theseus, Ariadne and the Minotaur. I happily discovered (from the names in the credits) that the game is made by a Hungarian studio, but of course I'll try to remain objective and write an unbiased review.\n\nWe play as Pamela Cavendish, an anthropologist who - after a disturbing encounter with a mysterious hooded figure - interacts with Ariadne's Thread proving that the legend of the Minotaur was/is indeed true. We soon learn that the Minotaur is waiting to be revived and only a descendant of Ariadne can kill him with the combined power of the thread and a magic crystal. That leaves us with only 1 question: who might the descendant of Ariadne be? :)\n\nThe special feature of the game is the aforementioned thread with which we can solve puzzles by doing several things: it can melt things, revive creatures and neutralize magic. By collecting crystals can we unlock the powers of the thread.  The melt feature is the one we are going to use most of the time so if we get stuck, we'll probably have to melt something.\n(Unfortunately it doesn't function as a normal rope, so at one point where we have to rescue a guy from a well, we are going to have to look for a regular rope.)\n\nAltough the story itself is pretty good (even if it gets a bit dull as we progress) the game's main strength are the lore about Greek mythology and the diverse selection of puzzles. The number of these puzzles outweigh the hidden object scenes, which is good news since puzzles and minigames are generally more enjoyable, than simple hidden object scenes. Even the HO scenes are out of the ordinary and often require a bit og extra attention. As more and more of the story is being revealed the game also tests our knowledge of Greek mythology. Of course we can't get stuck during these storytelling parts, it is a nice touch.\nI really liked the fact that after the main story, the bonus chapter continues our adventure right off the bat: we have to escape from the magical island where we fought the Minotaur. Even though the quality of this roughly 30-40 minutes long expansion is lower than of the main game, it's still enjoyable. I particulary liked how some of the collectibles are scattered throughout this bonus chapter as well, so in order to collect them all we have to remain vigilant through this part of the game also (there are all sorts of them: butterflies, dragonflies, fireflies, night butterflies and morphing objects, but surprisingly they aren't that hard to spot).\n\nThe graphics, altough generally nice, sometimes isn't as detailed as in other recent HO games. During the cutscenes character animations seem a bit clumsy and due to zooming pixelation may occur. And the vegetation seems strange: it doesn't seem as mediterranean as one would expect from Crete. \nOn the other hand small things, such as the achievement icons which look like works of art or the design of some puzzles are really well made.\nThe music unfortunately is totally forgettable.\n\nEndless Fables: The Minotaur's Curse is one of those hidden object games that can be safely recommended for everyone and while it's not the most spectacular looking one, its deep mythological content and great puzzles it deploys make it a must buy for the fans of the genre.\n\nPROS\n+ Greek mythology\n+ plenty of great puzzles\n+ variety in hidden object scenes\n+ interesting concept\n+ bonus chapter\n\nCONS\n- pixelated graphics during certain cutscenes\n- some character animations are awkward\n- music is mediocre\n\nRATING\n8/10", "timestamp_created": 1511040849, "timestamp_updated": 1511040849, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.584034", "comment_count": "2", "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36578429": {"recommendationid": "36578429", "author": {"steamid": "76561198055712561", "num_games_owned": 159, "num_reviews": 34, "playtime_forever": 274, "playtime_last_two_weeks": 0, "last_played": 1510694468}, "language": "french", "review": "Bien qu'il soit magnifique et que les énigmes soient plutôt bien dosées, j'ai trouvé l'histoire principale assez mal exploitée (quand on part sur le thème de la mythologie grecque, il y a tellement à dire !) et la fin est franchement risible (allez vole petite chouette mécanique, vole !!) Beaucoup d'objets de collections à chercher, ce que j'ai bien apprécié ! L'histoire bonus a le mérite de finir l'histoire. Je recommande aux fans du genre.", "timestamp_created": 1510945209, "timestamp_updated": 1510945209, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36388597": {"recommendationid": "36388597", "author": {"steamid": "76561198048206769", "num_games_owned": 641, "num_reviews": 56, "playtime_forever": 637, "playtime_last_two_weeks": 0, "last_played": 1510199177}, "language": "english", "review": "I'll stick to basic points:\n\nFast travel map is available from the start of the game.\n\nCustom difficulty.\n\nMahjong alternative to HO scenes from around the 3rd one on (or maybe I missed it earlier due to tutorial only mentioning it then).\n\nA tool with 3 special abilities (2nd and 3rd gained while playing). \n\nInteresting minigames. Similar to stuff we've seen before, but some have a new way to do them. I especially like the kinda HO/find pairs minigame from the third special effect you get from the tool. \n\nInteractive and varied HO scenes (not just word searches). Well, the first one seems more like a minigame than a HO scene. :)\n\nStory takes familiar myths and reinvents them to be not quite the same.\n\nBackstory explained in interactive book-things.\n\nBonus adventure is nicely relevant.\n\nTons of cut scenes/little animated scenes in between, like whenever someone talks. (Though the viewpoint's voice talks a bit too fast for my taste.)\n\nThere are collectible objects, but no indicator when you haven't found one yet. \n\n\nI won this in a Hidden Object Gamers Group give-away. \nhttp://steamcommunity.com/groups/hoggroup#announcements/detail/275115087880051609\n\nThanks to Artifex Mundi and the Steam Group for making these give-aways!", "timestamp_created": 1510199408, "timestamp_updated": 1510225451, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.519074", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36221561": {"recommendationid": "36221561", "author": {"steamid": "76561197968095997", "num_games_owned": 350, "num_reviews": 108, "playtime_forever": 230, "playtime_last_two_weeks": 0, "last_played": 1509641370}, "language": "czech", "review": "Pekny pocin, vylet do greckej mytologie na boj proti minotaurovi.", "timestamp_created": 1509641412, "timestamp_updated": 1509641412, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36167835": {"recommendationid": "36167835", "author": {"steamid": "76561198002530309", "num_games_owned": 1423, "num_reviews": 20, "playtime_forever": 396, "playtime_last_two_weeks": 0, "last_played": 1506516109}, "language": "french", "review": "Bien mais sans plus. \n\nJoli, bien réalisé, pas de pièges, pas de \"trucs ennervants\" mais histoire oubliable. La fin est grotesque. \n\nUn jeu dans la lignée des autres, bonne facture mais sans plus.", "timestamp_created": 1509460310, "timestamp_updated": 1509460310, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35895548": {"recommendationid": "35895548", "author": {"steamid": "76561198163926961", "num_games_owned": 589, "num_reviews": 46, "playtime_forever": 593, "playtime_last_two_weeks": 0, "last_played": 1508601435}, "language": "polish", "review": "\"Endless Fables: The Minotaur's Curse\" jest fajną grą, zresztą zauważyłam, że AM słabych gier raczej nie wypuszcza na rynek. Miła dla ucha muzyka, piękne grafiki, odpowiednio trudne zagadki i ciekawa fabuła. Trochę trudno odnajduje się przedmioty kolekcjonerskie, a osiągnięcia typu \"rozwiąż minigrę w 60 sekund\" albo \"znajdź ukryte obiekty w 45 sekund\" i to kilkukrotnie w ciągu gry to naprawdę nie lada wyzwanie :D Zdecydowanie polecam :D", "timestamp_created": 1508602204, "timestamp_updated": 1508602204, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35540996": {"recommendationid": "35540996", "author": {"steamid": "76561198340526397", "num_games_owned": 79, "num_reviews": 44, "playtime_forever": 169, "playtime_last_two_weeks": 0, "last_played": 1507373475}, "language": "schinese", "review": "刚玩完恐怖传奇3来玩这个，看发行日期本来是抱着起码画质高清的期待的。\n然而画质不高清，人物动作也略僵硬，也不好看。\n虽然很多人觉得AM的剧情都很老套，但这一部剧情毫无吸引人之处，起码我是这么觉得的。\n而其他比如恐怖传奇和乌鸦森林的剧情我都是很喜欢的。\n找物游戏也没有替代。\n喜欢阅读的人也会失望，出现的文字和书都是做个样子，不能看的。这就是点击游戏，点击解谜都算不上吧。。\n唯一的优点是可以自定难度，成就党玩不错。\n习惯好评。", "timestamp_created": 1507373765, "timestamp_updated": 1507373891, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34858061": {"recommendationid": "34858061", "author": {"steamid": "76561198331729581", "num_games_owned": 1598, "num_reviews": 72, "playtime_forever": 187, "playtime_last_two_weeks": 0, "last_played": 1496404189}, "language": "schinese", "review": "超爱冒险解谜游戏，前来玩正版", "timestamp_created": 1505037836, "timestamp_updated": 1505037836, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34746466": {"recommendationid": "34746466", "author": {"steamid": "76561198033967307", "num_games_owned": 6526, "num_reviews": 213, "playtime_forever": 118, "playtime_last_two_weeks": 0, "last_played": 1504624587}, "language": "german", "review": "Tolles Wimmelbildspiel mit einer guten Story und gut lösbaren Rätseln rund um die griechische Mythologie.", "timestamp_created": 1504569703, "timestamp_updated": 1504569703, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.620560", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34686974": {"recommendationid": "34686974", "author": {"steamid": "76561198056864749", "num_games_owned": 514, "num_reviews": 18, "playtime_forever": 259, "playtime_last_two_weeks": 0, "last_played": 1504908076}, "language": "english", "review": "The story, although an interesting concept, is delievered poorly. Voice acting is limited. Mini games are very easy and not that engaging. Not the best animation. It's overall mediocre, which is a shame as the publisher develops some fantastic hidden object games", "timestamp_created": 1504363377, "timestamp_updated": 1504363377, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.591212", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34407013": {"recommendationid": "34407013", "author": {"steamid": "76561198257988868", "num_games_owned": 2747, "num_reviews": 55, "playtime_forever": 431, "playtime_last_two_weeks": 0, "last_played": 1503368831}, "language": "schinese", "review": "剧情长度合适，不过到最后也不知道他的母亲大人到底干了什么坏事。\n找物品每次所需物品略有不同，其他解谜可以参考指南：\nhttp://www.bigfishgames.com/blog/walkthrough/endless-fables-the-minotaurs-curse-strategy-guide-hints-cheats-codes-tips-tricks/", "timestamp_created": 1503369195, "timestamp_updated": 1503369195, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.478261", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 55, "total_negative": 3, "total_reviews": 58}}
