{"reviews": {"39400438": {"recommendationid": "39400438", "author": {"steamid": "76561198016311661", "num_games_owned": 542, "num_reviews": 70, "playtime_forever": 99, "playtime_last_two_weeks": 99, "last_played": 1516142082}, "language": "english", "review": "controlling ship is Ok.. but other controls is bad.\n\nit can be great game, but its just to early..\n\ngame crash 2 times in first 80min.", "timestamp_created": 1516141203, "timestamp_updated": 1516142213, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1516207418, "developer_response": "Sorry about the issues.\n\nIf you could provide more info on the crashes on the bug/support forum - http://steamcommunity.com/app/369530/discussions/6/ - I would appreciate it.\n\nDuring Early Access new features/code is constantly being added leading to the possibility of adding in bugs. \n\nI rely on the community's help in helping me fix these issues - and as a thanks I give out Steam keys when a crash bug is sent my way."}, "39268846": {"recommendationid": "39268846", "author": {"steamid": "76561197988347920", "num_games_owned": 108, "num_reviews": 4, "playtime_forever": 3666, "playtime_last_two_weeks": 3498, "last_played": 1515872194}, "language": "english", "review": "This has turned into an incredibly fun space sim. \n\nIt has a depth you would excpect from many space sims, but has a simplicity in the design that makes it easy to set up so you can start dominating space quickly.\n\nVery fun features combining a RTS fleet combat, with first person shooter immersion.\n\nDont get me wrong it has alot of room for improvement and quality of life features. But its a must have for space sim and RTS fans. Im addicted", "timestamp_created": 1515715958, "timestamp_updated": 1515715958, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.521649", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39243431": {"recommendationid": "39243431", "author": {"steamid": "76561198025362421", "num_games_owned": 117, "num_reviews": 4, "playtime_forever": 5449, "playtime_last_two_weeks": 4462, "last_played": 1516480661}, "language": "english", "review": "Fantastic game. Very active dev and despite beeing in 'early access', is already well worth the price tag. Can't wait to see where this game goes!", "timestamp_created": 1515627396, "timestamp_updated": 1515627396, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497836", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39223999": {"recommendationid": "39223999", "author": {"steamid": "76561198006613777", "num_games_owned": 156, "num_reviews": 1, "playtime_forever": 4116, "playtime_last_two_weeks": 3933, "last_played": 1516154667}, "language": "english", "review": "Wow, can’t believe I haven’t found this game until now, but very glad I have.  I’m a bit of a junkie for these kinds of games, I love the old elite games, have a ton of hours in the X series, and have played just about every space game I can get my hands on.  \n\nVoid Destroyers 2 manages to scratch more of my space game itches at once than any other game I’ve played.  \n\nVoid Destroyers 2 is a bit between genres.  One part of it is a bit like old elite, you fly ships using Newtonian physics and fight other ships.  However VD2 also allows you to pilot and fly all kinds and sizes of ships.  In addition to that besides fighting there’s also trading, mining, and their corresponding ship types.  \n\nYou can also take over bases and build new and bigger ships.\n\nYou can command while fleets of ships at once, waging war, sieging your enmities, making trade runs.  Raiding trade routes, capturing ships, whatever.  \n\nIt’s perhaps most like mount and blade in space.  \n\nAlthough it is an early access game there seems to be a lot of content, and the dev is very active updating it with new things and communicating.  \n\nI would heartily recommend this game to anyone interested in space combat games, particularly if like me you like a nice strategy, tactics, and trading layer on top.", "timestamp_created": 1515561522, "timestamp_updated": 1515561522, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.497836", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39168587": {"recommendationid": "39168587", "author": {"steamid": "76561198082341675", "num_games_owned": 48, "num_reviews": 2, "playtime_forever": 491, "playtime_last_two_weeks": 299, "last_played": 1515723736}, "language": "english", "review": "This game is by far a great game, Having played 6 hours by now i can see the game is solid but my main problem with it has to be the crashes! I love the game very simple but fun mechanics but the crashing ruins the fun and yes the autosave is nice. It doesnt always save where i am and so my money runs are gone which leaves me not wanting to play anymore at times. GREAT GAME, but the crashing should be worked on. For now i give it a 7/10. Couldve been a 9 easily but the crashes sets it back", "timestamp_created": 1515371644, "timestamp_updated": 1515371644, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1515377535, "developer_response": "Sorry about the crashes.\n\nDuring Early Access new code is constantly being added meaning potential issues are constantly created. \n\nIf you could hop onto the Bug/Support forum and leave a post about teh crash we might be able to work it out faster - together."}, "39008330": {"recommendationid": "39008330", "author": {"steamid": "76561197961181274", "num_games_owned": 1205, "num_reviews": 27, "playtime_forever": 248, "playtime_last_two_weeks": 80, "last_played": 1515512254}, "language": "english", "review": "Now this is a really fun indie space sim/action game. You can mine, kill pirates, kill civilians, do missions, race, duel, upgrade your ship, buy new ships, assign ships to your own fleet, and it has what I think is a cool art style. Get out there and get your murder on!", "timestamp_created": 1514980703, "timestamp_updated": 1514980703, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.414863", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38796625": {"recommendationid": "38796625", "author": {"steamid": "76561198034587876", "num_games_owned": 132, "num_reviews": 5, "playtime_forever": 951, "playtime_last_two_weeks": 1, "last_played": 1516247385}, "language": "english", "review": "I really enjoyed this game. I'm kinda terrible at space combat so the beginning of the game was a bit slow for me, but when I picked up a few more ships and built a fleet it was quite fun. The missions were varied and it was interesting.", "timestamp_created": 1514498642, "timestamp_updated": 1514498642, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.497836", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38636784": {"recommendationid": "38636784", "author": {"steamid": "76561198014813447", "num_games_owned": 149, "num_reviews": 6, "playtime_forever": 1143, "playtime_last_two_weeks": 34, "last_played": 1516223227}, "language": "dutch", "review": "i did not like the screen shots on the store page... but it is a really nice game :) little like mount and blade in space", "timestamp_created": 1514150473, "timestamp_updated": 1514150473, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38570857": {"recommendationid": "38570857", "author": {"steamid": "76561198004686603", "num_games_owned": 416, "num_reviews": 33, "playtime_forever": 2447, "playtime_last_two_weeks": 0, "last_played": 1514034333}, "language": "english", "review": "Disclaimer 1: Product received for free\nDisclaimer 2: I bought a copy for a friend so I could pay for this game as it is worth it. \n\nVoid Destroyer is a unique game, it feels a bit like a space version of Mount & Blade meets Homeworld meets Battlezone meets original Void Destroyer. \n\nEssentially it is an open world sandbox where you start out in a small fighter and then it is up to you to do what you want.  You can fight, do missions, trade, mine, pirate, steal, wage wars or simply take over the system.  More than likely you will eventually end up doing a bit of most of those, some you will do yourself the rest you might get your AI minion fleets to do for you. \n\nWhat I love about this game is how it changes as you play.  Your experience during the first few hours as you do low paying jobs, struggling to earn enough credits to upgrade the rust bucket you have been given is very different from later on, where you wil go on to start commanding larger ships like corvettes, frigates and eventually destroyers. \n\nFrom flying your own trader to owning a fleet of trade ships and escorts, directing mining fleets and perhaps, even building an armada large enough to capture one of the space stations out there.  Once you do this the game again changes as you now have the ability to not only buy ships but build them and you have now transformed into a faction.  How far does your ambition go....?\n\nGameplay wise you are able to fly ANY ship in the game, from the lowliest drone fighter to the largest behemoth cruisers.  You have own many ships and jump between them as you see fit.  You can have them form their own mining or trade fleets to go and earn you money and resources, assign them to protect your assets or have them join you.  \n\nThere are a great many ships to choose from, tugs, a large number of light, medium & heavy fighters, corvettes, frigates, destroyers & cruisers and all armed with various deadly weaponry from turrets to missiles to beam weapons.  \n\nCurrently my fav is an Apollo Class light corvette that is pretty much my own personal Millenium Falcon, fast, agile and punches above her weight.  While I have pretty much upraded to a heavy beam frigate now as my ambitions sore, I will always fondly remember that ship. And yes you can name all of them :)\n\nThose that join you, you are able to control via a tactical RTS style command system or in cockpit via simple Wingmen commands.  This allows to give complex instructions to your fleet and if you wish can play out entire confrontations like an RTS if you do not feel like taking to the cockpit. \n\nThis is an EA game so there will be bugs, crashes, features to be implemented etc but it is a very flesh out game at this time and you can get many hours of enjoyment already. \n\nThe developer is VERY responsive and it is not uncommon to report a bug and have him release a patch/bugfix within a day or two once he figures out what is causing it.  As such the EA user base here is very important to highlight not only bugs but features that either work well or could use improvement. \n\nIf you like space, strategy or flying then this could be a game for you.", "timestamp_created": 1514024086, "timestamp_updated": 1514024086, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.525401", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "38275306": {"recommendationid": "38275306", "author": {"steamid": "76561198061954691", "num_games_owned": 164, "num_reviews": 20, "playtime_forever": 1672, "playtime_last_two_weeks": 1, "last_played": 1515804562}, "language": "english", "review": "Before you buy this game, pay attention to the \"early access\" part of the description. Currently i wouldn't even call thisw game playable :/ concept is great, graphics are cool, i love mount&blade. \nBUT! \ngame likes to crash, about once every 30 minutes\nusually on switching game modes\nevery few crashes froze my PC forcing me to restart the whole system\nI also experienced a lot of FPS drops in the galaxy map mode. As long as i just fly around it keeps stable 60fps never drops a frame, but about an hour into the game it drops to about 5-10 fps in the map :/\ncontrols are weird and awkward (scrolling in the galaxy map especially)\nso\ndon't buy it now, cause you won't be able to play it.\nAnd i REALLY hope it gets finished one day.", "timestamp_created": 1513153738, "timestamp_updated": 1513153738, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.530719", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1513180182, "developer_response": "Hey - I've sent over a friend request to hopefully trouble shoot the \"5fps\" in overworld mode issue. \n\nYou are 100% correct - the game is in Early Access and thanks to player's feedback and telling me about issues - it gets better every day. So I hope we are able to resolve your fps issue (and other issues) as well."}, "38188897": {"recommendationid": "38188897", "author": {"steamid": "76561198189909394", "num_games_owned": 98, "num_reviews": 3, "playtime_forever": 2642, "playtime_last_two_weeks": 53, "last_played": 1516040440}, "language": "english", "review": "This game is a very good game, especially for the price, while yes.. the game isnt done yet, far from it actually, but the developer of this game is hard at work on finishing it. the biggest reason I like this game is because it feels like a fresh new expirence among the hundreds of space themed games availabele on steam as of now, this game gives a true space sim expirence. \n\nsome things you can do in this game include but are not limited to:\n\n-working for the military\n\n-being a pirate\n\n-mining for a shitton of ore\n\n-capturing bases\n\n-building an armada of overpowered randomness\n\n-finaly capturing a military base\n\n-getting op military ships\n\n-MORE PIRATING\n\n-taking the entire system\n\n-and so much more\n\nso just in general this game is a 8/10 for me, definatly recomend purchasing it if you want a GOOD space sim.", "timestamp_created": 1512846478, "timestamp_updated": 1512846611, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38185110": {"recommendationid": "38185110", "author": {"steamid": "76561197998933573", "num_games_owned": 50, "num_reviews": 10, "playtime_forever": 22, "playtime_last_two_weeks": 0, "last_played": 1512837076}, "language": "english", "review": "I'm dumb. Can't wait to get this again when I have the money.", "timestamp_created": 1512837550, "timestamp_updated": 1512953750, "voted_up": true, "votes_up": 0, "votes_funny": 2, "weighted_vote_score": "0.387222", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1512954091, "developer_response": "-- UPDATE --\n\nThanks for updating the review - small indie games rely heavily on reviews since we don't get 23409823423 of them.\n\n\n-- UPDATE --\n\nControls can be rebound here -\n\nIn the main menu click \"Control Mapping\" or while \"in game\" - hit ESC to bring up the menu then click \"Control Mapping\"\n\nFor rolling controls - go into Control Mapping then - click \"Ship\" - then click \"Movement\" - then click the keyboard mappings for \"Roll Right\" and \"Roll Left\" press desired key.\n\nA and D by default are used to strafe right/left - as is standard in many games. This is why control mapping exists - so that players can chose whatever they prefer."}, "38151397": {"recommendationid": "38151397", "author": {"steamid": "76561198003206630", "num_games_owned": 634, "num_reviews": 13, "playtime_forever": 466, "playtime_last_two_weeks": 0, "last_played": 1508093476}, "language": "english", "review": "I've barely scratched the surface, and I still find it fascinating. It crashes a bit for me, so be sure to save often.\n\nIf it got VR support I'd be head over heels for it, but I'm imagining that's unrealistic. :)\n\nOne of these days I'll get around to making some Youtube videos for it...", "timestamp_created": 1512734479, "timestamp_updated": 1512734479, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.524715", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "38087328": {"recommendationid": "38087328", "author": {"steamid": "76561198092568781", "num_games_owned": 254, "num_reviews": 7, "playtime_forever": 3189, "playtime_last_two_weeks": 0, "last_played": 1513492249}, "language": "english", "review": "Ive only played about 10 hours at the time of writing this, but I can say with 100% certianty that this game is amazing.\n\nThe one game I can compare it to is mount and blade warband.\n\nMy one issue is that it crashes, a lot. But the game makes up for this by autosaving when you do just about anything. Ex. = if you dock at a station and the game crashes, it saves right at the point of where you crashed.", "timestamp_created": 1512502891, "timestamp_updated": 1512502891, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1512508637, "developer_response": "PatSaysHi - very glad you are enjoying the game. Mount and Blade was a big inspiration (both in terms of the game - as in terms of me starting down the path as an indie game dev).\n\n\nThe crash you describe is the #1 crash on my radar - however it is proving very hard to track down (I can't reproduce it). So if there's any info/details you can think off to post about it - it would be great to post it in this thread -http://steamcommunity.com/app/369530/discussions/6/1480982971164519618/\n\nthanks"}, "38069171": {"recommendationid": "38069171", "author": {"steamid": "76561198083335383", "num_games_owned": 840, "num_reviews": 23, "playtime_forever": 834, "playtime_last_two_weeks": 0, "last_played": 1507832423}, "language": "english", "review": "Awesome sequel by an even more awesome developer!", "timestamp_created": 1512437023, "timestamp_updated": 1512437023, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37598328": {"recommendationid": "37598328", "author": {"steamid": "76561197976438621", "num_games_owned": 190, "num_reviews": 6, "playtime_forever": 2053, "playtime_last_two_weeks": 0, "last_played": 1511415947}, "language": "english", "review": "Ok, so the first thing you need to know is THIS GAME IS NOT FINNISHED YET. But i really don't mind because there's so much left for me to do and discover still. The mod community adds some functionality to it, but if you like huge fleet battles where you can die at any time if you rush in too fast, this game is for you, and me.", "timestamp_created": 1511653875, "timestamp_updated": 1511653875, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36639523": {"recommendationid": "36639523", "author": {"steamid": "76561198264410071", "num_games_owned": 171, "num_reviews": 1, "playtime_forever": 6434, "playtime_last_two_weeks": 0, "last_played": 1511327402}, "language": "english", "review": "Fantastic game, good in the majority of aspects with very few bugs. The occasional CTD, but very rarely, and I never had it effect my progress in the game. Took me between 20-30 hours to get my first \"big ship\" and fell in love with it's immense power almost instantly. Around 80 hours in, I've taken 2 bases and have a large fleet, and I'm currently fighting a war against the civilians and military.\n\nPros:\n\n+ Fantastic Economy System\n+ Great Command System\n+ Good-Looking Space Combat\n\nCons:\n\n- Somewhat Clunky Interface\n\nOverall, fantastic game that is absolutley worth the $15 pricetag. Even more impressive that it was created by only 1 person! Get this game!\n\nEDIT: THIS GAME IS ON SALE, BUY BUY BUY BUY BUY", "timestamp_created": 1511155269, "timestamp_updated": 1511379474, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.549785", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36480070": {"recommendationid": "36480070", "author": {"steamid": "76561198039662795", "num_games_owned": 421, "num_reviews": 4, "playtime_forever": 1872, "playtime_last_two_weeks": 0, "last_played": 1510035263}, "language": "english", "review": "THIS GAME! \n\nDuring my first few hours playing I was engaged by the unique art style and atmosphere.  I am a veteran of games like the X series, Elite series and of course Evochron but I will not draw comparisons, mainly because Void Destroyer 2 carries itself along a different path.  \n\nIt has RTS, it has Grand Strategy, it has action packed ship simulation.  The story is that of what you would expect while not pushing itself on you too heavily, allowing you the freedom to pick and choose your own story accross a self aware and enjoyable universe.  While vast and endless you will never feel bogged down by the emptiness of a 50 minute travel time from station to station.  \n\nThe only fault with the game that I have ever come across is the orbital control when put to my personal setting also affects the in station camera, which is more of a preference issue than anything and is not much of an issue at that.  \n\nI definitely will be playing this game long into the future!  Thanks for reading.  \n\n10/10", "timestamp_created": 1510523201, "timestamp_updated": 1510523201, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.525079", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36234148": {"recommendationid": "36234148", "author": {"steamid": "76561197983140477", "num_games_owned": 158, "num_reviews": 4, "playtime_forever": 996, "playtime_last_two_weeks": 0, "last_played": 1514327246}, "language": "english", "review": "This is a rare gem in space sims. The dev has started to strike a balance of simplicity and sim aspects of gameplay. Very active in delelopment, updates and responses. Definetly reccomend to those who enjoy space sims and don't mind EA games. Very fun.", "timestamp_created": 1509687570, "timestamp_updated": 1509687570, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.501485", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36078917": {"recommendationid": "36078917", "author": {"steamid": "76561198310541959", "num_games_owned": 46, "num_reviews": 1, "playtime_forever": 225, "playtime_last_two_weeks": 0, "last_played": 1509359869}, "language": "schinese", "review": "开始游戏之后鼠标和镜头一直狂抖，谁来救救我qwq", "timestamp_created": 1509200453, "timestamp_updated": 1509200453, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35963675": {"recommendationid": "35963675", "author": {"steamid": "76561198286652164", "num_games_owned": 202, "num_reviews": 14, "playtime_forever": 445, "playtime_last_two_weeks": 0, "last_played": 1509188344}, "language": "schinese", "review": "We need chinese!\nWe need chinese!\nWe need chinese!\n\n\n我觉得这个游戏可以登陆switch。\nI think this game can be landed on switch.", "timestamp_created": 1508841061, "timestamp_updated": 1514365028, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.518116", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35955904": {"recommendationid": "35955904", "author": {"steamid": "76561198132317982", "num_games_owned": 156, "num_reviews": 1, "playtime_forever": 3809, "playtime_last_two_weeks": 379, "last_played": 1516475378}, "language": "japanese", "review": "前作 Void Destryer 未経験 プレイ時間２５時間時点でのレビュー\n記憶喪失の軍用アンドロイド？として宇宙を渡り歩いていく\nというストーリーがあるがグーグル先生に投げっぱなし程度の英語力では５割ほどしか理解できず、深くストーリーを意識することはなかった。\n実際、ゲームの一番の壁は初期の操作設定がとても操作しづらいことだった。ゲーム内で全てのキー操作が変更可能なのでCONTROL MAPPINGで好きなキーを割り当てよう。WASD＋QEZCで移動しながらXキーやENDキーを押したりマウス操作しながらバックスペースや\\キーを押すのは至難の業だと思うんですよ、、、、\nマップは今のところ固定で広くもなく狭くもなくという大きさ、時間圧縮（加速）システムを使えば数分で盤面の端から端へ移動できる。マップ上には基地、各種プラットホーム、小惑星帯、ワープゲート、太陽(Gate)がありシームレスな移動が可能。\n基本的には、基地にドッキング→ミッション受諾→報酬で船の購入や装備の強化 を繰り返していく。\nミッションの内容は「デブリを壊せ！」「〇〇基地まで輸送しろ！」「基地を守れ！」などゲームでよく聞く英語が分かれば理解できる。ただ、細かい内容については翻訳が必要かも。もっとも、マップ上にマーカーが付くのでそこに行ってみて、敵がいるなら破壊、基地ならドッキング、味方の船だったら護衛　程度の感覚で行けば大体クリア可能。\nよくわからなくてクリアできないときはスペースキーを押すかドッキングして、右に表示されているミッション一覧の×ボタンを押せばいつでもキャンセル可能。どんどん受けよう。\n戦闘はスペースコンバットシムとRTSを足して２で割った感じ、個人的にRTSが苦手なのだが放っておいても勝手にターゲットして戦ってくれるので自機の操作だけに集中できた。RTSがしたい場合でも陣形の組み直しや射撃の可否、攻撃するターゲットの選択やグループ化など一通りのことは可能。しかし、プレイヤーが操作する艦限定で強力なアクティブスキルとセカンダリーウェポンが使える。上手く使えば少数の艦隊でも大型艦を沈めたりできるので、どちらかというとRTS要素はおまけ程度な感じがした。\nまた、ゲームが進むと、安い機体を数十から数百機買えるようになってくるので大艦隊がぶつかり合うと、とても綺麗な弾幕を見ることができる。横一列に並ばせた戦闘機が一斉に突っ込んでいくのは見ていてとても楽しかった。\n戦闘以外にも採掘や貿易（もちろん自動化可能）基地を占領して自分で運営、海賊になって略奪など一通りのことができ値段の割にとてもしっかりしたゲームだった。\n分らないことがあれば製作者さんがSteamコミュニティーの総合掲示板でよく質問に答えているので、自分の疑問と同じスレッドを調べてグーグル翻訳に投げれば大体理解できる。", "timestamp_created": 1508802719, "timestamp_updated": 1508802719, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35896813": {"recommendationid": "35896813", "author": {"steamid": "76561197984440686", "num_games_owned": 716, "num_reviews": 44, "playtime_forever": 1423, "playtime_last_two_weeks": 0, "last_played": 1509376099}, "language": "english", "review": "You know Homeworld?\nEver wanted to be in a Dogfigt, but still have control over your forces?\nJust wanted to engange in Cap-Ship Combat?\nNot just watch your Miners work, but help them out?\n\nYou can do all of that in this game.\n\nGo get it, it's really good.", "timestamp_created": 1508605070, "timestamp_updated": 1508605070, "voted_up": true, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.666249", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35680546": {"recommendationid": "35680546", "author": {"steamid": "76561198151944090", "num_games_owned": 66, "num_reviews": 1, "playtime_forever": 1348, "playtime_last_two_weeks": 0, "last_played": 1508014837}, "language": "english", "review": "A wonderful game with a great community. The learning curve is a bit steep, but paces well with the possible ambitions of the player as they progress into different aspects of the game. It is well worth it's current 15 dollar price tag, and is continually bettering on an insanely frequent basis. Must buy for any space game junkie, rts fan, or just plain sim lover.", "timestamp_created": 1507853554, "timestamp_updated": 1507853554, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35503157": {"recommendationid": "35503157", "author": {"steamid": "76561198060648879", "num_games_owned": 128, "num_reviews": 62, "playtime_forever": 1813, "playtime_last_two_weeks": 0, "last_played": 1496392008}, "language": "english", "review": "I feel that this game is alil to easy with in 30 hours I have already obtained the high level ships and possese the largest and most powerfull roaming trade fleet of warships and with the ability to buy a new frigate every 5 mins or so its just so short of course now i can go fight all the factions and become power so its all worth it still the start up is a lil too easy.", "timestamp_created": 1507234230, "timestamp_updated": 1507234230, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": "7", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1507297808, "developer_response": "Hi - thanks for the review.\n\n\nThis is a tough area to think about when designing games - how long should it take?\n\nFor one thing I'm trying to make the game less of a grind than most games.  So in your example - of 5 minutes to get a Frigate - once you get the ability to build your own ships, that time will be further reduced (building ships in your own base uses ore, but costs much less credits).\n\nHowever as far as trade fleets are concerned - you are right that it is too easy to get credits without many down sides - that aspect is being worked on right now.\n\nHope you continue to enjoy the game and come back to see the updates."}, "35304408": {"recommendationid": "35304408", "author": {"steamid": "76561198063520334", "num_games_owned": 106, "num_reviews": 1, "playtime_forever": 346, "playtime_last_two_weeks": 0, "last_played": 1506719670}, "language": "english", "review": "Awesome Game,\nits for everyone who likes space games, rts games, shooters.\n\nGraphics are similar to Borderlands and perfectly fit in the genre.\n\nHere my first impressions:\n\n- the battles are challenging like in Void Destroyer 1\n- the new overworld mode (long distance traveling) is clear and practical\n- you start with a small fighter and a few missions later (don't increase the difficulty if you start VD2) you will have money for your first upgrades, took me 3-4 hour for buying my next ship, so it's motivating, also in the early-game\n- the controls are fully mapable. Controller support.\n\nThis game is for everyone who likes Elite Dangerous or the X3 series.\n\nI have found my new main-game in steam => VD2", "timestamp_created": 1506703534, "timestamp_updated": 1506804704, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.597589", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35280315": {"recommendationid": "35280315", "author": {"steamid": "76561198132358512", "num_games_owned": 95, "num_reviews": 1, "playtime_forever": 90, "playtime_last_two_weeks": 0, "last_played": 1489466230}, "language": "english", "review": "On ce this game has at the very least a co=op mode or better yet multiplayer. Then I will pick it up. Hope to see this change in the future will keep watching and hope I get to change this review", "timestamp_created": 1506653586, "timestamp_updated": 1506653586, "voted_up": false, "votes_up": 1, "votes_funny": 5, "weighted_vote_score": "0.088341", "comment_count": "12", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1506790274, "developer_response": "This game has never advertised as co-op or multiplayer - nor has this ever been planned. \n\nThese features won't be added - this is a singleplayer game - for a variety of reasons.\n\nSo if co-op/multiplayer is a must have - you can scratch the game off of your watch list."}, "35247413": {"recommendationid": "35247413", "author": {"steamid": "76561198039568007", "num_games_owned": 95, "num_reviews": 2, "playtime_forever": 127, "playtime_last_two_weeks": 0, "last_played": 1513112177}, "language": "english", "review": "Haven't played for long yet (2 hrs or so^^), so let's skip this part. \nRefer to the other reviews for game details, usual rant, etc.\n\nBut what i do can say about this game and it's dev is that he's one of the most active \nand in close touch with the community. He periodically uploads  dev-vids on ytube \nand keeps everone posted on what's new and what's to come etc.\nDev is trying to deliver a certain idea, what the game should be like, though (and actually tells the players of it^^), \nstill he picks up some ideas and implements them where suited. Go go, Super-Dev!", "timestamp_created": 1506538263, "timestamp_updated": 1506538263, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.531250", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35138272": {"recommendationid": "35138272", "author": {"steamid": "76561198040851843", "num_games_owned": 98, "num_reviews": 2, "playtime_forever": 1263, "playtime_last_two_weeks": 0, "last_played": 1506699155}, "language": "english", "review": "I love this game", "timestamp_created": 1506116367, "timestamp_updated": 1506116367, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34893975": {"recommendationid": "34893975", "author": {"steamid": "76561198027772008", "num_games_owned": 356, "num_reviews": 10, "playtime_forever": 318, "playtime_last_two_weeks": 0, "last_played": 1505181163}, "language": "english", "review": "This is more for the dev team.\n\nThe game is fun and I can't wait to see this game when you have finshed it all the way and right now as it stands it's still a great game.  I know you've already talked about controls but, I do want to say that there are way too many of them.  Still playable but the the shift/alt/ctl commands make it very hard for someone to get into it.  If you're someone who just came from playing the X games the space bar will drive you mad.\n\nNOTES:\n-change the roll keys to Q and E\n-change thrust up and down to CTRL and space (that was the part that made me feel wonky when I played becuase I can't change the the command keys.)\n-change ENTER to tac command and SHIFT+ENTER to overworld\n-BACKSPACE to zero speed (It's easier to remember if you want to stop than the botton under it.)\n-change SEC FIRE and MISSLE to R and/or F\n-change X to the lock nearest target\n-change C to change target\n-change Z to your thrust compensator\n\nI think those might be a little more user friendly\n\nSide Note:\nThe spacebar I think most people might just be use to pressing it to pull up the \"mouse arrow\" that's the only reason it drove me mad.  Kept going in and out of tac mode and trying to click targets.  Wanted to do the RTS double click to attack but it wouldn't let me.\n\n\nI'm just one of those people more use to the middle mouse button scroller being my thruster controls and WASD/QE being my up/left/down/right and  roll keys. \n\nIf any of this helped or is already know to you. I'm happy to try and help or just give Ideas.\n\nThank you and keep up the good work!", "timestamp_created": 1505184163, "timestamp_updated": 1505184562, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.571175", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34885726": {"recommendationid": "34885726", "author": {"steamid": "76561197961559698", "num_games_owned": 343, "num_reviews": 5, "playtime_forever": 617, "playtime_last_two_weeks": 0, "last_played": 1506093464}, "language": "english", "review": "Great little game, gives me flashbacks to X3 but far more steamlined and simpler to figgure out. it can be a bit slow to startout but once you get a medium sized ship(not fighter) the game takes off. i would overall recommend this to anyone who likes the X-series but doesnt like the over complexity of them", "timestamp_created": 1505146495, "timestamp_updated": 1505146495, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.541284", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34460225": {"recommendationid": "34460225", "author": {"steamid": "76561197982594914", "num_games_owned": 221, "num_reviews": 8, "playtime_forever": 5738, "playtime_last_two_weeks": 0, "last_played": 1513867317}, "language": "english", "review": "This game is my favorite Space Simulation since X³ Albion Prelude.\n\nAnd that's one of the games that are the most similar to Void Destroyer 2.\n\nYou start in a little ship, that has almost no firepower, can`t haul stuff, but is agile and fast. You can progress by carrying passengers, racing or by bounty hunting. After you got some credits you can buy a better ship and do whatever you like, cause it's a Sandbox.\n\nYou can (right now):\n- Fly every ship you see.\n- Takeover stations and control them. (Control what they produce, export, import, they can build ships for you)\n- Go mining & trading\n- Hire Mercs or buy ships to expand your fleet\n- Be a pirate and steal cargo or capture ships\n- Go bounty hunting\n- Takeover the whole sector\n- Take a walk inside a base. (Don't expect too much, you can have a look on your ship and go to the remote Terminal when owning the base)\n- Change between ships, Strategy Overview & First person whenever you like.\n- more\n\nWhat I like:\n- The total freedom, do what you want to do. Be a pirate, a merch, a warlord. Your choice\n- Modding -> There aren't many modders here yet, but it is possible to add own ships,factions,weapons&stations\n- The style - It is simple but it has its own charm. (And yes you can change the skybox to a more pretty one)\n- The roadmap says: ,,Storyline incoming, walking inside big ships & more)\n\nThere are games on Steam that have far less Content, but are far more expensive. I totally recommend this game. The Developer tries his best and has an ear for the Community.\n\nThis is an alpha, there is much more to come, but even in its current state, you can enjoy it for at least 20+ hours. (It's a Sandbox, so it also depends on your own creativity)", "timestamp_created": 1503582564, "timestamp_updated": 1503582976, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.634087", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34200843": {"recommendationid": "34200843", "author": {"steamid": "76561198006977426", "num_games_owned": 302, "num_reviews": 64, "playtime_forever": 700, "playtime_last_two_weeks": 0, "last_played": 1502794358}, "language": "french", "review": "Bonjour j y capte rien mais au finale le jeu permet de crer son empire le must c est le dev qui pond des mise à jour aussi souvent que j vais aux chiotte , et au finale cela on adore voire évoluer ce jeu , en ce moment ce st la mise à jour pour les flottes , indispensable selon moi !.\nCar déjà l on peut faire des stations , miner , exterminer , déclarer la guerre ce ts un sandbox aussi donc seul limite notre imagination , mais aussi ceut que le jeu encore en développement permet de faire à son niveau.\n\nVous rever de conquerir des territoires , de construire une flotte qui faira peur à vos ennemis  ben l option d achat de conviendra!", "timestamp_created": 1502575359, "timestamp_updated": 1502575359, "voted_up": true, "votes_up": 1, "votes_funny": 3, "weighted_vote_score": "0.531250", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34114080": {"recommendationid": "34114080", "author": {"steamid": "76561198104537315", "num_games_owned": 79, "num_reviews": 33, "playtime_forever": 1684, "playtime_last_two_weeks": 0, "last_played": 1506739579}, "language": "english", "review": "Alright, but needs work.\n\nGreat for a single dev team.\nIf I could suggest one thing, its make fleet management a bit more tidy.\nNot much else other than stuff already planned.\n\nOnly really big complaint is frequent crashes.", "timestamp_created": 1502234759, "timestamp_updated": 1506645717, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1502238696, "developer_response": "In case you missed it here is where you can find updates to the game (each date entry is a patch) :\n\nhttp://steamcommunity.com/app/369530/discussions/4/358415738185478845/ \n\n\nMore substancial updates are located here with more detailed write ups - http://steamcommunity.com/games/369530/announcements/\n\nSome recent updates include - creation of player fleets, remote management of assets, blocade mechanics and more."}, "34074711": {"recommendationid": "34074711", "author": {"steamid": "76561197976249852", "num_games_owned": 317, "num_reviews": 4, "playtime_forever": 3361, "playtime_last_two_weeks": 0, "last_played": 1509893045}, "language": "english", "review": "This game is everything i wanted from every other space sim game,\nIn short what i want is\nYou start small and incredebly weak\nWork your way up to become an immortal Space Emporer that dominates the universe\n\nI would kiss the develpor if i ever met him *no homo*, cause i*ve been looking for a space game exacly like this ever since i was introduced to the genre several years ago.\n\nThe game does have a steep learning curve which might be aliviated during develpoment. But i love paradox games *not their dlc policy mind you* so i don*t mind. \n\n\nAnother thing, the graphics arent that great compared to say most modern games or AAA Titles, but it has a nice timeless look and if i can stand the graphics in older paradox games, then i can enjoy them in this game.", "timestamp_created": 1502081172, "timestamp_updated": 1502081172, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.493421", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34025920": {"recommendationid": "34025920", "author": {"steamid": "76561198025477688", "num_games_owned": 774, "num_reviews": 4, "playtime_forever": 1402, "playtime_last_two_weeks": 0, "last_played": 1485796414}, "language": "english", "review": "Awesome game by an awesome dev. Very regular updates, and he responds to the community regularly.", "timestamp_created": 1501888013, "timestamp_updated": 1501888013, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.515811", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34017473": {"recommendationid": "34017473", "author": {"steamid": "76561197981805332", "num_games_owned": 125, "num_reviews": 6, "playtime_forever": 2986, "playtime_last_two_weeks": 0, "last_played": 1514179259}, "language": "english", "review": "Void Destroyer 2 is a great work in progress of a sandbox combat oriented space sim. Despite being early access, the game is very playable, polished and most of all FUN. There is still alot of content and features planned, such as larger ships and more overworld sandbox events. \n\nPros-\n-Great flight model and dogfighting is fast paced and action packed\n- Many different ships to choose from, with different stats... from light fighter up to Frigate (more is planned)\n- Ability to form fleets and have AI ships work for you, despite being single player your never truely \"alone\"\n- Overworld sandbox mode similar to mount and blade\n- Many Scripted missions to partake in\n- Can switch to tactical mode and order your ships RTS style, while also dogfighting in your primary ship. Makes managing large battles easy.\n\nCons\n- Needs more content and depth, ie larger ships are not yet implemented.\n\nThis is as one man show, one developer working his tail off to make a great game. Overall I am extremely happy with my purchase and highly recommend to anyone who wants a more combat oriented space sim. Even if you don't buy it, it is a gem to keep your eye on as it moves through early access toward launch.", "timestamp_created": 1501858360, "timestamp_updated": 1501858360, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33842155": {"recommendationid": "33842155", "author": {"steamid": "76561198304504085", "num_games_owned": 195, "num_reviews": 69, "playtime_forever": 2040, "playtime_last_two_weeks": 0, "last_played": 1501478046}, "language": "schinese", "review": "简要介绍：\n\n这款游戏可以看成是结合了RTS和RPG要素的空战模拟，一开始玩家只有一艘小小的船，没有强大的火力和装甲。\n\n此时这款游戏仅仅是一款空战模拟，玩家只能做些小小的护送运输任务，混在赏金猎人的队伍里蹭一些赏金，挣一些小钱。玩家只是个微不足道的存在。\n\n但随着钱越来越多，玩家可以升级自己的船，买更强大的战舰，更多的战舰，从零开始组织起自己的庞大舰队，购买货轮跑商（跑商是电脑能够自动帮你完成的），购买矿船挖矿（也能够由电脑自动帮你进行）\n\n（关于舰队，玩家在战斗中虽然同一时刻只能亲自控制一艘船，但是是可以按 Enter 然后选择其他自己舰队里的船进行控制的）\n\n一旦开始了跑商，整个游戏就都顺畅了起来。这是个利滚利的过程，只要有了第1艘货轮，很快就能有第2艘，然后就是第4艘，第8艘，第16艘，第32艘，64艘。\n\n不缺钱以后舰队也就自然而然起来了。\n后期甚至还能打下一整个被严密防守的空间站作为自己的基地。\n\n你的一声令下就能够瞬间决定整个空间站的存亡，这个过程甚至不需要你去亲自动手。\n\n所以嘛，从某种程度上来讲，这个游戏也能算是养成类，是个从一艘小船进化到一个庞大的太空军事/经济帝国的过程。\n\n而这个过程是令人无比享受的。\n\nPS：导弹太IMBA xD\n\nPSS：游戏体验就不多说了，除了崩溃之外，其他的UI设计和手感之类都中规中矩。瞄准时的手感稍微有待提高，不过我相信这游戏的操作手感在同类游戏中已经算是很优秀的了。\n\n--------------------------------------------------------------\n--------------------------------------------------------------\n\n[strike]挺不错的游戏，就是这个操作的惯性让人有点崩溃……[/strike]\n\n--------------------------------------------------------------\n\n[strike]THE DAMN CRASH[/strike]\n\n停靠 -> 崩溃\nDock -> Crash\n\n--------------------------------------------------------------\n\n[strike]well, the damn crash[/strike]\n\n按下 Shift+Enter -> 崩溃\nShift + Enter -> Crash\n\n--------------------------------------------------------------\n\n我真的想喜欢上这个游戏，但是这款游戏的游戏体验实在是太糟糕了\n它又崩溃了\nI want to love this game\nBut the experience is just shitty\nIt crashed again\n\nShift + Enter -> 无响应\nShift + Enter -> No Response\n（我的整个操作系统都死掉了，我只能按 Ctrl + Alt + Delete 按后点关机）\n(my entire OS was dead, I could only press 'Ctrl + Alt + Delete' and click 'shutdown')\n\n--------------------------------------------------------------\n\n当我在玩一个空间站保护任务的时候，游戏不停崩溃\nKeep crashing when playing a base defending mission\n\n--------------------------------------------------------------\n\n距离上一次更新这个评论已经过了好几天（我对这游戏的态度一直在正正负负之间摆来摆去= =），最后我决定把评价改成好评。\nFinally I decided to change the opinion to 'positive' after several days from my last update to this comment.\n\n尽管这个游戏一直在崩溃，但我非常喜欢他的概念。\nAlthough this game has a lot of crash, it's concept is still touching me.\n\n希望这款游戏能变得更好 :-)\nwish this game could be better :-)", "timestamp_created": 1501192348, "timestamp_updated": 1502595671, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.626437", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1501253452, "developer_response": "Hi - sorry to hear about the issue.\n\nThe best place to post about crashes is the \"bug/support\" forum - http://steamcommunity.com/app/369530/discussions/6/\n\nIf you could post what is happening - with as much detail as possible - maybe we could solve the issue - so that it doesn't happy for you and potentially other players.\n\nThe game is continually updated and Early Access is a great time to get as many issues resolved as possible - soI hope you'll take the time to post on the Bug/Support forum and we'll get this issue sorted out.\n"}, "33825195": {"recommendationid": "33825195", "author": {"steamid": "76561198302918111", "num_games_owned": 52, "num_reviews": 2, "playtime_forever": 466, "playtime_last_two_weeks": 0, "last_played": 1501200663}, "language": "english", "review": "Well, after a 4-hour binge I can give first impressions.\nRunning slightly  under recommended specs, the game has run flawlessy on max settings. Barely any stutter, and no glitches. Of course I havn't run into any bazillion ship battles yet, but fingers crossed.\nSimply, it's fun. The loop (atleast the early-game loop) is very rewarding, and it never seems to take too long to get up to a more powerful ship. The combat is great once you get used to the controls (which may take a lil time, but aye); and these same controls give you, well, much more control once you can use them.\nAlso, the dev is very active on both updates and support, which is always a major plus and a very good sign. \nSimply put, go for it. I've paid 60 bucks a pop for many games that I can't have a session over 2 hours in. For 15, this is highly worth it.", "timestamp_created": 1501135748, "timestamp_updated": 1501135792, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.519795", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33735107": {"recommendationid": "33735107", "author": {"steamid": "76561198028096440", "num_games_owned": 285, "num_reviews": 42, "playtime_forever": 1190, "playtime_last_two_weeks": 0, "last_played": 1500703076}, "language": "english", "review": "I play a lot of space games, from Space Engineers, to Elite Dangerous. And this game combines elements from those games into this one. Both SE and ED have freedom and this game has lots of freedom to do what you want. I also love Mount and Blade. And this game is Mount and Blade in space or the \"Void\" if you must. \n\nI can see this game becoming something greater than what it already is! It is fantastic. For a game in Early access this has a nice amount of content! Lots of ships. And to hear that more ships are going to be added, just makes me so happy! The Dev is a really nice guy, I posted an issue and he went out of his way to test it to see if there is a fix for the issue I had. Having that community and Dev interaction is really amazing. And shows dedication!\n\nFantastic work, I really am excited for the future of Void Destoryer 2!\n\nEasily a 8/10 has a few issues, but knowing this game is still in development with this amount of content is very reassuring!", "timestamp_created": 1500779772, "timestamp_updated": 1500779772, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.536460", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33571627": {"recommendationid": "33571627", "author": {"steamid": "76561198245646840", "num_games_owned": 89, "num_reviews": 17, "playtime_forever": 124, "playtime_last_two_weeks": 0, "last_played": 1510972919}, "language": "english", "review": "I'm very confuzzled on how to play this game to many controls\nIt's frying my brain", "timestamp_created": 1500158998, "timestamp_updated": 1500158998, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.511492", "comment_count": "7", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1500170776, "developer_response": "Feel free to replay the intro of the game several times - also when docked there are additional tutorials you can play via the simulator (again feel free to replay them multiple times).\n\nThere's a vid talking about control basics - https://www.youtube.com/watch?v=ZSz6WP90BDI\n\nAnd finally there's a printable key map on the store page - http://cdn.edgecast.steamstatic.com/steam/apps/369530/manuals/VoidDestroyer2-KeyMapping.pdf?t=1492393683\n\nHope this helps! If not be sure to ask questions on the forums/etc."}, "33450394": {"recommendationid": "33450394", "author": {"steamid": "76561198034922454", "num_games_owned": 88, "num_reviews": 4, "playtime_forever": 362, "playtime_last_two_weeks": 40, "last_played": 1515999232}, "language": "english", "review": "This game reminds me at first of a very old game called Independence War. Not a bad thing, I never got to play the whole game, I only vaguely remember it from a demo. I would like to get into this game, but I just can't. I'm not willing to fght the controls. I want to like this game but at the moment I can't recommend it.\n\nThis game has the least responsive controls of any game I've ever played. This has to be addressed. I refuse to learn how to steer a spaceship while reading 2 full seconds into the future. That's not what this game is about. And it's not my video card either, you can't even navigate the menus without lag. Ever watched curling in the olympics? It's like that, but with your mouse. Once this issue is addressed I feel this game has pontential, until then I'm out.", "timestamp_created": 1499760438, "timestamp_updated": 1499760438, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.360518", "comment_count": "7", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1499871499, "developer_response": "The best place to post about issues is the bug/support forum - otherwise addressing issues becomes cumbersome in the recommended/review section. \n\nFrom the review - I don't fully understand what your issue is - but if there is lag in the menus that sounds like a performance issue. There's various factors which might be at fault here so a back and forth dialog is needed to understand and try to fix the issue.\n\nIf you have a video card the most likely issue is the game chosing the intel graphics chip instead of a dedicated video card and try to run off that - causing lag.\n\nIf you want this issue addressed please post in the bug/support forum - or at least browse some sticked posts like these two - \n\nhttp://steamcommunity.com/app/369530/discussions/6/350542145709912119/\n\nhttp://steamcommunity.com/app/369530/discussions/6/350542145709920651/\n\n"}, "33348893": {"recommendationid": "33348893", "author": {"steamid": "76561198045959512", "num_games_owned": 613, "num_reviews": 45, "playtime_forever": 34, "playtime_last_two_weeks": 0, "last_played": 1501348995}, "language": "schinese", "review": "真的很想玩啊，但是没有中文看不懂，汉化又挂了。。。。", "timestamp_created": 1499448005, "timestamp_updated": 1499448005, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33320349": {"recommendationid": "33320349", "author": {"steamid": "76561197985406901", "num_games_owned": 25, "num_reviews": 1, "playtime_forever": 1108, "playtime_last_two_weeks": 0, "last_played": 1499680052}, "language": "english", "review": "A very good game. If u like x3 u might like this too.", "timestamp_created": 1499366373, "timestamp_updated": 1499366373, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.527807", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33054617": {"recommendationid": "33054617", "author": {"steamid": "76561197990378677", "num_games_owned": 531, "num_reviews": 38, "playtime_forever": 2256, "playtime_last_two_weeks": 0, "last_played": 1512257341}, "language": "english", "review": "Mount and Blade: Total War in space. \n\nIf that doesn't sell you then I don't know what will.", "timestamp_created": 1498854611, "timestamp_updated": 1498854611, "voted_up": true, "votes_up": 28, "votes_funny": 4, "weighted_vote_score": "0.753169", "comment_count": "7", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33048587": {"recommendationid": "33048587", "author": {"steamid": "76561198045777986", "num_games_owned": 349, "num_reviews": 29, "playtime_forever": 1997, "playtime_last_two_weeks": 0, "last_played": 1506552847}, "language": "english", "review": "This is a lot of game for the value.That's in its current state of Early Access. When completed, this is going to be a must-have for anyone who loves space games. The steep learning curve on the controls was the only trouble the game has given me so far.", "timestamp_created": 1498844764, "timestamp_updated": 1498844865, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.498227", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33046526": {"recommendationid": "33046526", "author": {"steamid": "76561198011572485", "num_games_owned": 116, "num_reviews": 2, "playtime_forever": 2454, "playtime_last_two_weeks": 0, "last_played": 1509892914}, "language": "english", "review": "Many games boast about a \"truly living world\" despite the player not being able to see any of it. Where Void Destroyer 2 stands out against all these games is its inclusion of the Overworld. You can actually watch ships travel from one location of the map, pick up cargo, then transport it to another location. Not only that, but you can also watch as they may become intercepted by pirates. And, if you choose, join in the battle and help the ship out.\n\nAnother great feature of Void Destroyer 2 is the way it controls. Plenty of space games offer six degrees of freedom and Newtonian physics, but in most games it serves as a burden on the player. Here, all of the ships have adequate forward and breaking thrust, making it so that most of the time you won't slam into somethings unless you're moving far beyong the intended speed limit of your ship (which is nicely bound to a single keypress). \n\nBeing in Early Access, I hope that later down the line more activities will be added as profitable playstyles, with others receiving refinements. While this game is combat focused, the living world means that a player can take on any role they so choose, from civilian trader to black market smuggler, bounty hunter to cargo stealing pirate, and debris cleaner to high speed racer.", "timestamp_created": 1498841575, "timestamp_updated": 1498841575, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.546066", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32876281": {"recommendationid": "32876281", "author": {"steamid": "76561198032666232", "num_games_owned": 475, "num_reviews": 11, "playtime_forever": 1239, "playtime_last_two_weeks": 0, "last_played": 1509852173}, "language": "norwegian", "review": "Quite a good little game this, loads quick, runs well and it tok 14 hours of play before i encountered a problem. which was a crash to desktop after leaving a station. Best EA experiance i have had to date.\n\nAt this stage it's pretty much an x3'light sandbox where you trade, mine or fight for money to afford better ships.\nYou build up a fleet and separate ships from the fleet to patrol an area, mine or trade automaticly by right clicking a target, but the control of ships not currently in the fleet you are zipping around with is quite clunky atm, i would like more options and easier managment of owned assets.\n\nFying around is done in a tactical overview like the map movment in Mount&Blade, with the gamespeed turned up so you don't spend  much time getting from one base to the next, i really like this as i've always felt commuting in games to be a waste of  time, you can still fly around stations and explore asteroid fields, but you don't have to play space bus just to check out the ships available on another station.\n\nThere is no story arc yet  and little mission variation but if you've played x3 or similar games you're probably used to making your own fun and spending time trying to find out what you can and cannot do in the game. So far i've only tried out the combat, automated mining and patroling/securing areas from pirates. i expect auto trading/passenger transport functions much the same way so there are several ways to earn the cash needed to upgrade ships and safeguard your assets.\n\nI am looking forward to seeing more content as i can see myself playing this for a long time.", "timestamp_created": 1498589299, "timestamp_updated": 1509411783, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32853467": {"recommendationid": "32853467", "author": {"steamid": "76561197987533604", "num_games_owned": 81, "num_reviews": 2, "playtime_forever": 2638, "playtime_last_two_weeks": 0, "last_played": 1509970803}, "language": "english", "review": "The Void Destroyer Games represents everything that the gaming industry should aspire to be (Listen up EA & No Man's Sky!)\n\nCreated by a single developer, I feel this game has the potential to be one of the best Space-Sandbox games on the Indie market. It combines the action and combat of a flight simulator with the overhead tactical controls of an RTS and it works so well!\n\nYou start off with a single shuttle that's as weak as a vegans piss sample. From there you earn credits by completing contracts, making allies, establishing mining operations and forging trade routes.\nYou can reinvest your profits into bigger and better ships and even build up fleets to defend your mining/trading operations.\n\nOr, if you fancy a more illegal method of profit, try some piracy! Harrass trade convoys whilst evading the Navy. Extort defenceless civilians and make an infamous name for yourself.\n\nThe latest update to appear at the time of this review has introduced an excellent Space Station capture/management system. This allows you to perform large-scale assaults on enemy stations and sieze them for yourself. Once under your control you are able to build your own ships and tighten your grip on the flow of raw materials into your station.\n\nVoid Destroyer 2 is the perfect continuation from an already amazing game.\nWhilst the flight controls are difficult and can be offputting to new players, I highly recomend that you give this game your time and patience.\n\nI personally look forward to many more updates and the return of the outsiders!", "timestamp_created": 1498567011, "timestamp_updated": 1498567011, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.611812", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32791669": {"recommendationid": "32791669", "author": {"steamid": "76561198083493566", "num_games_owned": 205, "num_reviews": 2, "playtime_forever": 1352, "playtime_last_two_weeks": 0, "last_played": 1498702947}, "language": "english", "review": "Pros:\nFun and rewarding basic gameplay loop- run missions, get better ships\nCombat is fun and engaging\nLots of ship hulls to choose from\nBuilt a massive fleet and steamroll everything you run into\nRTS mode to control your fleet\n\nCons:\nFor some reason it doesn't take raw mouse input, although I got used to it quickly\nFTL navigation is kinda wonky, it can be hard to select things and give commands effectively\nRTS mode is difficult to use, ships don't reliably respond to commands, camera controls are either way to sensitive or way too slow\n\nSummary- Game is fun and the broken/wierd bits don't detract from the core gameplay", "timestamp_created": 1498430532, "timestamp_updated": 1498430532, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32671237": {"recommendationid": "32671237", "author": {"steamid": "76561198050479118", "num_games_owned": 179, "num_reviews": 11, "playtime_forever": 569, "playtime_last_two_weeks": 0, "last_played": 1498292453}, "language": "english", "review": "this puts no mans sky to shame. A SINGLE PERSON MADE THIS!!! no mans sky had a whole fucking team and messed up. whats even better is that i have never seen such an active dev, hes very active responds to a lage majority of feedback and posts idepth dev log vids on his yt channel, it may be early access but so far its money well spent.", "timestamp_created": 1498207026, "timestamp_updated": 1498207026, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.436047", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32653112": {"recommendationid": "32653112", "author": {"steamid": "76561198001241745", "num_games_owned": 224, "num_reviews": 33, "playtime_forever": 3216, "playtime_last_two_weeks": 0, "last_played": 1512423583}, "language": "english", "review": "Had to fight the controls for the first few hours, then get infuriated by a glitch or two (couldn't get into the space station... no clipped inside and was stuck), but NOW I'm in the promise-land: doing raids, buying transports to make me money (and escort-fleets to make sure they get there safe), building my personal fleet... this game is very fun and addicting. Rewards the player. *Edit* : I've managed to mine up a ton of money and have a fleet so big that my computer just lags down in any fight (I think the game is meant for smaller scale fights right now, rather than 200+ fleets). Once the game gets larger ships, more customization (for bases, platforms, ship guns perhaps), it will be epic. Pretty fun as it is right now, but you can become really strong pretty fast and soon be unstoppable... needs more late game diversity and challenge I think. This is like a 3D reassembly sort of, in the sense that you have a really cool (and smart) AI fleet behind you and you take over the galaxy. Still recommended, but I'd say wait a bit, for 15$ as of 6/24/17 isn't really worth it just yet.", "timestamp_created": 1498168089, "timestamp_updated": 1498344590, "voted_up": true, "votes_up": 43, "votes_funny": 2, "weighted_vote_score": "0.773379", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32582197": {"recommendationid": "32582197", "author": {"steamid": "76561198066015235", "num_games_owned": 114, "num_reviews": 3, "playtime_forever": 4711, "playtime_last_two_weeks": 0, "last_played": 1515294674}, "language": "english", "review": "An awesome space sim that is coming along very nicely.", "timestamp_created": 1497927871, "timestamp_updated": 1497927871, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.453390", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32492470": {"recommendationid": "32492470", "author": {"steamid": "76561198172751559", "num_games_owned": 49, "num_reviews": 5, "playtime_forever": 4081, "playtime_last_two_weeks": 0, "last_played": 1504490677}, "language": "english", "review": "it is good in a pre release state.", "timestamp_created": 1497668703, "timestamp_updated": 1497668703, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.476892", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32327091": {"recommendationid": "32327091", "author": {"steamid": "76561198165708451", "num_games_owned": 40, "num_reviews": 3, "playtime_forever": 9076, "playtime_last_two_weeks": 0, "last_played": 1514160655}, "language": "english", "review": "Finally, a space pilot / fleet / base game. As of June 10th 2017 this game is still in early access, but still worth your time in my mind. There are some improvements need in the UI, mostly to do with ship selection, but I still love this game. I have a bit over a 150 hours as of now. If you like piloting, building fleets, and taking bases I am going to bet you will like this game.", "timestamp_created": 1497127194, "timestamp_updated": 1497127194, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.513598", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32281710": {"recommendationid": "32281710", "author": {"steamid": "76561198195726357", "num_games_owned": 55, "num_reviews": 3, "playtime_forever": 3142, "playtime_last_two_weeks": 0, "last_played": 1506050169}, "language": "english", "review": "Overall the game is incredible! Content is added often, and what it currently has already keeps me addicted. Honestly the only reason i'm writing this now is because my computer crashed so i had to stop playing for a minute. But in all seriousness the sense of progression, the gameplay, the options you get to choose from... It all ties into a game that is addicting and incredibly enjoyable! Oh! And the game is still in development yet has immense content! If there's anything to point out it's that. Incredibly fun, massive, and it's not even complete yet :P", "timestamp_created": 1496976780, "timestamp_updated": 1496976780, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.513598", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32259064": {"recommendationid": "32259064", "author": {"steamid": "76561198007580623", "num_games_owned": 125, "num_reviews": 2, "playtime_forever": 3798, "playtime_last_two_weeks": 0, "last_played": 1513668169}, "language": "english", "review": "Fun game of corse like all early games bugs are fast to show themselves, but the dev is very fast to reply to any issue or bug makeing it worth the time. All together fun space sim.", "timestamp_created": 1496883958, "timestamp_updated": 1496883958, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.489775", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31991691": {"recommendationid": "31991691", "author": {"steamid": "76561198353090746", "num_games_owned": 186, "num_reviews": 2, "playtime_forever": 343, "playtime_last_two_weeks": 13, "last_played": 1516092479}, "language": "english", "review": "Having backed the original void destroyer when it was in early access I have full faith in this game being the singleplayer open world space game I've needed in my life. The core gameplay mechanics from the original game are solid and the dev is near-obsessive with his replies to comments and input in the game. The only possible downside I could see for some people might be the art style, which may grate on some. That being said, it's absolutely worth a buy, especially for 15 bucks.", "timestamp_created": 1495874620, "timestamp_updated": 1495874620, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.489775", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31964195": {"recommendationid": "31964195", "author": {"steamid": "76561198089684416", "num_games_owned": 123, "num_reviews": 8, "playtime_forever": 192, "playtime_last_two_weeks": 0, "last_played": 1493354136}, "language": "english", "review": "essintially mount and blade in space and it's only getting better.", "timestamp_created": 1495768292, "timestamp_updated": 1495768292, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.508282", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31957136": {"recommendationid": "31957136", "author": {"steamid": "76561197970283122", "num_games_owned": 273, "num_reviews": 13, "playtime_forever": 1978, "playtime_last_two_weeks": 0, "last_played": 1497926342}, "language": "german", "review": "Selbst jetzt im alpha zustand  ist void destroyer 2 ein fun game . wer x3 mag oder große flotten komandieren will ist hier genau richtig , nur wer ein kompletes spiel erwartet solte besser erst warten bis der release kommt . wie gesagt  es ist noch alpha (zum zeitpunkt der review) aka: \n[list]\n[*]Die map ist zwar bevölkert aber noch recht klein ( kleiner bereich  der map hat stationen der größte teil ist leer) und es gibt nur eine Map (System) soweit ich das bis jetzt gesehn hab. \n[*]Das fraktionen system ist noch sehr basic.\n[*]Der handel noch recht statisch. \n[*]Die KI ist noch .... naja dumm.\n[*]Missionen sind zur zeit noch größtenteils standart  geh da hin und kill  x, oder begleite  x von a nach b\n[/list]\n[b][u] Das alles soll sich noch in die eine oder andere weise ändern bis zum voll release. [/b][/u]", "timestamp_created": 1495736814, "timestamp_updated": 1495736814, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.525118", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31862022": {"recommendationid": "31862022", "author": {"steamid": "76561197990770597", "num_games_owned": 246, "num_reviews": 4, "playtime_forever": 2606, "playtime_last_two_weeks": 0, "last_played": 1502864434}, "language": "english", "review": "34 hours in, while it's not nearly ready to be released. If the game continue to progress it would be one of the best games of it's genre available on market right now.\n\nIt's not X3, of course, but from all space games that got into market past couple of years I enjoyed this one most!\n\n\nAnd a side note - Blue skybox can be disabled! Lot of people won't buy the game because of \"unrealistic\" space. It can be disabled in game.", "timestamp_created": 1495291287, "timestamp_updated": 1495291287, "voted_up": true, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.703743", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31772849": {"recommendationid": "31772849", "author": {"steamid": "76561198172367398", "num_games_owned": 66, "num_reviews": 11, "playtime_forever": 121, "playtime_last_two_weeks": 0, "last_played": 1494792924}, "language": "english", "review": "Nice but Hard", "timestamp_created": 1494868577, "timestamp_updated": 1494868577, "voted_up": true, "votes_up": 1, "votes_funny": 2, "weighted_vote_score": "0.434714", "comment_count": 0, "steam_purchase": true, "received_for_free": true, "written_during_early_access": true, "timestamp_dev_responded": 1495025628, "developer_response": "Thanks for the review - if you are having issues with the game's difficulty or have any questions - be sure to post on the forums and we'll take it from there. \n\nThere's various ways of controling the game's difficulty - from taking easier missions - upgrading your ship and using the powerful active abilities - to hiring ships to help out - or building up your own mega fleet - so chances are I could help out with a tip or two."}, "31595938": {"recommendationid": "31595938", "author": {"steamid": "76561198052648564", "num_games_owned": 179, "num_reviews": 14, "playtime_forever": 109, "playtime_last_two_weeks": 0, "last_played": 1499382497}, "language": "english", "review": "The gameplay is way to boring missions are boring as hell and the ships purchase option is small everything in this game is really unpolished i don't recommend at this time  to buy this game", "timestamp_created": 1494131439, "timestamp_updated": 1497472619, "voted_up": false, "votes_up": 1, "votes_funny": 3, "weighted_vote_score": "0.229415", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31533319": {"recommendationid": "31533319", "author": {"steamid": "76561198040644553", "num_games_owned": 130, "num_reviews": 73, "playtime_forever": 258, "playtime_last_two_weeks": 0, "last_played": 1500228715}, "language": "brazilian", "review": "The game is unplayable using a joystick/hotas. The control of you ship became too sensitive and do not respond correctly to your moviments.Only works well with a mouse.\n\nÉ dificil avaliar este jogo. Ele não é um space game ruim. É apenas simplista. tem todos os principais ingredientes dos jogos espaciais, cockpíts simples, diferentes naves, upgrades, trade, combate,etc...mas tudo de forma simplificada como quando voce doca com estações por exemplo, aonde voce vai até a entrada dela, e simplesmente ve uma enorme parede na sua frente e ai voce \"doca\" dando de cara com ela quando muda a imagem para uma tela com opções internas das estações;\n\nAlem disso a viagem entre os lugares é feita através de um modo RTS visto \"por cima\" e a transição entre o modo normal e este RTS sempre demora um pouco e isso atrapalha ou melhor dizendo quebra o encanto. Alem de o posicionamente nesse modo RTS ser impreciso, voce posiciona em um local e nunca sai proximo aonde voce exatamente gostaria, ai é preciso entrar de novo no modo RTS e ajustar.\n\nPosto o acima, o jogo tem seus encantos, mas o que mais me deixou triste com ele para negativa-lo é que o jogo é bom jogando com teclado e mouse. Usando o Hotas fica uma porcaria o controle e pra mim jogos de nave tem de ser com flight joystick.\n\nEnfim é early access.", "timestamp_created": 1493857603, "timestamp_updated": 1500225190, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.501969", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1506107010, "developer_response": "I've put in two patches to address \"joystick sensitivity\" issues -\n\nOne a keybind that cuts ship's maneuverability in half when held down.\n\nExample:\n\nJoystick is moved 50% away from deadzone - ship maneuverability is 25% of max (would normally be 50% of max).\n\nTwo an alternate \"joystick sensitivity\" mode that reduces maneuverability the closer the joystick is to the deadzone \n\nExample:\nJoystick is moved 10% away from deadzone - ship maneuverability is cut by 90%. Joystick is moved 25% away from deadzone - ship maneuverability is cut by 75%.\n\n--\n\nThe normal mode is - ship turns at the speed calculated by the player's joystick movement away from deadzone and ship's turn speed."}, "31489223": {"recommendationid": "31489223", "author": {"steamid": "76561198026993769", "num_games_owned": 324, "num_reviews": 5, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1493652138}, "language": "english", "review": "Runs like hot garbage. I can run Fallout 4 and get 60fps on this machine. I got about 12 in this game when I first booted it up. What's really fun is that the mouse is tied to the framerate, so there was an unbearable input delay, even in the menu. Game seemed fun though, so I updated my graphics drivers, lowered the graphics settings as much as I could, even lowering the resolution to a borderline unplayable setting, rebooted my computer and tried again.\n\nOoh, no lag in the menu! I fixed it! I can play! Let me just click New Game and...15fps.\n\nSeems like a great game. Bummed I can't run it. Glad Steam gives refunds. Sorry game dev.", "timestamp_created": 1493652675, "timestamp_updated": 1493652675, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.249844", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1501770518, "developer_response": "-- Update --\n\nHere's also some threads related to performance issues -\n\nMouse Lag -\n http://steamcommunity.com/app/369530/discussions/6/1471967615840163606/\n\nLow frame rates despite good hardware - \nhttp://steamcommunity.com/app/369530/discussions/7/1471967529575484167/\n\n-- End Update --\n\nThe game should run very nicely on reletively recent hardware (2-ish years) - but requires a video card (not intel graphics chip). Intel graphics chips are listed as not recommended on the store page.\n\nIn case you do have a graphics card - there is sometimes an issue where the wrong card is chosen in case you have multiples (like an intel graphics chip) - and performance is bad until the proper card is used.\n\nBased on your Fallout 4 runs well statement - this is my guess to what is happening.\n\nIssues related to intel graphics chips are discussed here - http://steamcommunity.com/app/369530/discussions/6/350542145709912119/\n\nI'm also thankful for the refund system - so I guess the above info is more for a future person - and if anyone has further questions/support issues the best place is to post on the support forum - thanks!\n"}, "31448542": {"recommendationid": "31448542", "author": {"steamid": "76561198050587369", "num_games_owned": 107, "num_reviews": 3, "playtime_forever": 8350, "playtime_last_two_weeks": 0, "last_played": 1513189968}, "language": "english", "review": "First and Only review to anything. So here is what the game is and about.\nVoid destroyers 2 is an Early Access, Indie, Strategy, Sci-fi Space Sim. Its always nice to start off with pretty much nothing and working your way up into something powerful or a fleet of something powerful. For Void destroyers 2, it does just that. To becoming something powerful you will be needing money, and reputation. Money is the big part, but reputation gives you access to buying bigger ships of different factions. \nThere are 6 factions of which reputations can be earned from or loosed from: The MU, The reborn (Pirates), TSF (military), Civilians, pirates, the Bounty hunter, and the Black market. \n\nEach faction has:\n•\tTheir bases scattered around the map. \n•\tTheir own types of ships they sell. Except for the pirates, they got 2 separate pirate factions and ships. As well as the Black market, since they sell some of the illegal ships there). \n•\tAn economy. Which you can trade resources with.\n•\tEach ship is unique in their own way.\n•\tEnemy’s\n•\tDifferent Missions (also except for black market).\n\nEarning Money:\nThere are different ways to earn money, by mining or commanding Mining ships to mine for you, destroying ships with bounties on them, buying then selling cargo or selling stolen cargo at bases, if you got your own base you can sell what is being produced, doing missions, etc.\n\nBounties:\nIf not from doing missions and mining, trading or capturing a ship then selling it. You can destroy and earn money off of destroying ships.\nThere are 3 different factions you can take bounty’s off of without the use of a mission. Destroying the Bounty hunters and Military ships if your going through the pirate role or just the pirates if you stay with the civilians and bounty hunters. The bigger they are the bigger the reward. As well you can’t “kill steal” you would have to gang the ship with your fleet or destroy it by your self.\nA Cheeky and obvious move is to wait near a military repair station (not a civilian or you wont get anything out of it) and to destroy or capture big military ships.\nBounties can also lead to getting an bounty/Wanted on you, where the military and the bounty hunters will come after you. Having a wanted score if you haven’t attack any pirates will allow you to buy a ship from their base and take their mission. \n\nFaction Ships:\nThe MU has the ships infused with asteroids. a few the bigger ships are just the ship as a gun.\nThe Reborn Has ships with big cannons. As well as their own capture ship and capture bases ships and a carrier. \nThe Civilians are not helpless. They are the only faction besides the black market that sells mining ships.\nThe Military are deadly. Currently you can only buy two vehicles there, because its the military.\nThe bounty hunters, just have ships that where made to kill every type of ship.\nThe Black Market currently have no missions but randomly have different illegal ships for sale, from every faction. Like civilian capture bases ships, big military ships. But not all ships, they won’t have the really big ones like the Priam from the bounty hunters, etc.\nThere are many types of weapons from bullets to rocks, to missiles to lasers. There are nice unique weapons and secondary weapons. Weapons come from the ship you cannot for most change the weapons on that ship. \n\nUpgrading:\nAfter entering a base, you can upgrade it by adding a turret for curtains small ships (like starter ship). Or increasing the ammo and maneuverability. You can also add abilities like a shield to the front of your ship when activated, a repair, a big increase in forward thrust, etc. You can also change what space looks like.\n\nPlayer own bases:\nOther than taken over a base and selling what ever is produced, in the base you can use ore to reduce the cost of building a ship in the base. \n\nControls:\nAt first if you didn’t play Void Destroyers, it will feel weird. But if you are determined you can you can deal with it. Personally, I don’t like flying the hornet, too fast for me in turns of turning and looking to the left or right and passing where I wanted to look at.\n\nAll in all, I’ve been enjoying the game, and can’t wait to see every new thing that gets added.", "timestamp_created": 1493497545, "timestamp_updated": 1493497545, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.583239", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31409435": {"recommendationid": "31409435", "author": {"steamid": "76561198001443770", "num_games_owned": 123, "num_reviews": 15, "playtime_forever": 1355, "playtime_last_two_weeks": 0, "last_played": 1493792630}, "language": "english", "review": "Best there currently is.", "timestamp_created": 1493359180, "timestamp_updated": 1493359180, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.422031", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31405301": {"recommendationid": "31405301", "author": {"steamid": "76561198226982608", "num_games_owned": 40, "num_reviews": 2, "playtime_forever": 23, "playtime_last_two_weeks": 0, "last_played": 1493254927}, "language": "english", "review": "i think this is\n crap", "timestamp_created": 1493341020, "timestamp_updated": 1493341020, "voted_up": false, "votes_up": 5, "votes_funny": 4, "weighted_vote_score": "0.082886", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1494012158, "developer_response": "Sounds like you don't like the game - not sure when you bought it, but if it is within 2 weeks you can get a no-questions asked refund here - \nhttps://help.steampowered.com/en/ (also more info here - http://store.steampowered.com/steam_refunds/ )\n\nThe refund is also sometimes granted outside of the 2 weeks, so give it a try and I hope you can use the money to buy a game you like better."}, "31404172": {"recommendationid": "31404172", "author": {"steamid": "76561198067251264", "num_games_owned": 165, "num_reviews": 53, "playtime_forever": 1679, "playtime_last_two_weeks": 0, "last_played": 1502066462}, "language": "english", "review": "Yet another fantastic indy title by this one man game dev.\n\nA TL:DR of this game would be that its Mount and Blade in space.  It still has a few bugs, missing features and is in need of polish, but clearly the developer is clearly putting effort into the continued development of the game.\n\nVoid Destroyer 2 is a neat space RPG/RTS that can have you flying everything from the smallest fighters to massive corvettes in both first person and RTS modes.\n\nYou can expand your fleet to either aid you in combat, or gather resources for you.  EG: Mining ships will mine asteroids for you, trading ships will trade, ect.  Every ship is pilotable, and you can even hotswap between ships in combat.   (It's good to note that if your main ship dies, its still game over if you are flying a different ship.)\n\nAll in all, I am impressed with what is there right now, and looking forward to future updates.", "timestamp_created": 1493335727, "timestamp_updated": 1501718286, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.497836", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31401949": {"recommendationid": "31401949", "author": {"steamid": "76561197961358114", "num_games_owned": 96, "num_reviews": 1, "playtime_forever": 2194, "playtime_last_two_weeks": 0, "last_played": 1493752733}, "language": "english", "review": "VD2 is a fantastic space sandbox game. I highly recommend it to anyone who enjoyed X3, Elite Dangerous, Mount And Blade or Homeword. At the time of writing, it is far from complete but already a solid and enjoyable title. At $15 I found it a steal! I \"beat\" it in ~30 hours. More late-game content is planned.\n\nPROS:\n- Very well crafted combat system, smoothly going from dogfighting in a single tiny fighter to commanding enormous fleets into battle homeworld-style from a tactical view. Both styles and everything in between are very fun and rewards skills and thinking.\n- Large variety of things to do. Buy or build ships, customize themwith passive upgrades and abilities, mine asteroids and trade (or get AI ships you own to do it for you), do a huge number of varied missions, improve relationships with factions (unlocking perks like higher-tier ships, missions or auto-docking option), capture ships and bases and explore the game world.\n- Extremely friendly, mature and responsive dev. He's addressed my many bug reports and feedback promptly and gives me the feeling that this game is in very good hands.\n- Beatiful art and original ship/base designs\n- Fluid gameplay with lots of quality of life features. Huge amounts of keyboard shortcuts available. Ability to try out a ship (or upgrade) before investing your savings into it, lots of automation for trading/mining, time compression for fast travel and dilation for careful battle management, ability to create copies of a heavily customized ship when building a large fleet, etc.\n- Great sense of progression/achievement as you go from a tiny, weak fighter to a huge empire.\n- Low number of bugs for a space sandbox game (!)\n\nCONS:\n- The learning curve is fairly steep. Perhaps a bit lower than the X games, but expect to spend the first hour or two getting used to all the ways to interact with your ship(s) and the world.\n- Some of the interface for ship management needs polish when dealing with very large fleets (100+ ships)", "timestamp_created": 1493326466, "timestamp_updated": 1493326599, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.545179", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31172581": {"recommendationid": "31172581", "author": {"steamid": "76561197991911346", "num_games_owned": 78, "num_reviews": 7, "playtime_forever": 67, "playtime_last_two_weeks": 0, "last_played": 1489766244}, "language": "english", "review": "This ame is awesome very fun to play although I havn't had much time to play, I can't wait to play it again!", "timestamp_created": 1492327644, "timestamp_updated": 1492327644, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.497836", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "30848922": {"recommendationid": "30848922", "author": {"steamid": "76561198032236512", "num_games_owned": 90, "num_reviews": 1, "playtime_forever": 2263, "playtime_last_two_weeks": 0, "last_played": 1503064622}, "language": "english", "review": "Great game concept! I´ve truly enjoyed playing it. There are some rough edges here and there, but the dev is incredibly active and responsive. The final product will certainly put bigger space sims to shame.", "timestamp_created": 1490949029, "timestamp_updated": 1491220436, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.497836", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "30796557": {"recommendationid": "30796557", "author": {"steamid": "76561198034632338", "num_games_owned": 96, "num_reviews": 5, "playtime_forever": 3873, "playtime_last_two_weeks": 191, "last_played": 1515631031}, "language": "english", "review": "Very unique and interesting game. This is the kind of game I dream of. Still incomplete, but that means that it's going to get better! I wish Elite Dangerous was more like this game when it comes to gameplay. Can't wait to see where this goes. Also, apparently capable of being modded. Star Wars mod please. Get disney on the phone, have them give this guy some money to pump out this game but star wars themed. Nevertheless, very fun. I may still be in the honeymoon period with this game, but I'm 50 hours in at the time of writing. Comprehensive options menu for folks who care, fun for dogfighters, those who enjoy slugfests between fleets, or rts-style fleet tactics.\n", "timestamp_created": 1490718691, "timestamp_updated": 1490718691, "voted_up": true, "votes_up": 14, "votes_funny": 1, "weighted_vote_score": "0.606044", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "30756872": {"recommendationid": "30756872", "author": {"steamid": "76561198153200888", "num_games_owned": 59, "num_reviews": 9, "playtime_forever": 1877, "playtime_last_two_weeks": 1, "last_played": 1516249887}, "language": "english", "review": "A great game. Even thought you start only as just a simple fighter, as the game progresses, you can get bigger and better ships. The feeling of progression is very apparent in this game.", "timestamp_created": 1490550708, "timestamp_updated": 1490550708, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.516578", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "29847419": {"recommendationid": "29847419", "author": {"steamid": "76561198259896274", "num_games_owned": 59, "num_reviews": 13, "playtime_forever": 9547, "playtime_last_two_weeks": 0, "last_played": 1513691047}, "language": "english", "review": "Strange.\n\nIt takes like forever to make the starter ship to reach the speed of 1000, but it required only a few second to stop.\n\nWhich means that the forward thrusters are much, much more powerful than the backward thruster.\n\nBut it takes even longer to reach the spead of -1000.\n\nlol tell me if I'm wrong, but I think this doesn't make sense at all.", "timestamp_created": 1486819281, "timestamp_updated": 1486819281, "voted_up": true, "votes_up": 16, "votes_funny": 16, "weighted_vote_score": "0.579428", "comment_count": "10", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "29588380": {"recommendationid": "29588380", "author": {"steamid": "76561197964940882", "num_games_owned": 189, "num_reviews": 1, "playtime_forever": 3009, "playtime_last_two_weeks": 0, "last_played": 1505495070}, "language": "english", "review": "Absolutely love this game. It's challenging, it's addictive, and looking at the planned features it's shaping up to be in my top 5 space games. It feels like a cross between Freelancer and Homeworld, with a little of the X series games thrown in. The game lets you play either through a first person or top down RTS view, but the best result is achieved through using a bit of both. Control anything from a tiny fighter all the way up to a massive carrier. Build your own fleet, capture bases, destroy all who oppose you. \n\nBeing an early acces title there are obviously some issues with the game, friendly fire being one of the most annoying at the moment, especially when you have a lot of big ships defending a station, shots go astray and can hit allied ships. \n\nThe story elements aren't in the game yet, so it's really just a pure sandbox at the moment, if that bugs you you might want to wait until a little further into development.\n\nOverall highly reccommend this game, very fun and very addictive. The dev is also very friendly and active on the forums, answering questions and recieving feedback to improve the game.", "timestamp_created": 1485794518, "timestamp_updated": 1485794518, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.562927", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "29533428": {"recommendationid": "29533428", "author": {"steamid": "76561198053705207", "num_games_owned": 60, "num_reviews": 6, "playtime_forever": 2812, "playtime_last_two_weeks": 0, "last_played": 1508470492}, "language": "english", "review": "Changed this review from a negative to a positive.  VD2 is a deep game, with a lot of options.  The developer is active and is taking the game in the right direction.\n\nThe recent updates made to this game has made it extremely fun to work your way up the ranks up to a large fleet, even your own starbase.  You can be a merchant or a miner, or even a pirate.  Take over ships and bases, claim them for yourself, or simply roll in there and blow the whole thing up.  The option is yours, and the UI has been greatly improved, options added, the ability to control and maintain assets, I would say this game is nearly complete.\n\nAs it stands, very awesome game.  I definitely recommend it.  Great work, chaosavy", "timestamp_created": 1485576032, "timestamp_updated": 1508250067, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.493385", "comment_count": "34", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1485633485, "developer_response": "I hope for the most part you enjoyed the game I made. If that's the case that I met my goal.\n\nFew things to note (not going to go point by point detail by detail because that would simply be too large).\n\nYou can capture bases making the game world dynamic (first steps!). There are \"black market bases\" you don't have to be a pirate to buy base/ship capture ships. The game will have a story line. \n\nCheck out the recent vids/updates/etc and keep track of the project in the news section for future additions. It seems like you missed a few.\n\nIf you say that the map is too small and it takes 20 minutes to travel it (via the hyper space/fast travel method) - but you played 40 hours. Sounds like good design to me. Less travel and more action - I hope! I even made travel faster via adding gates (again check out the news section).\n\nThe funny thing is that most likely there will be non-player fleets and player owned fleets. They won't be the \"unified GUI dynamic sandbox\" fleets you described, but they will allow for basic territory/space defense/control.\n\nWhat you suggested was a full 4X strategy game - on top of what the game already is - with a unified GUI (which in terms of game development terms - means that the entire game needs to be seamless - which means seamless space sim, fleet and overworld and 4X strategy game) - with a \"dynamic sandbox\" that apparently no one else ever made. If they have - please point it out - I'd love to play it!\n\nIts fine to criticise and suggest but adding a 4X game ontop of my plans is too much. Perhaps I'm wrong in how I communicate with people like yourself - maybe I'm too honest? But I think honesty and managing expectations is very important during Early Access.\n"}, "29512596": {"recommendationid": "29512596", "author": {"steamid": "76561198090711744", "num_games_owned": 78, "num_reviews": 11, "playtime_forever": 119, "playtime_last_two_weeks": 0, "last_played": 1485467063}, "language": "english", "review": "Fun game with huge potential and the rarest thing in the world, a dev that cares.", "timestamp_created": 1485480680, "timestamp_updated": 1485480680, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.503032", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "29472914": {"recommendationid": "29472914", "author": {"steamid": "76561198132879981", "num_games_owned": 95, "num_reviews": 1, "playtime_forever": 6661, "playtime_last_two_weeks": 0, "last_played": 1513523756}, "language": "english", "review": "I spent a total of 115 hours on this game and i plan to spend many more, why? This game has amazing 4k graphics, large scale battles, freedom, replayability, and an intellegent, helpfull, patient, and focused creator that spends all day and almost all night working to bring gamers like you reading this a truly unique expirence. This is the best 15$ i have ever spent on a game 11/10.\n\n\n Thank you for reading please give this game a chance and send a thank you to the creator", "timestamp_created": 1485302854, "timestamp_updated": 1503077027, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "29435418": {"recommendationid": "29435418", "author": {"steamid": "76561198353237059", "num_games_owned": 7, "num_reviews": 2, "playtime_forever": 232, "playtime_last_two_weeks": 0, "last_played": 1485388411}, "language": "english", "review": "I had a problem with the game, and the devoloper was very helpful in assisting me in fixing the problem, this game may not seem much at first,But it has extreme potential in becoming the best space sandbox ever made", "timestamp_created": 1485139592, "timestamp_updated": 1485393527, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523703", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1485628706, "developer_response": "Update -\n\nThanks for updating the review I'm glad that I was able to help.\n\n--\n\n\nHi - \"screen is shaking\" is tends to be a performance related issue. There's a sticky post on the \"Bug and Support\" forum with potential help: http://steamcommunity.com/app/369530/discussions/6/350542145709920651/\n\nThere's a variety of potential issues - one is not having a dediicated video card, another is having two video cards and the game wrongly chosing the weaker one.\n\nThe best practice is to post on the support forum and we can take it from there and get it resolved or more understood.\n\nOnce docked at a base you can access a bunch of tutorials via the simulator - but if the game is performing badly then that's the place to focus on to get that resolved."}, "29390932": {"recommendationid": "29390932", "author": {"steamid": "76561197992966366", "num_games_owned": 708, "num_reviews": 32, "playtime_forever": 645, "playtime_last_two_weeks": 0, "last_played": 1485065788}, "language": "english", "review": "For being early access space sim this is fun, it might be a bit rough around the edges but is shaping up to becoming a very good space sim. Fun combat and a cool mix of normal combat and rts style combat when you get a proper fleet.\n\nWill add proper score when game is done!", "timestamp_created": 1484979288, "timestamp_updated": 1484979288, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.503032", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "29131284": {"recommendationid": "29131284", "author": {"steamid": "76561198044980073", "num_games_owned": 303, "num_reviews": 29, "playtime_forever": 412, "playtime_last_two_weeks": 0, "last_played": 1484151471}, "language": "english", "review": "So let me start off by saying that this is the best space game i played in years. Reminds me of freelancer A LOT.\n\nYou start off in your small ship and know nothing about what happened. you start doing missions and earning money, you upgrade your ship and get better, you buy more ships to upgrade and survive in space. Pretty epic game if you ask me and for this game i would choose it over any AAA game. The Developer is very Supportive and helps if you have a question. Since i dont give scores in reviews id just really recommend giving this game a try. its worth it!!!", "timestamp_created": 1483924289, "timestamp_updated": 1483924289, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.498031", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "28855215": {"recommendationid": "28855215", "author": {"steamid": "76561198080795448", "num_games_owned": 63, "num_reviews": 14, "playtime_forever": 13696, "playtime_last_two_weeks": 59, "last_played": 1516411275}, "language": "english", "review": "I really like this game. \n\nThis review will be updated as the game's development progresses, as it is in very early development.\n\nPros:\nAfter 90 hours of playing, I still have not run out of things to do.\nUnconventional methods of obtaining ships that aren't on any sort of market\nThere are currently 9 factions including 2 pirate factions that are constantly at each others throats.\nA large number of bases and large platforms, like shipyards and defense platforms, as well as radar platforms.\nCurrently a small amount of base management, however you have no control over what is produced.\nYou can get close to any faction without making more than 1 faction hate you.\nThere are currently around 75 ships (including varients) that you can obtain, and there are still more to come.\nThe game progresses very slowly at first, but once you are able to perform specific tasks you can obtain large sums of money, and become a super power in the system.\nAs you keep playing you will keep learning small tricks that make life easier.\n\nCons:\nMy number one gripe is that travelling takes 10 years, especially with larger ships. (Yes, even with engine optimization.)\nIt will crash eventually, and once it starts it crashes a lot.\nI have heard people complain about controls and performance issues. I haven't had trouble with either of these.\nI feel that this game is too easy, compared to the first game, but there are still challenges even for players like me.\n\nMore to come in this review, and please keep in mind that this is the first serious review that I have written in awhile.", "timestamp_created": 1483158247, "timestamp_updated": 1483158247, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.586944", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "28840228": {"recommendationid": "28840228", "author": {"steamid": "76561198022217052", "num_games_owned": 38, "num_reviews": 1, "playtime_forever": 3786, "playtime_last_two_weeks": 0, "last_played": 1511756299}, "language": "english", "review": "Maby you could add a Desteroyer  Fast + Damagr Dealer but Fragile\n\nVary nice game so far", "timestamp_created": 1483125973, "timestamp_updated": 1483125973, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.401669", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "28799614": {"recommendationid": "28799614", "author": {"steamid": "76561198125362451", "num_games_owned": 116, "num_reviews": 22, "playtime_forever": 1065, "playtime_last_two_weeks": 0, "last_played": 1510350125}, "language": "english", "review": "I loved Void Destroyer. And I'm not much of an RTS player, I'm a pilot. That really says something about the \"individual unit control\" the game provided. Void Destroyer 2 however, takes it to the next level. Rather than starting off with the difficult task of commanding an entire military fleet, you begin in a small utility ship, converted into a sad excuse of a fighter. And from there, you climb your way up, your fighter becomes a gunship, then a corvette, then a heavily armed battleship. And your money grows and grows as you purchase fighter escorts, trading and mining ships, and more. This game is everything I wanted from VD1, and everything I loved from it too. It has a bit of a learning curve if youve never played Void Destroyer, (pro tip, take up courier missions, and eventually you'll see an entire station swarming a single pirate frigate. Wait until its almost dead, then be the last person to hit it.) For an Early Access game, the \"To-do\" list is pretty well checked off. The only downside imo is that there is no planned multiplayer, and that the ships don't have fleshed-out cockpits and interiors. If the cockpits were more varied, and the ships had basic interiors you could walk around in and walk directly out of into a station, this game would be a 10/10 in my book. For now, I'll say 9/10.", "timestamp_created": 1483036002, "timestamp_updated": 1483036002, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.593451", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "28794603": {"recommendationid": "28794603", "author": {"steamid": "76561197987679413", "num_games_owned": 191, "num_reviews": 63, "playtime_forever": 12494, "playtime_last_two_weeks": 1965, "last_played": 1516502790}, "language": "english", "review": "The game is extremely promising. The AI is just really, really bad right now; that's really the only problem, but it affects every area of the game.", "timestamp_created": 1483026685, "timestamp_updated": 1507942784, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "15", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1484432949, "developer_response": "While I'm not happy about you not recommending this game to others - I'm happy that you played it for over 70 hours. \n\nI hope most of that time was a fun and unique experience :) \n\nIf that was the case then I achieved my goals. I'm not trying to beat Freelancer/Homeworld/etc games because I can't. VD1/VD2 are crowd (VD1) and self (VD2) funded, there's no way I can compete with their level of polish, funds and team size.\n\nSo instead of having a laser focus and super duper polish. I'm instead aiming on giving players something unique. Big studios rarely do this because it is a big risk (jobs and investments are on the line) - that's why there's us indies."}, "28777507": {"recommendationid": "28777507", "author": {"steamid": "76561197979845156", "num_games_owned": 514, "num_reviews": 5, "playtime_forever": 1277, "playtime_last_two_weeks": 0, "last_played": 1512520868}, "language": "english", "review": "I'm too lazy to post a long review \n\nIts good, It will probably be even better a year from now might even surpass X3 or freelancer", "timestamp_created": 1482985389, "timestamp_updated": 1482985389, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.447111", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "28641923": {"recommendationid": "28641923", "author": {"steamid": "76561198047755052", "num_games_owned": 153, "num_reviews": 2, "playtime_forever": 122, "playtime_last_two_weeks": 0, "last_played": 1482635214}, "language": "english", "review": "I do like this game I really do and i see so much potental but the only problem for me is that after changed the key bindings I couldn't even use the tactical or Overworld overlay (Shift+Enter) to point where it is unplayable. So until theirs a fix for this or if im just being stupid and the solution is in front of my face I can't recomend this game, Not right now but maybe later.", "timestamp_created": 1482689117, "timestamp_updated": 1482689117, "voted_up": false, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.276764", "comment_count": "17", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1482861635, "developer_response": "It sounds like maybe you re-bound the keys in such a way that they are somehow unsuable? If its the fault of the game's it would be very useful to know about this so I could fix the issue - but I would need more details.\n\nCould you tell me what exactly you did and what exactly is happening?\n\n\nUpdate: \nK'ril Tsutsaroth tried uninstall/reinstall/verify cache without fixing the issue - this might help:\n\nThe game creates config files - which Steam wouldn't delete on a re-install/etc due to how Steam works. They are located here: C:\\Program Files (x86)\\Steam\\SteamApps\\common\\Void Destroyer 2\\Config by default, deleting files in that folder will re-set user configs back to original configs thus should solve the issue."}, "28598430": {"recommendationid": "28598430", "author": {"steamid": "76561198113335898", "num_games_owned": 99, "num_reviews": 3, "playtime_forever": 1338, "playtime_last_two_weeks": 0, "last_played": 1503746432}, "language": "german", "review": "Even now a very good and interesting game, i just hope, that there will be bigger ships and a way bigger map to explore", "timestamp_created": 1482592302, "timestamp_updated": 1482592302, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.515418", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "28581259": {"recommendationid": "28581259", "author": {"steamid": "76561198074672646", "num_games_owned": 4374, "num_reviews": 593, "playtime_forever": 82, "playtime_last_two_weeks": 0, "last_played": 1476252480}, "language": "french", "review": "[h1]Void Destroyer 2 est un jeu de simulation spatiale[/h1]\n\nQuand j’ai testé Void Destroyer 2, il était en accès anticipé et en version pré-alpha. \n\nA ce que j’ai pu voir, les perspectives sont excellentes pour ce jeu. Si le studio réussit à mener à terme leur projet, Void Destroyer 2 va être un excellent jeu.\n\nVous commencez petit propriétaire d’un vaisseau spatial et vous devez choisir votre chemin. Vous pouvez devenir pirate, garde du corps, mineur (récupérer des ressources sur les astéroïdes), marchands, etc.\n\nDans l’état actuel des choses, je vous le déconseille, MAIS, dès que les auteurs aborderont la phase beta voire même alpha, pourquoi pas... comme je l’ai déjà dit, les perspectives pour Void Destroyer 2 sont bonnes.\n\n[url=www.graal.fr/2016/10/13/test-void-destroyer-2-la-version-pour-steam/]Pour découvrir l’intégralité de mon test sur Void Destroyer 2.[/url]", "timestamp_created": 1482555171, "timestamp_updated": 1482555171, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "28454407": {"recommendationid": "28454407", "author": {"steamid": "76561198203770776", "num_games_owned": 29, "num_reviews": 1, "playtime_forever": 11240, "playtime_last_two_weeks": 0, "last_played": 1510783742}, "language": "english", "review": "in the month i have owned this game i ranked over 100 hours in gameplay.\ni love the game because you can chose between any ship in your fleet and can even quickly switch ships in the heat of battle. From using the apollo corvette for chasing down those pesky pirate fighters to using the hadesB and taking down other frigates with its lasers.\nthe game is still in early access and doesnt have all of its features in yet but the Developer is more then sociable on the steam discussion and helped me more then once when i was stuck. \nthe game itself covers a huge amount of gameplay from Dogfights to large scale fleet battles. you can also master the use of the RTS mode and control all your ships to preform quick and decisive manouvers.\nBest of luck to the developer on this game and it is definatly worth a buy.", "timestamp_created": 1482090767, "timestamp_updated": 1482090767, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.496071", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "28367721": {"recommendationid": "28367721", "author": {"steamid": "76561198056351450", "num_games_owned": 212, "num_reviews": 3, "playtime_forever": 1084, "playtime_last_two_weeks": 0, "last_played": 1509807637}, "language": "english", "review": "This game is really good, the first night I bought it I stayed up till 4:30 am. It has what I was hoping for in elite dangerous, with a good battle system and a feeling of continual progression.\nPros-\nHandles a lot like mount and blade\ngreat dog fights\nlots of ships\neasy to pick up and play, hard to master\ngood amount of misions\ngood dev support\n\nCons-\nStill early access so could not progress much, however is already fun to play\nGraphically not great, although the modelling of the ships and space stations is good, lots of originality\nStill features to be implemented\nOccasional crash\n\nOverall, a very good play!", "timestamp_created": 1481754094, "timestamp_updated": 1481754173, "voted_up": true, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.571078", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "28313740": {"recommendationid": "28313740", "author": {"steamid": "76561198024930612", "num_games_owned": 648, "num_reviews": 50, "playtime_forever": 1039, "playtime_last_two_weeks": 0, "last_played": 1482170402}, "language": "english", "review": "Already a cool game.  Here's to hoping it delivers. \n\nalready more fun that elite dangerous, too.\n\n**UPDATE** definitely best space game out right now", "timestamp_created": 1481479086, "timestamp_updated": 1482170511, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.461101", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "28248064": {"recommendationid": "28248064", "author": {"steamid": "76561198018755621", "num_games_owned": 197, "num_reviews": 5, "playtime_forever": 5669, "playtime_last_two_weeks": 0, "last_played": 1512924060}, "language": "english", "review": "Freelancer meets Mount&Blade: Warband\nThe base game is there and more content is on the way.\nIt's shaping up to be a fun space combat game.", "timestamp_created": 1481175579, "timestamp_updated": 1481175579, "voted_up": true, "votes_up": 12, "votes_funny": 2, "weighted_vote_score": "0.643350", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "27606620": {"recommendationid": "27606620", "author": {"steamid": "76561198001077428", "num_games_owned": 214, "num_reviews": 31, "playtime_forever": 1481, "playtime_last_two_weeks": 0, "last_played": 1483623074}, "language": "schinese", "review": "简单的来说，这就是宇宙版的骑马与砍杀。\n你作为战争工具，是个没有记忆的STUB，被坏人捡走，又被好人救走，然后一条大路摆在面前:从零开始做自己。\n然后就是宇宙常见事项：任务，运送，采矿，战斗，飞船...特点在于你控制的目标不限于一条船，毕竟这游戏的一代就是不错的RTS+RPG，所以你可以控制一整个舰队~\n剧情什么的...目前还完全没有。\n不过已经很有趣了。\n\nPS：觉得宇宙的背景太单调？那是因为按照设定，STUB这种人肉CPU就没长人眼，所以要看到‘类似人眼所见的星空’，得购买飞船改造配件...", "timestamp_created": 1480142389, "timestamp_updated": 1480142389, "voted_up": true, "votes_up": 14, "votes_funny": 3, "weighted_vote_score": "0.703763", "comment_count": "6", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26701653": {"recommendationid": "26701653", "author": {"steamid": "76561198090500855", "num_games_owned": 29, "num_reviews": 1, "playtime_forever": 548, "playtime_last_two_weeks": 0, "last_played": 1509362554}, "language": "english", "review": "well this is one amazing game right now, even being as unfinished as it is, i really enjoy playing it, its a true sandbox, you can do everything from becoming a pirate to make a fortune trading, or be a bounty-hunter, and thats just what is in game right now, i cant wait to get the final game, and i really think this game is worth 14 bucks, really recomended\nbtw english isnt my first language so sorry for the awful grammar", "timestamp_created": 1479597225, "timestamp_updated": 1479597225, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.455857", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26664155": {"recommendationid": "26664155", "author": {"steamid": "76561197989056722", "num_games_owned": 207, "num_reviews": 2, "playtime_forever": 23, "playtime_last_two_weeks": 0, "last_played": 1479431226}, "language": "english", "review": "I dont wright reviews often, but I feel I need to write one for this game as it has the potential to be one of the best space sandbox game ever.\n\nI bought the game after having watched a friend play for a couple of hours. Even though its still only in Alpha, the game has tremendous dept and I can see where its going. Let me just say that if this game reaches its full potential, it will be mind blowing.\n\nI will add things to this review once I get to play more but honestly, its worth the purchase if you are a fan of games like the X series (X3TC-AP).\n\nMan I hope this game will be moddable.", "timestamp_created": 1479431760, "timestamp_updated": 1479431760, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.460113", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26619993": {"recommendationid": "26619993", "author": {"steamid": "76561197998059769", "num_games_owned": 254, "num_reviews": 1, "playtime_forever": 13709, "playtime_last_two_weeks": 0, "last_played": 1515001607}, "language": "english", "review": "Finally making a small review about this game :D\n\nactually something about the developer first:\nHe's reading every discussion about his game and answering anyone's questions, listening for critique and balancing feedback.\nWhen there is a bug being reported it's being fixed within days or even just a few hours.\n\nnow for the game itself, even more awesome content is added about every few weeks.\n\nit's a space simulation with a relatively simple cartoon art style (look at the screenshots)\nI don't usually like that in a serious game but it grew on me in time, you can also use the ingame settings to reduce it's freakishness. Overall the design of the ships is very nice and different factions vary a lot in the way their ships look. Some ships look absolute stunning though!\n\nYou start very small, with a single weak ship but can buy or capture about any type ship you encounter.\nYou can get whole fleets of fighters, gunships, corvettes and frigates, maybe we will see some larger cruisers in the future.\n\nThere are countless ways of playing...\n\nBounty Hunting with a single ship or small fleet\n\njust trading yourself and buying additional ships that trade automatically ( and get some fighters for escort against pirates)\n\nbeing a Pirate is awesome and dangerous as well, if you gain the pirates' respect you can capture / board enemy ships\n\nSoon the player will be able to capture stations as well, maybe building his own ships, who knows...\n\nyou could also play a repair ship and get paid for...well reparing other ships.\n\nanyway this game is awesome and growing and improving every day / week, worth every cent", "timestamp_created": 1479238826, "timestamp_updated": 1479238826, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.548473", "comment_count": 0, "steam_purchase": true, "received_for_free": true, "written_during_early_access": true}, "26616142": {"recommendationid": "26616142", "author": {"steamid": "76561198057259276", "num_games_owned": 67, "num_reviews": 19, "playtime_forever": 2292, "playtime_last_two_weeks": 0, "last_played": 1503219545}, "language": "russian", "review": "Знаком еще по первой части - годнейшей смеси Nexus и Freespace.\n\nМутацию игры в песочницу не вполне поддерживаю, но главное, что это по прежнему хардкор с относительно честной физикой и в сеттинге твердой фантастики. Редкое явление среди нынешнего тренда на \"лазерпупиу\".", "timestamp_created": 1479222477, "timestamp_updated": 1479222477, "voted_up": true, "votes_up": 13, "votes_funny": 5, "weighted_vote_score": "0.571608", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26600616": {"recommendationid": "26600616", "author": {"steamid": "76561198012099749", "num_games_owned": 312, "num_reviews": 6, "playtime_forever": 939, "playtime_last_two_weeks": 0, "last_played": 1493949200}, "language": "english", "review": "Game is obviously not all there yet but here are first (and second) impressions. Going to skew negative in the hopes that it improves.\n\nCombat is fun and exciting but it's easy to get overwhelmed and hard to get out of tight spots. Escape into the overworld from a battle going south is finicky to the point of being nearly impossible. So many times i get the distance I need and hit overworld only to find my ship facing the wrong direction and getting pulled out back into a losing battle. Not great.\n\nShip designs and visuals are pretty cool. I love the minimalist, cell-shaded style. Some problems with the arrow on the HUD pointing to your off-screen target. It tends to get lost in the shuffle of other arrrows, blips, explosions, etc.\n\nMissiles fire when they want to and sometimes decide to go after your target while other times they fly uselessly into the distance.\n\nThe capital ship command view controls feel overly complex and unintuitive. Though I don't know how to solve something like that.\n\nThe RTS elements aren't quite there yet. The interface is confusing (hard to figure unit locations on the z-axis in real time). Unit pathing needs work.\n\nI'm hoping for a lot of improvements and I don't think it's quite worth the sticker price right now but it's not bad.", "timestamp_created": 1479134989, "timestamp_updated": 1479134989, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26586631": {"recommendationid": "26586631", "author": {"steamid": "76561197995984107", "num_games_owned": 158, "num_reviews": 3, "playtime_forever": 1045, "playtime_last_two_weeks": 9, "last_played": 1515390218}, "language": "english", "review": "The game is great i love it. It still need abit of work and some more ships added but its a really enjoyble game to play and id suggest it to anyone that love space games.", "timestamp_created": 1479061487, "timestamp_updated": 1479061487, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.465686", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26563233": {"recommendationid": "26563233", "author": {"steamid": "76561198152254971", "num_games_owned": 32, "num_reviews": 6, "playtime_forever": 2221, "playtime_last_two_weeks": 0, "last_played": 1512513488}, "language": "english", "review": "A fun game about space.\n\nAnd blowing stuff up in space. \nAnd getting blown up in space.\n\nIt also gets frequent updates.\n\nAnd has a very nice mix of direct and rts control of your fleet.\n\nWould Recommend", "timestamp_created": 1478972019, "timestamp_updated": 1478972019, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.434421", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26556549": {"recommendationid": "26556549", "author": {"steamid": "76561197973080662", "num_games_owned": 811, "num_reviews": 38, "playtime_forever": 1243, "playtime_last_two_weeks": 0, "last_played": 1500263562}, "language": "english", "review": "Fight, trade and think in an open world space sandbox with battling factions, yeah it's pretty much mount & blade in space to put it roughly.\n\nWelcome to Chaosavy's (the talented dev) universe who probably watched all \"will it blend\" videos and applied this successfully to its gameplay. You'll find clear inspiration from Homeworld, X-series, Independent Wars 2... It's a newtonian based physics ( https://en.wikipedia.org/wiki/Space_flight_simulation_game ) that provides excellent feelings for combat and navigation.\n\nYes you can fly every ship you see, be a pirate, set up a trade empire, escort vulnerable merchant, race, defend station, clear out asteroid fields full of pirates... Diversity as its best.\n\nNow to speak on a more personal approach, i'm coming from X3 and Void Destroyer 2 just overcome the latest in many points such as fleet management (RTS view, drag and drop, right click and ennemy), combat (because of newtonian physics), only the trading part (as of 11/12/16) which will be reworked doesnt scale to X3. Pretty impressive eh?\n\nNot even mentionning the exemplary attitude of Paul \"Chaosavy\" toward it's community and early access. My hero is answering every single message on the forum and since i bought the game, he published updates almost every 2 weeks. The latest patch added ship capturing, the one before added a total of 30 missions, and station capturing is going to be the next one. So we're not talking about a new ship here and there, this guy is working hard.\n\nThere must be a reason why there is only one negative review at the time i'm writting this. Find out why, join the fight!\n\nEdit: Nominee for the One-man made game award!", "timestamp_created": 1478951668, "timestamp_updated": 1479952269, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.549708", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26457222": {"recommendationid": "26457222", "author": {"steamid": "76561198161435120", "num_games_owned": 90, "num_reviews": 19, "playtime_forever": 434, "playtime_last_two_weeks": 0, "last_played": 1505750124}, "language": "english", "review": "Pretty sweet.\nBUT i have a pretty decent pc, but still runs with 20-25 fps even on the LOWEST possible. So das a lil' wierd.\n\nHowever the game is great buy it ffs", "timestamp_created": 1478441879, "timestamp_updated": 1478441879, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.466802", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1478482396, "developer_response": "Talked with Gents - issue appears to be a \"two display adapters\" and the intel chipset is used to run it.\n\nUpdate - Gents got the game running on the NVIDIA card, but now it appears to be capped at 30FPS, further trouble shooting engaged."}, "26445386": {"recommendationid": "26445386", "author": {"steamid": "76561198039909911", "num_games_owned": 243, "num_reviews": 39, "playtime_forever": 603, "playtime_last_two_weeks": 0, "last_played": 1502579576}, "language": "english", "review": "Damn it okay so i only played 2 hours but i know how to tell a good game versus a bad game. This is one of the most intense space sims ive ever played and i enjoy its presentation and gameplay way more than big titles. You can't go wrong with Void Destroyer 2, I bought a second ship and added it to my fleet so now i'm like han solo with a bodyguard and plan to get into piracy for money so i can feed to my fleet and get a better ship for myself because my fleet consist of two noob ships (Hornets). But there's so many things to do already for an early access game. I wish to upgrade this review when i figure out more things, such as the storyline but i won't spoil the story here, but everything is presented in fashion and style. The models look amazing, the space too...It's not your usual black and stars space, it reminds me of a cartoonish style which i can appreciate a lot. The best thing is that Void Destroyer 2 runs on my old pc i upgraded a little bit through years...It runs like a charm, plays like a charm, and feels charming ahah. The game developper is really devoted and even bothered to reply to a question i had on the forums, i was amazed by this aswell!", "timestamp_created": 1478386723, "timestamp_updated": 1478386723, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.503736", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26393926": {"recommendationid": "26393926", "author": {"steamid": "76561198002888648", "num_games_owned": 38, "num_reviews": 4, "playtime_forever": 191, "playtime_last_two_weeks": 0, "last_played": 1474619602}, "language": "schinese", "review": "好游戏， 强烈建议加入中文", "timestamp_created": 1478141405, "timestamp_updated": 1478141405, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.517857", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26289580": {"recommendationid": "26289580", "author": {"steamid": "76561198071611456", "num_games_owned": 91, "num_reviews": 12, "playtime_forever": 1849, "playtime_last_two_weeks": 0, "last_played": 1507384529}, "language": "english", "review": "If I'd have to describe this game in one sentence:\nHomeworld x Freespace x Open World sandbox, all this with Borderlands style graphic.\n\nPros:\n- combat is very well ballanced (every ship type is useful)\n- AI is actually competent and most of the time don't require micromanagement (I have a fleet of 80+ ships and usually I can just give \"attack all\" or \"form up\" commands and the AI just do the rest)\n- (some) generic missions have persistence (e.g. I took \"repair military ship\" mission and once I finished it that ship begun patroling the area and engaging local pirates. In other mission I failed to destroy huuuge pirate group, because it was...well huge - I ran away forgeting about them. some time later I notice that same group terrorizing the area - now my plan is to take lost of \"repair military ship\" missions so that the military could deal with them)\n- freedom - you can be Pirate, Bounty hunter, Trader or Miner.\n- Several diffrent factions with their own distinct design and ballance philosophy\n- each faction has distinct set of generic mission that player can take\n- 80+ ships for these faction, all of them with wide range of upgrades and customizations\n- flight mechanic is well balanced between newtonian flight and arcade shooter\n- you can build your own fleet of combat ships, trading freighters and mining ships\n- ability to quick and easy jump between ship combat and ship command mode (RTS style)\n- already good price to content ratio (look and above, look at the Price tag, then take a look on \"One Man's Lie\" price tag) despite it's still very early access\n- game developer is very active and open to feedback\n\n\nCons:\n- If you was already after years with Homeworld 2, you will notice that the general GUI is still very crude and require a lot of work. However as this was openly admitted by author, the GUI was low-prio for the first release. He already begun GUI tweaks and improvement in last few day. It made a huge leap in good direction.\n- There is almost no ships above Frigate size yet due to early access. If you dream about your personal battleship or carrier then you will have to wait.\n- The number and variants of generic mission is still limited due to EA, so after several days they become very repetetive.\n- the \"borderlands\" style graphic might look quite ugly at first, so depending on the taste this might be very big issue and this is the only issue not related to early access status.\n\n\nNow the last paragraph about VD2 Early Access in general.\nWe all know how \"bad\" the pernament Early Access games are in these days. Some of them ending up as almost a scam.\nVoid Destroyer is not like these \"bad\" EA.\nI bought VD1 as Early Access played for a few hours, had some fun...then forgot about the game because it was EA work in Progress. Year later I received steam mail that VD1 is now out of EA and with release status.\nI jumped back to the game and had a lot of fun playing the main story (not your average casual game, once aliens appear you need to prepare to discover new meaning for \"being screwed\" and then they joy when you finally begin to push them back).\nWhat does it mean for VD2 EA? I'm confident that author will deliver what he promised - his roadmap is clear, the core gameplay is ready, feedback from players is well processed.\n\nTo me this is best spent 15$ on a game this year.", "timestamp_created": 1477743041, "timestamp_updated": 1477743041, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.516667", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26280580": {"recommendationid": "26280580", "author": {"steamid": "76561198038974004", "num_games_owned": 20, "num_reviews": 4, "playtime_forever": 7107, "playtime_last_two_weeks": 0, "last_played": 1487823213}, "language": "english", "review": "I just have to say this is the most enjoyable space combat I've experienced. It's hard to really explain why... the flight mechanics, the weapons, the ships themselves... it all feels \"just right\" to me. If you're not sure, watch some of the videos where Paul (the developer) shows off some combat- that's when I was sold. \n\nYou've got thrusters for 6 directions and a newtonian flight model (\"auto-thrust\" helps compensate and can be toggled on/off any time). I've had many hours of fun dogfighting with enemy fighters and wearing down larger ships and trying to avoid their firing arcs. Learn the controls and/or change them to something that works for you and it will pay off. I went through 2 or 3 setups until I decided to map the up, down, left and right thrusters to my hat switch. Lots of ships have turrets so whatever you do, make use of those thusters!\n\nIf you're in a bigger ship, you can press F5 to go into Command Mode which makes it kind of like Bridge Commander. Take control of the ships turrets while trying to bring those big forward guns around. Very cool. I just have not used it much since I apparently like pretending to be an ace pilot.\n\nOnce you start having big fleet battles, you may want to use the tactical/RTS mode. You can slow down time while you give orders- and oh boy, can you give orders! There is more going on here than I can really tell you so I will just say tactical mode can be an incredibly powerful tool for the player. You wont be forced to use it but the more ships there are, the more useful it will be. It's a bit like Homeworld or Nexus: the Jupiter Incident, I think.\n\nThe ships are all awesome and unique, you can upgrade the heck out of them (even upgrade the amount of upgrades they can have), and they almost all have a cool secondary weapon. I still go back to flying a Brick from time to time. It's slow and weak but it can lay mines that turn into heat-seeking missiles :D\n\nRight now, the biggest ship you can fly is a frigate with cruisers, destroyers and carriers still to come. Ship capturing and base capturing are still to be implemented but the \"end game\" is that the player will be able to take over the entire sector.\n\nRandom info:\nThe game is meant to be played with mouse and keyboard so joystick is optional\nLow system requirements- my GTS 450 is still going strong\nIt's $15\nIt's not 4x but it is a sandbox- set up auto trading and mining to get those credits flowing\n\nI would say if you are looking for fun, intense space combat look no further. Even in it's Early Access state you should at least get your money's worth. \n\nP.S. Just be aware that this is not baby's first space game. When you play games like this you usually have to take some time to figure stuff out. Don't hesitate to ask questions on the forums.\n\nP.P.S. As of this writing, I have 2 Steam codes for Void Destroyer 2 and not enough friends who play space games. Send me a message and maybe I can give you one.", "timestamp_created": 1477706943, "timestamp_updated": 1477707007, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.573722", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26193337": {"recommendationid": "26193337", "author": {"steamid": "76561198058506808", "num_games_owned": 259, "num_reviews": 41, "playtime_forever": 1736, "playtime_last_two_weeks": 0, "last_played": 1514157894}, "language": "english", "review": "This game is very promissing. Lots of stuff to do so far. Easy to get into.", "timestamp_created": 1477280470, "timestamp_updated": 1477280470, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.426788", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26157933": {"recommendationid": "26157933", "author": {"steamid": "76561197967952455", "num_games_owned": 272, "num_reviews": 15, "playtime_forever": 121, "playtime_last_two_weeks": 0, "last_played": 1476054549}, "language": "english", "review": "this is just an at length review of the games faults- i get that it has positives, but the developer will get nowhere if i shower him with love and kindness. currently the game is a cell shaded picture viewer- i've played 2 hours, with multiple starts, and i've yet to find anything but escort or combat escort missions; worse yet, missions go from, easy, annoying and \"the game must hate me\". and that might be fine if those missions had some story to them- not that the current implementation would be enjoyable if the developer used it as it isn't anything beyond simply annoying[ simple cue's on that there is a button would help us staring out \"next\"? yeah, watching youtube shouldn't be this games goto..].\n\nmissions are dry- you have no idea what effect they're having for you, beyound the money you make, and there is no dialog whatso ever- ambient dialog is totally abscent; to fail it worse, you get 3 levels of dificulty- easy, mildly annoying and end level of doom set on the hardest dificulty with no prior training on how to even play much less weapons. all missions are designed to throw enemies at you- small, lots of smalls, or just loads of big ships; there is no dialog, no reason, beyond payment, to be there or care- and there is no endurance; you get the mission, you take 15 minutes, you're done- you could almost live without a save system even. missions are also on rails the hard way- no ship is in your group and even if they were and followed you you cannot get more then one mission and no more then 2-3 destinations, close by, are offered up at any one time; i get it, sorta reasonable, but fuel doesn't cost here and if the universe was that lawless you could run an escort business rather then rely on others to tag along.\n\ni'm also not a fan of the \"distress becon\" system- it never worked for me; and even if it did why would anyone respond, i can't pay them.\n\nbeing a one man show is hard- it has taken its toll on VD's[that sounds bad right?] artwork style, and it seems that the 'jack of all trades, master of none' fits when i consider the missions i've seen. the developer responds to the community though- just be super critical and you'll get noticed, but suggestive? not so much- this is their show and they could care less if they have your 14$; which is kinda sad- i was looking forward to the VD sale, but now not so much. i'd really like to support the game, but when the dev says to give up, that sorta clues you in. they're lowing the bar cause they're a basement dev, and they're cool with that. which is very, very sad news to me. i always thought that which was strived for was worthwhile- not this cheaper easier nonsense that you send out like flakk to apease the masses nonsense. suppose i'll just refund- since that's what he jumped to in his comment to me; they don't want me money, that's fine i guess, or maybe they're just jaded by all the critique they get... dunno, but i guess i'll cash out if the dev really doesn't care unless you're perceived to be negative- don't want to get involved in another toxic situation where being disastisfied earns you some illogical quip.", "timestamp_created": 1477117342, "timestamp_updated": 1477117342, "voted_up": false, "votes_up": 6, "votes_funny": 7, "weighted_vote_score": "0.320674", "comment_count": "15", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1480534044, "developer_response": "Currently (10-22-2016) there are over 30 types of \"auto generated\" missions in the game. Different factions have different missions - docking at a faction base gives you access to those missions.\n\nEach faction has \"mission ranks\" - the higher your mission rank the more mission variety is available to you for that faction. Raising mission rank is done via doing missions. The \"mission description\" screen (the screen before accepting a mission) tells you whether this mission will raise the rank or not.\n\nI'm not sure why you haven't found this in your play through of the game - perhaps because its only been 2 hours (as of writing this)? Maybe you jacked up mission difficulty and hit a brick wall? I don't know, but if you want help as to find the other (30) missions let me know on the forums.\n\nI respond to nearly all posts - feel free to check out the forums."}, "26095137": {"recommendationid": "26095137", "author": {"steamid": "76561198084275367", "num_games_owned": 92, "num_reviews": 5, "playtime_forever": 2597, "playtime_last_two_weeks": 0, "last_played": 1502938869}, "language": "english", "review": "its a shame! that games like this goes unnotice its a shame that we have to get lucky to come across a gem like this, its a shame that we paid 59 dollars for a \"LIE\" but life its like this tough luck ...but just as it is as bitter life has its sweet moments...;) ..To discribe this game in one its virtually imposible but becouse i want to ,,, that word  is \"LOVE\".....\ntheres so much of that in this game and that is becouse its a one developer game one programer doing all of this with some help in the art dept.. but that is why this game has soo much to offer its from a gamer with an idea n the brain but the important part its that its from a gamer to  gamers not big names involved that are only looking for profit this a 15 dollar game its worth much more than that trust me helping this game its a much better idea than paying full price for a game that has nothing to offer in comparation to this lil indie game  and ...to the game ....\n\n.....there are factions you can befriend the pirates faction n be one of them with their own type of unique ships or you can be a bounty hunter instead with  their own freaking cool looking bases and unique ships as well .. every faction has its own style of ships as of now i think there are like 4 to 6 different factions not sure on that ..and the dev its adding more content this game is full of content n its just pre alpha...every faction has its own missions with ranks so u can unlock diff types of ships more expensive...u can also costumize this ships ...when u get the money u can buy new ships and add them to ur fleet so eventually ull end up with a huge fllet being able to take on bases urself n having this rodiculus big battles which the RTS aspect of the game will help u manage all of this in a accurate way ...this game its great its just incredible all the ammount of content n detail in the bases n ships nothing like star citizen but this game its on its own and for 14 dollars this game its beggin to be play wer living the worst era of video games in which players get {consumers }get lied to in the name of profit ...IS FOR US TO STOP SUPPORTING BIG NAMES  n to star taking a step forward like this guy did with his game n its for us as well to help support the !!!GOOD ONES!! ..", "timestamp_created": 1476754298, "timestamp_updated": 1476754670, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26094870": {"recommendationid": "26094870", "author": {"steamid": "76561197982254701", "num_games_owned": 122, "num_reviews": 7, "playtime_forever": 934, "playtime_last_two_weeks": 0, "last_played": 1489368277}, "language": "english", "review": "The feeling of starting out as a small fry, working up from running backwater trade routs to a having a merc strike force and getting is some real scrapes very much reminds me of the prograssion of the well blanced sandbox Mount and Blade. The pre-alpha has enough contant that I found myself playing late into the night.\n\nI traded. \nI got in a dogfight\nI ran many dirrent types of mission for sevral differnt factions exploring and visiting locations for VD1. \nI died\nI get into a big dog fight\nI died\nI got into WUGE base defence battle~ \nI lived, made lots of credits.\n\nI highly recomend this game. I suspect this developer can pull off what others have failed to accomplish in providing a straight forward entertaining game, with enough depth of layers to tickle that tactical spot in my brainn.", "timestamp_created": 1476752128, "timestamp_updated": 1476752549, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26059072": {"recommendationid": "26059072", "author": {"steamid": "76561198049695512", "num_games_owned": 179, "num_reviews": 17, "playtime_forever": 2767, "playtime_last_two_weeks": 0, "last_played": 1477271914}, "language": "english", "review": "Awesome Game!\nThis covers everything you could want in a space action/RTS Sim.\n\nFunny how a game like No Mans Sky, does not hold a candle to this game.\nWho care about procedural repition? Everyone else paid $60 when that money could have been enjoyed much more and spent better here with VD2.\n\nChoasavy is a terrific developer and I really appreciate everything I have seen so far.\nThis game is well worth the few bucks I spent for it.\nI strongly recommed purchasing and playing this game if you like this genre. It is one of only a few that are truly worth spending time in.", "timestamp_created": 1476575979, "timestamp_updated": 1477267575, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.557679", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26053363": {"recommendationid": "26053363", "author": {"steamid": "76561198082303358", "num_games_owned": 126, "num_reviews": 6, "playtime_forever": 1668, "playtime_last_two_weeks": 0, "last_played": 1504174162}, "language": "german", "review": "Ich bin recht überrascht wie wenige bugs es gibt für ein Pre alpha spiel \nes macht viele stunden spass weil man schon jetzt immer ein reitz hat größer und besser zu werden\nder endwickler kümmert sich auch in dem forum gut und schnell um die fragen der user\nzum jetzigen zeitpunkt ist der basisbau noch nicht implementiert aber spätestens wen das dan läuft werden meine spielstunden 3 stellig^^\n- die tastenbelegungen sind leider recht umfangreich \n\nAufjeden fall lohnt sich das spiel ;)\nfly save ;)\n", "timestamp_created": 1476554072, "timestamp_updated": 1476554072, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.553759", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25992605": {"recommendationid": "25992605", "author": {"steamid": "76561198058997825", "num_games_owned": 32, "num_reviews": 2, "playtime_forever": 816, "playtime_last_two_weeks": 0, "last_played": 1475799902}, "language": "english", "review": "This is an ambitious space game, so far it delivers.  The art style is simplistic yet consistent and enjoyable.  All the ships and weapons seem pretty well balanced.  The AI is pretty good.  Keyboard and mouse control is very tight, I prefer a joystick but I found those controls too loose and unrefined, and you can't customize axis sensitivity (yet).  Progression is good at this point, you'll be upgrading to better ships in no time after your first few missions.  I have about 12 hours so far and I've gotten a corvette, which is 1 tier below the highest available in the game so far.\n\nThere is no speed limit (!).  Most space games don't do this because simulated physics problems, but it's so immersion breaking.  It's exciting to try to outrun an opponent, which you'll have to do if you want to \"warp\" away to the overworld.  Your weapons have a limited range of around 1km, so you can't attack from super far away, nor can you effectively fly like a bat out of hell so fast and engage in combat and put down more than a few shots.\n\nSpeaking of the overworld, this is such a great way to traverse the map.  It's basically a 2D map that you fly on to simulate warp speed, you can see other ships, friend and foe while in this overworld map and get an idea if you want to attack them.  Sometimes they might pursue you too.\n\nSome negatives, but keep in mind these didn't ruin my enjoyment of the game, and it is Early Access:\n\nThe game crashed a few times on me, but it autosaves often enough that I never lost any progress.  Loading times are minimal and I was back in no time.\n\nA story is planned, but so far little is present beyond the introduction.  Their are plenty of missions to do to earn credits and get used to game mechanics, I am anxious for the story though.\n\nMost of the time the AI is good, but there are some enemy ships I would find that would just sit there and let me beat them up.  Great source of credits...  Once, a ship I was supposed to protect went to a repair platform, and sat for several minutes before repairing.  AIs that fly with the player need to communicate their status or intentions better, it's not always clear what they're doing.", "timestamp_created": 1476246685, "timestamp_updated": 1476246685, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.514752", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25989237": {"recommendationid": "25989237", "author": {"steamid": "76561198133582296", "num_games_owned": 32, "num_reviews": 1, "playtime_forever": 5933, "playtime_last_two_weeks": 0, "last_played": 1501273161}, "language": "english", "review": "This game is awesome! \n\nI have always enjoyed the Homeworld series, but wished I could fly the ships into combat. Wish granted. You get the strategic RTS and ability to fly any ship and customize them too. Even in the Early Access state it is in, the game is great and it keeps getting better with every update from the dev Paul. Paul is amazing too. He listens to feedback, does daily updates, and helps with issues. He even helped me one on one fix a graphics issue I was having with my comp. What an awesome guy!\n\nI highly recommend this game to everyone!!!", "timestamp_created": 1476223483, "timestamp_updated": 1476223483, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.525862", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25985473": {"recommendationid": "25985473", "author": {"steamid": "76561197968448136", "num_games_owned": 215, "num_reviews": 4, "playtime_forever": 1376, "playtime_last_two_weeks": 0, "last_played": 1513869765}, "language": "english", "review": "its a AMAZING game but so far i havent relly seen a story and id like that in games.and yes it says its a sandbox but the first void destoyer had a story AND a sandbox mode.", "timestamp_created": 1476206730, "timestamp_updated": 1476206730, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.474138", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1476230088, "developer_response": "Glad you are enjoying the game! \n\nThe story line will be worked on during Early Access - and finished before Release."}, "25892275": {"recommendationid": "25892275", "author": {"steamid": "76561197995671228", "num_games_owned": 250, "num_reviews": 5, "playtime_forever": 1493, "playtime_last_two_weeks": 0, "last_played": 1507017056}, "language": "english", "review": "I don't normally write reviews, even on games that I really enjoy (I bear this shame). However when I see a great game like this only having 26 postive reviews, I feel it is my duty to show my love (Especially when I see shitty Early Access games that get tons of purchases and reviews).\n\nI've always been a space fan, and as of recently I think this one of my new favourite space games. It won't win awards for realistic graphics, but the art we do see reminds me of borderlands and as much as I was hesitant at first I quickly fell in love with this decision. \n\nAs far as gameplay goes I've found the game extremely enjoyable since day one, good content for an early access and everything thats working seems well implemented.  Developer has been extremely responsive (Within the hour for me so far.) and has popped out multiple updates that were more than just a few bugfixes.  Overall there's a decent starting amount of missions for each different group, multiple different factions to play for (including the pirates), and just a good amount of love put into this game.\n\n\nDefinitely looking forward to supporting this developer and if your on the fence just read some of the clearly better written reviews than mine. Seriously stop reading my review and just buy it, with all the AAA crap on the market we need to support awesome developers like these. \n\nOh and I'll just add it's probably the first game where I've really felt in total control of my fleet, which I really enjoyed (Without having to put 2000 hours into a multiplayer game). \n\nAlso for Gabens sake if you buy this game and like it leave a damn review or at the very least tell people thats its better than no mans sky.", "timestamp_created": 1475790349, "timestamp_updated": 1475790349, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.592059", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25883367": {"recommendationid": "25883367", "author": {"steamid": "76561198083572918", "num_games_owned": 98, "num_reviews": 5, "playtime_forever": 2005, "playtime_last_two_weeks": 0, "last_played": 1490982852}, "language": "english", "review": "realy nice game :3\ni hope it become a workshop with some mods like a star wars mod or a star trek mod or a mass effect mod *-*\n\ngood work :3", "timestamp_created": 1475753701, "timestamp_updated": 1475767971, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.454545", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25851879": {"recommendationid": "25851879", "author": {"steamid": "76561198131473053", "num_games_owned": 194, "num_reviews": 8, "playtime_forever": 2394, "playtime_last_two_weeks": 0, "last_played": 1507136325}, "language": "english", "review": "one of the rare 'jewel' of gaming , even if it's not finished , the dev are active , the ship are looking good , you can play the way you want ( tactical , dogfighting , capital ship fighting ... ) and be what you want ( trader , miner , pirates , bounty hunter , a mercenary , and i hope that when it ill be finished chef of a faction ) , every faction have different ship ( even if not all ship are buyable at this state ) , their is actualy over 6 faction ( it 2 different pirates faction ) , and even one that use asteroid to make cheap , solid and fast building ship . well , it simply a great game ...", "timestamp_created": 1475576318, "timestamp_updated": 1475576318, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25849842": {"recommendationid": "25849842", "author": {"steamid": "76561197971692688", "num_games_owned": 194, "num_reviews": 41, "playtime_forever": 1774, "playtime_last_two_weeks": 0, "last_played": 1507051980}, "language": "english", "review": "What an excellent gem!\nThis is very similar to a few other such games. Rebel Galaxy comes to mind.\n\nObservations:\nHowever, this is a sandbox. The script driving the story has not intruded in my vast hour and a 1/2 experience. ;)\n\nMouse control is tricky - not necessarily bad, but tricky. Takes practice and settling into a style that suits. A different way to view the action other than the default cockpit view or maybe a change in tactics - strafing runs versus dogfights.\nEDIT - there is now a setting for return to dead zone - on 50% I can fly like a pro.\n\nThe artwork is different. I like it. It becomes immersive and transparent. \nThe ships types are many and varied. The ships with turrets are animated as the turrets follow targets et cetera.\nA stylized sort of Art - Deco look. A fresh visual rather than the ubiquitous Steam Punk or Homeworld - esque.\n\nThe tutorials are accessed in a base via the \"Simulator.\" I heartily suggest playing through them.\n\nThe \"Overworld\" map view is similar to Homeworld although not as detailed. Still it is functional. I have used it to skirt enemy ships I spotted on the way to a mission objective. \nEDIT - the dev is working like a madman. Since I first got the game the overworld map and its function has been enhanced & expanded.\n\nThe developer is very responsive and seems to be hard at work. Since obtaining the game (9/25) I have seen two updates? (More like 6, now) Also friendly. My first few comments were not flattering and yet I was greeted with suggestions to alleviate my problems in the game. (And they are MY problems)\nWhen I first read the timeline and expected progress I rolled my eyes and figured, \"Riiiiiiight.\" Now, I quite expect things to progress apace.\nEDIT -  no crepe. There are so many updates. I am certain the timeline is real and the expected progress is very believable. \n\nAnd I have yet to plumb the depth of the game.\nSo far, I have been playing courier and debris wrecker. \nEDIT - Now I am a Bounty Hunter. Mostly civilians because the pirates are too difficult for me at the moment. But that is the game. Choose your profession and pursue it any way you like.\n\nFunny point between the two games - in Rebel Galaxy (or Mount and Blade: Warband, Freelancer, Homeworld & X3) the graphics are of the polished, cinematic variety. Explosions are Star Wars style WOWs! In VD2, you blow up a ship or debris etc and you get a momentary white out of the screen - so much for cinema. \nEDIT Viewed from a respectable distance the explosions are a bit more cinematic, with debris spinning off etc.\nAlso there are hints that the reason the skybox appears as it does is because us \"stubs\" see the Electro-Magnetic Spectrum differently than regular humans.\nWhen the story line is implemented...I can only imagine.\n\nVoid Destroyer 2 is reminiscent of cel animations. VD2 (yeah, that makes me giggle) wins big on this one, though.\nVD2 bases are 3d objects and not pretty pixels that you \"crash\" into to hear that female, \"Docking\" exhalation.\nYou can fly circles around the bases in VD2.\nEDIT - leaving certain bases and you'll see a lot of traffic weaving in and out of the base.\n\nAs far as negative issues, I am down to one.\n\nMusic - I can name games with good soundtracks on one hand. This one is not memorable.\n\nI would very easily recommend this game if you enjoy RG and the notion of a true sandbox in which to play.\nThe plans for the game are fantastic.\n\nTwo thumbs up.", "timestamp_created": 1475561164, "timestamp_updated": 1477027362, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.550715", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25832789": {"recommendationid": "25832789", "author": {"steamid": "76561198003340520", "num_games_owned": 151, "num_reviews": 35, "playtime_forever": 2331, "playtime_last_two_weeks": 0, "last_played": 1480865083}, "language": "english", "review": "Its like that first time you play Borderlands, you're thinking \"looks like a cartoon... holy crap I just burned a dude to death with a SMG!\" Well this is more along the lines of \"I just killed a pirate with my cannon that shoots asteroids!\" I get the same feelings I got the first time I played X2: flying around space, running away, shootin stuff, running away, upgrading my ship, running away, getting a bigger ship, chasing stuff, running .... \n\nIt's still early access, buy very playable.", "timestamp_created": 1475465222, "timestamp_updated": 1475465222, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25828664": {"recommendationid": "25828664", "author": {"steamid": "76561198072772892", "num_games_owned": 161, "num_reviews": 16, "playtime_forever": 964, "playtime_last_two_weeks": 0, "last_played": 1493054756}, "language": "english", "review": "Mount & Blade in space with an incredibly hard working, dedicated and kind developer. This is a rare type of Early Access game (I'd relate it to Rimworld).\nThe game is great: tons of stuff to do in game already - be a miner, be a pirate, run your own company, etc - with a huge variety of customization. The combat is fantastic and feels like how any space-piloting sim should #6degreesoffreedom. On top of the great and detailed first person play style, you can also build and control your own entire fleet, managing them with the same detail as your single player ship. You can control everything your fleet does, down to controlling a single turret of a capital ship, or the entire ship itself.\nThe dev is fantastic: very open, responds to feedback - no matter if that feedback is polite or rude - and genuinely is excited about the game and what he and the community can build into it. If you wonder if this game will ever be finished, the dev already completed a huge game - Void Destroyer - that was in early access and, if you're still doubting, go check that one out and how players like it. This dev has been working on Void Destroyer 2 since Void Destroyer was published and has just now put VD2 on Early Access. This dev has a track record of following through and creating great games.\nIf you're looking for a incredibly detailed, massive and fun space sim with a great community, then Void Destroyer 2 is your game.", "timestamp_created": 1475441559, "timestamp_updated": 1475671897, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25827418": {"recommendationid": "25827418", "author": {"steamid": "76561198119823288", "num_games_owned": 17, "num_reviews": 1, "playtime_forever": 4936, "playtime_last_two_weeks": 0, "last_played": 1514625003}, "language": "english", "review": "Well, not a big fan of Mount & Blade because of the medieval thing, but I really like the concept. Trading, fighting all the way through your career, became a warlord or something. I want the sci-fi or cyberpunk version of Mount & Blade and searched it for years. I first found the game X-rebirth and it was great, but when I extended my fleet to an extreme empire, I feel empty. I can order my fleet to follow me, trade at will, defend station, but I can't make them do a proper formation, capture a station or ship, charge or withdraw from enemy fire. This game is like X-rebirth with more freedom or a space sim version of Mount & Blade and I really love it. By the way, I want TSF ship in my fleet but there was only a nerved version of perez, will there be an option that I join TSF and eventually become a commander or something? A series of mission that make me became one like the previous void destroyer?", "timestamp_created": 1475436965, "timestamp_updated": 1475436965, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1475453516, "developer_response": "Hi Wiwi - thanks for the recommendation :) \n\nGlad you are enjoying the game and thank you for your support.\n\nThere will be at least two ways of getting those TSF ships:\n\n1 ship capture system (using ship capture ships)\n2 owning/capturing a base then building those ships yourself\n\nThese items are on the road map - be sure to check back in often and see all the updates/changes.\n"}, "25824569": {"recommendationid": "25824569", "author": {"steamid": "76561198024423253", "num_games_owned": 86, "num_reviews": 17, "playtime_forever": 655, "playtime_last_two_weeks": 0, "last_played": 1484752771}, "language": "schinese", "review": "虽然玩的还不多，但感觉应该是个好游戏，开发加油！！！", "timestamp_created": 1475427520, "timestamp_updated": 1475427520, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.565217", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25814958": {"recommendationid": "25814958", "author": {"steamid": "76561197994894051", "num_games_owned": 273, "num_reviews": 14, "playtime_forever": 762, "playtime_last_two_weeks": 0, "last_played": 1475873675}, "language": "english", "review": "So far its well done for early access.  Feels very similar to Rebel Galaxy, and has just as much ship content yet is still in pre-alpha.  \n\nStill has small bugs, and has a fairly bland/repetative feeling after the first few hours, but considering its pre-alpha as stated before, Im impressed with the bones/structure of this game thus far.\n\nSo, keep in mind its an extremely early build before you buy.  If youre not willing to wait as he releases more content for the game (which, he does fairly quickly, and is immensely active in the community hub/discussions, he takes ALL feedback from ALL players into consideration, awesome IMO), then you might want to give it a pass.  If youre wanting to support it and are excited to see where the game goes, feel free to give it a try :)\n\n\nFan of the first game, and glad to see the second is just trying to expand upon that!", "timestamp_created": 1475391441, "timestamp_updated": 1475391441, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.595836", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25794586": {"recommendationid": "25794586", "author": {"steamid": "76561198043349425", "num_games_owned": 496, "num_reviews": 26, "playtime_forever": 408, "playtime_last_two_weeks": 0, "last_played": 1498651059}, "language": "french", "review": "Un excellent space sim sandbox, mélange réussi de dogfight/rts. La direction artistique est originale et réussie, facilement modifiable car le jeu est complètement moddable.\nA vous de faire votre chemin en accomplissant les missions proposées, et/ou en créant votre flotte de guerre ou de commerce, en pratiquant le minage, le piratage ou la chasse à primes.\nLe développeur est hyperactif et à l'écoute en permanence, une exception dans le milieu. \nUne early access vraiment réussie, j'ai hâte de voir tout ça évoluer niveau contenu, notamment sur le background.\nEntout cas, si vous aimez les sandbox et les spacesims, je vous le conseille chaleureusement.", "timestamp_created": 1475304302, "timestamp_updated": 1505307412, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25770036": {"recommendationid": "25770036", "author": {"steamid": "76561198113388002", "num_games_owned": 110, "num_reviews": 4, "playtime_forever": 5328, "playtime_last_two_weeks": 0, "last_played": 1485149122}, "language": "english", "review": "I as a player have been burned by several early acces games, whether it be poor communication from dev to player base, no communication at all or having a promising game that the devs suddnely drop. But my love for space snadboxes (more simultors becuase as far as I've seen there are very few that do this so well) like this outweighed my caution. It is a very good mix of RTS and action. It's completly freeform  to the piont where you could be a pirate ganng or a militeristic fleet commander defending the universe (I prefer the former because there is more shooty< shooty, bang, bang:)  ), plus the whole full 3D space dogfighting thing really topped it off. \n       \nThe amount of content in this game is in somecases overthrows even some high budget titles(not to name names, but anyone who had hope for the space sandbox types knows what I mean). Now there is plent of room for more and im sure there is plenty planned. For early access there  is a whole ton to do and I don't see myself getting bored anytime soon. I have really enjoyed every bit of the 10 or so hours as have in it thus far (my girlfriend, no, no, not so much) and I can't wait for the things to come with this game.\n\n Chaosavy (the lone developer) is really good about listening to his playerbase he has reponded to every comment that I have seen. One of the most attentive devs I have ever seen. \n\nI highly recomend this game and hope that the game and it's dev get the attention they deserv. \n\n", "timestamp_created": 1475175080, "timestamp_updated": 1475175080, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25746877": {"recommendationid": "25746877", "author": {"steamid": "76561197989538642", "num_games_owned": 716, "num_reviews": 50, "playtime_forever": 4103, "playtime_last_two_weeks": 0, "last_played": 1515296488}, "language": "english", "review": "Mount and Blade: Warband\nFreelancer\nStarsector\nFreespace\nHomeworld\nEscape Velocity\nX3\n\nIf you have played any of the games on the list above and couldn't put them down, Void Destroyer 2 is your next addiction. \n\nIt's still in its early stages and there are some AI pathing issues and minor interface gripes, but if you're able to look past that, you'll have a really solid, suprisingly complete Early Access experience. I'll add more to this review once I start getting to more of the late-game stuff with the player-buildable structures and similar.", "timestamp_created": 1475100138, "timestamp_updated": 1475170606, "voted_up": true, "votes_up": 25, "votes_funny": 1, "weighted_vote_score": "0.721129", "comment_count": "7", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25719960": {"recommendationid": "25719960", "author": {"steamid": "76561197963762663", "num_games_owned": 232, "num_reviews": 5, "playtime_forever": 2653, "playtime_last_two_weeks": 0, "last_played": 1485976241}, "language": "english", "review": "This is a very fun game and the dev (all one of him) is more active with the early access customers than any other dev I've seen.\n\nAt this point (less than a week after Early Access went live) there is already a fair amount of content in the game, easily enough for 20+ hours of game time. It's open sandbox only right now but you have several different ways to play the game already: Civilian (trader, miner, mercenary), Bounty Hunter and Pirate.  The game world is large enough to be interesting and there are several ships in-game already ranging from tiny fighters to larger frigate class ships. There are also several upgrades available for each ship, including newely added weapon upgrades, and you have the ability to own multiple personal ships, own fleets of your own ships that fly with you under your command, hire mercenaries to fly with you and a good number of AI ships roaming around for you to interact with.\n\nThe bugs I've encountered so far have been minor and the fixes for them have been unbelievably fast.\n\nEasily worth the full price he's asking.", "timestamp_created": 1474949649, "timestamp_updated": 1474949649, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25707499": {"recommendationid": "25707499", "author": {"steamid": "76561198064030447", "num_games_owned": 130, "num_reviews": 7, "playtime_forever": 76, "playtime_last_two_weeks": 0, "last_played": 1474783137}, "language": "schinese", "review": "这么好的游戏为什么没有中文？", "timestamp_created": 1474884692, "timestamp_updated": 1474884692, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.554054", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25705040": {"recommendationid": "25705040", "author": {"steamid": "76561198006484825", "num_games_owned": 180, "num_reviews": 1, "playtime_forever": 422, "playtime_last_two_weeks": 0, "last_played": 1494458734}, "language": "english", "review": "If you have ever played Mount and Blade this game will have a similar feeling. The overworld is a map upon which you travel in 2D space, while being able to go into \"spaceship\" mode at any time. Enemies, friendlies, and neutrals traverse the map around you, and you can control whether time moves normally as you travel or pauses. Apart from that, upgrade your ship, buy better ones, bounty hunt, build a fleet, and use RTS controls when you have enough ships to do what you will. There are missions available at every docking station and factions to ally yourself with, or fight against. EVE style wanted timer for pirating neutral vessels, with promises of many more features. You can pilot and own capital ships currently, with more types on the way! \n\nNote: The art style can be changed if you would like, there are settings for toon shading and outlines, as well as skybox color/quality changes.\n\nOverall I am excited to see what else will be put into the game, and think that the game does not disappoint as an Early Access title.\n10/10", "timestamp_created": 1474864728, "timestamp_updated": 1474864728, "voted_up": true, "votes_up": 11, "votes_funny": 2, "weighted_vote_score": "0.539835", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25704766": {"recommendationid": "25704766", "author": {"steamid": "76561198018697064", "num_games_owned": 371, "num_reviews": 4, "playtime_forever": 203, "playtime_last_two_weeks": 0, "last_played": 1502047655}, "language": "english", "review": "Brilliant 3D space combat game reminiscent of starsector or mount and blade. Can't wait to see the final product, it's already got tons of things to play around with.", "timestamp_created": 1474862532, "timestamp_updated": 1474862532, "voted_up": true, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.533104", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25700494": {"recommendationid": "25700494", "author": {"steamid": "76561198025688361", "num_games_owned": 241, "num_reviews": 9, "playtime_forever": 1452, "playtime_last_two_weeks": 0, "last_played": 1509811950}, "language": "polish", "review": "Gra ma niesamowity potencjał pomimo ze jest w fazie wczesnego dostępu to już można cieszyć się z budowania naprawdę imponującej floty na dzień dzisiejszy nie ma limitu floty. Aspekt handlowy też został ujęty w ciekawy sposób można sobie zrobić flotę statków handlowych każdy zabiera od 1 do 2 kontenerów ładunku. Można wydobywać surowce, zdobywać bazy, budować platformy, toczyć bitwy solo jak i potężnymi formacjami. Masa statków ulepszeń do nich, jest tego tak dużo że ciężko mi to opisać. Pomimo wczesnego dostępu gra jest stabilna i wciągająca oraz zawiera przyjazną instrukcję a autor cały czas poprawia drobne niedoskonałości.Naprawdę warto! 10/10.", "timestamp_created": 1474838076, "timestamp_updated": 1474838076, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25695491": {"recommendationid": "25695491", "author": {"steamid": "76561198006591585", "num_games_owned": 398, "num_reviews": 71, "playtime_forever": 238, "playtime_last_two_weeks": 0, "last_played": 1514518489}, "language": "english", "review": "My rule of thumb with early access has become to not recommend anything based on \"potential\" that might or might not be fulfilled, but to look at it from a perspective of what is already there.\n\nVoid Destroyer, though in its early stages, has a solid gameplay formula that is quietly satisfying. Dogfighting bandits, collecting bounties and upgrading your ship can be quite fun. What makes this more fun to me than the usual space sandbox sim is the tactical interface which allows you to easily command huge fleets with the same ease as though it were an RTS. \n\nAt the moment there are a few non-game-breaking bugs to be sorted out (one of the cargo ships I was escorting trying to dock in a fighter hanger at a repair station for example), and not everything is in the game yet (a number of ship classes and models will be implemented later). Even if none of those things are fixed or added though, the game is very fun as it is right now.\n\nMy only complaint is that I liked the graphics of the original void destroyer a bit more. You're able to change the skybox from the weird neon blue but it's an upgrade to your ship you have to pay for, although it only costs a pittance in the game's currency.\n\nThis game does have a bit of a learning curve. Don't expect to just pick it up and be good at it. It will take you a few hours to get used to the controls and flight model, but if you are willing to put in the time, Void Destroyer 2 has a lot of fun to offer.", "timestamp_created": 1474820203, "timestamp_updated": 1474836770, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.538462", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25694379": {"recommendationid": "25694379", "author": {"steamid": "76561198139305168", "num_games_owned": 53, "num_reviews": 2, "playtime_forever": 1405, "playtime_last_two_weeks": 0, "last_played": 1479332372}, "language": "english", "review": "Void Destroyer 2 is a wonderful Sandbox leaving you with a lot of possible activities. It doesn't matter if you want to be a pirate, a trader, a bounty hunter or just a man who wants to make his own way between the stars...\nIt's all possible! \n\nThe special thing about this game is the unique mixture of real time strategy and first person combat. It gives the player the possibility to manage a gigantic fleet from large command vessels, but also fighting at the front line with ships of any size.\nThe game also features fleet managing mechanics like establishing trading routs and assign escort ships to the traders, with a lot of additional features planned for the upcoming patches. All this is supported by a trouble-free AI and a very unique art style giving a completely new experience to any dedicated sci-fi fan.", "timestamp_created": 1474816920, "timestamp_updated": 1474816920, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25693088": {"recommendationid": "25693088", "author": {"steamid": "76561198039082165", "num_games_owned": 700, "num_reviews": 13, "playtime_forever": 2818, "playtime_last_two_weeks": 0, "last_played": 1510925943}, "language": "english", "review": "An already great game that just keeps improving.\n\nAn active Dev that will accept your friend request and talk with you directly about any bugs or concerns you have with features in his game.\n\nWhat's not to like? Chaosavy, putting the Access back in Early Access.", "timestamp_created": 1474813057, "timestamp_updated": 1475216811, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.505781", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25685307": {"recommendationid": "25685307", "author": {"steamid": "76561197967165506", "num_games_owned": 29, "num_reviews": 2, "playtime_forever": 4460, "playtime_last_two_weeks": 10, "last_played": 1515363579}, "language": "english", "review": "Fun game once you realize how much you can do. It starts out slow, giving you one ship, and a few plain missions. After a few hours, you are defending bases against hordes of enemy ships and trying to keep your economy ships alive. At 30 hours I've defended my own patch of rocks long enough to get a frigate. I now have sights to take over the entire quad.  It plays similar to games like elite dangerous, but has a homeworld rts layer ontop of it. Looking forward to future updates.", "timestamp_created": 1474783451, "timestamp_updated": 1474783451, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "25684036": {"recommendationid": "25684036", "author": {"steamid": "76561198043250032", "num_games_owned": 1265, "num_reviews": 155, "playtime_forever": 430, "playtime_last_two_weeks": 0, "last_played": 1474737057}, "language": "english", "review": "[h1]Start with nothing, build an empire. [/h1]\n\nVoid Destroyer 2 is a space sandbox game (and the sequel to Void Destroyer) developed by Iteration 11, a one-man dev ‘team’. In Void Destroyer 2 (VD2) you start with nothing, in fact you start as nothing. Confused and disoriented you wake up in a small, fighter class with two men talking you through how to fly your ship, it acts as an introduction to the premise of the game as well as a tutorial. After completing this fairly short but useful tutorial section, you’re free to explore the sandbox doing as you please (within the game’s limitations of course). \n\nGetting around in VD2 requires the use of VD2’s ‘Overworld View’, it’s pretty similar to how the Mount & Blade games work. You have an overview of the whole map and you move around between spaceports and other points of interest using it. The reason you’ll want to use it is because Overworld View has Time Compression, in other words you’ll get around much quicker than just flying there normally. The Overworld View displays everything from ships (different classes of ships have different icons) to asteroid fields and of course it also displays all the different spaceports. The Overview View is only available if you’re a set distance away from certain objects, the distance away you need to be is usually related to the size of the object or how dangerous it is, for example a cleared out mine-field only requires you to be 1000 units away whereas you have to be 10,000 units away from hostile ships before you can enter Overworld View. You’re also pulled out of Overworld View when you get too close to an object.\n\nOutside of Overworld View most of your time will be spent actually controlling your ship (there’s also a tactical view which can be used to control your fleet). VD 2’s controls are good and all the ship handling felt good to me. There’s also a good amount of difference in handling between the different ships I’ve flown so far. How well a ship can maneuver during flight depends on how fast you’re going, your ship’s cruise speed or lower is the optimum speed to turn at as the correction rockets are able to manage your momentum in different directions so you keep going in the direction you’re actually facing. You can of course go faster than your cruise speed (as well as turn off auto-correction) but generally you’ll only want to do that if you’re trying to quickly leave or get to an area. \n\nAs with most space sandbox games, there are three main ways of earning money in VD2: trading, mining & completing jobs picked up from spaceports. From what I’ve seen so far, trading is the best way to earn large amounts of reasonably quickly (especially if you have fleet or hired ships, more on those later). Mining is fairly self-explanatory, I’ve never been a fan of mining in space sandboxes so I haven’t messed around with it too much though there are ways of having ships automatically mine for you. As for the jobs, there’s currently a decent variety of jobs available to you, ranging from simple courier jobs to escort missions and bounty hunting. Each spaceport offers different jobs to you, some of the jobs will require that you use a faction ship. Completing jobs (of a certain difficulty, the level of difficulty required depends on what your level already is) will increase your relationship with the faction. Some ships available to buy at spaceports require a certain faction level before you can buy them.\n\nThe main idea of the game is that you start with next to nothing and as you progress you become more powerful. You do this in two ways. The first, and most obvious way, is by purchasing increasingly better ships when the money becomes available to you. The other way is to purchase new ships (or use older ships you’ve upgraded out of) to create a personal fleet of ships, as it stands there is no maximum fleet capacity or any upkeep costs. If you can’t afford to buy ships but need some backup or extra cargo capacity, you can also hire ships. Hiring ships is pretty cheap right now and the way it works is that you pay a set fee for each ship you have hired (you can hire a maximum of three) each time you dock at a spaceport. Each spaceport has certain ships which are available for you to hire and you may not be able to find what you’re looking for at each spaceport. \n\nAs you’d expect with an Early Access games, there are some bugs. I’ve had a few crashes so far as well as some minor bugs where my ship spins out of control when colliding with something or having my ship change positions randomly when trying to enter Overworld View while targeting a moving object such as debris. There have also been some issues with the way the achievements have been set up but chaosavy (the dev’s Steam name) has been working on fixing that. Speaking of chaosavy, he’s super active in the Steam forums (in fact posting in the forum is the easiest way to get a hold of him) which is great to see, especially with an Early Access game.\n\nMy main issue with the game as it stands is that the trading side of things feels a bit unbalanced. When I started trading I had roughly 60,000 credits and through hiring ships and after figuring out a good trade route I was sitting on 600,000 credits. It took me an hour to get to that point. I don’t want it to be like it is in Elite Dangerous where you have to grind for tens of hours to afford what you want but I feel like the game would definitely benefit from it taking a tad longer to get the best ships. Alternatively, trading could be more difficult by having groups of wandering pirates who might attack you while you’re travelling. If this is already in the game, then I didn’t see any of them during said hour so I was able to go without upgrading my very basic ship.\n\nFurthermore, VD 2 felt a little bare to me in some areas. Not necessarily lacking content (though more job variety would be welcome) but it just didn’t feel like a lived in game-world at some points. For example, when travelling close to spaceports I never saw any ships coming in or out of the spaceports. It’s a relatively small detail, and at this stage it’s definitely not a priority, but I would like to see it addressed at some point down the line. Another improvement in this department would be more ships \n\n[h1]Verdict [/h1]\n\nVoid Destroyer 2 is off to a good start, it isn’t without issues and it can feel bare at times but it's still a very enjoyable edition to the space sandbox genre. It has a long way to go but due to how hard chaosavy/Iteration 11 has been working even since release to fix things and improve the game I’m confident that a good final product will be delivered.\n\n[i][url=http://steamcommunity.com/groups/lonerangerreviews]Lone Ranger Reviews.[/url][/i]\n\nEl K.", "timestamp_created": 1474776124, "timestamp_updated": 1474776274, "voted_up": true, "votes_up": 87, "votes_funny": 1, "weighted_vote_score": "0.805755", "comment_count": "5", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25683465": {"recommendationid": "25683465", "author": {"steamid": "76561197968438488", "num_games_owned": 113, "num_reviews": 2, "playtime_forever": 5605, "playtime_last_two_weeks": 0, "last_played": 1507760806}, "language": "english", "review": "Great game for early access, really fun engaging gameplay.\n\nA few good things that caught my eye so far:\n- awesome mix of RTS and space combat;\n- exciting dogfights;\n- the score and sound design set a great atmosphere;\n- ship and station models are beautifully crafted;\n- plenty of upgrades to tweak your personal fleet;\n- highly customizable controls;\n- much to do and much more to come with development;\n- great dev;\n- runs smooth as silk for me, not a single crash so far.\n\nYup, off to build my space empire.... hopefully the wife will understand my absence", "timestamp_created": 1474773047, "timestamp_updated": 1474773047, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25677879": {"recommendationid": "25677879", "author": {"steamid": "76561198048729780", "num_games_owned": 54, "num_reviews": 5, "playtime_forever": 633, "playtime_last_two_weeks": 0, "last_played": 1514279085}, "language": "english", "review": "This game was an instant buy for me and it has many of the features I wanted in a space  combat sandbox game. Excellent multiple controller support for HOTAS and joystick users,  easy to understand cockpit and interface, direct ship piloting from fighters to huge capital ships and freeform gameplay. I played a lot of space combat sandbox games my whole life that I enjoyed, the original Elite, the modern and excellent Oolite which I still play, Wing Commander Privateer, Freelancer, Evochron series and many others. Void Destroyer 2 did something right. This is a hybrid style of space combat sandbox with some features from the games I mentioned including RTS games. I myself am not a big fan of early access games but  I fully support the amazing talent of developer Chaosavy and his passion for my favorite PC genre of gaming, the space combat/trade/sandbox style.", "timestamp_created": 1474747518, "timestamp_updated": 1474747518, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25661283": {"recommendationid": "25661283", "author": {"steamid": "76561198049687779", "num_games_owned": 306, "num_reviews": 4, "playtime_forever": 1206, "playtime_last_two_weeks": 0, "last_played": 1484726589}, "language": "english", "review": "A space dogfighting/rts/x-alike sim all rolled up into one. You start out with a lowly ship that can run away really fast and not much more, going through the ranks of fighters, gunships, corvettes, and frigates, plus non-combat mining and cargo ships. There's much more to come, all the way up to carriers and dreadnoughts. The dev is extremely responsive on the forums, most topics get replied to within minutes all throughout the day, the only exception being the times he's asleep (Not much). He's also completed completed an early access game before, so you don't have to worry about him taking the money and running.", "timestamp_created": 1474681887, "timestamp_updated": 1474681887, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.543568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25657489": {"recommendationid": "25657489", "author": {"steamid": "76561198136579557", "num_games_owned": 53, "num_reviews": 5, "playtime_forever": 5739, "playtime_last_two_weeks": 0, "last_played": 1512016527}, "language": "english", "review": "Hello i've got over 30 hours gameplay and this game is amazing.And it's only in early access. It's everything a space sim fan from the homeworld games would want with a little M&B like Torbes 3186 said. The amount of things you can do in its early stages is awesome and just shows what to expect as this game develops more into a full finished product. I myself have become a bounty hunting king. Also got tired of that for a little bit so i switched to make a mining enterprise. after a few days ingame and a couple of small fleets later. I am now a multi million dollar mining tycoon in the game. But just the fact that you start from a simple fighter. and can work you way up to big capitol size ships. make a massive fleet control sections of space. pirate yourself if it strikes your fancy. Or protect your investments from those pesky pirate stubs yourself. the options are truly amazing. \n\nrecommend to any and all.", "timestamp_created": 1474663764, "timestamp_updated": 1474663764, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.489188", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25651351": {"recommendationid": "25651351", "author": {"steamid": "76561198152360372", "num_games_owned": 88, "num_reviews": 60, "playtime_forever": 176, "playtime_last_two_weeks": 0, "last_played": 1474862720}, "language": "english", "review": "Great art style. Has a [Edit]cell feel[/Edit   By Cell Feel... I mean the look] . flight is smooth and lots of options. UI looks great and there is no clutter. Keyboard mapping is great. The price is super humble. Dev is super nice. Fun to play. This is a cool sandbox space sim that has a fresh feel.", "timestamp_created": 1474641270, "timestamp_updated": 1492533485, "voted_up": true, "votes_up": 17, "votes_funny": 1, "weighted_vote_score": "0.587817", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25650380": {"recommendationid": "25650380", "author": {"steamid": "76561198205152977", "num_games_owned": 25, "num_reviews": 8, "playtime_forever": 2122, "playtime_last_two_weeks": 0, "last_played": 1475610180}, "language": "english", "review": "Well, will I recommend this game?? Of course, recommended... Why?? it looks like a promising mix between, RTS and space ship simulation..I mean, in this game you can direcly fly in ship and lead your fleet into a battle, or you can take tactical view, and as a general, look from above and let your mens fight for your honour...\n\nFor now, the game is in a state of a solid sandbox not soo big for now, but there is a plenty things to do, for now (first release in a early  acces), you can choose from a something around 30 ship (I dont count pirate faction they had their own ships and their own missions).. so far, looks great, and a lot of a new contest are planned (base building and capturing, more ships, more factions, trading routes atc...).. I also really like (maybe even love :)) the cartoon-like art style of this game... Highly recommended :)", "timestamp_created": 1474637289, "timestamp_updated": 1474646061, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.489188", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25645074": {"recommendationid": "25645074", "author": {"steamid": "76561197971872842", "num_games_owned": 327, "num_reviews": 67, "playtime_forever": 12163, "playtime_last_two_weeks": 0, "last_played": 1505526022}, "language": "english", "review": "All the mercenary fun of Freelancer's universe-trotting for cash mixed with Warband's real time tactical combat.  If the early access label is making you nervous, don't be.  Iteration 11 is one of the most active, responsive game devs I've ever seen.  Posts in the community hub get an intelligent response within hours, patches happen weekly or faster.\n\nIf you still have any doubts, check out Void Destroyer 1 which knocked it out of the park.", "timestamp_created": 1474602796, "timestamp_updated": 1474602796, "voted_up": true, "votes_up": 20, "votes_funny": 1, "weighted_vote_score": "0.559865", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25644443": {"recommendationid": "25644443", "author": {"steamid": "76561198303983519", "num_games_owned": 30, "num_reviews": 1, "playtime_forever": 269, "playtime_last_two_weeks": 0, "last_played": 1481785489}, "language": "english", "review": "From what I've played, this game has incredible potential! I will definently be sinking some time into this!!!!!!!", "timestamp_created": 1474598232, "timestamp_updated": 1474598232, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.456151", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25642687": {"recommendationid": "25642687", "author": {"steamid": "76561198071333591", "num_games_owned": 82, "num_reviews": 3, "playtime_forever": 10822, "playtime_last_two_weeks": 0, "last_played": 1513894069}, "language": "german", "review": "hammer geiles spiel !", "timestamp_created": 1474586192, "timestamp_updated": 1474586192, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.469599", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25641230": {"recommendationid": "25641230", "author": {"steamid": "76561198009197589", "num_games_owned": 228, "num_reviews": 8, "playtime_forever": 2436, "playtime_last_two_weeks": 0, "last_played": 1498089408}, "language": "english", "review": "Void Destroyer 2 is excellent, well optimized, runs smooth, and most importantly is a ton of fun. It more than exceeds the bar for an early access title and I, like others, am super hyped for its continued development. Chaosavy is an awesome, extremely active dev that listens to his playerbase. Example: Some people didn't like the blue skybox, so he added more! So many pretty colors.\n\nNow what's in the game right now? A solid tight sandbox, it's not giant but there's plenty to do. Think M&B Warband overworld style map. You start off as a fighter, can do courier, escort, bounty hunting, piracy, base and platform defense, platform destruction, hire or purchase trading and mining ships, automate ships, purchase and choose from about 30 ships (not including pirates) from light fighters to frigates and upgrade them. You could even technically do noncombat and fly around in a repair ship just helping your own fleets or NPC's. All at a smooth 60 FPS with no jitters and what is really a blast dogfighting.\n\nReally outside of more content, which is planned, like blueprints for cruiser, capital, dreadnought ships, base capturing and management, market events for dynamic trading, more missions, more UI polish, there is at least 30 hours of great content just doing \"law-abiding\" stuff alone. And perhaps most important, a dev that cares and listens to the community.\n\nPerfect for first day early access, could be at the top of the genre in 6 months.", "timestamp_created": 1474577726, "timestamp_updated": 1474577726, "voted_up": true, "votes_up": 48, "votes_funny": 5, "weighted_vote_score": "0.765628", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "39594644": {"recommendationid": "39594644", "author": {"steamid": "76561198256572359", "num_games_owned": 72, "num_reviews": 10, "playtime_forever": 162, "playtime_last_two_weeks": 152, "last_played": 1516769976}, "language": "english", "review": "I had to put this game a downvote for now. Brought it for a year, nothing change eversince. \n1/ The UI is still bad, everytime I got intercept by pirates I don't know where they are unless I open tactical  mode, which when I see them and switch back to manual flight mode, my mouse cursor isn't in manouver mode result that I have to switch mode again, resulting that I am always get hit first. And navigating on the world map is such a pain.\n\n2/ The first ship you got, is suppose to be a \"trash\" ship. The game said that nobody care about it. Just an ultility ship for mining. Yet it get access to more upgrades than decent lightcrafts only get access to main weapon enhancement, booster and light armor. I sell the mining ships to buy a light fighters which the game described as a high grade fighterm yet while the mining ships has upgrade of auto turrets, shield generator, the new fighter has nothing but slightly better hp (meant nothing compare to the shield generator), speed (that is all it good for), and railgun (auto turrets is better since it can predict AI flight algorithm and do constant damage as long as they are insight and tell you when something is on your tail), and the upgrade pool comprised of useless stuffs. Totally kill the feeling of progression.\n\n3/ You are not even starting out as the weak one like in the trailer. If you see my 2nd point, your first ship is op, the shield generator and auto turrets is very cheap and you can get one after doing 2 or 3 missions. All you need is doing the flight simulator (which acts as the optional tutorial) once and know the basic control and the AI pirate will never be able to hit you, get shield generator and the auto turrets and you can grind straight for a freighter and ignore other ships.\n\n4/ The hyperspace mechanic need to be fix or optimized, or at least the combat response mechanic should. In an escort mission the cargo ship I had to protect got intercepted by pirates and I have to switch from world views to flight mode to response. Somehow I still in hyperspace speed, and I have to both reduce the standard speed from 3000ms to 180ms while turn around to prepare for combat (since I was riding the the new fighter without that shield generator I can't afford to take first hit). The result that my craft spin around like crazy and crash the game. \nAnd the I should be the one decide which route the cargo ship should take. The mission was stupid, the cargo ship stay from the straight path to the destination and drift straight toward the pirate ships. I am ok with conspiracy theory that the cargo ship weird pathing was an inside job, but it felt like the game just throw random shits at me.", "timestamp_created": 1516845568, "timestamp_updated": 1516846555, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1516889745, "developer_response": "If you are curious about updates here is the change log - http://steamcommunity.com/app/369530/discussions/4/358415738185478845/ - I hope that you can clearly see that the game is very frequently updated - at least weekly (every date entry is a update).\n\nMajor updates are listed here - http://steamcommunity.com/games/369530/announcements/ - including development videos.\n\nIf you'd like to discuss some of the issues you are having - the best place is on the main forums. I think that via some back and forth we could have the game make more sense to you or I could receive valuable feedback.\n\nIf you think that the first ship is OP due to the defense turret... wait till you fly a ship with main guns as turrets. \n\nThe first ship does indeed have a very powerful secondary weapon - that was intended to give skilled players an edge in starting out."}, "39567229": {"recommendationid": "39567229", "author": {"steamid": "76561198055104006", "num_games_owned": 392, "num_reviews": 5, "playtime_forever": 432, "playtime_last_two_weeks": 432, "last_played": 1516759168}, "language": "english", "review": "This was a suprising find, especially from a one man development team. This review is coming from someone who avidly place space sims, from Elite to the X series. \n\nOn that note, I'd like to warn people new to this genre that the mechanics won't be the easiest to pick up on at first. The tutorials will get the controls across to you, but you're left to figure out game mechanics yourself.\nOn the flip side of the coin, if you're used to space sims you'll adjust quickly.\n\nVD2's most outstanding feature from other space sims is it's seamless transitions from sitting in the cockpit of a fighter to commading a fleet in a way reminiscent of Homeworld. Accompanying that is your standard fare that makes a space sim a space sim: Dynamic economy and space explosions.\n\nIf you're a space sim vet that's looking for something new, this should be a no brainer to get. If you're new the genre and looking to get into it, I'd recommend searching up some videos to see if it's for you.", "timestamp_created": 1516743311, "timestamp_updated": 1516743311, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 140, "total_negative": 11, "total_reviews": 151}}
