{"query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 50, "total_negative": 0, "total_reviews": 50}, "reviews": {"38676417": {"recommendationid": "38676417", "author": {"steamid": "76561198008053598", "num_games_owned": 728, "num_reviews": 5, "playtime_forever": 506, "playtime_last_two_weeks": 506, "last_played": 1514243670}, "language": "english", "review": "Helium Rain is very fun until you get to war. The trading and colonizing aspects of this game are incredibly fun but literally everything you do in combat removes score from all the other factions reputation. One battle and you trash all the work you've done. This leads to a downward spiral of constantly being a target for war because you are so hated by everyone. You either lose everything you have to people with more resources than you can even try to get, or you pay a large sum of money to get them off your back for a week. I enjoyed every minute of it until I had my first war for the above reasons. After that first war, all of my positve rep was turned to -100 and the number #1 rated company with literal access to a shipyard was after me. It was incredibly frustrating to have this happen and I don't think I'll play another game of this for a while. And when I do, I will avoid conflict like the plague.", "timestamp_created": 1514244065, "timestamp_updated": 1514244065, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38489579": {"recommendationid": "38489579", "author": {"steamid": "76561198091698832", "num_games_owned": 239, "num_reviews": 12, "playtime_forever": 152, "playtime_last_two_weeks": 0, "last_played": 1512273314}, "language": "english", "review": "Helium Rain is not a bad game, but it does have some things that are just a kill for me. The main one is traveling between systems. Rather than doing the traveling yourself, you simply set your destination and hit a button to simulate time that has passed to get to your new destination. So, to me, it feels like you're just playing in different rooms. No feeling of distance, or traveling. When it comes to space games, you're talking distance and traveling. The way this is set up, it just feels wrong. \n\nSome of the missions just make no sense. In the real world, today, you wouldn't give a stranger a ride to the store just so you can get some reputation increase from him. Well in this game some of the missions will reward you with research or reputation gain. Please correct me if I'm wrong, that is just how i seen it while in game. Yes, many missions do reward you with monetary rewards, and some would argue that the research rewards can be worth it as well. fair enough.  Still, if I was creating a business, the last thing i would want to do is give a free ride to someone who will feel better about me by doing so. \n\nThat really is my big gripe with the game. It has many good things as well. Trading feels rewarding, ship movement does not have speed restrictions, it really feels like you are navigating in space.  Granted, this is only in each sector. Not sector to sector travel. Again that is obtained by simply skiping time into the magical future. \n\nSo I'm nuetral about this game. If i could give a neutral rating i would, but with steam it's always a Go, No Go situation. \n\nI have hopes for the future of this game. I have enjoyed it somewhat for the few hours I have played and hope the devs continue to develop this into what could be one of the greats.", "timestamp_created": 1513862642, "timestamp_updated": 1513862642, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.464135", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38345055": {"recommendationid": "38345055", "author": {"steamid": "76561197984801272", "num_games_owned": 409, "num_reviews": 25, "playtime_forever": 51, "playtime_last_two_weeks": 0, "last_played": 1513415026}, "language": "french", "review": "Vous aimez la série Télé \"The Expanse\"? Vous ne comptez plus les heures de votre vie passées sur les jeux \"X\" ou sur Elite Dangerous? \nHelium Rain reprend les codes du genre, mais sans le côté SF Star Wars ou Star Trek (les vaisseaux sont réalistes dans leur conception).\nParfois décourageant car des actions mal pensées vous condamneront sur le long terme ou changeront la donne brutalement (mais ça vous force à réfléchir sur la durée). \nLe jeu reste un véritable régal stratégique et de simulation.\n\nA conseiller à tous les fans de SF.", "timestamp_created": 1513414978, "timestamp_updated": 1513414978, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "38081207": {"recommendationid": "38081207", "author": {"steamid": "76561198304504085", "num_games_owned": 193, "num_reviews": 68, "playtime_forever": 1797, "playtime_last_two_weeks": 0, "last_played": 1512479655}, "language": "schinese", "review": "2017/12/5 - Early access\n\nA DLC for Soundtrack, Please :-)\n\n玩了30h，基本上把这款游戏的内容给摸清了……感觉可以写一个评论了……\n目前虽然没有在所有公司里排上#1，不过到#1也只是时间问题。\n\n游戏的背景比较简单，讲的是在不远的将来人类发现了一颗距离地球只有二十几光年的气态巨星。\n而这个气态巨星的卫星似乎能支持生命的存在。\n于是人类就发射了一艘装满了各种设备和技术人员的远征飞船去探索这颗气态巨星。\n然而当探索者们到达目的地时，才发现这颗气态巨星的卫星没有一颗是能够支撑生命的，全部都是荒凉的小行星。\n但是既然已经到达这里了，各种研究和开采工作也就陆续展开。\n在这个过程中，分裂产生了。一部分人想回到地球，于是抢夺了最开始的那艘远征飞船，尝试将那艘飞船开走。\n战争随之而爆发，而那艘远征飞船也在战争之中毁于一旦。\n于是这群先驱者再也回不了家了……\n\n嗯……稍微有点X3的既视感……\n\n其实在玩这款游戏的时候也总是会忍不住拿它和X3相比……\n\n因为这款游戏和X3确实有相似之处：\n * 玩家可以驾驶小到穿梭机，大到有9门炮台的战舰\n * 玩家可以建立商路，购买船只来跑商，可以挂机赚钱\n * 玩家可以建立自己的各种空间站，从矿场、太阳能发电站到造船厂和空间站Complex\n * 存在除了玩家之外的各种势力，玩家可以向其他势力宣战，带着自己的舰队去狠狠地打一架\n\n当然，这一切都要比X3中对应的内容简略很多……\n * 种族只有人类一个\n * “星区”数量只有十几个\n * 飞船种类较少，详细的性能参数也比较模糊\n * 飞船设备 <=> 金钱，不存在设备的生产过程，只要有钱，一艘飞船能够在任何时候换成任何装备\n * OoS完全变成了以“天”为单位的回合制，各种自动化和远程的操作也是以“天”为单位进行的\n\n就“种族数量”和“星区数量”而言，虽然目前仍然是EA，不过以这款游戏的背景来看的话，估计往后也不会有太大的变化了……\n\n飞船种类和各种装备以后应该还会继续完善。\n\n关于最后一点：\n很重要的一点。\n这款游戏抛却前期过程和玩家亲自带领舰队参与战斗的部分，其余基本上都是回合制了= =\n可以说回合制占了这款游戏非常大的比重，而且还基本上是文字类型的回合制……\n套用其他人的评论：“The game feels almost half like an Information terminal sometimes.”（有时这款游戏几乎会给人一种像半个信息终端的感觉）\n在整个游戏的过程中，占用玩家屏幕时间最长的界面不是驾驶界面，而是Orbit Map、Sector Map和Fleets界面……\n玩家可以在Orbit Map界面的右上角点击Skip a day去结束一个回合，或者点击Fast forward让电脑自动帮你执行一个又一个的回合直到某件重要的事情发生。\n\n而一个回合就是“一天”。。\n\n另外这款游戏没有星门，所以连通各个星区的是玩家自己的亚光速引擎。\n因此从一个星区到另一个星区要花上数天时间，也就是数个回合= =\n\n这种偏向于回合制的游戏性，不能说好也不能说差吧，但是喜不喜欢可能就因人而异了。\n那些认为这款游戏就是一款小型X3的朋友可能需要一些心理准备……\n我个人认为这应该也是它和X3之间最大的不同点了……\n\n当然，这款游戏优秀的地方有很多，尤其是对太空的氛围的营造。\n\n在进行游戏的时候，你的耳机里只会有下面这几类声音：\n1.BGM（风格和NASA的《Symphonies Of The Planets》差不多）\n2.自己飞船的引擎声\n3.自己的飞船在开火时火炮的声音\n4.敌方炮弹击中自己正在驾驶的飞船的外壳时的爆炸声\n5.点击按钮时的反馈声音，以及各种系统的提示音\n\n你的耳机里不会有：\n1.其他飞船的引擎声\n2.其他飞船开火时的声音\n3.语音\n\n正如开发者所说，这是一款“太空歌剧”类型的游戏……\n或许也就因此丢掉了许多在其他同类游戏中很常见的东西吧。\n不过我认为这也是这款游戏出色和与众不同的地方。\n\n此外，这款游戏的内容比X3要简单很多，也很适合作为同类游戏的入门作。\n\n最后，这款游戏的风景也很漂亮。\n真的很漂亮。\n\n-----补：关于这款游戏的名字\n\n乍一看，“氦雨”这个名字挺文艺的，但实际上这也是一个很“科学”的名字。\n\n氦雨实际上是一种天文现象。\n\n以下摘自百度百科：\n“氦雨，在土星、木星等大体积巨型行星上存在的天文现象，是由液态的氦组成。\n在试验中证实，随着压力的不断上升，土星上原本混合在一起的氦和氢会逐渐发生分离。在此过程中，液态的氦会凝结成液滴并开始向土星表面下落，形成所谓的“氦雨”现象。当然，准确地说应该是向土星的中心方向下落，因为土星和木星均为气态行星，并没有我们平常所说的固态表面。在这些气态行星上的大气运动均应看作是在行星内部发生的运动。”", "timestamp_created": 1512485808, "timestamp_updated": 1512487109, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37946916": {"recommendationid": "37946916", "author": {"steamid": "76561198077514631", "num_games_owned": 326, "num_reviews": 6, "playtime_forever": 2368, "playtime_last_two_weeks": 0, "last_played": 1504474341}, "language": "english", "review": "Buy it! Just do it!", "timestamp_created": 1512026297, "timestamp_updated": 1512026297, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.456341", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37717937": {"recommendationid": "37717937", "author": {"steamid": "76561198077583212", "num_games_owned": 106, "num_reviews": 4, "playtime_forever": 1383, "playtime_last_two_weeks": 0, "last_played": 1512624191}, "language": "english", "review": "Helium Rain is a must-play Space Economy Sim for fans of the genre. If you enjoyed X³, Elite:Dangerous or EVE Online, or if you just wanted to build your own industrial empire in space, I’d highly recommend you give Helium Rain a try.\n\n[h1]What do I get to do in this game?[/h1]\n\nYou start out in a scrappy little shuttle, hopping from station to station, flying with 6DoF and Newtonian flight physics, and spinning and lining up your ship to perform docking manoeuvres. For those of you who prefer more economics and less flying, Autopilot and Auto-dock are also available.\n\nYou’ll work your way up towards purchasing freighters and building a trading fleet, making money hauling goods from A to B. As you buy low and sell high to corner the market, you’ll amass enough wealth to start building your mines and factories of your own, cutting your competitors out of the market.\n\nBut beware! Pirates and less scrupulous corporations won’t stand by watching idly. You’ll have to invest in your own defense fleet to escort your haulers and protect your assets from the greedy paws of others who are after your hard earned coin.\n\n[h1]Pros:[/h1][list]\n[*][b]Economic simulation:[/b] every good and asset in game is produced by a factory, supplied with goods produced elsewhere. \n\n[*][b]Fleets:[/b] the game is built around the player owning multiple fleets spread across the system. You can choose to micromanage or set up preset trading routes\n\n[*][b]Flight model:[/b] No speed limits: you can accelerate as much as you want, just remember that you’ll need to decelerate unless you want to overshoot your target and drift into space. At your disposal are forward/backward thrust, pitching, yawing, rolling, and lateral/longitudinal strafing.\n\n[*][b]Dev feedback:[/b] The game is actively being worked on and the developers regularly provide feedback both on here and on the game’s website.\n\n[*][b]Graphics:[/b] The game has a beautifully polished aesthetic going for it. It adds a lot of character that really make it stand out from the crowd.[/list]\n\n[h1]Cons:[/h1] [i]Not so much cons, but features that still need a bit of dev love before the game leaves Early Access:[/i] [list]\n[*][b]User Interface[/b] has a few niggles here and there that begin to manifest in the mid to late game when you have large amounts of assets to keep track of. Especially noticeable is the lack of a Journal recording your cash flow.\n\n[*][b]AI corporations[/b] feel like they lack differentiation. Shipyards will gladly take orders to build fighters for pirates, only to the summarily attacked by them. Peaceful corporations seem to just turtle and amass wealth.\n\n[*][b]Simulation speed[/b] begins to slowdown in the end game due to corporations expanding without enough resistance.[/list]\n\n[h1]Conclusion[/h1]\n\nPersonally, I am a dozen hours into my first playthrough in the first 2 days of buying the game. I’ll still play Elite:Dangerous for the combat, atmosphere and immersion of the spaceships, and EVE Online has its niche as the MMO for space economies, but Helium Rain has established itself as my go-to option for single-player spaceship economy tycoon empire building.", "timestamp_created": 1511729373, "timestamp_updated": 1511729573, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.594470", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37516974": {"recommendationid": "37516974", "author": {"steamid": "76561198071611456", "num_games_owned": 91, "num_reviews": 11, "playtime_forever": 2418, "playtime_last_two_weeks": 535, "last_played": 1514673392}, "language": "english", "review": "Have you watched the TV series called \"The Expanse\"? Have you ever wanted the game in similar setting? Search no longer - Helium Rain is what you need!\nThis game cointain technology and designs that are very close that that theme (aka plausible close future tech - so no hyperdrives, no shields and no Star Wars pew pew pew lasers).\n\nIt also gives very good \"early colonization of remote star system\" wibe.\nThe trading, station building, military oeprations - everything is on good and deep quality (casuals beware!)\n\n\nDon't let the \"Early Acess tag\" fool you. In current state the game offer plenty of good and stable gameplay.\n\nPros:\n- simple, but great ships and station designs (sphere shipyard in Blue Heart is my favorite)\n- well ballanced trade and economy\n- well designed star system\n- ability to own your own ships, stations, shipyards.\n- good price to content ratio - it's a money well spent!\n- simple but working faction diplomacy\n- research tree\n\nCons:\n- manual docking is hardcore (but you can easily research auto-dock function)\n- the entire Star System is a bit small - needs several more planets and moons and locations\n- GUI can be a bit chaotic at first it also sometimes doesnt show you the information you need (e.g. station build descriptions doesn't tell you what resources station need/produce)\n- sometimes other factions goes bancrupt which makes their stations not producing anymore coz they can't buy resources.\n- stations doesn't change visually when you upgrade them.\n- research tree could be a bit bigger and the \"progressive research costs\" should be removed - this smells to much like the abusive sysyem of mobile games.", "timestamp_created": 1511614000, "timestamp_updated": 1511614000, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.557854", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36480581": {"recommendationid": "36480581", "author": {"steamid": "76561197971040782", "num_games_owned": 460, "num_reviews": 89, "playtime_forever": 1262, "playtime_last_two_weeks": 34, "last_played": 1514663522}, "language": "english", "review": "If you like the X series this is a must for your library of space economy sims. \nDon't get discouraged at the small amount of planets you can venture out to as more of the map opens as you complete trade runs and deliveries.  This game has a technology tree, multiple merchant and fighter ships to setup trade routes, increase your profits, or protect or stations, or if you chose eliminate the completion through war. , I find it nice that I can fly my ship while the rest of my small fleet is out running my trade routes.   Keep an eye on them or they will drain your funds down.  Its not complete micro manage but it does require a bit of checking in on from time to time.   I had no issues running on fantastic settings and no crashes during my game play so far. \nA completely new take on the space trading genre, yes there are bugs and some typo's but it is early access, and it has MODDING support coming!! ", "timestamp_created": 1510525191, "timestamp_updated": 1510525191, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.566298", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35997131": {"recommendationid": "35997131", "author": {"steamid": "76561198022271611", "num_games_owned": 97, "num_reviews": 25, "playtime_forever": 473, "playtime_last_two_weeks": 0, "last_played": 1508977590}, "language": "koreana", "review": "X3의 재밌는 부분만 쏙쏙 골라서 압축시킨 듯한 작품이다.\n얼리엑세스임에도 상당히 발전해있으며 때때로 일어나는 크래쉬나 오류를 제외하면 게임을 진행하는데 큰 어려움이 없다\n\n다만 전투는 약간 조정이 필요할 것 같다.\n맞추긴 어려운데 AI 에이밍 솜씨를 좋게 설정해놔서 전투기로 싸워 이기기가 쉽지 않다.\n함대를 편성해서 알아서 싸우게 하는게 더 쉽게 이기는 길이다.\n\n이 게임의 핵심인 무역은, 이것저것 만들고 짜는 재미는 있으나\n아쉽게도 플레이어를 견제할 세력이 없어 긴장감이 부족하다.\n그나마 긴장할만한 부분이 있다면 때떄로 메테오 스윔이 나타나\n아군 기지를 박살내는 것 정도일 것이다.\n\n위에서 언급한 2가지를 제외하면 거의 모든 시스템이 X3보다 낫다.\n", "timestamp_created": 1508963576, "timestamp_updated": 1508963576, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35906701": {"recommendationid": "35906701", "author": {"steamid": "76561197976900544", "num_games_owned": 384, "num_reviews": 25, "playtime_forever": 444, "playtime_last_two_weeks": 0, "last_played": 1505976163}, "language": "english", "review": "Posting a very simple Thumbs up as Helium Rain goes through its Early Access phase.\n\nGame has a ton of great ideas that are ocming together nicely, reminds me of X series games with not as big a time sink (This is a good thing for people like myself who work, family and play).\n\nIf your a fan of the X Series games, I recommend grabbing Helium Rain in Early Access since it be most likely cheaper currently, as the Dev's are heading in the right direction with it.\n\nOnce we see a few more updates and I sink a good 20+ more hours or so into it, will give a more proper review of the game. But the Dev's seem to be switched on, and that is half the battle won already.\n", "timestamp_created": 1508634079, "timestamp_updated": 1508634079, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.560657", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "35894971": {"recommendationid": "35894971", "author": {"steamid": "76561198171355771", "num_games_owned": 149, "num_reviews": 11, "playtime_forever": 3146, "playtime_last_two_weeks": 40, "last_played": 1514581151}, "language": "german", "review": "Actually two different games, depending which option for docking you choose.\n With manual docking HR is basically a docking simulator. You will spend a lot of time aligning your ship, bumping into stations and repairing the resulting damage. Recommendable for nitpickers and Elite Dangerous fans.\n For rogues, Space cowboys and megalomaniacs there´s the autodock-option. You don´t have to care about maneuvering and can concentrate on getting filthy rich and dominating the universe. In this mode HR appeals to X and Evochron-lovers.\n It´s obviously a matter of personal taste how you play the game. I docked manually for about 2 hours and sincerely hated the game.But I absolutely love it with autodocking, I played for 5 hours and already own trade routes, stations and military assets. So my very own personal rating is: Manual docking: 0,5/10. Atodocking 8/10.\n Very special graphics style. Ships and stations don´t look high-tech, much more like bathyspheres and art deco. Bioshock in space, very nice.\n And two thumbs up for the dev. Very responsive. Keep up the good work.", "timestamp_created": 1508600821, "timestamp_updated": 1508600821, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501217", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35882718": {"recommendationid": "35882718", "author": {"steamid": "76561197990257787", "num_games_owned": 671, "num_reviews": 8, "playtime_forever": 362, "playtime_last_two_weeks": 0, "last_played": 1510129049}, "language": "english", "review": "Thanks for releasing the source code for your game! It is awesome to see how your slate implementations work in action, and reading the source and looking at how you implemented your menus and ui have helped me make steep progress in learning to use slate. tyvm :D", "timestamp_created": 1508567822, "timestamp_updated": 1508567822, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.586540", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35762363": {"recommendationid": "35762363", "author": {"steamid": "76561197971983383", "num_games_owned": 143, "num_reviews": 3, "playtime_forever": 4040, "playtime_last_two_weeks": 0, "last_played": 1513552796}, "language": "english", "review": "Christ Roberts should give Deimos Games half his millions.\n\nThe game is fantastic. Don't get discouraged by the grinding in early game, it gets much more complex and diversified as soon as you get a fleet. There will definitely be some hauling to get through first, but manual docking takes only 10 seconds once you're used to it and seeing your progress in that task will make it very rewarding, even without a HOTAS. Or you can buy an autodocking technology to make it as easy as a click, but in my opinion, it just lowers the potential and depth of the game; if you're into space simulations and piloting, then no need to make money faster by doing more trips thanks to the autodocking, it's not a competitive multiplayer game, take your time and play each trip. Hauling is more fun in HR than in Elite from my perspective, and fortunately it won't be your main task for weeks.\n\nAt the beginning, after a few hours, I thought myself that this game was beautiful and felt great, but unfortunately was going to be repetitive and lack content. I'm happy to say it proved me wrong (but the game can definitely use more content of course), however it all depends on how you play and how you expand your colony, it's possible that the game could evolve in more or less interestings ways depending on your actions.\n\nAs soon as you get a fleet, it is much easier to make money since you can specialize a ship into trading (and the trading routes system is complex enough, I was expecting something much simpler, very good surprise here), or start using fighter ships with contracts that tend to pay better rewards. Overall, the money/docking ratio increases quite fast as soon as your fleet and company build up, and the diversity of the gameplay as well.\n\nThe UI looks great and is actually convenient once you mastered it, but it takes some getting used to. A few more hints on where to find specific functions would help sometimes, it's not always obvious that the warning about missing components for building a ship would be in the orbital map for instance, or that you'd have to go check the shipyard in its sector screen to know what is missing, I was initially just looking into my Company screen to check the status of the ship I ordered. More filters in the Economy screen, and a way to show which stations buy what in that same screen would be useful, as well as a Search field for specific ressources in the Sector screen. But all that is really rather minor, the UI is already nice to use and feels a lot less crippled than Elite's sy-fy/immersive UI for instance.\n\nSo if the beginning of the game looks repetitive and boring to you, try to hang on, it gets better and the game has a great potential. I have played or backed many space sims, from KSP to Elite: Dangerous, Star Citizen or Rogue System (very recommended if you are into hardcore DCS-like sims). KSP is a jewel, but is admittedly quite a different game. Helium Rain is the game I didn't see coming, and yet it's the single best space opera I've played so far. Beautiful, several things to do, good flight models that feels just right, real physics (no cap on velocity as long as you keep burning; only saw it in KSP and Rogue System so far), deep if you care about the company system, real sandbox with an impact on the world, and I have to add that the orchestral music is beautiful and fits perfectly the pleasant ambiance of the game. Playing this game feels like watching [i]2001: A space odyssey[/i]; not that the music or assets are similar, but your brain and eyes will feel the same.\n\nIf you are into space sims and not necessarily intense shooters with fancy effects everywhere, you will like it (even the fights are nice, much calmer than fights in other space games, and it's not a bad thing). If you're into intense shooters, think twice, but give it a try, you may like what you'll see. If you're into trading, you may like it, but you will have to go through some piloting first. In any case, don't expect an AAA game with 52 billions stars or a mix of FPS/Fight/Exploration and 160M funding, but do expect a game beautifully made with a great attention to the details. The game is not expensive and is well worth that price, or more. The team have opened their source code, have a public bug tracker (with visible progress), communication is great, and their first game is good, it's encouraging to see development going this way.\n\nThere is a minor bug in the current build with UE4 on Linux with AMD mesa drivers, basically there's no bright sunlights on my computer. Sad. And then, looking at screenshots and videos, I realized I much prefer the game this way, looks more realistic and just more \"space\" when the bright anodized paints are more subtle in the shade. Now I'm not sure I want the bug to be fixed!", "timestamp_created": 1508116755, "timestamp_updated": 1508142522, "voted_up": true, "votes_up": 21, "votes_funny": 2, "weighted_vote_score": "0.717404", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35567812": {"recommendationid": "35567812", "author": {"steamid": "76561198406047691", "num_games_owned": 12, "num_reviews": 1, "playtime_forever": 526, "playtime_last_two_weeks": 0, "last_played": 1507622409}, "language": "english", "review": "This is my first space / X game ever, and i am absolutely in love with it. Ive been on the discussion forums and the Game-Dev is extremely helpful and is very active in listening to the voices of the playerbase to make the Helium Rain game experience more wonderful.\nThe game looks more than great (detailed), controls work great, gameplay is great ... like i said, I'm in love 😉 \nI will update my review after more hours into it. Have fun guys ♡", "timestamp_created": 1507456024, "timestamp_updated": 1507459383, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.502071", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35522700": {"recommendationid": "35522700", "author": {"steamid": "76561197974388384", "num_games_owned": 320, "num_reviews": 4, "playtime_forever": 1054, "playtime_last_two_weeks": 0, "last_played": 1513093231}, "language": "english", "review": "This is a great space sim/trading game with a nice look and feel. Beautiful graphics and simplified controls make getting into it a breeze. The fun starts right away after an excellent tutorial. Still a bit light on overall story and atmosphere but this is definitely one to watch. This will most likely be a must-have for all veteran space game junkies.", "timestamp_created": 1507308089, "timestamp_updated": 1507308089, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.545961", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35243548": {"recommendationid": "35243548", "author": {"steamid": "76561198047826057", "num_games_owned": 63, "num_reviews": 2, "playtime_forever": 2181, "playtime_last_two_weeks": 0, "last_played": 1506103551}, "language": "english", "review": "Love it", "timestamp_created": 1506525297, "timestamp_updated": 1506525297, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.369937", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34979025": {"recommendationid": "34979025", "author": {"steamid": "76561198039217047", "num_games_owned": 601, "num_reviews": 8, "playtime_forever": 75, "playtime_last_two_weeks": 0, "last_played": 1513392856}, "language": "english", "review": "Good flight model, game play is smooth..  Looking forward to seeing where the DEV takes this game!  Right now, I would defnitely recommend supporting it!\n\nOne note:  DEV needs to add HOTAS controller support.. and later, Tobii 4c support too!", "timestamp_created": 1505502094, "timestamp_updated": 1505502094, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.544896", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34801696": {"recommendationid": "34801696", "author": {"steamid": "76561198086987946", "num_games_owned": 206, "num_reviews": 43, "playtime_forever": 416, "playtime_last_two_weeks": 0, "last_played": 1505065401}, "language": "english", "review": "After having played it for about 7 hours as of making this post and having reached late-game content I think I can now comment on the games Pros and Cons in my own oppinion.\n\nPros: \n\nBeautiful art design - Whether it be stylized stations and ships reminiscent of the early years of Sci Fi, or the rings of a Gas Giant cutting through the sky, the game is simply beautiful and eyecandy in some areas.\n\nGameplay similar to the X Series - It is hard not to compare it to the likes of X3: Albion Prelude. A smaller, more refined attempt rather than featuring dozens of specific zones to explore and trade in. It is sadly more simplified though, where sending ships to automatically trade instead makes them sell to all stations within a Sector who are willing to buy, instead of setting a single station to manually trade with. But it adds its own level of complexity to ship systems. You can disable engines, weapons, power. You don't need to destroy a ship to win the fight. Movement feels good, combat feels good. There's not much more to say here. Its good.\n\nThe AI: If any of us have played the X games then we should all know the AI is terrible in those. I've been pleasantly surprised by Helium Rains AI pathways. Auto-Docking is cleaner than i ever could have thought possible. Though bugs do persist that requires me to manually dock sometimes.\n\nResponsive Developers - As far as I have seen the development team appear responsive to suggestions and tweaks. It is always nice to see an Early Access game that is cared for publicly.\n\nCons:\n\nExploration - Rather than going through Warp Gates to reach zones, you instead 'Fast Forward' after selecting a spot orbiting one of the four planetoids in the Menu. It can feel as though it is removing you from the flow of the game as days pass by in-game before you reach your destination but for you it is merely 1 second per day. It feels too much like teleportation since you can do it from any area to any discovered zone. It takes seconds to reach the other side of colonized space, causing this sensation of disconnection with events in-game.\n\nThe Menus - Though the UI is certainly well designed and easy to navigate, half of your time will be spent inside of it. This also suffers from taking you out of the perspective of the Universe. The game feels almost half like an Information terminal sometimes. Watch gameplay of Helium Rain and you will see a Window taking up the entire screen with text more often than you would think. Not a con if you like this terminal-focussed gameplay, but for me it can become frustrating not knowing whats going on around me while im inside of it. (The game continues in real-time when you open it up)\n\nStar System design - The trailer and screenshots shown tend to focus on the handful of Zones that genuinely look breathtaking. But these are far and in-between. Most of the regions you will explore look barren, with only the odd few asteroids to give aesthetics. Along with this, these systems tend to have the Stations clumped together in close clusters. Giving the impression that these were rushed into creation to get the economy up and running first, aesthetics later.\n\nFactions: Each Company in the game has a monopoly on their chosen industry. You are the new comer, someone who can choose which industry to focus on and act competitively against one of the Dominant Corporations. There exists a reputation system, which I tend to love in Video Games. But I dont feel it is handled well in Helium Rain. There are no set rivals for each company, aside from Pirates. I haven't waged war yet to see if it affects reputation, but I feel it is a large miss for reputation to not be dynamic. If you want to be cosy with one faction then another should totally begin to hate you for it.  You could go the entire game being neutral to all and friendly with some and face no consequences. But that's just my opinion. I liked how Freelancer handled it is all. You simply couldn't be neutral with everyone at once, someone will always hate your guts, which kept things dynamic.\n\nEconomy - Speaking of the Economy, it leaves much to be desired in its current state. I have found simply saving up for a large transport and then buying a full cargo of water and parking it in a Sector that consumes the most of it for trading can make the entire purpose behind the games ability to buy stations and wage wars completely mute. With 2k a day in profits, you can simply click the Fast-Forward button and leave it at that. Gaining a hundred thousand within 50 seconds. You simply do not need to do anything else to make money. And if you really wanted to abuse the economy, you could repeat this step by buying more transports and selling resources where they are most consumed over time, your supplies will always be bought first so there's no need to worry about the AI selling them before you. The game has a very unbalanced economy and the existence of a fast forward mechanic seems to work against the premise of doing missions and undercutting your competition as you will simply only be doing them for the early game. It is just not worth doing anything other than sitting through the fast forward process because the Time Wasted versus Profits Gained ratio is so far out of scale that its just more beneficial to just not bother at all. Building stations in fact act more as a drain to your income than an actual benefit.\n\nConclusion:\n\nAll in all the game is still early in development and these are issues that can and likely will be fixed given enough time. I'd completely recommend the game in its current state as long as you enter into it with a refusal to abuse the economy and take all the fun out of it. This game is of a dying breed and has high potential, I look forward to future updates.", "timestamp_created": 1504814681, "timestamp_updated": 1504999956, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.533786", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34764016": {"recommendationid": "34764016", "author": {"steamid": "76561198355421793", "num_games_owned": 38, "num_reviews": 2, "playtime_forever": 710, "playtime_last_two_weeks": 19, "last_played": 1513719375}, "language": "english", "review": "A good game, pretty much like the X series, but more dynamic / less tedious.\nAlso very responsive developers, I have posted a bug to the issue tracker and it was fixed in like 1 day.", "timestamp_created": 1504643087, "timestamp_updated": 1504643087, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.540540", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34723069": {"recommendationid": "34723069", "author": {"steamid": "76561197970637464", "num_games_owned": 823, "num_reviews": 24, "playtime_forever": 367, "playtime_last_two_weeks": 0, "last_played": 1505073223}, "language": "english", "review": "itsagoodagame", "timestamp_created": 1504478170, "timestamp_updated": 1504478170, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.417982", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34721723": {"recommendationid": "34721723", "author": {"steamid": "76561197972061905", "num_games_owned": 406, "num_reviews": 4, "playtime_forever": 934, "playtime_last_two_weeks": 0, "last_played": 1512218678}, "language": "english", "review": "This game nails the lonely deep space colony feel 100% with the graphics, art and music. The UI is clean, functional and I also found it intuitive so far.\n\nGameplay-wise, it seems very similar to a cleaned up X3. I attribute a lot of that cleaner feel to the way the game handles trading and travel. There are no gates, and transfering to different orbits takes days, but days can be fast forwarded through. Days also act as turns for resolving automated trade activities and constructions (and other events during war or metorite intercepts).\n\nThe combat was responsive and fun. It seems like it can be easy to disable parts of ships, but destroying them takes a lot more. This turns out to be a good thing since the combat ends when ships are disabled rather than destroyed. So even if you loose a fight, you likely will only need to pay to repair your drifting damaged ships instead of having to construct entirely new ones. I haven't tried combat using larger ships yet.\n\nDefinately can recommend this one. The developers are also very active, listen to observations/suggestions, and are willing to discuss them. In some cases they have implemented suggestions very quickly. The game already feels mostly finished and it runs great (no stuttering/performance issues, and no crashes).", "timestamp_created": 1504473212, "timestamp_updated": 1504473212, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.524913", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34719940": {"recommendationid": "34719940", "author": {"steamid": "76561197967013685", "num_games_owned": 289, "num_reviews": 2, "playtime_forever": 221, "playtime_last_two_weeks": 0, "last_played": 1504469360}, "language": "english", "review": "A love at first sight for any X-series fan.\n\nFirst impressions after 3h:\n- wow, for an early access title it's amazingly stable!\n- nice graphics and a well-thought-out UI\n--> the game is being built around a very solid, already functioning technical basis\n\n- non-scripted economics model\n- own stations, production chains, trade routes\n--> how long I've been waiting for all that!\n\n- regular updates with significant improvements and adjustments\n- features and ideas are being proactively discussed with the community\n--> EA done right\n\nAll in all, Helium Rain is very well playable and worth the $15 even now.\nWith the potential of turning into a truly unique gem.", "timestamp_created": 1504467492, "timestamp_updated": 1504467492, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.526956", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34686617": {"recommendationid": "34686617", "author": {"steamid": "76561198068159053", "num_games_owned": 420, "num_reviews": 45, "playtime_forever": 358, "playtime_last_two_weeks": 0, "last_played": 1504895283}, "language": "french", "review": "Un X-like moderne, simplifié mais dans le bon sens. Rendant accessible le genre gestion spatial à tout les joueurs.\nJe commence l'aventure, la gestion pour l'instant est simple, l'ergonomie correcte même si des points peuvent être améliorés (Informations économiques, accessibilités aux infos par panneaux et sous panneaux...).\n\nLe jeux est beau, sans être AAA, la DA est superbe.\nLe gameplay est fluide, intuitif et exigeant.\n\nHR est addictif, construire sa flotte de vaisseaux, puis ces stations afin de s'étendre dans l'univers.\nPas de doute, HR a compris les amoureux de gestion spatial.", "timestamp_created": 1504362534, "timestamp_updated": 1504362534, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.501217", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34625189": {"recommendationid": "34625189", "author": {"steamid": "76561197982167072", "num_games_owned": 560, "num_reviews": 6, "playtime_forever": 2514, "playtime_last_two_weeks": 0, "last_played": 1510890503}, "language": "english", "review": "Was going to write a review about how this game is everything I like about the X series and more, but looks like everyone else already noticed! Definitely worth a buy!", "timestamp_created": 1504151763, "timestamp_updated": 1504151763, "voted_up": true, "votes_up": 8, "votes_funny": 2, "weighted_vote_score": "0.542474", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34611514": {"recommendationid": "34611514", "author": {"steamid": "76561197971340114", "num_games_owned": 372, "num_reviews": 21, "playtime_forever": 1365, "playtime_last_two_weeks": 0, "last_played": 1505226771}, "language": "japanese", "review": "「まずこの辺の挙動を直していかないと」という粗が目立つ早期アクセスではなく、基礎部分の完成度が高く、開発者も[strike]意欲的なため、[/strike]非常に意欲的なため、純粋に進展を楽しみにできるタイトルです。既にボリュームもかなりのようで、試行錯誤しつつのプレイ約18時間ではまだ触りといった感のレビューになります。（とはいえもちろん未実装部分は散見され、現状ストーリーも最後まで終わらせることはできない模様）\n\n・紹介\nCivilizationやTropicoのようなマネジメント系ストラテジを、俯瞰視点ではなく住人として遊べたら？流通や建造、陣営の対立などはAIによるサンドボックスで、そこに自分も同じように関与できたら？コンセプトはクールなハードSFで…。おぉ、夢のゲームじゃないか。\n「Helium Rain」は大体そういう作品です。\n\n具体的に言うと本作は、地球から24光年、みずへび座β星に発見されたガスジャイアントとその月周辺軌道を舞台に、船団運用・ステーション建設・研究や探査・抗争などで自分の企業を育てていくフライトゲームとなります。ジャンルとして類似作はSteam上だけでも相当数存在しており、もはや飽和状態かもしれません。にも関わらずHelium Rainの特筆すべき点を幾つか挙げると：\n\n- 現代の宇宙開発の延長にあるようなリアルな空気感。真空独特の陰影や、実際に研究・開発されているような軌道構造物。こういった「らしさ」、ストイックな美しさはストアで確認できる以上に凄く、製作者の造詣とセンスを感じさせます。\n\n- 宇宙船は非力な主推力とRCSで構成され、軌道間の航行には数日かかる。操作自体はシンプルで、オートでスラスタが制動するようになっているため（これを外部視点から眺めるだけでもグッと来るものがあります）低速を維持しているうちはそれほど慣性を意識しないで済むが、激しい機動をしようとすると戦闘艇であっても意図しない方向へすっ飛んでいく。反転して主推力でブレーキ、みたいな真似も勿論できます。\n\n- さくさくしたゲームプレイと中毒性。前述した航行も目的地をエリアマップでクリックし、スキップ機能を使って一瞬で到着する形で、移動などに労力をかけるゲームではない感じ。代わりに運用でやることが多く飽きない。そのあたりのUIが洗練されており、いじっているうちだいぶ時間を忘れる…いわゆる「あと1ターン」に近いプレイ感覚。（ただ契約の追跡など良くできている反面、やるべきことに対して機能が追いついてない部分もあり、使用にはそれなりに慣れが必要？）\n\n- 架空の惑星Nema近傍のみを舞台として、詳細かつ「生きた」サンドボックス。行き交う船や施設は適当に点在する飾りではなく、プレイヤーと同じく建造を経て、他企業が目的に沿って運用している。プレイヤー側に資材を納入したりもするし、流通が滞ると連鎖的に生産が停止する。戦争はただの撃ち合いではなく各宙域の支配権を左右し、参戦依頼が告知される。また自分の乗っていない船はAIが動かすので、戦闘船団を編成することも。\n\n・（現時点での）まとめ\n見た目からハードコアなシム路線か雰囲気モノかなと思いきや、プレイアビリティが高く、流動的なゲーム性が非常に面白いです。逆に方向性がはっきりした作りであるため、当て所なく宇宙を旅する、つまりオープンワールド的な遊びは求めづらいと思います。経営の手を休めてHelium Rainの荘厳な宇宙を遊弋するのは、それはそれで堪らないですが。\nなお他のレビューでも言及されているように、作品内容にしては不思議なほど動作が軽く、下手をするとピクセル系の2D作品より起動が速いです。この手のゲームが気軽に開始、中断できるのは嬉しいところ。", "timestamp_created": 1504108882, "timestamp_updated": 1511497689, "voted_up": true, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.687500", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34596391": {"recommendationid": "34596391", "author": {"steamid": "76561198201064619", "num_games_owned": 334, "num_reviews": 5, "playtime_forever": 1004, "playtime_last_two_weeks": 0, "last_played": 1505356984}, "language": "english", "review": "I really like this game so far, here's why:\n\n[list]\n    [*]This is the biggest one for me: it's fun immediately. There's some complexity here but it lacks the vertical learning curve of X3 or Evochron. Piloting is fun and doesn't take long to get used to. Mouse look, WASD, QE to roll, and Shift/Ctrl for strafing up and down. It doesn't need to hide anything behind obtuse mechanics, the whole feel is streamlined and efficient.\n\n   [*]Never thought I'd say this, but manually docking is...really enjoyable. This game makes me feel like Riker in [i]Encounter at Farpoint[/i] every time, I love it! \n\n    [*]Intuitive GUI, pretty colors. It got easy to fly through the menus after just a few contracts.\n\n    [*]The graphics are cool and look good, yet it runs smoothly on my potato laptop.\n\n    [*]The contract system is great. One of the things I dislike about some other space trader games is having to keep track of prices for all the wares to try to get the best deal. Some require pen and paper...Contracts do away with that, you accept one or three and make the money upon completion. There are certain restrictions like you can't be at war with the destination, but there doesn't seem to be a time limit for completion.\n\n    [*]The scenery...love the look of this game with the cool temperature palette and fresh hardware designs and I have never played a game that looks like this before. The lighting is stark and well done.\n[/list]\n\nAnyway, I'm still rocking a single ship in the first solar system so there's tons left to see like fleets and empire building, but right now it's looking pretty good. \n\n", "timestamp_created": 1504063659, "timestamp_updated": 1504063659, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.625939", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34566422": {"recommendationid": "34566422", "author": {"steamid": "76561198062259956", "num_games_owned": 161, "num_reviews": 11, "playtime_forever": 5318, "playtime_last_two_weeks": 0, "last_played": 1504797131}, "language": "english", "review": "I have been looking for a game that recaptures the magic of X3 for a long time. It is rare to find a space sim that has the same ethos as X3: your goal is to build an empire, and you build fleets to protect that empire, rather than the more common philosophy of \"it's fun to blow stuff up, so that's the main goal\". But the devs are well on their way to delivering this, even though the game is VERY early access. I'm really quite surprised at how much there is since it was released (in EA) like a week ago. I really, really hope they continue to develop this game. So if you like space trading sims, it is playable as is but will no doubt get better and better. Probably its biggest advantage over X3 is a pretty sane interface.\n\nThe rest of my review is notes and suggestions to the devs:\n\n- The number of sectors is just too small for a long-running game. It is nice to start, though.\n\n- More goods, more stations, more ship types, and more weapon types are needed. I'm sure these are all forthcoming, although the current content is great for the current stage of development.\n\n- I haven't done any combat yet although I couldn't easily find commands for a military fleet to \"patrol this sector\" (with all my stations) and so on. There is apparently no need or purpose to build a military fleet to protect my traders from pirates etc. I'm pretty nervous to try combat actually, as to do that I'd have to declare war, and there is apparently no \"revert to save\" option. (EDIT: I was right about \"no revert to save\" being a problem, because once you get into a war with one company, you'll shortly find yourself in a war with everyone...but wrong about the \"no combat ships needed\", as it turns out)\n\n- If research is supposed to be a key part of the game, there needs to be a lot more to research. In particular, (more) ship upgrades, tiers of ships/weapons, and so on.\n\n- Contracts do not seem to scale with reputation, ship capabilities (other than military), or anything else. So later game, contracts become useless and too small to bother with really. (EDIT: I think it does scale with the needs of the factories, so that as NPC factories level up, contracts get bigger. If so, scratch this one).\n\n- Not sure about how I feel about the \"you have to discover new sectors via VIP or telescope\" mechanic. Seems a bit contrived.\n\n- The diplomacy system seems underdeveloped, at least at this point in my playing. I'm not sure why it benefits you to curry favor or hurts you to lose it (as long as you lose favor with less powerful corps).\n\n- No incentive for exploration. I'm all about the trading sim obviously, but it would be nice to have more things to do while you wait for your factories and trading fleets to make you obscenely wealthy.\n\n- It hurts me to say this because I fear it will get nerfed, but the Atlas seems overpowered to me. Basically the cost difference between bad and awesome ships is too small IMO.\n\n- I built a habitat thinking it would make me credits from taxes or something, but it seemingly consumes resources for no reason. Is there some benefit to population?\n\n- Sometimes I am in the middle of autodocking and it cancels for no apparent reason. It may be because I frequently ALT-TAB (or the Linux equivalent) out of the game while I'm waiting to dock. Speaking of autodocking, it should just be built-in, not researchable. Manual docking at the beginning is annoying as balls, and it was the first thing I researched anyway.\n\n- I think instead of in-game tutorials, at least for the intermediate concepts, like making a trade fleet, there should be an in-game wiki or something. I got halfway through \"making a trade fleet\" and then forgot how to do the first few steps of it.\n\n- Oh, BTW, thanks for Linux support. I only buy Linux games so this expanded your audience by at least 1.\n\n- Are there audio settings? I'd like to disable the music sometimes (EDIT: found it, didn't look hard enough, wasn't in an Audio menu but just general settings).\n\nIn general, I'm so excited about this game and wish I could give you more money, if I knew it would result in more development. Very good work so far.", "timestamp_created": 1503971457, "timestamp_updated": 1504379634, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.627943", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34566102": {"recommendationid": "34566102", "author": {"steamid": "76561198113339577", "num_games_owned": 44, "num_reviews": 4, "playtime_forever": 705, "playtime_last_two_weeks": 0, "last_played": 1503981882}, "language": "english", "review": ">be me\n>buys this game at 11 am in the morning\n>plays for an hour or so\n>mom tells me to go to bed early because i have to wake up at 6 the next day for practice\n>checks watch\n>9 pm\n>                       o h", "timestamp_created": 1503969918, "timestamp_updated": 1503969918, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.484846", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34547626": {"recommendationid": "34547626", "author": {"steamid": "76561197971177893", "num_games_owned": 49, "num_reviews": 5, "playtime_forever": 597, "playtime_last_two_weeks": 0, "last_played": 1503984438}, "language": "english", "review": "I very much enjoy playing this game. The economy bits are really fun. I like figuring out where I can create a trade route to make more money. I like having to solve problems I run into. The game has a very authentic space colony feel. Like if there were space colonies in the next 100-200 years they'd probably would be just like this. \n\nMy favorite latest thing is the ship switching. I can switch to the freigthers in my fleet and individually tell them to autodock, and then switch to my fighters and see all my ships doing what I want them to, and then sometimes you see one of your other fleets enter the sector while you're doing all this and it's just a super cool thing. Especially realizing that you only start off with one ship, and you build this big empire in a cool space colony.", "timestamp_created": 1503908774, "timestamp_updated": 1503908882, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.519203", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34535651": {"recommendationid": "34535651", "author": {"steamid": "76561198010290277", "num_games_owned": 490, "num_reviews": 10, "playtime_forever": 320, "playtime_last_two_weeks": 0, "last_played": 1504463186}, "language": "english", "review": "Entertaining trade based space sim with a dynamic economy. Reminds me of ETS2 and X3 ina a good way. Havent got to combat yet but have seen other factions fighting over sectors and it looks good.", "timestamp_created": 1503857304, "timestamp_updated": 1503857304, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.519203", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34513758": {"recommendationid": "34513758", "author": {"steamid": "76561197972327580", "num_games_owned": 464, "num_reviews": 3, "playtime_forever": 573, "playtime_last_two_weeks": 0, "last_played": 1503801180}, "language": "english", "review": "I think this is what X-Rebirth was supposd to be like.... GET IT. Its amazeballs.", "timestamp_created": 1503779759, "timestamp_updated": 1503779759, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.486562", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34491435": {"recommendationid": "34491435", "author": {"steamid": "76561198000532039", "num_games_owned": 80, "num_reviews": 1, "playtime_forever": 1565, "playtime_last_two_weeks": 0, "last_played": 1512162194}, "language": "english", "review": "An excellent space sim made by big fans of X3 ! Still Early Access but already has a huge potential !", "timestamp_created": 1503700149, "timestamp_updated": 1503700149, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.519203", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34478595": {"recommendationid": "34478595", "author": {"steamid": "76561197971039937", "num_games_owned": 530, "num_reviews": 6, "playtime_forever": 551, "playtime_last_two_weeks": 0, "last_played": 1512668920}, "language": "english", "review": "HAVING PLAYED MORE SPACE COBAT/TRADING GAMES THAN I CARE TO MENTION SINCE THE MID 80's STARTING WITH THE ORGINAL \"ELITE\", NOW AT JUST OVER 70yr OF AGE I FEEL QUALIFIED TO PASS MY OPINION.\nHELIUM RAIN IS A DIAMOND IN THE MAKING, AS WITH ALL DIAMONDS IT DOES NEED A LITTLE POLISH, BEEN PLAYING ABOUT 6hr. AND HAVE GOT USE TO THE INTERFACE AND SHIP MOVMENT, THE NEWTONION MOVEMENT IS A JOY AND THE CHALLENGE OF DOCKING IS GREAT [ DONT BOTH WITH DOCKING COMPUTER IT WOULD SPOIL THE FUN ] ONLY CRASHES I'VE HAD WAS WITH THE KEYBOARD COMMANDS INTERFACE, TRY TO CHANGE THINGS TO MUCH AND IT GET CONFUSED AND CRASHES.  I FEEL THE GAME CAN ONLY GET BETTER.  ONLY THING THAT'S IS A LITTLE FRUSTRAING IS THE SMALL WHITE RETICLE, IT COULD BE BIGGER AND COLOURED.\nTHE DEV'S SEEM KEEN TO IMPLIMENT IMPROVEMENTS, PREHAP THEY WILL MAKE AN OLD MAN EVEN HAPPIER.\nKBTHETOAD", "timestamp_created": 1503658098, "timestamp_updated": 1503658098, "voted_up": true, "votes_up": 46, "votes_funny": 9, "weighted_vote_score": "0.694098", "comment_count": "7", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34466744": {"recommendationid": "34466744", "author": {"steamid": "76561198041252504", "num_games_owned": 46, "num_reviews": 2, "playtime_forever": 886, "playtime_last_two_weeks": 0, "last_played": 1504213227}, "language": "english", "review": "Good gameplay, good graphics, good game.\n\nIn Helium Rain you never get bored, you always have a new route to make, a new contract to fill, a new station to build. And whatever you do, the world reacts to it. If you destroy an iron mining station, less iron will be available and the price will go up. Local actions have global consequences. \n\nUsually I'm not into theses type of game, but HR does it well, with detailed tutorials and a smooth learning curve. You are not thrown alone in an unkown universe, with gazillions of stars and nothing to do. \n\nDefinitely worth the price.", "timestamp_created": 1503604522, "timestamp_updated": 1503604522, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.599325", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34451785": {"recommendationid": "34451785", "author": {"steamid": "76561198061974601", "num_games_owned": 583, "num_reviews": 39, "playtime_forever": 434, "playtime_last_two_weeks": 0, "last_played": 1506815488}, "language": "english", "review": "Stable engine with nice graphics and which supports high DPI and high refresh rate (120Hz with vsync in my case).\nNice music and nice tutorial / progression.\nI've seen maybe 30% of the game and I like it _very_ much, I like the gameplay in general, the trading mechanics, the fleet automation (with commercial routes) and got a taste of combats.\nIt's a dream coming true to finally have a promising Elite / Frontier successor, with cool devs and thank you so much for supporting Linux.\nMuch better than the assholes team of Elite Dangerous.", "timestamp_created": 1503545607, "timestamp_updated": 1503545607, "voted_up": true, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.666092", "comment_count": "6", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34447642": {"recommendationid": "34447642", "author": {"steamid": "76561197987292682", "num_games_owned": 343, "num_reviews": 129, "playtime_forever": 265, "playtime_last_two_weeks": 0, "last_played": 1506838178}, "language": "english", "review": "Interesting space sim/space trade game.\n\nI like that the setting is much more sci-fi than other space sims that fall more into space-fantasy (X3 or X Rebirth). Graphics are up to standards and controlling your ship is hard, as the game strives to have realistic physics (so you got inertia and no friction, your spacecraft won't slow down until you hit the backburners). \n\n[b]I appreciate the Linux support[/b]\n\nI'll update this review later, but so far, it gets a thumbs up from me.", "timestamp_created": 1503525819, "timestamp_updated": 1503525819, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.595971", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34440919": {"recommendationid": "34440919", "author": {"steamid": "76561197983660925", "num_games_owned": 419, "num_reviews": 47, "playtime_forever": 873, "playtime_last_two_weeks": 0, "last_played": 1504527217}, "language": "english", "review": "A remarkably unique take on the space trading genre, Helium Rain is doing Early Access right.  You'll find bugs, typos, all the old favorites, but the developers are extremely receptive (they even have their own Redmine server you can log and track bugs in) and quick to turnaround fixes and enhancement.\n\nPast the Early Access considerations, you're left with a very compact, but utterly hypnotic space trading/combat game.  \"Compact\" because HR eschews the current trend of \"fifteen trillion stars!\" for just a handful of planets and sectors, but those planets and sectors are never without plenty to do, from running simple courier missions to building space stations, developing a trade fleet, commanding an economic empire.  Fly one ship while the rest of your fleet is own doing your bidding (and hopefully making some money while they're at it.)  For me it's almost reminiscent of something like Euro Truck Simulator 2 in that regard.  Except in space.  And with guns.\n\nOn the surface, look at the screenshots.  The washed out, high-contrast colors and dreamlike music confer one of the most \"chill\" space games I can remember.  The clean UI is occasionally fiddly, occasionally brilliant, and while it might look a bit too much like your cable box UI, it does the job and continues to improve.\n\nEven this early, I find it one of the more compelling space games in my library.  And unlike some games that provide an entire galaxy but leave you wondering what to do next, more than once I've forgotten what I'd planned to do because something else more interesting came up, and then forgot I was doing THAT because something even more interesting than that came up.  Even while you're blissing out to the celestial look and feel, you'll never be bored.\n\nIf any of this sounds good to you, and you don't mind the vagaries of Early Access, I'd say, hit that Buy button immediately.", "timestamp_created": 1503502591, "timestamp_updated": 1503532333, "voted_up": true, "votes_up": 36, "votes_funny": 0, "weighted_vote_score": "0.782220", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34420160": {"recommendationid": "34420160", "author": {"steamid": "76561197970806666", "num_games_owned": 205, "num_reviews": 22, "playtime_forever": 311, "playtime_last_two_weeks": 0, "last_played": 1503436700}, "language": "english", "review": "This game is a lovely take on a dieing breed.\nSo, I just did something that I never do. I stopped in the middle of my game to write this review because I honestly want to support this developer.\nI'm not one for writing long reviews that outline every detail. However, if you are a fan of the X series or Avorion for the empire building/economical side of things, but also appreciate being able to get a hands on experience this game is for you.\nThe developer is extremely active. \nThe UI is extremely clean and functional after you get a feel for it.\nI hope to see a lot of support for this game, because it's scratching an itch that's been left from the earlier X games.\n\n(Disclaimer: I know I mention the X series here a lot, and that's because this game has a very similar feel. It IS a different game, and it's at a stage where the dev could take it any direction. That excites me with the possibilities for this game's future.)", "timestamp_created": 1503422150, "timestamp_updated": 1503422150, "voted_up": true, "votes_up": 22, "votes_funny": 1, "weighted_vote_score": "0.627648", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34381989": {"recommendationid": "34381989", "author": {"steamid": "76561198000264197", "num_games_owned": 239, "num_reviews": 14, "playtime_forever": 280, "playtime_last_two_weeks": 0, "last_played": 1503271868}, "language": "english", "review": "This game is early access. That's something to keep in mind.\nI've encountered a couple of very minor bugs, none of which interrupt the game. It runs stable, great frame rate, and haven't had a crash at all. Which can't be said for a lot of other games in early development on Steam (and in full release too).\nThe game itself feels like the X series with Elite and mildly inspired Kerbal Space Program. The physics make it interesting and while at first I was concerned it would be a chore to fly around with the momentum, the game is good about adjusting to your controls and where your mouse is pointing (or where you adjust your view if you use a gamepad).\nThe game does feel sparsely populated and stations are relatively close together. I haven't played very long (4 hours in), but there doesn't feel like much reason to explore just yet. On the other hand I'm still doing tutorial contracts and understanding the game, so there might be a lot that opens up. There appears to be a story/plot that you can follow, but seems to be ultimately an optional contract to start.\nTrading works like you would expect. Stations require specific resources. Some produce specific resources. You purchase the products and sell them to places that have them in demand. One unique aspect in the game is a live economy. It's a welcome aspect that causes natural changes in prices and I look forward to using this to my advantage as I progress in the game.\nWhile the interface seems relatively bland and light, it works very well. The docking information is very helpful in lining up your ship and feels satisfying to have the magnetic bonding occur when you get close. Finding the right information in the menus is a bit of an issue. It feels cumbersome to look up where locations are, how long it'll take to fly there, then enter another menu to look up economic information. On one hand I'd hate it if it made it extremely clear since half the fun of a game like this is finding a trade route, not just having it handed to you. On the other, I'd like to see this design improved in the future. As you start to get additional ships, this sort of management process is more crucial. However there is an option to make trade routes that I assume send your other ships out to do the route automated. If that's the case, then there isn't much issue once they go on their merry way.\n\nUltimatly I'm happy with this game at this price point. The game feels light on polish and interface, but feels relatively solid in features and content. I'm hoping to see a wider variety of locations, ships, equipment, and items to move in the future, but there's a lot of potential here and the developers are very active on Reddit and on their own forum. This is cleary a work of love, not for a quick buck.", "timestamp_created": 1503262017, "timestamp_updated": 1503262017, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.566138", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34372158": {"recommendationid": "34372158", "author": {"steamid": "76561197993682888", "num_games_owned": 813, "num_reviews": 4, "playtime_forever": 105, "playtime_last_two_weeks": 0, "last_played": 1503231088}, "language": "english", "review": "A cool little space simulator with newtonian physics and open source engine to boot.\nThe game in it's current form is a solid foundation that hopefully will grow to be something truly special.", "timestamp_created": 1503231367, "timestamp_updated": 1503231367, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.508428", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34369735": {"recommendationid": "34369735", "author": {"steamid": "76561198014288094", "num_games_owned": 105, "num_reviews": 5, "playtime_forever": 534, "playtime_last_two_weeks": 0, "last_played": 1504945510}, "language": "french", "review": "Première impression, c'est un super jeu et qui fonctionne très bien sur Linux ! Au début s'arrimer à une station est un peu long, mais il suffit ensuite de rechercher l'arrimage automatique. Par contre lorsqu'on construit un vaisseau il est par défaut dans une autre flotte ce qui fait qu'on ne peut pas le piloter, il faut donc fusionner les 2 flottes. Il faudrait je pense que par défaut un nouveau vaisseau soit dans la flotte principale. Le commerce est plutôt bien conçu, cependant l'affichage du montant de la valeur d'une matière première dans les secteurs n'est pas clair, on ne sait pas si 38 crédits d'helium dans tel secteur est le montant d'achat ou de vente.\nBref il y a quelques détails à améliorer mais pour un early access c'est vraiment impressionnant. Pour les intéressés le code est en plus en opensource sur github ... :)\nJ'espère que les développeurs vont le faire vivre longtemps avant de passer à de nouveaux projets ;) A mon avis faire une nouvelle version qui fonctionne en réseau (MMO) façon eve online ou vendetta online serait juste énorme.\nBravo aux devs (français) ;)", "timestamp_created": 1503223090, "timestamp_updated": 1503223090, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.591387", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34369311": {"recommendationid": "34369311", "author": {"steamid": "76561197984742329", "num_games_owned": 503, "num_reviews": 2, "playtime_forever": 1614, "playtime_last_two_weeks": 0, "last_played": 1503512287}, "language": "english", "review": "Great game so far. I only scratched to surface of its features but for now here are some pros/cons and I'll probably update this in time:\n\nPro:\n  - Really motivated developer: Quick response to issues(bugs) opened in their bug tracker\n  - Quite a lot of tutorial contracts which will introduce features step-by-step without forcing the player to actually complete \n     them\n  - Very stable game\n  - Dynamic economy\n\nCons:\n  [strike] - Minor con: It is playable at 4k resolution, but some menus will get quite small, so I would advice to play in 2560x1440 for now [/strike] Fixed with the latest patch :)", "timestamp_created": 1503221532, "timestamp_updated": 1503245722, "voted_up": true, "votes_up": 22, "votes_funny": 0, "weighted_vote_score": "0.664386", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34362241": {"recommendationid": "34362241", "author": {"steamid": "76561198148203771", "num_games_owned": 195, "num_reviews": 8, "playtime_forever": 534, "playtime_last_two_weeks": 0, "last_played": 1503580207}, "language": "english", "review": "WARNING ! Do not consider the steam in game time, for I played it before and also offline. I was part of the alpha and beta testers for this game, but I promess you a truthful and most unbiased review ;)\nHelium Rain is a game where you manage a company in an isolated space system, in a distant future. You start with only one small commercial ship, and you will have to progress step by step to become the best of all companies. You have a lot of ways to play. You can focus on a very commercial  approach, focusing on building up your fleets with gigantic cargos, establishing numerous trade routes and invading all the markets, you can build stations to produce or transform materials... Or try a mostly violent approach, using fleets of warships and destroying pirates, selling your services to companies in need ( and that can pay ).\nOf course, it'll take time. You have to work really hard, and the game may seem to slow down after the first hours of gameplay. But it is here that you can really start exploring all of its possibilities, and as I said, there is an awful lot of them ( trust me, I saw when the devs implemented them in the game following testers reviews ). \nOf course, the game is not perfect and will not suit everybody. It is a slow paced game, do not expect overflowing action, even though combats are there, and they are really fun and a bit hard to play. But if you like what I told you this game propose, then you shall like it, for what it does it does it really well. It is a truly beautiful game, the music suits the atmosphere very well, it is calm and a bit contemplative. The gameplay is really well polished and it is quite easy to do things once you have learned how to from the many tutorials explaining the various aspects of the game.\nI do strongly recommend this game to anyone who likes this kind of games !", "timestamp_created": 1503189196, "timestamp_updated": 1511638631, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.528727", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "34349481": {"recommendationid": "34349481", "author": {"steamid": "76561198061787283", "num_games_owned": 59, "num_reviews": 18, "playtime_forever": 2289, "playtime_last_two_weeks": 0, "last_played": 1503770713}, "language": "french", "review": "Toujours à la recherche de petits jeux indés sympathique, mais également beaucoup intéressé par l'espace, je ne pouvais faire l'impasse sur Helium Rain.\n\nIl dispose d'un gameplay puissant axé sur le commerce et la conquête spatiale, et votre seul objectif sera de devenir le numéro 1, par tout les moyens !\n\nCe jeu cache bien des secrets que je n'ai pas encore découvert, cependant les premières choses que je peux vous affirmer, c'est que ses graphismes sont très soignés et de bonne qualité, le gameplay tend à se diversifier et à s'améliorer au fil des mises à jours, les développeurs ont été (et devraient encore l'être) très à l'écoute de leurs communauté lors de l'élaboration de ce jeu.\n\nEn somme, pour 15€, vous ne devriez pas hésiter bien longemps ;)", "timestamp_created": 1503145747, "timestamp_updated": 1503145747, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.589863", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "34346394": {"recommendationid": "34346394", "author": {"steamid": "76561197960305554", "num_games_owned": 121, "num_reviews": 3, "playtime_forever": 83, "playtime_last_two_weeks": 0, "last_played": 1503249286}, "language": "english", "review": "I played it for about half an hour and it's already getting annoying. The docking mechanic is very unreliable, half of the time instead of the ship docking (all approach parameters are fine) i end up on the other side of the station or half inside it. Also the game misses UI scaling which makes it impossible to play at 4K resolution.\n\nEdit: The missing UI Scaling for high DPI monitors was added just a day after i wrote the inital review. Props to the developer. Docking is still unreliable but i guess i live with it for now. I'd like change my review to neutral, but as that's possible it's thumbs up for now.", "timestamp_created": 1503134456, "timestamp_updated": 1503247439, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.559899", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34340352": {"recommendationid": "34340352", "author": {"steamid": "76561198006977426", "num_games_owned": 301, "num_reviews": 64, "playtime_forever": 557, "playtime_last_two_weeks": 0, "last_played": 1512831397}, "language": "french", "review": "Bonjour ce jeu fait par des Francais est une petite perles , je viens de l acheter et deja 6 heures de jeu dessus sans fatigue.\n\nC est du X3 de la bonne époque , on commence de rien est tres vite oui tres vite pas comme sur les X3 , là en 6 heures j ai déja :\n1 station habitat\n1 station photophile \n1 chasseeur de combat à 30K de crédit\n2 ship de départ pour le commence\n1 ship plus gros pour le commence également,\n\nLes graphismes sont tres beaux et j ai déjà assisté à des combat entre faction avec prise de controle de leur station!\n\nJ espre bien sur de nouvelle mise a jour comme un galaxie plus grande meme si je n est pas encore fait le tour de celle ci,\nle jeu est en Francais et ce st déjà genial.\nLa prise en main est grandiose et j espere que ce jeu à la X3 plaira à un grand nombre.\nCordialement", "timestamp_created": 1503106839, "timestamp_updated": 1503106839, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.596822", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34340303": {"recommendationid": "34340303", "author": {"steamid": "76561198083791157", "num_games_owned": 199, "num_reviews": 13, "playtime_forever": 262, "playtime_last_two_weeks": 95, "last_played": 1514598298}, "language": "english", "review": " The game play's like Tungusta forest OG laced with a bit of the Grand Teacher man.", "timestamp_created": 1503106656, "timestamp_updated": 1503106656, "voted_up": true, "votes_up": 6, "votes_funny": 2, "weighted_vote_score": "0.422083", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34336445": {"recommendationid": "34336445", "author": {"steamid": "76561198153064262", "num_games_owned": 81, "num_reviews": 1, "playtime_forever": 482, "playtime_last_two_weeks": 0, "last_played": 1502548580}, "language": "english", "review": "Imagine having developers putting all their heart and passion into a game...\nImagine they're amazing at what they do...\nImagine they listen to the players' feedback to make sure they're building a wonderful game experience...\nHelium Rain is that and much more!\nI found myself launched into an immersive space environment with realistic mechanics and it'll be tens of hours before I feel confident attacking a pirate fleet! For now I'm developping my commercial business between stations, sometimes fulfilling a contract to get more money. But I hear the rivalry between companies is fierce when the resources are so scarce, so I'd better get ready for some fight!\n", "timestamp_created": 1503089574, "timestamp_updated": 1503089574, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.574736", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "34335799": {"recommendationid": "34335799", "author": {"steamid": "76561197973356307", "num_games_owned": 515, "num_reviews": 2, "playtime_forever": 735, "playtime_last_two_weeks": 0, "last_played": 1503898902}, "language": "english", "review": "Enjoying the Game so far.\n\nIf you enjoy buying and selling, traveling the stars, building things and trying to find the best trade route this game is a great addition.\n\nOnce I get further in I'll update my review!", "timestamp_created": 1503087233, "timestamp_updated": 1503087233, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.586385", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39036963": {"recommendationid": "39036963", "author": {"steamid": "76561198047992507", "num_games_owned": 161, "num_reviews": 2, "playtime_forever": 913, "playtime_last_two_weeks": 199, "last_played": 1515834506}, "language": "english", "review": "Pretty great trading game. \n\nThis is better than X rebirth by far, awesome not-too-distant future spaceships and full resource trees. \n\nThis game is a hidden gem. \n\n\nCons: \n\nNo finances screen for space stations, come on !!", "timestamp_created": 1515042578, "timestamp_updated": 1515042578, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}}}
