{"reviews": {"39167915": {"recommendationid": "39167915", "author": {"steamid": "76561198117319734", "num_games_owned": 77, "num_reviews": 23, "playtime_forever": 483, "playtime_last_two_weeks": 483, "last_played": 1515356018}, "language": "english", "review": "Well, after reading all the praise in comments/reviews I expected much more..\nSo, here what you get: pretty basic yet sufficient game mechanics, lively characters, not mind-blowing but pretty entertaining dialogues, about 4-6 hours of gameplay. \nConclusion: decent game for its price, just don't expect an epiphany from it, like I did. :)", "timestamp_created": 1515369217, "timestamp_updated": 1515369217, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.537037", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38936279": {"recommendationid": "38936279", "author": {"steamid": "76561197965615203", "num_games_owned": 2002, "num_reviews": 166, "playtime_forever": 293, "playtime_last_two_weeks": 0, "last_played": 1514638718}, "language": "english", "review": "So here I am, sitting and wondering whether this game is any good. RPGMaker is a useful tool which you can use to create interesting games, but the Steam store is flooded with cookie-cutter save-the-world RPGs. I've enjoyed many RPGMaker games, though pretty much all of them were horror games that had little do with actual fighting.\n\nMy initial misgivings, understandable as they were, were quickly dashed with clever, witty writing. This is no Shakespeare, don't get me wrong, but any game that gets me to laugh for a minute straight as a result of a well-delivered joke is fine in my book.\n\nThis isn't to say the experience is all about going from one joke to another. It's more like a mission to stop evil interspersed with enjoyable banter and serious moments, bolstered by an interesting selection of metal music.\n\nI liked the fact that exploring the world was a reward in itself, not just a way to accrue experience points. I have to admit I've never played a game where the heroes remarked on the stuff they were finding. All too often you find strange objects in other games and no one even bats an eye. This game has spoiled me in this regard.\n\nThe battles were ok. They weren't frustrating or anything, and there was a large variety of mooks to defeat, but at the same time it all flew by really fast. Maybe I'm just too used to this. I did, however, like the in-battle dialogues, they spiced things up during the big encounters.\n\nAll in all, this game was a pleasant surprise and I've enjoyed every minute of it. I'll be keeping tabs on what the dev cooks up in the future. Perhaps a sequel? The game's lore offers a lot of options.", "timestamp_created": 1514814030, "timestamp_updated": 1514814030, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.570552", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38900260": {"recommendationid": "38900260", "author": {"steamid": "76561198236555546", "num_games_owned": 101, "num_reviews": 37, "playtime_forever": 144, "playtime_last_two_weeks": 0, "last_played": 1514374468}, "language": "english", "review": "Funny RPG game.\nMake sure to buy as many +50 mp accessories for all your chars as they can carry, (when you can afford it) as healing is limited (you heal on level up and main guy has it as one of his mp spells) due to no real way to restore mana outside of items (3 towns in havn't seen a way to rest in any fashion)\nI enjoyed the old hermit side quest.\n", "timestamp_created": 1514724621, "timestamp_updated": 1514724621, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.482927", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38669945": {"recommendationid": "38669945", "author": {"steamid": "76561197961364906", "num_games_owned": 636, "num_reviews": 2, "playtime_forever": 323, "playtime_last_two_weeks": 0, "last_played": 1514223769}, "language": "english", "review": "The game has some issues and is hardly perfect, and in terms of RPGMaker games it's fairly basic, but I'd still completely recommend it for a few reasons:\n\nThe humor is great and the storyline is amusing.\n\nIt's cheap, and definitely woth it's asking price for what it provides.\n\nThe game has plenty of flaws, but it'll keep you engaged for around 4~ hours and you'll most likely have a great time, provided that you enjoy Metal music in any shape or form. It has a few references to it here and there, and it has a general 'vibe' that makes it fun to metalheads... And it caters to stoners too, somehow.\n\nI'd rate this one a 7.5/10.", "timestamp_created": 1514230503, "timestamp_updated": 1514230503, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38631845": {"recommendationid": "38631845", "author": {"steamid": "76561198106682328", "num_games_owned": 49, "num_reviews": 8, "playtime_forever": 277, "playtime_last_two_weeks": 0, "last_played": 1514272137}, "language": "english", "review": "This game is Phuking amazing", "timestamp_created": 1514139941, "timestamp_updated": 1514143319, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38495587": {"recommendationid": "38495587", "author": {"steamid": "76561198370375711", "num_games_owned": 278, "num_reviews": 23, "playtime_forever": 715, "playtime_last_two_weeks": 0, "last_played": 1514422161}, "language": "english", "review": "this game fizzucking rules. straight comedy metal rpg.", "timestamp_created": 1513874268, "timestamp_updated": 1513874268, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38332322": {"recommendationid": "38332322", "author": {"steamid": "76561198053566595", "num_games_owned": 59, "num_reviews": 1, "playtime_forever": 12, "playtime_last_two_weeks": 0, "last_played": 1513366415}, "language": "english", "review": "hey its PRETTY good", "timestamp_created": 1513366537, "timestamp_updated": 1513366537, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38261823": {"recommendationid": "38261823", "author": {"steamid": "76561198055006993", "num_games_owned": 44, "num_reviews": 1, "playtime_forever": 8, "playtime_last_two_weeks": 0, "last_played": 1513100772}, "language": "english", "review": "Played and beat this game on a friends account, just had to buy it myself to give it another great review. Great story and characters. Love it.\n\n10/10 Reccomend.", "timestamp_created": 1513100820, "timestamp_updated": 1513100820, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38258380": {"recommendationid": "38258380", "author": {"steamid": "76561198294255957", "num_games_owned": 11, "num_reviews": 1, "playtime_forever": 458, "playtime_last_two_weeks": 0, "last_played": 1513090113}, "language": "english", "review": "Amazing. As someone who has played quite a number of RPGs, this game had the most interesting and likable characters I've ever come across. Would totally recommend! Just a warning: *spoiler alert* When fighting the final boss, there is no glitch in it's health... I wish I knew that before I spent an hour on it.", "timestamp_created": 1513090428, "timestamp_updated": 1513090428, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38252647": {"recommendationid": "38252647", "author": {"steamid": "76561198155916244", "num_games_owned": 26, "num_reviews": 2, "playtime_forever": 432, "playtime_last_two_weeks": 0, "last_played": 1513067275}, "language": "english", "review": "This was a short, but great game. I really like those classic finfal fantasy 6 like RPGS. The humour, music (whats not to love about a good portion of heavy metal?!) and the style was cool.\nMost of all I enjoyed the dialogue between the characters. It made me burst out in laughter several times.\nThere were no real flaws in the game, except maybe the endboss. [spoiler]I battled him to zero health just to find out that I cannot defeat him by myself. This maybe would have been a chance for a second ending  sequence.[/spoiler] That was a bit dissapointing. Nontheless I enjoyed myself really much.\nAbsolutely can recommend this game!", "timestamp_created": 1513068261, "timestamp_updated": 1513068261, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.523810", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38244957": {"recommendationid": "38244957", "author": {"steamid": "76561198384765955", "num_games_owned": 23, "num_reviews": 1, "playtime_forever": 380, "playtime_last_two_weeks": 0, "last_played": 1513032845}, "language": "english", "review": "Very enjoyable while it lasts: very good music, excellent enemy designs but be warned its as short as PHUK!!!", "timestamp_created": 1513032668, "timestamp_updated": 1513032668, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.545455", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38198538": {"recommendationid": "38198538", "author": {"steamid": "76561198054145587", "num_games_owned": 26, "num_reviews": 1, "playtime_forever": 300, "playtime_last_two_weeks": 0, "last_played": 1513327255}, "language": "german", "review": "its an awesome game with lots of metal-ish references and always there for a good laugh. love it!", "timestamp_created": 1512876470, "timestamp_updated": 1512876470, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38176758": {"recommendationid": "38176758", "author": {"steamid": "76561198168678153", "num_games_owned": 28, "num_reviews": 3, "playtime_forever": 1007, "playtime_last_two_weeks": 0, "last_played": 1512765565}, "language": "english", "review": "I liked the characters & interaction between them. \nExploration is rewarding and accompanied by entertaining comments.", "timestamp_created": 1512817472, "timestamp_updated": 1512817472, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38096288": {"recommendationid": "38096288", "author": {"steamid": "76561197960302085", "num_games_owned": 58, "num_reviews": 1, "playtime_forever": 390, "playtime_last_two_weeks": 0, "last_played": 1512352782}, "language": "english", "review": "Every so often, there's an itch that only a retro-style turn-based RPG can scratch, and Metal as Phuk scratches better than one of those hands-on-a-stick things that all our grandmothers have in their house.\n\nReminiscent of games such as Dragon Quest, Legend of Zelda, and Final Fantasy, Metal as Phuk puts you front and centre as Chael, the last paladin of the Metal Order, on an epic quest to stop three evil bards from summoning A'marthius into the world.\n\nMeet up with some badass compadres to rip evil a dozen new holes, and most importantly, be METAL AS PHUK!\n\n------------------------------------------------------------------------\n\nMetal as Phuk offers a solid 6 hours of playthrough provided you aren't smashing the skip dialogue key, and upon completing the game, you aren't left feeling cheated because frankly it's extremely wallet-friendly.  Its world is full of small details, such as funny notes and Easter eggs.  Each character you encounter has their own dialogue, much of it being absolutely hilarious.\n\nMy one criticism of the game is in that some of the dialogue feels a little forced when attempting to be dramatic, similar to an epic B movie from the 80's.  While this is a criticism, it's not actually a detracting factor and actually seems to enhance the experience.  While playing Metal as Phuk, you might experience a feeling similar to, say, watching the original Evil Dead; there is comedy, there is drama, there is an element of horror, but most of all there is a feeling of \"god dammit, this kicks ass\".\n\nIf you are looking for a difficult game, this isn't it (nor is it intended to be).  Metal as Phuk is intended, as the creator notes, to make you laugh.\n\nOn a technical note, due to the engine used to develop the game, you cannot change resolution so when you first launch the game it will come up in a small window.  To fix this, hit ALT+Enter, and you're off living the Fullscreen-Fantasy^TM.  You may also want to adjust your volume prior to starting the game, as the music is as loud as it is rockin'.\n\nOverall, this game is a must have.  Buy it now, and thank me when you are sitting back enjoying this bad ass adventure.  Personally, I'm looking forward to seeing more from this developer in the future.", "timestamp_created": 1512540365, "timestamp_updated": 1512540547, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.545455", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38068945": {"recommendationid": "38068945", "author": {"steamid": "76561198044602606", "num_games_owned": 5363, "num_reviews": 249, "playtime_forever": 308, "playtime_last_two_weeks": 0, "last_played": 1509744114}, "language": "english", "review": "Metal as Phuk was quite the fun little RPG Maker game. It randomly caught my eye during one of the recent sales and I bought it on a whim.\n\nI think it took me somewhere around 4-5 hours to complete, and I definitely had quite a few chuckles and laughs throughout. You really need to be a fan of various metal bands and the genre in general to pick up on a lot of the jokes, but yeah, it was pretty cool. Depending on how you look at things, the overall lack of difficulty might be a negative, but for me, it was actually ideal, as I wasn't really looking for a challenge with this one. I simply wanted to experience the story, which was fun and irreverent.\n\nIn my opinion, Metal as Phuk is one of the better RPG Maker titles you will find on Steam. Try it out (but make sure you know at least a little about metal music or the game won't hold the same level of charm for you most likely).\n\n8 out of 10.", "timestamp_created": 1512436204, "timestamp_updated": 1512436204, "voted_up": true, "votes_up": 22, "votes_funny": 1, "weighted_vote_score": "0.711362", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38037293": {"recommendationid": "38037293", "author": {"steamid": "76561198214989148", "num_games_owned": 1344, "num_reviews": 66, "playtime_forever": 357, "playtime_last_two_weeks": 0, "last_played": 1512317981}, "language": "english", "review": "Another day, another review!   This one was enjoyable however not for the combat.  This game's combat kind of sucked.  You play this game for 2 reasons in particular, the awesome soundtrack, and the incredibly stupid humor.  Both of which are off the walls good in this game.   I haven't laughed this hard in a while (or a few days I laugh a lot), and rocked out when listening to the game music in a while.\n\nHowever the game's fighting could use a major overhaul, one of the first bosses the abyss worm can easily wipe you if you fight it before going into the well.  Likewise since enemies drop a pittance for money buying enough antidotes (which are fairly expensive early game) to get through the well is pretty difficult.   By end game that's not much of a problem, since the final dungeon is pretty damn short.  However the final boss leaves a lot to be desires, since its a forced loss fight, if he had enough strength that he wiped your team within 3 turns that'd be one thing.  However most of his moves take quite a bit to kill you.  It's made worse by the fact that his only screen nuke (fire breath) is well fire, and all your characters RESIST FIRE!   This is such a dagarn joke when you fight him.  Plus its kind of a rule that you do not have a forced loss final boss unless you have a game that's a direct sequel, but maybe that's just me.\n\nHowever I think that based on this game they will make a far more enjoyable sequel, and I'm looking forward to playing whatever it is!", "timestamp_created": 1512318351, "timestamp_updated": 1512318351, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.392857", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38025928": {"recommendationid": "38025928", "author": {"steamid": "76561198440834666", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 220, "playtime_last_two_weeks": 0, "last_played": 1512294031}, "language": "english", "review": "A wonderful and hilarious adventure of epic metal proportions!\n\nDo you like fantasy? Video games? Metal music? Old men who have taken an arrow not to the knee, but to their nether region?\n\nIf you replied yes to all of them (really, you like old men who have taken an arrow to their quiver bone??), then this game is perfect for you! If not, then it is still a great game. I enjoyed the music, art and classic RPG feel to this game. It takes me back to when I played games like Breath of Fire and Beyond the Beyond in my childhood. It can be tricky at time, but there is already a great guide on it just in case you're stuck and just want to move along and experience the storyline. The characters are loveable and the jokes are quite crude at times.\n\nIn the end, it was a fun game and I would recommend it to my metalhead friends. Well done Crankage Games, I can't wait for your next game to be done!", "timestamp_created": 1512287411, "timestamp_updated": 1512287411, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37941118": {"recommendationid": "37941118", "author": {"steamid": "76561198207404064", "num_games_owned": 33, "num_reviews": 1, "playtime_forever": 894, "playtime_last_two_weeks": 0, "last_played": 1512000356}, "language": "english", "review": "[b]Summary:[/b]\nIf there is one thing the Metal As Phuk has done, it's made me laugh. The adult-like humor found in this game isn't common and in a way it was quite refreshing to experience. But don't let the comedy aspect of the game fool you. CrankageGames definitely put in tons of effort into the lore for the player to discover, even in some of the tiniest overlooked details, and it's system rewards you for discovering it. Worth the buy.\n\n[b]Pro's[/b]\n- Considerably cheap game for the amount of content.\n- Enjoyable to play\n- Rewards you for all types of playthroughs.\n\n[b]Con's[/b]\n- Introduce an explanation to the combat phase for those who don't understand turned base.\n- There is *a lot* of dialog. All of it unskippable. I'd introduce a feature to completely skip the dialog.\n\n[b]Rating[/b]\n3/5", "timestamp_created": 1512000963, "timestamp_updated": 1512000988, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37647817": {"recommendationid": "37647817", "author": {"steamid": "76561197963416426", "num_games_owned": 237, "num_reviews": 23, "playtime_forever": 616, "playtime_last_two_weeks": 0, "last_played": 1511693126}, "language": "english", "review": "Fun game with lots of little references and some decent laughs...\nPros:\nFunny\nFairly easy\nGreat drops! [spoiler] Last minute awesome weapons before you fight the final boss if you find two items i shall not mention that are found early on in the game (check everything that might be hiding an item, have a blast!) [/spoiler]\nVery speedrunable\n\nCons:\nShort but sweet\nIts not necessary to grind out items, i enjoy this aspect of an rpg as it makes me feel more like a completionist [spoiler] You really wana know why? Because its sorta pointless having the best of the best for the last boss battle [/spoiler]\nSome of the references could have been a bit extended for more laughs.\nGetting enough money for the best buyable items takes quite some time.\n\nI'd rate it a solid 8/10. I wouldn't rate it as excellent, but definitely above average.\nGive it a spin, whether full price or discounted its a good way to spend at least a few hours.", "timestamp_created": 1511692031, "timestamp_updated": 1511692260, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36523939": {"recommendationid": "36523939", "author": {"steamid": "76561198126115826", "num_games_owned": 34, "num_reviews": 1, "playtime_forever": 14, "playtime_last_two_weeks": 0, "last_played": 1509629076}, "language": "english", "review": "THIS GAME HAS BEEN THE HIGHLIGHT OF MY BLACK BRUTAL LIFE.\nPerfect combination of  \"phuking\" metal awesomeness matching my favorite dark sense of humor.\nSaw gameplays before and couldnt wait to sink my teeth into it. Now losers im phuking off to play!\nFINALLY!", "timestamp_created": 1510716228, "timestamp_updated": 1510716228, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36503134": {"recommendationid": "36503134", "author": {"steamid": "76561198045094395", "num_games_owned": 101, "num_reviews": 4, "playtime_forever": 272, "playtime_last_two_weeks": 0, "last_played": 1511063115}, "language": "english", "review": "A great classic style RPG game. \n\nThe gameplay itself is fairly simplistic, yet bosses of the game will provide you with a decent challenge to get past. The game is more about making you laugh than being an in depth RPG experience such as Dragon Warrior or Final Fantasy and it does a good enough job of that in the first 15 minutes of play alone to make it well worth the pricetag.", "timestamp_created": 1510624563, "timestamp_updated": 1510624563, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36369956": {"recommendationid": "36369956", "author": {"steamid": "76561198145119208", "num_games_owned": 449, "num_reviews": 25, "playtime_forever": 265, "playtime_last_two_weeks": 0, "last_played": 1510053547}, "language": "english", "review": "I read the name and you had my attention, I saw the trailer and I was sold!\n\nGotta admit, I've always loved Rock/Metal (and getting stoned) so I was a little biased coming into this. Even if it sucked I probably wouldn't of down thumbed it. Fortunately, it doesn't suck. It can be cringey here and there between some of the funny moments, and it's pretty short, but it's still a fun little RPG with tons of metal and stoner references. Two of my favorite things! It's not gonna blow you away with the graphics or gameplay, but it's still fun enough to warrant a thumbs up!", "timestamp_created": 1510125172, "timestamp_updated": 1510135723, "voted_up": true, "votes_up": 11, "votes_funny": 3, "weighted_vote_score": "0.643392", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36368937": {"recommendationid": "36368937", "author": {"steamid": "76561198005402084", "num_games_owned": 31, "num_reviews": 1, "playtime_forever": 80, "playtime_last_two_weeks": 0, "last_played": 1506319414}, "language": "english", "review": "cool game, retro aesthetic, funny stoner jokes. could use an autosave but id still recommend", "timestamp_created": 1510120263, "timestamp_updated": 1510120263, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36347190": {"recommendationid": "36347190", "author": {"steamid": "76561198117947082", "num_games_owned": 19, "num_reviews": 1, "playtime_forever": 284, "playtime_last_two_weeks": 0, "last_played": 1509392450}, "language": "english", "review": "Well what can I say about this game....it's a fun turn based RPG with a kick ass sound track! Definitely recommend this game if you enjoy some heavy metal, turn based RPGs & some crude humour! 10/10 would buy again!\n\nThe allusions to metal bands & frontmen definitely are worth watching out for (I won't spoil any of them here though!) & I'm sure I missed some myself so another playthrough is in order to see what I may have missed!\n\nThe turn based combat is a throwback to old school RPGs which, to me personally, is what makes the game so good as I grew up playing games like it.\n\nThe humour is crude but that's what appeals to me so I laughed my ass off during the playthrough & the ending to the game was brilliant. (again no spoilers from me if you wanna know what I'm on about buy the game!)", "timestamp_created": 1510074021, "timestamp_updated": 1510074021, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36311733": {"recommendationid": "36311733", "author": {"steamid": "76561198113330186", "num_games_owned": 139, "num_reviews": 9, "playtime_forever": 203, "playtime_last_two_weeks": 0, "last_played": 1510093559}, "language": "english", "review": "I have been playing this game for no longer than 31 minutes and I have already looted money from dead people, recruited a stoner, and have been asked to pull an arrow out of a man's dick.\n\n13/10 my mum's face when i try to explain this game\n\nEdit: After finishing this game i can say that it was everything i hoped it would be and more and would advise people to click on everything coz there are so many references.\n\nP.S. Devs make a sequel asap.", "timestamp_created": 1509929046, "timestamp_updated": 1510093716, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35995590": {"recommendationid": "35995590", "author": {"steamid": "76561198101921718", "num_games_owned": 128, "num_reviews": 20, "playtime_forever": 302, "playtime_last_two_weeks": 0, "last_played": 1508713216}, "language": "english", "review": "i don´t even like metal", "timestamp_created": 1508958160, "timestamp_updated": 1508958160, "voted_up": true, "votes_up": 3, "votes_funny": 5, "weighted_vote_score": "0.484242", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35991297": {"recommendationid": "35991297", "author": {"steamid": "76561198188474555", "num_games_owned": 86, "num_reviews": 1, "playtime_forever": 526, "playtime_last_two_weeks": 0, "last_played": 1508640041}, "language": "english", "review": "Shortest Version:\n\nTL;DR - BUY THIS PHUKING GAME!\n\n\nNot So Shortest Version:\n\nI'm a HUGE fan of old school RPGs, so I was SUPER excited to give this game a try! \n\nMy first impressions upon starting this game? The music choices were SOLID, the dialogue was freaking HILARIOUS, and exploration was DEFINTELY encouraged. \n\nAs I am a huge explorer in games, I LOVED the fact I was granted bonus experience by uncovering every nook and cranny.\n\nThe characters all had unique and loveable personalities, and I ABSOLUTELY enjoyed the interactions they shared together! \n\nOn top of all the AMAZING things I've already touched base on, the game is filled with so many easter eggs, and great references that will give you a good chuckle. You can REALLY tell the developers put their heart and soul into this game.\n\nBelieve me when I tell you this game is unlike ANY OTHER RPG you may have played! And it's available at an INCREDIBLE price! It's LITERALLY a steal for the experience.\n\nI'm already thinking of starting my second play through, just in case I missed any awesomeness the first time around! \n\nAs I stated in the beginning, BUT THIS PHUKING GAME! You will NOT be disappointed.", "timestamp_created": 1508945419, "timestamp_updated": 1508945419, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.597297", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35944652": {"recommendationid": "35944652", "author": {"steamid": "76561198160362098", "num_games_owned": 313, "num_reviews": 4, "playtime_forever": 55, "playtime_last_two_weeks": 0, "last_played": 1508267337}, "language": "english", "review": "This game is mediocre at best. Just an asset flip with cheap comedy. It is like a run of the mill RPG Maker game. \nIt seems like it is made for a quick buck.  If you want to play a metal game go play Brutal Legend. If you want an rpg go play anything else.", "timestamp_created": 1508764778, "timestamp_updated": 1512677008, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.478431", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35780424": {"recommendationid": "35780424", "author": {"steamid": "76561198197906430", "num_games_owned": 77, "num_reviews": 1, "playtime_forever": 1364, "playtime_last_two_weeks": 0, "last_played": 1509855234}, "language": "english", "review": "LOVE IT!  Perfectly uniquely written storyline and made me laugh my socks off, gasp, giggle, and shake my head LOL!", "timestamp_created": 1508185737, "timestamp_updated": 1508185737, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.566018", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35764604": {"recommendationid": "35764604", "author": {"steamid": "76561198158690620", "num_games_owned": 42, "num_reviews": 2, "playtime_forever": 127, "playtime_last_two_weeks": 0, "last_played": 1504667727}, "language": "english", "review": "I just started game a while ago, and the Old Man Quiver scene freaking murdered my laughbox, this game is ridiculous and I like it lots.", "timestamp_created": 1508127116, "timestamp_updated": 1508127116, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35732089": {"recommendationid": "35732089", "author": {"steamid": "76561198165442724", "num_games_owned": 372, "num_reviews": 60, "playtime_forever": 326, "playtime_last_two_weeks": 0, "last_played": 1508518581}, "language": "english", "review": "Absolutely phenomenal game.\nAfter feeling burned by many ( not all ) of my purchases, it is very refreshing to say, \"This game kicks♥♥♥♥♥\" The difficulty is very well balanced and the story is ACTUALLY FUNNY. :) :) :) \n\nMay even gift a copy to my friend who is also a fan of Ram & Steins Bar and Grill..", "timestamp_created": 1508023686, "timestamp_updated": 1508023686, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.532821", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35659715": {"recommendationid": "35659715", "author": {"steamid": "76561198083512308", "num_games_owned": 184, "num_reviews": 1, "playtime_forever": 408, "playtime_last_two_weeks": 0, "last_played": 1507816034}, "language": "english", "review": "Crankage Games was kind enough to jump into my twitch stream when I first started streaming. So as a thankyou to him I played this game on my stream. I PHUKING LOVED IT! The music was great and the characters were hilarious. I laughed a lot and really enjoyed it all. Great use of RPG maker and a throwback to games of yesteryear but with more crude jokes and more metal.\n\nReally you should just buy this game because this guy is super supportive of small streamers and awesome to talk to.\n\nAll the Phuk's given as a score. \\m/", "timestamp_created": 1507817050, "timestamp_updated": 1507817050, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.541667", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35629855": {"recommendationid": "35629855", "author": {"steamid": "76561197996144740", "num_games_owned": 128, "num_reviews": 4, "playtime_forever": 571, "playtime_last_two_weeks": 0, "last_played": 1506140396}, "language": "english", "review": "Played the game, had a great time, puns and Easter eggs were well worth the searching and time. Hope to see more soon, Thanks for you great work.", "timestamp_created": 1507687927, "timestamp_updated": 1507687927, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35301991": {"recommendationid": "35301991", "author": {"steamid": "76561198020966991", "num_games_owned": 127, "num_reviews": 3, "playtime_forever": 49, "playtime_last_two_weeks": 0, "last_played": 1507949137}, "language": "english", "review": "Metal as Phuk is a throwback (for me at least) to Gameboy games that were crafted lovingly instead of being shit out to meet a release date. The dialgogue is on point and MaP is one of the few games to make me audibly laugh while playing through it. \n\nIf you've ever played a Final Fantasy game the mechanics of managing a group, using turn based combat, and smart item use should be like second nature.\n\nThe mash-up of Metal themes and Anime tropes is a hilarious mixture that I think goes a long way in showing the creators' humor. \n\nIf you want a fun little game to enjoy pick this title up. At $5 I can wholeheartedly say it's worth the price of admission.", "timestamp_created": 1506699727, "timestamp_updated": 1506699727, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35196077": {"recommendationid": "35196077", "author": {"steamid": "76561198064261649", "num_games_owned": 667, "num_reviews": 13, "playtime_forever": 154, "playtime_last_two_weeks": 0, "last_played": 1506210468}, "language": "english", "review": "First let me say I'm a bit bias.  Any game that takes on the Metal genre is already a great game.  But now can that great game become something I really love.  I could name a few examples where I expected this to happen but didn't.  I could also name a few that barely where even a bit better than my expectations simply cause it's claims to be a metal type game.  So in this case I'll grade this game in two ways.  One, how it compares to other games in general and two, how it compares in the Metal genre of games.\n\nI did not go into this game with very high expectations.  As stated previously it can't be all that bad after all it's got Metal as a backdrop.  So comparing it against other games in general I'd say it met or overcame my expectations.  The only negative in general thing I have to say about the game overal is the lack of graphical settings but I soon found myself forgetting about that and enjoying the story/gameplay/music/fights/explorations just to name a few things that helped me forget.  I'll mention the others below when comparing it against Metal games.  Seriously, great, funny story telling even if you don't get the Metal references that are a plenty.  The turn based combat is simple to pick up and easy to plan your attacks.  The art work isn't perfect but it sure as hell isn't any where close to the worse I've seen.  Overal I'd leave you with this.  I have a major gaming ADD problem and using a first time out in a game I'm lucky to play an hour.  Next thing I new I was at 2 1/2 hours in this game and it was past my bedtime.\n\nNow to compare it against other Metal games this is one of my top 2 or 3 games.  Hands down the most fun, less stressful, great metal riffs (although I wish it had a bit more to begin with), and helped me totally escape reality.  OH and I laughed so hard at this game.  Any metal head will love the metal references.  They are in your face.\n\nThanks Crankage Games for a fun game.  I think sometimes developers forget the fun part in gaming but you sure didn't.  I look forward to your next project and hope you keep puting out the fun.\n\n\\m/ Peace \\m/", "timestamp_created": 1506312958, "timestamp_updated": 1506312958, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.540636", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35166819": {"recommendationid": "35166819", "author": {"steamid": "76561198053422627", "num_games_owned": 1097, "num_reviews": 318, "playtime_forever": 60, "playtime_last_two_weeks": 0, "last_played": 1506510034}, "language": "english", "review": "I just bought this game and played my first hour... and I gotta say even tho I don't tend to like RPG maker games...  This p.huking game is P.HUKING AWESOME AS P.HUK!  :-)\n\nIt is very cleverly written and made me burst into laugher two or three times in just my first hour of play as well as a few chuckles too.  The last time I played an old school RPG game of this style was way back in like 1996 or so when I bought \"Chrono Trigger\" for the Super Nintendo!  \n\nWatch this P.huking game P.HUK me up!\nhttps://www.youtube.com/watch?v=Gq9W3jt6kvQ\n\nAll I gotta say is two things...\n\n1) You're already reading the reviews for this game, so you are thinking about it.. STOP.  ..Just BUY it!  ..It's a really good indie RPG maker game for sure.  \n\n2) When you buy it and play it your first time, Remember to SAVE YOUR GAME OFTEN.  LOL.. I just lost a battle an hour into it and forgot to save my game before my fight like a doofus.  I'm so used to current gen games auto-saving that I completely forgot about how important saving these kinda games is!    Oh well, no biggie because this game is really enjoyable and starting over will just mean more enjoyment!\n\nI'll be back to review this game once I finish it, but so far, loving it.. looks like it's gonna score a minimum of an 8 out of 10. That's not bad at all for a game at this price, especially an RPG.  :-)", "timestamp_created": 1506211574, "timestamp_updated": 1506244482, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.566140", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35075250": {"recommendationid": "35075250", "author": {"steamid": "76561198202295768", "num_games_owned": 103, "num_reviews": 1, "playtime_forever": 718, "playtime_last_two_weeks": 0, "last_played": 1514653112}, "language": "english", "review": "Really fun game  with a cool story. The metal referances were great along with all the other jokes were hilarious.", "timestamp_created": 1505870388, "timestamp_updated": 1505872124, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34826755": {"recommendationid": "34826755", "author": {"steamid": "76561198403185282", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 233, "playtime_last_two_weeks": 0, "last_played": 1504863978}, "language": "english", "review": "Well done to the creators of this game! I will be honest I'm not quite a fan of RPG, however the hilarious story line and over all ins and outs of this game had me genuinely intrigued and invested to play. Throughout playing I found myself snicking like a little child, which I tried to stop because that's not very metal as phuk of me...\n\nSo if you have a few spare dollars and time on your hands, I would highly recommend checking this game out. \nTo the creators again, huge congrats and can't wait to see what games you have install for the future.", "timestamp_created": 1504921001, "timestamp_updated": 1504921001, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34798600": {"recommendationid": "34798600", "author": {"steamid": "76561198042050110", "num_games_owned": 159, "num_reviews": 3, "playtime_forever": 156, "playtime_last_two_weeks": 0, "last_played": 1504804332}, "language": "english", "review": "This game is a blast. As a fan of old school NES and SNES RPGs. This game is a blast. Really fun to play. Simple to get into . And if you like Metal. The references is a cheery on top. I do recommend playing this.", "timestamp_created": 1504804501, "timestamp_updated": 1504804501, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.491803", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34701711": {"recommendationid": "34701711", "author": {"steamid": "76561198193028131", "num_games_owned": 43, "num_reviews": 3, "playtime_forever": 232, "playtime_last_two_weeks": 0, "last_played": 1504410545}, "language": "english", "review": "Bought the game the day or so it came out, but only finally found the time to play it very recently. Fantastic characters and humor that actually was some of the best I have ever seen in a game. Great job Crankage, I will totally try out whatever else you make.", "timestamp_created": 1504410669, "timestamp_updated": 1504410669, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34619735": {"recommendationid": "34619735", "author": {"steamid": "76561198061331809", "num_games_owned": 115, "num_reviews": 1, "playtime_forever": 180, "playtime_last_two_weeks": 0, "last_played": 1504054088}, "language": "english", "review": "A cheeky, humorous take on a magical adventure. Have a sense of humor, crack open a beer, take a long drag, and have some fun.", "timestamp_created": 1504131089, "timestamp_updated": 1504131089, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.482315", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34569433": {"recommendationid": "34569433", "author": {"steamid": "76561198059574325", "num_games_owned": 52, "num_reviews": 1, "playtime_forever": 742, "playtime_last_two_weeks": 0, "last_played": 1503985416}, "language": "english", "review": "I really liked this game! The humor was great, the story was engaging, and the mechanics were simple, yet still really fun. Play it!", "timestamp_created": 1503985507, "timestamp_updated": 1503985507, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34526554": {"recommendationid": "34526554", "author": {"steamid": "76561198212234931", "num_games_owned": 28, "num_reviews": 1, "playtime_forever": 44, "playtime_last_two_weeks": 0, "last_played": 1501317308}, "language": "english", "review": "I would recommend checking it out. Interesting play, funny dialogue and reminiscence of older style games.", "timestamp_created": 1503830673, "timestamp_updated": 1503830673, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.482315", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34495033": {"recommendationid": "34495033", "author": {"steamid": "76561197970029517", "num_games_owned": 259, "num_reviews": 2, "playtime_forever": 241, "playtime_last_two_weeks": 0, "last_played": 1503685899}, "language": "english", "review": "I played for about 4 hours and didn't realize my girlfriend was home.  She sat and watched me play for about 30 minutes and now she's pregnant.  \n\nA+\n\nAlso the Blacksmith's name is Fluffy.  That's pretty alright.", "timestamp_created": 1503716233, "timestamp_updated": 1503716313, "voted_up": true, "votes_up": 6, "votes_funny": 3, "weighted_vote_score": "0.524345", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34493275": {"recommendationid": "34493275", "author": {"steamid": "76561198040897768", "num_games_owned": 216, "num_reviews": 1, "playtime_forever": 143, "playtime_last_two_weeks": 0, "last_played": 1501112051}, "language": "english", "review": "While I don't personally get a number of the refrences, the dialogue and character interaction is hilarious and top notch! Even if you don't get the references, the game is still fun and engaging.", "timestamp_created": 1503708441, "timestamp_updated": 1503708441, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.482315", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34481531": {"recommendationid": "34481531", "author": {"steamid": "76561198093171140", "num_games_owned": 40, "num_reviews": 1, "playtime_forever": 59, "playtime_last_two_weeks": 0, "last_played": 1500279531}, "language": "english", "review": "I dont normaly like games like this but.... This one was entertainging love the work put in to it and its \nworth the price for how much game time you can put in/get out of it.", "timestamp_created": 1503668204, "timestamp_updated": 1503668204, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.482315", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34169460": {"recommendationid": "34169460", "author": {"steamid": "76561198083594733", "num_games_owned": 272, "num_reviews": 9, "playtime_forever": 17, "playtime_last_two_weeks": 0, "last_played": 1502461058}, "language": "english", "review": "Fun game! The writing is funny as hell! auto save would be nice!", "timestamp_created": 1502461115, "timestamp_updated": 1502461115, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.443047", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34008912": {"recommendationid": "34008912", "author": {"steamid": "76561197978333529", "num_games_owned": 24, "num_reviews": 1, "playtime_forever": 370, "playtime_last_two_weeks": 1, "last_played": 1515191103}, "language": "english", "review": "Game was really fun. Simple controls and packed with silly stoner jokes and some non weed related jokes aswell. Really Enjoyed the hidden items that give xp and sick bonus at end of the game. 5/5", "timestamp_created": 1501825546, "timestamp_updated": 1501825546, "voted_up": true, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33945861": {"recommendationid": "33945861", "author": {"steamid": "76561197991935910", "num_games_owned": 391, "num_reviews": 1, "playtime_forever": 62, "playtime_last_two_weeks": 0, "last_played": 1501578866}, "language": "english", "review": "Decent for a rpg maker game not normally a fan of the style but the story so far is intertaining.", "timestamp_created": 1501581724, "timestamp_updated": 1501581724, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33920409": {"recommendationid": "33920409", "author": {"steamid": "76561198198106603", "num_games_owned": 39, "num_reviews": 1, "playtime_forever": 93, "playtime_last_two_weeks": 0, "last_played": 1508872949}, "language": "english", "review": "A solid game with solid music and references. Well worth the cost", "timestamp_created": 1501476854, "timestamp_updated": 1501476854, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.484119", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33893931": {"recommendationid": "33893931", "author": {"steamid": "76561198025496668", "num_games_owned": 280, "num_reviews": 6, "playtime_forever": 77, "playtime_last_two_weeks": 0, "last_played": 1500188998}, "language": "english", "review": "I don't play a lot of RPG's but I really enjoy this one. I love the witty dialogue, the unique characters, and of course the word puns. The title is a word pun, how cool is that! I feel like this game was written by me and I am so excited to finish it. Cannot wait to see what Crankage Games puts out next!", "timestamp_created": 1501376625, "timestamp_updated": 1501376625, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.464396", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33823271": {"recommendationid": "33823271", "author": {"steamid": "76561198056626793", "num_games_owned": 3020, "num_reviews": 6, "playtime_forever": 358, "playtime_last_two_weeks": 0, "last_played": 1509523168}, "language": "english", "review": "1st off this game is phuking metal. I wasn't expecting much when I picked this up. I fully expected this to be just another generic rpg maker game, with just some shameless metal pandering tossed around here, and there. I was pleasently wrong about this game.\nThis is a rpgmaker game, and there are some stock assest used here and there, but surpisingly this game has a decent amount of orginal assests. The soundtrack deserves  a special mention as it is really great, and the dev should consider having it up as a DLC option.\n\nMetal as Phuck has great atmosphere and many moments that will make you think \"damn that was phuking metal.'\nThis game  isn't your standard recruit the character, do their little quest and then forget they even exist, until some plot makes them relevant again  later in the game.Each of the characters have distinct personalities, will give their take on things, and will be very talkative throughout the journey. The banter between chracters reminds me very much of the old Lunar jrpgs. Also just like Lunar most  objects are interactive  rewarding maybe finding items. some character comenting on it or even a  small amount of xp for clicking the random thing. People with OCD beware as you will be clicking up a storm trying find everything.\nPlenty of metal references are littered thoughout the game, some are mainstream freindly, with others being a bit obscure that will make you smile if you recognize them.\n\nThere are a couple of  negatives though. The battle system is for the most part cookie cutter rpgmaker fare with the standard attack, magic, item etc...options. The game is fairly challenging, but the afortmentioned bare basic battle system doesn't light the world on fire in the excitement category. Metal as Phuk is also on the short side. If you count my idling  you can beat this game in under 5 hours.  In a way that can  be a +  as it is a very entertaining 5 hours, and  Metal as Phuk does not wear out its welcome like a lot of other comedy focused rpgs end up doing.  Closing this review with a hymn made by  some of the great metal prophets of long ago.\n\n\"Phuk Made Heavy Metal And He Saw That It Was Good\n Phuk Said To Play It Louder Than Hell\n We Promised That We Would\n When Losers Say It's Over With You Know That It's A Lie\n Phuk Made Heavy Metal And It's Never Gonna Die\"", "timestamp_created": 1501126027, "timestamp_updated": 1501183312, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.466031", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33684332": {"recommendationid": "33684332", "author": {"steamid": "76561198035603746", "num_games_owned": 244, "num_reviews": 1, "playtime_forever": 73, "playtime_last_two_weeks": 0, "last_played": 1499985441}, "language": "english", "review": "What a fun game! Its funny, rewards exploration, has good characters and a lovely classic feel to it \\o/", "timestamp_created": 1500594311, "timestamp_updated": 1500594311, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.484119", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33673843": {"recommendationid": "33673843", "author": {"steamid": "76561198153970829", "num_games_owned": 108, "num_reviews": 3, "playtime_forever": 391, "playtime_last_two_weeks": 0, "last_played": 1500544751}, "language": "english", "review": "Just beat this game, love it.  It made me laughs! :)", "timestamp_created": 1500562042, "timestamp_updated": 1500562042, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.484119", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33642191": {"recommendationid": "33642191", "author": {"steamid": "76561198348347543", "num_games_owned": 16, "num_reviews": 1, "playtime_forever": 328, "playtime_last_two_weeks": 0, "last_played": 1501241142}, "language": "english", "review": "I absolutley LOVE the game! The style and gameplay are very immersive and the comedy makes it a blast to play! I can't wait for another game", "timestamp_created": 1500429371, "timestamp_updated": 1500429371, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.484119", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33626197": {"recommendationid": "33626197", "author": {"steamid": "76561198077855850", "num_games_owned": 153, "num_reviews": 1, "playtime_forever": 126, "playtime_last_two_weeks": 0, "last_played": 1500370248}, "language": "english", "review": "This game is full of funny dialog, with tons of references to metal musicians, nice soundtrack, and classic RPG style.", "timestamp_created": 1500370433, "timestamp_updated": 1500370433, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33606581": {"recommendationid": "33606581", "author": {"steamid": "76561198294197138", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 65, "playtime_last_two_weeks": 0, "last_played": 1500293552}, "language": "english", "review": "This highly addictive game is a laugh-a-minute, easy to play joyride:\n- The gameplay is retro and easy on the fingers.\n- The storyline is smooth and the action fast flowing.\n- The humour is not for the light-hearted and the language is graphic.\n\nAnyone under the age of 12 should probably think carefully before putting this on their dad's credit card.  Anyone older than 12 should spend a few dollars, light up with Pontius, sit back and enjoy the ride.", "timestamp_created": 1500293525, "timestamp_updated": 1500293525, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33602974": {"recommendationid": "33602974", "author": {"steamid": "76561198056971987", "num_games_owned": 22, "num_reviews": 2, "playtime_forever": 55, "playtime_last_two_weeks": 0, "last_played": 1500014271}, "language": "english", "review": "i like game. game is fun and has lots of ha ha's. smonk wed? den you rub dis", "timestamp_created": 1500278981, "timestamp_updated": 1500278981, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.456432", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33598871": {"recommendationid": "33598871", "author": {"steamid": "76561198166181491", "num_games_owned": 34, "num_reviews": 1, "playtime_forever": 573, "playtime_last_two_weeks": 0, "last_played": 1501282574}, "language": "english", "review": "Wow where to begin. I really love this game! It's a lot of fun and there is so much to explore. Hidden secrets, jokes, and puns galore. I never want to stop. I'm very happy with the fight sequences and the dialogue mid fight. As well the serious yet fun and joking humor is a nice touch. I'm excited to see if another game follows from Crankage Games", "timestamp_created": 1500258513, "timestamp_updated": 1500258513, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33594594": {"recommendationid": "33594594", "author": {"steamid": "76561198038693190", "num_games_owned": 37, "num_reviews": 1, "playtime_forever": 769, "playtime_last_two_weeks": 0, "last_played": 1500285147}, "language": "english", "review": "Interesting premise!  Right off the bat you meet some wonderfully quirky characters, and already the play is great!", "timestamp_created": 1500240421, "timestamp_updated": 1500240421, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33593419": {"recommendationid": "33593419", "author": {"steamid": "76561198082322614", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 331, "playtime_last_two_weeks": 0, "last_played": 1500235474}, "language": "english", "review": "Story was fun, combat mechanics were deeper than I expected (loved it), Pontius is the wizardest off all.", "timestamp_created": 1500236573, "timestamp_updated": 1500236573, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33584332": {"recommendationid": "33584332", "author": {"steamid": "76561198405051030", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 757, "playtime_last_two_weeks": 0, "last_played": 1500211893}, "language": "english", "review": "Great game. Reminds me of the iconic days of the legend of Zelda. Keep getting my ass kicked but can't wait to get to the end. lol", "timestamp_created": 1500209875, "timestamp_updated": 1500209875, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33567046": {"recommendationid": "33567046", "author": {"steamid": "76561198050402914", "num_games_owned": 143, "num_reviews": 1, "playtime_forever": 26, "playtime_last_two_weeks": 0, "last_played": 1500094449}, "language": "english", "review": "honest opinion so far, fantastic job writing the dialogue. its pretty funny so far. i actually lol'd a few times, the graphics are hella gay, the turn based fighting is actually pretty cool except i think the indicator of who you are playing should be a little more visible. have not completed the game yet but will soon\n", "timestamp_created": 1500147344, "timestamp_updated": 1500147344, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33553241": {"recommendationid": "33553241", "author": {"steamid": "76561198397749581", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 4252, "playtime_last_two_weeks": 0, "last_played": 1500308758}, "language": "english", "review": "I got Steam specifically because I thought This game looked awesome,I love the humor and story line. Best game of 2017!!!", "timestamp_created": 1500102840, "timestamp_updated": 1500102840, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33548895": {"recommendationid": "33548895", "author": {"steamid": "76561197995747727", "num_games_owned": 315, "num_reviews": 35, "playtime_forever": 101, "playtime_last_two_weeks": 0, "last_played": 1500148660}, "language": "english", "review": "I'm still going through it, but have been enthralled by the quick wit and hilarious character interactions already present in Metal as Phuk. This has been a lot of fun to play from the very beginning, and comes recommended!", "timestamp_created": 1500082456, "timestamp_updated": 1500082456, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33535602": {"recommendationid": "33535602", "author": {"steamid": "76561198157557365", "num_games_owned": 57, "num_reviews": 1, "playtime_forever": 307, "playtime_last_two_weeks": 0, "last_played": 1500037424}, "language": "english", "review": "Honestly im not one for metal but holy shit, this game hits the spot. The dialogue is hilarious (old man quivers is deff a fav!!), the stroy line is awesome and the little nods to other fandoms will have you smiling like an idiot. I was also surprised by the gameplay in terms of the battles, what i thought was going to be easy actually turned out to be nicely challenging and had me really invested in the game!! 10/10 highly recommend, especially whilst it's on sale!!", "timestamp_created": 1500037783, "timestamp_updated": 1500037783, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33534549": {"recommendationid": "33534549", "author": {"steamid": "76561198011769967", "num_games_owned": 238, "num_reviews": 2, "playtime_forever": 223, "playtime_last_two_weeks": 0, "last_played": 1500033656}, "language": "english", "review": "This is a very fun game.  the dialogue is great, the jokes are funny, the music is just spot on, all the easter eggs will have you  laughing. If you have a few hours to spare i highly recommend playing this game because it is Metal as Phuk.", "timestamp_created": 1500034182, "timestamp_updated": 1500034182, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33529252": {"recommendationid": "33529252", "author": {"steamid": "76561198199757997", "num_games_owned": 158, "num_reviews": 6, "playtime_forever": 249, "playtime_last_two_weeks": 0, "last_played": 1500095347}, "language": "english", "review": "I met the dev of this game on Overwatch and the way he described this game, damn it sounded fun.\nI love all the little easter eggs here and there. I'm not a fan of Metal type music but this is still a great game. The jokes too are great:\n\n*takes a whiff of the pipe*\nChael: \"are you...high?\"\nPontius: \"Well I'm not low, haha\"\n\nThere are some great one liners in this game.\nThe dialogue is great :)\nWould reccomend.", "timestamp_created": 1500011801, "timestamp_updated": 1500011801, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.464216", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33524666": {"recommendationid": "33524666", "author": {"steamid": "76561198121846178", "num_games_owned": 121, "num_reviews": 2, "playtime_forever": 443, "playtime_last_two_weeks": 0, "last_played": 1508273686}, "language": "english", "review": "Loved all the Metal references.\nLots of easter eggs around, and they grant exp. I liked that I could change the TP mode to fit my play style.\nCharacters were funny, one-liners were great.\nBest in fullscreen mode, press ALT and Enter to make it fullscreen.", "timestamp_created": 1499990484, "timestamp_updated": 1499999984, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.470260", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 68, "total_negative": 1, "total_reviews": 69}}
