{"reviews": {"39180599": {"recommendationid": "39180599", "author": {"steamid": "76561198803362177", "num_games_owned": 1, "num_reviews": 1, "playtime_forever": 554, "playtime_last_two_weeks": 554, "last_played": 1515978145}, "language": "english", "review": "This is a beautiful game. I just stayed up all night to finish Frankie's route and I almost cried actual tears. The art, music, characters, and story were all absolutely incredible... I guess it's time for me to go out and recommend this game to every person I know. I wish I could give the artists and developers all the money I have", "timestamp_created": 1515416132, "timestamp_updated": 1515416132, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500693", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39003214": {"recommendationid": "39003214", "author": {"steamid": "76561198011237505", "num_games_owned": 393, "num_reviews": 20, "playtime_forever": 927, "playtime_last_two_weeks": 0, "last_played": 1511936416}, "language": "english", "review": "I've been playing this game, two hours at a time, for several weeks. When I say several, I mean like.. eleven weeks. This has given me a lot of time to process.\n\nYes, I received this game from PR -- but that's never really mattered to me when it came to being critical. Visual Novels nowadays seem rather pedantic and they almost seem built to be cheap little one-man-shows where the writer monologues you until you're passing out from the pretentiousness.\n\nThis game is not that. In fact, this game is written with such a love for comedy and yet realistic drama which is wrapped around a fantasy story in which a girl kisses animals and sprouts enchanted young men. The artwork is close to the chest and done with an innocent love for these characters. It's bright, it's darling and not even remotely your typical fare. If you can get past some of the repetetive explanations of their plight to each new character they encounter, Animal Lover will take you on an emotional journey on getting to know people outside of your typical comfort zones.\n\nThe lead character grows before your eyes, which is thanks to the writer and those characters that look so light-hearted and cute, start to develop slowly but surely as you fight your way through this complicated situation thrust upon an everyday person.\n\nSo, if you have several hours to devote to dialogue that Kevin Smith would salivate over and you want artwork that is endearingly sweet and perfected for their story -- get this game. Get this game, mull over its many choices and its romances and then share it with your friends. \n\nTL;DR -- I played Dream Daddy for four hours and never went back. This game, however, has captured my heart and allowed itself a dozen hours of my time to this point. Get it and dig deep.", "timestamp_created": 1514967535, "timestamp_updated": 1514967535, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.522316", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "38991855": {"recommendationid": "38991855", "author": {"steamid": "76561198255565602", "num_games_owned": 50, "num_reviews": 3, "playtime_forever": 996, "playtime_last_two_weeks": 0, "last_played": 1515170347}, "language": "english", "review": "I really enjoyed playing this game! The art was good, the music was well placed, and it was well written. I wish it could have touched on the romance aspect a bit more, because what I did get I liked. It dealt with complicated issues in a manner that I felt was pretty respectful. There were some times when I was a little dubious, but there were no major issues. Honestly, the way it handled the main antagonist was much better than I was expecting. I kind of held my breath the entire way there in the first play through, and there were some routes I was more satisfied with how it was handled than others, but that's just part of playing a multi-ending visual novel. \n\nI enjoyed the voice the character was given and the chance to make so many choices. Normally it annoys me if there are many choices that don't really impact the outcome of the game, but it felt like it gave life to the protagonist and I liked that I didn't always have to agree with the boys to have them like me. A lot of this game builds up a friendly rapport and allows you to get comfortable with everyone before making a final choice. You also get to see a lot of interaction between characters outside the protagonist and their chosen love interest, which I enjoyed. I have some issues with the way Charlie was handled, but I think part of it is me wishing I enjoyed him more as a character. [spoiler]Personal opinion is that his was definitely the most lackluster route and the least satisfying. I was actually pretty annoyed with the way he handled his personal conflicts. [/spoiler]\n\nTLDR: Overall, this is a great game, and I'd really recommend it. Good art, music, writing. Nice plot that delves into deeper  issues pretty well. A lot of interaction with the characters, but not a lot of romance.\n\n\nEdit Edit: [spoiler] JK, apparently they all can confess and I was just consistently saying all the wrong things. So that pretty much clears that issue up.[/spoiler]\n\n[spoiler]I get that the antagonist is handling things really poorly, but it just sort of bothers me that... there's no real way to help her move past it or feel better? Like, I understand why the narrative is the way it is. It's just, I wish that, because of all she's gone through, there was some real comfort for her at the end. And it really bothers me that the only ending where she gets that comfort is through like, continued male violence, and like... against her will. [/spoiler]\n\nTLDR: [spoiler]Treating the antagonist nicer, all things considered, would really up my enjoyment of the game.[/spoiler]", "timestamp_created": 1514934729, "timestamp_updated": 1515171474, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500693", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38913790": {"recommendationid": "38913790", "author": {"steamid": "76561198347675413", "num_games_owned": 9, "num_reviews": 1, "playtime_forever": 120, "playtime_last_two_weeks": 0, "last_played": 1514900483}, "language": "english", "review": "Honestly, I really enjoyed this game! There's a few minor things I was expecting more from it though (such as more endings, a tad more content on each route and a skip button for already read text, instead of skipping everything) but apart from those things there's quite a bit to like about this game. I (like most others, probably) instantly fell in love with all of the characters, they each have their little quirks and it's pretty easy to see the different decades of time they came from. It's hard for me to pick a favorite too. In general I liked the characters and music the most, I've got to admit I even weeped a tear during one scene (while most others I was quietly screaming over how cute these boys were?!). \n\nIf you're looking to have a minor heart attack over attractive guys then this game is definitely what you're looking for.", "timestamp_created": 1514751870, "timestamp_updated": 1514751870, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.547894", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38887222": {"recommendationid": "38887222", "author": {"steamid": "76561198043609661", "num_games_owned": 574, "num_reviews": 12, "playtime_forever": 560, "playtime_last_two_weeks": 0, "last_played": 1511765550}, "language": "english", "review": "MY OPINION OF THIS GAME IS: Overwhelmingly positive.\n\nPROS\n- Frankie is good\n- They're All Good Boys Actually\n- Really makes ya think \n- Surprisingly Cathartic\n\nCONS\n- Doesn't have furries\n- Let me date Aadara\n\n\nI'm bad at writing serious reviews, but this game is fun, Take It From Me, An Internet Stranger.", "timestamp_created": 1514692457, "timestamp_updated": 1514692457, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.526486", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38863546": {"recommendationid": "38863546", "author": {"steamid": "76561198298582255", "num_games_owned": 43, "num_reviews": 12, "playtime_forever": 890, "playtime_last_two_weeks": 0, "last_played": 1502868555}, "language": "english", "review": "It's an amazing game with a wonderful soundtrack and since it's Winter sale is 50% off I decided it would be appropriate to finally review it! I've done all of the routes and honestly can't get enough of it! The art totally fits my aesthetic, the dialog is enriching with a smart sense of humor. Whatever expectations you hold for this game doesn't matter since this has something for everyone, I very much reccomend this game!", "timestamp_created": 1514646354, "timestamp_updated": 1514646354, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500693", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38845189": {"recommendationid": "38845189", "author": {"steamid": "76561198175426222", "num_games_owned": 89, "num_reviews": 15, "playtime_forever": 674, "playtime_last_two_weeks": 0, "last_played": 1514527588}, "language": "english", "review": "[h1]I love this visual novel. A must play/read for any VN fan.[/h1]\n\nIt may seem to be a little off putting by seeing animals, but it's only about dating the men who were animals. Not dating the animals. Anyway, the story of why and how each of them were changed was very interesting. And the music is fun and relaxing, until Kyle showed up, and another character. Plus, it does a good job in keeping you invested in learning the truth of it all.\nYet, I found after I played through one route completely, I mainly just skipped through everything to get the other route's endings. Which made it not as good as going through it the first time. It just didn't seem like there was much of any extra content between the routes. Just a few different conversations. But it was still good to play through the first time, and then kinda annoying to get the other endings and achievements.\n\nThough the cannon ending/route, as the achievement called it, isn't really my fav. [spoiler]Edmund's was my fav, and the first route I did. Kyle's ending, and the cannon ending, was still interesting, but not as sweet as Edmund's. At least in my opinion. Oh and Aadara is a real b***h.[/spoiler] Yet it is still probably one of my favourite VN's. Really enjoyed it.\n\n[b]8/10 would fall for a man who was an animal for a while, all over again :)[/b]", "timestamp_created": 1514606400, "timestamp_updated": 1514606400, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.577960", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38837998": {"recommendationid": "38837998", "author": {"steamid": "76561198181041053", "num_games_owned": 14, "num_reviews": 1, "playtime_forever": 164, "playtime_last_two_weeks": 0, "last_played": 1514588662}, "language": "english", "review": "MY FURRY FERRET HUSBAND IS LOVE !!!!!!!!!!!!!!!!!!!!!!!!!!!", "timestamp_created": 1514588860, "timestamp_updated": 1514588860, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500693", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38791286": {"recommendationid": "38791286", "author": {"steamid": "76561198089637716", "num_games_owned": 130, "num_reviews": 1, "playtime_forever": 1050, "playtime_last_two_weeks": 0, "last_played": 1505917057}, "language": "english", "review": "Best VN I've ever played. This game has a lot of heart and actually makes you think. The backstory of each bachelor/route is well thought out and very human. Watching them own up to their mistakes and learn from them and want to grow is worth a playthrough. A lot of VNs try to strike a good balance between romance, comedy, and thought-provoking plot but I've never found one that succeeds as well as this one. The characters and story stuck with me for a long time. Also, the MC is fun and real. She has her own opinions and thoughts and feels like a whole person, unlike many otome/VN MCs.\n\nBuy it, support the creators. More VNs need to be like this.", "timestamp_created": 1514488382, "timestamp_updated": 1514488382, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.546527", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38770997": {"recommendationid": "38770997", "author": {"steamid": "76561198203757041", "num_games_owned": 112, "num_reviews": 2, "playtime_forever": 834, "playtime_last_two_weeks": 0, "last_played": 1514621509}, "language": "english", "review": "This is one of the funniest dating sims i've ever played- its not forced either. It's got a very smooth flow, good writing and characters and at the end you really like all of them!  Even if dating sims arent your thing you'd probably like this. It'll make you cry a bit too ;-;", "timestamp_created": 1514447775, "timestamp_updated": 1514447775, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.490889", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38604444": {"recommendationid": "38604444", "author": {"steamid": "76561198035906519", "num_games_owned": 556, "num_reviews": 21, "playtime_forever": 521, "playtime_last_two_weeks": 0, "last_played": 1509788556}, "language": "english", "review": "dating sim\n\n\n(i don't normally do this but i want this game removed from my account.)", "timestamp_created": 1514084354, "timestamp_updated": 1514084354, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.449097", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "timestamp_dev_responded": 1514141601, "developer_response": "Hello there!\n\nIf you'd like to have the game removed from your account, you can do so at https://help.steampowered.com/en/\n\nMay I ask why it is that you'd like to have Animal Lover removed from your account in light of your positive recommendation on this review?\n\nBest of luck!"}, "38558675": {"recommendationid": "38558675", "author": {"steamid": "76561198271893890", "num_games_owned": 64, "num_reviews": 3, "playtime_forever": 1652, "playtime_last_two_weeks": 0, "last_played": 1514070238}, "language": "english", "review": "This game is a wonderful addition to the english visual novel community. First things first, this game is hilarious. The dialogue and banter between the characters is so wonderfully hammy and ridiculous that it never failed to put a big smile on my face. The characters are all written in a very realistic manner. Each character is from a different time period, and the writers took great cares to make sure that they all felt like they truly were from those times. It touches upon some of the events during those time periods that effects the characters and their perceptions today, such as stigmas against sexuality, or sexual harrassment. The game balances a perfect blend of funny and serious, and excels at both without dropping the quality of one or the other. I sincerely love this game, though it is not without its faults. For one thing, the characters swear a LOT. If you don't care for a ton of swearing in games, this might not be for you. Furthermore, the game more or less follows one plotline throughout the routes, so once you play one route, you'll be repeating a few steps each route. It's not as bad the first couple of times, but can get kind of annoying the 4th or 5th time through. The art style can take some getting used to, though I personally don't find it disagreeable, I know some others dislike the cartoony look. Finally, the game sports a tiny amount of CGs, I believe it is like 2 or 3 route exclusive ones per route, which is rather small. It isn't terrible, but it's something to watch out for if you're bothered by that kind of thing. All in all, I believe that the game is still a wonderful, enjoyable time that manages to be thought provoking and touches upon many issues that aren't explored in many games. I believe that the biggest thing that makes me truly believe in it is that it touches upon forgiveness. Many of the characters have done wrong in the past, and these actions eventually come to light in the route, and each of the characters are forced to face this ugly wrongdoing head on. It's up to the player whether they want to forgive the person or not, and I think that that is a very poignant story device that is fitting in today's world, with so many people who scrutinize others to such extreme degrees that they refuse forgiveness in any shape or form. It is truly thought provoking and is a fantastic examination of today's social landscape. All in all, I'd heavily recommend the game despite its faults.", "timestamp_created": 1513997935, "timestamp_updated": 1513997935, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.474830", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38301493": {"recommendationid": "38301493", "author": {"steamid": "76561198275931064", "num_games_owned": 29, "num_reviews": 16, "playtime_forever": 1030, "playtime_last_two_weeks": 0, "last_played": 1511885643}, "language": "english", "review": "A present from friend since she's a fan of this game. The game story is nothing special but have been well written. However, evething else have to be improve: the art, the GUI, the system... At least the art here much better than the dev of Serafina's Crown. I'm not recommend it with full price. Plus, I feel that the dev kind of lazy writing and drawing... Maybe if you get it on sale around 11$ would be better.", "timestamp_created": 1513259544, "timestamp_updated": 1513259544, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.474830", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38250333": {"recommendationid": "38250333", "author": {"steamid": "76561198281881533", "num_games_owned": 75, "num_reviews": 11, "playtime_forever": 621, "playtime_last_two_weeks": 0, "last_played": 1513492171}, "language": "schinese", "review": "挂卡党噩梦，8张卡，一张1毛钱，我tm............\n不过呢，游戏还不错", "timestamp_created": 1513057249, "timestamp_updated": 1513057249, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38096870": {"recommendationid": "38096870", "author": {"steamid": "76561198249715008", "num_games_owned": 187, "num_reviews": 2, "playtime_forever": 1348, "playtime_last_two_weeks": 0, "last_played": 1513985131}, "language": "schinese", "review": "非常不错的乙女游戏，英文不难懂，四六级的水平基本可以顺畅看完\nAnimal Lover最大的亮点是它的剧情，虽然是一个独立游戏，但是剧情非常丰满。讲述女主Lucy在暑期实习阶段偶然拯救了被变成动物的5位男主的故事。相比于日本的乙女游戏中无所不能的高中生，本作设定贴切生活，剧情中关于人物的日常生活描写也非常细腻。本以为剧情会已拯救男主发展没想到到最后还会翻转，悬念很足。\n美中不足的是没有语言而且CG也不多。\n", "timestamp_created": 1512543257, "timestamp_updated": 1512543257, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37996941": {"recommendationid": "37996941", "author": {"steamid": "76561198349616321", "num_games_owned": 675, "num_reviews": 3, "playtime_forever": 508, "playtime_last_two_weeks": 0, "last_played": 1512815231}, "language": "schinese", "review": "作为一款耽美游戏，非常的不错\n但是作为小黄油 广大男性朋友们表示很无奈 这样一款男同游戏会搞吐他们的好吧~_~\n满分妥妥的", "timestamp_created": 1512202921, "timestamp_updated": 1512202921, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.576923", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37991907": {"recommendationid": "37991907", "author": {"steamid": "76561198213814683", "num_games_owned": 8, "num_reviews": 1, "playtime_forever": 729, "playtime_last_two_weeks": 11, "last_played": 1515907607}, "language": "english", "review": "I bought this game only because I like dating sims and I thought it would be cute and fun.  What I didnt expect was to beat it in about two days beause I just couldnt put it down. (The only downside is what do I do now??)\n\nI love ow diverse the characters are.  All with their own stories ad personalities.  not only that, but who you play as has a personality of their own, creating more interesting dialogue and narrative as the story progresses.\n\nHonestly, this game is so heartwarming.  It made me laugh a lot, and it made me cry and I hope more people play this wonderful game!  Plus, any game where just looking at a character makes me want to play it is always a bonus.", "timestamp_created": 1512183301, "timestamp_updated": 1512183301, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.490889", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36778223": {"recommendationid": "36778223", "author": {"steamid": "76561198043660385", "num_games_owned": 1479, "num_reviews": 74, "playtime_forever": 732, "playtime_last_two_weeks": 0, "last_played": 1512209746}, "language": "russian", "review": "Итак, сразу скажу, что новелла мне очень понравилась и она определённо рекомендуется к прочтению тем, кто не ленится и хочет с удовольствием провести время.\n\nА теперь поподробней.\n\nПрежде всего хочу сказать, что, несмотря ни на что, эту историю следует воспринимать больше как комедию с элементами фэнтези, а не как отоме. Я серьёзно опасался, что это будет типичная отоме с псевдо-зоофильским уклоном, каких немало. Но нет, здесь с этим всё в порядке. Это интересная и очень даже затягивающая история о девушке, которая волей случая сталкивается с довольно необычными личностями. Повествование живое, и оттого сложно оставаться равнодушным. И ты веришь в происходящее, веришь в персонажей.\nМного шуток, которые не выглядят натянутыми, а просто спонтанно появляются в ходе разговора. Потому что все мы иногда говорим довольно забавные вещи даже не осознавая того. А здесь мы имеем дело с несколькими людьми, которые имеют совершенно разные характеры, но проводят вместе немало времени (практически круглые сутки). Их споры и попытки узнать лучше друг друга, составление планов и просто развлечения - всё это искрит необычайным взаимодействием между персонажами, которое выглядит естественным.\nЭто в немалой степени вызвано и тем, что каждым персонаж очень хорошо прописан. По ходу сюжета мы узнаём немало деталей о них: об их семьях и друзьях, их интересах и планах на будущее, их проблемах и желаниях. И каждый персонаж уникален.\nОчень хорошо реализуется элемент \"привет их прошлого\": персонажи, жившие задолго до нашего времени, оказываются в настоящем (2017 год) и сталкиваются не только с незнакомыми местами и людьми, но и просто прогрессом. Эта тема поднималась во многих фильмах/книгах/подставьте-нужное, но нередко персонажи из прошлого выглядят как идиоты из-за того, что не воспринимают реальность вокруг себя должным образом. В этой игре персонажи реагируют адекватно. Да, они в шоке. Но они не тормозят на каждом непонятном слове, они не сравнивают всё с допотопными технологями и т.п. Это сложно передать словами, но они ведут себя по-человечески. И это радует. А ещё они имеют определённые черты, свойственные своему времени. Потому здесь идёт не только различие характеров, но и воспитания/культуры/мировоззрения.\nЕщё \"жизненности\" персонажам придаёт рисовка. Она хороша. Хотя по скриншотам можно усомниться в этом, но графическая составляющая здесь выполнена на \"отлично\", хотя мелкие огрехи всегда можно отыскать. Рисовка персонажей выполнена в мультяшном стиле, отчасти даже карикатурном. Особенно хочется выделить большое количество [очень выразительных] эмоций, которые могут отражаться на лицах персонажей, из-за чего все диалоги выглядят особенно достоверно.\nРомантическая составляющая присутствует, это да. Но она не перетягивает на себя сюжет. Практически всю игру здесь идёт \"дружеская\" линия с несколькими неловкими/непристойными/слишком-личными моментами. Изначально казалось, что вся игра будет типичным \"угоди парню, чтоб ему понравиться\", но нет. Особенно первые выборы подталкивали к данной мысли, однако позже здесь идёт очень много сложных выборов или просто юмористических. Серьёзно, многие выборы смешат сами по себе. Сделайте выбор: \"Ну нет, б****\" / \"На*** это\". Да, такие своеобразные выборы здесь бывают время от времени. Но я ушёл от темы. Короче, романтика проявляется уже к концу. В паре (не самых коротких) диалогов и эпилоге. И к ним идут красивые CG. Всё выглядит лаконично и естественно.\nНо не стоит думать, что игра поверхностна и строится только на юморе. Из-за того, что персонажи такие живые, истории не чужда глубина и детализация. Здесь есть и конфликты: серьёзные и не очень. Есть драма. Есть трагичность. Потому относитесь серьёзней к происходящему.\n\nИз минусов могу отметить разве что пару мелких багов: \n- некоторые реплики подписаны как сказанные персонажами, хотя являются частью повествования. Это может немного сбить с толку.\n- один раз персонаж должен был быть голым, а изображён был одетым. Это вообще ни на что не влияло, но опять же сбило с толку.\n\nВ общем, рекомендуется всем. Эта игра достойна того, чтобы её прочитать.", "timestamp_created": 1511381513, "timestamp_updated": 1511448181, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.586702", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36556464": {"recommendationid": "36556464", "author": {"steamid": "76561198074581225", "num_games_owned": 51, "num_reviews": 2, "playtime_forever": 570, "playtime_last_two_weeks": 0, "last_played": 1511384213}, "language": "english", "review": "I love the writing (oh, 21st century problems at their best) and the characters - there should be more guys like them in those kind of games. All of them are worth playing another route. I only went with Frankie by now but I'm definitely going to play it again soon. Or maybe I'm stuck forever with Frankie's route. Huh.\n\nOh, and the Fruits Basket reference. I laughed so hard sitting alone in my room xD Thank you guys for this great game!", "timestamp_created": 1510858025, "timestamp_updated": 1510858025, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.513134", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36064386": {"recommendationid": "36064386", "author": {"steamid": "76561198062605274", "num_games_owned": 1180, "num_reviews": 19, "playtime_forever": 484, "playtime_last_two_weeks": 0, "last_played": 1509117876}, "language": "english", "review": "Someone gifted me this game, now I'm gay. 10/10", "timestamp_created": 1509163292, "timestamp_updated": 1509163292, "voted_up": true, "votes_up": 7, "votes_funny": 18, "weighted_vote_score": "0.582632", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "35995448": {"recommendationid": "35995448", "author": {"steamid": "76561198046921062", "num_games_owned": 56, "num_reviews": 3, "playtime_forever": 398, "playtime_last_two_weeks": 61, "last_played": 1515989758}, "language": "english", "review": "First off, don't get weirded out by the name!\nThe writing is great and the characters are fun folks you'd actually want to hang out with. Super bonus since they're all displaced from different decades/eras and talk according to their time and ideals (ie, old-timey prince boy, 20's greaser dude, 80's punk kid, and 90's fitness bro.) They hang out and bond (or fight) when you're not there either, so they don't feel like characters who're solely dependant on the main girl for character development. What a breath of fresh air!\n\nPROS\n-Excellent writing and hearty storyline\n-Engaging characters and dialogue\n-Characters displaced from different decades!\n-Dope references!\n-Believable and multi-faceted characters and MC - everyone goes through doubts, stresses, and funtimes so nobody feels one-dimensional <3\n-Appealing character designs!\n-THICC BOYS yaaaaassss\n\nCONS\n-Jesus christ, that title... Animal Lover sounds cringy as hell.\n-Not a fan of the logo! \n-Sometimes the art is meh (but more often than not, it's great)\n-Personally, I didn't like the MC's design as much as everyone else?\n-Despite the excellent plot, most of the guys' endings follow the same storyline, so for the most part you get a very similar experience going with one dude (it only really branches off into husbando territories near the end)\n\nAnyways, I had a lot of fun with this one! Give it a shot.", "timestamp_created": 1508957692, "timestamp_updated": 1508957692, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.500693", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35788253": {"recommendationid": "35788253", "author": {"steamid": "76561198123555920", "num_games_owned": 135, "num_reviews": 7, "playtime_forever": 2295, "playtime_last_two_weeks": 0, "last_played": 1493699636}, "language": "english", "review": "Awesome game! The characters had a lot of personality. I felt like it did a good job of making you feel like each route was fairly unique. Any time you have a single story arch and try to fit the different routes into that one line you have some overlap. This however didn't leave me feeling like I was only playing tiny variations of the main story line. Helps that each route had a unique ending. I will definitely play through this again sometime.", "timestamp_created": 1508221664, "timestamp_updated": 1508221664, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.540604", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35763396": {"recommendationid": "35763396", "author": {"steamid": "76561198163102431", "num_games_owned": 271, "num_reviews": 3, "playtime_forever": 447, "playtime_last_two_weeks": 0, "last_played": 1508188686}, "language": "spanish", "review": "Una historia penetrante 10/10", "timestamp_created": 1508121547, "timestamp_updated": 1508121547, "voted_up": true, "votes_up": 1, "votes_funny": 3, "weighted_vote_score": "0.502712", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "35629749": {"recommendationid": "35629749", "author": {"steamid": "76561198067093752", "num_games_owned": 138, "num_reviews": 10, "playtime_forever": 1403, "playtime_last_two_weeks": 0, "last_played": 1507687368}, "language": "english", "review": "10/10", "timestamp_created": 1507687401, "timestamp_updated": 1507687401, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.478953", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34521690": {"recommendationid": "34521690", "author": {"steamid": "76561198410827251", "num_games_owned": 8, "num_reviews": 2, "playtime_forever": 5969, "playtime_last_two_weeks": 0, "last_played": 1509853162}, "language": "english", "review": "When I first saw this game it did not seem all that appealling but after playing the demo at least 50 times I found myself like the game more and more it was very well drawn and I loved the dialouge between the guys and Lucy it was very appealling so when I was able I bought the game which I do not regret it may have been a little pricey but it was a very fun game to play and I really enjoyed playing through it and would definitly recommend this game to many people it was very well crafted in every sense Amazing artwork including both the characters and the backgrounds I also though the dialouge was very well wrote and looked like a lot of time and effort when into making this game I do have a note I would really like to see more with the endings maybe a DLC that adds more to each guys ending at least another date would be nice to see I would definitly buy this DLC if it were to become an actual product I am very satisfied with this product and would definitly like to see more games by the creators maybe even a second animal lover with a whole new adventure with guys that would be Amazing I give the game creators my deepest belief that this is one of the best games I have definitly purchased if the creators made more games I would definitly one of the people to buy them.", "timestamp_created": 1503813252, "timestamp_updated": 1503813252, "voted_up": true, "votes_up": 3, "votes_funny": 3, "weighted_vote_score": "0.489553", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34405508": {"recommendationid": "34405508", "author": {"steamid": "76561198002590465", "num_games_owned": 627, "num_reviews": 8, "playtime_forever": 991, "playtime_last_two_weeks": 0, "last_played": 1503287993}, "language": "english", "review": "I didn't think I would like this game just based off of how awful the name is. I got this in an indie bundle for like a dollar so with that and the name I thought it would be god awful.\n\nBut it wasn't! I really enjoyed it actually. The story was intriquing enough to keep me interested throughout and the art style, while not great, is nice simply because it's different. \n\nThe only things I really didn't enjoy was having a face to my character - I kinda like being a faceless protagonist; and the skip feature was a little clunky. (I also don't enjoy seeing typos in my game but I'll forgive that cuz obvious small indie production.)\n\nAnyway, if you see this on sale give it a shot.", "timestamp_created": 1503361849, "timestamp_updated": 1503361849, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.526955", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34322036": {"recommendationid": "34322036", "author": {"steamid": "76561198016884110", "num_games_owned": 314, "num_reviews": 2, "playtime_forever": 617, "playtime_last_two_weeks": 0, "last_played": 1502694981}, "language": "english", "review": "This writing in this game is excellent and the dateable (and non-dateable) characters have depth and conversation skills that are rare in otome games. They have interesting motivations and consistent personalities. Added bonus: the MC comes with a snarky personality! Yes! Any otome-style game that doesn't force me to play as a wet noodle is a welcome break. Also, refreshing to see a Western art style in what is typically an Asian-dominated medium.\n\nBut alas, some cons - the main issue with this game is that once you play through a route once, you've experienced the majority of the game. The game's story is unique, and very cool, but it doesn't alter or expand much with different partner choices. The skip function in this game is also a little clunky, and while functional, requires more button-clicking than strictly necessary. Lastly, aside from the name, the MC also comes with zero customization options.\n\nThis is a pro or a con depending on your preference, but this game is probably a PG-13? The CGs are nice (although there isn't a gallery you can re-visit them in), but you're looking pretty exclusively at kisses and cute animals WHICH I AM ALL FOR.", "timestamp_created": 1503037665, "timestamp_updated": 1503037665, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.517132", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34204910": {"recommendationid": "34204910", "author": {"steamid": "76561198046141885", "num_games_owned": 414, "num_reviews": 4, "playtime_forever": 549, "playtime_last_two_weeks": 0, "last_played": 1502323876}, "language": "english", "review": "I was not expecting to like this game as much as I did. I really enjoyed it. The dialogue was funny and the characters were varied and interesting. I had a lot of fun. If you are a fan of visual novel/dating sim games give it a try.", "timestamp_created": 1502593277, "timestamp_updated": 1502593277, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.559658", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34118538": {"recommendationid": "34118538", "author": {"steamid": "76561198346566486", "num_games_owned": 75, "num_reviews": 2, "playtime_forever": 263, "playtime_last_two_weeks": 0, "last_played": 1502434702}, "language": "english", "review": "This game is rather beautiful. The characters were well written and had a very good dynamic with one another. It was an excellent story and as I am not a very good reviewer I'll just say that I am looking forward to what Trainwreck studios will be making in the future.", "timestamp_created": 1502257590, "timestamp_updated": 1502257590, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.517132", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34081175": {"recommendationid": "34081175", "author": {"steamid": "76561198139328230", "num_games_owned": 1829, "num_reviews": 218, "playtime_forever": 1308, "playtime_last_two_weeks": 0, "last_played": 1502107548}, "language": "english", "review": "[b]What is tolerance? It is the consequence of humanity. We are all formed of frailty and error; let us pardon reciprocally each other's folly - that is the first law of nature. - Voltaire[/b]\n\nBacked by a small populace, developed by a trio of people who makes up the whole team of Trainwreck Studios and coming into heavily Asian dominated market of otome games during February this year, [i]Animal Lover[/i] is one of the best in the genre in means of realistic interaction, narrative and character build that I've ever encountered. It is refreshing enough to encounter an indie otome game developed by an American Team, but the product itself ended up well beyond my expectations.\n\nOur protagonist is an ordinary Jane named Lucy - or whatever you decided to call her. She is interning at a local vet clinic before college during her soon to be the longest summer ever. As Lucy has been receiving messages for the doctor, a small girl and her mother appear with a hamster cage, which includes the sweet, tiny rodent. While picking up the animal Lucy absentmindedly kisses it, which results the little guy instantaneously turning into a charming, handsome young man! As the family flees away in terror, Lucy manages to hide this weird man from the doctor. So, this is how she meets Edmund - the first of quite a many endearing fellow a witch once cursed with animal forms. She and Edmund start looking around town to recruit other unfortunate transmuted souls to eventually find a permenant way to break their curse. In the meanwhile, Lucy and all these fine gentlemen become some sort of an involuntary family, having moments grand, absurd and heart wrecking all together. At the end of the summer, nothing will be the same for either Lucy or any of her beaus.\n\nIntriguing? Yeah, but the scenario isn't the best part of this whole lovely chaos. Both the atmosphere and characters themselves are exceedingly well-written, containing genuine character depth, with flaws, eccentricities, insecurities, endearments, hobbies, philosophies and quirks. These boys are not your stereotypical charming princes, or dangerous bad boys. They do not fit into stereotypes. You can feel that they are real people with backgrounds, worries and character traits in every sentence coming from them. None of them are exceedingly pretty or unrealistically head over heels in love with the protagonist either. Sure, the game is an otome but the flirting doesn't dominate the whole game like many other games in the market. As the storyline itself proceeds, you witness your relationship with the man of your choice improve naturally. It's as if you getting together with one of these guys is not the aim, but a pleasant side effect of all these absurd chain of events - which is ten thousand times more realistic compared to any Asian otome I've seen in the market. In the same way, our protagonist is not the surrealistically perfect Barbie doll with dubious choices and questionable taste in men which we commonly encounter in the otome genre. Lucy is down to earth, smart, and realistic. She has her nervous moments, her principals and her own quirks. She isn't portrayed as a super sexy or ephemeral beauty. She is ordinary looking, short for her age and even chubby. She is one of the most realistic female leads that I've ever seen in this genre.\n\nIf there is one thing that didn't satisfy me in this game, it was the limited number of artworks. Sure, character sprites were really various in expressions, but there were only 2 CGs per route - which is a tad bit limited for my taste. Still, artwork not becoming a medium of fan service in an otome was refreshing. All characters involved are cute enough, but not fairytale depictions of some tropes. It was all sweet and appropriate for the tone of the game.\n\nCan I say anything else at this point? Nah, not really. The game is worthy of the full price with the amount of fun you are getting and the playtime you will be putting into this one. The hamster, the cat, the ferret, the dog or... the bear! Pick whichever you like, I bet they'll surprise you in good, bad and dazzling ways. This one comes with flying recommendations!\n\nPlease also check out Lady Storyteller's Curator page [url=http://steamcommunity.com/groups/ladystoryteller#curation]here[/url] - follow for regular updates on reviews for other games!", "timestamp_created": 1502110544, "timestamp_updated": 1511937377, "voted_up": true, "votes_up": 49, "votes_funny": 1, "weighted_vote_score": "0.855215", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34047137": {"recommendationid": "34047137", "author": {"steamid": "76561198031725579", "num_games_owned": 241, "num_reviews": 26, "playtime_forever": 528, "playtime_last_two_weeks": 0, "last_played": 1502158656}, "language": "english", "review": "My first full play through, the only one where I read all the text, took about 5.5 hours. I've managed to get \"good\" endings for all the guys, although I haven't yet looked into whether the \"canon ending\" is only possible with one particular guy or if there's a version of it for each of them. (Edit: After looking through the Discussion area, I'm thinking the canon ending is only for that one character, which I'm cool with since I loved him.)\n\nPros:\n- This isn't one of those stat raising visual novels - there are decision points where you have to choose between different actions and dialogue and that's it, thank goodness. \n- There were some nice funny moments.\n- The heroine wasn't a wet washcloth with no personality.\n- I actually kind of liked all the guys, although I did develop some strong favorites. My most unexpected favorite: Kyle.\n- I'm probably in the minority here, but I'm kind of glad the romance in this was just limited to talking, a date, and kiss here and there - no sex, even fade-to-black.\n\nCons:\n- It takes a long time for the heroine to find and transform all five guys. Way longer than I thought it would. Also, if you go into this expecting it to be a dating sim, be prepared for it to also take ages for anything like a date to happen. Maybe two thirds of the game?\n- I wasn't a fan of the art style, although it eventually grew on me.\n- No art gallery. If you have particular scenes you like, you'll need to take a screenshot.\n- The whole \"trying to figure out how to change the guys back to human for good\" story felt surprisingly calm and unrushed. I was a little surprised there weren't more emotionally charged moments, considering that these guys were never going to get back the lives they used to have. Sure, there were jokes about Frankie having trouble believing in the existence of the internet and whatnot, but most of the guys took things really, really well. Even [spoiler]Kyle[/spoiler] seemed to handle things well, until that one moment.\n\nWhile I wish the story hadn't taken quite so long to get going, I enjoyed this overall.", "timestamp_created": 1501969539, "timestamp_updated": 1501975212, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.539374", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33985734": {"recommendationid": "33985734", "author": {"steamid": "76561198072955200", "num_games_owned": 287, "num_reviews": 4, "playtime_forever": 380, "playtime_last_two_weeks": 0, "last_played": 1501873242}, "language": "english", "review": "9/10. Made me care about the boys, which not many visual novels or games do to me. Edmund and Kyle are super cute. [spoiler]That one part really screwed up my feels because I really liked Kyle.[/spoiler]\n\nIt's been 4 hours since I completed the canon storyline and I still have butterflies in my stomach.", "timestamp_created": 1501738250, "timestamp_updated": 1501756574, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.507968", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33916978": {"recommendationid": "33916978", "author": {"steamid": "76561198018375237", "num_games_owned": 12, "num_reviews": 2, "playtime_forever": 595, "playtime_last_two_weeks": 0, "last_played": 1501458424}, "language": "english", "review": "You get the false impression at first that the art is too cartoonish.  But the the texture of the pictures are much better quality than some visual novels.  Also you see a lot more changes in expression than in other visual novels.", "timestamp_created": 1501460009, "timestamp_updated": 1501460009, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.508139", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33662512": {"recommendationid": "33662512", "author": {"steamid": "76561198255180899", "num_games_owned": 43, "num_reviews": 3, "playtime_forever": 635, "playtime_last_two_weeks": 0, "last_played": 1500924787}, "language": "english", "review": "i've loved every second of playing this game; there were a lot of moments that made me laugh, and a lot of endearing encounters with each character. it's definitely a favourite. ♥", "timestamp_created": 1500511790, "timestamp_updated": 1500511790, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.517132", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33646482": {"recommendationid": "33646482", "author": {"steamid": "76561198062301817", "num_games_owned": 278, "num_reviews": 133, "playtime_forever": 543, "playtime_last_two_weeks": 0, "last_played": 1500447849}, "language": "english", "review": "A good otome, with decent love interests and an original story. It's not mind-blowing or anything, and I'm not very fond of the art style*, but it succeeds in making you have a good time. On your first run, you're curious to see how everything will unfold, as the story is quite intriguing. Without spoiling anything, let's just say I found the finale a bit too anticlimactic to my taste, but it was still a good ride; way above the average visual novel, but far from a masterpiece or a very memorable experience.\n\n*Actually it's not bad and it sets itself appart from most visual novels, but the five dateable men are all described as overly handsome, and I just can't see that with the cartoonish art style.", "timestamp_created": 1500450385, "timestamp_updated": 1505285711, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.516743", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33621798": {"recommendationid": "33621798", "author": {"steamid": "76561198373449494", "num_games_owned": 30, "num_reviews": 1, "playtime_forever": 466, "playtime_last_two_weeks": 0, "last_played": 1500354878}, "language": "english", "review": "This game...this game is a work of art on it's own. The art style is a bit rough but yet it fits well, the characters are loveable and well written, and the story....the story is one that would either make a great animation or even a comic. I laughed, I cried a little, and I fell in love with every one of these boys and the brave young lady helping them out. As someone who plays a lot of visual novels to savor the plot I definately say give this game a run guys and gals because it is very much worth it's price and time. I really hope to see more from these guys either as another story with different folks or even a sequel to this one. And to those who grab this game? I hope you enjoy it and will go for the endings as I will!", "timestamp_created": 1500349610, "timestamp_updated": 1500349610, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.515623", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33526376": {"recommendationid": "33526376", "author": {"steamid": "76561198104061952", "num_games_owned": 77, "num_reviews": 3, "playtime_forever": 650, "playtime_last_two_weeks": 0, "last_played": 1499992525}, "language": "english", "review": "Came for Dustin but enjoyed the game itself. The writing is decent, I grew fond of the art as well. Was trying not fall under my own trope by going for Kyle; ended up liking Kyle to most anyways oops, however I did not appreciate how fast it went from being strangers to saying \"I love you\" in like 2 days, but hey it's an otome. give it about a 6/10 dawgs, couldve been even more buckwild, but it was nice. REAL nice", "timestamp_created": 1499998562, "timestamp_updated": 1499998562, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.495517", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33493492": {"recommendationid": "33493492", "author": {"steamid": "76561198053277808", "num_games_owned": 95, "num_reviews": 6, "playtime_forever": 653, "playtime_last_two_weeks": 0, "last_played": 1499907444}, "language": "english", "review": "Hilarious dialogue, which kept me entertained through multiple playthroughs. Consistant style quality of illusttrations gave me life. It's a breath of fresh air.", "timestamp_created": 1499912340, "timestamp_updated": 1499912340, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.516961", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33485253": {"recommendationid": "33485253", "author": {"steamid": "76561198077577647", "num_games_owned": 66, "num_reviews": 1, "playtime_forever": 591, "playtime_last_two_weeks": 0, "last_played": 1499893080}, "language": "english", "review": "The storyline keeps not going where the characters have planned, that's pretty amazing. And the dialogues are really good. There's a great interaction amongst the all characters and it doesn't feel unnatural or strange. I'm quite engrossed with this story. I'm going to try mutliple routes, something I rarely do. I usually only play one route (sometimes because there's only one boy I'm interested in), but the characters are all pretty interesting. I like that. No one is really a big bad meanie, no sadistic type (I hate those). These guys are all pretty good guys, with a different personality. Okay Kyle's a bit bad but not in a really bad way, more like a rebel. We all like rebels, right? ;)", "timestamp_created": 1499882520, "timestamp_updated": 1499882520, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.484209", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33342296": {"recommendationid": "33342296", "author": {"steamid": "76561198069151573", "num_games_owned": 48, "num_reviews": 1, "playtime_forever": 543, "playtime_last_two_weeks": 0, "last_played": 1499433712}, "language": "english", "review": "Surprisingly not as cheesy as I thought it would be? Also main protagonist is very strong willed and definitely not soft spoken... which is freaking nice for a change. Anyway I enjoyed it :D", "timestamp_created": 1499433002, "timestamp_updated": 1499433002, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.484209", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33332305": {"recommendationid": "33332305", "author": {"steamid": "76561198401789694", "num_games_owned": 32, "num_reviews": 1, "playtime_forever": 462, "playtime_last_two_weeks": 0, "last_played": 1499313763}, "language": "english", "review": "Sacrificed all my sleep to date a sexy prince. \n\n10/10 would kiss a hamster again.", "timestamp_created": 1499400407, "timestamp_updated": 1499400407, "voted_up": true, "votes_up": 3, "votes_funny": 3, "weighted_vote_score": "0.505620", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33194957": {"recommendationid": "33194957", "author": {"steamid": "76561198141490578", "num_games_owned": 100, "num_reviews": 3, "playtime_forever": 502, "playtime_last_two_weeks": 0, "last_played": 1499103987}, "language": "english", "review": "One of the few $20 VNs that might actually be worth the price tag - depending on what you're looking for. My playthrough time of 8.4 hours is for one playthrough only, so it's a pretty long game. I'm used to VNs wrapping up in a much shorter amount of time. \n\nThis is also one of the best written VNs I've ever played. I liked the protagonist because she felt like a real person, and all of the guys were fun and hilarious. Their interactions with each other were all spot on. SO MANY great jokes. The storyline was fairly compelling, not as straightforward or stereotypical as many games.\n\nThe biggest downside, for me, is that romance plays a really minor role. It felt shoehorned in, unfortunately. As long as romance isn't the sole reason you're playing this for, you'll definitely enjoy it.", "timestamp_created": 1499105054, "timestamp_updated": 1499105054, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.517132", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33024425": {"recommendationid": "33024425", "author": {"steamid": "76561198038465396", "num_games_owned": 761, "num_reviews": 52, "playtime_forever": 232136, "playtime_last_two_weeks": 20089, "last_played": 1516000372}, "language": "english", "review": "i love loving animals *reads about the game* \"No furries! Don't let the title fool you!\" what a n awful game, plays game and people transform to feral furries >:(\nnot as good as dream daddy", "timestamp_created": 1498801651, "timestamp_updated": 1510895815, "voted_up": false, "votes_up": 0, "votes_funny": 2, "weighted_vote_score": "0.461538", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32853867": {"recommendationid": "32853867", "author": {"steamid": "76561198323852333", "num_games_owned": 35, "num_reviews": 1, "playtime_forever": 964, "playtime_last_two_weeks": 0, "last_played": 1514926741}, "language": "english", "review": "One of the best dating sims I've ever played. Had me intrigued and giggly the entire way through. The dialogue is amazing and I love each of the characters! The achievements are easy, but rewarding. And yes, there's no furries. Don't worry. 9/10", "timestamp_created": 1498567823, "timestamp_updated": 1498567823, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.539374", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32849793": {"recommendationid": "32849793", "author": {"steamid": "76561198070701993", "num_games_owned": 539, "num_reviews": 49, "playtime_forever": 454, "playtime_last_two_weeks": 0, "last_played": 1498570940}, "language": "english", "review": "used it to idle for cards :D", "timestamp_created": 1498559277, "timestamp_updated": 1498559277, "voted_up": false, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.274079", "comment_count": "2", "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "32849310": {"recommendationid": "32849310", "author": {"steamid": "76561198016420293", "num_games_owned": 393, "num_reviews": 2, "playtime_forever": 506, "playtime_last_two_weeks": 0, "last_played": 1498474313}, "language": "english", "review": "I did not expect to like this game as much as I did. The art style is not my thing and this type of 'animal turns to handsome man' story has been done quite a few times, but I still had tons of fun!\nI went through the story in one sitting, it was fast paced; sometimes funny, sometimes sad, but overall always entertaining.\nThe main heroine never annoyed me, which is a huge plus. The guys you might like more or less depending on your type, but they work great as a group and you will enjoy their little argues and interactions.\nMy only small gripe with this game, is that there are no real character routes, you just pick a few options and get your scenes and ending, but there is no real plot twist depending on which guy you pick. \n\nI say, if you are considering the game, give it a try, its really worth it :)", "timestamp_created": 1498558173, "timestamp_updated": 1511380341, "voted_up": true, "votes_up": 19, "votes_funny": 1, "weighted_vote_score": "0.730912", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32818960": {"recommendationid": "32818960", "author": {"steamid": "76561198214979021", "num_games_owned": 40, "num_reviews": 6, "playtime_forever": 500, "playtime_last_two_weeks": 0, "last_played": 1498454595}, "language": "english", "review": "I am honestly so surprised by this game. I went in thinking, \"Oh boy a furry game\" but it stays true to the promise and there are no furries. Only cute dudes who turn into animals. \nThis story was so interesting and the character development was incredible. I fell in love with Edmund IMMEDIATELY. Then Miguel. Then Kyle. And oh boy this game will 10/10 make you cry.  \n\nI liked how the heroine (Lucy) was an interesting character herself and not as cut/paste as many otome heronies are. She was unique in personality and design. I loved her as well. \nI would recommend this game to just about anyone who likes a good fairytale story and fun dialogue (mainly from Kyle). Great job! Kudos to the creators!", "timestamp_created": 1498490774, "timestamp_updated": 1498490774, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.539374", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32077363": {"recommendationid": "32077363", "author": {"steamid": "76561198130221054", "num_games_owned": 29, "num_reviews": 2, "playtime_forever": 233, "playtime_last_two_weeks": 0, "last_played": 1496202822}, "language": "english", "review": "This game was amazing! I loved Kyles route, I haven't even made it past the other routes and I already want a second game :D", "timestamp_created": 1496202949, "timestamp_updated": 1496202949, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.427199", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31983360": {"recommendationid": "31983360", "author": {"steamid": "76561198215280451", "num_games_owned": 178, "num_reviews": 26, "playtime_forever": 31, "playtime_last_two_weeks": 0, "last_played": 1507614717}, "language": "english", "review": "Poorly written characters. Meh storyline. Overall sub-par vibe. But still, not the worst way to waste time.", "timestamp_created": 1495837136, "timestamp_updated": 1495837136, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.455113", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31777199": {"recommendationid": "31777199", "author": {"steamid": "76561198156840259", "num_games_owned": 30, "num_reviews": 2, "playtime_forever": 1064, "playtime_last_two_weeks": 0, "last_played": 1494881962}, "language": "english", "review": "+ The most well-written and realistic guys I've encountered in otome; great heroine and antagonist as well\n+ Organic dialogue that flows well without meandering too much\n+ Engaging plot; good pacing\n+ Clever balance and believable depiction when tackling issues [spoiler]such as the political correctness of the 2010s vs. the more dated views of some of the guys, and their difficulties in overcoming them despite their best intentions; Miguel's was handled especially well[/spoiler]\n+ Duality when it comes to character flaws and motivations - we're always shown both sides to a conflicting view or situation\n+ Overall fantastic writing\n\n- Art style for the sprites not to my personal preference, at least for a dating sim. I don't mind non-anime art, but this was just too kids' cartoon-y for me. It was like the artist tried too hard to create \"unconventional-looking\" characters with features and facial proportions people don't usually see in this genre. (Miguel's super-spiky Pinocchio nose, for instance.)\n- No CG gallery\n- Lack of CGs in general, especially for a commercial VN\n- No visible fast-forward button that doesn't directly skip to the choice in the UI\n- Minor cringe for obvious real-person \"celebrity\" insert just for the sake of having them there when an OC could've perfectly sufficed (although mostly because it gives me war flashbacks of terrible fanfics I read/wrote in my teens)\n- As much as I loved the overall plot and dialogue, way too few route-specific scenes and lines. It made replays somewhat of a slog unless you skip straight to the last few chapters, and even then there's still a lot of repetition.\n\nDespite my list of cons being as long as that for the pros above, I would still greatly recommend this game. Although it's a fairly recent release, I still find it sad how often it goes overlooked in otome/VN communities.", "timestamp_created": 1494885514, "timestamp_updated": 1494886076, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.550859", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31655187": {"recommendationid": "31655187", "author": {"steamid": "76561198195061697", "num_games_owned": 62, "num_reviews": 1, "playtime_forever": 230, "playtime_last_two_weeks": 0, "last_played": 1494371040}, "language": "english", "review": "This game hurt me and it felt good. I'm going to go back to crying over everybody's favorite ferret boy.", "timestamp_created": 1494367352, "timestamp_updated": 1494367352, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.520936", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31451053": {"recommendationid": "31451053", "author": {"steamid": "76561198073518812", "num_games_owned": 686, "num_reviews": 32, "playtime_forever": 3241, "playtime_last_two_weeks": 0, "last_played": 1493749792}, "language": "english", "review": "this is an interesting sim/vn style game.\ni am not crazy with all the swearing...the dev's could have used less f word. \ngot this in a package...i looked here on the site and yes says sexutal content\nbut is there an age requirement for this game? just asking because this is NOT a g/a game.\n\npros\ndecent graphics\nlove the story line\nmusic...idk never use sound on these.\n\ncons\nway too much swearing...like teenagers wrote this game and thinking cursing is cool.\nthere is a thing called a thesauru even a site dedicated to alternate words instead of using the same ones over and over again and being too redundant.\n\nhttp://www.thesaurus.com/ tip use it when making these kinds of games because after awhile they all start sounding the same.\n\nmost of my hours are watching tv and other things...so my real total is like 6 hours.\n\nik seems like i am down on this game but i am not it is well language issues...and repeating same words over and over again.\n\n\ni do love the over all concept and story line. very original :)\n", "timestamp_created": 1493507039, "timestamp_updated": 1493507039, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.512728", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31393185": {"recommendationid": "31393185", "author": {"steamid": "76561198080472217", "num_games_owned": 162, "num_reviews": 5, "playtime_forever": 862, "playtime_last_two_weeks": 0, "last_played": 1500253609}, "language": "english", "review": "I have completed one route in this game and I am completely hooked so far.\n\nPros\n+Art style\n+I found the default background music to be relaxing\n+Enjoyable humor\n+Realistic interactions between characters\n+Main character isn't a pushover\n+Light on the romance (which I actually appreciated since so many otome games throw you into \"love at first sight\" situations which feel unrealistic)\n+Complex and interesting characters\n\nCons\n-No gallery\n-Strong language (I don't mind, but I think it's worth mentioning)", "timestamp_created": 1493300665, "timestamp_updated": 1493300665, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.522240", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31370983": {"recommendationid": "31370983", "author": {"steamid": "76561198069024370", "num_games_owned": 472, "num_reviews": 13, "playtime_forever": 584, "playtime_last_two_weeks": 0, "last_played": 1493157875}, "language": "english", "review": "One of my new favorite dating sims! The artwork is cute, the dialogue is witty, the plot is unique, and the romances are interesting. I genuinely enjoyed getting to know each character as I played through every romance path. The game itself isn't too short, but it doesn't drag on, either. The pacing is just right. One playthrough took me about 6 hours, and then another 4 hours (I skipped read dialogue) to play through every other ending/get all the achievements. There's several different endings but they're not so complex that you need a walkthrough to get the one you want.\n\nOverall, a really fun game that I highly recommend to fans of the genre!", "timestamp_created": 1493190053, "timestamp_updated": 1493190053, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500693", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31300124": {"recommendationid": "31300124", "author": {"steamid": "76561198080211576", "num_games_owned": 616, "num_reviews": 6, "playtime_forever": 395, "playtime_last_two_weeks": 0, "last_played": 1492875450}, "language": "english", "review": "Pros:\n- hilarious writing - ignore the screencaps, they picked the most generic lines for some reason\n- a capable protag with an actual personality (if you've played otome games, you know how rare that is)\n- romance is not the sole focus, you get to be friends with everyone\n- art style: I initially thought this would be a negative, but it really matches the writing style\n\nCons:\n- it doesn't LOOK worth the price (but IMO it is)\n- few CGs, no gallery\n- some typos, but they're very few and far between\n- some choices aren't very clear, and some boil down to the same thing (this didn't bother me though, it's mostly used for comedic effect)", "timestamp_created": 1492877464, "timestamp_updated": 1492877464, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.608421", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31251398": {"recommendationid": "31251398", "author": {"steamid": "76561198027817952", "num_games_owned": 2509, "num_reviews": 20, "playtime_forever": 614, "playtime_last_two_weeks": 0, "last_played": 1492776431}, "language": "english", "review": "I need to get up in five hours and I just spent the last thirty minutes telling myself 'just one more scene'. I'm not even through an initial playthrough, never mind actively trying to hook up with anyones route and I desperately don't want to sleep so I can finish this general read through.\n\nThen maybe try for my favorite guys route. Okay favorite couple of guys...did I say couple? I legit don't think I can actually choose between the five of them. Oh sure, there are definitely some I favor more then others as my 'type' (Frankie and Miguel being the kind I usually go for) but in all honestly I love them all, flaws and all and the interpersonal dynamic, personality quirks and all the side characters. I love them all.\n\nI got this dirt cheap on sale in its first bundle and hands down the price I paid (roughly 75% off) more then covers the cost. Even if I end up never reading anything else out of that bundle, even if I end up not liking the ending or not enjoying the actual romantic routes, the personal enjoyment I've gotten after a few hours more then covers what I paid.\n\nIf nothing else I'm looking forward to this companies next release and I doubt I'll hesitate to buy it full price if it's even half as endearing as Animal Lover is. \n\n\n10/10 Would cheer on awesome default Sue, her friends and all the beautiful beast boys any day of the week. \n\nObviously I'll edit this with new commentary if something derails into a fiery ball of awful that's visible from space, but honestly, it'd take something truly mind numbingly awful like prolonged torture scenes or multiple chapters of unrelenting abuse to make me believe this wouldn't end enjoyably. BRB gotta pay the sleep dude his pittance, run errands and then use a random number generator to figure out who to choose for my first active romance. \n\nI highly recommend if you enjoy amusing, if slightly vulgar, dialog, personalities and sometimes soapboax leaping, but overall entertaingly fleshed out characters and group dynamics. \n", "timestamp_created": 1492674874, "timestamp_updated": 1492674874, "voted_up": true, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.616104", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31090261": {"recommendationid": "31090261", "author": {"steamid": "76561198042983746", "num_games_owned": 86, "num_reviews": 1, "playtime_forever": 1385, "playtime_last_two_weeks": 0, "last_played": 1491932464}, "language": "english", "review": "Pros:\n+Nice Art\n+Good storyline\n+Varied character design\n+Characters talk like real people for the most part\n+MC isn't a pushover, which is REALLY hard to come by in most otome games\n\nCons:\n-No romance for most of it, sudden romance at very end which is VERY strong (saying 'I love you' after kissing only a few times?? I dunno, I wasn't into it, even though it was cute I had to stop myself and go 'whoa, this is really sudden')\n-Repeated but unskippable text in the ending (reading the MCs arguement at the end over and over got a lil tiring)\n-Can't date Dustin\n\nIf consistent romance and a lot of fluffy moments aren't a necessity for you in dating sims, go for it? I'm sort of neutral on this game but I'm gonna give a thumbs up because it's still better written and characterised than a lot of VNs out there.", "timestamp_created": 1491967347, "timestamp_updated": 1491967413, "voted_up": true, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.581608", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30929347": {"recommendationid": "30929347", "author": {"steamid": "76561198067305416", "num_games_owned": 273, "num_reviews": 55, "playtime_forever": 305, "playtime_last_two_weeks": 0, "last_played": 1498767142}, "language": "english", "review": "This game is so damn good.\nI played a lot of my visual novels recently and this is one of the few where people actually talk and behave like real actually people. It's also not full of the usual stereotypes and that's great. I just wish there was a \"CG gallery\" to look at all the lovely art and some more music.", "timestamp_created": 1491247627, "timestamp_updated": 1491247627, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.483251", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30896780": {"recommendationid": "30896780", "author": {"steamid": "76561198363756550", "num_games_owned": 4, "num_reviews": 2, "playtime_forever": 1085, "playtime_last_two_weeks": 0, "last_played": 1506977572}, "language": "french", "review": "Très bonne histoire en plus de graphismes très agréable... Je recommande!", "timestamp_created": 1491125235, "timestamp_updated": 1491125235, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30604159": {"recommendationid": "30604159", "author": {"steamid": "76561198120342870", "num_games_owned": 132, "num_reviews": 1, "playtime_forever": 102, "playtime_last_two_weeks": 0, "last_played": 1488157224}, "language": "english", "review": "This is by far one of my favourite otome-style games, tied for fave with Hustle-Cat\nPros:\n+ Insert your name\n+ Boys have very different personalities\n+ Boys are flawed, human, relatable characters\n+ You have to really think about some choices, it isn't just \"which will make *boy* like me most?\" Which is rare in the otome genre.\n+ Lucy (default protag name) is sassy and independant\n+ Magic\n+ Animals\n[spoiler]+ Dillon and his pug.[/spoiler]\n[spoiler]+ TAKE THE SPELL BOOK AND SPELL-BOOK IT [/spoiler]\n\nCons:\n- Some (v few) choices aren't really choices, as Lucy will do what she wants.\n- No gallery feature\n[spoiler]- THE LAST LIVING PUNK-ROCKER[/spoiler]\n- Magic not explained super well (and the devs actually have very complex, interesting ideas about it!)\n- Not really a con for me personally, but strong language throughout.", "timestamp_created": 1489884249, "timestamp_updated": 1489884249, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.544025", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30457265": {"recommendationid": "30457265", "author": {"steamid": "76561198140306503", "num_games_owned": 61, "num_reviews": 7, "playtime_forever": 966, "playtime_last_two_weeks": 0, "last_played": 1489284786}, "language": "english", "review": "This is a great game - good art, good story, good characters, fine work all the way around. My only major complaint is the big emotional drama centered around Kyle which gets dropped into the middle of the other routes. It's really off-putting if you don't particularly like Kyle or care about what happens to him. I would've preferred more focus on the guy whose route you're on. There are also a few minor bugs/typos, but on the whole, this game is well worth the money!", "timestamp_created": 1489269584, "timestamp_updated": 1489285426, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.504500", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30439212": {"recommendationid": "30439212", "author": {"steamid": "76561198019650701", "num_games_owned": 200, "num_reviews": 2, "playtime_forever": 944, "playtime_last_two_weeks": 0, "last_played": 1489618877}, "language": "english", "review": "WAAAY better than I anticipated.  The writing is clever, the dialogue feels natural and damn if ferret boy didn't weasel his way into my damn heart!!\n\nWish there was a way to view the CGs after you've finished the game, however.", "timestamp_created": 1489207521, "timestamp_updated": 1489207640, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.504500", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30346118": {"recommendationid": "30346118", "author": {"steamid": "76561198165346972", "num_games_owned": 30, "num_reviews": 1, "playtime_forever": 1503, "playtime_last_two_weeks": 0, "last_played": 1510679528}, "language": "english", "review": "I don't know what it is about this game but it wriggled its way into my heart and I was pleasantly content when I completed it! I've never really written a review before but this game has stuck with me through the past few days and I can't help myself any longer.\n\nAnimal Lover is an enchanting story with an interesting twist as well as moments I couldn't help myself grinning. I was excited for the game a long time before it was released, always a sucker for a concept involving attractive bachelors and animals. Who isn't? When I saw the game on Steam I hopped on the chance to get it, I already had my eyes on a few of these lovely beasts.\n\nThe story is great. I thoroughly enjoyed it. I found myself smiling quite a lot during the story and admittedly it got me laughing. It's nothing too thick and hefty but it catches your interest enough to keep you along for the ride. I will admit I would've liked for the routes to change a bit in terms of writing ( I get a bit uninterest when I have to skip large amounts of text I've already read over and over and over just to do another route ) but for the small bits I did get with each boy I have to say I was able to over look it. Not to mention I'm sure there were reasons behind it, be it time restraints or what not.\n\nThe characters are absolutely charming. I don't know what it is but I got so attached to each and every one of them. I was charmed by Edmund INSTANTLY. The little bugger got me good, the rest naturally were the same. Each one has their quirk and admittedly I love the difference between each one.  Poor Frankie being teased for his lingo was a big guilty pleasure.\n\nI also actually really enjoyed the art for the characters! Being a stickler for anatomy I really was pleased with the animals and the boys themselves have a charming art style I can't help loving. I really really enjoyed the extra details to the designs of the characters like Kyle's hair color and markings, Miguel's hair instantly made me think of a husky, Frankie's \"whiskers\" etc etc. I especially loved that tidbit. The backgrounds weren't AS nice but not enough to bother me much.  10/10 censor method btw\n\nAll in all I would definitely recommend the game and I'm admittedly going for a second round haha. They had me at ferrets and puppies!", "timestamp_created": 1488749927, "timestamp_updated": 1488749927, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.530846", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30256754": {"recommendationid": "30256754", "author": {"steamid": "76561198263787643", "num_games_owned": 160, "num_reviews": 7, "playtime_forever": 3389, "playtime_last_two_weeks": 0, "last_played": 1488357769}, "language": "english", "review": "I absolutely LOVE this game. The writing is fabulous and the characters are so fleshed out. They really feel like legit people not just your typical \"otome\" trope guys. The diversity between all of them, the details of the time period they're from even the MC and how she acts and looks are so much more unique then in your average visual novel. It's been awhile since I've actually felt so connected and emotional over characters in a vn and it was so refreshing. Each guy and their story is heartwarming and I literally got butterflies in my stomach throughout the game from all the sweet tender moments the MC experiences with each guy. I sincerely hope trainwreck studios does another incredible vn like this because Animal Lover just swept me off my feet and immersed me into the lives of such genuine and lovely characters! <3 <3 <3", "timestamp_created": 1488359498, "timestamp_updated": 1488359498, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.547608", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30227510": {"recommendationid": "30227510", "author": {"steamid": "76561198171262683", "num_games_owned": 262, "num_reviews": 10, "playtime_forever": 764, "playtime_last_two_weeks": 0, "last_played": 1488220473}, "language": "english", "review": "I've only done 3/6 routes (if you include the 'alone' ending.... if there is one?) but I have to recommend it so heavily.  The characters are all great and I like that, regardless who you romance, you still get to interact with the other characters - it's not \"what you don't have a crush on me, but rather someone else?  Well fuck you, too!\".  The main plot stays the same regardless who you end up with and most of the same scenes happen in all plays but I don't think that's a bad thing.  I liked it, in fact, because it felt as if I wasn't judged for the route I was on at the time.\nIn terms of characters, I fucking love them all.  The romance characters are all really nice, with pros and cons to each of them.  The antagonist's actions, while not exactly justified [spoiler] (like dude, teleport them away or make them forget you, don't fucking curse them lmao) [/spoiler] didn't feel unneeded and the characters repented when they did something wrong which is something too commonly overlooked in romance games (like when the player is forced to go \"oh I love you therefore you can do no wrong!!\", no, in this, the characters actually acknowledge they did wrong and I love that).\nLegit my ownly issue with the game is that it's tagged with 'sexual content' and there isn't any, haha.  Sure there is nudity, but no sex!  \nAnyway, I definitely recommend this game to anyone interested in a funny, sweet game with loveable characters and an interesting, albeit slightly cliched, plot!", "timestamp_created": 1488227918, "timestamp_updated": 1488227918, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.552363", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30107303": {"recommendationid": "30107303", "author": {"steamid": "76561197999732661", "num_games_owned": 2318, "num_reviews": 73, "playtime_forever": 1060, "playtime_last_two_weeks": 0, "last_played": 1487736989}, "language": "english", "review": "I've always enjoyed the writing in western VNs a tad more than their Japanese counterparts, mostly due to the male/female dynamic being more believable to a western girl like me.  Having characters who talk, act and feel real is incredibly important, no matter the gender, and that's why I love Animal Lover so much.  Sure, the story is fantastically silly, but the characters Trainwreck Studios created are all people I've come to love, even the ones I was sure I'd hate on first glance.  \n\nAnimal Lover is one of the most well-written VNs I've read in a LONG time. Granted, the plot isn't complex or deep, and things start off slow in the beginning, but the characters are amazing. Each guy has his own unique and distinct personality, and watching them interact with each other and the MC is pure joy. In the short time I've spent in game, I feel like I know them personally; and having come to the end of my journey with the gang, I'm heartbroken with how much I'm going miss them all. \n\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=865841921\nThat's to say nothing of the humor which is absolutely hilarious. I don't think I've ever laughed so hard reading a VN before (the Truth or Dare hot tub scene is comedy gold). That doesn't mean things don't get serious, and some pretty heavy themes are worked in towards the end, but it's all good stuff. The romance isn't overblown either. Some may think it's a little light on feels, but once the relationship between Lucy and her guy starts blossoming, it's really sweetly done. I'd go far as to say this is one of the few otome titles that may be just as enjoyable for guys as it for us girls as the characters are so well developed that there's plenty to relate to even if you're not of the female persuasion. \n\nAnd then there's Lucy, who's probably my favorite otome protagonist to date.  She's smart, funny, caring, and courageous (even though she may be scared as heck), but most of all, she's realistically feminine.  No, she's not going to let these guys walk all over her, but she's not too hardened to be the  emotional anchor they need, and I find that lovely.   She's also not a pixie with a 2 inch waist!  It's about damn time, y'all!\n\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=869114993\nThe game isn't perfect, however. I'd have loved a few more CGs, as the 2 per route is on the skimpy side. It's not a deal breaker as the writing more than makes up for it, but a little more artwork would have been appreciated. It's also a bit short, taking only 17 hours to fully complete (and I'm a slow reader), but those 17 hours were so enjoyable that I'm really not complaining, I just want more time with these guys cause I love them so damn much. My biggest gripe is the Skip function, which is buggy and a pain to work with. You have to be careful with its use or you run the risk of skipping right on past unread dialogue even though everything is set correctly in the options. Most of the game is common route, so you're not likely to miss too much, but it's still a hassle making sure you don't end up skipping past certain key scenes where major dialogue changes occur (the date chapter, Edmund's intervention, and the final confrontation with Aadara). Still, I'll take that bit of frustration over not experiencing the game at all.\n\nSmall issues aside, I cannot express enough how much I love Animal Lover.  It may not be THE perfect VN, but the characters it's given me places it high on my list of favorite otome games.  The price may be a little daunting, especially for a visual novel, but I promise you the amount of entertainment you'll receive from this gem is more than worth the cost of admission.\n\nNOTE: I was a Kickstarter backer, so my review doesn't count towards the average game rating since I received a key for it. BUT I indeed paid for my copy, no backyard shenanigans going on here!", "timestamp_created": 1487798294, "timestamp_updated": 1487858543, "voted_up": true, "votes_up": 88, "votes_funny": 1, "weighted_vote_score": "0.800203", "comment_count": "8", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30072315": {"recommendationid": "30072315", "author": {"steamid": "76561198085540357", "num_games_owned": 275, "num_reviews": 12, "playtime_forever": 765, "playtime_last_two_weeks": 0, "last_played": 1500881595}, "language": "english", "review": "Animal Lover has easily made it's way into my top 10 favorite visual novels, just after one playthrough. I'll admit I was very skeptical with the title at first since the whole animal/human combo character (or whatever you want to call them) aren't really my schtick. But the price was right, I had the money in my wallet, why not. \n\nThe pacing of the game is something that is pretty slow, but not in a bad way. From what I can tell the game isn't necessarily  divided into traditional routes, where you make decisions and then spend 99% of the time with your chosen character for the rest of game. Honestly, the game itself reads more as a story of these six strangers who come together through the weirdest of circumstances and how they basically become a sort of support/family unit. The romance is still definitely there, that's just my opinion on the matter.\n\nOne thing I really want to gush about is the MC. Oh. My. Gosh. She is WONDERFUL. Like the way the devs wrote her she feels so real? And there were things about her that I could specifically identify with or one of the choices that she could make was exactly what I was thinking. She actually has a personality and emotions. She gets mad, sad, annoyed, embarrassed. She acts strong but also has moments of weakness, she's an actual character. And it's just....so fricking wonderful. \n\nThe other characters are all amazing as well, all the boys are distinctly different with their backgrounds and personalities. I'm really excited to read through the other routes and see what else is going on with them. Although, I'll be honest Miguel already holds the number one spot in my heart. It's gonna be darn near impossible to top that. \n\nThe other important aspect of any VN, the story. Like I said, the pacing is a little slow, but it works. These characters have to take things a day or two at a time. While the plot isn't realistic, the pacing is. I never really found myself bored, there was always a new interested side character or plot moment around the corner to keep me intrigued. \n\nIf you're a skeptic because of the title like me, trust the devs that that isn't what the game is. This is a game that will hopefully sneak it's way into your heart like it did mine, as cheesy as that phrasing is. Definitely pick this one up for your library.", "timestamp_created": 1487652909, "timestamp_updated": 1487652909, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.481462", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30049060": {"recommendationid": "30049060", "author": {"steamid": "76561198052385248", "num_games_owned": 122, "num_reviews": 21, "playtime_forever": 727, "playtime_last_two_weeks": 0, "last_played": 1487818741}, "language": "english", "review": "Animal lover is a fun and entertaining VN. \nI really enjoyed the story.  The guys are endearing and kind of grew on me.\nThe art is lovely, (I would have liked more CG)\nI didn't complete all the route yet but I intend to do so.\n\nMost definitely recommend this game.", "timestamp_created": 1487557982, "timestamp_updated": 1487558075, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.481462", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30027606": {"recommendationid": "30027606", "author": {"steamid": "76561198058689365", "num_games_owned": 434, "num_reviews": 8, "playtime_forever": 900, "playtime_last_two_weeks": 0, "last_played": 1487499411}, "language": "english", "review": "EDIT 5 Jan 2018\n\nSince my first review, the game's technical aspects have been fixed and the price has been lowered permanently-- I can now give this a positive review, as the pros now outweigh the cons ^^\n\n-----\nI wish Steam had a 'mehh' button, because while I do like this game, I don't think the current build is worth the price.\n\nPros\n-Cute non-anime sprite art\n-Engaging story\n-A writing style unlike other VNs that feels like a fresh breeze in the genre\n-Well written characters, not bound to some copy/pasta trope. \n\nCons\n- I found a Renpy placeholder sprite, and a bug in one of the routes I played. \n- Not a fan of the art-filtered photos as backgrounds. For its price, I was hoping for self-drawn backgrounds.\n- Not enough CGs per route. I think there are 2 per route, unless  I'm missing some, but I don't think so.\n- Continuity errors\n\nConclusion: with the current build (19 Feb 2017), I cannot recommend this game at full price. I bought it on sale, so it's fine.", "timestamp_created": 1487488413, "timestamp_updated": 1515130446, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.649717", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30021296": {"recommendationid": "30021296", "author": {"steamid": "76561198084816416", "num_games_owned": 42, "num_reviews": 2, "playtime_forever": 2255, "playtime_last_two_weeks": 0, "last_played": 1493431132}, "language": "english", "review": "Overall i thought the game was great but after completing the game i don't really see why there is a sexual content tag, call me a pervert but i was kinda hoping for more than what i got.", "timestamp_created": 1487461047, "timestamp_updated": 1487461047, "voted_up": true, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.549176", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30012204": {"recommendationid": "30012204", "author": {"steamid": "76561198079326890", "num_games_owned": 93, "num_reviews": 24, "playtime_forever": 4206, "playtime_last_two_weeks": 0, "last_played": 1514248549}, "language": "english", "review": "Animal Lover is easily my favourite English VN. Not because it has an ingenious plot or some sort of breakthrough on the technical side--both of those are pretty average and have their flaws, actually. What shines in this game are the characters. From their designs (can I just love how diverse their faces and body types are???) to their personalities and backgrounds and dialogue, everything makes them feel genuine and well-rounded. I swear, I came to this game for the fun and memes, and was completely swept off my feet by these stupid, funny, cute, INCREDIBLY LOVEABLE CHARACTERS. \n\nAnd because I loved these wankers so much, rather than listing \"cons\" to the game, I'll call them \"suggestions\". My suggestions for improvement are:\n- Some lines of dialogue are said twice in a row with very minor changes in wording. I assume that's because they were in the \"common\" part of the route, but [i]also[/i] inserted onto the specific scenario that followed whatever choice you just made. It didn't happen that much, but it felt really off. Maybe it would be better to just erase the \"common route\" line and tweak wording a wee bit for each character route.\n- Speaking of which, there are a few instances in which your guy of choice says something, and that something is THE EXACT SAME for every single guy. I think it would be better to change this a little to match each character's voice and personality more--for instance, it is very strange, to me, seeing Frankie and Miguel word something the exact same way in their respective routes. Because besides their mannerisms, their views are also quite different. Some guys are more sensible or insightful than others, so seeing them all make the exact same comment at one point feels strange.\n- A couple more CGs would be nice. For instance, maybe we could get one when Lucy goes out with her current guy during \"Alone Time\". The art in this game is lovely and I really wish we could get more of it.\n- More route-specific interaction would be great! Maybe just one or two more occasions to hang out, or a few more conversations Lucy could have with her guy of choice, etc. I feel like there isn't that much emphasis on the particular character you're going for, as most of the game is still \"common route\", and this makes the romance feel a little rushed.\n- IT'S TOO SHORT!! Okay, you guys may think my playtime [EDIT: which was 12 hours by the time I wrote this review, but I then re-played it] is enough for a visual novel, but trust me, IT'S DEFINITELY NOT. And I know this was released just this week, but I REALLY REALLY HOPE the devs eventually decide to release some sort of DLC, sequel, fandisk, WHATEVER. Just some more material with these guys (and Lucy, because she's an excellent MC), because I honestly haven't gotten enough of them and will gladly throw my money at whatever the devs come up with involving the same cast.\n\nBottom line: this is an excellent game because of its funny dialogue; endearing, well-written characters; and lovely relationships (not just between MC and the guys, but also the friendship that the boys develop). Most definitely recommend it.", "timestamp_created": 1487433547, "timestamp_updated": 1487725222, "voted_up": true, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.708783", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29996810": {"recommendationid": "29996810", "author": {"steamid": "76561198118106928", "num_games_owned": 31, "num_reviews": 4, "playtime_forever": 1108, "playtime_last_two_weeks": 0, "last_played": 1487898020}, "language": "english", "review": "10/10!\n\nIt was kinda short for me though, depends on the person.", "timestamp_created": 1487378453, "timestamp_updated": 1487378453, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.546028", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29983417": {"recommendationid": "29983417", "author": {"steamid": "76561198042151691", "num_games_owned": 192, "num_reviews": 16, "playtime_forever": 1049, "playtime_last_two_weeks": 0, "last_played": 1487536450}, "language": "english", "review": "I really enjoyed the story, the writing for this is very good. The characters have their own quirks, the banter is endearing though the romance kinda comes out of nowhere in the last two chapters. It wasn't forced but it definitely isn't the focus of the story. I've got two endings so far, both of which made me cry. The characters really grew on me.\nCould use a little more visuals but I feel they put their money in the right place, the story is excellent.", "timestamp_created": 1487335734, "timestamp_updated": 1487335734, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.546028", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29975522": {"recommendationid": "29975522", "author": {"steamid": "76561198017824897", "num_games_owned": 71, "num_reviews": 2, "playtime_forever": 1113, "playtime_last_two_weeks": 0, "last_played": 1487397995}, "language": "english", "review": "This game is so cute! Boys from various eras are cursed into animal bodies and only the MC's magical kiss can save them...temporarily I guess? Anyway! The game is a definite must play for any fans of the anime, Fruits Basket! I finished a play through of Frankie's story line and I'm about to start a new game to see how Kyle's goes! The story got dark towards the end, but it just added depth to the narrative. The art is unique and not what I'm used to seeing from a lot of otome games, but it's endearing and fits. The music is consistently good. The only negative I can think of is that there are a few minor coding bugs, but just be sure to save often before making a choice that way if it crashes you can just load from the last save.", "timestamp_created": 1487299875, "timestamp_updated": 1487299875, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.466891", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29970669": {"recommendationid": "29970669", "author": {"steamid": "76561198216449079", "num_games_owned": 65, "num_reviews": 15, "playtime_forever": 807, "playtime_last_two_weeks": 0, "last_played": 1487291797}, "language": "english", "review": "UPDATED: While I am not completely finished with my playthrough (I finished two routes), I just had to share: this is one of the better otome visual novels out there! (I will update this once I do finish). I am ON THE FENCE with this VN even though I said it was one of the better otomes I dislike how its repetitive for each guy...there is no difference between the routes except for who you end up with. (Buy this game when it is ON SALE)\n\nAlthough this is not on Mystic Messenger level of awesomeness, I do believe this VN is good. It is not short. It has some depth and characters respond in a more natural way that you would expect them too. The MC is NOT your average otome VN character. The MC has spunk and is not afraid to tell one of the guys to BLEEP off if they are being kind of jerky. This is rather refreshing as many times the MC is bland, submissive, and does not have an original thought other than: \"He kissed me...but am still unsure of his feelings.\" There is actual progression in relationships between the MC and the five guys. I like this as you do not just wake up one day head over heels in love with some guy for no reason other than the fact that he is hot (or rich...or both, really). \n\nPROS: \n-artwork (very different than your everyday VN)\n-music\n-storyline/plot\n-length (It is not short. Too often I shell out $20 and I can finish all story routes within an incredibly too short of time)\n\n\nCONS:\n-CHOICES...really dont matter except for who you end up with. For example in some VNs for whichever guy you choose you get a whole different story. Not so with this VN, its the same story for each one, which is kind of boring. The only difference for each \"route\" is who you end up with. After doing two routes, I may wait awhile before doing it\n-no voice acting :( \n-CENSORED MALE PARTS :'( :'( :'( \n-SKIP option is a PAIN IN THE BUTT\n\nI would recommend this game, but I would recommend getting it at a discount as when you are finished with one route...you basically are done with the game.", "timestamp_created": 1487278044, "timestamp_updated": 1487292158, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.439601", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29963614": {"recommendationid": "29963614", "author": {"steamid": "76561198050270250", "num_games_owned": 383, "num_reviews": 11, "playtime_forever": 619, "playtime_last_two_weeks": 0, "last_played": 1487999067}, "language": "english", "review": "So many beautiful (censored) naked men. 10/10", "timestamp_created": 1487255783, "timestamp_updated": 1487255783, "voted_up": true, "votes_up": 1, "votes_funny": 5, "weighted_vote_score": "0.446120", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29958547": {"recommendationid": "29958547", "author": {"steamid": "76561198294617584", "num_games_owned": 16, "num_reviews": 1, "playtime_forever": 934, "playtime_last_two_weeks": 0, "last_played": 1490688828}, "language": "english", "review": "Overall it was so fun playing it but personally I really wanted more and I kinda need to play it all again for others route I need to fill all the plot holes", "timestamp_created": 1487237820, "timestamp_updated": 1487237820, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.496457", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29954484": {"recommendationid": "29954484", "author": {"steamid": "76561198118391725", "num_games_owned": 99, "num_reviews": 15, "playtime_forever": 4132, "playtime_last_two_weeks": 0, "last_played": 1505197270}, "language": "english", "review": "i've been following the development of this game for a while,and was super excited for its release. i bought it the moment i saw it was available and spent the better part of the day cozied up in a blanket playing through my first run. \ndid it meet my expectations? absolutely. in fact,it doubled them. \nthis game has a great story, lovely art, characters that i found myself growing to love very deeply as i played, and a great mix of romance, humor and more dramatic, sadder tones.\ni highly recommend you give animal lover a try,i'm sure it'll pass your expectations as well~ <3\nnow if you'll excuse me..i'm going to go play through my second run of this lovely game.", "timestamp_created": 1487215655, "timestamp_updated": 1511383799, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.528590", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29953349": {"recommendationid": "29953349", "author": {"steamid": "76561198235187072", "num_games_owned": 59, "num_reviews": 1, "playtime_forever": 985, "playtime_last_two_weeks": 0, "last_played": 1490484156}, "language": "english", "review": "I definately loved this, the characters are very well made and the story is very fascinating! With so many possibilities I can definately see myself playing this one again to find out more! Excellent job guys!", "timestamp_created": 1487209516, "timestamp_updated": 1487209516, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.450538", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29943919": {"recommendationid": "29943919", "author": {"steamid": "76561198271062563", "num_games_owned": 110, "num_reviews": 34, "playtime_forever": 665, "playtime_last_two_weeks": 0, "last_played": 1488901246}, "language": "greek", "review": "I thought it would be a boring visual novel  but i was wrong... I liked it.\nGood job Trainwreck Stydios. I recommend it!  ✌.(ʘ‿ʘ).✌", "timestamp_created": 1487173335, "timestamp_updated": 1487173335, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.524439", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29937250": {"recommendationid": "29937250", "author": {"steamid": "76561198016434615", "num_games_owned": 498, "num_reviews": 13, "playtime_forever": 1379, "playtime_last_two_weeks": 0, "last_played": 1509412760}, "language": "english", "review": "I've just finished playing and I can say I thoroughly enjoyed the story and characters (even the ones I thought I wouldn't like, lol). This is one of the few visual novels I've read, and it kept me enthralled from beginning to end. I may choose to replay it later to see if I can get together with any of the other guys, or whether I could have made different choices to affect the outcome. The character art is really nicely done, and definitely one of the game's highlights along with the writing and characterisation. I had a number of laugh out loud moments, and I found the game balanced the comedy and more serious moments well. I was initially put off by the photo-manipulated backgrounds but these grew on me over time. The music, though sometimes repetitive, is mostly enjoyable. Long story short: I love this game, and you'll love it too if you're a fan of magic, animals and reverse harems :P.", "timestamp_created": 1487146436, "timestamp_updated": 1487146721, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.554911", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29936567": {"recommendationid": "29936567", "author": {"steamid": "76561198047446261", "num_games_owned": 144, "num_reviews": 2, "playtime_forever": 784, "playtime_last_two_weeks": 0, "last_played": 1487142689}, "language": "english", "review": "there's a guy who hangs out at the mall equipped with shades, champagne, and a pug with a small wizard hat and says things like \"a wizard cruises on by precisely when he means to peruse on by\" 10/10", "timestamp_created": 1487142906, "timestamp_updated": 1487142906, "voted_up": true, "votes_up": 10, "votes_funny": 6, "weighted_vote_score": "0.433230", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29933521": {"recommendationid": "29933521", "author": {"steamid": "76561198158902410", "num_games_owned": 8, "num_reviews": 1, "playtime_forever": 722, "playtime_last_two_weeks": 0, "last_played": 1487471717}, "language": "english", "review": "I was really excited for the release of this game like a month prior to its release today, and I was not disappointed with my first runthrough aimed at Edmund. At first it felt a bit slow trying to introduce all the characters, but as the story progresses, your dialogue and action choices start to create heavier impacts on the outcome of the game. Stuff happened, like 0-100 level action [spoiler] I'm not sure if it was my fault for being unconvincing with my dialogue choices or if it was going to happen no matter what I said, but I might've made one of the characters kill himself by running into a car, and I did start to cRY OH MY GOD WHY [/spoiler] Also, the ending for me was really intense, and made me almost sabotage my entire playthrough's intended outcome. At the end, I was just like \"What the heck am I doing with my life? My math teacher doesn't even make me think this hard about my choices.\" Overall, it was a great experience and I'm looking forward to discovering the secrets of the remaining routes and tweak the things I might've done wrong in  my first playthrough.", "timestamp_created": 1487127193, "timestamp_updated": 1487127193, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.423533", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29932486": {"recommendationid": "29932486", "author": {"steamid": "76561198128068924", "num_games_owned": 19, "num_reviews": 2, "playtime_forever": 51, "playtime_last_two_weeks": 0, "last_played": 1493257358}, "language": "english", "review": "As one of the beta testers for this game, I have watched it grow and develop since practically the beginning. And I have to say, it's incredible that it has come this far. It's pretty hard to make a game, and these guys did it.\n\nAs for the game itself, it's incredible! The story is exciting, the art is beautiful, and the programming is fantastic. It certainly fills the requirements for an otome game, and it adds on something extra. The romance in this game is slow burning; you take time to learn about each interest, and the building relationship is gradual. Nothing feels rushed, and this makes the game feel realistic (magical animal boys aside). And if steamy love really isn't your whole cuppa, that's fine. Animal Lover is much more than a dating simulator. It has story that goes beyond trying to smooch some guys.\n\nThe characters in this game are multidimensional, with many of their own flaws and quirks. Not one is that perfect dream guy, as much as some of them may seem to be. They make mistakes, they get angry, and they cry. These guys are REALISTIC. They're going to probably mess up, and it's up to you, the player, to help them.\n\nA good dating simulator wouldn't be good without an artist behind it all to make these guys total babes. The art for this game is clean and stylish, and there's so much diversity between each of the characters. Not to mention there are some pretty funny expressions, giving the boys another level of realism.\n\nOverall, this is a very good game. It's captivating, and I can guarantee you're not going to settle for just one route. If you have the time, play the whole game, and experience what the creators have to offer. You're not going to regret it.", "timestamp_created": 1487122965, "timestamp_updated": 1487122965, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.379672", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "39586165": {"recommendationid": "39586165", "author": {"steamid": "76561198057468722", "num_games_owned": 53, "num_reviews": 2, "playtime_forever": 78, "playtime_last_two_weeks": 78, "last_played": 1516815018}, "language": "english", "review": "Best VN I've ever played, honestly!\nThe protagonist was nice and not this uber beautiful Mary Sue type character. Instead she was real. I loved that. \nThe boys were all cool, too. I usually dislike at least one of the options in VNs, usually more than that. This time around I actually WANTED to explore all the options and see where they lead. I wish the individual routes had been longer and that there had been more CGs but, that is just because I loved it so much and there couldn't ever have been enough of it! I still have to play Kyle and Edmund, but I just know I'll love their routes as well. \nThe humor in this was REALLY awesome. The story had me laugh out loud a bunch of times. Totally up my alley. And the story also made me cry once, which no VN ever managed, so kudos for that! I totally felt like I neatly fit into the demographic for this :D \nReally well done!!!!!", "timestamp_created": 1516815943, "timestamp_updated": 1516815943, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500684", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 83, "total_negative": 2, "total_reviews": 85}}
