{"reviews": {"39418542": {"recommendationid": "39418542", "author": {"steamid": "76561198105571371", "num_games_owned": 296, "num_reviews": 10, "playtime_forever": 2525, "playtime_last_two_weeks": 1949, "last_played": 1516250316}, "language": "english", "review": "I thought i'm going to refund within 30minutes. End up addicted and played more than 41 hours. The story is suprising good. Please, i want Eiyu Senki Gold!!", "timestamp_created": 1516211733, "timestamp_updated": 1516211733, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39350543": {"recommendationid": "39350543", "author": {"steamid": "76561198071482913", "num_games_owned": 222, "num_reviews": 3, "playtime_forever": 3838, "playtime_last_two_weeks": 3838, "last_played": 1515966699}, "language": "russian", "review": "Началось как порно, продолжилось как порно, [spoiler]закончилось как darkest dungeon[/spoiler]\n\n[b]ABSOLUTELY MASTERPIECE[/b]\n\nРекомендую всем и каждому, свою цену по эмоциям и фану отбивает на 1100%.\nМожно знакомится с интересными людьми, попробовать монгольский бутерброд, попробовать македонский бутерброд, побороть кучу драконов, заниматься экзорцизмом, помочь Нострадамусу с написанием [spoiler]жесткой пацанской манги уровня гачимучи [/spoiler], научиться играть в покер, попробовать во Владивостоке bortsch и многое многое другое!\n\n\n\n\n", "timestamp_created": 1515967559, "timestamp_updated": 1515967559, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39172884": {"recommendationid": "39172884", "author": {"steamid": "76561198044669284", "num_games_owned": 174, "num_reviews": 2, "playtime_forever": 4449, "playtime_last_two_weeks": 1771, "last_played": 1516000091}, "language": "english", "review": "In a span of three days, I had mustered 50+ hours into this game. Becareful, this is a really great game!", "timestamp_created": 1515388058, "timestamp_updated": 1515388058, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39147753": {"recommendationid": "39147753", "author": {"steamid": "76561198016127320", "num_games_owned": 431, "num_reviews": 6, "playtime_forever": 4280, "playtime_last_two_weeks": 1529, "last_played": 1515941103}, "language": "english", "review": "Let's find some famous girl friends and go on food tour around the world.\n\nAlso one more vote for gold version soon please.", "timestamp_created": 1515322376, "timestamp_updated": 1515322376, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39110818": {"recommendationid": "39110818", "author": {"steamid": "76561198064883394", "num_games_owned": 68, "num_reviews": 2, "playtime_forever": 2608, "playtime_last_two_weeks": 0, "last_played": 1515187176}, "language": "english", "review": "Eiyu Senki- World Conquest is a game in the harem genre of VN's. With a soft add on of a tactical territory conquer aspect. Similiar to games like Risk, you take a territory and get a bit of resources from it. This game places you in the role of the Hero where you wake up in a world where you must help to find your memories and aid your cause. You will meet an assortment of heroes from ancient areas of history. There is a wide assortment from different time periods, someone like Lubu or Columbus is possible, the catch being in this world all heroes are female and you seem to be the only relevant male in the world. It's a harem genre game so it should have been expected.\n\nI will go ahead and put my yes or no here now: If you are buying this version with no intent of the R18 patch I say [b]Yes[/b] and I will list likes and dislikes below for that. If for the R18 patch intention I say [b]no[/b] and I will list the likes and dislikes below but I will cover them in spoiler things as some people enjoy finding things out on their own.\n\nWhat the game does good:\n1) Large assortment of heroes, some well known others not well known.\n2)Variety of types of personalities you meet, if you can think of a type it might be found here.\n3) The troop combat. (Something fun about grinding and adding troops to a unit to mow down others.) There is a Rock, Paper, Scissors mechanic. But the game isn't so rough that you will get mowed down if you have more troops then the other side. Nothing as severe as Fire Emblem which can be far more cruel.\n4) The scenary and some of the character designs were excellent and interesting.\n5) Loli's I list this here because lots of people like their waifu's in this way. It's not my thing but this game has an assortment of those.\n\nWhat Game Does Bad:\n1) Choices feel arbitrary as the only time a chocie comes in play is a place to invade, nothing more then this as this is a feature used more so for difficulty control. You can pick a harder route and in doing so collect a rare reward, some good, some bad. Accepting it buffs the enemy which is this games difficulty control. Nothing too bad but can be annoying.\n2)Hero resprentation, this being more of an opinion. Some heroes just don't mesh in what my head they should. Blame Fate Stay Series, Dynasty Warriors, and any other Ancient Hero game thats painted some heroes in certain like so be prepared if you go in with these series ideas in mind some may not measure to your hope while others may enjoy it. I understand its artistic interpretation not horrible but might put off some.\n3)Side stories, I hate putting this on here as the general story is okay especially from the genre. But some of the side stories involving other character feel pointless and cluttered. Holding no real weight would have rather some heroes be removed and more work on some of the more core heroes. This is another more of an opinion then anything.\n4) Loli's an opinion again you either like, hate, or don't mind it but I will put that here for people who might be put off by it.\n\nSo at this I will say again as a base game no R18 patch it's a [/b]Yes[/b]. So I will leave a positive mark here. However if you want to read about the R18 patch issues I had I will include below and you can make your decision there.\n\n[spoiler]\nThe Good\n1) There is a variety of H still shot scenes that you can see involving several characters sometimes more then one.\n2)Most of the main female interest characters have more then one H still shot scene. Exception is one who gets nothing.\n\nThe Bad\n1)Lots of characters get no H still shot scene at all, even if you max their affection by doing their side missions. Big no no in an H game to me. Especially in a Harem game.\n2)Some characters get a single H still shot scene and its not anything other then a fan service shot, lazy and unexcusable given the concept of the game. This being my opinion of course.\n3) Loli's again this is an opinion but too many have H scenes in the game and that not being something of interest to me I found myself just skipping the scenes entirely just to hurry back to get back to the tactical map to grind.\n4) Forced romance issue, the first girl is your waifu and while you can add others and she constantly acknowlledges she has competition and others love you. She has the games love and is forced on you wether or not you want her. \n5) My biggest issue is the art in the H scenes, proportions of character models are way to off, the male is often massively larger. Even if in game models seem to be of similar size. That being an artist thing, it annoyed me a lot, especially with the arm designs on many of the ladies.\n\nNow this was more of less all my opinion just wanted it to be said in case most like me got this version and were expecting something closer to Koime Musou game.[/spoiler]\n\nI hope this review helps those looking at this product from both no patch and with patch. Have a great day.", "timestamp_created": 1515227271, "timestamp_updated": 1515227271, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.516667", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39012768": {"recommendationid": "39012768", "author": {"steamid": "76561198105127887", "num_games_owned": 156, "num_reviews": 4, "playtime_forever": 12, "playtime_last_two_weeks": 0, "last_played": 1511098296}, "language": "thai", "review": "อนึ่งเกมนี้มันออกมานานเเล้วแหละ ซึ่งผมก็โหลดมาเล่น จบไป 5 รอบ จนกระทั้งเกมเปิดให้เล่นบน Steam ก็เลยปลดบาป โดยการซื้อตัวเกมมา ตรง ๆ เลยก็คือ ปุ่ม Gallery WTF โอเคช่างมัน เข้าเกมไปเปรียบเทียบกับ ตัวที่โหลดมา มีเซ็นเซอร์ อันนี้ไม่แปลกใจเพราะ Steam ค่อนข้างไม่ค่อยขาย เกม Hentai พอมารู้อีกทีคือ มี dlc ขาย นอก จ้า แต่ uncen ก็โอเคดีนะ xDDDDD\n\nสรุป ควร ซื้อ หรือ ไม่ ถ้าคนชอบแนว conquest ผสม turn base ก็ควรจัดเดี่ยวนี้ โดยเฉพาะ dlc uncen \nเนื้อเรื่องหละเป็นยังไง? ผมพูดตรง ๆ เนื้อเรื่องโอเคมาก ๆ โดยเฉพาะ ถ้าอยากรู้ประวัติศาสตร์ (อันที่จริงมันก็แค่การ search google ว่า กิลกาเมช เป็นใคร หรือ ตัวละครเกมในนี้เป็นใคร ไม่ต่างจาก fate เท่าไหร่ )\nเรื่องลายเส้น สี หรือ การทำตัวละคร ออกมาดี ผมชอบ Tenko เค้าทำเกมออกมาดีจริง ๆ \n\nสิ่งที่อยากให้ Tenko ทำสิ่งสุดท้ายคือ .......\n\n[spoiler] ช่วยเอา ภาค Gold เข้าได้ไหมครับผมอยากเล่นมันมาก  555555555555555555555555555555555555+ [/spoiler]", "timestamp_created": 1514990036, "timestamp_updated": 1514990036, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39001923": {"recommendationid": "39001923", "author": {"steamid": "76561198210260748", "num_games_owned": 78, "num_reviews": 7, "playtime_forever": 507, "playtime_last_two_weeks": 0, "last_played": 1515157707}, "language": "russian", "review": "Расскажу в кратце–Стратежка в жанре аниме цель которой захватить весь мир,но этому будет мешать правительницы с мужскими именнами. Да именно с мужскими!Почему?Спросите авторов!\n P.s–я прошёл ещё не всю игру так что про сюжет промолчу и о многом я судить не могу!", "timestamp_created": 1514963587, "timestamp_updated": 1514963587, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.471698", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38964427": {"recommendationid": "38964427", "author": {"steamid": "76561198089674937", "num_games_owned": 22, "num_reviews": 1, "playtime_forever": 6937, "playtime_last_two_weeks": 0, "last_played": 1515207032}, "language": "thai", "review": "เรารู้ว่าหลายๆท่านเคยเล่นแบบเถื่อนมาแล้ว เราก็เช่นกัน 5555555\n\nEiyuu Senki เป็นเกมแนววางแผนต่อสู้+วิชวลโนเวล เรื่องย่อก็มีคนเขียนรีวิวไว้ก่อนหน้านั้นแล้ว \n\nข้อดี\n-ระบบการเล่นเข้าใจง่ายและสนุก\n-CGเทพมาก\n-ตัวละครเยอะมาก มีเสียงพากย์เกือบทุกตัว\n-มีอีเว้นท์กับตัวละครเกือบทุกตัว ถ้าตามเก็บอีเว้นท์ตัวละครก็จะได้ สกิล/ไอเท็ม/เอฟเฟคของตัวละครนั้น\n-หลายๆตัวมีCGของตัวเอง ตามเก็บเอาในอีเว้นท์ตัวละครได้\n-ราคาไม่สูงมาก แต่เล่นได้นาน\n\nข้อเสีย\n-ช่วงหลังตัวละครเยอะมาก อาจจะขี้เกียจเก็บอีเว้นท์ได้\n-ตัวละครที่มาหลังๆจะไม่มีCG 18+\n-ไอเท็มไม่พอกับตัวละครทุกตัว หลายๆตัวละครไร้ประโยชน์ไปเลย จัดสรรดีๆละกันนะ\n\nโดยรวม เล่นสนุก อีเว้นท์เยอะ เล่นได้นาน\n10/10\n\nรอภาคgoldต่อไปปป\nป.ล.ทั้งแท้และเถื่อนเขียนต้มยำกุ้งผิดหมดเลย", "timestamp_created": 1514877890, "timestamp_updated": 1514877890, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38955700": {"recommendationid": "38955700", "author": {"steamid": "76561198012052601", "num_games_owned": 1434, "num_reviews": 6, "playtime_forever": 1178, "playtime_last_two_weeks": 0, "last_played": 1513297029}, "language": "english", "review": "Imagine that you are waking up one morning and every male history hero (King Arthur or Ivan The Terrible for eample) got replaced by sexy Anime babes. If it is too hard to imagone this game will help you! \n\n[h1] Welcome to the world of Eiyu*Senki![/h1]\n\nYou are an average dude (The only dude!) who somehow managed to get lost in an alternate version of the earth. That alternate version stucks between the years 3000 BC and 1900 AD, becasue reasons. So you are surrounded by lewd female versions of ancient heroes. \n\nStorywise it is completley new und pretty much interesting, but... just let me say you are not going to bang each girl. You even have to wait hour after hour before you can bang the next one. Very tedious! I know I should watch hentai if I just want to scrub my 1inch magicstick, but ... please no! -> You also have to buy the uncensor patch extra!\n\nAll these things aside -> Your mission is to make the world a better place and to regain whatever you lost in the best way ... You start a world domination tour.\n\nYou have your cities, you have your income and you have your heroes and you can fill these heroes up with soldiers (for more HP and AP). The fights are pretty well made and you even have to think later on how you place your trroops on the field. Every hero has its one ability (melee, range, magic - special attack) which have to be used carfully. But you don´t need to worry about the difficulty! In the beginning it is rather easy to fight off your foes. Later on you are getting attacked by multiple enemies at the same time. Your decisions you make (after you conquered a country) makes the game easier or harder for you!\n\nThe artstyle of the game is also unique! You may love it or you hate it!\n\n[u]So what are you getting now?[/u]\n\n[i]- harem of girls\n- pretty cool strategy game\n- suprisingly touching story\n- many interesting sidequests\n- nice visuals\n- unique characters\n- you can decide a lot of things on your own\t[/i]\n\n[u]What I actually disliked[/u]\n\n[i]- you can only bang a few of these girls\n- combat is getting pretty hard after you reach ~50% of the game\n- some dialogues seem to be stretched\t[/i]\n\nAll in all I really enjoyed this game and I hope that we actually get the Gold edition (more bangable girls!)\n\nTo find the truth behind the truth -> Feel free to join our small ecchi community! For monthly GiveAways and dirty talk!\n[url=http://steamcommunity.com/groups/EcchiOkami]->Kemomimi<-[/url]\n\nTotally no self-promotion!", "timestamp_created": 1514852058, "timestamp_updated": 1514852404, "voted_up": true, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.774557", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38949951": {"recommendationid": "38949951", "author": {"steamid": "76561198118536774", "num_games_owned": 453, "num_reviews": 46, "playtime_forever": 178, "playtime_last_two_weeks": 0, "last_played": 1514297708}, "language": "english", "review": "I can't say I enjoyed this game you spend most of your time just grinding away to really get anywhere in the game.", "timestamp_created": 1514839652, "timestamp_updated": 1514839652, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.437463", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38917826": {"recommendationid": "38917826", "author": {"steamid": "76561198060770885", "num_games_owned": 389, "num_reviews": 2, "playtime_forever": 1061, "playtime_last_two_weeks": 78, "last_played": 1516252694}, "language": "english", "review": "Surprisingly good.\nI bought it for a meme and ended up getting addicted.\nSend help.", "timestamp_created": 1514762361, "timestamp_updated": 1514762361, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.524060", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38868271": {"recommendationid": "38868271", "author": {"steamid": "76561198280634419", "num_games_owned": 77, "num_reviews": 4, "playtime_forever": 1225, "playtime_last_two_weeks": 82, "last_played": 1515955609}, "language": "thai", "review": "ปุ่ม gallery หาย แต่ไม่เป็นไร ไปซื้อแพทช์ uncen ในเว็ปมาละไล่แคปทีละรูปเอาฮ่าๆ ของโครตดี", "timestamp_created": 1514654278, "timestamp_updated": 1514654278, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38767730": {"recommendationid": "38767730", "author": {"steamid": "76561198021587583", "num_games_owned": 121, "num_reviews": 5, "playtime_forever": 2998, "playtime_last_two_weeks": 566, "last_played": 1516337113}, "language": "english", "review": "Something of a knockoff of Rance 7 with much more consent.", "timestamp_created": 1514438697, "timestamp_updated": 1514438697, "voted_up": true, "votes_up": 3, "votes_funny": 2, "weighted_vote_score": "0.502253", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38619833": {"recommendationid": "38619833", "author": {"steamid": "76561198136236639", "num_games_owned": 91, "num_reviews": 8, "playtime_forever": 1478, "playtime_last_two_weeks": 0, "last_played": 1515201810}, "language": "english", "review": "britain doesn't belong to the eu\n\n10/10 for historical accuracy", "timestamp_created": 1514118162, "timestamp_updated": 1514118162, "voted_up": true, "votes_up": 7, "votes_funny": 12, "weighted_vote_score": "0.501906", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38610885": {"recommendationid": "38610885", "author": {"steamid": "76561198021568666", "num_games_owned": 1267, "num_reviews": 53, "playtime_forever": 577, "playtime_last_two_weeks": 0, "last_played": 1514136002}, "language": "koreana", "review": "Sie ritten um die Wette mit dem Steppenwind, 1000 Mann [ha-hu-ha]\n그들은 초원의 바람과 함께 앞다투어 말을 달렸다, 천의 대장부들. \nund einer ritt voran, dem folgten alle blind, Dschinghis Khan [ha-hu-ha].\n한 사내가 선두에서 말을 달리고, 모든 이들이 맹목적으로 그를 따랐다. 징키스칸.\nDie Hufe ihrer Pferde, die peitschten den Sand,\n모래흙을 차며 날리는 그들의 말발굽들.\nsie trugen Angst und Schrecken in jedes Land,\n그들은 모든 나라들에 공포와 두려움을 전했고,\nund weder Blitz noch Donner hielt sie auf [hu-ha].\n천둥도 번개도 그들을 막지는 못했다.\n\nRefrain: [후렴]\nDsching-Dsching-Dschinghis Khan,\n징-징-징키스칸\nhey Reiter, ho Reiter, hey Reiter, immer weiter.\n[헤이~] 기마병들이여, [호~] 기마병들이여, [헤이~]기마병들이여, 계속 나아가라. \nDsching-Dsching-Dschinghis Khan,\n징-징-징키스칸,\nauf Bruder, sauft Bruder, rauft Bruder, immer wieder.\n형제를 위하여, 마시자 형제여, 싸우자 형제여, 계속 그렇게.\nLaßt' noch Wodka holen, [ho-ho-ho-ho]\n보드카를 더 가져오라 하라,\ndenn wir sind Mongolen, [ha-ha-ha-ha]\n왜냐면 우리는 몽고인들이고,\nund der Teufel kriegt uns fruh genug.\n원래가 사납고 거친 사람들이기 때문이다. \nDsching-Dsching-Dschinghis-Khan,\n징-징-징키스칸\nhey Reiter, ho Reiter, hey Reiter, immer weiter.\n[헤이~] 기마병들이여, [호~] 기마병들이여, [헤이~]기마병들이여, 계속 나아가라.\nDsching-Dsching-Dschinghis Khan,\n징-징-징키스칸\nhey Manner, ho Manner, tanzt Manner, so wie immer.\n[헤이~] 장부들이여, [호~] 장부들이여, 춤춰라 장부들이여, 늘 그랬듯이.\nUnd man hort ihn lachen,[ho-ho-ho-ho]\n사람들은 그가 웃는 것을 듣는다.\nimmer lauter lachen, [ha-ha-ha-ha]\n점점 더 크게 웃는다,\nund er leert den Krug in einem Zug.\n그리고는 그는 술잔을 단숨에 비워버린다.\n\nUnd jedes Weib, das ihm gefiel, das nahm er sich in sein Zelt [ha-hu-ha].\n그는 마음에 드는 여자마다 자기 천막으로 데리고 갔다.\nEs hieß, die Frau, die ihn nicht liebt, die gab es nicht auf der Welt [ha-hu-ha].\n사람들은 말했다, 그를 사랑하지 않은 여자는 이 세상에 없었다고.\nEr zeugte sieben Kinder in einer Nacht,\n그는 하룻 밤에 7 명의 자식을 만들었고,\nund uber seine Feinde hat er nur gelacht,\n자신의 적들에 대해서는 단지 비웃기만 했다.\ndenn seiner Kraft konnt' keiner widersteh'n [hu-ha].\n왜냐면 아무도 그의 힘에 저항할 수 없었기 때문이었다.", "timestamp_created": 1514100545, "timestamp_updated": 1514375215, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.500000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38449854": {"recommendationid": "38449854", "author": {"steamid": "76561198160868511", "num_games_owned": 573, "num_reviews": 357, "playtime_forever": 3160, "playtime_last_two_weeks": 0, "last_played": 1513725873}, "language": "english", "review": "Eiyu*Senki – The World Conquest is a turn based strategy game with a gameplay that is very similar to that of Sengoku Rance and but it's protagonist is very different from Rance personality wise and the game's artwork was created by Oyari Ashito,the genious japanese artist behind Little Romanesque.", "timestamp_created": 1513761023, "timestamp_updated": 1513761023, "voted_up": true, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.482266", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38438883": {"recommendationid": "38438883", "author": {"steamid": "76561197995321994", "num_games_owned": 872, "num_reviews": 29, "playtime_forever": 991, "playtime_last_two_weeks": 0, "last_played": 1512155182}, "language": "english", "review": "First of all I will start by saying that I did not play that many different games from this one so won't be able to do a comparison.\n\nEiyu is a hybrid of turn based game with a humorous storyline filled with cliches and interesting sidequest mechanics. The game features a world conquest and it has a lot of famous leaders in the game with different abilities and each with a unique personality.  I personally played the version with the 18+ patch and it could certainly say that it adds quite a few interesting scenes. The game itself does not take itself seriously so do not expect a deep story.\n\nThe game also has great music and nice artwork. \n\nIs the game worth the cost? If you enjoy visual novels and turn based games, you will most likely enjoy Eiyu Senki - World conquest.  The game has a 9/10 from me", "timestamp_created": 1513717692, "timestamp_updated": 1513717692, "voted_up": true, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38405085": {"recommendationid": "38405085", "author": {"steamid": "76561198034807510", "num_games_owned": 106, "num_reviews": 4, "playtime_forever": 1065, "playtime_last_two_weeks": 79, "last_played": 1515588839}, "language": "english", "review": "I try to clear all stage with troop below 5k and it is very challenging to do so without any 'legendary' girls (fight in 'real' final chapter). But if you know strength for each character and equip right equipment, all battle is quite easy.\n\n[u] Here is my elite team [/u]\nRasputin who can take damage and heal herself.\nColumbus with her Anti-Material Rifle will kill every boss in this game.\nDrake for incredible AoE (helpful in Underground Maze).\nLu Bu for quick defeated back line.\nNapoleon with good skill.\nAll Knight of Round Table for win!\n\n\nOne of the best Japan Turn Base Strategy game that I had played.", "timestamp_created": 1513622944, "timestamp_updated": 1513622944, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38186405": {"recommendationid": "38186405", "author": {"steamid": "76561198065625676", "num_games_owned": 74, "num_reviews": 15, "playtime_forever": 2493, "playtime_last_two_weeks": 0, "last_played": 1512840430}, "language": "english", "review": "Best game and please working on the gold version so I can buy another one.", "timestamp_created": 1512840572, "timestamp_updated": 1512840572, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38126420": {"recommendationid": "38126420", "author": {"steamid": "76561197976345467", "num_games_owned": 635, "num_reviews": 10, "playtime_forever": 18974, "playtime_last_two_weeks": 0, "last_played": 1514861032}, "language": "english", "review": "Has a good amount of content and heroes. Music and scenario are pretty good as well.\n\nAlso you can get the 18+ patch if you're into that\n\nps gold edition when?", "timestamp_created": 1512645988, "timestamp_updated": 1512646886, "voted_up": true, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.504234", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38098167": {"recommendationid": "38098167", "author": {"steamid": "76561198055784066", "num_games_owned": 32, "num_reviews": 1, "playtime_forever": 2797, "playtime_last_two_weeks": 0, "last_played": 1512544619}, "language": "english", "review": "Great Game already spent 48 hours and loving it. Now, just waiting for Gold to come out. :3", "timestamp_created": 1512549578, "timestamp_updated": 1512549578, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38049391": {"recommendationid": "38049391", "author": {"steamid": "76561198073695214", "num_games_owned": 25, "num_reviews": 1, "playtime_forever": 1981, "playtime_last_two_weeks": 4, "last_played": 1515803522}, "language": "schinese", "review": "虽说没有R18不影响游戏，但总感觉少了什么很重要的东西。特别是阿育的“正装”还不够正式。可以上jastusa买个dlc，这样就完整了。（包含18剧情，步兵，人物和装备列表的阿育也是正装），但是不知道为什么没有鉴赏模式。", "timestamp_created": 1512359965, "timestamp_updated": 1512359965, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38026660": {"recommendationid": "38026660", "author": {"steamid": "76561197960279937", "num_games_owned": 577, "num_reviews": 55, "playtime_forever": 3495, "playtime_last_two_weeks": 0, "last_played": 1512288064}, "language": "english", "review": "Behind this harem anime bullshit lies a real game with real mechanics and I'm going to give it a positive recommendation but you probably shouldn't play it because you're gonna get put on a watchlist.\n\nSo, mechanically, the game is fantastic.  You got your 9-part rock paper scissors setup but you don't always want to be targeting weaknesses because that gives the enemy free meter which they can use to do nasty things back to you.  That's called Tactical Depth and we love that.  Nothing is explained in game so go look up a tutorial online, it'll help you out a lot.  \nBarriers and Stalling tactics are very strong.  The only counter is the time limit in battles, but those disappear for important fights so it's definitely valid cheese.\nCharacters aren't well balanced but it doesn't really matter. \nThe game might actually be super easy.  I'm pretty sure I picked the most difficult path through the game that I possibly could and I never had any significant issues with any fight or encounter (other than conquering Russia before the EU, which is a vicious slog).\n\nI'll give props to these guys for having like 5 dozen female characters with probably different voice actresses?  Almost every line in the game is voiced.  That's actually kind of amazing even if there's no way I'd listen to it all.  I can't comment on the music.\n\nThe overall writing... could have been worse.  Characters are one dimensional, with one quirk that defines them (Lancelot can eat, Benkei is super strong, Columbus is a gambler, Joan of Arc is a 56k modem, Vlad Tepes is the Vampire Queen of Australia, etc., etc...) but it would be physically impossible to keep track of them all if they had any sort of depth so I consider that forgiveable.  Character interactions are predictable but still cute or funny and that's okay.  The localization was decent.\nThe story is serviceable enough.  You're here to conquer the world, it's in the title, no surprises there. \n\nThe UI is decent.  Obviously designed from the beginning to be played with one hand.\n\nIf you like Strategy RPG's, this one's a good one.  Now, I need to uninstall this before the FBI kicks down my door.", "timestamp_created": 1512290061, "timestamp_updated": 1512290061, "voted_up": true, "votes_up": 14, "votes_funny": 3, "weighted_vote_score": "0.665708", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38012240": {"recommendationid": "38012240", "author": {"steamid": "76561198079343607", "num_games_owned": 217, "num_reviews": 2, "playtime_forever": 3977, "playtime_last_two_weeks": 0, "last_played": 1512533828}, "language": "english", "review": "Waiting for gold", "timestamp_created": 1512241534, "timestamp_updated": 1512241534, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.453587", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37985382": {"recommendationid": "37985382", "author": {"steamid": "76561198009296312", "num_games_owned": 99, "num_reviews": 2, "playtime_forever": 107, "playtime_last_two_weeks": 0, "last_played": 1512927157}, "language": "english", "review": "One of the best Visual novels of all time. Can't wait for Gold!", "timestamp_created": 1512159833, "timestamp_updated": 1512159833, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.486712", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37974127": {"recommendationid": "37974127", "author": {"steamid": "76561198028571979", "num_games_owned": 175, "num_reviews": 4, "playtime_forever": 2266, "playtime_last_two_weeks": 10, "last_played": 1515297453}, "language": "english", "review": "Gameplay is okay but I'm kinda disappointed about DLC from Jast USA.\n\nI expected 18+ scenes for knight of round table but they don't exist, not even Gawain and Gallahad.", "timestamp_created": 1512127586, "timestamp_updated": 1512127586, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37928524": {"recommendationid": "37928524", "author": {"steamid": "76561198101552860", "num_games_owned": 481, "num_reviews": 18, "playtime_forever": 1022, "playtime_last_two_weeks": 0, "last_played": 1514413266}, "language": "english", "review": "Let us begin our world domination plot with our army of cute girls", "timestamp_created": 1511963565, "timestamp_updated": 1511963565, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.492522", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37851398": {"recommendationid": "37851398", "author": {"steamid": "76561198044420507", "num_games_owned": 292, "num_reviews": 38, "playtime_forever": 3252, "playtime_last_two_weeks": 1, "last_played": 1516381898}, "language": "english", "review": "HOLY SHIT \nBEST GIRL FROM SENGOKU RANCE IS AN INVITED GUEST FOR THIS GAME", "timestamp_created": 1511844555, "timestamp_updated": 1511844555, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.478931", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37837968": {"recommendationid": "37837968", "author": {"steamid": "76561197996760388", "num_games_owned": 5634, "num_reviews": 23, "playtime_forever": 1430, "playtime_last_two_weeks": 0, "last_played": 1515112097}, "language": "english", "review": "gold pls", "timestamp_created": 1511829116, "timestamp_updated": 1511829116, "voted_up": true, "votes_up": 3, "votes_funny": 2, "weighted_vote_score": "0.406767", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37779957": {"recommendationid": "37779957", "author": {"steamid": "76561198096102319", "num_games_owned": 269, "num_reviews": 6, "playtime_forever": 2480, "playtime_last_two_weeks": 0, "last_played": 1511876560}, "language": "english", "review": "One of my best buy on Steam so far..\nSimple battle system... but yet it can smacked you real hard if you don't pay attention to your character progression.\n\nEasy 8/10 in my book...\nGo buy it!", "timestamp_created": 1511788926, "timestamp_updated": 1511788926, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.534123", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37599165": {"recommendationid": "37599165", "author": {"steamid": "76561197970591881", "num_games_owned": 170, "num_reviews": 10, "playtime_forever": 29, "playtime_last_two_weeks": 0, "last_played": 1511467065}, "language": "english", "review": "For all lovers of serious strategy and mindful planning.", "timestamp_created": 1511654545, "timestamp_updated": 1511654545, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37457542": {"recommendationid": "37457542", "author": {"steamid": "76561198071804692", "num_games_owned": 133, "num_reviews": 10, "playtime_forever": 514, "playtime_last_two_weeks": 0, "last_played": 1513128992}, "language": "german", "review": "Very Good Game, please Bring out more of this :)", "timestamp_created": 1511581915, "timestamp_updated": 1511581915, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37407144": {"recommendationid": "37407144", "author": {"steamid": "76561198057103167", "num_games_owned": 1772, "num_reviews": 76, "playtime_forever": 4409, "playtime_last_two_weeks": 0, "last_played": 1512004591}, "language": "french", "review": "LE jeu de l annee pour moi ! \nUne decouverte et une tres bonne surprise , outre un bon design et une prise en main tres facile , le cote strategique du jeu n est pas moins fabuleux :des unites plus ou moins fortes suivant leurs adversaires (style chifumi) , on greffe dessus des heros avec diverses aptitudes (qui se debloque au fur et a mesure ) , un equipement divers , bref plusieurs combinaisons pour un meme perso ! \nLe scenario est poilant : rien plus de moins que de conquerir le monde !\nles dessins sont superbes et les persos tres waifu , cote musique c est pas mal non plus \na noter : le jeu est pour tout public sur steam mais avec le patch qui convient on obtient un jeu tres adulte (hentai) et surtout plus long (quetes suplementaires) et difficulte a la hausse aussi !\n\njeu : 18/20\ninteret : 18/20 sans le patch 19/20 avec le patch", "timestamp_created": 1511553613, "timestamp_updated": 1512085345, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525862", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37386373": {"recommendationid": "37386373", "author": {"steamid": "76561198171287301", "num_games_owned": 33, "num_reviews": 2, "playtime_forever": 143, "playtime_last_two_weeks": 0, "last_played": 1514649010}, "language": "english", "review": "With DLC, My past dream come true now.\nGoodbye, Mosaic friend.\n\nSet aside, This game play is good. Let's try it. It's fun more than you think.", "timestamp_created": 1511546287, "timestamp_updated": 1511546287, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37314281": {"recommendationid": "37314281", "author": {"steamid": "76561198061985897", "num_games_owned": 101, "num_reviews": 7, "playtime_forever": 4309, "playtime_last_two_weeks": 0, "last_played": 1511731032}, "language": "english", "review": "Wasn't sure what to expect from this game but I actually like it. It has alot of reading so far but it has a good story and it doesn't force you to listen to all of it if you don't want to.", "timestamp_created": 1511523483, "timestamp_updated": 1511523483, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37282150": {"recommendationid": "37282150", "author": {"steamid": "76561197998925508", "num_games_owned": 849, "num_reviews": 4, "playtime_forever": 4910, "playtime_last_two_weeks": 0, "last_played": 1511977470}, "language": "english", "review": "a light hearted sengoku rance.", "timestamp_created": 1511508631, "timestamp_updated": 1511508631, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.582257", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37236876": {"recommendationid": "37236876", "author": {"steamid": "76561198072406323", "num_games_owned": 77, "num_reviews": 3, "playtime_forever": 1021, "playtime_last_two_weeks": 0, "last_played": 1515002556}, "language": "english", "review": "Gold port when", "timestamp_created": 1511483949, "timestamp_updated": 1511483949, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37144343": {"recommendationid": "37144343", "author": {"steamid": "76561198102257966", "num_games_owned": 424, "num_reviews": 10, "playtime_forever": 626, "playtime_last_two_weeks": 0, "last_played": 1511027615}, "language": "english", "review": "Not gonna lie, I bought this game for the character designs. No regrets or tissues left.", "timestamp_created": 1511458261, "timestamp_updated": 1511458261, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37131152": {"recommendationid": "37131152", "author": {"steamid": "76561198192292005", "num_games_owned": 639, "num_reviews": 4, "playtime_forever": 845, "playtime_last_two_weeks": 0, "last_played": 1511544445}, "language": "english", "review": "A good game !\nWaiting for eiyuu senki gold to be released as steam version.", "timestamp_created": 1511455725, "timestamp_updated": 1511455725, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37087687": {"recommendationid": "37087687", "author": {"steamid": "76561198056717487", "num_games_owned": 391, "num_reviews": 6, "playtime_forever": 2110, "playtime_last_two_weeks": 0, "last_played": 1514841325}, "language": "english", "review": "Is like sensored sengoku rance", "timestamp_created": 1511448093, "timestamp_updated": 1511448093, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.467033", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37085206": {"recommendationid": "37085206", "author": {"steamid": "76561197980606265", "num_games_owned": 971, "num_reviews": 3, "playtime_forever": 1098, "playtime_last_two_weeks": 0, "last_played": 1513331278}, "language": "russian", "review": "Тактика про захват мира с историческими и мифическими персонажами от Гильгамеша до Распутина в виде милых девочек.\n\nИнтересная боевая система, не переусложненная излишними фичами, как обычно бывает в японских играх.\nБои проходят на поле 6*3, каждой стороне отведена своя половина поля, в бой можно взять не более 6 героев (позже появляется возможность призывать юниты на поле боя сверх лимита).\nДевять классов героев, у всех своя дальность атак (рукопашники бьют врага только в соседнем ряду, ружья бьют по прямой, а артиллерия бьет далеко, но бесполезна против ближних врагов) и слабости к атакам других классов (маги страдают от всех, кроме других магов).\nПо мере прохождения персональных квестов героев они получают новые спец атаки, и не обязательного своего же класса.\nИ это вместе с бонусами/малусами на клетках, аурами героев, усиливающими героя/союзников или ослабляющими врагов, сильно влияет на расстановку героев.\n\nЭкономическая система примитивна - контролируемые города приносят деньги каждый ход, деньги расходуются на увеличение войск в отряде героя или восстановление потерь после боя.\n\nК сожалению выбор сложности доступ только после первого прохождения, но в процессе игры можно дополнительно повысить сложность завоевывая сперва сложные страны и взяв бонусный артефакт, что усилит все остальные страны.\n\nВ минусах очень неспешное появление новых геймплейных возможностей (спец атаки, бонусы/малусы на поле боя, ауры героев, древние герои) и под конец игры заваливают квестами персонажей.\n\nВ игре две концовки и получить истинную концовку проще, чем нормальную.", "timestamp_created": 1511447674, "timestamp_updated": 1511447674, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.471698", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36962975": {"recommendationid": "36962975", "author": {"steamid": "76561198084010806", "num_games_owned": 454, "num_reviews": 11, "playtime_forever": 3171, "playtime_last_two_weeks": 885, "last_played": 1516191999}, "language": "thai", "review": "Eiyuu*Senki\nเดิมแล้วตัวเกมส์นั้นออกมาให้สำหรับผู้เล่นที่มีอายุ 18+ ขึ้นไป พูดง่ายๆก็คือเกมส์สำหรับผู้ใหญ่\nแต่พอลงใน Steam - All-Ages Edition ทำให้อายุของผู้เล่นถูกจำกัดที่อายุ 15+ ขึ้นไป\nและ บางฉากได้ถูกถอดออกไป พูดง่ายๆ แม่งเปลี่ยนฉากพื้นหลังเป็นสีดำ\n\nรูปแบบของเกมส์ เป็น แนววางแผน ยึดเมือง และ การเจรในกรณีที่มีตัวเลือมากกว่า 1 ข้อขึ้นไป\nการใช้ตัวละครนั้น สามารถใช้ได้ 1 ครั้ง ต่อการตัดสินใจ อย่าลืมสำรองตัวละครไว้ด้วย\nเพราะหลังจากกดการจบเทริน ศัตรูอาจจะโจมตี หรือ ไม่โจมตีก็ได้ \nในกรณีที่ไม่เหลือตัวละครไว้ตั้งรับ จะถือว่าเป็นการแพ้การรบไปเลย\n\nสำหรับเงินในเกมส์มีใช้ใน 3 กรณีคือ\n1.ใช้ในบาง Event \n2.ใช้สำหรับรักษาตัวละคร (ถ้าบาดเจ็บเล็กน้อย ไม่ต้องรักษาปล่อยให้ตัวละคร Heal ตัวเองได้ หรือ สวมใส่ Item ที่ใช่ในการ Heal ให้เร็วขึ้น)\n3.อัพเกรตตัวละคร\n\nตัวละครมีการแพ้ทางกันในแต่ละสายนะ\n\n1.โจมตีระยะประชิด\n- หมัด\n- ขวาน\n\n2.โจมตีระยะปานกลาง\n- ดาบ\n- ปืนพก?\n\n3.โจมตีระยะไกล\n- ปืนไรเฟิล\n- ปืนใหญ่\n- เวทย์\n- ระเบิด\n- ธนู\n\nเท่าที่ทางนี้นึกออกนะ แต่ละสาย\n\nดูเหมือนว่าตัวละครในเวอร์ชั่น ญี่ปุ่นจะมีมากกว่า เวอร์ชั่นภาษาอังกฤษ ไม่รู้ว่าเหตุผลเป็นเพราะอะไร\n\nก็แค่นี้ละ... \n\nห๊ะ อะไรนะ อยากได้ฉากเก่ากลับมา ก็ไปซื้อส่วนเสริมเอาเองสิครับ $5.99\nhttps://www.jastusa.com/eiyu-senki-the-world-conquest-dlc\n\nหรือไม่ก็ซื้อตัวเต็มไปเลย ตอนนี้ดูเหมือนว่าลดราคาอยู่ละ $35.99\nhttps://www.jastusa.com/eiyu-senki-the-world-conquest\n\nอะไรนะอยากซื้อตัวเกมส์ดั้งเดิมภาษาญี่ปุ่น ไปหาซื้อเอาเองในเน็ตเถอะ...", "timestamp_created": 1511420446, "timestamp_updated": 1511420446, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36809551": {"recommendationid": "36809551", "author": {"steamid": "76561197991014182", "num_games_owned": 914, "num_reviews": 2, "playtime_forever": 1497, "playtime_last_two_weeks": 0, "last_played": 1510748281}, "language": "english", "review": "So imagine a world where everyone is Cute girls... Well except for you of Course all the Historical figures All of them cute girls.\nNow you get to take over that world... And becourse of that I lead an Army of Vlad Tepesh (Who is a cute Girl), Oda Nobonaga (Who is a cute girl), Sir Lancelot (Who is a cute girl), Edward Teach (Who is a cute cat girl) And Sun Tzu (Who is a cute girl) agaisnt the Iluminati to take over the world.", "timestamp_created": 1511385307, "timestamp_updated": 1511385307, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36770606": {"recommendationid": "36770606", "author": {"steamid": "76561198373967784", "num_games_owned": 51, "num_reviews": 1, "playtime_forever": 1793, "playtime_last_two_weeks": 40, "last_played": 1515961007}, "language": "french", "review": "Un jeu très intéressant malgré mes réticences premières. L'aspect stratégiques n'est pas extraordinaire mais on se laisse facilement porter par le challenge, surtout que le jeu propose plusieurs choix offrant des difficultés différentes. Les personnages sont plutôt bien travaillés, tant au niveau du design que du caractère. L'histoire est plutôt intéressante et certains passages sont extrêmement drôles pour peu que l'on manie un peu l'anglais. Alors, certes, il a un côté un peu osé mais je ne le trouve pas plus choquant que cela. La durée de vie me semble tout à fait satisfaisante pour le prix. Bref, je ne regrette pas du tout mon choix.", "timestamp_created": 1511380640, "timestamp_updated": 1511380640, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36694836": {"recommendationid": "36694836", "author": {"steamid": "76561198369428194", "num_games_owned": 503, "num_reviews": 48, "playtime_forever": 965, "playtime_last_two_weeks": 0, "last_played": 1511482105}, "language": "russian", "review": "- Just how cold is Russia?\n- Unimaginably. Hammering a nail with a banana is nothing out of the ordinary.\n\nСама игра мне понравилась, няшная такая визуальная новелла с тактикой. Сюжет не сказать чтобы оригинальный... на самом деле, я не могу отделаться от ощущения что его тупо сперли из Oda Nobuna no Yabou, разве что добавив ояшу амнезию. Ну а чего бы нет, амнезия это модно, молодежно и позволяет не заморачиваться с завязкой. Пусть будет.\n\nКроме Нобуны... на самом деле много чего. Вкратце: ояш жил себе, никого не трогал, ояшил понемножку, потом неожиданный поворот и Матрица глюканула, переместив его в альтернативную вселенную, где все мало-мальски значимые личности это тян (например, Коро...лева Артур), творится дичь и с этим надо что-то делать.\n\nХотел поставить палец вниз за еврейские гены издателя, но я в принципе осуждаю подход ставить дизлайк разрабу/издателю, а не игре. Сдержался.\n\nИз стимовской версии много вырезано. Ну как много... не очень много, на самом деле: игра весит 2 гига, а установщик \"DLC\" со сценами R18 каких-то полгига, всего 25% от общего веса. Причем там именно вырезанное, а не зацензуренное. За примером можно обратиться на страницу игры в Магазине. Последний скриншот, где плагиат Малевича. Могли бы впихнуть с цензурой, как все, а потом выложить где-нибудь ( ͡° ͜ʖ ͡°)-патч, но у джастюса своя уличная магия. Халявного патча нет, есть платный, специально для купивших игру в Стиме.\n\nБез патча играть не вариант, а это означает, что игра стоит не 515 рублей, а без малого вдвое дороже. Вторую половину стоимости нужно заплатить в магазине издателя, лично ему в карман и без скидок.\n(Да, можно скачать где-нибудь из-под полы или попросить у уже купивших, но мы же приличные люди?.. так-то можно и саму игру \"достать вне Стима\", один хрен ни карточек ни достижений нет и не планируются... да какие там карточки, у нее даже поддержки скриншотов нет!..)", "timestamp_created": 1511349562, "timestamp_updated": 1511436876, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.498651", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36687012": {"recommendationid": "36687012", "author": {"steamid": "76561198089128243", "num_games_owned": 95, "num_reviews": 5, "playtime_forever": 467, "playtime_last_two_weeks": 0, "last_played": 1514492072}, "language": "english", "review": "Lu Bu is best girl, fight me on this one", "timestamp_created": 1511316826, "timestamp_updated": 1511316826, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.487187", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36682714": {"recommendationid": "36682714", "author": {"steamid": "76561198005686966", "num_games_owned": 50, "num_reviews": 5, "playtime_forever": 2445, "playtime_last_two_weeks": 0, "last_played": 1513396524}, "language": "german", "review": "Als Kenner und Liebhaber von Visual Novels kann ich es mir nicht nehmen lassen, ein Review zu diesem Spiel zu schreiben. Ich habe es schon auf dem Radar, seit ich 2011 in einem japanischen Fachmagazin davon gelesen habe und habe sowieso ein Faible für Rundenstrategie.\n\n1. Grafik\nWie viele japanische Storygames hat das Spiel fast ausschließlich gezeichnete 2D-Grafiken. Die Charaktere und Hintergründe sind farbenfroh und detailliert, wobei man klar leichte \"Sparmaßnahmen\" bemerkt, wenn man näher hinsieht. Es ist kein superpolished HD look, sondern man kann mit geübtem Auge klare digitale Pinselstriche und Ungenauigkeiten erkennen. Diese schreibe ich aber eher dem sehr organischen und leicht unsauberen Stil von Oyari Ashito zu und stört keinesfalls.\nDie verschiedenen Orte der Welt haben ansehnliche Hintergrundbilder verpasst bekommen und sind durchweg gelungen. Manche wurden mehrfach verwendet, was aber nicht stört, da sie nur einen generellen Eindruck des Landes vermitteln sollen und keinen konkreten Ort.\n\n2. Musik und Sound\nDie Musik ist VN-typisch größtenteils leicht und zweckmäßig. Das Standardlied für ruhige Szenen ist unaufdringlich und nett, ohne auch nach stundenlangem Anhören zu nerven. Die Kampfmusik ist nicht übertrieben und ebenfalls gut als Untermalung hörbar. Keines der Lieder reißt wirklich mit, aber es geht auch keins auf den Senkel.\nDie sonstigen Soundeffekte sind das übliche \"Bling\", \"Kling\", \"Plopp\" usw.\n\n3. Charaktere\nDie Charaktere wirken alle sehr jugendlich, sogar diejenigen, die laut eigener Aussage \"mittleren Alters\" sein sollen, namentlich Abe no Seimei und Aristoteles. Auch das ist ein Element des Zeichenstils.\nDagegen sind die Charaktere gut unterscheidbar und bedienen diverse Klischees der Animekultur, wobei man immer noch klare Persönlichkeit erkennen kann. Dass die bei der Unmenge an Charakteren nicht allzu tief ausfällt ist zu verzeihen. Die Bandbreite sorgt aber dafür, dass wohl jeder Spieler seine persönlichen Lieblinge findet.\n\n4. Sprachausgabe / Voice Acting\nDa braucht man wenig Worte verlieren. Japanisches Voice Acting gehört zu dem Besten der Welt. Gerade die hyperactiven Charaktere werden mit viel Hingabe gesprochen und die Bandbreite von süß bis erwachsen, von hektisch bis ruhig ist riesig. Auch sehr unkonventionelle Stimmen sind dabei.\n\n5. Dialoge\nSeien wir ehrlich, japanischer Humor ist nicht Jedermanns Sache. An manchen geht er vollkommen vorbei, andere lieben ihn. Die Witze sind allerdings ein großer Teil der Dialoge, also sollte man abschätzen können, ob man damit etwas anfangen kann. Allerdings haben einige schöne Anspielungen ihren Weg in das Spiel gefunden. Einer der Charaktere bekommt regelmäßig \"Eingebungen von Gott\", was dann durch Analog-Modemgeräusche untermalt wird. Auch hilft es, ein wenig etwas über fernöstliche Mythologie oder Legenden zu wissen, wenn zum Beispiel Sanzou Houshi den Spieler immer als \"Hakkai\" bezeichnet und einen Affen namens Goku auf der Schulter hat.\nEs gibt etliche kleine Storyszenen, die größtenteils eher wie eine Besichtigung während einer Weltreise wirken als Gespräche während einer Welteroberung. Über diese Dialoge kommt aber das Verhältnis der Charaktere zueinander ziemlich gut rüber und vermittelt einem das Gefühl, sie immer besser kennen zu lernen.\n\n6. Strategieteil\nZiemlich früh im Spiel wird man darauf hingewiesen, dass man die Länder in verschiedenen Reihenfolgen erobern kann und dadurch das Spiel leichter oder schwerer wird (und man für schwerere Methoden Belohnungen bekommt). Ich habe mich für die schwerstmögliche Reihenfolge entschieden und muss sagen, dass das die richtige Wahl war.\nHätte ich mit den einfachen Ländern angefangen, dann wäre das Spiel so vor sich hingeplätschert und ich wäre ohne Probleme durch alles durchmarschiert, da meine Truppen gut ausgebaut in die schwereren Länder eingefallen wären. So war noch eine ordentliche Herausforderung dabei, zumindest stellenweise. Die einfachen Länder danach waren natürlich nur noch ein Pausensnack.\nIch rate jedem, vor einer Kriegserklärung abzuspeichern und erst einmal den schweren Weg zu probieren. Dabei zu siegen ist viel befriedigender, als zuerst die leichten Gegner abzufrühstücken und dann mit deren Ressourcen im Rücken die schwereren Gegner anzugreifen.\nMissionen werden dadurch absolviert, dass man Charaktere mit einem bestimmten Mindestgesamtwert bestimmter Attribute wie Diplomatie, Suchen, Handwerk usw. zuweist. Die meisten Missionen laufen ohne Kampf ab und bestehen nur aus dem Einsatz der Charaktere und einer kurzen oder längeren Dialogszene. Zur Belohnung gibt es Gold, Items oder Charakterverbesserungen.\n\n7. Kämpfe\nDas Kampfsystem ist mäßig komplex. Es gibt Angriff, Verteidigung und Geschwindigkeit sowie Truppstärke und Typ. Manche Typen teilen gegen bestimmte andere Typen mehr Schaden aus, der vom Verhältnis zwischen Angriff und gegnerischer Verteidigung sowie eigener Truppstärke beeinflusst wird. Dazu kommt noch eine geringe Chance auf kritische Treffer mit doppeltem Schaden. Die Geschwindigkeit bestimmt soweit ich das sehen konnte nur die Anfangsreihenfolge.\nIm Laufe des Kampfes erlangt man \"Brave\"-Punkte, mit denen man Spezialattacken und Zauber einsetzen kann. Diese haben nicht nur eine bestimmte Zeit, die man danach warten muss bis man wieder an die Reihe kommt (so wie normale Attacken auch), sondern auch eine vorhergehende Wartezeit. Ein starker Angriff während dieser Zeit kann die Attacke unterbrechen. Finde ich ein nettes Feature. Jeder Charakter hat eine normale Attacke und mindestens eine Spezialattacke, durch das Absolvieren von besonderen Missionen erhalten sie nach und nach mehr Special Moves dazu. Manche sind richtig gut, andere nutzlos. Generell sind viele Charaktere einfach zu schwach im Kampf, aber man kann sie immer noch als \"letzte Verteidigungslinie\" bei Gegenangriffen verwenden und Missionen ohne Kampf mit ihnen machen, wenn alle anderen Charaktere in der aktuellen Runde schon etwas zu tun bekommen haben.\n\n8. Das DLC\nBrauche ich es oder nicht? Ganz klar: Nein. Das Spiel büßt keinen Spielwert dadurch ein, dass es auf jugendfrei getrimmt wurde. Die H-Szenen sind nicht Storyrelevant, aber gut gezeichnet und allesamt consensual (soweit ich es bisher nach ca. 30 Stunden reiner Spielzeit gesehen habe). Bei zumindest einem Charakter ist das normale Charaktersprite zensiert, was das DLC auch rückgängig macht (Ashokas blanke Brust, die eine sehr knappe Bedeckung spendiert bekam). Ansonsten ist einfach die Frage, ob man den Zusatzinhalt möchte. Ich finde den Preis des DLC okay und bin ein Purist, der alles gerne im Originalzustand mit so wenig Lokalisation wie möglich spielt.\n\n9. Fazit\nDas Spiel ist kein Hardcore-Strategietitel, aber anspruchsvoller als Wimmelbild-Minispiele. Die Kämpfe sind dazu da, den Spieler aktiv zu beschäftigen, nicht aber, um ihn vor schwierige Aufgaben zu stellen. Das Spiel lebt von der erzählten Story und dem Charme der Charaktere. Wenn man sich von Kampf zu Kampf klickt und alle Dialoge überspringt tut man sich keinen Gefallen. In erster Linie ist es immer noch eine Visual Novel, nur eben mit \"Mitmachfunktion\", die etwas mehr Interaktivität mit sich bringt als ein eingeblendetes Menü mit Handlungsoptionen. Dennoch ist das Spiel einigermaßen linear, wenn auch auf mehreren Handlungssträngen parallel.\nEs macht Spaß und ist umfangreich genug, um eine Weile zu beschäftigen. Wer dem Stil etwas abgewinnen kann und lockere Strategiekost mag kann zuschlagen. Wer bei Animes die Nase rümpft wird auch hier keine große Freude haben.\n\nNachtrag zu Eiyuu Senki GOLD:\nEiyuu Senki GOLD ist kein Add-On, sondern ein komplettes eigenständiges Spiel mit anderer Story, anderer (aber ähnlicher) Spielmechanik und VIEL mehr Spielinhalt, vor allem CGs. Es ist wie eine Neuinterpretation. So wie der Batman-Film von 1989 und \"The Dark Knight\". Beides sind Batman-Filme, haben aber außer Batman, Alfred und Joker nichts miteinander gemeinsam. Kauft das Spiel hier und vielleicht kommt auch \"GOLD\".", "timestamp_created": 1511295564, "timestamp_updated": 1511295564, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525862", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36676234": {"recommendationid": "36676234", "author": {"steamid": "76561198377783745", "num_games_owned": 165, "num_reviews": 8, "playtime_forever": 2637, "playtime_last_two_weeks": 18, "last_played": 1516030465}, "language": "thai", "review": "Great story\n\nlovely waifu\n\nTHE BEST CGs\n\n100/10", "timestamp_created": 1511273055, "timestamp_updated": 1511273119, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36647833": {"recommendationid": "36647833", "author": {"steamid": "76561198103881800", "num_games_owned": 224, "num_reviews": 3, "playtime_forever": 950, "playtime_last_two_weeks": 0, "last_played": 1513349666}, "language": "thai", "review": "ถ้าได้ซื้อDLCมาจะได้เห็นอะไรตระะการตาแน่นอน", "timestamp_created": 1511191565, "timestamp_updated": 1511191565, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "2", "steam_purchase": true, "received_for_free": true, "written_during_early_access": false}, "36631608": {"recommendationid": "36631608", "author": {"steamid": "76561198072808452", "num_games_owned": 443, "num_reviews": 6, "playtime_forever": 80, "playtime_last_two_weeks": 0, "last_played": 1511119951}, "language": "english", "review": "I was expecting a Sengoku Rance type of game and while this goes in a similar direction, it cannot keep up with SR.\nThe strategy elements are reduced to a barebones skeleton of what Sengoku Rance had to offer.\nThe story and characters were a lot more \"cutesy\" which for me personally didn't work out to well. I found the game to be less engaging than Sengoku Rance, I did not care for the conquest nor for the main cast of characters.\n\nIt's kind of a bummer when a 2017 game is just an inferior version of a 2006 game.", "timestamp_created": 1511120893, "timestamp_updated": 1511120893, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.455606", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36600420": {"recommendationid": "36600420", "author": {"steamid": "76561198076808361", "num_games_owned": 88, "num_reviews": 1, "playtime_forever": 900, "playtime_last_two_weeks": 0, "last_played": 1515161634}, "language": "thai", "review": "เทพกว่านี้ไม่มีอีกแล้ว", "timestamp_created": 1511020469, "timestamp_updated": 1511020469, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36597260": {"recommendationid": "36597260", "author": {"steamid": "76561198040459106", "num_games_owned": 323, "num_reviews": 24, "playtime_forever": 2417, "playtime_last_two_weeks": 0, "last_played": 1514478776}, "language": "english", "review": "Great game with simple but enjoyable strategy elements.\nThe designs are pleasant to the eyes and the story makes you want to play more and more until the whole day is gone.\n \nStrategy game with cute anime girls what more can you ask for?\nThe game is even better if you own the patch.", "timestamp_created": 1511012336, "timestamp_updated": 1511436015, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.573247", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36576027": {"recommendationid": "36576027", "author": {"steamid": "76561198047244659", "num_games_owned": 168, "num_reviews": 7, "playtime_forever": 2562, "playtime_last_two_weeks": 0, "last_played": 1512334568}, "language": "english", "review": "One more turn then i'll go to sleep.\n\n5 hrs later >\n\nWell, who need to sleep anyway? Kappa\n\n10/10 solid strategy game \n\nKreygasm/10 with dlc :v", "timestamp_created": 1510938080, "timestamp_updated": 1510938080, "voted_up": true, "votes_up": 7, "votes_funny": 2, "weighted_vote_score": "0.570003", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36575373": {"recommendationid": "36575373", "author": {"steamid": "76561198091217786", "num_games_owned": 99, "num_reviews": 8, "playtime_forever": 3294, "playtime_last_two_weeks": 0, "last_played": 1515136971}, "language": "thai", "review": "หนุกโคตรรรรรรรรรรรรรรรรรรรรรรรรรรรรรรรรรรรรรรรร\n1000/10\nไม่ต้องนั่งอ่านรีวิวละ ถ้าคิดว่าชอบเล่นเกมเเนวvisual novel แบบturnbase ก็จัดไปโลด\nภาพแจ่ม เสียงแหล่ม ราคาย่อมเยา\nยัง...ยังไม่รีบกดอีก\n\nปล.มีpatch18+ให้ซื้อในเว็บjast usa", "timestamp_created": 1510936203, "timestamp_updated": 1510936203, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36572863": {"recommendationid": "36572863", "author": {"steamid": "76561198130006825", "num_games_owned": 25, "num_reviews": 6, "playtime_forever": 8, "playtime_last_two_weeks": 0, "last_played": 1510929813}, "language": "schinese", "review": "The game is very good but!!!We have a lot of people who like this game in China but have no translation for Chinese", "timestamp_created": 1510929970, "timestamp_updated": 1510929970, "voted_up": true, "votes_up": 0, "votes_funny": 3, "weighted_vote_score": "0.476190", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36569838": {"recommendationid": "36569838", "author": {"steamid": "76561198053970121", "num_games_owned": 302, "num_reviews": 6, "playtime_forever": 3067, "playtime_last_two_weeks": 0, "last_played": 1514310780}, "language": "thai", "review": "Eiyuu Senki เป็นเกมดีที่มีเนื้อหาที่สนุกมีทั้งตลก น่ารักและเศร้าเล็กๆน้อยพอเป็นพิธี\nตัวเรานั้นก็เล่นมาตั้งแต่สมัยที่มันยังไม่แปลจนมีแฟนแพทแปลอิงออกมา\nเล่นไปรวมๆร้อยกว่าชั่วโมงแล้วยังเล่นไม่เบื่อเลยเล่นได้เรื่อยๆเลย\nสวนของเกมเพลย์ก็เป็นแนว trun base ที่ไม่ยากจนเกินไปพอให้ใช่สมองคิดนิดหน่อย\nพอเราเห็นเกมนี้เข้ามาก็เลยรีบจัดเลยไม่รอช้าเพราะชอบเกมนี้มากๆเลย\nเป็นเกมที่คุ้มค่ามากสำหรับเรา\nเราให้คะแนนตามนี้เลย\nภาพ 10/10 เลยเป็นแฟนภาพอ.ท่านนี้อยู่แล้ว\nเสียง 9/10 ยังขัดใจกับระบบออโต้รีดอยุ้นิดหน่อยที่เสียงไม่ซิงกันเท่าไรกับ\nอยากให้มีเสียงตัวเอกด้วยแล้วถ้าไม่อยากได้ยินเสียงตัวเอกก็ค่อยไปปิดเอง\nเนื้อเรื่อง 100/10 เลยอาจจะอวยไปหน่อยแต่เกมที่ที่เนื้อเรื่องที่เอาใจใส่กับตัวละครมากที่เดียว\nสรุป\nซื้อเถอะสนับสนุนให้ค่ายเอาเกมมาลงเพิ่มอีก อีกทั้งยังมีลุ้นภาค Gold ด้วยว่าทางค่ายจะเอามาลงไหม", "timestamp_created": 1510920438, "timestamp_updated": 1510920438, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36566665": {"recommendationid": "36566665", "author": {"steamid": "76561198112977243", "num_games_owned": 153, "num_reviews": 4, "playtime_forever": 629, "playtime_last_two_weeks": 180, "last_played": 1515572131}, "language": "thai", "review": "very nice game waifu 2017 !!", "timestamp_created": 1510906278, "timestamp_updated": 1511375291, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36566018": {"recommendationid": "36566018", "author": {"steamid": "76561198301670476", "num_games_owned": 627, "num_reviews": 27, "playtime_forever": 8, "playtime_last_two_weeks": 0, "last_played": 1510911926}, "language": "schinese", "review": "补丁是有的，上JAST花5.99USD就可以买到R18DLC\n反正我已经买了，中文什么的挂个外挂就完事\n战国兰斯？滑稽", "timestamp_created": 1510903126, "timestamp_updated": 1510903126, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.645592", "comment_count": "4", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36564094": {"recommendationid": "36564094", "author": {"steamid": "76561198005392537", "num_games_owned": 212, "num_reviews": 5, "playtime_forever": 616, "playtime_last_two_weeks": 0, "last_played": 1510967659}, "language": "english", "review": "Am I the only person in this review section who bought it because the Fire Emblem-y Ogre Battle-y unit-based combat looked interesting, and *not* because of sex scenes with historical figures as anime girls?  I mean, I'll gently hold Lu Bu's hand if it means she learns how to kill things better, but I didn't set out with that intention.\n\nDoes this make me weird?", "timestamp_created": 1510892854, "timestamp_updated": 1510892854, "voted_up": true, "votes_up": 25, "votes_funny": 22, "weighted_vote_score": "0.685172", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36555088": {"recommendationid": "36555088", "author": {"steamid": "76561198061039434", "num_games_owned": 258, "num_reviews": 40, "playtime_forever": 2060, "playtime_last_two_weeks": 181, "last_played": 1515957331}, "language": "thai", "review": "จัดสรรทรัพยากรและกองทัพเพื่อพิชิตโลกโดนล้อมหน้าล้อมหลังด้วยสาวงามหลากหลายแนว!!!   Vn + วางแผนราคาย่อมเยา  ภาพสวย เนื้อเรื่องโอเค แนวฮาเร็มทะลุมิติตามท้องตลาด  สาวๆเยอะมาก  เพื่อความครบรสต้องไปซื้อDLC เพื่อ\"เนื้อเรื่องเพิ่มเติม\" ราคาพอสมควร (6เหรียญ)", "timestamp_created": 1510853398, "timestamp_updated": 1510853398, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36552981": {"recommendationid": "36552981", "author": {"steamid": "76561198159076370", "num_games_owned": 88, "num_reviews": 4, "playtime_forever": 132, "playtime_last_two_weeks": 0, "last_played": 1515177649}, "language": "english", "review": "Finished the game few years back when only the fan translation were available. Bought the game and patch now to replay the game and support the devs. Hopefully jast takes up eiyu senki gold as well", "timestamp_created": 1510846146, "timestamp_updated": 1510846146, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.510218", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36535892": {"recommendationid": "36535892", "author": {"steamid": "76561198102945329", "num_games_owned": 3025, "num_reviews": 6, "playtime_forever": 600, "playtime_last_two_weeks": 0, "last_played": 1510798764}, "language": "english", "review": "I like this game, it best anime stategy game.\nRate this game 10/10\n\nBut when you have DLC \nRate this game 100/10", "timestamp_created": 1510767735, "timestamp_updated": 1510767735, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.493227", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36534439": {"recommendationid": "36534439", "author": {"steamid": "76561198366747094", "num_games_owned": 49, "num_reviews": 12, "playtime_forever": 6, "playtime_last_two_weeks": 0, "last_played": 1510762370}, "language": "schinese", "review": "这游戏没有中文补丁，想买的请三思", "timestamp_created": 1510762518, "timestamp_updated": 1510806812, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.533019", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36528456": {"recommendationid": "36528456", "author": {"steamid": "76561198062089734", "num_games_owned": 69, "num_reviews": 12, "playtime_forever": 539, "playtime_last_two_weeks": 0, "last_played": 1511374235}, "language": "english", "review": "good game to bring back the old time.\n\n11/10 with DLC patch.", "timestamp_created": 1510740867, "timestamp_updated": 1510740867, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.515317", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36524828": {"recommendationid": "36524828", "author": {"steamid": "76561198027214606", "num_games_owned": 566, "num_reviews": 7, "playtime_forever": 611, "playtime_last_two_weeks": 1, "last_played": 1516419527}, "language": "english", "review": "Waifus Waifus Waifus, and a bit of strategy gameplay - which actually is a little better than expected.", "timestamp_created": 1510721164, "timestamp_updated": 1510721164, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.465434", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36517568": {"recommendationid": "36517568", "author": {"steamid": "76561197992991835", "num_games_owned": 185, "num_reviews": 8, "playtime_forever": 637, "playtime_last_two_weeks": 0, "last_played": 1511461390}, "language": "english", "review": "Lovely game, my first impression is that is a Sengoku Rance type game if you know what that is.\n\nStory is very cute and the MC is kinda bland and loving towards his girls so its pure vanilla all the way.\n\nI bought the uncensor DLC patch from the JastUSA website for 6$. Just had to download, extract to my install directory and run it and now the game is fully uncensored.\n\nRead some reviews saying their dlc got flagged but my AV didn't have any reactions at all.\nGuessing it was false positive.\n\nAnyways the initial gameplay is pretty easy. I have heard additional difficulties might be unlocked somehow but I am not sure how.\nEnjoying my time in the game regardless.\n\nEdit : I hope that Jast looks towards translating and selling Eiyu*Senki Gold Edition as well. It would definitely rate a buy from me as well.", "timestamp_created": 1510687452, "timestamp_updated": 1510687675, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.598594", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36513379": {"recommendationid": "36513379", "author": {"steamid": "76561198023459156", "num_games_owned": 174, "num_reviews": 22, "playtime_forever": 714, "playtime_last_two_weeks": 0, "last_played": 1511528344}, "language": "thai", "review": "ถึงจะซื้อแท้แต่ก็ยังคงเล่นเถื่อน.... เพราะเล่นไปไกลแล้ว :D\nเกมนี้ บน Steam โดน \"เซ็นเซอร์\" แทบจะทุกฉาก.. ลงแพท Uncen ไม่ได้ ณ ปัจจุบัน... (ทำร้ายมาก...)\nรอสักเดือนอาจจะมีคนทำแพท Uncen สำหรับ Steam มาลงให้ก็ได้ครับ...\nสนับสนุนให้ซื้อครับสนุกมากกกกกกกกกกกกกกกกกกกกก\n[spoiler] กุกดคืนเงินไม่ทันสัส เพลินยาวไป 5 ชั่วโมงรวด แล้วพึ่งมารู้ตัวตอนตีอินเดีย... ทำไมแม่นางไม่โชว์จุกสีชมพู เหือนที่เราเล่นก่อนหน้านี้...\n Oma a Wa.... Mo sin De E ru... NANI!!!!!!!![/spoiler]", "timestamp_created": 1510672698, "timestamp_updated": 1510672698, "voted_up": true, "votes_up": 3, "votes_funny": 5, "weighted_vote_score": "0.545455", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36511339": {"recommendationid": "36511339", "author": {"steamid": "76561197999737253", "num_games_owned": 2534, "num_reviews": 62, "playtime_forever": 1405, "playtime_last_two_weeks": 0, "last_played": 1510924551}, "language": "koreana", "review": "야시꾸리한걸 기대하고 시작했는데 란스하는 기분이네\n\n생각보다 밸런스적인 측면에서 생각할것도 있고 야리코미적인 요소도 많다...\n\n나중에 밖에서 할때는 전령판으로 해야할듯", "timestamp_created": 1510666264, "timestamp_updated": 1510666264, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.646929", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36510716": {"recommendationid": "36510716", "author": {"steamid": "76561198113455411", "num_games_owned": 4053, "num_reviews": 84, "playtime_forever": 239, "playtime_last_two_weeks": 0, "last_played": 1511132305}, "language": "german", "review": "[h1]📃 Kritik zu Eiyu*Senki – The World Conquest von JAST USA[/h1]\n\nLeider greift hier auch die Methode für Patches Geld zu nehmen. Der Kunde bekommt hier bei Kauf nur ein zerstückeltes Produkt zu sehen.\n\nDen Rest darf man für nur einmalige 5,99$ über die JastUSA Webseite dazukaufen.\n\nMangagamer, Sekai Project/Degica, WingedCloud, dutzende Nachahmer inklusiv Patreonseite.... haben es in dem Bereich hier in Steam erfolgreich vorgemacht und verkaufen \"gesonderte\" Editionen die sie sich ebenfalls gerne doppelt bezahlen lassen. Das Beste daran, es funktioniert.\n\nDas Ganze dann gemixt mit Usern die das mitmachen und 2x zur Kasse gehen um ein vollwertiges Produkt in den Händen zu halten. Eine gute Kombination. Dem Anschein nach, scheint dies mittlerweile ein einträgliches Geschäftsmodell geworden zu sein.\n\nHier wird leider nur aufgrund von amerikanischen Gesetzgebungen und der Unfähigkeit Valves da einzuschreiten ein unnötiger Kampf auf dem Rücken der User ausgetragen und damit auch noch Kasse gemacht.", "timestamp_created": 1510663938, "timestamp_updated": 1511233965, "voted_up": false, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.566481", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36498422": {"recommendationid": "36498422", "author": {"steamid": "76561198017052791", "num_games_owned": 188, "num_reviews": 10, "playtime_forever": 875, "playtime_last_two_weeks": 0, "last_played": 1511321442}, "language": "english", "review": "Prepare to fail your history class and check your privilege as you enter a feminist's nightmare in order to save the world from the oppression of scantily clad women leaders.", "timestamp_created": 1510602978, "timestamp_updated": 1510602978, "voted_up": true, "votes_up": 11, "votes_funny": 24, "weighted_vote_score": "0.438552", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36497538": {"recommendationid": "36497538", "author": {"steamid": "76561198091585952", "num_games_owned": 86, "num_reviews": 9, "playtime_forever": 2342, "playtime_last_two_weeks": 0, "last_played": 1511687432}, "language": "thai", "review": "ข้อดี                                   \n -  เล่นง่าย\n -  ตัวละครน่ารัก\n -  มีแต่สาวๆเยอะด้วย\n -  เงินฟรุ้งมากหาง่าย \n\nข้อเสีย 1\n -  ไม่มีระบบเลเวล(คืออยากให้ตัวไหนเก่งๆก็ซื้อเลือดเพิ่มได้ โดยที่ตัวนั้นเราแทบไม่หยิบมาเล่นเลยก็ตาม)\n     อาจะดีสำหรับคนอื่น แต่ผมไม่\n\nข้อเสีย 2\n -  ถ้าได้ไปเปิดฉากคุยกับประเทศไหนแล้วไปตีเมืองเขาแล้ว แต่ยังยึดประเทศเขาไม่ได้ เวลากดจบเทิร์น แล้ว\n มันจะตีเมืองที่เรายึดกลับ บางทีก็ไม่มีตัว ฮีโร่ สู้ เพราะใช้ไปหมดล่ะ แต่หลังๆ ฮีโร่ เราเยอะ แล้วจะไม่มีปัญ﻿หานี้\n   \n- เสริมๆ ถ้าเรายึดโครงโลกหมดแล้ว บอส หลักจะโผล่มา ช่วงๆนี้ เงินมีเท่าไหร่ก็จัดเลือดให้ Hero เยอะๆเลย\n เพราะว่ายังไงเล่นจบแล้วก็ตัดมาหน้าเมนูอยู่ดี เงินที่เก็บมาแถบไม่มีความหมาย หลังจบเกมแล้ว ถ้าเริ่มเกม\n ใหม่จะ สามารถ เอา item ทุกอย่าง จากเชฟเดิมที่เล่นจบมาได้ แต่ ยกเว้น หลอดเลือดที่เราเพิ่ม และ เงิน \n เพิ่มเติมหน่อย หลังจากเล่น จบ แบบ True end จะปลดล็อค Hard mod มาให้เล่น  (Hard mod ยากสัส)\n\n โดย﻿รวมๆสนุกมาก ใครที่อยากลองเล่นแนะนำเลย\n ผมรอภาค 英雄＊戦姫 GOLD อยู่นะ หวังว่าคงเอามาลงสตรีมด้วย  \n เพราะภาค GOLD ก็เหมือนการอัฟเกรดเกมนี้แล้วนี้เอง เพิ่มอะไรหลายอย่าลงไป แต่ไม่ต่างไรกับภาคนี้หรอก\n \n10/10 [spoiler] เคยเล่นเถื่อนมาก่อนสมัยนู้นนานล่ะ สนุกมาก ถึงเวลาต้องไถ่บาปล่ะเรา55\t[/spoiler]", "timestamp_created": 1510599926, "timestamp_updated": 1511530536, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36488403": {"recommendationid": "36488403", "author": {"steamid": "76561198139048196", "num_games_owned": 47, "num_reviews": 1, "playtime_forever": 1756, "playtime_last_two_weeks": 0, "last_played": 1514743228}, "language": "thai", "review": "ถ้าไม่เคยเล่นมาก่อน Eiyuu senki เป็นเกมวางแผนกึ่งวิชวลโนเวล ที่ให้ผู้เล่นฝึกฝนกองกำลังโจมตีเมืองต่างๆ และหาขุนพลสาวๆมาเป็นพวก แต่ล่ะคนจะมีสกิลและคลาสต่างกันส่งผลต่อการต่อสู้กับศัตรู นี่คือคอร์หลักของเกมนี้ แน่นอนสาวๆน่ารักทุกคน และเนื่องจากเป็นเกม 18+ ก็คงรู้ดีว่าจะมีฉากแบบนั้น แต่แน่นอนเพราะลงสตรีมจึงตัดออกไป  หาแพทซ์เองนะจ๊ะ\nปล.ฉากไหนไม่เรทมากก็มีอยู่ มีเซ็นเซอร์และหมอกศีลธรรมแน่นอน แต่ว่า อโศกอ่ะ เอ็งเห็นชุดมันโป๊ทั้งตัวขี้เกียจเซ็นใช่ไหม ถึงซูมเข้าจนเห็นหน้าเต็มๆแทนเนี่ย\n\nเอาภาค gold มาลงด้วยสิเฮ้ย", "timestamp_created": 1510564804, "timestamp_updated": 1510564804, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36487809": {"recommendationid": "36487809", "author": {"steamid": "76561198109787276", "num_games_owned": 84, "num_reviews": 11, "playtime_forever": 30, "playtime_last_two_weeks": 0, "last_played": 1510610303}, "language": "schinese", "review": "听说这游戏不错..\n[spoiler]望天门山北: mega.nz斜杠#!4EdE3IAb!ir7-Esqt5zih_UqSiE88m_CY6lUsrodRYCAGZfNiArs\n\n国内需要翻墙[/spoiler]", "timestamp_created": 1510561470, "timestamp_updated": 1513472186, "voted_up": true, "votes_up": 23, "votes_funny": 2, "weighted_vote_score": "0.742058", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36487076": {"recommendationid": "36487076", "author": {"steamid": "76561197984735209", "num_games_owned": 100, "num_reviews": 1, "playtime_forever": 141, "playtime_last_two_weeks": 0, "last_played": 1510470532}, "language": "english", "review": "If you looking for very casual, One-way stratigic-ish game, that would playable.\nAmong the pretty heroes*.\nHowever, most of the event scenes were cut, and gone.\nJust make sure You will see only BLACK empty screens for many of its events scenes, including H and it's not bug or glitch.\nEventhough its originality is adualt game, and they had to cut some, it is way too much.", "timestamp_created": 1510557663, "timestamp_updated": 1510560249, "voted_up": false, "votes_up": 23, "votes_funny": 3, "weighted_vote_score": "0.349255", "comment_count": "9", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "timestamp_dev_responded": 1510637631, "developer_response": "Thanks for the response. Yes, scenes too mature for Steam had to be removed from this release. However, when compared to the PS3 release, there are actually more scenes.\n\nThere is an uncut version available, but it's not on Steam."}, "36475764": {"recommendationid": "36475764", "author": {"steamid": "76561198122051900", "num_games_owned": 117, "num_reviews": 8, "playtime_forever": 2984, "playtime_last_two_weeks": 0, "last_played": 1513266354}, "language": "thai", "review": "สวัสดีจ้า มารีวิวกันเนอะ\nEiyu*Senki - The World Conquest เป็นเกมแนว วิชชวล โนเวลที่ผสมผสานเกมแนววางแผนปกครองบริหารเมืองจ้า\nซึ่งจะบอกว่าผสมผสานครึ้งต่อครึ่งก็คงไม่ใช่ เกมนี้เน้นเนื้อเรื่องเป็นหลัก แน่นอนว่าบทสนทนาเอะมากกกกก ใครไม่ชอบเสพเนื้อเรื่องแนะนำให้ข้ามไปจ้า \n\nเนื้อเรื่อง\nฮิมิโกะ-มิโกะสาวชั้นสูงราชินีแห่งYamataiที่มีความฝันต้องการยึดครองโลก\nเพียงแต่ว่าด้วยความอ่อนแอ อ่อนหัด ไม่ได้เรื่องหรืออะไรก็แล้วแต่ ทำให้ขนาดที่ว่าแค่ญีุ่่ปุ่น(ในเรื่องคือZipang)ยังไม่มีปัญญายึดสักเมือง\nวันหนึ่งฮิมิโกะอาจหาญไปตีเอโดะของโอดะ โนบุนากะแล้วเจอแผนลวงง่ายๆ หลอกจนพ่ายแพ้กลับมา ระหว่างทางโชคร้ายซ้ำซ้อนถูกโจรปล้นอีก แต่ในช่วงระหว่างที่คับขันนั้นเองกลับมีชายหนุ่มตกมาจากฟากฟ้ามาช่วยเหลือ ซึ่งเขาที่ชื่อChihaya(สามารถตั้งชื่อใหม่ได้)หรือพระเอกนั่นเอง และด้วยจากนิมิตก่อนหน้าของฮิมิโกะ พระเอกของเราจึงถูกเรียก(ยัดเยียด)ว่าเป็นผู้รับใช้แห่งสวรรค์ มาเพื่อกอบกู้Yamataiให้รุ่งเรืองอีกครั้ง และสามารถสานต่อแผนครองโลกของฮิมิโกะให้สำเร็จในภายภาคหน้านั่นเอง...\n \n\nในส่วนของโนเวล\nตัวเนื้อเรื่องเป้นเสียงพากย์ญี่ปุ่น/ซับอังกฤษ ซึ่งไม่ยากต่อการเข้าใจ มีการสอดแทรกมุกตลกที่มีทั้งฮาแตกกระจาย หรือมุกสามบาทห้าบาทแบบแอบขำคิกๆ นี่จะมีมาตลอด แต่ก็ไม่เลอะเทอะจนให้เสียอรรถรสในการเสพ\n\nระบบวางแผน\nแม้เรียบง่าย แต่ถือว่าสนุกในระดับหนึ่งเลย ตัวเกมไม่มีเลเลวลแต่จะใช้เงินเพิ่มจำนวนทหาร(Hp) และมีการใส่เครื่องประดับ/ไอเทมเพื่ออัพเกรดเล็กน้อย ระบบการสู้เป็นเทิร์นเบสวัดกันที่ความเร็ว มีการใชสกิลที่กำหนดการใช้ตามเม็ดพลังคอมโบที่สะสมจากการโจมตีหรือรับการโจมตี แต่ละตัวละครมียููนิททหารแตกต่างกันไปตามลักษณะของตัวละครของเช่นฮิมิโกะให้กองทัพมิโกะ หรืออาเจ๊โนบุนากะเป็นทหารพลปืน\n\nส่วนการวางแผนในเวิร์ลแมพนั้น ช่วงแรกๆ จะเป็นเส้นตรงจ๋าเลยนิดหน่อย แต่พอเล่นไปถึงช่วงที่เรายึดZipang ได้และเป็นพัมธมิตรกับบริทาเนียแล้ว เราจะสามารถเลือกยึดเมืองอื่นๆ ในเส้นทางได้จ้า\n\nตัวละคร\nแน่นอนว่าแนวฮาเร็มจ๋าแบบนี้ มีพระเอกเพียงคนเดียวที่เป็นผู้ชายในเรื่องและไม่มีเสียงพากย์ยกเว้นเสียง ฮื่อ!! ฮ่าห์!! ในฉากการต่อสู้(น่าสงสารชะมัด) แต่สาวๆ ในเกมมีคิดว่าน่าจะมีมากกว่า 40-50 คนกลับมีเสียงพากย์ทุกตัว และอ้างอิงจากตัวละครสำคัญในประวัติศาสตร์หรือนิยายในตำนาน เช่นฮิมิโกะ ,โอดะ โนบุนากะ , คิงส์อาเธอร์ ,เหล่าอัศวินโต๊ะกลมพวกแลนสลอค กาเวน ,พระถังซัมจั๋งและพรรคพวก และอีกมากมายที่ขณะนี้(13/11/2560)เรายังเล่นไม่ถึง แน่นอนอย่างที่บอก ทุกคนยืมมาแค่ชื่อ ทุกคนเปนผู้หญิงหมดเลย \n\nสาสๆ ทั้งหมดเราสามารถจีบเพื่อเพิ่มหัวใจ(ค่าความเชื่อมั่น)ให้จนเต็มได้ตามมาตรฐานของเกมจีบสาว\n\nสรุป\nหากใครต้องารเกมวิชชวลโนเวลดีๆและชอบแนววางแผนยึดเมืองด้วย หรือใครอยากรู้ว่า ผู้รับใช้แห่งสวรรค์อย่างพระเอกจะพาองค์หญิงแห่งYamataiไปครองโลกได้อย่างไร ระหว่างเส้นทางจะต้องพบพานอะไรบ้าง สาวๆ ที่เราได้พบเจอจะป่วนหรือสร้างความประทับใจได้ขนาดไหนและอุปสรรคที่ขวางทางอยู่จะต้องฝาฟันกันเพียงใด แนะนำให้กดเลยจ้า", "timestamp_created": 1510509483, "timestamp_updated": 1510509483, "voted_up": true, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.629630", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36470917": {"recommendationid": "36470917", "author": {"steamid": "76561198044653401", "num_games_owned": 100, "num_reviews": 24, "playtime_forever": 19, "playtime_last_two_weeks": 0, "last_played": 1510495728}, "language": "russian", "review": "Я, честно, не знаю зачем я это купил. Но выглядит крайне прикольно.\n\nПравда же заключается в том, что в этой игре вся суть в диалогах и, чувствую, что часа через 3-4 мне станет лень вчитываться в буржуйский тест и придется ждать несколько лет русификатора.", "timestamp_created": 1510496218, "timestamp_updated": 1510496218, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.466042", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36469155": {"recommendationid": "36469155", "author": {"steamid": "76561198033668061", "num_games_owned": 817, "num_reviews": 25, "playtime_forever": 2583, "playtime_last_two_weeks": 1, "last_played": 1516017162}, "language": "english", "review": "A visual novel with gameplay (turn based RPG)\nThe depiction of world leader/historical person is interesting\nHuge amount of characters\nArt by Oyari Ashito, a doujin artist. I appreciate artists that not only draw on papers but also make games (or being the art contributor).", "timestamp_created": 1510491508, "timestamp_updated": 1511546553, "voted_up": true, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.571282", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36465850": {"recommendationid": "36465850", "author": {"steamid": "76561198090080091", "num_games_owned": 149, "num_reviews": 5, "playtime_forever": 1396, "playtime_last_two_weeks": 377, "last_played": 1516118979}, "language": "thai", "review": "[h1]((ได้เวลาครองโลก~~))[/h1]\n[b](เรื่องราว)[/b]\nเราจะได้รับบทเป็น......ชายหนุ่มผู้ที่ชื่นชอบโลกประวัติศาสตร์(อาจเป็นไปได้80% เท่าที่จำได้)\nแล้วก็จำไม่ได้ว่ามาอยู่โลกแห่งสงครามได้ไงพร้อมทั้งยังถูกเรียกนามเขาว่า \"คนรับใช้แห่งสวรรค์\" (แปลมาได้นะ)\nและนั้นก็คือจุดเริ่มต้นของ ฮาแร็ม!?~~ #หรอฟระ\n\nง่ายๆเกมนี้ เป็นเกมแนว [b]กลยุทธ์[/b] ที่มี...อ่า..ความเป็นโมเอะมัวะ #ฮ่า~\nชื่อบางประเทศจะเป็นชื่อโบราณอย่าง Zipang(ญี่ปุน) และ Britannia(อังกฤษ?)\nตัวละครถือว่าเยอะไม่นับNPC แต่ละตัวพากย์ได้เข้ากับตัวละครมาก\n\n:ปล: ที่ออกมาเขียนบทวิจารณ์เพราะปีก่อน ยอมรับว่าโหลดมาเล่น (แล้วก็เล่นไม่จบ กำ)\nสายอนิเมะไม่ผิดหวังแน่นอน~~", "timestamp_created": 1510481967, "timestamp_updated": 1510482044, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36456017": {"recommendationid": "36456017", "author": {"steamid": "76561198001633993", "num_games_owned": 75, "num_reviews": 6, "playtime_forever": 73, "playtime_last_two_weeks": 0, "last_played": 1510899507}, "language": "english", "review": "Cute desgin, 30+ hrs of gameplay. Worth every penny. \nBeginning is a little slow though so keep with it and it will reward you!", "timestamp_created": 1510443356, "timestamp_updated": 1510443356, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.561724", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36451405": {"recommendationid": "36451405", "author": {"steamid": "76561197993576796", "num_games_owned": 101, "num_reviews": 4, "playtime_forever": 1732, "playtime_last_two_weeks": 0, "last_played": 1512912216}, "language": "english", "review": "Upd: R18 patch is available from Jast USA site for $6.\n\nGood strategy and VN. Based on very popular eroge but this is all-ages version with patch not yet available. Character art by Oyari Ashito.", "timestamp_created": 1510428071, "timestamp_updated": 1510679518, "voted_up": true, "votes_up": 46, "votes_funny": 3, "weighted_vote_score": "0.744001", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36450895": {"recommendationid": "36450895", "author": {"steamid": "76561198129443096", "num_games_owned": 126, "num_reviews": 5, "playtime_forever": 28433, "playtime_last_two_weeks": 0, "last_played": 1512159657}, "language": "english", "review": "My historical characters can't be this cute.\nHaving played this game a while back, I really enjoyed it. Take history, make it inaccurate and turn important historical characters into cute anime girls. That's Eiyu*Senki. [spoiler]Eiyu*Senki Gold port when.[/spoiler]", "timestamp_created": 1510426728, "timestamp_updated": 1510426728, "voted_up": true, "votes_up": 25, "votes_funny": 6, "weighted_vote_score": "0.593667", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36450301": {"recommendationid": "36450301", "author": {"steamid": "76561197964988859", "num_games_owned": 314, "num_reviews": 4, "playtime_forever": 5462, "playtime_last_two_weeks": 0, "last_played": 1511595246}, "language": "english", "review": "dear jast:\n\nplease work on securing and releasing eiyuu senki gold\n\nsincerely,\n\neveryone", "timestamp_created": 1510424992, "timestamp_updated": 1510424992, "voted_up": true, "votes_up": 218, "votes_funny": 15, "weighted_vote_score": "0.858896", "comment_count": "15", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36449684": {"recommendationid": "36449684", "author": {"steamid": "76561198092355979", "num_games_owned": 61, "num_reviews": 8, "playtime_forever": 456, "playtime_last_two_weeks": 30, "last_played": 1515857066}, "language": "thai", "review": "ถึงชั่วโมงเกมนี้ในสตีมผมจะน้อย แต่แบบโหลดเถื่อนนี่เกินร้อยชั่วโมงอ่ะบอกเลย\nได้เวลาชดใช้ซะที 555555 จริงๆอยากจ่ายให้Tencoตรงๆนะ แต่ไม่มีปัญญา\nเป็นเกมจัดทีมตีแบบสลับเทินร์ เก็บตัวละคร+สกิลใหม่มาเรื่อยๆ แต่ละตัวสกิลกับสายจะไม่เหมือนกัน\n\nข้อดี\n+ตัวละครเยอะมาก 30-40up สามารถจัดทีมแบบที่ชอบได้เป็นร้อยๆแบบ ลองเซิจในyoutubeได้\n+เกมเข้าใจง่าย เล่นง่าย แปปๆก็จะเจอสายที่ชอบ\n+เซฟได้ตลอดเวลา เว้นแต่เจอด่านพิเศษ แปลว่าจะลองจัดสายใหม่ไปตีตอนไหนก้อได้\n+CGเด็ดมาก อาจารAshito Ōyariวาดเลยนะเฟ้ย แต่ไม่รู้สตีมเอาออกมั้ย >>>> เท่าที่ลองดูเอาออกบางอัน ที่ไม่เรทมากก็ยังอยู่อ่ะนะ\nข้อเสีย\n-เกมมีสตอรี่เดียว อาจเปลี่ยนได้เล็กน้อยคือลำดับ แต่มีรูทเดียว\n-ต้องใช้เวลาเล่นพอสมควร ถ้าเล่นไม่รีบฟาร์มเรื่อยๆจะง่ายหน่อย แต่ถ้าเล่นสปีดตอนเจอบอสกับด่านพิเศษจะร้องเลย\n\nความเห็นส่วนตัว : เป็นเกมที่ต้องซื้อจริงๆ เล่นมาจนพรุนแล้ว ได้เวลาชดใช้ซะที  เกมนี้ให้12/10เลยครับ\nปล.เอาภาค2มาลงด้วยดิ มันมีตีแล้วเสื้อขาด ถถถถถ\n\n-------อัพเดทเพิ่มเติ่ม--------\nเกมนี้จริงๆควรกดย้อนดูCGที่ผ่านมาแล้วได้ แต่ของเจ้านี้ดันไม่มี ต่อให้ลงแพต18+แล้วก้อตาม (กำลังด่ากันอยู่ในบอร์ดเลย)คาดว่าคงจะมีอัพเดทแก้\nแพต18+ หาได้ที่เว็บjastusaราคา200", "timestamp_created": 1510423209, "timestamp_updated": 1511414970, "voted_up": true, "votes_up": 15, "votes_funny": 1, "weighted_vote_score": "0.702393", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36448135": {"recommendationid": "36448135", "author": {"steamid": "76561198267414994", "num_games_owned": 30, "num_reviews": 5, "playtime_forever": 1072, "playtime_last_two_weeks": 1, "last_played": 1515678664}, "language": "japanese", "review": "クエストを消化するとストーリーが\n進行する戦略ゲームです。\n\n多少、攻める順番やユニットの相性を\n考える必要があるかも知れませんが\n全体としての難易度は\nそれほど高くない印象です。\n\nこのようなゲームを求めていた\n私は大変満足しています。", "timestamp_created": 1510419212, "timestamp_updated": 1510419212, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.571595", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36443220": {"recommendationid": "36443220", "author": {"steamid": "76561198048367629", "num_games_owned": 921, "num_reviews": 7, "playtime_forever": 344, "playtime_last_two_weeks": 0, "last_played": 1511017407}, "language": "english", "review": "11/10 For Knights of the Round Table.", "timestamp_created": 1510406966, "timestamp_updated": 1510406966, "voted_up": true, "votes_up": 14, "votes_funny": 3, "weighted_vote_score": "0.372947", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36441999": {"recommendationid": "36441999", "author": {"steamid": "76561198030395374", "num_games_owned": 148, "num_reviews": 3, "playtime_forever": 407, "playtime_last_two_weeks": 0, "last_played": 1510505202}, "language": "english", "review": "I give the story an \"ok\" mark.\n\nAll of the girls are cute and lovable. (Seimei is love, Seimei is life)\n\nI hope that R18 patch will come out soon because I need too savor all those sweet moment", "timestamp_created": 1510403788, "timestamp_updated": 1510403788, "voted_up": true, "votes_up": 29, "votes_funny": 8, "weighted_vote_score": "0.516150", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36436494": {"recommendationid": "36436494", "author": {"steamid": "76561198157960595", "num_games_owned": 102, "num_reviews": 5, "playtime_forever": 3448, "playtime_last_two_weeks": 0, "last_played": 1511085561}, "language": "thai", "review": "THE BEST WAIFU STRATEGY EVER. - 11/10", "timestamp_created": 1510385810, "timestamp_updated": 1510385810, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.472800", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36433379": {"recommendationid": "36433379", "author": {"steamid": "76561198096540172", "num_games_owned": 256, "num_reviews": 26, "playtime_forever": 8, "playtime_last_two_weeks": 0, "last_played": 1510372896}, "language": "schinese", "review": "补票用     英雄＊戦姫系列的第一作（虽然一共只有2作）     研究角色排兵布阵比R18部分有趣系列\n  [spoiler] steam的是和谐版 得自己动手找R18补丁 [/spoiler] \n个人感觉剧情方面（角色支线之类的）不如第二作，组合套路方面也没第二作那么多，但并不影响游戏可玩性高：当作纯正的策略游戏（装备 技能组合 阵型组合 兵种克制之类的元素）来玩的话十分优秀；当作GAL玩的话则剧情稍显单薄平庸\n\n游戏性       9/10\n主线剧情    8/10  [spoiler] 王道式的征服世界 最后击杀大BOSS [/spoiler]\n支线剧情    6/10 （每个角色有小支线加任务好感度 [spoiler] 可以触发R18剧情 [/spoiler] ）\n音乐           8/10   配乐好听 [spoiler] 怎么好听（说不清） [/spoiler]\n\n\n\n[spoiler] 库克酱太棒了 我老婆 （¯﹃¯） [/spoiler]\n[spoiler] 可惜不能上 续作也只能看百合( ´_ゝ｀)  [/spoiler]", "timestamp_created": 1510372183, "timestamp_updated": 1510456610, "voted_up": true, "votes_up": 12, "votes_funny": 4, "weighted_vote_score": "0.551911", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39523425": {"recommendationid": "39523425", "author": {"steamid": "76561198045265180", "num_games_owned": 1022, "num_reviews": 16, "playtime_forever": 2120, "playtime_last_two_weeks": 330, "last_played": 1516574330}, "language": "spanish", "review": "7/10\n\nLuego de más de 50 horas de juego (muchas de ellas modo desconectado) y habiendo terminado el juego, les comento los siguientes aspectos (empezamos por lo malo).\n\nNegativo:\n- Tienes que leerte el manual para entender algunas mecanicas de juego, que no se explican dentro de este.\n- La historia es la estandar para este estilo de juegos (tipo Koihime Musou), tiene algunos momentos interesantes en medio y al final de juego.\n- El desarrollo de personajes es asimetrico, se centra bastante en Himiko, Arthur y los personajes iniciales. Luego con la lista considerable que se va formando se siente como si algunos solo se incluyeron para rellenar espacio (sobre todo bien avanzado el juego).\n- El sistema de items (power up) se siente incomodo e insuficiente.\n- No se que tanta rejugabilidad tiene una vez terminado.\n\nPositivo:\n- Los personajes que si estan trabajados estan bastante bien.\n- Las diferentes clases de heroes dan diversidad.\n- Algunas subtramas graciosas.\n- La jugabilidad es simple salvo para algunas peleas que debes formular una estrategia.\n- Duración prolongada de la historia principal.\n- Las voces estan excelentes y la banda sonora acorde a lo que sucede.\n- Plot twist interesantes (sobre todo en el último tercio del juego).\n\nNeutro:\n- El H-patch no aporta nada al juego y de hecho se siente raro el contraste con las escenas de sexo (más encima solo la mitad de los personajes tiene).\n\nEn fin, es un juego de nicho para los que nos gustan las novelas graficas con elementros de estrategias básicos. Si jugaste Koihime Musou, este es similar, más historia pero sin las partes hentai.", "timestamp_created": 1516576993, "timestamp_updated": 1516577157, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 89, "total_negative": 4, "total_reviews": 93}}
