{"reviews": {"39340105": {"recommendationid": "39340105", "author": {"steamid": "76561198283246020", "num_games_owned": 27, "num_reviews": 9, "playtime_forever": 544, "playtime_last_two_weeks": 24, "last_played": 1515942617}, "language": "japanese", "review": "遺跡を巡りアイテムを集めつつ黒幕を倒す２Ｄアクションゲーム。\nイメージ的には面クリア式（かつ強化アイテム保持）のメトロイドと言ったところだろうか。\n\n「遺跡を巡り」とは言ったものの、遺跡の種類は実にさまざま。\n全体的にはエキゾチックな雰囲気で統一されつつも遺跡一辺倒にならないよう飽きさせないステージ構成になっている。\nアクション性も良好で、最初はどこぞの配管工くらいの動きしかできないが最終的にはアクションゲームで良く見かける挙動が大抵できるようになる。\n\n難易度については普通～やや易しめ、と言ったところか。\n即死罠も多く、敵の攻撃も痛いには痛いがチェックポイントが多い点とその場復活アイテム（ストック不可だが補充可）が序盤で手に入る点からやり直し自体は簡単で、多少の無茶もできる。\n\n日本語あり、ゲーム性良し、グラフィック良しと全体的に完成度の高いゲームなのでこの手のゲームがツボな人や遺跡を巡るハンターになりたい、と言う人には是非お勧めしたい。", "timestamp_created": 1515941121, "timestamp_updated": 1515941121, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39116094": {"recommendationid": "39116094", "author": {"steamid": "76561198107745287", "num_games_owned": 113, "num_reviews": 26, "playtime_forever": 683, "playtime_last_two_weeks": 0, "last_played": 1515256286}, "language": "brazilian", "review": "Surpreendentemente bom, e este Krobon, fez praticamente tudo sozinho, o que é mais surpreendente ainda. O jogo é bem fluído e razoávelmente difícil se você ficar economizando os itens. \n\nOs Gráficos são razoavelmente bonitos, mas a resolução de 640/480 realmente deixa a desejar, mas não torna o jogo feio. A jogabilidade é fluída, mas o dash feito com o apertar de dois botões foi um erro, já que se não for feito do jeito certo, você só pula e ataca, ele poderia ter usado um outro botão para isso. A história é interessante, não ao ponto de te prender jogando, mas interessante ainda assim. A jogada com a fase de Andre explicando melhor coisas que aconteceram na fase anterior também foi muito legal. O ponto negativo, é que ela é bem viajada, os cálices estarem em locais conhecidos e possivelmente já explorados pelo homem, torna a jornada inteira fora do plausível, então você tem que ignorar essa parte para poder curtir o jogo. Se tivessem usado apenas locais novos de Amshere, teriam evitado tudo isso.\n\nEnfim, o jogo é bom e eu recomendo. Mas não como um Metroidvania, Ele lembra muita mais um Megaman, com várias fases e segredos escondidos nelas do que o clássico mapa único típico de Metroidvanias.", "timestamp_created": 1515241178, "timestamp_updated": 1515241323, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39069534": {"recommendationid": "39069534", "author": {"steamid": "76561197969246695", "num_games_owned": 335, "num_reviews": 10, "playtime_forever": 347, "playtime_last_two_weeks": 0, "last_played": 1515035546}, "language": "english", "review": "This is certainly a fun game, if you are looking for a game in the metroidvania style you should enjoy this one.  \n\nWhile I enjoyed the game it has it's share of problems.First there are frequent slowdowns, which shouldn't happen with a 2d game running on a modern computer. Second the difficulty curve could use some tuning, it goes from fairly easy to much harder by the last level, it's a rather abrupt change. \n\nAnother minor issue that I remedied rather quickly is that by default the analog stick on my xbox 360 controller would 'freeplay' and trigger movement, I could have adjusted the dead zone but I simply switched to the d-pad in the options", "timestamp_created": 1515117146, "timestamp_updated": 1515117146, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.539642", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39004789": {"recommendationid": "39004789", "author": {"steamid": "76561198027897056", "num_games_owned": 358, "num_reviews": 15, "playtime_forever": 999, "playtime_last_two_weeks": 0, "last_played": 1514970514}, "language": "english", "review": "I'm surprised I hadn't heard of this game until seeing it in a discovery queue full of obscure stuff. This was a real gem. Bought it on sale because it looked nice, but some negative reviews almost kept me away. Really glad I decided to check it out. It's a solid platformer with very few things you could really call flaws. It's not ridiculously difficult, but there are a lot of challenging moments and added challenges from achievements. The controls felt a bit stiff at first, but they're fairly standard for this sort of game, and I got used to them easily enough. Graphics, music, writing, all great. Animations in particular were fantastic.\n\nThere are only two things that bothered me. One being that for all the buttons I had on my controller, I only used like... four? You end up with a lot of things you can do, but not a lot of buttons for inputs. In particular, I found dashing to be a problem sometimes, because you have to push attack and jump at the same time, and sometimes you'll just end up attacking or jumping, or when you try to jump and attack quickly, sometimes you'll dash. The second thing is that the boss rush has some very weird bugs going on. It seems like your first attempt at it works fine, but if you try again without completely closing out the game and opening it again, you'll die after getting your final time, and it won't save it. What's even weirder is that one time I was somehow sent to the Japanese version of the game, but it only showed one of the frames from the level select pictures. I eventually figured out that pushing right enough times would bring me back to the English version, but for a second I thought my save was broken, because even restarting didn't fix it. These were the only bugs I encountered though, and I figured them out, so they didn't hurt my experience much, but a fix to that would be nice.\n\nAnyway, I highly recommend this game. Especially right now on sale. If it looks at all appealing to you from the videos, you'll probably love it. It was exactly what I was hoping for.", "timestamp_created": 1514971955, "timestamp_updated": 1514971955, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.520548", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38706395": {"recommendationid": "38706395", "author": {"steamid": "76561197998598944", "num_games_owned": 1123, "num_reviews": 143, "playtime_forever": 5, "playtime_last_two_weeks": 0, "last_played": 1514312307}, "language": "english", "review": "Doesn't recognize my controller.", "timestamp_created": 1514312332, "timestamp_updated": 1514312332, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.330914", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38694690": {"recommendationid": "38694690", "author": {"steamid": "76561198072182182", "num_games_owned": 1686, "num_reviews": 182, "playtime_forever": 490, "playtime_last_two_weeks": 0, "last_played": 1512842670}, "language": "english", "review": "Jonathan, archaeologist, and his frenemy, Andre, already ran into one curse pre-game; it turned Jonathan into an anthropoid rabbit with morphing ears and the other guy into an anthropoid snapping turtle wearing an enchanted shell (it's a sniper boomerang thing).  The curse is incurable, so they've learned to take the good with the bad.  Now they've stumbled into [i]another[/i] curse, and it's not so easy to live with: an immortal pharaoh will kill them at the end of seven days if they don't find a series of magic grails.    \n\nThe gameplay takes a little while to get down, since the physics are on the flloaty side.  I can see this being a big sticking point for some.  You should have a handle on it after the first level, though, so give it a chance; the game is so fun, so weird, and has so many wonderful set pieces that it would be a shame to miss out for such a small thing.  Floaty does not equal [i]bad[/i], as you'll find when you've got that hard boss figured out at last, and you're dash-dodging and ear-flogging the heck out of him with gleeful abandon.     \n\nThis game, apparently, was originally released episodically with a Japanese game magazine.  How cool is that?  [i]Pharaoh Rebirth+[/i] feels entirely too robust for that.  Maybe it was a bi-annual?", "timestamp_created": 1514291004, "timestamp_updated": 1514428170, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.528509", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38589087": {"recommendationid": "38589087", "author": {"steamid": "76561198060271751", "num_games_owned": 40, "num_reviews": 12, "playtime_forever": 916, "playtime_last_two_weeks": 0, "last_played": 1514046289}, "language": "japanese", "review": "シナリオやスプライト、背景にとても力が入れられた良作。\nただし難易度に関してはライト層とヘビー層に配慮した結果か聊か中途半端。\nしかしヌルいかと思えば唐突に即死要素を盛り込んでくるなどレベルデザインがあやふやな印象を受ける。\n幸いチェックポイントは多く設置されているのでそういった問題は無視できる。\nただし直ちにリトライする機能が無く、リトライするにはどうにかしてHPを０にしないといけない。\nこの仕様のせいでノーダメージ関連の実績の難易度がやたらと高い。\n\nでは実績を狙わず心穏やかにプレイしようと思った諸君。\nなんと公式サイトにて無料版がダウンロードできます。\nやろう。", "timestamp_created": 1514052463, "timestamp_updated": 1514052463, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38517686": {"recommendationid": "38517686", "author": {"steamid": "76561197976760251", "num_games_owned": 297, "num_reviews": 4, "playtime_forever": 210, "playtime_last_two_weeks": 2, "last_played": 1516392762}, "language": "english", "review": "If you like Cave Story and Shantae and La Mulana, you will like this.", "timestamp_created": 1513920500, "timestamp_updated": 1513920643, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.519231", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38145511": {"recommendationid": "38145511", "author": {"steamid": "76561198004565666", "num_games_owned": 203, "num_reviews": 102, "playtime_forever": 345, "playtime_last_two_weeks": 0, "last_played": 1512709358}, "language": "english", "review": "Surprisingly solid metroidvania, of the \"mostly linear but you can go back for more items\" type. Controls are good, levels are well designed with varied challenges, art and music are good. It's not the longest but it's not short enough you'll feel cheated. Story is campy genre cliches, but the fun kind of campy genre cliches.\n\nOverall would recommend to platformer/metroidvania fans. It's not the best I've played, but it is very good.", "timestamp_created": 1512710660, "timestamp_updated": 1512710660, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525862", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38046493": {"recommendationid": "38046493", "author": {"steamid": "76561198160868511", "num_games_owned": 573, "num_reviews": 357, "playtime_forever": 701, "playtime_last_two_weeks": 0, "last_played": 1511466839}, "language": "english", "review": "A top notch metroidvania,deespite lacking in fame this game's pixel art graphics are top notch and it's easy to see that a great deal of care has gone in it's developement.\nPharaoh Rebirth+ is a great experience for fans metroidvanias and side scroller type games.", "timestamp_created": 1512346854, "timestamp_updated": 1512346854, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.591735", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38027944": {"recommendationid": "38027944", "author": {"steamid": "76561198032059737", "num_games_owned": 3332, "num_reviews": 27, "playtime_forever": 505, "playtime_last_two_weeks": 0, "last_played": 1512293408}, "language": "japanese", "review": "かわいいドット絵がよく動く２Dアクション。\nステージ制だけど、クリア済みステージのやり直しができる。\n初回は行けなかったところにも、パワーアップすると行けるようになる。\n探索するほど攻撃力や防御力にボーナスの付くアイテムがあるので、\nアクション苦手な人でもクリアはできると思う。\n\nシナリオも良い感じで、後半の展開は個人的に好きなパターンだった。", "timestamp_created": 1512294036, "timestamp_updated": 1512294090, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37911651": {"recommendationid": "37911651", "author": {"steamid": "76561198127006602", "num_games_owned": 2236, "num_reviews": 27, "playtime_forever": 1259, "playtime_last_two_weeks": 0, "last_played": 1513021224}, "language": "spanish", "review": "Un Metroidvania muy recomendable. Lo unico malo que tiene es la parte en la que hay que manejar un coche.", "timestamp_created": 1511902240, "timestamp_updated": 1511902240, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.535452", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37783356": {"recommendationid": "37783356", "author": {"steamid": "76561198350595169", "num_games_owned": 84, "num_reviews": 27, "playtime_forever": 32, "playtime_last_two_weeks": 0, "last_played": 1511790166}, "language": "schinese", "review": "虎父当真无犬子吗？抱歉，这款游戏告诉你：虎父真的有犬子。\n\n    当初冲着它是另一款游戏《老人恶魔城》的制作组做的就入手了，放在库里今天才拿出来一试。想当年老人城真是被震惊了，没有华丽的人设，没有漂亮的画面，但是出众灵活的手感（甚至超过了恶魔城这个本尊），足以让玩家在这个埃及的魔幻迷宫中流连忘返。而那飘逸的“空斗舞”的手感更是让人前期都不想放其他招数了。\n    如今，这款号称是老人城精神续作的游戏有继承到这个最大的亮点了吗？抱歉，丝毫未有。取而代之的是僵硬的操作感，仿佛没有做debug就拿出来卖一样。例如空斗舞会随机性地将跳跃向前的惯性强制取消（不是游戏机制，试了很多次确实是随机出现的bug）。还有，空斗舞中按方向键前会莫名其妙地在收招时多一个基本无用的小判定抽打。然而，最奇葩的还不是这些，是这游戏在按键并不多的情况下，采用了冲刺=跳+打这种原始的组合键方案，然后又不经充分测试就丢出来卖，造成低空跳打（快速地先按跳后按打）会随机被游戏误认为你要按冲刺......当一个动作游戏连正确反馈操作者的意图这么灵魂的东西都做得一塌糊涂的时候，你还怎么会有心情去体验它的其他部分呢？\n\n    于是，送上差评，劝所有冲着前作老人城来的玩家死了心。", "timestamp_created": 1511791186, "timestamp_updated": 1511791406, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.539623", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37461909": {"recommendationid": "37461909", "author": {"steamid": "76561197980364462", "num_games_owned": 2282, "num_reviews": 71, "playtime_forever": 716, "playtime_last_two_weeks": 0, "last_played": 1511584920}, "language": "english", "review": "Nice metroidvania type game.", "timestamp_created": 1511584957, "timestamp_updated": 1511584957, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.530705", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37103489": {"recommendationid": "37103489", "author": {"steamid": "76561198040246919", "num_games_owned": 157, "num_reviews": 9, "playtime_forever": 949, "playtime_last_two_weeks": 0, "last_played": 1511412987}, "language": "schinese", "review": "土龙引擎制作的游戏\n优点\n+画面\n+手感\n+音乐\n+难度 (中等, BOSS战要无伤都很容易)\n+剧情 (强烈建议懂日文的玩家选择日文来进行游戏)\n+丰富的副武器系统\n\n缺点\n-有些地方对话设置过多, 影响流畅度\n-银河城设定意义不是很大, 单个地图太小 (类似刻印那种一个区域一个小地图=)", "timestamp_created": 1511450775, "timestamp_updated": 1511450775, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37081879": {"recommendationid": "37081879", "author": {"steamid": "76561198079028361", "num_games_owned": 564, "num_reviews": 47, "playtime_forever": 2413, "playtime_last_two_weeks": 478, "last_played": 1515582709}, "language": "koreana", "review": "지금 할인율 70퍼센트라 가격도 굉장히 저렴하고 가격에 비해서 뛰어난 볼륨과 재미를 자랑하는 잘 만들어진 인디게임입니다\n이름대로 파라오에 관련된 유적이 나오며 맵을 탐색해 나가는 형식입니다. 아이템도 굉장히 많아요.\n도전과제를 달성하고나서도 만족한 몇 안되는 게임으로 추천드립니다.", "timestamp_created": 1511447109, "timestamp_updated": 1511447109, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36772080": {"recommendationid": "36772080", "author": {"steamid": "76561197971355045", "num_games_owned": 709, "num_reviews": 30, "playtime_forever": 349, "playtime_last_two_weeks": 0, "last_played": 1511643588}, "language": "english", "review": "Certainly worth checking out if you're a fan of metroidvanias.\nIn terms of plot & presentation veers into silly territory, with cute sprite art that's smoothly animated, and plenty of sarcasm in the dialogue.\nIn terms of gameplay it controls well, there's small puzzles and twists to the usual mechanics along the way and while a bit on the easier side it still puts up a fair challenge. (Meaning not paying attention will get you killed, but if you do keep your eyes open boss patterns etc. are easy enough to read.)", "timestamp_created": 1511380808, "timestamp_updated": 1511380808, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36691534": {"recommendationid": "36691534", "author": {"steamid": "76561198025348865", "num_games_owned": 586, "num_reviews": 19, "playtime_forever": 394, "playtime_last_two_weeks": 0, "last_played": 1511911654}, "language": "english", "review": "Makes me nostalgic for Snes-era platformers like Megaman X, Super Metroid, and Gunstar Heroes. In a good way,", "timestamp_created": 1511337761, "timestamp_updated": 1511337761, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.486686", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36687540": {"recommendationid": "36687540", "author": {"steamid": "76561198118860701", "num_games_owned": 46, "num_reviews": 6, "playtime_forever": 128, "playtime_last_two_weeks": 0, "last_played": 1506803057}, "language": "spanish", "review": "¿Un metroidvania que rinde tributo a Metal Gear Solid y a Indiana Jones?\nNo pensé que ello funcionaría, y eme aquí~\n\nPHARAO'S REBIRTH PLUS es una chulada de videojuego, al principio se abusa DEMASIADO de los diálogos, pero entonces te das cuenta de que eso es una parodia al CODEC de Metal Gear Solid, y te sientas a escuchar las conversaciones.\n\nQ U E\nH U M O R\nT A N \nB U E N O.\n\nHacía muchísimo que no me reía tantísimo con el guión de un videojuego y debo decir que las bromas que usan son frescas y poco predecibles rumbo a la mitad, pero eso no es lo único agradable.\n\nLos controles se sienten fáciles de dominar, pero jamás te permitirán sentirte cómodo, siempre estarán desafiandote, pues cada nivel exige que aprendas a moverte diferente (En algunos casos te pedirán brincar entre diferentes plataformas mientras te empuja el viento, o te verás obligado a pelear en el aire usando propulsores que están en el suelo, o columpiarte entre anillos a diferentes alturas para al mismo tiempo abrir puertas, todo con los mismos controles).\n\nAdemás, el juego cuenta con una variedad enorme de sub-armas que podrás utilizar para divertirte, entre ellas:\n* La guadaña de Anubis (Que sirve a modo de la cruz de Castlevania, pero ésta puede redirigirse con tu posición)\n* Arena sagrada (Un item que se arroja al viento afectando a todos los enemigos presentes y mostrando rutas ocultas).\n* TU PROPIO STAND DE JOJO (END OF ZA WARUDOOOO, SONOCHI NO CHI NO KIOKUUUUUU)\nY más.\n\nDebo añadir que, personalmente, quedé fascinado con la kinestética del personaje principal, los saltos y ataques jamás se habían sentido tan controlables en ningún otro juego de clase metroidvania, y es un gustazo que tu mono (O conejo en éste caso), obedezca tus ordenes al pie de la letra, en especial en Bossfights.\n\nLa música de PHARAOH'S REBIRTH PLUS es bellísima, y si el OST hubiera estado en venta seguro me lo compraba, pero como no es así, tuvequebajarmealgunascancionesamiceldesdeyoutube. ES QUE ESTÁN AHÍ, Y SON PERFECTAS, lástima que no se puedan comprar, recomiendo de manera personal, escuchen los temas del nivel del Nilo, y del hotel Cairo Stewart, así como el del templo de Luxor; \n\nSin más que añadir, le doy a Pharaoh's Rebirth un 9/10, pues su único y más grande fallo es ser demasiado corto. Me lo pasé en 6 horas con un 80% de coleccionables.", "timestamp_created": 1511319250, "timestamp_updated": 1511319250, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36669285": {"recommendationid": "36669285", "author": {"steamid": "76561198366326831", "num_games_owned": 80, "num_reviews": 25, "playtime_forever": 690, "playtime_last_two_weeks": 0, "last_played": 1511663835}, "language": "english", "review": "A fun game that is worthy of the title \"metroid-vania\"\n\nI absolutely LOVE this game! With the exception of leveling up via exp by killing enemies, everything else about this game follows in the traditions of action-rpgs. This game boasts a great score as well as great animations and fantastic backgrounds. The dialogue is well-written and brimming with personality that should leave you chuckling at the relationships shared between characters. Although there are no weapons or armor, you'll level up with the various items found along your journey. Speaking of which, there are a ton of subweapons, collectables, and other secrets waiting to be discovered after the right powerup is obtained. With an expected 5-8 hours of playtime combined with tight and responsive controls, you may find yourself pushing on in order to complete this game to 100%. \n\nThe only thing I have to complain about is the dialouge or more specifically when its displayed during your journey. There are certain instances where your game will be interrupted every 5-10 seconds in order to give you exposition or flavor text. Although you can skip the dialougue, it doesn't make it any less annoying. Even though I do feel that the script is worth reading, an option to turn off all dialogue after the game is beaten would help.\n\nFrom the moment I loaded the game I couldn't stop playing until it was completed. This particular title is definately worth your time, effort, and cash. You'll miss out on a great adventure if you pass this game up.", "timestamp_created": 1511238991, "timestamp_updated": 1511259882, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36668065": {"recommendationid": "36668065", "author": {"steamid": "76561198430185695", "num_games_owned": 41, "num_reviews": 9, "playtime_forever": 364, "playtime_last_two_weeks": 0, "last_played": 1510624439}, "language": "english", "review": "You don't see games like Pharaoh Rebirth+ every day. Made by (almost) only one guy but polished to an insane degree, with a gorgeous and professional presentation as well. It most closely resembles the \"metroidvanias\" of yore even though it feels much \"simpler\" than a Symphony of the Night or Metroid. Still, there are plenty of items to collect, lots of secrets to be found and a bunch of new moves to master. All this, plus the incredibly diverse stages make up for a short but very enjoying experience.\n\nFans of platformers in general and especially fans of \"metroidvania\" style games must not miss this game.", "timestamp_created": 1511232042, "timestamp_updated": 1511232042, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36623102": {"recommendationid": "36623102", "author": {"steamid": "76561198262513932", "num_games_owned": 81, "num_reviews": 6, "playtime_forever": 676, "playtime_last_two_weeks": 0, "last_played": 1511583581}, "language": "tchinese", "review": "Graphic is cute, movement is smooth, difficulty is not too hard, story and Egypt background is attractive", "timestamp_created": 1511098032, "timestamp_updated": 1511098032, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36603402": {"recommendationid": "36603402", "author": {"steamid": "76561197995361890", "num_games_owned": 417, "num_reviews": 41, "playtime_forever": 492, "playtime_last_two_weeks": 0, "last_played": 1510985257}, "language": "english", "review": "I suspect that the reason this game isn't talked about more is because just looking at screenshots it doesn't stick out as particularly special. But this game should be talked about more, because besides one really frustrating level, this game is near perfect in its execution of solid Metroidvania combat and exploration.\n\nThe Rabbit-Man Jonathon comes out of the box feeling powerful, with an array of long-range attacks that nullify projectiles and combo into aerials for which you are rewarded with health and mana. While the basic enemies tend to just be obstacles as you plow through the game's hallways, bosses have recognizable but tricky patterns to put your tools to use. As you get upgraded through the game's collectables, every sub-weapon adds welcome tools that cover the weaknesses the basic moveset has, and minor differences in scale - such as increases in attack damage - can be obtained from your treasure hunting. Eventually as you explore previously completed levels, your new movement abilities and gear make you feel godlike. It's a fantastic power fantasy tempered by progressively increasing challenge to keep you feeling accomplished.\n\nDriving this gameplay is a cute story following the archetypal treasure hunt, made more fun by lovable characters and a tongue-in-cheek sense of humor. The banter between Jonathan and his support character Jack and his rival Andre was highly entertaining for me. With that said, the radio conversations constantly pop up within the gameplay, so if the writing fails to appeal to you I could see this as being a detractor. The dialog is skippable through a fast-forward style button press, though there will still be a pause while it's being skipped. To me though, the character interactions are one of the highlights of the game. It contextualizes the gameplay and makes the good moments great.\n\nThe level structure is mission-based, so it's closer to something like Mega Man Zero or Castlevania: Order of Ecclesia rather than Symphony of the Night. While a lot of the game's unlockables require you to return to levels already completed, it captures the spirit of exploration rather than strictly being a matter of backtracking. This is helped by nothing obtained by revisits being completely required for the game's completion (though, especially on the game's hard mode it certainly helps to get them.) And, as I mentioned, I thought it was fun to revisit and tackle old challenges with the power obtained from later in the game.\n\nThe one major complaint I have about Pharaoh Rebirth is in regards to a specific mission that tries to change things up with an on-rails car section. It's bad, and it's required to progress. There isn't enough screen space to really telegraph when you need to jump, so the game uses a sound cue instead. However even knowing that a jump is coming, the timing of when to jump is something that I only mastered through strict trial and error. Since death throws you to continue screen and drops you back in the previous checkpoint this means a lot of replaying sections until either you figure out the rhythm of the sound cue or accomplish the task through rote memorization. In a short burst the vehicle section might not have been terrible, but culminating on its issues, it's long enough to be exhausting. I felt like the missions that followed were totally worth slogging through it, but a slog it was.\n\nBut in spite of that one blight, I think Pharaoh Rebirth + is otherwise an ideal accomplishment of its genre. It certainly deserves attention, and comes highly recommended from me.\n\n4 out of 5.", "timestamp_created": 1511028624, "timestamp_updated": 1511030074, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.535865", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36588512": {"recommendationid": "36588512", "author": {"steamid": "76561198116883121", "num_games_owned": 669, "num_reviews": 28, "playtime_forever": 225, "playtime_last_two_weeks": 0, "last_played": 1513035800}, "language": "english", "review": "[h1]This review is a Work in Progress, and will be subject to change as I play.[/h1]\n\nThis is perhaps one of the best Metroidvanias I have played so far, definately up there with Shadow Complex and SotN thus far. The sound design is absolutely excellent (can we please buy the OST?), and the character design is great as well [spoiler] I seriously wasn't expecting the first boss to be a high tech helicopter. [/spoiler]. \n\nThe game is not easy but not too hard, and thus strikes a perfect balance so far. This being a Metroidvania I am suspecting, and already have encountered a bit of backtracking, but it is to be expected with this genre. One thing that does bug me though, and this is a minor niggle is the loading time when you die, it is kind of long. \n\nThis game does not have an autosave feature, instead it relies on manual save points (remember those?), and this actually works well for the game as Autosaves can sometimes mess up a save file (glares at Fallout 3). If this holds throughout the game expect this review to remain positive, and have an A+ from me.\n\nThanks to Salmase for the tech support, I got the game working with my controller, I am now setting this review to friends only til I can finish this review.", "timestamp_created": 1510983869, "timestamp_updated": 1513031030, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.497900", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36569789": {"recommendationid": "36569789", "author": {"steamid": "76561198067279208", "num_games_owned": 91, "num_reviews": 5, "playtime_forever": 590, "playtime_last_two_weeks": 0, "last_played": 1510924469}, "language": "english", "review": "It is no Hollow Knight but it is a decent Metroidvania-light  game. \n-Could use more polishing in the Boss battles. \n- Instakills are probably a bad idea.\n- The Map could be more imfomative. \n- Simplistic battle\n\n+ Alot to explore \n+ Short and simple\n+ Low cost game.\n\n\n75/100", "timestamp_created": 1510920287, "timestamp_updated": 1510920287, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36465368": {"recommendationid": "36465368", "author": {"steamid": "76561198219380977", "num_games_owned": 27, "num_reviews": 2, "playtime_forever": 1346, "playtime_last_two_weeks": 0, "last_played": 1514032032}, "language": "english", "review": "game feels so good its way more fun that i thought it would be :D", "timestamp_created": 1510480546, "timestamp_updated": 1510480546, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36450817": {"recommendationid": "36450817", "author": {"steamid": "76561198145404358", "num_games_owned": 37, "num_reviews": 9, "playtime_forever": 1281, "playtime_last_two_weeks": 0, "last_played": 1511392444}, "language": "spanish", "review": "Un exlente juego, si eres amante de los juegos con exploración de nivel no puedes perderte este, tiene una buena banda sonora al estilo clásico son chip tunes que recordara a las consolas de antaño, muy buena animación y una dificultad acorde.", "timestamp_created": 1510426482, "timestamp_updated": 1510426482, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36434064": {"recommendationid": "36434064", "author": {"steamid": "76561198139811928", "num_games_owned": 197, "num_reviews": 3, "playtime_forever": 613, "playtime_last_two_weeks": 0, "last_played": 1510374175}, "language": "english", "review": "Loved the gameplay and secret hunting.  I wish there were more levels.  Great game! I hope you make more.", "timestamp_created": 1510374872, "timestamp_updated": 1510374872, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36380021": {"recommendationid": "36380021", "author": {"steamid": "76561198023117872", "num_games_owned": 296, "num_reviews": 27, "playtime_forever": 579, "playtime_last_two_weeks": 0, "last_played": 1510279482}, "language": "english", "review": "It's a shame that this game has been missed by everyone.  I have played most every metroidvania on Steam, and a lot of others, and this is among the best.  It may not have as much of the RPG elements that I enjoy from the Castlevanias, but the action and exploration are excellent.  Many metroidvanias suffer a little bit from pacing and low platforming action, which is where this game shines. The game focuses on learning boss patterns and capitalizing on their vulnerable moments and works as well as classics like Mega Man.\nSome have commented that this game is not a Metroidvania.  I would argue that it definitely is.  The format is similar to Castlevania: Order of Ecclesia or the paintings in Portrait of Ruin.   You choose maps or levels to enter, but they are large and follow the traditional metroidvania format.  You learn skills that give you access to more areas, and the game does a great job of providing incentive to return to past levels to encounter new challenges and find secrets.\nThe sub-weapons are the highlight of the game. There are many to be discovered and all of them are useful in particular situations.  I often found myself stopping as I started a boss fight or challenging room to re-evaluate my strategy with a new sub-weapon. \nI didn't have high expectations for the story in a game with a rabbit as the main character.  However, I was happily suprised that the story is actually better than about any metroidvania I've played.  The characters are likeable and funny, although it doesn't feel forced.\nLast of all, the music catchy and cool. i found myself humming the songs throughout the day after beating a dungeon.\nSupport an excellent indie game!  If you like action platformers or metroidvanias, you will not regret it.", "timestamp_created": 1510163167, "timestamp_updated": 1510163167, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36353891": {"recommendationid": "36353891", "author": {"steamid": "76561197983542567", "num_games_owned": 883, "num_reviews": 11, "playtime_forever": 860, "playtime_last_two_weeks": 0, "last_played": 1511454647}, "language": "russian", "review": "Отличный платформер с элементами метроидвании. Лично мне напомнил старенького Rick Dungerous, еще с сорокавосьмикилобайтного  \"Спектрума\". Есть в таких играх некое очарование. Геймплей поначалу кажется замедленным, н о в действительности это не так. Графика - хорошие пиксели, анимация персонажей плавная, так что тут все на уровне. Сюжет диковатый, но смешной. Ну и самого по себе юмора в игре хватает. Русификатора вроде бы нет, но даже я со своим слабеньким английским понял процентов девяносто. Но вот стоит ли игра своей полной цены...Не знаю. Я брал на распродаже. А полная у нее цена не так уж сильно отличается от цены CupHead, а там все-таки заведомо класс выше.", "timestamp_created": 1510095548, "timestamp_updated": 1510095548, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36336715": {"recommendationid": "36336715", "author": {"steamid": "76561198260132198", "num_games_owned": 43, "num_reviews": 3, "playtime_forever": 891, "playtime_last_two_weeks": 0, "last_played": 1506549502}, "language": "english", "review": "I find it appropriate that you play as an archaeologist since this game scratches that treasure-hunting itch just right. Krobon has this talent for genuinely interesting level design that makes you want to explore every nook and cranny in the hopes of finding secret rooms and ancient artifacts.\n\nI also think that the characters are adorable and the story pretty funny in a cutesy kind of way. Jonathan's move set makes sense to his character and every new ability you learn encourages you to revisit previous levels in the hopes of reaching that platform that was previously out of your grasp.\n\nThere's even a Jojo reference in it!\n\nI did have a few gripes, though:\n-There are a few items you can permanently miss due to not performing a certain action at a certain time, which could be a big pain if you're a completionist.\n-Level 5 is probably the worst level in the game as it's a driving section that requires precise jumping to get through alive. As a result, I probably spent a good two hours or so in this area alone, intentionally crashing my jeep so I could restart and collect that last golden piece I barely noticed as I sped towards a cliff at seventy mph. I admire the designer wanting to change the gameplay up a bit and, to be fair, Level 5 is not agonizing or impossible to complete. But compared to the rest of the game, I didn't find it nearly as fun to play, despite the really cool boss at the end.\n-I experienced some slowdown, though this might be a technical issue on my part and not the fault of the designer.\n\nI do love this game overall, though, and plan on replaying it for a 100% run. If you like exploration-based platformers with good music and quirky characters, give this a whirl.", "timestamp_created": 1510034307, "timestamp_updated": 1510034307, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.525547", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36081505": {"recommendationid": "36081505", "author": {"steamid": "76561198020432468", "num_games_owned": 675, "num_reviews": 72, "playtime_forever": 381, "playtime_last_two_weeks": 0, "last_played": 1500557704}, "language": "english", "review": "Do you think annoying anime characters interrupting simplistic metroidvania-lite gameplay with inane banter every 10 steps  (and I mean 10 steps pretty literally) sounds like fun? If so you may like Pharaoh Rebirth+.", "timestamp_created": 1509205298, "timestamp_updated": 1509205328, "voted_up": false, "votes_up": 7, "votes_funny": 3, "weighted_vote_score": "0.290766", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35746602": {"recommendationid": "35746602", "author": {"steamid": "76561197994904389", "num_games_owned": 313, "num_reviews": 74, "playtime_forever": 408, "playtime_last_two_weeks": 0, "last_played": 1508002817}, "language": "english", "review": "Game in the akward position of being good enough to deserve some recognition, but not amazing enough to actually get it. Kinda sad, if you think about it.\n\nPharaoh Rebirth is something I would call a quasi-metroidvania style game. It's design and gameplay loop is very much similar to the Shantae and the Pirate's Curse. Yes, it is a platformer with unlockable items that let you get into new places and you are allowed to do some backtracking, but game's world isn't seamless and it is divided into separate levels. It's scope is slightly smaller than those of Shantae's but the core game structure is safe, sound and works reasonably well.\n\nThere is a lot of things to like in the game, even if those aren't always on the highest level of the genre. Combat is very satisfying, with good selection of moves and subweapons at the disposal of sympathetic, bunny-like protagonist. Enemies, bosses and level design also present a great deal of care and they are generally aspects that don't make me point out any immediate nitpicks.\n\nArtstyle is also a strong point of the title, with details and colors reminding me a lot of Cave Story. I would bet that for the Japanesee dev of Pharaoh, that well known, respected title was a source of inspiration. While sprites are amazing, I was a little disappointed by the level tiles and decorations that can get repetive and bland, making some levels boring to lot at. Similarly, music not always sold me on the game, but few tunes are really good and leave a good impression overall.\n\nAs for the major complains I have with the game, I would point out some problems with controls and the story. While combat is satisfying, I believe that jumps and movement of the main character could use some tuning up. Leaps are floaty and not very responsive, which is extremely jarring if you recently came back from 2D platformers with super-snappy controls like Sonic or Freedom Planet. As for the plot: it's not bad in reality, but sometimes there is a Megaman X5 syndrome creeping in, with constant dialog boxes that can hurt the flow of the levels.\n\nGame is short, but I believe it deserves a little bit more love, even if it isn't in the same league as some other indie blockbusters. I really can appreciate a honest effort put here on the display, but I game isn't exactly selling hot and I can get an idea why it is. Nowadays \"Being Good\" isn't enough to gain attention unfortunately. Never less, if this game somehow made you read this review, you can consider buying this for a full price or for a slight sale. Value proposition for Pharaoh Rebirth is on the reasonable level and I assume that this dev would appreciate a helping hand.\n\nPS This game has actual, high quality JoJo’s Bizzare Adventure reference in the form of a certain subweapon. You can never pass or not mention a good JoJo reference.", "timestamp_created": 1508071589, "timestamp_updated": 1508071729, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.692379", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35181100": {"recommendationid": "35181100", "author": {"steamid": "76561198019092467", "num_games_owned": 191, "num_reviews": 10, "playtime_forever": 542, "playtime_last_two_weeks": 0, "last_played": 1503949943}, "language": "english", "review": "🐇Pharaoh Rebirth is a metroidvania that is super cute and FUN. It feels like a bunny Indiana Jones going on a crazy adventure. The narrative is really humoristic, and the story was a joy to follow. Some of the bosses can be challenging, but thankfully you can use collectible items to help you out. Pharaoh Rebirth is just an overall fun experience.", "timestamp_created": 1506260261, "timestamp_updated": 1506260261, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34855073": {"recommendationid": "34855073", "author": {"steamid": "76561197961230622", "num_games_owned": 789, "num_reviews": 23, "playtime_forever": 332, "playtime_last_two_weeks": 0, "last_played": 1505111634}, "language": "english", "review": "I don't know why people are calling this a Metroidvania, it isn't. It's closer to a weird Mega Man / Donkey Kong Country hybrid, but less fun than that sounds. \nThe controls are not clean and don't feel great, strike one in a primarily platforming game with instant-kill spikes everywhere. \nThere's a lot of issues with actually making the game run smoothly for a lot of people, I managed to get it going after several restarts and trying different options out after 10 or so minutes. \nThe upgrades are OK and typical enough for a Metroidvania but the level design, gameplay, world selection, etc. all speak to it being more of a typical platformer, with Metroid style movement upgrades which largely amount to unlocking 1 secret in a past level and letting you progress in the current one. \nThere's no excuse for the car level. It's just objectively bad and again, reflective of a platformer game design in the middle of something that just isn't quite in one place or the other. I don't know how air horns blasting at you every 5 seconds (sometimes faster) as you retry over and over got through any kind of \"fun\" test. I had to mute the game to get through that section.\n\nIf you've played Axiom Verge, Hollow Knight, Ghost 1.0, Shadow Complex, all the Donkey Kong Country games, all the 2D Super Mario games, actual Metroid games, Castlevania: Symphony of the Knight, Mega Man collection, and a few others I'm forgetting right now and you still want more, then OK, this might scratch some of that itch, or at least make you eager to go back to one of the good ones. Otherwise, skip it, even on sale. I would refund it halfway through if I could.", "timestamp_created": 1505026978, "timestamp_updated": 1505026978, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.386755", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34805119": {"recommendationid": "34805119", "author": {"steamid": "76561198031517241", "num_games_owned": 261, "num_reviews": 9, "playtime_forever": 719, "playtime_last_two_weeks": 0, "last_played": 1502574799}, "language": "english", "review": "While the metroidvania genre as a whole is in no way devoid of games, it’s rare to find true gems among them. Games which aren’t just good in terms of graphics, level-design or story, but a great experience overall, like the [url=http://steamcommunity.com/id/yoj/recommended/345820/]Shantae[/url] series, [url=http://steamcommunity.com/id/yoj/recommended/332200/]Axiom Verge[/url] or the genre-defining series of Metroid and Castlevania themselves, are few and far between. This makes discovering Pharaoh Rebirth ever so better.\n\nAll in all, Pharaoh Rebirth closely resembles the games from the Shantae series, which is good thing in my opinion, since those are great metroidvania games, which do many things right. From stylish old-school 2D graphics and great overall art style to an upbeat soundtrack that fits the game to the, from responsive and tight controls to balanced level design with just the right difficulty of platforming, the level of quality throughout all of Pharaoh Rebirth is surprisingly high.\n\nYou play as a renowned treasure hunter Dr. Jonathan Banfield [spoiler]coincidentally he was turned into a rabbit[/spoiler], who is assisted by his hacker friend Jack. While trying to stop your ex-companion Andre Betancourt [spoiler]coincidentally, turned into a turtle[/spoiler] from pillaging a legendary ancient Egypt oasis, you uncover an unknown sarcophagus. Andre’s decision to open it results in you both being placed under pharaoh's curse to die in 7 days, so now both of you scramble to find the seven holy grails, which is the only way to save yourself from the curse. The story might not sound that interesting, but it fits the overall adventure atmosphere of the game just right. It is also greatly augmented by the game having charming and funny characters and quirky humor.\n\nGameplay is top notch, with all of the genre-specific features present and being done right. The game itself is divided into several different locations, each of them represented as a separate interconnected Metroid-style map, which isn’t fully accessible to you right from the get go — some areas will be hidden off, while other will require having specific abilities to reach. When raiding each location, you’ll find all sorts of treasures, which either boost your stats or unlock new abilities for your character. So it’s always a good idea to go over the areas that you’ve already visited after receiving these new abilities, as there might be more treasures waiting. Overall there are over 80 treasures scattered throughout the game and over 10 sub-weapons [spoiler]which will greatly improve your experience[/spoiler], different items, power-ups and so on. There are plenty of cleverly designed enemies (like Cycads and Totem Poles that blend into environment, or even False Jonathans that mimic your own appearance) and some not too hard boss-fights; at least they won’t be hard when you’ve powered up or have a good strategy for each boss. But bossfights aren't the only highlight, there’s more: there are some on-rails platforming and turret sections to spice things up and break the flow of the game, an additional secret level (if you find all of the map pieces within the game) and a boss rush mode. The enemies also interact with the level in some cool and unexpected ways. For example, you see an exploding enemy. So what? Trigger and walk away. Now imagine the same enemy, but on the train. And the carriage you're standing on has just been decoupled. Pretty tense, huh?\n\nI can honestly say that going in, I didn’t expect Pharaoh Rebirth to be such a great game in its whole, which makes it even sadder, when you look at its sales numbers: SteamSpy estimates sales at around 10k copies sold, which is just asinine, no matter how you look. So, if you’re even slightly interested in such type of games, you should definitely give Pharaoh Rebirth a try.\n\nP.S. For more awesome hidden gems, follow the steam [url=http://store.steampowered.com/curator/10722089/]CRIMINALLY Low Sales[/url] curator.", "timestamp_created": 1504829995, "timestamp_updated": 1504829995, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.664265", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34333435": {"recommendationid": "34333435", "author": {"steamid": "76561198369275019", "num_games_owned": 49, "num_reviews": 2, "playtime_forever": 1272, "playtime_last_two_weeks": 0, "last_played": 1503913672}, "language": "schinese", "review": "已经玩了六个小时，中毒了真的好玩 ，各种元素都有，画质也很好，写个评论支持一下吧，非常适合喜欢银河战士恶魔城类的朋友来玩。", "timestamp_created": 1503078733, "timestamp_updated": 1503078733, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34274840": {"recommendationid": "34274840", "author": {"steamid": "76561198053657175", "num_games_owned": 114, "num_reviews": 15, "playtime_forever": 579, "playtime_last_two_weeks": 0, "last_played": 1460594956}, "language": "japanese", "review": "すっごい堅実な作りのアクションゲーム。\nゲームとしての新規性には欠けるものの、良グラフィック、良音楽、良ストーリーとひととおり揃っていて、\n先のステージ見たさから一気にプレーしてしまう内容だ。\n\nメトロイドヴァニアとよく表現されるが、個人的にはぽっぷるメイルやモンスターワールドといったものに近い種類の内容だと感じた。\n全体的に90年代くらいのセンスでできてる感じなので、そこがツボにはまるかどうかで評価が分かれそうとは思う。", "timestamp_created": 1502884704, "timestamp_updated": 1502884704, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33892400": {"recommendationid": "33892400", "author": {"steamid": "76561198064110101", "num_games_owned": 96, "num_reviews": 1, "playtime_forever": 643, "playtime_last_two_weeks": 0, "last_played": 1501351739}, "language": "english", "review": "I liked this game. I am new to Metroidvana style game but this was pleasant to play. The only frustrating part for me was the bonus stage where I got stuck on the chain double jump part 2/3rds into the level. For some reason I can't get high enough after the swing to double jump over it. I noticed that on Youtube playthroughs pretty much nobody else has that problem.\n\nMy single complaint was the jagged tearing of the background while moving. I still view it as a postive experience.", "timestamp_created": 1501370350, "timestamp_updated": 1501370350, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33873121": {"recommendationid": "33873121", "author": {"steamid": "76561198018485266", "num_games_owned": 587, "num_reviews": 151, "playtime_forever": 495, "playtime_last_two_weeks": 0, "last_played": 1498393425}, "language": "schinese", "review": "恶魔城系列一直有着不少在故事或者游戏风格上对其致敬的同人作品，在大概十年前（或者更早），网络上有大量日美玩家制作的恶魔城同人游戏。其中有一款叫做《REFURN of EGYPF》，或是更熟悉的称呼“老头版恶魔城”的游戏以其较高的制作水准在部分爱好者中留下了记忆。而多年后的这部《Pharaoh Rebirth+》在某种意义上算是其精神续作，同样的配乐作者，同样的“死村拳”，还有埃及背景和类似月下一样的地图设计等等，都仿佛是开发组对于当初的追忆。\n\n这是与《桃与多拉：月下遐想》气质上有所接近的日式同人游戏风格，关卡制的流程推进、Metroidvania式的地图结构与机制、动漫化的埃及寻宝冒险故事。主角乔纳森是一位在盗墓时遭到诅咒而变成兔子外貌的探险家，而与他同行的好友安德烈，则是被诅咒变成了乌龟的外貌........\n\n在遭遇这次挫折后，乔纳森开始将自己的目标转为挖掘并保护古代的文物，这与原本与他一起搭伙盗墓的安德烈最终因为理念不合而分道扬镳。于是乔纳森开始与另一位考古学者杰克一同合作，与他一起寻找传说中的古代遗迹。但在一次挖掘过程与安德烈狭路相逢，最终两人一起找到了深埋在遗迹尽头的墓室，并在打开了法老的棺木后又一次被诅咒。而这次两人的情况非同小可：他们将会在7日之内因为诅咒而死亡，唯一的希望只有找到埋藏在埃及境内的7个圣杯才能逃过一劫。\n\n虽然又是“7日死”又是诅咒的，但其实本作偏卡通的萌系风格整体上是很轻松明快的。不论是古墓还是废墟的氛围都是很明亮的场景，配乐和故事基调也很热血激昂。几个主要人物的塑造也都是偏搞怪胡闹的，无论是一本正经吐槽主角的杰克，还是“龟兔赛跑”过程中的嬉闹都很诙谐。开发者花了不少心思着力展现两个主角的形象，人物动画生动丰满，很好的用动作来展现人物的个性。\n\n即便是早期的那部“老头版恶魔城”，也可以看出作者不俗的游戏开发能力。而在很多本作的动作游戏基础上也发挥出了他当年的水准，从感观上的音画表现，到动作游戏必要的手感与关卡设计，各方面的表现都令人满意。\n\n人物的移动灵活，加上场景也比较紧凑狭小，使得游戏的节奏显得很快。作为主要可用的角色，乔纳森几乎所有的动作都依靠于他的兔耳朵 —— 从基础的攻击、挂钩摆荡、滑翔甚至是二段跳都是通过耳朵发动的。本质上虽然只是一些极为常见的动作系统，但是得益于有趣的动画设计，让乔纳森的各种行动显得很新鲜。随着流程推进，另一个主角安德烈同样可以操作，而他在基本的规则没有变化的情况下，很多动作又与兔子有所不同。在挑战真结局时玩家可以随时切换二人时，更能体现出角色间的差异。\n\n虽然游戏作者在当初是以致敬恶魔城的同人作品开始的，而本作也的确带有探索与迷宫式地图结构，但是PR+却很注重传统横版平台游戏的流畅节奏。游戏不仅仍旧保留了章节式的关卡分段，作者也在每关加入了大量强制推进的桥段，甚至还有驾驶关卡，让节奏与反应要求更加严格。\n\n相比不算太困难的平台跳跃环节，战斗在游戏过程中被更加以强调。不仅有不少设计得很好的BOSS战，也会遭遇到一些强制性的杂兵战。有一些强制战斗还结合了环境因素，其中“幽灵悬浮电梯”的桥段给我留下了非常美妙的体验，是本作绝对值得一试的环节。\n\n虽然并没有安排巨大的迷宫地图，我们仍旧有着相当可观的探索内容和丰富的道具。游戏没有采用金钱与EXP属性成长系统，玩家的强化选项有限，所以熟悉操作并了解各种机制才是制胜的手段。\n\n每个关卡中都隐藏着各种物品，其中有纯粹收藏的道具，也有能够获得属性增益的贵重物品，还有不少消耗品的食物可以缓解战斗的压力。而副武器与黄金拼图则是玩家最重要的收集项目。前者在合理的应对手段下，可以发挥及其强力的攻防效果，某些强力的敌人通过副武器的克制能够事半功倍。而集齐黄金拼图后，便能够解锁游戏的隐藏攻击技能“死村拳”，在消耗一定的MP后造成全屏的大规模杀伤。\n\n虽说谈不上有着银河战士等名作一样位置巧妙的隐藏道具，但想要收集全部物品，对于玩家的耐心和操作水准还是有一定要求的。除了像第一关里“鞭尸”安德烈获得的龟壳这种需要脑洞的物品收集外，还有诸如全BOSS无伤才能获得的物品，对于有完美收集习惯的玩家来说颇具挑战性。\n\n非常感谢在之前的文章留言里安利本作的朋友，的确如他所说，这款游戏算是Stean上被埋没的优秀动作游戏之一了。它的素质绝对值得横轴动作游戏爱好者收藏并花上10个小时左右享受一番。虽然我不太喜欢有点太过喧闹的配乐风格，但是本作可爱的人物和精致的画面，丰富的收集元素和有趣的关卡设计，令我在全程的游戏过程中都获得了相当美妙的感受。\n\n可爱迷人的游戏风格，充满个人兴趣的设计，还有爽快而不失节奏感的动作场面。对于日渐迷茫的日式商业动作游戏开发者来说，他们也许应该回想一下最初的游戏是如何吸引我们的。", "timestamp_created": 1501305818, "timestamp_updated": 1501305818, "voted_up": true, "votes_up": 49, "votes_funny": 0, "weighted_vote_score": "0.861228", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33712777": {"recommendationid": "33712777", "author": {"steamid": "76561198190537711", "num_games_owned": 181, "num_reviews": 97, "playtime_forever": 280, "playtime_last_two_weeks": 0, "last_played": 1501287643}, "language": "koreana", "review": "좋은 게임입니다. 기본 시나리오만 보는데 4.5시간이 걸렸네요.\n\n아이템을 다 모으고 하려면 제법 많은 시간이 걸릴듯 합니다.\n\n난이도는 적절한 편이네요. 중간중간에 전화가 걸려오면서 대화씬이 자주 나오는데\n\n이 부분은 게임을 몰입을 방해할 수 있다는 생각도 듭니다.\n\n그래도 추천작. 플랫포머 게임을 좋아하신다면 추천.", "timestamp_created": 1500699991, "timestamp_updated": 1500699991, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33410071": {"recommendationid": "33410071", "author": {"steamid": "76561198030031438", "num_games_owned": 1504, "num_reviews": 70, "playtime_forever": 548, "playtime_last_two_weeks": 0, "last_played": 1499627131}, "language": "english", "review": "One of those hidden indie gems you probably never heard of.\nWhat is it? In short take a Shantae game, mix it with some Indiana Jones and you got Pharaoh Rebirth Plus.\nYou control a archeoligist cursed to look like an adorable bunny while you platform around and discover stuff.\nThe game is a metroidvania but you get a stage selection and each area is a self contained map.\nAlso you get some highly amusing Metal Gear Solid style codec calls.\nTook me 9 hours to find all the stuff in the game and finish it up.\nOnly problem that you can easily miss a collectible item at the start of the game ( I got it simply coz I like hitting stuff ) and that car section might drive you insane. But other than that the game is rather average difficulty wise. Not too hard not too easy.\nHighly recomended.", "timestamp_created": 1499621801, "timestamp_updated": 1499621801, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.509663", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33305750": {"recommendationid": "33305750", "author": {"steamid": "76561198021177939", "num_games_owned": 294, "num_reviews": 8, "playtime_forever": 604, "playtime_last_two_weeks": 0, "last_played": 1499502575}, "language": "english", "review": "I would ABSOLUTELY recommend this game to anybody who just.. likes stuff.\n\nI won't lie, I bought the game because Egypt + bunny. That's the combo that can make me toss money at my screen without any second thought.\n\nThe graphics are pretty but dynamic and cute,\nThe level design is beyond what's expected of the AAA industry, no exageration,\nThe narrative is funny, well thought-out and well layered. Just a wonderful experience,\nThe mechanics are varied, they feel amazing and are introduced in a clever way.\n\nTHERE IS A JOJO REFERENCE !!!!!!!!!!\n\nProbably the best game I've played in a long time.\n\n10/10. Bless the devs.", "timestamp_created": 1499332900, "timestamp_updated": 1499332900, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.568789", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33274935": {"recommendationid": "33274935", "author": {"steamid": "76561197995699509", "num_games_owned": 351, "num_reviews": 16, "playtime_forever": 612, "playtime_last_two_weeks": 0, "last_played": 1498947970}, "language": "brazilian", "review": "Pharaoh Rebirth+ é um ótimo jogo de plataforma 2D, mesmo não apresentando mecânicas inovadoras. É bem divertido controlar Johnatan por um Egito exótico e repleto de perigos, principalmente por conta do desenho dos níveis e dos vários movimentos disponíveis para o herói. Há, também, muito o que encontrar: mais de 60 itens estão escondidos pelas fases e coletar todos eles é um desafio considerável. Com ares de jogo da era 16-bits e bom humor, Pharaoh Rebirth+ é uma ótima escolha para aqueles que apreciam de aventuras de plataforma.\n\nE como não gostar de um jogo no qual o protagonista é um coelho pseudo-Indiana Jones que faz um avião de papel com as orelhas?\n\n[url=https://faru.wordpress.com/2017/07/05/analise-pharaoh-rebirth-pc/]Análise completa[/url]", "timestamp_created": 1499261304, "timestamp_updated": 1499261304, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.509346", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33127391": {"recommendationid": "33127391", "author": {"steamid": "76561197961780979", "num_games_owned": 1328, "num_reviews": 162, "playtime_forever": 1063, "playtime_last_two_weeks": 0, "last_played": 1498993475}, "language": "tchinese", "review": "2D橫向  無中文與漢化  只有日跟英可選\n\n手把無壓力\n\n\n英文大部分看不太懂所以就自行腦補劇情了\n\n主角  兔子先生  初章後遇到烏龜先生接著觸碰神壇兩人不僅受傷還剩下七天生命\n\n接著要去收集七個聖杯許願  其中又有不少人干擾摻入  美國部門也來湊一腳\n\n負責通訊的JACK是個實力高超的黑客  兔子跟JACK對話有些還蠻好笑的XD\n\n\n操作就攻擊  跳躍  副武器  轉換副武器\n\n無升級系統有蒐集要素跟密道\n\n蒐集道具可以增加技能或是血魔攻防\n\n密道也非常多  有的要靠技能才能進入\n\n\n整體來說是蠻推薦的  流暢度跟操作都不錯  不過似乎會挑機子\n\n我自己玩整體FPS大概3x~5x  只有一開始主選單可以60....\n\n遊玩過程可以感覺到明顯緩慢  有種以前56K上網看圖跑的感覺....\n\n而且有個關卡限時4分鐘完成  光等畫面跑就飽了QQ\n\n我去看了YOUTUBE其他人有些非常流暢完全不卡!!!!\n\n有些比我好一點  但也是明顯緩慢\n\n看討論區也沒甚麼討論幀數問題  提問也沒人答....就默默地通關了\n\n如果能保持滿幀的話真的是蠻爽快的\n\n\n兔子表情非常萌\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=961950404\n\n暫存點可回復  好像要自己按上才會觸發存點\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=961950234\n\n缺兩個\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=961950487\n一個收集滿金塊就有可是我就沒有不知道是不是BUG 而且這個好像還是大招....\n另一個就是4分鐘的挑戰賽  試了好幾次最快就4分20秒吧  也沒大招可用放棄了QQ\n\n順便一提這蒐集也是滿血尿的  不看攻略基本蒐不滿XD\n\n我是第七關打完遊戲通關後才開始蒐集的  可能這樣所以金塊滿後沒跳出劇情給道具\n\n所以建議最好第七關前先蒐集滿金塊  每關都會有四個  物品欄右上角那個\n\n食用道具也會重置所以也別擔心\n\n\n最後給個提示以免重玩  第一次打完烏龜後記得鞭屍  會掉防+1的龜殼XD\n\n這個錯過就沒了  手錶任務應該也是限時的....只能祝好運了  有找密道應該不會錯過\n\n除了金塊其他都可以通關後慢慢找  還有個道具可以通關後解鎖額外關卡", "timestamp_created": 1498995426, "timestamp_updated": 1498995452, "voted_up": true, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.729985", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33105313": {"recommendationid": "33105313", "author": {"steamid": "76561198061619531", "num_games_owned": 260, "num_reviews": 5, "playtime_forever": 1218, "playtime_last_two_weeks": 0, "last_played": 1499264448}, "language": "english", "review": "Be it the graphics or the gameplay this game is a bliss.\n", "timestamp_created": 1498949693, "timestamp_updated": 1498949693, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.462855", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33057263": {"recommendationid": "33057263", "author": {"steamid": "76561198045479595", "num_games_owned": 28, "num_reviews": 2, "playtime_forever": 486, "playtime_last_two_weeks": 0, "last_played": 1498867956}, "language": "english", "review": "I am impressed. Responsive controls, enjoyable soundtrack, a lot of hidden secrets to discover, aswell as colorful, vibrant locations. Exploring previous areas with newly aquired abilities was fun an rewarding.\n\nThe only thing detracting from the experience were the numerous dialogue pop-ups. It felt a little over-explainy at times. However, they only show up during the first run through a level and the devs provided quick skip options, so in the end I didn't mind it too much.", "timestamp_created": 1498859460, "timestamp_updated": 1498859460, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.528090", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33016595": {"recommendationid": "33016595", "author": {"steamid": "76561198015327809", "num_games_owned": 636, "num_reviews": 234, "playtime_forever": 86, "playtime_last_two_weeks": 0, "last_played": 1498782705}, "language": "english", "review": "Having the jump attack and the dash be the exact same button combination is a terrible design choice. Also some bosses have zero hints to their movement so prepare to get cheap shotted. This felt like it could have been good but its these flaws and the warning from people here about a really ass auto-scroller car section that just made me to decide to cut out while I still could.", "timestamp_created": 1498782970, "timestamp_updated": 1498783751, "voted_up": false, "votes_up": 7, "votes_funny": 3, "weighted_vote_score": "0.448725", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32793367": {"recommendationid": "32793367", "author": {"steamid": "76561198003469036", "num_games_owned": 2035, "num_reviews": 35, "playtime_forever": 529, "playtime_last_two_weeks": 0, "last_played": 1498432197}, "language": "english", "review": " Pharaoh Rebirth+ is a fun and charming 2d Metroidvania platformer. It's set up as a series of relatively small but sprawling levels capped by boss fights, with the typical pickups and powerups for the genre; there isn't an unified map, but you can revisit finished levels once you're done with the current one to reach new areas with your new gadgets.\n The pixel art is great and very varied, and the game does a great job in mixing the gameplay up with new mechanics and threats, (simple) puzzles and unexpected minigame-like segments (though the driving level might be its biggest misstep).\n The cartoony tone and graphics might be a turn-off for some. It can also be very hard at times... I quickly gave up on getting all the collectibles, especially in the aforementioned driving bit, for example. But other than that this is a very strong recommendation - especially if you like this sort of thing.", "timestamp_created": 1498434627, "timestamp_updated": 1498434627, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.641607", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32762296": {"recommendationid": "32762296", "author": {"steamid": "76561198012980068", "num_games_owned": 608, "num_reviews": 7, "playtime_forever": 476, "playtime_last_two_weeks": 0, "last_played": 1498558377}, "language": "english", "review": "Very enjoyable and cheap, if you've got an itch for a \"metroidvania\" go for it.", "timestamp_created": 1498379796, "timestamp_updated": 1498379815, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.528090", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32711711": {"recommendationid": "32711711", "author": {"steamid": "76561197993315215", "num_games_owned": 795, "num_reviews": 19, "playtime_forever": 372, "playtime_last_two_weeks": 0, "last_played": 1480576073}, "language": "english", "review": "This was  a surprise for me, I wasn't expecting this metroidvania to be particularly interesting when I bought it. That changed  when I played the first 5 minutes of the game. There was no \"warm up\" to get used to how pretentious some of these other indie metroidvania games can be. I'm leaving my review intentionally sparse because so many people have done an amazing job of detailing everything amazing about this game. Long story short, worth playing and replaying. In my mind, not quite cave story tier but certainly a hidden gem with some serious heart.", "timestamp_created": 1498281403, "timestamp_updated": 1498281403, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.550007", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32041122": {"recommendationid": "32041122", "author": {"steamid": "76561198112838566", "num_games_owned": 118, "num_reviews": 20, "playtime_forever": 914, "playtime_last_two_weeks": 0, "last_played": 1496076125}, "language": "japanese", "review": "超絶良ゲーだが快適性は低い\n特に読み込みが長いのが辛い。割とぽんぽこ死ぬ、というか気軽に殺しにくるのに死んでから再開するまで5秒待たされる。やって損はないが苦痛も受ける。まあ覚悟の上で。\n\n※メトロイドヴァニアの癖に取り逃すと入手不能になるアイテムがある。気になる人は事前に調べること。ヒント：[spoiler]オープニングステージ、亀の甲羅[/spoiler]", "timestamp_created": 1496063149, "timestamp_updated": 1511022617, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.598851", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31401296": {"recommendationid": "31401296", "author": {"steamid": "76561197992636376", "num_games_owned": 410, "num_reviews": 46, "playtime_forever": 551, "playtime_last_two_weeks": 0, "last_played": 1493322888}, "language": "english", "review": "This Metroidvania-style game was mainly programmed by a single Japanese guy called [i]Krobon[/i], so hats off first. Before this he was responsible for several freeware and doujin games such as [i]Return Of Egypt[/i], which serves as a quasi prequel to [b]Pharao Rebirth+[/b].\n\nFor this game Krobon was definitely inspired by [i]Castlevania: Symphony of the Night[/i] and similar games of the franchise. In other words you have the distinctive level design, the fancy combat mechanics (but rabbit ears instead of a whip), kinda like flying Medua heads, tons of items and upgradeable skills such as double jumps and suchlike.\n\nThe pixel art is adorable and detailed, the music is catchy, there's lighthearted J-humour and the controls respond crisply. From a design and programming perspective there's not much to complain.\n\nIt's also similar to the [i]Shantae[/i] games, so you'll definitely like it if you already played these. But keep in mind that [b]Pharao Rebirth+[/b] is nothing like [i]La-Mulana[/i], another J-game that looks pretty similar on the first glance. It's way less difficult and complex than that, has separate stages instead of a huge dungeon system and is much shorter on top of that. After a couple of hours you'll already see the ending flickering over your screen, so even unpracticed players will enjoy this platformer.\n\nAll in all it's a very enjoyable experience, yet not a too demanding one. Try a higher difficulty if you feel unchallenged at first. Other than that it's chill.\n\nI'll give this therefore [b]8 out of 10 rabbits[/b].", "timestamp_created": 1493324163, "timestamp_updated": 1493325540, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.614192", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31059079": {"recommendationid": "31059079", "author": {"steamid": "76561198169146768", "num_games_owned": 54, "num_reviews": 2, "playtime_forever": 658, "playtime_last_two_weeks": 0, "last_played": 1497025735}, "language": "japanese", "review": "メトロイドヴァニア系アクションゲーム\n\nよかった点\n・精密に書き込まれたドット絵\n・魅力的なキャラクター\n・ほとんどの収集アイテムに付属効果があるので集める実感がある\n\n気になった点\n・この手のゲームでは珍しく取り返しのつかない要素がある（消費アイテム、一部のドロップアイテム）\n・ストーリー中で強制的に挟まれる高難易度ミニゲーム\n・何度かクリアしたステージに戻ることになるが上記のミニゲームを含む長い道中をスキップできない\n\n", "timestamp_created": 1491827684, "timestamp_updated": 1491827684, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.603025", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30514655": {"recommendationid": "30514655", "author": {"steamid": "76561198102808660", "num_games_owned": 7, "num_reviews": 1, "playtime_forever": 1342, "playtime_last_two_weeks": 0, "last_played": 1489713403}, "language": "english", "review": "This is a fantastic game. I honestly couldn't find anything to dislike about it.\n\nFelt like sort of a mix of Metroid & Mega Man. Good amount of content - 7 Stages, a prologue, and a boss rush mode. Always with at least one boss per stage. Boss fights are well balanced and never cheap, and have an arcade-style feel to them. The difficulty level felt just about right on \"hard\" setting, so I'd recommend starting there unless you're completely new to the genre - it's really not very hard, especially with collectibles, powerups, and save points littered all over the place. That setting makes it just difficult enough that you may want to learn the boss moves & think about your approach a bit.\n\nSimilar to the old Metroid games, you'll pass some obvious barriers that require an ability you don't have yet, and will have to return later to explore new areas after gaining those abilities. The backtracking isn't bad and generally only takes a minute or two since you can stage select (and sometimes skip various portions of a stage). I think revisiting old stages is also optional for the most part, and not necessary to progress. \n\nCollectibles are done well and add to the experience rather than being a chore to hunt down - they generally add stats or a new ability, or are used in less obvious ways. They all have some flavor text too.\n\nSome people are hating on the car level, but I didn't find it to be overly jarring or out of place. It will just take a few tries to get through. If you're familiar with the old Donkey Kong Country games, its basically a mine cart level with lots of pits to fall in. And it does at least warn you of upcoming jumps and have several checkpoints mixed in.\n\nBiggest negative I experienced was some slowdown which required me to rework my nVidia settings a bit. For whatever reason, I had to manually enable v-sync and triple buffering in nVidia (and enable v-sync in game settings also) to make things run smoothly. However, I seem to be in the minority with this issue.\n\nOverall: Highly recommended. Totally worth my $10.", "timestamp_created": 1489525682, "timestamp_updated": 1489542181, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.507389", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30150021": {"recommendationid": "30150021", "author": {"steamid": "76561198001653981", "num_games_owned": 233, "num_reviews": 1, "playtime_forever": 727, "playtime_last_two_weeks": 0, "last_played": 1459094000}, "language": "english", "review": "I loved this game! It's one of the best action-platformer Metroidvania experiences I've played in years with some nods to Cave Story as well in terms of character and boss design while still keeping it completely fresh and original. The music is fantastic as well. Have fun collecting all those hidden collectibles!", "timestamp_created": 1487968861, "timestamp_updated": 1487968941, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29368989": {"recommendationid": "29368989", "author": {"steamid": "76561198025369789", "num_games_owned": 195, "num_reviews": 24, "playtime_forever": 348, "playtime_last_two_weeks": 0, "last_played": 1484951787}, "language": "english", "review": "Lacking polish in areas, but a fun little metroidvania with solid core gameplay and great music.", "timestamp_created": 1484887421, "timestamp_updated": 1484887421, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29261210": {"recommendationid": "29261210", "author": {"steamid": "76561198026975685", "num_games_owned": 433, "num_reviews": 61, "playtime_forever": 620, "playtime_last_two_weeks": 0, "last_played": 1484438990}, "language": "english", "review": "This is a hidden gem on steam, definitely recommend!", "timestamp_created": 1484440864, "timestamp_updated": 1484440864, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29157006": {"recommendationid": "29157006", "author": {"steamid": "76561198044856783", "num_games_owned": 728, "num_reviews": 68, "playtime_forever": 382, "playtime_last_two_weeks": 0, "last_played": 1484031082}, "language": "english", "review": "[h1]A very good example of a hidden gem[/h1]\nThis game has a total of 10 levels(the prologue, 7 regular levels, 1 extra level and a boss rush level), each level is like a mini-Metroidvania. It's is possible to return to previous levels to get some collectible items, or upgrades using new abilities.\nThe gameplay itself reminds me a lot to Shantae and the Pirate's Curse.\n\n[h1]Pros[/h1]\n[list]\n[*] Very good controls\n[*] Compelling art design\n[*] Good music\n[*] Good level design with a good balance between action and exploration\n[*] Good variety between weapons and moves maintain the gameplay fresh at any moment during the game. \n[/list]\n\n[h1]Cons[/h1]\n[list]\n[*] Even when the story is relively simple, it has too much dialogues and they pop up too often. Fortunately it's possible to skip them, but still you can only skip one dialog at a time, not entire conversations, so you may end mashing the skip button.\n[*] The only supported resolution is 640x480\n[*] One of the levels is a very long mine car section, and it's as unfair as Donkey Kong Country mine car levels (and just remember, this game doesn't have wide screen support).\n[/list]\n\nNote 1: Some people complain that this game has tearing, to fix that just activate the vsync\nNote 2: The default controls are a little weird, I recommend to configure the game before playing it, it can be configured in the launcher, but not inside the game.", "timestamp_created": 1484032052, "timestamp_updated": 1484032052, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.577903", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29120095": {"recommendationid": "29120095", "author": {"steamid": "76561198076629224", "num_games_owned": 733, "num_reviews": 93, "playtime_forever": 325, "playtime_last_two_weeks": 0, "last_played": 1483892247}, "language": "russian", "review": "Сделана одним безумным японцем и выглядит как ААА-тайтл для портативки, очередное доказательство того, что западные трешоделы, гордо лепящие \"восьмибитовый пиксель-арт\" на свои растровые карякули, - жалкие халтурщики.\nКачественный платформер, метроидвания с уровневой структурой, с огромным количеством секретов (из которых я нашел процентов 60, хотя раскрасил все карты), причем как бесполезных собирашек, так и дополнительных оружий и апргейдов, смешные и обаятельные персонажи и множество разнообразных игровых ситуаций - например, на одном кусочке одного уровня надо прятаться от лазера спутника-убийцы под зонтиками. Ещё нужно отметить отзывчивое управление, которое редко где сегодня встретишь и наличие неявных механик, которые требуют скилла, но дают большие преимущества в битвах с боссами.\nКроме того есть босс-раш и второй персонаж, которого дадут в вечное пользование после прохождения игры.\nМожно сказать, что она слишком короткая, диалогов слишком много и что уровень с машиной - кошмар и ад, но всё это легко прощается.\nБрать всем любителям платформеров и красивых картинок.", "timestamp_created": 1483892720, "timestamp_updated": 1483892720, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.574789", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29088341": {"recommendationid": "29088341", "author": {"steamid": "76561197998526955", "num_games_owned": 1191, "num_reviews": 86, "playtime_forever": 568, "playtime_last_two_weeks": 0, "last_played": 1492081876}, "language": "italian", "review": "Finito in poco più di 9 ore, adesso mi aspetta lo stage opzionale. Pharaoh Rebirth + è un gioco creato da una persona sola, di nazionalità giapponese. \n\nE' un metroidvania che coniuga con sapienza il senso di avventura, di esplorazione, con una narrazione resa benissimo tramite le comunicazioni radio. Ci si affeziona perfino ai protagonisti, il finale mi ha fatto sudare ma è un sudore ben ripagato. \n\nVale tutti i soldi che costa, anche di più, sorpresone dell'anno. Nota a margine: è a 640*480, senza 4k, né hdr, e non c'è su Playstation 4 PRO. Però si gioca, che in fin dei conti è un qualcosa che è stato lasciato ai margini ultimamente.", "timestamp_created": 1483798243, "timestamp_updated": 1483798243, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.507499", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28955141": {"recommendationid": "28955141", "author": {"steamid": "76561198001462797", "num_games_owned": 785, "num_reviews": 2, "playtime_forever": 344, "playtime_last_two_weeks": 0, "last_played": 1483388726}, "language": "english", "review": "Without a doubt one of the best hidden gems on Steam.  I expected a well crafted Metroidvania experience going in, but I wasn't expecting this much polish with attention to detail, pacing, and balance.  Heck, even the story is pretty interesting and does a great job crafting very likeable characters.  Really, the only issue I had with it is one single stage in the game that completely changes the formula and comes out of left field.  Luckily, it's only one stage and doesn't overstay it's welcome.\n\nThere's a lot of replay value here too: collecting all the items, sub weapons, power ups, as well as two additional stages after the credits roll.  You can tell this title was a labor of love, and the team deserves praise for crafting something so polished and well developed.\n\nHighly recommended title.", "timestamp_created": 1483389260, "timestamp_updated": 1483389260, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502262", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28809831": {"recommendationid": "28809831", "author": {"steamid": "76561198095512548", "num_games_owned": 127, "num_reviews": 25, "playtime_forever": 644, "playtime_last_two_weeks": 0, "last_played": 1483505135}, "language": "brazilian", "review": "JOGO BOM DA PORRA!\n\nVi uma análise dum maluco falando de falhas graves no Level Design das ultimas fases, VELHO, nada a ver, joguei esperando uma puta dificuldade no fim, mas não, a dificuldade é boa, mas é assim o jogo inteiro.", "timestamp_created": 1483056259, "timestamp_updated": 1483056259, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28351595": {"recommendationid": "28351595", "author": {"steamid": "76561197966636028", "num_games_owned": 740, "num_reviews": 8, "playtime_forever": 684, "playtime_last_two_weeks": 0, "last_played": 1481668682}, "language": "english", "review": "I do not have time to write up a big review at this point, so I will keep this short.\n\nFor the most part I enjoyed this game.\n\nThe stages feel quite Metroidvania-y, the collectibles (at least most of them) actually give you all kinds of perks so they're not just there for the sake of collecting them. The stages offer a good amount of variety, the bosses are for the most part simple but still fun to fight. \n\nThe soundtrack is really nice. \n\nThe story isn't really deep or anything and the humor seems a bit forced at times, it's still enjoyable though. \n\nThe controls work but they could be a little more refined. Jumping sometimes doesn't feel as responsive as it should be and there really is no reason not to use more buttons than are used. \n\nYou only get a single save slot which for this kind of game and in this day and age is not justifiable.\n\nWhat I really dislike about this game is the \"car stage\" (actually the first part of a stage) which you can't skip on revisits and which you have to do to get some of the collectibles. It's really annoying and doesn't fit in with the rest of the game. \n\nOther than that, the game is good and I very much recommend giving it a try!\n\nOne more thing, the amount of challenge you'll get out of this depends on the difficulty setting you choose and how much you beef up yourself by getting all the different collectibles. For someone having experience with this kind of game, playing on hard definitely is recommended. You can only choose difficulty when starting a new game, so keep that in mind.", "timestamp_created": 1481670053, "timestamp_updated": 1481670203, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28310026": {"recommendationid": "28310026", "author": {"steamid": "76561197968774889", "num_games_owned": 127, "num_reviews": 1, "playtime_forever": 1604, "playtime_last_two_weeks": 1, "last_played": 1515337193}, "language": "german", "review": "Buy !", "timestamp_created": 1481464953, "timestamp_updated": 1481464953, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28182773": {"recommendationid": "28182773", "author": {"steamid": "76561198029107781", "num_games_owned": 178, "num_reviews": 4, "playtime_forever": 569, "playtime_last_two_weeks": 0, "last_played": 1480846604}, "language": "spanish", "review": "Una maravilla tanto en su versión normal que salió totalmente gratis, como en su versión plus exclusivo de Steam. No falla absolutamente nada, jugabilidad, banda sonora, gráficos, historía... todo es perfecto. Si buscas un plataformas de exploración, lo que se suele llamar Metroidvania, este es el mejor de todos en mi opinión, aun habiendo jugado a muchos otros más duraderos y conocidos. El programador jápones que hizo Pharaoh Rebirth supo darle el toque perfecto a cada segundo dedicado.\n\nSi os gustó Pharaoh Rebirth, adquirir también Action Mogura, que es otra maravilla del mismo creador.", "timestamp_created": 1480854522, "timestamp_updated": 1480854522, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28121692": {"recommendationid": "28121692", "author": {"steamid": "76561198117050451", "num_games_owned": 158, "num_reviews": 7, "playtime_forever": 272, "playtime_last_two_weeks": 0, "last_played": 1502045531}, "language": "english", "review": "Awesome metrovania game!", "timestamp_created": 1480608493, "timestamp_updated": 1480608493, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28019468": {"recommendationid": "28019468", "author": {"steamid": "76561197971507647", "num_games_owned": 952, "num_reviews": 5, "playtime_forever": 554, "playtime_last_two_weeks": 0, "last_played": 1481032790}, "language": "english", "review": "Fun, addictive Metroidvania game with a lot of endgame content.", "timestamp_created": 1480391752, "timestamp_updated": 1480391752, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27667499": {"recommendationid": "27667499", "author": {"steamid": "76561198021492219", "num_games_owned": 581, "num_reviews": 6, "playtime_forever": 263, "playtime_last_two_weeks": 0, "last_played": 1480167506}, "language": "brazilian", "review": "Ótima idea, aplicação ruim.\n\nNada de errado com as primeiras fases, mas as duas últimas fases (e algumas seções do jogo) possuem falha graves de design, punindo o jogador sem motivo e sem desculpa, as duas últimas fases não são feitas com o desafio em mente, mas com o objetivo de apenas fazer o jogador sofrer.\n\nNão reclamo de dificuldade, o balanceamento está bom, mas o jogo irá cada vez mais te insultar ao criar eventos aos quais o jogador não tem como ter conhecimento previamente.", "timestamp_created": 1480169170, "timestamp_updated": 1480169170, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.447524", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26973825": {"recommendationid": "26973825", "author": {"steamid": "76561198016586151", "num_games_owned": 306, "num_reviews": 6, "playtime_forever": 1000, "playtime_last_two_weeks": 0, "last_played": 1480421146}, "language": "english", "review": "Very fun and cool characters :3", "timestamp_created": 1479950195, "timestamp_updated": 1511478286, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502678", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26935983": {"recommendationid": "26935983", "author": {"steamid": "76561197999979097", "num_games_owned": 180, "num_reviews": 5, "playtime_forever": 272, "playtime_last_two_weeks": 0, "last_played": 1480232481}, "language": "english", "review": "Truly a hidden gem, ideal for people who are used to metroidvania-style platformers, especially those who like games that can be tricky at times. Controls are fuild, enemies have nice variety and are well placed, bosses are fun if occasionally repetitive, the sountrack is fitting, and the combat is well integrated into the platforming. If you're not used to certain gimicky things like kaizo blocks, this game might seem a little annoying, but I otherwise highly recommend this game. If you are the kind of person that's more on the edge about platformers of this flavor, maybe it's shorter length stops me from recommnding it at full price, but for doujin platformer enthusiasts I consider it just fine, and on sale it's a total steal.", "timestamp_created": 1479942314, "timestamp_updated": 1479942810, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.505736", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26759498": {"recommendationid": "26759498", "author": {"steamid": "76561198064031065", "num_games_owned": 653, "num_reviews": 60, "playtime_forever": 420, "playtime_last_two_weeks": 0, "last_played": 1474979740}, "language": "tchinese", "review": "關卡設計用心，對白幽默逗趣，善於利用電影梗來創造劇情，儘管流程比較固定，不過不失為一款橫向動作的冒險佳作。\n\n基本上遊玩起來是有點難度的，可能需要一些耐心來適應陷阱、解謎與通關方式。", "timestamp_created": 1479889777, "timestamp_updated": 1479889875, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26469652": {"recommendationid": "26469652", "author": {"steamid": "76561198050251188", "num_games_owned": 131, "num_reviews": 8, "playtime_forever": 375, "playtime_last_two_weeks": 0, "last_played": 1483070676}, "language": "schinese", "review": "买！！！", "timestamp_created": 1478495857, "timestamp_updated": 1478495857, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26456542": {"recommendationid": "26456542", "author": {"steamid": "76561198008339277", "num_games_owned": 94, "num_reviews": 5, "playtime_forever": 116, "playtime_last_two_weeks": 0, "last_played": 1503023641}, "language": "japanese", "review": "グラフィック面でも内容面でも非常に丁寧に作られた良作。\nこの作者が作ってきた作品はかなり昔から色々プレイしてきましたが、相変わらずツボを押さえた良質な作り込みで、キャラの操作感も良いし、敵のバリエーションとかステージ構成も面白いしで、SFCやメガドラ、PCエンジン時代の良質2Dアクションゲームをプレイしているかのように楽しませてもらっています。（まだクリアまで行ってませんが）\n\nあの頃のアクションゲームが好きだった人は是非プレイしてみる事をお薦めしたい。", "timestamp_created": 1478439619, "timestamp_updated": 1478439619, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26345940": {"recommendationid": "26345940", "author": {"steamid": "76561197967229781", "num_games_owned": 452, "num_reviews": 303, "playtime_forever": 917, "playtime_last_two_weeks": 0, "last_played": 1477964345}, "language": "english", "review": "Pharaoh Rebirth+ is an exciting and creative metroidvania starring an adventuring archaeologist rabbit man and his nerdy sidekick. The game takes place in Egypt and features a wide variety of Egyptian locations, creatures, and folklore for you to encounter. \n\nThis game is incredibly well polished for an indie title. The sprite-based graphics are fluid and full of little details, the soundtrack is catchy, and good snappy controls (save for a small exception). There’s loads of attention dedicated to minor things like how certain subweapons work underwater or in heavy winds or the number of cleverly hidden secrets and how to reveal them. The story is really good too and has a few surprises in store for the player as well as a bonus level if you find a certain item.\n\nDespite all the pros I mentioned earlier, this game does have its drawbacks. To start, it’s a bit short and the normal mode plays a bit more like easy mode. I highly recommend starting PR+ in hard difficulty to get the real experience and to try and get the secret level to really get your gameplay’s worth.  Also the mapping system is a bit annoying with how it comes up if you hit up twice and I accidentally triggered it a lot as a result.\n\nAll in all, I had an overall positive experience with Pharaoh Rebirth+ even though I had to play it all over again due to a nasty bug (see below) but the game was so good I didn’t even mind. I highly recommend this title to any fan of metroidvanias.\n\nBEWARE: there is a game breaking bug in the 6th stage boss fight. To avoid it: stay near the left side of the area for the entire fight. You may also want to back up your save data file manually just in case.\n", "timestamp_created": 1477958974, "timestamp_updated": 1477958974, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.583715", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26310389": {"recommendationid": "26310389", "author": {"steamid": "76561198262140672", "num_games_owned": 41, "num_reviews": 7, "playtime_forever": 741, "playtime_last_two_weeks": 0, "last_played": 1477832436}, "language": "schinese", "review": "终于通关啦，于是兴致勃勃地来写评测（虽然很不专业就是了）。想说的话有很多，但是汇聚起来就一点：这个游戏很好玩！\n\n剧本也就是司空见惯的冒险故事，有波折有起伏，但是悬念不多。重要的是台词和角色都写得很好，每个人都有鲜明独立的性格，而且大家在一起都好幽默，看得我不时地在屏幕前笑。操作很流畅，难度也适中，敌人都设计得较为用心。\n\n主角是个人类大叔，但是却因为以前在遗迹考古时被诅咒，因此外表变成了兔子，而且用耳朵攻击。耳朵不仅可以攻击敌人，还可以旋转飞升，变形成飞机状带着兔子滑翔……当主人公吐槽自己被诅咒的外表多么搞笑时，朋友一句：“至少你很可爱啊。”（大概和乌龟相比？），“我才不需要可爱！”兔子说完，又旋转着长长的耳朵去打怪了。\n　/) /)\nฅ(• ﻌ •)ฅ \n\"I don't need to be cute!!!\"", "timestamp_created": 1477817142, "timestamp_updated": 1477817142, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503106", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26299369": {"recommendationid": "26299369", "author": {"steamid": "76561198157137722", "num_games_owned": 91, "num_reviews": 49, "playtime_forever": 616, "playtime_last_two_weeks": 0, "last_played": 1477364318}, "language": "english", "review": "Very fun side scroller/Metroidvania. Excellent dialog between characters and the difficulty is perfect as the game progresses. A must buy for any one who loves this genre.", "timestamp_created": 1477770354, "timestamp_updated": 1477770354, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.479129", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26229321": {"recommendationid": "26229321", "author": {"steamid": "76561198054519435", "num_games_owned": 327, "num_reviews": 55, "playtime_forever": 57, "playtime_last_two_weeks": 0, "last_played": 1477139570}, "language": "english", "review": "I Can't understand why this game gets such good reviews!\n\nIt is very pretty, but I found the controls to be a little frustrating and the collision detection wasn't quite right!\n\n\n", "timestamp_created": 1477483376, "timestamp_updated": 1477483376, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.270592", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26198293": {"recommendationid": "26198293", "author": {"steamid": "76561198046299685", "num_games_owned": 61, "num_reviews": 22, "playtime_forever": 401, "playtime_last_two_weeks": 0, "last_played": 1477319349}, "language": "french", "review": "Très bon jeu de plateforme-action, façon old-school, avec des graphismes 2D plaisants, un gameplay bien réalisé, l'ambiance sonore est entrainante, et on a aussi un aspect metroidvania avec des collectables à chercher. On le finit assez vite, la difficulté n'est pas insurmontable mais c'est très sympa à jouer.", "timestamp_created": 1477316803, "timestamp_updated": 1477316803, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26197187": {"recommendationid": "26197187", "author": {"steamid": "76561198028119858", "num_games_owned": 922, "num_reviews": 68, "playtime_forever": 653, "playtime_last_two_weeks": 0, "last_played": 1477310233}, "language": "koreana", "review": "굉장히 잘 만들어진 플래포머 게임. 왜 이런 게임이 아직까지 안 알려졌지?\n개인적으로는 삽질 기사 (Shovel Knight) 급의 명작 게임이라고 본다.\n스테이지 선택 방식이지만 아이템을 얻어가며 점차 강해지며 못가던 곳을 갈수 있게 되는 등 매트로베니아적 성격도 강하다.\n조작감도 매끄럽고, 속도감있는 플레이와 맞물려 Bgm도 아주 경쾌하며 배경에 들어맞는다.\n캐릭터들의 개성도 상당하며 (Andre 간지ㄷㄷ)\n스토리도 평면적이지 않고 생각보다 괜찮은 모습을 보여준다.\n플래포머, 매트로베니아를 좋아한다면 필구. 가격도 착하다.", "timestamp_created": 1477311046, "timestamp_updated": 1477311046, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26183072": {"recommendationid": "26183072", "author": {"steamid": "76561198165442724", "num_games_owned": 373, "num_reviews": 61, "playtime_forever": 223, "playtime_last_two_weeks": 0, "last_played": 1480693050}, "language": "english", "review": "There are some amazing games out right now for consoles. \n\nYet, I find myself coming back to this game. The fun factor is off the charts & this metroidvania actually has a good storyline. Accessible, good weapon variety.  \n\nFinal Grade: A-", "timestamp_created": 1477231838, "timestamp_updated": 1477231838, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.449016", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25419738": {"recommendationid": "25419738", "author": {"steamid": "76561197960558860", "num_games_owned": 1592, "num_reviews": 8, "playtime_forever": 608, "playtime_last_two_weeks": 0, "last_played": 1473310568}, "language": "english", "review": "Fantastic platformer. Controls are very smooth and the variety of subweapons is pretty cool. Only negative I have is that it ended too soon and I want to keep playing more content!  If you like games like those in the Shantae series or similar action platformers, you will almost certainly like this game.", "timestamp_created": 1473386655, "timestamp_updated": 1473386864, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.518982", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25417892": {"recommendationid": "25417892", "author": {"steamid": "76561197995684381", "num_games_owned": 853, "num_reviews": 37, "playtime_forever": 623, "playtime_last_two_weeks": 0, "last_played": 1473888665}, "language": "english", "review": "A decent little platformer. It would be a lot more enjoyable if you weren't stopped every two screens to read a small novel's worth of dialogue.\n\nYou ever play a game that has a lot of dialogue in it, and you get the sense that the only reason the dialogue is there is because the developer didn't know that you can make a game -without- dialogue?\nLike, take the bit near the end of Sonic & Knuckles, where you have to fight Knuckles (if you're playing Sonic), and then when you beat him Robotnik comes in and swipes the Master Emerald. And then Knuckles opens the secret back entrance for you.\n\nThat last sentence alone inspires whole novels of fanfic BUT THE POINT IS! that Sega told a whole little story using just sprite animations. No need for talky boxes. Especially not talky boxes that presented dialogue one sentence at a time, so that by the end of a sequence your thumb has more blisters just from pressing the \"Advance dialogue\" button than from playing the game itself.\n\nSpeaking of, the controls are mostly tight, the level design could use some tweaking (there's a couple of screen transitions where you'll walk right into an enemy if you're not already in the middle of a jump), the music isn't too repetitive, and there are enough save points scattered around to keep things from feeling unfair.", "timestamp_created": 1473375745, "timestamp_updated": 1473376985, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.543568", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25410092": {"recommendationid": "25410092", "author": {"steamid": "76561197967943006", "num_games_owned": 1388, "num_reviews": 82, "playtime_forever": 44, "playtime_last_two_weeks": 0, "last_played": 1473684528}, "language": "english", "review": "excellent classic feeling platformer with all the japanese trimmings :)", "timestamp_created": 1473338961, "timestamp_updated": 1473338961, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.458814", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24836003": {"recommendationid": "24836003", "author": {"steamid": "76561198112435564", "num_games_owned": 174, "num_reviews": 55, "playtime_forever": 277, "playtime_last_two_weeks": 0, "last_played": 1471029545}, "language": "english", "review": "A refreshing experience, feels like back to 90s!", "timestamp_created": 1470971693, "timestamp_updated": 1470971693, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.423984", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24792395": {"recommendationid": "24792395", "author": {"steamid": "76561198286492878", "num_games_owned": 214, "num_reviews": 50, "playtime_forever": 637, "playtime_last_two_weeks": 0, "last_played": 1471329971}, "language": "schinese", "review": "有时候游戏还真不是看容量决定质量的。\nPR就是小容量游戏的精品代表。\n首先这个绝不是像素游戏，在640X480的窗口大小下（全屏也可以，但是就有点马赛克了）游戏画面异常精美，每个场景都极具特色。\n游戏手感非常棒，跳跃攻击非常有感觉。（话说兔子的耳朵功能真多）作为一个横版过关游戏，PR在这方面完全合格。\n游戏的搜集要素也非常丰富，大量道具隐藏在游戏场景中，在玩家取得相应能力后，就可以去之前的场景再探索一番。虽然没有等级概念，游戏还是挺耐玩的。\n话说开始那个驾驶直升机的真是乌龟？！怎么看都是只老鹰啊。听说跟兔子是对相爱相杀的冤家，怪不得第一关结束后，你对着乌龟一顿暴打，还能掉个加防御力的龟壳。（笑）\n我是全价入手的，本来想如果游戏不好玩就退款，现在觉得这个游戏值这个价。\n如果喜欢“恶魔城”类型的玩家，推荐入手，不会失望的。\n最后来说个小缺点：地图显示没必要用两下上的操作方法啊（我指的是快速显示，不是进菜单看）完全可以像恶魔城一样，一键显示就好了。现在这个不但不方便，而且因为操作关系，经常在游戏过程中自动显示，阻挡视线。这个设定完全没法理解。\nPS：道具切换按钮如果按住不放，游戏画面会暂停，然后出现道具菜单让你选择。开始不知道按住不放，一个个切换效率非常低（汗。。。", "timestamp_created": 1470743865, "timestamp_updated": 1470767331, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.561753", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24531798": {"recommendationid": "24531798", "author": {"steamid": "76561198002122690", "num_games_owned": 105, "num_reviews": 36, "playtime_forever": 485, "playtime_last_two_weeks": 0, "last_played": 1478154103}, "language": "english", "review": "Quick and dirty: YOU can play this game; it's not nearly as hard as it seems. If you want a Metroidvania in an Order of Ecclesia style (focusing on shorter levels with tigther design over progression systems and exploration), this is it. It feels great to play. There's a lotta room for player expression with subweapon use. Weirdly engaging plot. But it's a bit of a hesitant recommendation. It's definitely worth the normal asking price, though. If you want it, get it whenever.\n\nIts controls are tight, but not corset-tight (particularly, 1) playing with a joystick causes some awkward hiccups; diagonals are interpreted as 2 keyboard keys; this causes issues with reading signs mid-jump or misalligning shots with a certain weapon, 2) the edges of platforms are almost TOO accurate to the architecture, yet your character's \"feet\" for determining collision with the ground are smaller than the sprite's). \n\nThe Metroidvania progression feels reeeeally forced and hoakey. These aren't gimmicks that get you to look at levels in new lights; there are obvious barriers to progress to single, empty rooms with singular power up items. If you try to go back each time you get a progress power-up, you'll be disappointed. Only breaking boxes and double jumping give you new, fun challenges.\n\nThe looser Metroidvania structure also hurts it as an action-platformer. It feels as if checkpoint placement wasn't considered in a non-linear fashion; this is most obvious in Stage 4, where the placement of enemies along slow, elevator-like grapple chains assumes a vertical or downward ascent based on an optimal level route that isn't clear until completion.\n\nThe game can be suddenly punishing (mine cart level, ahoy!), especially with its long GAME OVER screen, but the lack of difficulty makes a game bursting with personality play like a vanilla wafer. There are many mechanics which are interesting but never required or dramatically helpful. You get a massive iinvincibility-frame dash, an aerial attack that pushes you back up slightly in the air, etc.--but there are no segments that force you to use the dash or platforming using this unique mechanic. If anything, their use trivializes much of the stage and boss design. You CAN finesse boss fights, but brute-forcing them is just as effective.\n\nA lot of the bosses have amazing, well thought-out, varied patterns that interact in surprising ways with your arsenal of subweapons... but you can easily just eat 1 carrot per bossfight (makes you invincible for 10+ seconds and ups your attack power), use your i-frame dash to cheese through their attacks that punish you for staying at close range once it wears off, and rush them down. The reward for succesfully figuring out good sub-weapons to use is often not the difference between survival and defeat, but seeing much less of a great boss than it feels you should.\n\nIt's a game that's less than the sum of its parts. But, it's still neat as hell.\n\nThe aesthetics are on point. The music has an emotional breadth while never failing to raise intrigue in cutscenes or keep you pumped up during levels. The sprites are GORGEOUS--please, play this in windowed mode if you can't get this to scale by whole numbers in fullscreen. Some of the use of paralax bakgrounds and varying visual styles among enemies and bakgrounds--it's this wonderful mash of strict depiction and heavy abstraction at once (just see the main character set up against beautiful, lineless backdrops of palm-trees and the ocean's horizon line).\n\nAnd there are some real feats of creative game design--particularly, check out how the machine gun interacts with chokepoints in the environment or how much enemy interaction changes once you consider the claymore in stage 4... but much of it is just an unchallenging, decompressed action platformer that saves its flair for boss fights and laaate game optional rooms, leaving a lot of unimpressive downtime.\n\nOh, and the story?? Is excellent?? Reminds me of when movies took queues from movies but didn't try to be them--it has punchy little asides between action segments to progress the plot with laugh-out-loud dialogue. Unintrusive and compelling.", "timestamp_created": 1469514304, "timestamp_updated": 1469516861, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.562875", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24463485": {"recommendationid": "24463485", "author": {"steamid": "76561198119337654", "num_games_owned": 148, "num_reviews": 20, "playtime_forever": 332, "playtime_last_two_weeks": 0, "last_played": 1469209387}, "language": "english", "review": "Frustrating level design. Not worth the asking price.", "timestamp_created": 1469209444, "timestamp_updated": 1469209444, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.252595", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24288145": {"recommendationid": "24288145", "author": {"steamid": "76561197969984811", "num_games_owned": 324, "num_reviews": 3, "playtime_forever": 696, "playtime_last_two_weeks": 0, "last_played": 1468549048}, "language": "english", "review": "Pharaoh Rebirth is fun to play, it controls well, the art and music are wonderful, the characters are charming, there's a lot of content for the price, especially for completionists... and almost nobody bought it. If you're a fan of Castlevania or similar games, this is a hidden gem worth checking out.", "timestamp_created": 1468381111, "timestamp_updated": 1468381111, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.518982", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24034684": {"recommendationid": "24034684", "author": {"steamid": "76561198044605739", "num_games_owned": 321, "num_reviews": 8, "playtime_forever": 1931, "playtime_last_two_weeks": 0, "last_played": 1495082278}, "language": "english", "review": "This game is absolutely fantastic. The pictures do not do it justice. I absolutely love the characters, the soundtrack, the level replayability, it's all wonderful", "timestamp_created": 1467511997, "timestamp_updated": 1467511997, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.495164", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23917652": {"recommendationid": "23917652", "author": {"steamid": "76561198011792180", "num_games_owned": 293, "num_reviews": 7, "playtime_forever": 532, "playtime_last_two_weeks": 0, "last_played": 1487656262}, "language": "english", "review": "great little hidden gem hasto be the 2nd best game i've played all year a deffenate must buy", "timestamp_created": 1467186276, "timestamp_updated": 1467186276, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.444689", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23808914": {"recommendationid": "23808914", "author": {"steamid": "76561197998844556", "num_games_owned": 899, "num_reviews": 97, "playtime_forever": 305, "playtime_last_two_weeks": 0, "last_played": 1466897041}, "language": "english", "review": "What a great little game! I just beat it in Normal mode and it was a blast. the gameplay is super-intuitive and levels are well designed. Plus, every character is charming. It's not really a Metroidvania since it's built more like a Castlevania: Order of Ecclesia, but you'll still have many secrets to get with your abilities.  And the music is marvelous!", "timestamp_created": 1466897909, "timestamp_updated": 1466897909, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.538699", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23452907": {"recommendationid": "23452907", "author": {"steamid": "76561198047660397", "num_games_owned": 64, "num_reviews": 3, "playtime_forever": 652, "playtime_last_two_weeks": 0, "last_played": 1474404702}, "language": "russian", "review": "Pharaoh Rebirth - замечательный платформер/метроидвания, где игроку предстоит управлять Джонатаном Бэнфилдом - археологом, некогда получившим кроличье обличье из-за наложенного на него проклятия. Волею судьбы он становится свидетелем восстания фараона из мертвых и получает новое проклятие - через семь дней его ждет неминуемая гибель от рук ожившего злодея. Единственный способ избежать этой участи - собрать семь священных граалей, разбросанных по всему Египту - что Джонатан при помощи своего друга и координатора Джека и должен будет сделать.\n\nВ отличие от обычной метроидвании, содержащей один большой непрерывный мир, игра разделена на отдельные уровни, которые игроку и предстоит исследовать в последовательном порядке. Это отнюдь не лишает игры исследовательского духа - каждый уровень достаточно объемен и содержит кучу направлений, в которых можно пойти, а также большое количество тайников с особыми предметами. При этом потеряться на уровне сложно - в распоряжении игрока есть удобная карта, заполняющаяся по мере прохождения и показывающая места, в которых игрок еще не был; к тому же уровни достаточно легко и быстро пробегаются уже со второго визита. Тем не менее, поиск спрятанных предметов все еще требует времени и внимательности, и далеко не каждый из них можно найти с первого или даже со второго раза, поэтому, можно сказать, баланс между удобством и сложностью сохранен. Я, прямо скажем, не такой уж и большой любитель перепроходить уровни ради секретов, но эта игра самой своей эстетикой толкает на поиск сокровищ (Египет же!). \n\nКак в стандартной игре подобного жанра, на протяжении своего похода за граалями герой получит уйму новых способностей и оружия, которые будут помогать ему преодолевать препятствия и открывать новые участки на уровнях. Но не думайте, что ваше путешествие будет однообразным - каждый уровень по-своему индивидуален: где-то придется порешать головоломки (достаточно несложные), где-то - пробираться сквозь едущий поезд, а где-то и самому прокатиться на машине по горным ухабам. В конце каждого уровня нужно будет сразиться с занятным боссом (при повторном прохождении сталкиваться с боссом снова не придется, если только игрок сам того не пожелает). Сложность в игре сбалансированная - это не адская мясорубка, требующая нечеловеческих рефлексов и расправ с тоннами врагов, но и не безмятежная прогулка - в игре присутствуют моменты, в которых нужно быть сосредоточенным и/или быстрым, чтобы избежать смерти. Управление - прекрасное, к нему быстро привыкаешь, и оно никогда не становится причиной проигрыша. \n\nВ сюжете игры, несмотря на незамысловатость, находится место и интригам, и легкому юмору, и мрачным моментам. Персонажи колоритные и запоминающиеся, за их действиями и диалогами довольно интересно наблюдать. По поводу диалогов - их в игре очень много, однако те, кто не желает их читать, могут просто пропустить их нажатием кнопки. Мне всегда отрадно видеть хорошую историю в платформерах, без данного элемента игра бы потеряла в моих глазах часть своего очарования.     \n\nК визуальной и музыкальной частям тоже нет никаких претензий: игра радует детализированным пиксель-артом, яркими красками и плавными анимациями вкупе с динамичным саундтреком, тематически связанным с египетскими мотивами. Надо сказать, игра придерживается своей фишки до конца - все уровни представляют собой разные части Египта (даже если это лишь казино в Лас-Вегасе с египетской тематикой), боссы и некоторые враги являют собой египетские божества, египетские термины и названия часто используются в диалогах. Все вместе это создает довольно уникальный сеттинг.\n\nДаже после прохождения основной сюжетки в игру стоит вернуться ради прохождения бонусных уровней и сбора пропущенных предметов. Одним словом, игра приятно меня удивила и оставила самое благоприятное впечатление - мне кажется, она вполне достойна места рядом с Shantae, Cave Story, Freedom Planet и прочими известными инди-тайтлами подобного рода. Рекомендую Pharaoh Rebirth всем любителям платформеров и метроидваний, вы вряд ли разочаруетесь. \n\n[strike]И не позволяйте мелким грызунам красть у вас золотые слитки.[/strike]", "timestamp_created": 1465397604, "timestamp_updated": 1465397741, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.662984", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23439973": {"recommendationid": "23439973", "author": {"steamid": "76561197981099515", "num_games_owned": 146, "num_reviews": 8, "playtime_forever": 354, "playtime_last_two_weeks": 0, "last_played": 1465332112}, "language": "english", "review": "Very fun game. Good graphics and sound.", "timestamp_created": 1465325746, "timestamp_updated": 1465325746, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.401965", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23235738": {"recommendationid": "23235738", "author": {"steamid": "76561197995487567", "num_games_owned": 101, "num_reviews": 10, "playtime_forever": 437, "playtime_last_two_weeks": 0, "last_played": 1460296599}, "language": "finnish", "review": "Pharaoh Rebirth+ is a great game. It is similar with the good Castlevania games, but it does have style, humor and gameplay of its own too. I really liked that each stage is filled with treasures, and most if not all treasures also give stat boosts or new abilities, so it is worthwhile to go back to older stages and get everything. Bosses are cool too.\n\nHowever, it is a shame that one of the stage is a stinking pile of hot garbage, which prevented me from getting every achievement after beating the game. I would have loved to spend more time with this cool game, but I never want to experience that stage again. Having said that, I can recommend this game to just about anyone. Hopefully there are no auto-scrolling stages in the sequel.", "timestamp_created": 1464362150, "timestamp_updated": 1464362150, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23195713": {"recommendationid": "23195713", "author": {"steamid": "76561197994686280", "num_games_owned": 106, "num_reviews": 17, "playtime_forever": 1099, "playtime_last_two_weeks": 0, "last_played": 1493244440}, "language": "english", "review": "Honestly, I wasn't expecting much when I bought this game. The screenshots and trailer didn't do much for me, but the gifs on the developer's Twitter page (https://twitter.com/krobon) got me interested. The 'behind the scenes' of the game looked so cool! So, based on the quality of those gifs, I bought the game...and I'm SO glad I did. 'Pharaoh Rebirth +' is an exceptionally well made game with a lot of heart. It's also SUPER fun to play. :)\n\nPROS\n---------------------------------------------------------------------\n- Likable and well-written characters. I was surprised how much I cared for the characters in this game. Everyone is just so likable and fleshed out. VERY cute and funny dialogue throughout.\n- Excellent gameplay. The game runs at a smooth 60 FPS and feels very responsive. LOTS of polish in gameplay overall. Very well done.\n- Fun abilities. This is a big one. This is a video game that is not afraid to have fun being a video game. (Following is a minor spoiler) One of the abilities allows you to change your ears into a paper airplane to glide across wide gaps. That right there should tell you everything you need to know. It's silly, it's funny, it's unconventional and it was ALWAYS very fun to play. :)\n- There's a metroidvania element, with abilities allowing you to access areas you couldn't previously. However, it has a level-based structure, instead of one big map. This is actually really cool, since it allowed you to just go back to the level where you remember an element was and explore more in that area.\n- GREAT music. It's so good. The soundtrack is on my computer right now. LOVE the music SO MUCH!! \n- When it was over, I got kinda bummed out since I wanted more to play. That (to me) is always a sign of a great game. I've put 12 hours into the game, beaten it - and still go back quite often to play levels. It's just FUN to play.\n- LOTS of abilities and collectibles. If you like to play with new, interesting abilities and find cool collectibles, you'll love this game. ^_^\n\nCONS\n---------------------------------------------------------------------\n- There are a couple times where the main gameplay is not platforming. Like, they'll have mini-games, puzzles, driving sections and things like that. While I understand that those sections were there to provide variety, they were also my least liked sections of this game. This game EXCELS in platforming, so I just wanted to spend more time doing that. It didn't feel good to get stuck on a section that gameplay-wise didn't have anything to do with the rest of the game. Thankfully, these moments were brief. Just thought I'd mention them here. \n- I hear that this game launched kinda rough in regards to vsync support and things like that. I think the devs have pretty much fixed all those issues. Again, just mentioning it. \n- The analog controls didn't seem to work 100% of the time for me. The devs patched in a deadzone option, but even with it at the max setting, my character still drifts to the left sometimes. Thus, I ended up playing it with the D-Pad (as opposed to the left analog stick) on a wired Xbox 360 controller. That solved the problem.\n\nOVERALL\n---------------------------------------------------------------------\n'Pharaoh Rebirth +' is a fantastic game with a lot of heart. Though there were initially a few technical hangups, the fun of the game overcame those shortcomings and I had a BLAST with this game. SO much fun. Very much looking forward to what the devs work on next! :)\n\nP.S. If you want to see another game that the devs have worked on, you can check out 'Action Mogura'. It's available for free online! :) A bit of warning, though: It's only in Japanese and MUCH more difficult than 'Pharaoh Rebirth +'. I beat it in a few days, though - so it's quite playable. Just letting you know. ^_^\n\nFINAL SCORE\n---------------------------------------------------------------------\n9 out of 10", "timestamp_created": 1464151039, "timestamp_updated": 1464151039, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503311", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23052153": {"recommendationid": "23052153", "author": {"steamid": "76561198025387504", "num_games_owned": 38, "num_reviews": 7, "playtime_forever": 357, "playtime_last_two_weeks": 0, "last_played": 1463561040}, "language": "tchinese", "review": "音樂、美術、動作跟流暢度都無話可說，劇情跟對話都很有趣，steam版附帶額外內容只賣278，不得不說這遊戲打趴Rabi-Ribi十條街。", "timestamp_created": 1463565629, "timestamp_updated": 1463565629, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.454545", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22895165": {"recommendationid": "22895165", "author": {"steamid": "76561198090397967", "num_games_owned": 162, "num_reviews": 8, "playtime_forever": 1270, "playtime_last_two_weeks": 0, "last_played": 1463573304}, "language": "schinese", "review": "游戏很棒。\n优点：\n1.题材和内容都很丰富，涉及的背景也可以看出制作下了很大功夫。\n2.收集要素很多，地图前后期的设置也让游戏很耐玩。\n3.手感好，一个好的手感是这类游戏成功的一半。\n4.音乐虽然称不上惊艳，也可以说衬托氛围，作为一个考古背景的游戏，音乐把环境渲染的很好。\n\n缺点：\n1.有的地方强行堆难度。\n\n7.5/10", "timestamp_created": 1462886459, "timestamp_updated": 1462934944, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "4.995006", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22830506": {"recommendationid": "22830506", "author": {"steamid": "76561198050749286", "num_games_owned": 460, "num_reviews": 6, "playtime_forever": 510, "playtime_last_two_weeks": 0, "last_played": 1462572237}, "language": "english", "review": "Really Really good.\nhttps://www.youtube.com/watch?v=h6YxhDtmhzA", "timestamp_created": 1462557893, "timestamp_updated": 1462557893, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.482098", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22807148": {"recommendationid": "22807148", "author": {"steamid": "76561197997517073", "num_games_owned": 449, "num_reviews": 14, "playtime_forever": 414, "playtime_last_two_weeks": 0, "last_played": 1462257295}, "language": "english", "review": "[i]Pharaoh Rebirth+[/i] is a really cute Castlevania-lite game that's big on setpieces and dialogue rather than exploration. The lead character has great animation, can attack in multiple directions, and moves pretty fast. I found the amount of chatting between the characters was a bit much for me, but I did appreciate how distinct each character felt in the end. I'm not sure a game like this needs lots of banter but it made me laugh a few times and can be skipped if you don't want to bother.\nWhen I call [i]Pharaoh Rebirth+[/i] a \"Castlevania-lite\" I mean it's more like [i]Order of Ecclesia[/i] than [i]Symphony of the Night[/i]. The game occurs over a series of stages rather than one large level. You can replay stages as much as you like, re-fight bosses if you choose, and once you find an item it's yours forever. A lot of collectibles don't do much though, and many stages have dead-end hallways that make exploration less fun than it should be. There's also a \"driving\" stage which is basically a minecart level and a complete waste of time.\nHowever, the lead character is charming and fun to control. The boss battles are exciting. The story never pays off in interesting ways, but the characters have more personality than they normally do in games like this. [i]Pharaoh Rebirth+[/i] is worth playing, though I can't say I enjoyed it enough to bother replaying it to find [b]every[/b] collectible.", "timestamp_created": 1462437382, "timestamp_updated": 1462437382, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.548440", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22788138": {"recommendationid": "22788138", "author": {"steamid": "76561197978078589", "num_games_owned": 803, "num_reviews": 41, "playtime_forever": 2482, "playtime_last_two_weeks": 0, "last_played": 1459368378}, "language": "english", "review": "This game is actually more \"Megaman X\" than the \"Metroidvania\" claims. Stages are stand alone stages you can revisit at any time once you complete them. A fun game either way and a bit challenging on Hard for boss fights until you get some super powered items way later or respond incredibly well (or eat all your carrots).\n\nExploration and finding items among backtracking after you find abilities to find more items is really prevalent in this title. A plus or minus for fans of those.\n\nI only found a few of the lines to be funny from all its quirky dialogue. Some of the music was pretty great, too.\n\nThe driving stage is still kind of a pain, though. For the rest, they seem fun enough. More of a pain for achievements. It's easier by difficulty, though.\n\nAs an ending note, leave at least one of all your food items if you want the collector achievement or you can play through it all again..", "timestamp_created": 1462332641, "timestamp_updated": 1462332641, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.409902", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22784433": {"recommendationid": "22784433", "author": {"steamid": "76561198133743392", "num_games_owned": 5, "num_reviews": 2, "playtime_forever": 3211, "playtime_last_two_weeks": 0, "last_played": 1495370692}, "language": "japanese", "review": "アンドレがかっこよかった", "timestamp_created": 1462310877, "timestamp_updated": 1462310877, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.530298", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22762594": {"recommendationid": "22762594", "author": {"steamid": "76561198037003719", "num_games_owned": 2897, "num_reviews": 306, "playtime_forever": 164, "playtime_last_two_weeks": 0, "last_played": 1462166207}, "language": "tchinese", "review": "探險尋寶一直以來都是萬年不滅的優秀題材，著名電影系列《Indiana Jones》就是六七年級生家喻戶曉的探險尋寶題材始祖，這次要介紹的遊戲《Pharaoh Rebirth+》是由日本獨立遊戲研發者クロボン一人自製的橫向卷軸動作闖關遊戲。本作劇情講述經驗豐富的尋寶獵人〝喬納森〞，在某次冒險旅途被神秘力量詛咒變成兔子的模樣，不過這點小挫折阻止不了他的夢想，一如往常跟著工作夥伴〝傑克〞出發到埃及尋寶，在昔日好友〝安德烈〞阻饒之下，不小心觸發到【餘命七日】詛咒的喬納森與安德烈，為了解除詛咒展開尋求七個聖杯的冒險旅程，然而他們並不知道自己早被神秘的寶藏獵人給盯上。\n\n進入遊戲後，《Pharaoh Rebirth+》帶給筆者的第一印象就是動聽的背景音樂、特別的人物設定、精緻的地圖設計、以及稍嫌彆扭的操作手感，建議玩家準備一隻手把來玩，才會得到較佳的遊戲體驗。本作在掌握動作闖關遊戲的精髓上表現的淋漓盡致，先從音樂談起，第一關埃及古遺跡的音樂給人感覺輕快動聽，就像是踏出第一步的探險者，令初次遊玩的玩家直接被吸引，無法自拔的一路通關；接著是人物設定方面，作者筆下創造出的人物每一位都有其獨特魅力，就以主角喬納森和宿敵安德烈這兩位歡喜冤家來說，表面為了尋找寶藏大打出手，當有共同敵人時又攜手合作，兩人更在探險途中協助對方不少次，根本就是假宿敵真基友的 BL 套路，筆者已經可以聽見腐女們在尖叫了。\n\n\n《Pharaoh Rebirth+》核心玩法就是操縱探險家喬納森，利用頭上那對無所不能的兔耳朵突破難關，從基本的兔耳長鞭攻擊到將兔耳變化成鎖鏈勾住掛鉤移動，通通難不倒他，玩家甚至能在遊戲中期得到道具，將喬納森的雙耳變成乘風飛行的紙飛機，藉由氣流上升飛到平時無法進入的區域。另外遊戲內存在不同功能的次武器，例如射出網球的機關槍、瞬間造成範圍傷害的手榴彈、以及造成全範圍傷害的聖灰等等，每一種需要耗費 MP 魔力值才可以使用，並且部分頭目戰還可以利用特定的次武器輕鬆擊敗它們喔！\n\n既然本作是一款探險尋寶為主題的遊戲，那麼就該有蒐集寶藏的要素存在，玩家可以在探索地圖時發現不少可蒐集道具，有些道具會為喬納森解鎖新技能，例如運動鞋可以讓喬納森獲得衝刺奔跑能力、香水可以降低仇恨值讓敵人不主動攻擊喬納森，當然也有純粹增加攻防數值的強化道具。此項設定算是半強迫玩家要找出散落各地的道具，因為打怪不會掉落任何經驗值，本作也沒有任何角色扮演升級要素存在，如果你不是想挑戰自己在不獲得任何道具破關的玩家，建議多蒐集道具強化自身再去挑戰接下來的難關。\n\n\n不得不說以一人團隊的標準，同時要兼顧優點以及防止缺點發生非常困難，筆者個人認為本作最大缺點就在於操作與難度兩大方面，以初次接觸動作闖關遊戲的新手來說，《Pharaoh Rebirth+》操作手感與難度設定都不太親民，操縱問題主要是跳躍鍵跟次武器切換鍵過於接近，時常會因為按錯按鍵導致不必要的失誤。另一方面儘管玩家選擇 Easy Mode 遊玩也會因為初期未強化的喬納森那薄皮嫩雞的防禦力，被敵人打到三下或是被環境陷阱傷到兩次就會死亡，操作失誤引起的挫折感無疑是造成新手玩家避而遠之的主因之一。\n\n\n《Pharaoh Rebirth+》就像是隱藏在尼羅河底下發出微光的珍貴寶石，價值很高卻低調到不行，要不是透過友人大力推薦，筆者可能一輩子不會發現如此優秀的獨立製作遊戲，核心玩法追根究柢還是融合《Castle Vania 惡魔城》、《Metroid 銀河戰士》兩部作品的【Metroidvania 類銀河戰士惡魔城】，不過除去角色扮演元素讓遊戲本身更注重於動作闖關遊戲該有技術層面，也算是跟上面兩款老前輩作品出區隔。總而言之，本作絕對是一款精緻程度名列前茅的獨立製作遊戲，極力推薦給熱愛動作闖關遊戲的玩家族群！\n\n\n優點：\n+動聽的背景音樂，每首樂曲都跟關卡完美結合，讓人感到身歷其境。\n+充滿魅力的人物設定，紳士探險家、傲嬌假宿敵、眼鏡科技宅等應有盡有。\n+以不突兀的方式融入探險尋寶玩法，蒐集散落四處的古物強化主角能力。\n+關卡設計錯綜複雜，故事劇情耐人尋味，絕對能滿足 Metroidvania 愛好者。\n\n\n缺點：\n-操作方面需要時間習慣，玩家容易造成不必要的失誤，極度推薦準備手把。\n\n\n結論：未被發掘的珍貴寶石，如果有強化宣傳效果一定是話題性十足的作品。\n\n\n網誌圖文好讀版：\nhttp://mgrim214.blogspot.tw/2016/05/pharaoh-rebirth.html\n", "timestamp_created": 1462200242, "timestamp_updated": 1462200242, "voted_up": true, "votes_up": 25, "votes_funny": 1, "weighted_vote_score": "0.720445", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22589345": {"recommendationid": "22589345", "author": {"steamid": "76561198024382709", "num_games_owned": 541, "num_reviews": 21, "playtime_forever": 964, "playtime_last_two_weeks": 0, "last_played": 1490899875}, "language": "english", "review": "A fantastic metroidvania game with a great soundtrack and proper 16 bit graphics.", "timestamp_created": 1461423217, "timestamp_updated": 1461423217, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.410449", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22539385": {"recommendationid": "22539385", "author": {"steamid": "76561198019292629", "num_games_owned": 216, "num_reviews": 6, "playtime_forever": 543, "playtime_last_two_weeks": 0, "last_played": 1463124575}, "language": "english", "review": "totally great game.  really high production, great mechanics, endearing characters.  reminds me a lot of cave story.  feel like it was a little on the easy side but still an incredibly enjoyable experience.", "timestamp_created": 1461182295, "timestamp_updated": 1461182295, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.471802", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22490253": {"recommendationid": "22490253", "author": {"steamid": "76561198297239442", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 560, "playtime_last_two_weeks": 0, "last_played": 1466542178}, "language": "tchinese", "review": "遊戲中可選擇日英兩種語言 當成小品遊戲還算不錯\n但是難度一開始決定後就不能改變了 選到HARD可能會開始摔手把也說不定\n\n可惜的是遊戲紀錄格似乎只有一格 要看英文版的對話可能只能delete之前的紀錄\n\n遊戲除了成就以外 也有不包含在成就裡面的秘密房間\n推薦給喜歡收集寶物跟探索的人:)\n\n該作者之前還有做其他的動作遊戲 名字是アクションモグラ 有興趣的人可以找找", "timestamp_created": 1460939896, "timestamp_updated": 1460939896, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22475918": {"recommendationid": "22475918", "author": {"steamid": "76561198074771219", "num_games_owned": 166, "num_reviews": 45, "playtime_forever": 898, "playtime_last_two_weeks": 0, "last_played": 1469631836}, "language": "english", "review": "Quite a fine game and probably the best metroidvania I've played recently.\nGorgeous pixel graphics, kickass soundtrack, several interesting and useful abilities, nice characters, plot that involves real-life subjects but never takes itself too seriously, and the length and overall difficulty are just right. The bonus stage is a great addition as well (and the ending when you finish that one is hilarious!).\nThe only thing I didn't like was the annoying car sequence that goes on for far too long and can't be skipped when you want to replay that stage.\n8/10, well done Krobon!", "timestamp_created": 1460894595, "timestamp_updated": 1461333818, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22434737": {"recommendationid": "22434737", "author": {"steamid": "76561197966275874", "num_games_owned": 331, "num_reviews": 51, "playtime_forever": 23, "playtime_last_two_weeks": 0, "last_played": 1460136726}, "language": "english", "review": "This game is extremely well done and hugely underrated.", "timestamp_created": 1460747554, "timestamp_updated": 1460747554, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22414390": {"recommendationid": "22414390", "author": {"steamid": "76561197989835265", "num_games_owned": 107, "num_reviews": 8, "playtime_forever": 2779, "playtime_last_two_weeks": 0, "last_played": 1464015279}, "language": "english", "review": "Edit: http://steamcommunity.com/app/441280/discussions/0/36854258586204257 I have encountered an as of now rare glitch that effectively froze my save file for good. I still stand by everything I said in my review about the game itself, but this REALLY needs to be fixed. I recommend backing up your saves in case something bad happens (especially do this at the start of the Cairo level), nonetheless, a; big problem to take note of. I suspect it happens specifically for that specific boss because it's not a battle that you can spawn out later; it may also happen to other non-\"Guardian\" bosses that don't re-spawn. So just to be safe, occasionally back-up your saves and/or try to beat bosses instantly once you come across them. I'm conflicted because this is a fantastic game everyone should experience but something really awkward happened while I was playing it. Just... keep your save file safe, and if something similar DOES happen to you too please report it ASAP.\n\n===Original unedited review===\n\nKrobon, a depressingly little-known Japanese indie developer, along with composer Pepo and illustrator Doromizu, made one of the finest indie games I've ever played: treasure-hunting, exploratory platform game with the showmanship and over-the-top, inventive craziness of the best arcade games. Before I continue praising this game though, I'll have to make a little side-note: those expecting the interconnected worlds of traditional \"Metroidvanias\" might be disappointed: this game features a more streamlined, stage-based layout. Don't mistake \"streamlining\" for \"hand-holding\", though; all the hidden passages and invisible walls are for you to discover; the enemies and platforming for you to defeat, as they can and will kill you if you're not paying attention or using your skills effectively (on that note I recommend playing on Hard mode for the best experience). Krobon offers us some absolutely out-there scenarios presented in a suitably exaggerated way, including (I'll try to make this as non-spoilerish as possible by not giving away the context, though feel free to skip the paragraph if you're bothered by even the most minor of spoilers) **********dodging lasers from outer-space while using a Jojo's Bizarre Adventure-like Stand to beat up crazed Egyptian hotel employees. And you can also get drunk off your ass while doing so.***********. Yes, that is a thing that happens.\n\nThe gameplay is pretty much as good as this type of game gets; the controls are spotless, the difficulty curve is near-perfect (maybe the first Guardian boss is a LITTLE too hard given what came before, but that's a massive nitpick), the levels are well-designed and nicely varied... and perhaps best of all, the game doesn't let you ruin its challenge by allowing you to mindlessly grind. The ONLY way to build your stats in this game is by exploring the levels and finding hidden items, which is perfect for the tone of the game. The unlocking of skills and thus areas that were inaccessible in the past is gradual, yet just fast enough to make you feel like you're constantly making progress and getting stronger as you go along on your epic adventure. To avoid any hassle, though, I recommend screencapping the mini-map whenever you uncover a dead end that requires a later skill; or, if you're THAT type of player, drawing your own map using pencil and paper. Some might take issue with the car-driving stage and the somewhat trial-and-error way of collecting all the treasure by making blind jumps. Another minor gripe is the lack of a fast-travel system, which I personally would have liked; but, much like this game's other flaws, it is just that: a minor gripe that shouldn't keep you from playing this game (after all, the stage-based setup is kind of like a fast travel system of its own and the levels become easier to navigate as you unlock more skills). Another such minor gripe includes the lack of specific sliders for music and sound; there's just a simple sound volume slider and that's it.\n\nNarratively, Rebirth does a great job for what it is; the dialogue never felt like it was wasting my time, and if YOU feel like it's wasting yours, you can always skip pretty much every cutscene, even if you haven't gone through it before. I don't recommend it, though; the presentation as a whole actually makes you feel like you're really an archeologist, exploring every nook and cranny of a strange yet often surprisingly serious cartoon world. In fact, the juxtaposition of comedic shenanigans with dramatic moments and even little nuggets of brief yet oddly-fitting sociopolitical commentary make the writing a huge treat, somewhat comparable to an Osamu Tezuka story. The translators also did a great job at making the dialogue have a natural flow to it, which is great because the character interaction is charming and often genuinely funny. The Egyptian atmosphere is nicely complemented by Pepo's tunes, which succeed at giving the game a dynamic action-adventure feeling.\n\nGraphically, Pharaoh Rebirth would have been impressive even if it came from a team of hard-working sprite artists. However, if Krobon's own Twitter account is any indication, he's responsible for absolutely every bit of pixel art and animation in the game, with Doromizu only having the job of drawing the non-pixelated character art and portraits. As someone who's obsessively into animation, this is particularly impressive to me because this is one of *THOSE* 2D sprite-based games; the kind that, instead of simply doing its job to serve the gameplay, genuinely takes into account the principles of animation to make controlling your character and fighting enemies feel particularly lively. It's not quite on the level of games like Metal Slug 3 or Super Tempo in terms of feeling like you're playing a wonderfully made cartoon (the use of color could use some work, for example), but it's still pretty up there and Krobon is a very high-level sprite artist. The animation and believable physics (shooting tennis balls underwater makes them float to the top!) makes navigating the levels and fighting enemies feel fluid and fun.\n\nThe fact that this game has been out for so long while not being covered at all by the gaming press shows just how little hard work and clever, well-executed ideas matter in the anglosphere's indie gaming scene. Along with Krobon's inability to make connections with indie-clique darlings and journos comes the dreary number of only TWO Metacritic reviews of this game. This unfairness is why I only now decided to point out that there is a shareware, untranslated version of the game out there. Beyond the English script, it lacks the extra stage of the Steam version along with the difficulty settings (and likely other stuff; I only played a tiny bit of the shareware version), but I chose to buy this primarily to support an extremely talented underdog developer who put loads of love, care and effort into creating a charming little adventure that should not be forgotten.\n\nAlso, a little hint: there's an item you can ONLY get from right after the first boss battle by doing a specific thing over and over again. Otherwise, say goodbye to 100% completion.\n\n===Edit upon completion===\n\nIf you spend a lot of time exploring, you might end up too powerful and the end bosses will be too easy. In order to avoid this, I recommend completing the game and THEN going out of your way to treasure-hunt.", "timestamp_created": 1460658852, "timestamp_updated": 1462791362, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.667551", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22294349": {"recommendationid": "22294349", "author": {"steamid": "76561198074900984", "num_games_owned": 374, "num_reviews": 23, "playtime_forever": 585, "playtime_last_two_weeks": 0, "last_played": 1514548663}, "language": "koreana", "review": "bgm 좋음, 스토리 나쁘지 않은데 딱히 신경쓰지 않아도 됨, 난이도는 보스 패턴 몇번만 봐두면 쉬움\n괜찮은 플랫포머 게임", "timestamp_created": 1460082972, "timestamp_updated": 1480423417, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22281969": {"recommendationid": "22281969", "author": {"steamid": "76561198143363880", "num_games_owned": 7, "num_reviews": 1, "playtime_forever": 88, "playtime_last_two_weeks": 0, "last_played": 1478812762}, "language": "french", "review": "Great Games !!! THX for this marvellous adventure", "timestamp_created": 1460021801, "timestamp_updated": 1460021801, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.494350", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22245159": {"recommendationid": "22245159", "author": {"steamid": "76561198095404968", "num_games_owned": 353, "num_reviews": 204, "playtime_forever": 305, "playtime_last_two_weeks": 0, "last_played": 1460122652}, "language": "english", "review": "It's the metroidvania I always wanted to succeed Castlevania Symphony of the Night! Fluid controls, simple combat, puzzles, a healthy mix of exploration and platforming, fun-to-fight bosses, great music and smooth graphics, and a simple system of item collection and weaponry that manages to avoid being too simple and too complex, and one really supportive run-on sentence. And jumping back into the action after a Game Over is as fast as a snap. And it doesn't take much CPU, RAM or hard disk space! In fact, I could probably run this on a Windows XP with an integrated graphics card! So efficient.", "timestamp_created": 1459816656, "timestamp_updated": 1459816925, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22205545": {"recommendationid": "22205545", "author": {"steamid": "76561197965615203", "num_games_owned": 2002, "num_reviews": 166, "playtime_forever": 528, "playtime_last_two_weeks": 0, "last_played": 1459630816}, "language": "english", "review": "A pretty cool game for all metroidvania lovers. A lot of love was put into it, and it has plenty of surprises around every corner.\n\nMust play if you like these types of games.", "timestamp_created": 1459631010, "timestamp_updated": 1459631010, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.486376", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22191061": {"recommendationid": "22191061", "author": {"steamid": "76561198012717466", "num_games_owned": 1324, "num_reviews": 13, "playtime_forever": 797, "playtime_last_two_weeks": 0, "last_played": 1482692105}, "language": "english", "review": "Just an overall great game that any fan of Metroidvanias should own.  Pharaoh Rebirth has some fantastic spritework, great animations, and some great and catchy music.  I was actually quite surprised by the fun selection of subweapons in the game too, they're pretty diverse and aren't really like your standard Castlevania subweapons. The developers of this game very clearly liked Order of Ecclesia as you can see some clear callbacks and inspiration, for example instead of being a standard Metroidvania that takes place in one huge map the game actually has seperate levels to choose from that each has their own map.\n\nHell I'm surprised a game this good is priced at $10, I'd gladly shell out $20 or more for games of this quality.\n\nThe only real downside I'd say about this game is that personally towards the last half of the game the bosses take a dip in difficulty, especially if you were exploring properly and find a number of attack/defense boosting relics.", "timestamp_created": 1459574760, "timestamp_updated": 1459574760, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22159030": {"recommendationid": "22159030", "author": {"steamid": "76561198011090316", "num_games_owned": 400, "num_reviews": 42, "playtime_forever": 1190, "playtime_last_two_weeks": 0, "last_played": 1481531949}, "language": "english", "review": "amazing graphics and animation, excellent controls, tight and creative gameplay, stellar writing and localization, and the soundtrack is dope as hell.\n\nbuy this game and join me in a prayer for more", "timestamp_created": 1459426600, "timestamp_updated": 1459426600, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "4.980100", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22154966": {"recommendationid": "22154966", "author": {"steamid": "76561197978705200", "num_games_owned": 1545, "num_reviews": 247, "playtime_forever": 377, "playtime_last_two_weeks": 0, "last_played": 1459401371}, "language": "english", "review": "Honestly, it's taken me more than a few days to write something significant about [i]Pharaoh Rebirth+[/i]. It's not enough for me to say that this is a really good game, and that it's a hidden gem well-deserving of your time. I have to write something that goes above and beyond, so that you come away thinking \"Wow! This is serious! I must play this game immediately!\" This is the difficulty I've run into when writing about games that are really impressive. Aside from having a mediocre vocabulary, I'm too used to discussing what's wrong with games, to really explain what's right with them.\n\nFor example, let's start with the controls. When the controls are thoroughly solid, then there's actually nothing to discuss. In this game, moving the anthropomorphic rabbit around is as natural and easy as turning one's palm. The controls are so good, that you won't notice them. They're like an extension of yourself. As the game progresses, Jonathan (the rabbit) acquires new moves and abilities, and the experience continues to be perfectly seamless. Another aspect that goes un-noticed when it's handled properly is the mechanics. The hit-boxes are great, the game doesn't try your patience with cheap hits, and nothing stands out... poorly. \n\nOft-times with Metroidvanias, there's only so much of an incentive to explore. [i]Pharaoh Rebirth+[/i] strikes a good middle-ground with its plethora of collectible treasures. What makes exploration interesting is that not all of the items are helpful. Some exist solely to fill slots in your collection screen, while others can boost stats or award hidden skills. This adds another layer of mystery to the adventure. Every time you discover a hidden artifact, you gain a sense of anticipation. Whereas in most other similarly-designed games, all you have to look forward to is another heart container, or a slightly larger box to hold more daffodils. When you fight enemies in that other game, are you even using the daffodils? It's a completely meaningless collectible. \n\nThe sub-weapons in this game are not only fun to use, but they're also very helpful. While Jonathan's ears are just as deadly as any whip, the sub-weapons allow you to approach situations and bosses in different ways. Some of them can have other uses as well. There's a certain point very late in the game where you're faced with a spike pit. Over this pit is a floor, but most of the sections are false, and you'll fall to your death if you attempt to cross. The first weapon you obtain is a machine-gun... that fires tennis balls. As they bounce across the ground, they'll helpfully point out which sections of the floor are false, so you can safely pass. It reminds me of [i]Megaman 2[/i].\n\nThese days, it seems like every indie title references classic games from the distant past. Thankfully, [i]Pharaoh Rebirth+[/i] sets itself apart by implementing its references in a clever manner. As far as I can tell, the least subtle reference is one of the characters having the name Belmondo. Just from playing through the game, the Konami influences are pretty clear, but you're not going to get hit over the head with them. It also helps that the character-designs are charming and have their own unique look. The soundtrack is thoroughly fantastic as well.\n\nFor the most part, the level-design is superb. Since every stage is self-contained, there isn't a need to make sure that each location connects to the others. The stages are well-designed, so that the first play-through is sufficiently enthralling. Also, you're welcome to repeat stages to find all of the hidden treasures. In many cases this is required, since the double-jump isn't available until towards the end. When repeating a previously-cleared stage, the pacing is speedy, and you can even take advantage of a few shortcuts.\n\nBut you're probably wondering what I meant when I wrote \"For the most part\". Well, this game has a vehicle-section. In stage 4, you have to drive a jeep. Actually, you don't drive it so much as time jumps to avoid plummeting to your death. To start things off with a positive I can say this much: It could've been a lot worse. There are visual and audio warnings when a jump is coming, and there are four checkpoints, which is pretty generous for a section that should take less than four minutes. \n\nStill, \"driving the jeep\" in [i]Pharaoh Rebirth+[/i] is a textbook example of everything that's wrong with vehicle-sections. Several years ago, I actually wrote an opinion-piece on the subject. Looking back at it now, \"driving the jeep\" covers all of the bases. I played through this game on the normal level of difficulty, and I died more times on the jeep than anywhere else in the game. A sizable number of these deaths can also be attributed to the annoyingly-placed treasures throughout the stage. Also, If I want to 100% complete the game and get all of the achievements, I have to perfect my driving skills. To that I say: No thanks. All that said, the vehicle-section in this game isn't terrible, and it probably won't grind everything to a screeching halt, but I would have gladly traded this section away for a fully-featured stage.\n\nThe only other complaint I have is that you can only have one save-game at a time. I suppose this could be worked around by moving the old save-file to a different folder. I'll have to give it a shot sometime, because I'm really curious about the hard difficulty-setting.\n\nAside from an unfortunate vehicle-section, [i]Pharaoh Rebirth+[/i] is a superb game. It's a reminder that yes, even today there are great 16-bit/32-bit inspired action-platformers getting released. It's a shame I couldn't come up with anything significant to say though. What can I say? Even when I recognize quality, it's tough to put together the words that do it justice.\n\n[i]Disclaimer: For the purpose of this review, a key was provided by the publisher.[/i]\n\n[i]If you liked this review or want to see more recommended games, be sure to follow our curator group: [url=http://steamcommunity.com/groups/Original_Curators_Group#curation]Follow Original Curator Group[/url][/i]", "timestamp_created": 1459402011, "timestamp_updated": 1459454316, "voted_up": true, "votes_up": 67, "votes_funny": 1, "weighted_vote_score": "0.815327", "comment_count": "12", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22132675": {"recommendationid": "22132675", "author": {"steamid": "76561198006449608", "num_games_owned": 78, "num_reviews": 1, "playtime_forever": 452, "playtime_last_two_weeks": 0, "last_played": 1459911295}, "language": "english", "review": "about 50% finish right now. its pretty good so far but the controls do lag behind a bit. also a warning for the new buyers that want to play the game. configure your controls, the defaut is spelunky", "timestamp_created": 1459292663, "timestamp_updated": 1459292663, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22113994": {"recommendationid": "22113994", "author": {"steamid": "76561198008498140", "num_games_owned": 157, "num_reviews": 8, "playtime_forever": 8922, "playtime_last_two_weeks": 0, "last_played": 1480188570}, "language": "english", "review": "You play as a cute bunni :3", "timestamp_created": 1459204994, "timestamp_updated": 1459204994, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.437666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22113089": {"recommendationid": "22113089", "author": {"steamid": "76561197996138858", "num_games_owned": 392, "num_reviews": 14, "playtime_forever": 165, "playtime_last_two_weeks": 0, "last_played": 1459201082}, "language": "english", "review": "Great game, i love it, not a TRUE metroidvania, but got a lot of similarity with the items you find.\nHope we ll get more and more game from japan localized in english like this one :)", "timestamp_created": 1459201301, "timestamp_updated": 1459201301, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22110263": {"recommendationid": "22110263", "author": {"steamid": "76561198073088368", "num_games_owned": 369, "num_reviews": 92, "playtime_forever": 258, "playtime_last_two_weeks": 0, "last_played": 1509324376}, "language": "english", "review": "I just finished this game and I have a lot to say abot this game. First of all the music in this game is surperb and keeps you interested in navigating your way around the areas. The boss fights even though they are somewhat challenging are fun to fight against, and the controls are superb with the platforming and moving around. \n\nIf you are a platforming fan or you just like to collect a lot of items I highly recommend this game. It's one that is hard to put down once you start playing.", "timestamp_created": 1459190977, "timestamp_updated": 1459190977, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "4.975124", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22098687": {"recommendationid": "22098687", "author": {"steamid": "76561197961312181", "num_games_owned": 558, "num_reviews": 149, "playtime_forever": 661, "playtime_last_two_weeks": 0, "last_played": 1459210844}, "language": "english", "review": "Not a Metroidvania.  Has elements, but just stage based with power ups that require you to replay stages.  More puzzle platformer.\n\nGame has blind instant death jumps, and then also combines this with an autoscroller.\n\nCannot possibly recommend.", "timestamp_created": 1459141296, "timestamp_updated": 1459141296, "voted_up": false, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.291661", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22077744": {"recommendationid": "22077744", "author": {"steamid": "76561197968210518", "num_games_owned": 235, "num_reviews": 1, "playtime_forever": 847, "playtime_last_two_weeks": 0, "last_played": 1481581479}, "language": "english", "review": "BUY THIS GAME NOW-  An open ended love letter to the early 90's 16 bit era, Sega and metroidvania- So many cool nods to the past and level design i didnt think still existed- Krobon Station- Thankyou so much-You Kick Ass! Please continue to make games of this calibre, it was such a breathe of fresh air!\nIf you grew up in the 80's and 90's with the flood of quality Japanese made games this is a proper hit of nostalgia and is the most refreshing new game ive played in years\n\nSo if like me you tire or the same rehashed tripe that has been released  and re-released over the last few years games like this give us a glimmer of hope!", "timestamp_created": 1459054333, "timestamp_updated": 1459054333, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22057698": {"recommendationid": "22057698", "author": {"steamid": "76561198292200016", "num_games_owned": 22, "num_reviews": 1, "playtime_forever": 534, "playtime_last_two_weeks": 0, "last_played": 1460464017}, "language": "japanese", "review": "細部にまでこだわる美麗なドット絵、ビジュアルもさることながら、ステージの雰囲気に合った様々なギミックやアクションが出てきて楽しいです。\n物語を進めていくうちに新しいアクションがどんどん増えていき、探索の幅が広がっていきゲームを飽きさせません。\n隠れたアイテムを探すコレクション要素もあり、やりこむ人も楽しめると思います。\nまた、魅力的なキャラクター達が物語をおもしろ可笑しく盛り上げてくれます。", "timestamp_created": 1458974640, "timestamp_updated": 1458974640, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.502281", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22055208": {"recommendationid": "22055208", "author": {"steamid": "76561198285494722", "num_games_owned": 335, "num_reviews": 3, "playtime_forever": 406, "playtime_last_two_weeks": 0, "last_played": 1458654684}, "language": "schinese", "review": "不知道还有没有人记得十多年前有一款国内称为老头版恶魔城的游戏，现在的这款法老重生就是那游戏的续作（虽然画风变化巨大）。不管是关卡还是BGM都很有恶魔城风向喜欢恶魔城类型游戏的玩家强烈推荐！", "timestamp_created": 1458960500, "timestamp_updated": 1458960500, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22039767": {"recommendationid": "22039767", "author": {"steamid": "76561198010360964", "num_games_owned": 423, "num_reviews": 25, "playtime_forever": 365, "playtime_last_two_weeks": 0, "last_played": 1458902910}, "language": "english", "review": "Out of all the rabbit-themed metroid-inspired games on Steam this is the best one.", "timestamp_created": 1458903268, "timestamp_updated": 1458903268, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.331692", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22036119": {"recommendationid": "22036119", "author": {"steamid": "76561197988189100", "num_games_owned": 296, "num_reviews": 7, "playtime_forever": 1990, "playtime_last_two_weeks": 0, "last_played": 1480823612}, "language": "english", "review": "Took a chance and bought the game without any prior knowledge when I saw the release sale. I'm glad I picked it up, and it's been one of my favorite games this year! This is a very tight action platformer, with plenty of depth in it's exploration and combat. There's been a lot of love put into this game and it really shows.", "timestamp_created": 1458883010, "timestamp_updated": 1459205100, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22018131": {"recommendationid": "22018131", "author": {"steamid": "76561198028187979", "num_games_owned": 220, "num_reviews": 8, "playtime_forever": 1329, "playtime_last_two_weeks": 32, "last_played": 1515478311}, "language": "english", "review": "i absolutly love this game, challenging and funny.", "timestamp_created": 1458803127, "timestamp_updated": 1458803127, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.455397", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22014724": {"recommendationid": "22014724", "author": {"steamid": "76561197980322617", "num_games_owned": 372, "num_reviews": 2, "playtime_forever": 768, "playtime_last_two_weeks": 0, "last_played": 1458606528}, "language": "english", "review": "Solid platformer, great soundtrack, lots of item collecting and secret searching, and a fun sense of humor. Must-play for Metroidvania fans.", "timestamp_created": 1458780356, "timestamp_updated": 1458780356, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22013853": {"recommendationid": "22013853", "author": {"steamid": "76561198001513483", "num_games_owned": 266, "num_reviews": 9, "playtime_forever": 753, "playtime_last_two_weeks": 0, "last_played": 1459715577}, "language": "english", "review": "Humorous writing, diverse level design with creative themes in both enemies and bosses, responsive controls, and cute characters makes this one of the best metroidvania platformers I've played in a while. \n\nFeatures a wide range of usable attacks, stat boosts, and easter eggs hidden throughout areas sometimes only accessible with later powers, which makes replaying stages actually fun.\n\nCombat moves are easy to combo with and bosses/enemies all have their own style of attacks. Gets quite difficult in some segments, but rarely unfairly so. Currently have had no bugs or any trouble detecting my 360 controller (haven't tried D-input controllers), only downside for me would be the lack of higher resolution options, otherwise it still looks really charming.", "timestamp_created": 1458775951, "timestamp_updated": 1458776243, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "4.980100", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21996190": {"recommendationid": "21996190", "author": {"steamid": "76561197980716978", "num_games_owned": 348, "num_reviews": 3, "playtime_forever": 431, "playtime_last_two_weeks": 0, "last_played": 1458710675}, "language": "english", "review": "Surprisingly solid platformer with some interesting mechanics. A good, if not-exactly-groundbreaking, story told with competence keeps this game moving forward. Aside from the vehicle sequence towards the end, the game is exceptionally well crafted with plenty of little things to keep you wanting more. I actually feel tempted to go back through and 100% the game, which is something I don't do outside of Nintendo's most well-crafted experiences. Kudos to the team behind Pharaoh Rebirth on a job well done!\n\nI'd more than happily recommend this to anyone looking for a skill-based platformer, and if there are more games in this series, I will be buying them as soon as I can.", "timestamp_created": 1458711133, "timestamp_updated": 1458711133, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500208", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21964325": {"recommendationid": "21964325", "author": {"steamid": "76561198026285018", "num_games_owned": 232, "num_reviews": 41, "playtime_forever": 420, "playtime_last_two_weeks": 0, "last_played": 1458361353}, "language": "english", "review": "It's a decent metroidvania even though the map is broken apart into stages instead of one large map.  The controls are well done and there is a massive amount of hidden collectable items to find.  The story features a cast of funny characters and sort of has that Cave Story vibe to it.  I played the game on normal and found the bosses to be a bit too easy for my tastes, as I was able to brute force a lot of them down with mashing and a certain sub-weapon.  I'd recommend playing on hard right out of the gate if I were to play it again.  Overall though it's a pretty solid game with memorable characters and moments that will probably make you laugh a few times.", "timestamp_created": 1458569962, "timestamp_updated": 1458569962, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.551208", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21948367": {"recommendationid": "21948367", "author": {"steamid": "76561197984741195", "num_games_owned": 2121, "num_reviews": 4, "playtime_forever": 1185, "playtime_last_two_weeks": 0, "last_played": 1460524798}, "language": "english", "review": "[h1]What's this?[/h1]\n\nPharaoh Rebirth+ takes the classic Japanese action/platform games from the 16/32-bit era and adds a \"metroidvania\" flair to it.\n\nThe player takes control of Jonathan Banfield, an archaeologist that was cursed and turned into a silly rabbit.\n\nI stumbled upon this game just a few weeks before release and I was baffled by the overall lack of publicity and awareness of its existence. It's really a shame because there's so much care put into this work that might get overshadowed by tons of pointless \"retro\" platformers which come out every day.\n\n[h1]Gameplay[/h1]\n\nMechanics-wise, the game is pretty solid. There are various moves that can be executed from the start and others to be unlocked. Overall, combat works as intended and every enemy or boss has a dinstinct pattern that often intersects nicely with the level layouts.\n\nPlayer progression is not based on elements borrowed from RPG's like experience points or equipment, but instead rewards exploring and collecting the different, unique treasures scattered through the ruins and temples of Egypt.\n\nInstead of presenting itself with one, massive area that blocks your progress whenever you don't possess the right ability to get through, the game has a standard, stage-based structure. This helps in limiting both the backtracking factor and the typical \"fake sense of freedom\" of the genre.\n\nI found the level design to be quite clever, as it encourages exploration by showing the player unaccessible routes right from the start, but never requires to backtrack to a previous stage to get to the next. This means freedom of choosing  to get on with the story OR to go back and replay a chapter to get all the extra stuff which could come in handy, without being forced to revisit some old areas to get a mandatory powerup.\n\nThe classic stage-based structure also makes it easier to carry out more action-oriented set pieces, like a helicopter pursuit or a mine car ride.\n\n[h1]Art Direction[/h1]\n\nTechnically speaking, Pharaoh Rebirth+ looks and sounds great. The high-res (640x480) nicely crafted and animated pixel art is matched by an upbeat, memorable soundrack which features an obvious Egyptian vibe. However, digitally painted character portraits that show up during radio chatter fall a bit short, as they look detached from the overall style and don't really match its quality.\n\nI recommend playing the game using its original 4:3 ratio, as stretching 2D art is a crime, especially when it's done so well.\n\n[h1]Technical Issues[/h1]\n\nAs of today, screen resolution selection and VSync have been fixed, so I don't have anything else to report at this time.\n\n[h1]So, should I play it?[/h1]\n\nYES, you should. If you love action platformers, the metroidvania genre or just appreciate tightly designed games.", "timestamp_created": 1458491064, "timestamp_updated": 1479972033, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.605482", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21943757": {"recommendationid": "21943757", "author": {"steamid": "76561198010424891", "num_games_owned": 1002, "num_reviews": 39, "playtime_forever": 29, "playtime_last_two_weeks": 0, "last_played": 1458693232}, "language": "english", "review": "*Update: Developer listened to feedback and added v-sync. Now the game looks great and I've changed my review to a recommend.\n\n\nThis game seems very well-made and fun so far. I would love to be able to recommend it to people. Unfortunately, there are two things that are currently preventing me from doing that.\n\n1) There is only one resolution option: 640*480. That's it. Not really sure what that's about. They should have given us two or three different options at the very least. One seems pretty ridiculous. Especially one that small.\n\n2) There is no apparent way to enable v-sync. The resolution problem I could actually live with. No v-sync? That's a deal-breaker. All that horrible screen tearing makes this lovingly-crafted, beautiful game look nothing short of atrocious.\n\nI'm hoping the developer can resolve these issues with a future update. Just like the screen is when I try to play this game, I myself am torn. I want to recommend it. But until they give us v-sync (and maybe some other resolution options), I just can't.", "timestamp_created": 1458475826, "timestamp_updated": 1458693516, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21942372": {"recommendationid": "21942372", "author": {"steamid": "76561198175250529", "num_games_owned": 140, "num_reviews": 5, "playtime_forever": 523, "playtime_last_two_weeks": 0, "last_played": 1488079544}, "language": "schinese", "review": "非常好玩,乌龟与兔子之间相爱相杀的故事。\n兔子设定类似泰迪熊，可爱的外表加上大叔的性格，外加印第安琼斯。\n操作流畅，关卡设计也有不错的探索性。\n剧情有八关，通关之后还有两个额外关卡，目前还没有玩。\n总之这游戏超值，绝对是一次难忘的冒险。", "timestamp_created": 1458470547, "timestamp_updated": 1458470547, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.565217", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21940002": {"recommendationid": "21940002", "author": {"steamid": "76561198027904750", "num_games_owned": 810, "num_reviews": 22, "playtime_forever": 422, "playtime_last_two_weeks": 0, "last_played": 1458546071}, "language": "english", "review": "A fun and enjoyable little platformer.... except for the Sinai Mines level. The developer should be taken outside and flogged with chains for a vehicle platforming section followed by a railshooter followed by another, harder vehicle platforming section, all on the same healthbar WITH NO SAVE POINTS.", "timestamp_created": 1458459731, "timestamp_updated": 1458459731, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21911075": {"recommendationid": "21911075", "author": {"steamid": "76561198092573192", "num_games_owned": 400, "num_reviews": 23, "playtime_forever": 365, "playtime_last_two_weeks": 0, "last_played": 1458483295}, "language": "english", "review": "a 2D psx japanese style platformer game\nits been a wail since i played one of those\n\nit took me 6 hours to beat\nthe game is a mix of castlevenia/megaman/metroid and very close to the resamblance of Klonoa\njust like castlevenia after you get a helpful abilitys you will have to replay the brevious stages just to look for hidden walls soo you can collact more helpful items that will make you stronger\n\n\nthe music is really really superb\nand the artstyle is mixed between japanese arcade style\nand psx 2D sprites\n\nif your a fan of platformers \ni highly recomand this appeared out of nowhere gem", "timestamp_created": 1458338116, "timestamp_updated": 1458338318, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.395105", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21910766": {"recommendationid": "21910766", "author": {"steamid": "76561197993168886", "num_games_owned": 255, "num_reviews": 3, "playtime_forever": 442, "playtime_last_two_weeks": 0, "last_played": 1458406558}, "language": "english", "review": "You play a rabbit and the dash have i-frames.", "timestamp_created": 1458336965, "timestamp_updated": 1458336965, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.448755", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21907531": {"recommendationid": "21907531", "author": {"steamid": "76561197983042773", "num_games_owned": 747, "num_reviews": 67, "playtime_forever": 536, "playtime_last_two_weeks": 0, "last_played": 1458405117}, "language": "english", "review": "pharaoh rebirh is a good indie platformer adventure so far\nthere are a few problems if this game though\nits locked at 30 fps though also please find a way  to stop the screen tearing  up\nit needs to be fixed apart from that nothing is wrong with this game", "timestamp_created": 1458324710, "timestamp_updated": 1458324710, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.447629", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21905139": {"recommendationid": "21905139", "author": {"steamid": "76561198060392218", "num_games_owned": 201, "num_reviews": 5, "playtime_forever": 443, "playtime_last_two_weeks": 0, "last_played": 1458955734}, "language": "english", "review": "Simply awesome, period. This game is fun to play, makes me laugh out loud, and has amazing music! \n\nI love how once you are able to see the dungeon maps you don't have to switch to a subscreen. The map is literally superimposed over the game screen and it doesn't distract you.  Just hit up twice and the map appears (once you have the tools to create maps). After a few seconds the map will fade from the screen.\n\nThe characters and humor are great and I really want to help Jonathan lift the curse and regain his human form.  There's a ton of items and subweapons to collect and fun abilities to gain that will help you get to those hard to reach areas.  The bosses are cool and the dungeons aren't overwhelming, this is Metroidvania done right!\n\nI searched for somewhere to buy a soundtrack but couldn't find it anywhere.  Thankfully the music is available in .OGG format in the game's folders. \n\nHighly recommended for everything it has to offer. 10/10", "timestamp_created": 1458316120, "timestamp_updated": 1458323486, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.539364", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21904959": {"recommendationid": "21904959", "author": {"steamid": "76561198057029314", "num_games_owned": 159, "num_reviews": 8, "playtime_forever": 82, "playtime_last_two_weeks": 0, "last_played": 1512169320}, "language": "english", "review": "Everything you want in a Metroidvania game, only REAL issue I have with it is that it's locked 30fps. So the game kinda feels slow. All and all, despite this, there's so many that was good about the game, that I still think people should get this.", "timestamp_created": 1458315426, "timestamp_updated": 1458315426, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.464254", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21900914": {"recommendationid": "21900914", "author": {"steamid": "76561198067713488", "num_games_owned": 1233, "num_reviews": 38, "playtime_forever": 554, "playtime_last_two_weeks": 0, "last_played": 1459315446}, "language": "japanese", "review": "XBOXコントローラー使用。\nボタン配置のコンフィグ可能。日本語有り。\n\n良質なグラフィックと音楽、ユニークなキャラ、多彩なアクション、\nどのステージも凝っていて飽きない。良作2Dアクションゲーム。\n\n広いフィールドを探索するゲームではなく、\nステージを1つずつ攻略していくタイプのゲーム。\n攻略してアクションが増えていけば、\n前のステージで取れなかったアイテム等も取れる様になる。\n\n死亡しても多数あるセーブポイントからやり直すだけなので\n難易度は高くない。\n死んだらイベントシーンを再度見る事になるがスキップ可能。\nステージクリアしても自動セーブはされないので、\nステージ選択の画面で確実にセーブしておこう。\n\nステージの途中で飛ばせないミニゲームが何種類かある。\n個人的には飽きずに楽しめたが、\n苦手な人はストレスを感じるかもしれない。\n\nボス戦は相手のパターンを読んでジャンプや\n回避（攻撃ジャンプ同時押し）で攻撃を確実にかわすことが重要。\n\nウサギが主人公の良作2Dアクションだが、\nRabi-Ribiとは性反対のゲームである。\nメイン、モブ、雑魚キャラを含めても女性キャラが一切出ない。", "timestamp_created": 1458297747, "timestamp_updated": 1490336341, "voted_up": true, "votes_up": 33, "votes_funny": 2, "weighted_vote_score": "0.760510", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21900442": {"recommendationid": "21900442", "author": {"steamid": "76561197993174997", "num_games_owned": 1045, "num_reviews": 69, "playtime_forever": 1434, "playtime_last_two_weeks": 0, "last_played": 1459415507}, "language": "english", "review": "This is a metroidvania with a rabbit. Painted over with an egyptian theme. \nIt's fun and worth your time if you love any of the above mentioned.", "timestamp_created": 1458294903, "timestamp_updated": 1458294903, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21898730": {"recommendationid": "21898730", "author": {"steamid": "76561198023348513", "num_games_owned": 1135, "num_reviews": 5, "playtime_forever": 231, "playtime_last_two_weeks": 0, "last_played": 1458601449}, "language": "english", "review": "With tight controls, a pretty chill soundtrack, and some really lovely graphics, Pharaoh is definitely something worth picking up. Especially if you're a fan of the GBA Castlevania series. If anything, my only problem is that some of the jokes fall a bit flat but the writing for the most part is fine and the story is enjoyable and keeps things flowing.", "timestamp_created": 1458283957, "timestamp_updated": 1458283957, "voted_up": true, "votes_up": 8, "votes_funny": 2, "weighted_vote_score": "0.607577", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21896049": {"recommendationid": "21896049", "author": {"steamid": "76561198002572740", "num_games_owned": 386, "num_reviews": 29, "playtime_forever": 114, "playtime_last_two_weeks": 0, "last_played": 1489387631}, "language": "english", "review": "This is fun. End.", "timestamp_created": 1458265416, "timestamp_updated": 1458265416, "voted_up": true, "votes_up": 1, "votes_funny": 2, "weighted_vote_score": "0.265358", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21892319": {"recommendationid": "21892319", "author": {"steamid": "76561198027037669", "num_games_owned": 251, "num_reviews": 5, "playtime_forever": 528, "playtime_last_two_weeks": 0, "last_played": 1458819105}, "language": "english", "review": "Pharaoh Rebirth+ is a action platformer in the Metroidvania genre. The story follows Jonathan, a cursed explorer, as he tries to find the 7 holy grails and remove his curse. The writing is actually quite funny and smacks of earlier Metal Gear Solid games' style of humor. Mechanically, the action is quite good. There are dodge mechanics and a veritable arsenal of abilities and sub-weapons to help you customize the action to your style of play. Past levels will reward you for revisiting them with new abilities, subweapons, and stat upgrades.\n\nIf you like Metroidvanias with a more action-y style, then check out this game. For more info, check out our (GigaBoots) Quick Play: https://www.youtube.com/watch?v=RMbqJPssaZ8", "timestamp_created": 1458246228, "timestamp_updated": 1458455632, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.502784", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21891376": {"recommendationid": "21891376", "author": {"steamid": "76561197985036092", "num_games_owned": 11310, "num_reviews": 283, "playtime_forever": 143, "playtime_last_two_weeks": 0, "last_played": 1472434950}, "language": "english", "review": "No Commentary Quicklook:\nhttps://www.youtube.com/watch?v=adg_hl7I1e8\n\nFirst Impressions:\nGreat soundtrack, well written dialog, tight remappable controls and plenty of reasons to backtrack through levels. Difficulty scaling seems well thought out and I felt no reason to smash my gamepad (yet). Few minor issues with screen tearing, 640x480 res max and no widescreen support. If you can live with that, so far it's a nostalgic trip down platformer lane. 2 paws up.\n\nSource/Price:\n[b]Copy was provided by Degica (publisher)[/b]\nCurrent Price: 8.99 | Worth: 5-10\n\nMore Gameplay: (not stretched!)\nhttps://www.youtube.com/watch?v=IVVuc5q5Xd8", "timestamp_created": 1458242504, "timestamp_updated": 1458247758, "voted_up": true, "votes_up": 21, "votes_funny": 1, "weighted_vote_score": "0.518200", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21891055": {"recommendationid": "21891055", "author": {"steamid": "76561198016432675", "num_games_owned": 866, "num_reviews": 329, "playtime_forever": 305, "playtime_last_two_weeks": 0, "last_played": 1507483370}, "language": "english", "review": "[I] This key was obtained from the publisher for the purposes of review. [/i]\n\n[b] Target Audience: [/b] [I]  Classic NES Castlevania fans who want a nice theme to mix in with their nostalgic gameplay[/i]\n\n[b]Video Review: [/b] https://youtu.be/vvMgDTtfkoU\n \n[u] Summary: [/u]\nGet ready to whip your ears back and forth. And yes, bad opening joke for this review. But Pharaoh Rebirth+ is a solid but not spectular game in the metroidvania genre, specifically harking back to the days of the NES with it's specific yet purposeful enemy placement and level designs. There's a good mixture of combat, platforming, and exploration with not too much backtracking, and a good set of systems that complement each other overall. Good variations of level backgrounds, good change of pace gameplay, there's a lot of good, not great here.  There's a bunch of fun to be had here, I just wish that the game was better implemented, with the 360 controller not working for me at all, and resolutions options that aren't really up to par with modern day systems (and not even any options for the full screen entirely. There are also some inconsistencies in the design, as some of the levels have areas that you're just on the cusp on making the jump, only to realize that you just don't have the ability to actually make it. It's no where near a big problem, but it's more of an annoyance that keeps on showing up over and over again, getting a tiny bit more annoying each time. But regardless, it's a good game that's appropriate for it's price point, and is worth your time if you like the genre.\n\n[u] Lists: [/u]\n[b]Positives:[/b]\n[list]\n[*] Nostalgia takes hold with classic Castlevania (NES) gameplay. Rushing through areas will get your ass kick, as enemy placement and damage is purposeful and has a certain rhythm to it.\n[*] Controls work well in giving the preciseness you need to snipe enemies with your whip-ears while not being too loose for the platforming.\n[*] Good difficulty ramp as the game isn't brutal, but again, punishes impatience and expects precision. Some good difficult platforming portions that require skill and challenge. \n[*] Great visual designs complemented with great animation quality. Watching Jonathan eat food in particular was always fun. \n[*] Secondary weapons provide specific purposes and are very useful when busted out in that right situation. Not over powered, but good complements to the whip.\n[*] Great Level Design and enemy placement as a whole. Developers understood their game and it's engine's strengths rather well. \n[/list]\n\n[b]Negatives:[/b]\n[list]\n[*] 720p resolution in windowed mode, and not even a resolution option for full screen mode.\n[*] Recording wise, was a nightmare. FRAPS gave performance issues, OBS was like “Nope”, and shadowplay while working, recorded at 640x480. \n[*] Missing basic options expected on a PC port, such as music/sound sliders (just one slider for audio in a pre-launcher)\n[*] Some enemies blend too much in the background, not giving enough of a clue of where they are on screen in order to deal with them. \n[*] Some parts have trial and error learning mechanics that don't do a very good job of teaching the player that they can't do the specific event right now. \n[/list]", "timestamp_created": 1458241279, "timestamp_updated": 1458313821, "voted_up": true, "votes_up": 16, "votes_funny": 1, "weighted_vote_score": "0.547912", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39501566": {"recommendationid": "39501566", "author": {"steamid": "76561198076721797", "num_games_owned": 673, "num_reviews": 428, "playtime_forever": 694, "playtime_last_two_weeks": 694, "last_played": 1516337166}, "language": "english", "review": "I would definitely consider this a solid and enjoyable metroidvania, though at the same time it's not amazing and not one I'm likely to remember that much or come back to in the future.\n\nThe structure is less of a big open world and more smaller, maze-like levels with lots of secrets tucket away. It does scratch that metroidvania itch in a few levels but there are also several really linear and flat levels as well. Oh, and the car level is just pure trash. Complete waste of a level slot when there's only a total of 9 levels to begin with.\n\nThe combat is pretty good though, there's a lot of subweapons I never used but Jonathan feels good to control and has a lot of different melee attack options - basic attacks, a mid-air spin attack, when you get the double-jump it also functions as an attack (and a reall effective one), slide is an attack and you can even slide in midair (which the game never tells you and is also required for a few of the hidden treasures, ok, bleh). The bosses for the most part (aside from the bonus level boss and the secret boss) are really easy and pattenered though. You might die once or twice but after you see their pattern there's not much that can touch you. Especially if you go back and replay levels to collect treasures you missed or couldn't get the first time.\n\nThe platforming too, it's solid. The game reserves the really tricky platforming stuff for the bonus level but there's still moments of interesting stuff happening in the rest of the levels. Jonathan has maybe a bit slow of a ground speed but other than that he's pretty mobile and the game gives you lots of movement options to play around with. I never found any of the platforming really that hard though, even the stuff with instakills, the combat is clearly where more of the challenge is intended to go.\n\nPresentation-wise I'm not a huge fan of the art style but it looks fine enough in general. The music on the other hand is actually really dang good - personal favorite would be the song for the nile level but there's a lot of good stuff there. The plot's a bit cliche and predictable but it's serviceable enough & kept me interested so, ehh?\n\nOverall this is like. A fun game and a reasonable amount of content for the price too, but I wouldn't ever see myself calling it one of my favorite games of all time, it doesn't really strongly have an identity, just does what it does well enough to remain pretty enjoyable throughout (except the car level. screw that noise.)", "timestamp_created": 1516511499, "timestamp_updated": 1516511499, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39248023": {"recommendationid": "39248023", "author": {"steamid": "76561197993775740", "num_games_owned": 133, "num_reviews": 1, "playtime_forever": 293, "playtime_last_two_weeks": 293, "last_played": 1515645923}, "language": "english", "review": "I decided to purchase Pharaoh Rebirth+ after thoroughly enjoying Shin Megami Tensei: Synchronicity Prologue (same developer). Pharaoh Rebirth certainly exceeded my expectations.", "timestamp_created": 1515646115, "timestamp_updated": 1515646115, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 142, "total_negative": 9, "total_reviews": 151}}
