{"reviews": {"39400006": {"recommendationid": "39400006", "author": {"steamid": "76561198042249962", "num_games_owned": 1575, "num_reviews": 89, "playtime_forever": 833, "playtime_last_two_weeks": 833, "last_played": 1516139220}, "language": "english", "review": "You're oldschool and enjoyed flash adventures?\nWorth a shot. But it's really a miss for me as it was pretty borring.\nCan't say it was tedious, but be ready for tons and tons of times solving the reaction gauge.\nThumbs down because really the story is too short and the mechanics are just a scripted time filler, think cookie clicker level.\nIts a solid good game, but its a \"meh\" for me personally. Also did not enjoy the screamers. Would preffer creepy flashes instead. The island mansion was the best part of the game.\nCredits for the boss battle music though.", "timestamp_created": 1516139714, "timestamp_updated": 1516139714, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39342201": {"recommendationid": "39342201", "author": {"steamid": "76561198043305939", "num_games_owned": 315, "num_reviews": 2, "playtime_forever": 147, "playtime_last_two_weeks": 0, "last_played": 1502891557}, "language": "english", "review": "Dark Fear is a brilliant combination of adventure, RPG and horror game elements.\n\n(Note: Game completed offline, total play time was around 5-6 hours)\n\nAs an adventure game, the puzzles were a little on the easy side. But that's actually a plus because they were logical puzzles that can be solved with a bit of thought rather than heavily relying on guesswork or searching every screen for something you might have missed. Progress was at a steady pace and I was never stuck for an extended period of time.\n\nThe RPG elements work really well with the game. The protagonist can upgrade weapons and armor and buy items to gradually overcome stronger foes. It's also cleverly implemented: you can grind a little for money and supplies to make things easier, but you can't exactly abuse the system and become overpowered enough to break the game's sequence. There's a good amount of skill involved since you need to time your attacks to deal more damage and know when to use the right items. \n\nAs for the horror aspect of the game, I'm very pleased with how the game sets the proper mood throughout different locations. The pixel art in the game has the right balance between looking retro yet polished enough for contemporary gaming. And the music is spot on for each area/event.\n\nFor those concerned, there are indeed jumpscares. Normally, I'd consider this the cheapest way to try making a game \"scary\" (involutary reflex actions vs. reactions from genuine fear). But surprisingly, I enjoyed them in this case. The game's dark, chilling atmosphere evokes a sense of dread, and it delivers each scare at an appropriate time.\n\nAll in all, a very enjoyable game.\n", "timestamp_created": 1515946384, "timestamp_updated": 1515946384, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38978787": {"recommendationid": "38978787", "author": {"steamid": "76561198146740846", "num_games_owned": 24, "num_reviews": 1, "playtime_forever": 5368, "playtime_last_two_weeks": 0, "last_played": 1514920750}, "language": "english", "review": "Pretty decent story. Quite engaging. Cant remember when or why i brought it but it took up a lot of my time and didnt bore me.", "timestamp_created": 1514909923, "timestamp_updated": 1514909923, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38865774": {"recommendationid": "38865774", "author": {"steamid": "76561198321265455", "num_games_owned": 562, "num_reviews": 70, "playtime_forever": 590, "playtime_last_two_weeks": 0, "last_played": 1514940631}, "language": "schinese", "review": "喜加一慈善包，当时我看到在一个小木屋里面点击推理解谜，我是拒绝的，但是后来出了战斗系统，武器防具升级系统，还有扣人心弦的剧情，和音乐环境的氛围，我渐渐地迷上了这款游戏。\n没想到，没想到哈哈", "timestamp_created": 1514649919, "timestamp_updated": 1514649919, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38629167": {"recommendationid": "38629167", "author": {"steamid": "76561198165442724", "num_games_owned": 373, "num_reviews": 61, "playtime_forever": 699, "playtime_last_two_weeks": 0, "last_played": 1514683315}, "language": "english", "review": "Frankly, a lot of adventure titles bore me. This one does not. It has fighting, a good story and things that keep you on your toes. Also, the difficulty is fair. As much as I hate to just throw around this term, Dark Fear IS an over looked gem well worth the money!", "timestamp_created": 1514134694, "timestamp_updated": 1514134694, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.502881", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38499971": {"recommendationid": "38499971", "author": {"steamid": "76561198012363945", "num_games_owned": 1750, "num_reviews": 218, "playtime_forever": 349, "playtime_last_two_weeks": 0, "last_played": 1513799776}, "language": "english", "review": "This game has a dismal store page. 'Yet another retro themed horror wannabe game' is what i saw there. But i was intrigued by the persistent 'Very Positive' score and praising reviews it has so i decided to try it. \n\nTurns out it's well thought out game with a decent story arc. Flow of the game is great as there is always something to do do, somewhere to go, something to fight and only a few of the puzzles are really hard.  \n\nGame is not gory but themes are adult (e.g. violence against children) and other nasty stuff so better not buy this for the kid to play. \n", "timestamp_created": 1513883124, "timestamp_updated": 1513883124, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38376992": {"recommendationid": "38376992", "author": {"steamid": "76561198031534770", "num_games_owned": 981, "num_reviews": 22, "playtime_forever": 361, "playtime_last_two_weeks": 0, "last_played": 1513515586}, "language": "english", "review": "A mixt of original game and old gameplay from the 1980's, including pixel art. \nThis horror/adventure game succeed to be good in different genres : horror atmosphere, involving story, mixt with some RPG elements. The only default is the grinding you have to do sometimes : hunting animals to get some money and buy better armors/spells/weapons. Except that, you will always want to discover new places and advance in the story, which has its twists. Polished, interesting, disturbing and sometimes horrifying.", "timestamp_created": 1513518227, "timestamp_updated": 1513518227, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38258418": {"recommendationid": "38258418", "author": {"steamid": "76561198006986577", "num_games_owned": 326, "num_reviews": 213, "playtime_forever": 520, "playtime_last_two_weeks": 0, "last_played": 1513161109}, "language": "english", "review": "A short but neat dark adventure rpg.  A classic concept with an engrossing world that doesn't wear out its welcome.", "timestamp_created": 1513090540, "timestamp_updated": 1513090540, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36565408": {"recommendationid": "36565408", "author": {"steamid": "76561197960902436", "num_games_owned": 433, "num_reviews": 25, "playtime_forever": 466, "playtime_last_two_weeks": 0, "last_played": 1510899792}, "language": "english", "review": "This game is full of flaws gameplay wise but who cares? The pixel art is FANTASTIC because it doesn't try to be anything else other than the 80s goodness some of us are so attached to. And the musics are really good. The atmosphere is all in this game, and what may seem childish at first is only a wonderful tribute to what these kind of games were back in the days.\n\nI launched it one autumn afternoon and didn't leave it until it was finished. I would not recommend it to everybody, it takes a certain specific kind of old timers to like it. But if you were born in the 70s, chances are it won't leave you unaffected.", "timestamp_created": 1510900081, "timestamp_updated": 1510900081, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36528970": {"recommendationid": "36528970", "author": {"steamid": "76561197964345647", "num_games_owned": 855, "num_reviews": 210, "playtime_forever": 625, "playtime_last_two_weeks": 0, "last_played": 1508215754}, "language": "english", "review": "Pixel Art: 4/5\nImmersion: 4/5\nGameplay: 3/5 \nValue: 5/5\nDifficulty: 2/5\n--------------\nOverall 4.0 (Difficulty always excluded)\n\n[url=http://store.steampowered.com/curator/31208751/]Please follow my Pixel Art Curation for other great games...[/url]\n\n\nAs an inexpensive retro pixel art adventure, I found this quite enjoyable.\n\nIt is pretty straight forward, not too obscure, so the story flows nicely.  Not a very long game, but enough content for the price.\n\nIt is dark (as the title makes obvious) and atmospheric, which is what I enjoyed.\n\nI don't think it will be for everyone, if you like Organ Trail for example, this too you will likely enjoy.  I had issue with that one, so enjoyed this one much more.  There is much more depth and story here for sure.\n\nFor the price, it is very hard to go wrong here!\n\n\nACHIEVEMENTS:  Straight forward, but a few require precision ;)", "timestamp_created": 1510743240, "timestamp_updated": 1513974020, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36305018": {"recommendationid": "36305018", "author": {"steamid": "76561198305223081", "num_games_owned": 74, "num_reviews": 11, "playtime_forever": 467, "playtime_last_two_weeks": 0, "last_played": 1511876641}, "language": "english", "review": "I almost quit playing this game when I saw the Sierra-styled score counter at the top. I thought I was going to be in for a \"die a 100 BS deaths every 3 screens.\" \n\nBut no. \n\nIt's is actually quite fun.\n\nReally good albeit low-fi retro pixel art is very remiscent of late 80's-early 90's era Sierra games.\n\nPuzzle logic is pretty straightforward. Which is good considering the material it is inspired by.\n\nFun, simple JRPG mechanics. I haven't played a turn based RPG in almost a decade. \n\nJumpscares about made my 4 year old cry from fright(which was awesome).\n\nMusic, awesome.\nStory, gets the job done.\n\nThe game hit's the fun with 75% strength.\n\ncheap to!", "timestamp_created": 1509905526, "timestamp_updated": 1509905526, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36089164": {"recommendationid": "36089164", "author": {"steamid": "76561197973052125", "num_games_owned": 2966, "num_reviews": 294, "playtime_forever": 293, "playtime_last_two_weeks": 0, "last_played": 1509221631}, "language": "english", "review": "This game is not going to be for everyone, but I am a sucker for this kind of genre mix.  With a little bit old-school adventure, a little bit RPG, and a little bit horror, it pushes a lot of buttons.\n\nIn terms of quality: good art, decent music, cheesy but fun story, easy puzzles - not too bad a mix.  There are a couple points where you have to search for a small item that blends in with the background, but it wasn't egregious.  The combat is the weakest part, though - it's really a preparation and numbers game; once you get into a fight, there is little in the way of strategy.", "timestamp_created": 1509221739, "timestamp_updated": 1509221739, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35976577": {"recommendationid": "35976577", "author": {"steamid": "76561197981277153", "num_games_owned": 1071, "num_reviews": 17, "playtime_forever": 476, "playtime_last_two_weeks": 0, "last_played": 1508877766}, "language": "english", "review": "[h1] 8/10 Spaghetti Wolves [/h1]\n\nDark Fear is a short but engaging retro romp through effective and atmospheric pixel art stills. \n\n[url=https://youtu.be/UYEvZQAZTRQ] Check out 2 Headed Hero's gameplay video and commentary here! [/url]\n\nCombining simple resource gathering, point and click adventuring, and JRPG combat with some strange but intuitive \"golf game\" controls, this somewhat short but strangely addictive recipe makes for quite a fun 7-10 hours of gameplay. My playthroughs were bug free, there were no spelling or grammar errors as far as I could tell, and the storytelling, while simple, was plenty effective. Well worth the asking price, even though I believe I purchased it on sale for half off.", "timestamp_created": 1508884320, "timestamp_updated": 1508884320, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35940370": {"recommendationid": "35940370", "author": {"steamid": "76561198178112489", "num_games_owned": 275, "num_reviews": 15, "playtime_forever": 220, "playtime_last_two_weeks": 0, "last_played": 1508747363}, "language": "schinese", "review": "很棒的rpg...本来以为是一款恐怖解谜游戏，玩着玩着发现这特么是款rpg。又有武器又有道具又有防具的，还得为了换装备刷钱...!?\n游戏很好玩，画风也很复古。解谜元素不多，但是不仔细看对话解不出来...emmmmmmmm\n成就也是很难刷的，特别是几个boss战要求100%，建议s/l大法。", "timestamp_created": 1508747708, "timestamp_updated": 1508747968, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35098205": {"recommendationid": "35098205", "author": {"steamid": "76561198311141925", "num_games_owned": 243, "num_reviews": 4, "playtime_forever": 1977, "playtime_last_two_weeks": 0, "last_played": 1506952660}, "language": "schinese", "review": "请购买：）", "timestamp_created": 1505972455, "timestamp_updated": 1511588144, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.496241", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35012131": {"recommendationid": "35012131", "author": {"steamid": "76561198025135104", "num_games_owned": 1420, "num_reviews": 162, "playtime_forever": 353, "playtime_last_two_weeks": 0, "last_played": 1505451480}, "language": "spanish", "review": "[h1]Los retrobrinquitos de susto[/h1]\n\nLa única referencia que tuve de este juego, fue una entrada en Rock, Paper & Shotgun de hace tiempo. Suelo recurrir a ellos para buscar opiniones distintas y reseñas más sinceras de juegos indie. Recuerdo que dieron un comentario muy bueno y breve del juego y por eso me decidí a comprarlo en algún bundle.\n\nDark Fears parece un juego de móviles pero no sufrió en el traslado a PC. Cuando lo abres, te recibe una pequeña ventana simulada de DOS, reminiscencia de las aventuras de texto de misterio y horror de los 80. Después empieza una combinación de lo nuevo y lo viejo (antialias, música de alta fidelidad, gráficos que simulan los 16 bits) sin violencia alguna. Esto es agradable, pues, porque de repente les da melancolitis a los desarrolladores e insisten tanto en revivir las mecánicas de los únicos y viejos juegos, que eran amables por únicos, pero no por buenos.\n\nEsto no pasa aquí. Al contrario. Primero hablemos un poco de una de las estructuras esenciales de este juego; esta es una aventura textual y, oh dios mío, tiene sentido. Algunos ejemplos: combina el aceite con la cerradura oxidada para abrirla y atrae a las moscas (de fuego) con la miel. Es lógico, sin exagerar. No pide del jugador combinaciones o acertijos exageradamente complicados y cuando llegas a una resolución, tienen sentido y no abusa de las justificaciones. El jugador observador no perderá ninguna pista y no hay recovecos dónde esconder las cosas. Si hablas con todos y lees los textos, no tienes por qué perderte. Lo críptico no excede las expectativas, pero incluso es satisfactorio cuando le agarras sentido.\n\nLa segunda estructura: los elementos RPG. El personaje principal puede mejorar dos cosas: armadura (salud) y ataque, ambas cuestan dinero. Eventualmente, para juntar el dinero, abrirá dos mecánicas especiales, que son la caza y la pesca. Obviamente esto es grinding descarado, pero no toma mucho tiempo y puedes aprovechar para curar al personaje (recupera un punto de salud por segundo cuando está quieto y no lo atacan). Quizás, en total, de mis 4 ó 5 horas de juego, una hora y media fue de puro grinding y eso para buscar todos los logros del juego. Mención especial al jaguar, al cuál puedes cazar en un bosque oscuro, pero aquí en México está (o estaba) en peligro de extinción (!).\n\nLa historia es convencional, común, en cuanto al género se refiere, pero no está mal. Es el modo de presentarla lo que realmente cuenta. No considero que haya grandes sorpresas, el principio y el final hacen su trabajo, sin grandes decepciones o sorpresas. La prosa tiene algunas redundancias y rodeos que no van al caso, pero son perdonables por el trabajo detallado de los gráficos, la animación de los mismos y la selección de la música. La dirección del juego engalana mucho un producto que podría ser considerado inferior si solamente de contar una historia se tratara. Dark Fears consigue crear una atmósfera interesante y efectiva (¡y es retro-horror!), varias veces me quité los audífonos porque sentía ansiedad por lo que podía suceder después (o sea, sí me dio chingos de miedo en algunos momentos).\n\nMención especial a los personajes, aunque son básicos, provocan cierto interés y tienen mucha personalidad. Caso obvio: la muchacha oriental que te vende las pociones y los henna, pero también los hombres de negocio, las hijas traicionadas, la reina de hielo, el herrero, el sastre y el loco, tienen un breve desarrollo que los hace un poquito fascinantes. Quizás, lo que no puedo olvidar, es su diseño, el cuál está bien cuidado y los torna memorables, aún cuando su papel en el juego es más bien estático. Tienen más personalidad que el personaje principal, lo cuál es tristón.\n\nEn cuanto al bestiario, tiene sus personajes de horror bien medidos: demonios, brujas, arañas gigantes, osos, lobos, goblins, hombres lobo y cíclopes; especialmente éste último me alegró. Hace mucho que no veía un cíclope en un juego.\n\nRecomiendo Dark Fears porque el conjunto es fascinante. Una película de horror empacada en una aventura textual de retro horror y el grinding de un RPG. Proporciona unas horas de diversión, sustos y fascinación por escuchar una historia.\n\n==\n\nSi gustas, puedes leer [url=http://www.agustinfest.com/tema/los-gustos/de-videojuegos/]más reseñas de videojuegos[/url] en mi página personal. O bien, únete a mi [url=http://steamcommunity.com/groups/arbol1000]grupo de Steam[/url] donde aviso de estas reseñas y trato de compartir notas útiles de videojuegos.\n\nTambién puedes ver mi play through de este juego en twitch si das click aquí: https://www.twitch.tv/videos/174797194?t=", "timestamp_created": 1505615233, "timestamp_updated": 1505615233, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34821926": {"recommendationid": "34821926", "author": {"steamid": "76561198374722010", "num_games_owned": 27, "num_reviews": 28, "playtime_forever": 395, "playtime_last_two_weeks": 0, "last_played": 1504983843}, "language": "polish", "review": "Udana klimatyczna retro gierka : ) Polecam !!!", "timestamp_created": 1504900592, "timestamp_updated": 1504900592, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34699834": {"recommendationid": "34699834", "author": {"steamid": "76561198010890686", "num_games_owned": 4537, "num_reviews": 10, "playtime_forever": 176, "playtime_last_two_weeks": 0, "last_played": 1504444302}, "language": "polish", "review": "Intrygująca indie gierka łącząca lajtowe RPG i point & click. Przyjemna odskocznia od gier AAA i zalewajacego steam szajsu. Potrafi naprawdę nieźle wystraszyć mimo prostych środków... Kto by pomyślał że stylizowana na retro gierka może wywołać ciarki na plecach ;)", "timestamp_created": 1504402809, "timestamp_updated": 1504402809, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34474716": {"recommendationid": "34474716", "author": {"steamid": "76561198001725715", "num_games_owned": 1139, "num_reviews": 17, "playtime_forever": 257, "playtime_last_two_weeks": 0, "last_played": 1503641661}, "language": "english", "review": "Fun game, interesting story and setting.  A little grindy with the hunting and fishing, but I like the variety of weapons and the need to research weaknesses of enemies.  I'm not a fan of the jump scares, I don't consider them particularly engrossing in the atmosphere, but they gave me a giggle.  Definately worth a look!", "timestamp_created": 1503641875, "timestamp_updated": 1503641875, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.584906", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34338860": {"recommendationid": "34338860", "author": {"steamid": "76561197960522295", "num_games_owned": 1946, "num_reviews": 59, "playtime_forever": 542, "playtime_last_two_weeks": 0, "last_played": 1503185564}, "language": "italian", "review": "Un RPG horror tipo DOS per gli amanti del retrò, il gioco è ben fatto, l'ambiente pure, elementi horror se ne trovano a iosa e non raramente si salta dalla sedia. \n\nIl gioco mi ha subito preso e mi sembrava di avere di nuovo 20 anni o giù di lì (invece che 44) .... davvero davvero bello.\n\nSe amate il genere e siete nostalgici credetemi sarà un ottima scelta perderci qualche ora.", "timestamp_created": 1503099520, "timestamp_updated": 1506714998, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34322465": {"recommendationid": "34322465", "author": {"steamid": "76561198019253518", "num_games_owned": 184, "num_reviews": 10, "playtime_forever": 65, "playtime_last_two_weeks": 0, "last_played": 1484521975}, "language": "german", "review": "Ein auf alt getrimmtes Abenteuer mit einem sich stetig wiederholenden Minispiel. Angesiedelt in einer mittelalterlichen, ländlichen Phantasieumgebung. \n\nEs gilt einige Dialoge zu führen und Gegenstände zu kombinieren. Dazu kommt eine Prise altbackene RPG-Mechanik: Es ist nötig seinen Charakter durch wertigere Ausrüstung zu verbessern. Die Mittel dafür erlangt man durch die Jagd auf diverse Tiere des Waldes. Das hört sich eventuell spannender an, als es ist. Dabei kommt das erwähnte Minispiel ins... Spiel. Ein Mauscursor fährt auf einer Leiste hin und her. Im richtigen Augenblick geklickt, bleibt der Cursor im Ziel stehen und etwa ein Angriff gilt als Erfolg. \nDieser Mechanik ist der Spieler die ganze Zeit über ausgesetzt, beim Fangen von Wild oder beim Kampf gegen diverse Widersacher. Hin und wieder springt unter einigem Tamtam irgendein Vieh in's Bild und bedient damit den Horroraspekt.\n\nDie Musik ist recht anhörlich und die Umgebungen sind stimmungsvoll gezeichnet.\n\nOhne die Geplänkel und die Ausrüsterei wäre wohl weniger Spiel übrig, die Erfahrung dafür konzentrierter. Wer Geduld für diese Art von Beschäftigungstherapie mitbringt und ein klein wenig Gruselstimmung sucht, kann sich in Dark Fear mal umsehen. \nMir persönlich ist nach kurzer Zeit der Elan zum Weiterspielen verlorengegangen. Die Geschichte konnte mich nicht in ihren Bann ziehen. Darum wollte ich mir die, zum Vorankommen leider notwendige, Minispiel-Schufterei nicht mehr antun.", "timestamp_created": 1503039722, "timestamp_updated": 1503039722, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497738", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34095875": {"recommendationid": "34095875", "author": {"steamid": "76561197984757685", "num_games_owned": 487, "num_reviews": 13, "playtime_forever": 498, "playtime_last_two_weeks": 0, "last_played": 1502168567}, "language": "english", "review": "I enjoyed that experience.", "timestamp_created": 1502168626, "timestamp_updated": 1502168626, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502262", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34079602": {"recommendationid": "34079602", "author": {"steamid": "76561197976001863", "num_games_owned": 844, "num_reviews": 15, "playtime_forever": 333, "playtime_last_two_weeks": 0, "last_played": 1487583664}, "language": "english", "review": "The scariest pixel game I've ever played. I never thought graphics like this would make me ,shit, my pants in terror. The detailed imagery during the jumpscare moments were truely horrific. I wanted to quit playing before I went into cardiogenic shock, but my inner masochism tempted me to continue through this 16-bit cream nightmare.\n\nThis game seems to reminisce in the old school DOS era of point and click gaming, but it's done really well. Puzzles are tight, music is alright, RPG style combat is decent. I think it's a hidden gem and didn't expect to get sucked into this realm of chaos. Oh, and did I mention the 'jumpscare fuck you turn your volume all the way up heart attack' moments?! \n\nBut seriously, if you need something to haunt your waking soul for a good 5 hour campaign, then I recommend trying this out. It's a very good can't sleep for the rest of the night simulator. 7/10", "timestamp_created": 1502104583, "timestamp_updated": 1502105690, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34002126": {"recommendationid": "34002126", "author": {"steamid": "76561198011100245", "num_games_owned": 98, "num_reviews": 1, "playtime_forever": 301, "playtime_last_two_weeks": 0, "last_played": 1506038712}, "language": "english", "review": "Awesome game, brings back the old point and click/text adventure games, in an amazing way. Can't wait to play even more!", "timestamp_created": 1501795037, "timestamp_updated": 1501795037, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33872747": {"recommendationid": "33872747", "author": {"steamid": "76561198052913525", "num_games_owned": 1410, "num_reviews": 35, "playtime_forever": 519, "playtime_last_two_weeks": 0, "last_played": 1501401464}, "language": "english", "review": "Turned off sound while talking to Emily and still scared the living hell out of me. 10/10\nGood sound/music\nSimple mechanics\nSo far it has been pretty straight forward and easy in a fun way.\n\nEdit: Finished the game.  It's been great.  Music and SFX are really good for a game this kind of style.\n\nGameplay is decent.  My only problem is the grinding for gold part (to upgrade weapons/armors/potions).  \n\nStory is coherent and goes back and forth to explaining some of the characters' motives.\n\nI think if the game had less grinding and more scares, it would be much better.  I actually haven't written a review in a long time and I thoroughly enjoyed most of it.  I think the ending could be tweaked a bit but none the less it was good.\n\nAchievements are a pain in the ass this game if you don't know what they are/what you have to do before hand.  I didn't bother with them at the end of the game because they were somewhat tedious (so achievement hunters might want to stay away from this).\n\nOverall game is 8.5/10 for me.  The game moved away from its original puzzle oriented playstyle and the end of the game some maps were literally 1 monster and that's it.  I thought those were turn offs.", "timestamp_created": 1501304026, "timestamp_updated": 1501402644, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33802042": {"recommendationid": "33802042", "author": {"steamid": "76561197993581052", "num_games_owned": 705, "num_reviews": 39, "playtime_forever": 782, "playtime_last_two_weeks": 0, "last_played": 1485330133}, "language": "english", "review": "I just loved this game. The sound effects and music are great. It really creeps you out, while maintaing classic c64/dos/amiga feel.  The game length is short, but it is the perfect choice for this game. To be honest, I couldn't stop playing once I started, and I just kept at it, happily grinding away to buy the next upgrade.  I'd say the only complaint I can think of is that the game is highly linear, where its pretty obvious what monster to kill next etc, but not always.\n\nAll around great pixel art adventure horror rpg type game. Give this dev some money, they deserve it.", "timestamp_created": 1501049496, "timestamp_updated": 1501049496, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33737217": {"recommendationid": "33737217", "author": {"steamid": "76561197998141809", "num_games_owned": 1242, "num_reviews": 47, "playtime_forever": 335, "playtime_last_two_weeks": 0, "last_played": 1473120081}, "language": "english", "review": "Feels like a port of a mobile game, but I rather liked it anyways. Very simple, straightforward game, kinda feels like a mix between a point and click with some mild rpg elements like combat, money, inventory and such. And don't worry, you can totally grind for money in this game. Instead of xp, you buy upgrades to your weapons and armor. You will never come to a point in the game that makes it impossible to beat it.\n\nIt's nice and easy and I found it very relaxing. There were a couple jump scares here and there.", "timestamp_created": 1500790316, "timestamp_updated": 1500792871, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33617422": {"recommendationid": "33617422", "author": {"steamid": "76561198065857063", "num_games_owned": 431, "num_reviews": 14, "playtime_forever": 352, "playtime_last_two_weeks": 0, "last_played": 1490209530}, "language": "english", "review": "Review taken from my original post at www.gamesfreezer.eu\n\nDark Fear is a mouse-driven horror RPG/Adventure game developed by Arif Games, originally released as a mobile title in 2015, it has been ported to PC and released via Steam with added audio fidelity. \n\nArif Games have several other well-received casual / indie titles under their belt, but this is their first foray into Horror territory, how did it turn out? \n\nVery well, in my opinion.\n\nThe game features very a neatly designed pixel graphical style with items of interest well-marked so as to avoid any of the irritating pixel-hunting that can sometimes lurk within adventure games. Also, to call it an adventure game doesn’t quite do the game justice. To put the variation of genres on offer in perspective, when I first booted the game up I purposely didn’t read into the background too much as it has been billed as a horror game with a mystery narrative, I thought I’d dive in blindly so as not to stumble across any spoilers whilst researching. Within the first few minutes, I was treated to a Myst-esque abstract puzzle, an ‘escape-the-room’ section, traditional graphic adventure style elements (collect the object, use an object on another object) and turn-based battling. This was, as the Persians used to say, “A good start”\n\nThe sound design of the game really shines. Some areas feature eerie ambient sounds whilst others sport a keening orchestral score in the background or delicate, disconcerting piano whilst the battle scenes have driving, tribal drums to keep up the adrenaline up during fights. Throughout the game it becomes apparent that some serious time was spent on this aspect, each location having its own accompanying music which varies according to the landscape, ensuring that it never becomes repetitive.\n\nThe narrative of the game is mysterious and gripping enough to keep you enthralled as to what will happen next with tightly scripted dialogue boxes and descriptions adding to the oppressive atmosphere of the game world. Often in indie adventure games there can be issues with grammar or typographical errors which can affect emotional involvement but in Dark Fear, this is not the case, dialogue is suited to each character that you meet and due to the writing style, isn’t laborious to read.\n\nThe puzzles in Dark Fear are quite often pretty straightforward with only a few head-scratchers thrown in. There may be times when you may be stuck with what to do next but for the most part, the text boxes in the game strongly hint as to what your next goal is. Dark fear moves along at a very smooth pace with minimal back-tracking required due to the fast-travel system that activates whenever you have discovered a new location (combined with the graphical style, this reminded me of Crime City on the Amiga) the only exception to the back-tracking is the hunting aspect of the game which was clearly designed primarily for mobile devices. \n\nI must admit there were some times where I felt like I was grinding somewhat to get enough gold to complete the next battle. If I was playing the game on my phone, this would not be an issue as it would be the perfect time-killer for a few minutes on a train journey, whipping out your phone and spending a few minutes tapping away, hunting animals in order to move on, but unfortunately when translated onto the PC, this area of the game is slightly impractical, especially when compared to the rest of Dark Fear which moves along at such a neat pace. It’s one of the few moments in the game I feel could have been trimmed back or revamped for the PC release. A big plus is that there are no random battles in the game, each monster is fought only once which adds variation to the battle system.\n\nWith its foreboding atmosphere, Dark fear keeps the tension ramped, especially in the more claustrophobic areas of the game. Relying less on jump-scares (although there were a few choice moments which were heart-clutchers) and more on an ever-present creepiness which works much to its advantage, especially in a genre where jump scares can sometimes be a poor replacement for decent writing or inventiveness. There’s a Lovecraftian element to the proceedings, a strange empty town cut off from life where people live in fear of an unnameable entity out in the beyond. There’s also a lake in the game with a name that Lovecraft fans will instantly recognise, a nice nod to the game’s literary inspirations.\n\nShould you die in the Dark fear (and you will), you end up back in the cabin where the game began with all items and gold intact. This works well as it removes any need for saving and loading if you make mistakes (and you will). The game can occasionally give you no warning should you accidentally stumble into a battle where you are certain to die in one hit without the correct equipment and so this instant restart is appreciated and well-implemented. \n\nHealth in the game generates over time which again removes the need to back-track too much in order to raise gold to purchase health items. Personally, I got into the habit of going fishing or hunting as my health replenished which was a routine that worked for my play style. \n\nThe sheer variety of locations in the game is quite astonishing, especially when considering that this is a budget title. Quite often low-budget horror games can all be set within one location (which can sometimes work effectively) but this game does have a sense of scale and momentum with each new place that you uncover.\n\nSummary:\nI have spent five hours in the world of Dark Fear and according to my save file I am 81% of the way through the game. Considering this is a title that retails at £2.79 (currently on sale at £1.67 through Steam at the time of writing this review) and the game length is roughly 6-8 hours to complete, it’s fantastic value for the thrills it has to offer and the quality of its design. I’m looking forward to seeing what Arif Games comes up with next.\n\nRight…I’m off hunting rabbits!", "timestamp_created": 1500329283, "timestamp_updated": 1500329283, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.435562", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "32888755": {"recommendationid": "32888755", "author": {"steamid": "76561198028142158", "num_games_owned": 351, "num_reviews": 10, "playtime_forever": 394, "playtime_last_two_weeks": 0, "last_played": 1498599550}, "language": "english", "review": "Dark fear is fun yet short adventure game.\n\nThe game bases its scaryness in jumpscares.\nAtmospheric horror aspects or looming terror is not so precent.\n\nMusic is atmospheric and fits the game well. \nThou some might say that music and the sound effects dont reflect the era the graphics are from.\nBut atleast I dont wish to hear pc speaker music or sound effects.\n\nCombant is fun but lacks any horror aspects, just basic jrpg style turn base combat.\nAlso combat is not realy hard and can be prepared well for, like figuring out weaknesses and protection.\n\nIf you die during the game you dont even need to load your save as it respawns you in the start area.\n\nRetro graphics were nicely done.\n\nBuying items requires some grinding (fishing and hunting), good thing is it wont take too much of your time.\nSo there is no fear of losing progress if you die.\n\nStory also works fine, thou the plot is semi average in level and has some weirdness but it works.\n\nOverall a decent game.\n\n", "timestamp_created": 1498597672, "timestamp_updated": 1498597672, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.555556", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32203345": {"recommendationid": "32203345", "author": {"steamid": "76561198054387451", "num_games_owned": 702, "num_reviews": 255, "playtime_forever": 139, "playtime_last_two_weeks": 0, "last_played": 1515033626}, "language": "english", "review": "A genuin creepy experience.\nReminds me of old DOS text adventures but with a \"dark\" twist. The game play is there the sound is amazing and the scares are not to \"jump-scar\"-y.\n\nYou can upgrade your equipment and fight demons via QTE\nYou can go fishing and hunting and catch a rare one.\n\nDefinitely recommended for every classic horror adventure fan!", "timestamp_created": 1496680939, "timestamp_updated": 1496680939, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.490897", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31866128": {"recommendationid": "31866128", "author": {"steamid": "76561198002441977", "num_games_owned": 3520, "num_reviews": 93, "playtime_forever": 335, "playtime_last_two_weeks": 0, "last_played": 1495303550}, "language": "russian", "review": "На удивление простая, но очень затягивающая point-n-click адвенчура с элементами сражений, экипировки, хоррора (какие тут сочные скримеры!) и детектива. Визуально пиксельная графика очень сильно напоминает классику жанра 20летней давности, очень добротная рисовка. Главный минус – необходимость фармить местную валюту и зверей для продвижения по сюжету, не то чтобы много, но немного напрягает под конец. Впрочем, плюсы перевешивают этот недостаток.", "timestamp_created": 1495303891, "timestamp_updated": 1495303891, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.566312", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31064429": {"recommendationid": "31064429", "author": {"steamid": "76561198143142509", "num_games_owned": 665, "num_reviews": 48, "playtime_forever": 566, "playtime_last_two_weeks": 0, "last_played": 1491846907}, "language": "english", "review": "A very nice little RPG, p&c game. \nI fully recommended it. Smooth play, good story and lot of fun.\nAll that under five bucks. \nYou cannot ask more <3", "timestamp_created": 1491847147, "timestamp_updated": 1491847147, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.566197", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30986068": {"recommendationid": "30986068", "author": {"steamid": "76561198133220119", "num_games_owned": 281, "num_reviews": 7, "playtime_forever": 497, "playtime_last_two_weeks": 0, "last_played": 1491475172}, "language": "english", "review": "I genuinely enjoyed the time I spent with this game! \nThe plot isn't exactly original and the puzzles presented aren't very tricky, but it all works well enough to make for an entertaining mixture. There are no glaring flaws, the story has a nice flow to it and there's a pleasant sense of progress throughout. \nDefinitely recommended to everyone looking for a nice, enjoyable \"spooky game\" that'll keep you entertained for a couple of hours.", "timestamp_created": 1491511537, "timestamp_updated": 1491511537, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30962208": {"recommendationid": "30962208", "author": {"steamid": "76561198318964928", "num_games_owned": 158, "num_reviews": 432, "playtime_forever": 98, "playtime_last_two_weeks": 0, "last_played": 1491403338}, "language": "english", "review": "Rough game.\nBut interesting.", "timestamp_created": 1491403365, "timestamp_updated": 1491403365, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.490897", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30934590": {"recommendationid": "30934590", "author": {"steamid": "76561198049893424", "num_games_owned": 58, "num_reviews": 12, "playtime_forever": 1198, "playtime_last_two_weeks": 0, "last_played": 1513914443}, "language": "english", "review": "Great game so addictive, I loved it", "timestamp_created": 1491273024, "timestamp_updated": 1491273024, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.490897", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30767352": {"recommendationid": "30767352", "author": {"steamid": "76561198165460448", "num_games_owned": 120, "num_reviews": 7, "playtime_forever": 338, "playtime_last_two_weeks": 0, "last_played": 1512193101}, "language": "english", "review": "I really enjoyed the storyline here. The puzzle definitely were amuzing and so were the enemies. I must admit that some of the jumpscares got me, others didn't but it was a fun game in my experience. And the gruesome details in the flavor text really struck a chord with me.", "timestamp_created": 1490598279, "timestamp_updated": 1490598279, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.525547", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30753456": {"recommendationid": "30753456", "author": {"steamid": "76561198208473992", "num_games_owned": 97, "num_reviews": 3, "playtime_forever": 202, "playtime_last_two_weeks": 0, "last_played": 1490541190}, "language": "english", "review": "Wait for the sunset, turn off the lights, wear your headphones and have your shit scared out of you!\n\nI have to assume that I've avoided all the grinding by using Cheat Engine. After all, I was interested in the story. That being said 10/10. \n\nBut to be fair, Idk if I'd be up for all the grinding the game needs to allow you to kill the monsters in late game.", "timestamp_created": 1490541476, "timestamp_updated": 1490541476, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.509030", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30514316": {"recommendationid": "30514316", "author": {"steamid": "76561198067219837", "num_games_owned": 1223, "num_reviews": 18, "playtime_forever": 306, "playtime_last_two_weeks": 0, "last_played": 1489523836}, "language": "english", "review": "0If the King's Quest Series had a baby with Myst and classic RPG games, mixed with hunting and fishing simulators, then holy crap, you'll enjoy this love letter to 80's games. It has the points system, puzzles that make you use actual logic to follow through to the game's conclusion, challenges your skill at math (just once thankfully), and has just enough jump scare moments to spice up the game. I normally detest jump scares, but the pixelated magic crafted here legitmately makes the jump scare moments creepy as hell.\n\nYou wake up in a cabin, in the woods, with no memories. You're also locked inside, with no key to get you out. What do you do? Like any 80's point and click gam buff will suggest, take anything that isn't \"bolted down\", and get to cracking the case of who you are, what's going on in this mysterious foreign land, help the townspeople so they can help you, hunt and fish your way to success, and rid the land of demons! If you're an absolute perfectionist with games and MUST complete every single puzzle, Dark Fear is for you.\n\nAlso, do play it in the dark with headphones on, you'll not regret it.", "timestamp_created": 1489524358, "timestamp_updated": 1489524358, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.509804", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30438144": {"recommendationid": "30438144", "author": {"steamid": "76561198014322514", "num_games_owned": 891, "num_reviews": 1, "playtime_forever": 334, "playtime_last_two_weeks": 0, "last_played": 1489188400}, "language": "english", "review": "Loved the retro lo-res graphics and atmospheric music, it took me back to adventure games I played on my original Macintosh.  It reminded me of Pengiun Software's Transylvania.  I wish it wasn't so reliant on the hunting/grinding aspect though, I don't mind the combat and feel it was  okay but I enjoyed the traditional point n click gameplay much more. Maybe I would have liked having alternatives to being forced into combat. I liked everything else very much!!  I think the developer has talent and looking forward to what comes out next.", "timestamp_created": 1489202114, "timestamp_updated": 1489202154, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.519231", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30324000": {"recommendationid": "30324000", "author": {"steamid": "76561197961744176", "num_games_owned": 819, "num_reviews": 192, "playtime_forever": 98, "playtime_last_two_weeks": 0, "last_played": 1488710952}, "language": "english", "review": "Nice retro rpg/adventure/horror game.", "timestamp_created": 1488663658, "timestamp_updated": 1488663658, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.478679", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30135022": {"recommendationid": "30135022", "author": {"steamid": "76561198028820864", "num_games_owned": 49, "num_reviews": 14, "playtime_forever": 412, "playtime_last_two_weeks": 0, "last_played": 1492982316}, "language": "english", "review": "I must admin it gave me a jump every now and then ;)\n\nReminds me of a mix between Zork, and Transilvania for the 1984 Macintosh Apple.", "timestamp_created": 1487918029, "timestamp_updated": 1487918029, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.509804", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30080045": {"recommendationid": "30080045", "author": {"steamid": "76561198006007948", "num_games_owned": 829, "num_reviews": 8, "playtime_forever": 256, "playtime_last_two_weeks": 0, "last_played": 1487883214}, "language": "english", "review": "tl;dr very enjoyable, creepy and genuinely scary, despite low res graphics.  Short with some grinding, but well worth the price.\n\nLike a lot of retro flavoured games, you get the feeling that if this had been released 20 years earlier it would have been an instant and still revered classic.  As it is, it's a fun and genuinely scary game that I don't regret playing in the least.  The story is richly intriguing and well told, and the combat is simple but oddly tactical and tense.  Somehow, the occasional jumpscares are no less effective for the basic pixel animation, and the game's atmosphere is never less than ominous.  \n\nOne very minor con:  You will need to grind the hunting and fishing minigames to get the equipment you need to progress.  This isn't too bad, but the hunting/fishing is basic enough to get a bit boring and repetitive.", "timestamp_created": 1487688015, "timestamp_updated": 1487688015, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.532020", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30056737": {"recommendationid": "30056737", "author": {"steamid": "76561198083735131", "num_games_owned": 943, "num_reviews": 9, "playtime_forever": 167, "playtime_last_two_weeks": 0, "last_played": 1487661499}, "language": "english", "review": "I totaly enjoy this game is unique and fun to play", "timestamp_created": 1487595444, "timestamp_updated": 1487595444, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.470383", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29714087": {"recommendationid": "29714087", "author": {"steamid": "76561198256710870", "num_games_owned": 33, "num_reviews": 1, "playtime_forever": 216, "playtime_last_two_weeks": 0, "last_played": 1510291584}, "language": "english", "review": "not bad", "timestamp_created": 1486287135, "timestamp_updated": 1486287135, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.444873", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29553278": {"recommendationid": "29553278", "author": {"steamid": "76561198159931019", "num_games_owned": 325, "num_reviews": 62, "playtime_forever": 253, "playtime_last_two_weeks": 0, "last_played": 1485649182}, "language": "finnish", "review": "Amazing pixelated horror game with jumpscares,be prepared for them XD\nThey got me SO badly!\nThe gameplay is nice point and click style and it has much to do.\nI highly recommend this for horror/pixel games fans!", "timestamp_created": 1485649286, "timestamp_updated": 1485649286, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.527382", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29293952": {"recommendationid": "29293952", "author": {"steamid": "76561198288061439", "num_games_owned": 9, "num_reviews": 1, "playtime_forever": 5, "playtime_last_two_weeks": 0, "last_played": 1484566004}, "language": "russian", "review": "Отличная игрушка", "timestamp_created": 1484566081, "timestamp_updated": 1484566081, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.502488", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29275049": {"recommendationid": "29275049", "author": {"steamid": "76561198025951139", "num_games_owned": 260, "num_reviews": 1, "playtime_forever": 441, "playtime_last_two_weeks": 0, "last_played": 1484490958}, "language": "english", "review": "Amazing!", "timestamp_created": 1484492266, "timestamp_updated": 1484492266, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.444873", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29236805": {"recommendationid": "29236805", "author": {"steamid": "76561198339356799", "num_games_owned": 28, "num_reviews": 2, "playtime_forever": 1030, "playtime_last_two_weeks": 0, "last_played": 1484781187}, "language": "english", "review": "I want to start of by saying I love this game! It is fun, creepy, and has a great story. I actually recently started a youtube channal and this is my first lets play. I love the way the jumpscares are placed, they arnt overused. They are timed well and add to the overall atmosphere of the game. I'd recomend this game to anyone who is looking for a creepy horror game that doesnt just spam jumpscares.", "timestamp_created": 1484356351, "timestamp_updated": 1484356351, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.549936", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29224820": {"recommendationid": "29224820", "author": {"steamid": "76561198019031178", "num_games_owned": 380, "num_reviews": 100, "playtime_forever": 617, "playtime_last_two_weeks": 0, "last_played": 1502170333}, "language": "english", "review": "Holy cow! I just started playing this game for a bit but this game is so rad, I love it.\nIt reminds me of the good ol classics like shadow gate and uninvited but is a bit more interactive.\nThe music is bone chilling and the atmosphere is perfect, great job devs.", "timestamp_created": 1484317784, "timestamp_updated": 1484317784, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.510481", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29098976": {"recommendationid": "29098976", "author": {"steamid": "76561198019797466", "num_games_owned": 248, "num_reviews": 10, "playtime_forever": 297, "playtime_last_two_weeks": 0, "last_played": 1483822575}, "language": "english", "review": "So, the good first: fun game, creepy retro art, lots of good ideas and enemies. Some genuinely startling jump scares. 5 hours to beat it, more if you hunt down all the achievements. The story is fun too. Definately worth the few bucks their asking.\n\nBut the bad: \"RPG elements\" is stretching it. Yes, technically they're there but they're just an excuse to make you grind so the game takes longer. Only way to upgrade your capabilities is to buy weapon and armor upgrades and tatoos by going out and grinding on a swing meter in hunting and fishing mini games. If you don't do this, you can't defeat certain enemies and you can't do extra grinding to make fights easier because the merchants simply won't sell you higher upgrade tiers of gear. The fact that this is intentional is made obvious by the fact that every major enemy has exactly the right number of hp and damge so that once you have the right gear if you hit the swing meters right, you kill them right before they kill you. All the \"rpg elements\" could be removed and the game would be better for it, if 2/3 as long.\nAlso, the writing is so-so. It's not awful but there are times words are used incorrectly and one major plot hole towards the end of the game. Aside from those complaints though, it's fun and I wouldn't let those stop you from buying it.", "timestamp_created": 1483823916, "timestamp_updated": 1483823916, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.525316", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28494155": {"recommendationid": "28494155", "author": {"steamid": "76561198081278208", "num_games_owned": 32, "num_reviews": 6, "playtime_forever": 479, "playtime_last_two_weeks": 0, "last_played": 1468281968}, "language": "brazilian", "review": "O preço é salgado, mas o jogo não é ruim, tem um terror legal (incluindo alguns scary jumps) e contém um mistério atiça a curiosidade.", "timestamp_created": 1482269251, "timestamp_updated": 1482269251, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28168223": {"recommendationid": "28168223", "author": {"steamid": "76561197999919770", "num_games_owned": 792, "num_reviews": 3, "playtime_forever": 381, "playtime_last_two_weeks": 0, "last_played": 1480746852}, "language": "english", "review": "Short, simple and satisfying. I mean simple in a good way; this game has decided what it wants to be and has pared away everything else, leaving not-too-many encounters, not-too-much grinding to get frustrating. Gorgeous art that makes the most of the style, and well-chosen music. You will need okay reflexes or a bit of patience for the timing-based combat and minigames.", "timestamp_created": 1480793369, "timestamp_updated": 1480793369, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.522184", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28051831": {"recommendationid": "28051831", "author": {"steamid": "76561198198149103", "num_games_owned": 254, "num_reviews": 19, "playtime_forever": 525, "playtime_last_two_weeks": 0, "last_played": 1481781641}, "language": "english", "review": "This game is dark.... and it gave me fear.... and it's point and click so you can eat and game at the same time, that was probably my favorite part!", "timestamp_created": 1480426079, "timestamp_updated": 1509688738, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.489206", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26740636": {"recommendationid": "26740636", "author": {"steamid": "76561197967229781", "num_games_owned": 452, "num_reviews": 303, "playtime_forever": 333, "playtime_last_two_weeks": 0, "last_played": 1479781136}, "language": "english", "review": "Indie developers are known for throwing random gameplay elements together to see what works and occasionally things come together just right. Dark Fear is a hodge-podge of old CGA adventure games, turn based RPG combat, and horror stories all mixed into one game.\n\nFirst the good news, the game does manage to be “jack of all trades” and most of the individual gameplay modes are sufficiently entertaining. You definitely have to plan for a good majority of the boss battles, but if things aren’t working out for you, you’re always able to flee and prepare for another attempt. Additionally the game has its own hunting and fishing systems that can be used to farm for cash so that you don’t run into a dead-end situation. Most of the special weapons and magical supplements are easy to understand and have plenty of descriptions or lore hints to help you select the right combination to get the job done. \n\nSome parts of this game were unfortunately, not so great. The horror elements are more jumpscare than anything else and are kind of predictable and the hunting mechanic gets a bit tedious when you just want to catch that one level 4 creature to make the armor you need. These are pretty minor issues though, and didn’t really tarnish the overall experience IMO.\n\nA total play-through of Dark Fear will take you about 5 hours, which might not sound very great but for a $4 game ($2.40 on sale) that’s quite a bargain. Consider picking this one up for an evening’s enjoyment and don't forget to turn off all the lights!", "timestamp_created": 1479782324, "timestamp_updated": 1479782324, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.600351", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26469104": {"recommendationid": "26469104", "author": {"steamid": "76561198042179280", "num_games_owned": 313, "num_reviews": 7, "playtime_forever": 284, "playtime_last_two_weeks": 0, "last_played": 1478489758}, "language": "english", "review": "I'd say the game's more an adventure game with RPG and horror elements as opposed to a horror game with the other elements as stated in the description. It's got all of those inventory puzzles and problem solving you'd expect from a point and click, albeit scaled down and broken up pretty well by those other elements. The game's pretty short (I beat it within 5 hours, though I haven't gotten all the achievements yet), but satisfying.\n\nThe positives:\n-The atmosphere's right where it should be; it's creepy and ominous, but without being completely oppressive\n-The sounds and graphics are both very nice; nothing feels out of place and the soundtrack and sound effects are both used well to complement the situation\n-The puzzles are at a pretty good level, not so difficult that I had to check a walkthrough every couple of minutes, but enough that they take some thought.\n-Pretty decent use of secondary elements to break up the puzzle-y horror-y main game.\n-The price is pretty low, which is nice.\n\nand the not-so-positives:\n-The plot's kind of predictable, nothing really out of the ordinary story-wise\n-One of the RPG mechanics is grinding for money with a timing-based slider minigame, which gets old pretty quick\n-The battle system feels kind of frustrating with its setup. Many enemies have abilities you need an item to avoid, which is often not obvious. This results in either losing or taking large amounts of damage, and waiting for your health to recover\n\nAll in all I'd say it's definitely worth the price, and presents an interesting concept besides.", "timestamp_created": 1478491583, "timestamp_updated": 1478491583, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26468381": {"recommendationid": "26468381", "author": {"steamid": "76561198005072824", "num_games_owned": 257, "num_reviews": 18, "playtime_forever": 307, "playtime_last_two_weeks": 0, "last_played": 1478485894}, "language": "english", "review": "A strangely satisfying hybrid of point-and-click adventure, turn-based RPG, and horror.\n\nThe art has an oddly retro aesthetic in the vein of Shadowgate, the combat, while very simple, has enough room for error through timed attacks and avoiding attacks by defending to keep you on edge, and the puzzles are pretty straighforward and won't stump you for too long. \n\nReally, my only problems with the game are it's cheap pop-scares that don't really add much to the atmosphere, the somewhat inappropriate music, and the fact that the game goes from exorcising ghosts and hunting deer to fighting giant crabs and running errands for an ice queen. The jump from supernatural horror to straight-up fantasy is a little silly and kind of takes you out of the horror atmosphere.", "timestamp_created": 1478486740, "timestamp_updated": 1478486740, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26457365": {"recommendationid": "26457365", "author": {"steamid": "76561198085755601", "num_games_owned": 19, "num_reviews": 1, "playtime_forever": 383, "playtime_last_two_weeks": 0, "last_played": 1478440945}, "language": "english", "review": "If you are older than 12 Dark Fear will neither pose a challenge nor entertain you. One clue that shows that developers did not put too much effort in this game is its title. Dark Fear from what? Dying of boredom?\n\nI start with the Cons:\n- Plot is weak (I did not have high expectations, but still)\n- Linear gameplay: new locations are added one at a time\n- No options in conversations, you just hear out what npc's are telling to you\n- Puzzles are especially weak (one of them was a linear equation written on the wall with blood!)\n- The game starts by you waking up not knowing who you are and where you at. The problem is not that its a cliche, but that you never get any real reason why you wake up like this (the explanation in the game is ridiculous)\n\n\nPros\n- Soundtrack\n- The game has a nice atmosphere\n- Price\n\nWith a little extra effort this game could have been a gem. But the gameplay ruins most of it. The story could have saved the rest, but it didn't.", "timestamp_created": 1478442342, "timestamp_updated": 1478442342, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.437344", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26440672": {"recommendationid": "26440672", "author": {"steamid": "76561198022236528", "num_games_owned": 174, "num_reviews": 9, "playtime_forever": 486, "playtime_last_two_weeks": 0, "last_played": 1478439999}, "language": "spanish", "review": "Juego point&click muy bien ambientado, sorprende ver lo que puede hacerse con pixel art y una buena banda sonora. Tiene una historia interesante, combates, puzzles..no es difícil. Estoy realmente disfrutando del juego.", "timestamp_created": 1478369971, "timestamp_updated": 1478369971, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26297726": {"recommendationid": "26297726", "author": {"steamid": "76561198012221863", "num_games_owned": 835, "num_reviews": 78, "playtime_forever": 300, "playtime_last_two_weeks": 0, "last_played": 1477763904}, "language": "english", "review": "[h1]Very Good[/h1]\nDark Fear is a game that I initially didn't overly want to get. The umpteenth mobile game ported, blah blah, labeled Lovecraftian, yaddah yaddah. In short something I almost scratched from my Steam wishlist. But am I glad I didn't do that, but rather picked it up as a 'might as well try it' during the halloween sale.\n\nAfter playing it, I have to say I'd have bought it at full price. Heck, I can't recommend it enough tbh. The game is rendered in a semi-8-bit graphical style with mouseclick based controls. The music is VERY good, setting just the right mood. Combat is challenging, with a vague rpg flavor, though the game mostly sticks to the adventure setting outside of this. One important other part is the hunting/fishing minigame. Different flavors, but both are essentially the same, but you'll be doing a bit of a rampage on the wildlife in the game to pay for weapon and armor upgrades. Don't forget potions and tattoos either.\n\nThe story keeps you intrigued and there are many locations to visit, monstrous beings to slay and not-so-hidden objects to collect. The downsides though? Well, not everyone might appreciate the art style, there's an awful lot of jumpscares for horror and aside from a math-puzzle the problems needing solving are not too hard. But those are minor issues compared to the fun there is to be had in the game.\n\nIn conclusion: Get it~!\n\nOverview of pros and cons:\n[b]Pros[/b]\n[list]\n[*]Great atmosphere\n[*]Very good music\n[*]Compelling storyline\n[*]Some thought required for combat\n[*]Nice pixelart\n[*]Not so easy achievements\n[*]Varied environments\n[/list]\n\n[b]Cons[/b]\n[list]\n[*]Jumpscares\n[*]Fairly easy puzzles\n[*]The hunting becomes a little tedious", "timestamp_created": 1477765528, "timestamp_updated": 1477765528, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.527382", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26150218": {"recommendationid": "26150218", "author": {"steamid": "76561198004006644", "num_games_owned": 2166, "num_reviews": 80, "playtime_forever": 1067, "playtime_last_two_weeks": 0, "last_played": 1473792042}, "language": "english", "review": "This game really surprised me at times , a really chilling horror game done well with classic pixel way. I would hate to spoil it for anyone with more details . Turn off the lights, strap on a headphone and enjoy this one.\nFans of alone in the dark will love this game.\nHoping for more games like this.\nPro\n- Great story , there really isn't a dull moment in it , nice twists.\n- Nice progression scheme with you being allowed to farm for resources as much as you want(exploration).\n- Good music, really shocking at times\nCons\n- Requires very very accurate pixel hitbox click to get that perfect shots(a real issue for achievement hunters if you miss a perfect hit)\n- The achievement list is not global which makes the save slots useless if you screw up somewhere(miss a achievement) you have to Restart again all over if you got some of the achievements already.\n", "timestamp_created": 1477075888, "timestamp_updated": 1477075888, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.608176", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26102826": {"recommendationid": "26102826", "author": {"steamid": "76561198082689223", "num_games_owned": 170, "num_reviews": 10, "playtime_forever": 262, "playtime_last_two_weeks": 0, "last_played": 1479667287}, "language": "english", "review": "I don't normally get *this* excited about a new game - ESPECIALLY one I've never played before - But hot DAYUM this one is good!  It mixes old school point-and-click adventure games with traditional RPG elements in a way that does both of them amazing justice.  \n\nSeriously, if you get any new horror games this year, make sure this is one of them!!\n\nIf you need even more of a push, check out my video for the game here - and be rest assured; I am seeing this one through to the end!  https://www.youtube.com/watch?v=4HUCuU5r0jM&index=12&list=PLflmumc8hhtgfYDh3GiI8vyRU8zvjycpx", "timestamp_created": 1476806633, "timestamp_updated": 1476806633, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26010151": {"recommendationid": "26010151", "author": {"steamid": "76561198049701098", "num_games_owned": 2584, "num_reviews": 326, "playtime_forever": 356, "playtime_last_two_weeks": 0, "last_played": 1476346342}, "language": "english", "review": "It's safe to say that there is no other experience on Steam quite like the one that Dark Fear delivers. It's a retro horror adventure and RPG hybrid that's sincerely one of the first of its kind. Think 1980's Kings Quest gameplay mixed with 1990's Pokemon type battles, combined with a Myst point and click interface. On the surface it may seem like a complex amalgamation, but in reality it all works very well together.\n\nYou play as an unnamed man who has awoke in a strange, dark cabin. You have no recollection of how you came to be in this place, and the memories of your past evade you. After escaping from the cabin, you find your way to a small town with a blacksmith, alchemist, tailor, and an unfortunate village idiot; all who will play a role in helping you to uncover the mysteries surrounding your arrival. The only thing that you have to go on is a strange, creepy old portrait that you picked up from the cabin; could this unknown person hold the answers that you so desperately seek?\n\nDark Fear has a thick, aromatic atmosphere that conjures the feeling that one gets when flipping through the yellowed pages of a dusty, old choose your own adventure novel. The game feels genuinely aged, but new all at the same time. Its crude yet enchanting graphics allow your imagination to fill in the details, while still being able to firmly hold an air of suspenseful horror as you explore an abandoned old house, a cemetery, thick forests, and even more locations. Each area holds its own secrets that need to be uncovered, and most have a few battles along the way; whether it be something as simple as a bear or a horrifying boss battle. You really never know what's beyond that next click.\n\nAnother feature that helps the retro vibe stand out in this game is the way that the dialogue is presented. The game utilizes very simple, and large, squares filled with text right in the middle of the screen. While the display is a throwback to oldschool point and clicks, the longevity and high quality of the writing reads like a novel. The story unfolds at a decent pace, and it has enough twists and turns to keep the player engaged at all times. There's also enough backstory to each character that no one would dare call the tale shallow.\n\nBoth the mechanics and gameplay are very straightforward. Click the on-screen arrows to traverse the scenes, click on objects within them to get a closer look and interact, drag and drop items to use them; all simple point and click stuff. Like older adventure games from the 80's, this title has a score system and your end goal is to obtain all of the achievements plus a perfect score of 410. The RPG element comes into play by forcing you to grind for gold by hunting. Gold is used to buy weapon and armor upgrades, as well as potions. Both the hunting and fighting mechanics feature the same click-slider bar, wherein you must click at the perfect moment to make the arrow on the bar stop within the green zone. You will hunt to gather pelts to both sell for gold and use to upgrade your armor, and you can also fish to earn money as well.\n\nThe only real issue with Dark Fear is the amount of grinding involved to get gold. At least once or twice every hour or so of gameplay, you're required to hunt for pelts to upgrade your armor. While that isn't a problem, the only way to make money is to also hunt and fish, leading to a repetitious grind that becomes dreary. At times it can put the player off from wanting to continue with the game, but thankfully the story, soundtrack, and graphics are all worth the effort that one puts in to gold farming.\n\nEven in writing it may sound like these ingredients don't quite fit together well, but trust me when I say that they do in a very unexpected manner. It's really something that one has to experience for themselves to understand and appreciate fully. Dark Fear is a very immersive game, not only within its enjoyable tale of horror and suspense, but also its fantastic retro graphics and absorbing soundtrack. It's also apparently a mobile port, but you would never know that by looking at it or playing it. We, the horror community, need more games like this. It's a shame that this one hasn't become more popular. A definite hidden gem.\n\n[h1]Rating: [b]4.5/5.0[/b] - Excellent, highly worth playing.[/h1]\nThe Horror Network [url=http://store.steampowered.com/curator/28221963/]Curator[/url] | [url=http://steamcommunity.com/groups/thehorrornetwork]Group[/url] Click for Gore", "timestamp_created": 1476352803, "timestamp_updated": 1513693534, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.606726", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25851074": {"recommendationid": "25851074", "author": {"steamid": "76561198015412324", "num_games_owned": 127, "num_reviews": 42, "playtime_forever": 573, "playtime_last_two_weeks": 0, "last_played": 1505486130}, "language": "german", "review": "Dark Fear ist ein sehr gutes Spiel, welches vorrangig durch seine dunkle Story\nund düstere Atmosphäre überzeugt. Letztere wird hierbei nicht nur durch die\ngut gezeichneten Hintergründe sondern besonders durch die unübertroffene\nmusikalische Untermalung erzeugt ... und die Jumpscares :)\n\nDas Gameplay besteht darin verschiedene Orte in einem Tal zu erkunden,\ndas Ganze geschieht hierbei aber recht linear. An den Orten müssen\ndann oft verschiedene einfache bis mittelschwere Rätsel gelöst werden oder\nKämpfe gegen unterschiedliche zu meist finstere Gegner bestanden werden.\nDa es sich bei Dark Fear um ein Handyspiel handelt sind die Kämpfe recht\neinfach gehalten.\n\nDazwischen kann man immer wieder in ein Dorf zurückkehren, um dort neue\nAusrüstung zu kaufen. Die Ausrüstung ist hierbei auch linear eingeteilt.\nd.h. die nächste Waffe ist immer besser als die vorhergehende Waffe.\nUm Gold zu verdienen kann man Jagen und Fischen gehen an Orten,\nwelche man zu vor befriedet hat.\n\nObwohl es ein Handyspiel ist und keinen wirklichen Wiederspielwert hat,\nkann man für 4 euro hier nicht falsch machen!", "timestamp_created": 1475570672, "timestamp_updated": 1475571211, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25835628": {"recommendationid": "25835628", "author": {"steamid": "76561198052965201", "num_games_owned": 461, "num_reviews": 76, "playtime_forever": 382, "playtime_last_two_weeks": 0, "last_played": 1475486358}, "language": "english", "review": "A great little game, with a remarkable depth of lore. It made me rather nostalgic for my old DOS games and rather interested in the works it might be inspired by.", "timestamp_created": 1475486413, "timestamp_updated": 1475486413, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25476208": {"recommendationid": "25476208", "author": {"steamid": "76561198099013029", "num_games_owned": 441, "num_reviews": 150, "playtime_forever": 382, "playtime_last_two_weeks": 0, "last_played": 1473557847}, "language": "czech", "review": "[b]Dark Fear 3/5:[/b] Tvůrci by chtěli, abyste si u jejich titulu nostalgicky zavzpomínali na staré dobré sierrácké textové (S)VGA adventury. Speciálně na sérii [i]Quest for Glory[/i] a tuplem pak na její slovanský horrorový díl. A to se jim daří. Rozhodně si vzpomenete. Bohužel však v tom ohledu, že ony klasiky navzdory zubu času jsou stále o nějaký ten kvalitativní řád výše než tyto rychlokvaškové indie hry naportované z mobilních zařízení.\n\n Dark Fear zaujme atmosférou (a umí i vylekat; pravda je, že pouze lacinou zvukově přepálenou BAF! lekačkou, ale funguje to, ne že ne) a především v první polovině chytne přímočaře chytlavou hratelností kombinující klasické adventuření (puzzly a rozhovory) s lehkým RPG systémem a tahovými souboji. Jde o typ hratelnosti, kde jste neustále na postupu vpřed z lokace a questu do další lokace a k dalším questům. Do toho na laciný indie titul dělaný na koleni i zábavně nadesignované achievementy, co nepůsobí pouze jako nutnost. A pak se to vše zkazí. \n\n V polovině hry (tj. cca po dvou hodinách) dojde k umělému natáhnutí hrací doby skrze nutnost grindování, což je extrémně otravná minihra, kdy lovíte zvěř a ryby prostřednictvím klikací minihry. Tempo hry se tímto ani ne tak zpomalí jako spíše zastaví způsobem podobným tomu, když to ve stotřiceti napálíte do protijedoucího náklaďáku. Navíc si během oněch desítkách minut mechanického klikání na pohybující se čtvereček uvědomíte, jak moc špatný port z mobilních zařízení to je. Že to ohavně vypadá až tak nevadí, ale že ovládání myší a levým tlačítkem drhne, jelikož jen obezličkově nahrazuje ovládání jedním prstem, již vadí.\n\n Ovšem navzdory kritice to lze opatrně doporučit. Zvlášť až to bude jako vata ke kvalitnějším titulům v některém z mnoha bundlů. A i tak spíše ve verzi pro mobily než stolní počítače.\n------------------------------------------------------------------\n                 [i]-: Případná další (ne)doporučení jsou k nalezení na mé [url=store.steampowered.com/curator/9557800-%28do%29Hr%C3%A1no/]kurátorské stránce[/url] :- [/i]", "timestamp_created": 1473670565, "timestamp_updated": 1473725779, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.508692", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "25473454": {"recommendationid": "25473454", "author": {"steamid": "76561198067954361", "num_games_owned": 1762, "num_reviews": 38, "playtime_forever": 215, "playtime_last_two_weeks": 0, "last_played": 1473692855}, "language": "english", "review": "Playing this game is like having someone scratch that one itch on your back in an oddly satisfying way.", "timestamp_created": 1473647445, "timestamp_updated": 1473647445, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.525547", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25431185": {"recommendationid": "25431185", "author": {"steamid": "76561197993226748", "num_games_owned": 6085, "num_reviews": 30, "playtime_forever": 868, "playtime_last_two_weeks": 0, "last_played": 1473602742}, "language": "english", "review": "Hello :D\n\nIt's a Review\n\nFor my friends\n\nI don't have friends\n\nbuy the game!", "timestamp_created": 1473450843, "timestamp_updated": 1473450843, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.383584", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25348405": {"recommendationid": "25348405", "author": {"steamid": "76561198048399197", "num_games_owned": 298, "num_reviews": 10, "playtime_forever": 321, "playtime_last_two_weeks": 0, "last_played": 1473003531}, "language": "english", "review": "It has pretty much good retro feel, but it´s not good adventure game (it´s really, really easy) and not good RPG also (not much options and not much of the challenge). But jumpscares are working just fine (one time I almost fell from chair, which is nice for pixel art game), music is pretty good so five hours of this retro 2€ field trip is worth it.", "timestamp_created": 1473004592, "timestamp_updated": 1474747996, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501343", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25246571": {"recommendationid": "25246571", "author": {"steamid": "76561198138809396", "num_games_owned": 419, "num_reviews": 9, "playtime_forever": 370, "playtime_last_two_weeks": 0, "last_played": 1472545805}, "language": "russian", "review": "Четко следуйте советам, которые даёт разработчик перед началом игры. То есть: играть в темноте и в наушниках. Только так можно получить истинное удовольствие от этой игры. Жаль только - не допилили русский язык. Хотя и без него тут всё понятно для тех, кто хотя бы в школе немного изучал английский. \nМоё руководство: http://steamcommunity.com/sharedfiles/filedetails/?id=754294080", "timestamp_created": 1472553279, "timestamp_updated": 1472553279, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.501174", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25243990": {"recommendationid": "25243990", "author": {"steamid": "76561198174487591", "num_games_owned": 1194, "num_reviews": 27, "playtime_forever": 302, "playtime_last_two_weeks": 0, "last_played": 1472538395}, "language": "english", "review": "I can't express my feeling after finished this game. That huge plot twist at the ending give me the \"WOW Effect\". Clever & brilliant of storytelling made this HORROR ADVENTURE RPG game is enjoyable to follow. Music & soundtrack that perfectly blend, and it can made atmosphere in this game eery and haunting but in some moment so peaceful, calm & dreamy. It is no doubt, this game could be categorize as \"great soundtrack\" in steam tag.\n\nAs an adventure games, this game has gameplay as point & click adventure. Player can interact some object on screen, and NPC in town. Looking for item by clicking object, use item from inventory, combine item and use them. As an RPG games, this game has feature that player can get money beside defeating enemies are hunting & fishing. Player can hunt animals, and sell their pelt to trader to get money. Or sell fish from fishing to get money too. By money, player can upgrader their weapon or armor, buying bolts for crossbow or potion to healing or get a tattoo for special effect. \n\nWell, Dark Fear is retro-like MS-DOS game. With gimmick like booting game in old MS-DOS game, this game has a plus to be a tribute to MS-DOS classic adventure games. Great artwork, great story and great music made this game has everything to be called as the good game. And this game is one of hidden gem that lying in steam library. Recommended!!\n\nLast word ... BE WARY OF JUMP SCARES !", "timestamp_created": 1472541399, "timestamp_updated": 1472541399, "voted_up": true, "votes_up": 10, "votes_funny": 3, "weighted_vote_score": "0.620598", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25222218": {"recommendationid": "25222218", "author": {"steamid": "76561198210145520", "num_games_owned": 524, "num_reviews": 51, "playtime_forever": 408, "playtime_last_two_weeks": 0, "last_played": 1472333877}, "language": "english", "review": "It's a point and click game done right.", "timestamp_created": 1472449365, "timestamp_updated": 1472449365, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25039055": {"recommendationid": "25039055", "author": {"steamid": "76561198094376730", "num_games_owned": 2749, "num_reviews": 20, "playtime_forever": 266, "playtime_last_two_weeks": 0, "last_played": 1471717669}, "language": "italian", "review": "Questo gioco mi ha sinceramente sorpreso in positivo, tanto che mi ha catturato completamente fino alla fine (l'ho finito in due uniche sessioni): essenzialmente è un ibrido ben riuscito tra un'avventura grafica degli anni '80 (tipo quelle della Sierra, non a caso c'è il punteggio in alto, che incrementa ogni volta si avanza nel gioco compiendo azioni) e un RPG, il tutto farcito da un'ambientazione horror ben azzeccata che, probabilmente, vi farà fare qualche salto dalla sedia dallo spavento. X-D\nNel ruolo di avventura grafica, ogni ambientazione di gioco è costituita da una schermata statica nella quale è possibile agire con il mouse: si interagisce con gli elementi presenti, si raccolgono oggetti, si combinano eventualmente nell'inventario, si utilizzano nella locazione corrente. Come RPG, nel villaggio iniziale è possibile acquistare armature, armi e pozioni, per affrontare i vari nemici che il gioco ci scaglia contro per ucciderci. Il combattimento è a turni (prima noi, poi il nemico, quindi nuovamente noi, e così via finché uno dei due non è a terra), e si avvale di un sistema di attacco alquanto semplice: una freccia scorre avanti e indietro lungo un indicatore, e si ferma non appena clicchiamo con il mouse. Più questa è vicina al centro, più danni causeremo: un centro perfetto permette di infliggere il 100% dei danni dell'arma, per poi scendere a 75% e arrivare, infine, allo 0% (bersaglio mancato). Una nota particolare va fatta per alcuni boss, che richiedono di essere affrontati con una preparazione \"particolare\", dato che hanno moltissimi punti vita e sono dotati di attacchi o poteri speciali che li rendono quasi impossibili da sconfiggere normalmente: dato che l'arma del protagonista è una balestra, per aumentare i danni è possibile acquistare dardi speciali, costruiti con materiali contro cui questi nemici sono deboli, mentre in difesa è possibile farsi tatuare dei simboli arcani sul corpo, in modo da nullificare le abilità speciali di questi boss. Infine, è bene sottolineare che NON esistono \"incontri casuali\" contro i nemici: sono TUTTI prefissati. Ciò significa anche che per fare soldi, necessari per comprare l'equipaggiamento, è necessario ricorrere a un altro espediente: la caccia e la pesca. In alcuni luoghi specifici è infatti possibile dedicarsi a queste due attività tramite una sorta di minigioco (solita freccia che scorre su un indicatore, solo che stavolta bisogna cliccare su tutti i punti verdi ivi presenti). Tra parentesi la caccia è comunque necessaria per le armature, perché per ottenerle, oltre ai soldi, sono richieste anche determinate pelli o parti di animali specifici, per cui vi ci dedicherete necessariamente per sopravvivere.\nPer il resto tanto horror ben congegnato, con una grafica che personalmente trovo molto bella nel suo stile retrò ricercato e, attenzione, con una colonna sonora alquanto azzeccata (la musica dei combattimenti poi è un capolavoro).\nPer quanto riguarda i difetti, in primis, in assoluto, la lunghezza: personalmente l'ho finito in circa 4 ore, e ho ottenuto pure il 100% degli achievements. :-/ In secondo piano, dato che gli scontri casuali non esistono, il dover necessariamente basarsi su caccia e pesca per guadagni extra è noioso alla lunga, anche se, alla fine, il \"grinding\" richiesto è veramente esiguo.\nIn definitiva, un gran bel gioco dal prezzo veramente esiguo - spero sinceramente che lo sviluppatore crei qualcos'altro del genere, perché mi ha veramente stupito in positivo.", "timestamp_created": 1471721865, "timestamp_updated": 1471722133, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.508502", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25031665": {"recommendationid": "25031665", "author": {"steamid": "76561198218235289", "num_games_owned": 80, "num_reviews": 2, "playtime_forever": 182, "playtime_last_two_weeks": 0, "last_played": 1471764077}, "language": "schinese", "review": "1 buck to get this shit and worth it !!!!  actualy it's a hunting game!!!!", "timestamp_created": 1471696436, "timestamp_updated": 1471696436, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24968290": {"recommendationid": "24968290", "author": {"steamid": "76561198045370126", "num_games_owned": 712, "num_reviews": 462, "playtime_forever": 330, "playtime_last_two_weeks": 0, "last_played": 1471414557}, "language": "japanese", "review": "★★★☆☆☆　（クリアー目安：５～６時間）\nHunting and Fishing game.\n\nクリックゲーです。ゲームの６割（ハンティング・フィッシング・戦闘）は、タイミングよくクリックするゲームです。（ピリヤードやゴルフゲームみたいなメータークリック）\n\n一般のRPGはモンスターを倒してお金を集めますが、このゲームはハンティングやフィッシングで獲物を売って装備を買います。\n装備は、武器・鎧だけです。レベルシステムはなく、能力は装備に依存です。\n残り４割の探索パートは、よくあるクリックゲーです。（悪魔の招待状みたいな）\nドッキリホラー少々と謎解き少々。ストーリーは（悪魔的な）ダークファンタジーの王道といったところ。\n昔よくやった、古きよき時代のオマージュ。\n\n悪い点は、ハンティング・フィッシングが退屈。\nあと、戦闘は単調。ボスは作業。自動回復と時間制限付全回復がめんどくさい。\nそれらのシステムは退屈そのものですが、ホラーテイストとオールドグラフィックがよかったので★３にしました。\n価格帯を考えればおすすめできるゲームです。", "timestamp_created": 1471416207, "timestamp_updated": 1471419587, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.663578", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24948117": {"recommendationid": "24948117", "author": {"steamid": "76561197964732360", "num_games_owned": 2843, "num_reviews": 68, "playtime_forever": 603, "playtime_last_two_weeks": 0, "last_played": 1471321544}, "language": "tchinese", "review": "這是一款融合了點擊冒險+解謎+回合制RPG的遊戲，像素風格的美術設計，恰如其份的音效和動聽的音樂，謎題難度適中，只是某些鬼怪總是尖叫著衝向螢幕 (照遊戲開頭建議戴耳機的朋友請保重) ，再加上充斥著謀殺親骨肉以實現黑魔法的劇情 (殺嬰、拐殺幼童、殺女兒還有殺孫子，編劇是沒有家人嗎？)，整體來說是款口味較黑暗一點的小品。解除成就的難度不高，但有些成就明顯是要讓人吃後悔藥的，請先蒐集必要資訊。\n[spoiler]如果你是成就控，請特別注意「Crabworm」、「Werewolf」和「The Guardian」這三隻怪物，各有一個需要100%擊中的隱藏成就，這一輪如果沒達成，只能下一輪再解了，而且也會因此不能一輪達成「Completionist!」這個成就。[/spoiler]\n\nThis game is a fusion of puzzle, adventure & turn-based RPG, well-drawn pixel art, realistic & scary of sounds, nice music, puzzles are moderate difficulty. But some monsters always screaming and rushing toward screen (if you are wearing headphones to play this game, please take care yourself), and the storyline is filled with murder. [spoiler](infanticide, abductions of children to kill, murder the daughter, murder the grandson)[/spoiler] Overall is a nice game. The Achievements are not too difficult to obtained, but some achievements are missable, please collect the necessary information during play this game.\n[Spoiler] If you would like to obtain all achievements, pay attention to\"Crabworm,\" \"Werewolf\" and \"The Guardian\", they required  to defeat with 100% perfect strikes.[/Spoiler]", "timestamp_created": 1471324560, "timestamp_updated": 1471335748, "voted_up": true, "votes_up": 16, "votes_funny": 1, "weighted_vote_score": "0.696349", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24844746": {"recommendationid": "24844746", "author": {"steamid": "76561198067820409", "num_games_owned": 566, "num_reviews": 5, "playtime_forever": 25, "playtime_last_two_weeks": 0, "last_played": 1471019045}, "language": "spanish", "review": "Muy buen juego de rol ambientado en los clásicos de spectrum y amstrad", "timestamp_created": 1471019100, "timestamp_updated": 1471019100, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24843873": {"recommendationid": "24843873", "author": {"steamid": "76561198048514293", "num_games_owned": 394, "num_reviews": 20, "playtime_forever": 619, "playtime_last_two_weeks": 0, "last_played": 1471014278}, "language": "schinese", "review": "画面很有dos游戏的味道，相当复古。剧情比较一般不过氛围营造不错，虽说是恐怖游戏但是也没觉得有多吓人，就两个地方有点受到惊吓感觉还是因为音效（。玩法基本是解谜+RPG，谜题基本比较简单不会卡关，战斗也不难，不过要注意看提示提前做好准备。总体而言算有趣，最大的缺点就是糟糕的金融系统了。刷钱基本靠打猎和钓鱼，但是过程非常单调枯燥又很要求集中力所以不是什么愉快的过程。多出来的装备血瓶也不能卖，买多了就只能放那扔着很浪费钱浪费时间。\n\n最后吐槽一下boss[spoiler]这游戏的最终boss蠢死了，也不想想我连恶魔守门人都能轻松干掉，他一个手无缚鸡之力的糟老头子还妄想可以啰里吧嗦半天透露自己的最终计划后再杀死我，真是典型的反派死于智障。[/spoiler]\n\n比较容易全成就，只要注意[spoiler]需要全部100%kill的guardian是最后那个红色恶魔而不是guide里的巨人就好。[/spoiler]\n\n总体而言值得一玩", "timestamp_created": 1471015595, "timestamp_updated": 1471015595, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.581737", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24801618": {"recommendationid": "24801618", "author": {"steamid": "76561198116024835", "num_games_owned": 454, "num_reviews": 27, "playtime_forever": 312, "playtime_last_two_weeks": 0, "last_played": 1470784204}, "language": "english", "review": "I very much enjoyed this. It reminded me of old Fighting Fantasy books like House of Hell, mixed with a point and click adventure game/light RPG. Genuinely startling moments and creepy atmosphere, with an intriguing storyline and cast of weird creatures to keep you occupied. And lots of fishing. Highly recommended!", "timestamp_created": 1470784486, "timestamp_updated": 1470784486, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.692013", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24742553": {"recommendationid": "24742553", "author": {"steamid": "76561198127915675", "num_games_owned": 498, "num_reviews": 1, "playtime_forever": 409, "playtime_last_two_weeks": 0, "last_played": 1470558836}, "language": "schinese", "review": "非常好玩的游戏，一开始只是因为便宜才买的，结果一上手就停不下来了，图像很复古，但也别有风味，音乐非常出色，对气氛的烘托很到位，尽可能的带耳机玩，效果更佳，作为一部小容量的游戏，制作已经可以说用心了，不过最大的问题是对英文水平一般的人来由谜题有些苦手啊，比如说我，玩到一半的进度已经感觉很吃力了，请已经通关的朋友提供一下中文的攻略，谢谢了！总之对这类解谜游戏感兴趣的人不妨玩玩，游戏品质对得起价格。", "timestamp_created": 1470491666, "timestamp_updated": 1470491666, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.547010", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24737408": {"recommendationid": "24737408", "author": {"steamid": "76561198095244218", "num_games_owned": 81, "num_reviews": 6, "playtime_forever": 544, "playtime_last_two_weeks": 0, "last_played": 1490492719}, "language": "english", "review": "It's amazing and scary!!!", "timestamp_created": 1470466076, "timestamp_updated": 1470466076, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.503573", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24669974": {"recommendationid": "24669974", "author": {"steamid": "76561198040303801", "num_games_owned": 110, "num_reviews": 24, "playtime_forever": 629, "playtime_last_two_weeks": 0, "last_played": 1470144440}, "language": "koreana", "review": "고전 정통 RPG 형식. 약간 퍼즐. 약간 노가다에요.\n분위기와 스토리가 잼있어요.\n엔딩까지 10시간 걸렸네요.\n선물받아서 했는데 의외로 옛날 고전 게임 생각이 나고 즐겁네요.\n굿~, 해볼 만 해요.", "timestamp_created": 1470144740, "timestamp_updated": 1470144740, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "4.980100", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "24640419": {"recommendationid": "24640419", "author": {"steamid": "76561198022936341", "num_games_owned": 1336, "num_reviews": 21, "playtime_forever": 213, "playtime_last_two_weeks": 0, "last_played": 1470000961}, "language": "english", "review": "Great Retro feel.  A mix of point and click adventure with a little bit of RPG upgrading and gold farming thrown in.\n\nGreat art, great story, great music.  Definitely worth checking out.\n\nI'm 20% complete and this is one of the very few games on Steam that I will play through to completetion.  If you got it as part of the Raving Aces bundle at indiegala.com, play this one before any of the others.  It's the only one without cards but with the possible exception of Guilty Gear, it's the best game of the bunch.", "timestamp_created": 1469995894, "timestamp_updated": 1469995962, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.547465", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24563587": {"recommendationid": "24563587", "author": {"steamid": "76561198179510505", "num_games_owned": 42, "num_reviews": 7, "playtime_forever": 283, "playtime_last_two_weeks": 0, "last_played": 1467737427}, "language": "koreana", "review": "퍼즐 쬐금, Rpg라곤하나 전혀 관계없음, 노가다성이 조금 있음, 점프 스케어가 없잖아있음.\n스토리는 그럭저럭나쁘지 아니하나 노가다가 발목을 붙잡는게임.\n긴장하면서 게임을 하게되고,\n후반부에는 낚시에 30분가량을 투자하게된다.\n시간이많다면 해봐도 될게임", "timestamp_created": 1469655369, "timestamp_updated": 1469655369, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24521812": {"recommendationid": "24521812", "author": {"steamid": "76561198271047704", "num_games_owned": 1315, "num_reviews": 50, "playtime_forever": 59, "playtime_last_two_weeks": 0, "last_played": 1469467256}, "language": "schinese", "review": "之前关注过这个游戏，作为剧情党+解谜狗第一次看预告的时候就被其深深吸引，正好最近首次进包，买  \n\n256k RAM.........\nC;\\cd\\games\\darkfear 伴随着游戏开始时略带感的DOS命令之后进入游戏。。。。。\n在一片血淋淋背景+鲜红游戏名称+鬼哭狼嚎声中进入主界面。。。。 主界面的BGM个人感觉渲染的还可以。。。。有点80年代evil dead 的味道\n\n进入游戏之后气氛开始诡异，而且感觉有些谜题需要动一番脑筋  第一个谜题为例：开始屏幕上会出现一行英文 Those who successed... REACH FOR THE STARS!! 并伴随着一闪一闪的亮点，开始我以为是过场动画等了会。。= = 慢慢我才反应过来原来是要点击那些亮点，（正所谓 reach the stars）点击五次之后组成单词 AWAKEN ,主角慢慢在一间废弃的小屋醒来。。。。。。。。。之后要在这个小村子里调查不为人知的秘密。。。。。\n\n总之这游戏既有恐怖解谜，还有rpg元素，比如升级装备，打怪之类。举例来说，出门后（怎么出门很简单）第一场战斗就是面对一只土狼，选择右上角攻击之后需要在合适的时间按键，（越靠近中间绿色部分攻击力越高）如果正好是中间的话会打出perfect 也就是100%的攻击力 （[h1] 如果一场战斗全部perfect的话可解除成就\t[/h1]）。。。开始玩儿着感觉还是不错的。。。。。虽然是像素的，但是恐怖氛围渲染的还不错，不过我是真心不太敢进行下去= = \n还有1.胆子大的建议戴耳机\n       2.建议身边准备纸笔", "timestamp_created": 1469467218, "timestamp_updated": 1469467218, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.591361", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24516399": {"recommendationid": "24516399", "author": {"steamid": "76561198048799891", "num_games_owned": 7453, "num_reviews": 31, "playtime_forever": 203, "playtime_last_two_weeks": 0, "last_played": 1469380845}, "language": "english", "review": "Fun and charming throwback to classic, Sierra-style adventure games from the late 80s. Even including the classic white score bar at the top of the screen! You click around and try to solve the mystery of where you are and why you woke up there, by collecting clues, pushing evil spirits out of their haunted houses and interviewing the residents of a small village. This part is all good and enjoyable, especially if you're oldschool enough to have played some of the game that inspired this one.\n\nThe problem is that the story is pretty bad, including possibly the worst twist of all time. You shouldn't burst out laughing at the twist in a horror game, which I did. Second, the game goes too far with its economy and forces you to stop and grind at several points in the game. If the hunting and fishing minigames had actually been fun, that wouldn't have been a problem, but it's a ridiculously simple system that must feel shallow even on mobile.\n\nAdventuring and solving mysteries with clues is the good part of this game, and there is a decent amount of it, but the game is weighed down by the grinding and in-game economy. I wish Steam had a neutral option here, because I'd place this game squarely in that category; fun if you can tolerate grinding, probably not worth it if you don't want to \"hunt\" in a simple minigame for hours. Since the neutral option doesn't exist, I'm gonna have to go with a \"not recommended\" because of the grinding.", "timestamp_created": 1469444346, "timestamp_updated": 1469444346, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.465585", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24471234": {"recommendationid": "24471234", "author": {"steamid": "76561198282335679", "num_games_owned": 3528, "num_reviews": 265, "playtime_forever": 1334, "playtime_last_two_weeks": 0, "last_played": 1469240033}, "language": "tchinese", "review": "這是個關於被詛咒的村子的故事, 並不恐怖, 但有幾個突然跳出來嚇人的場景\n氣氛普通, 一點也不恐怖\n特別的地方在於這是點擊解謎 + 單對單回合制戰鬥\n遊戲性中上, 但也不能算太好, 一定要去打獵賺錢買裝備, 這裡是最花時間的, 而且不穿最強的裝備根本打不贏, 變成了強制性活動, 沒法像一般的RPG那麼自由\n\n一玩無妨, 但也不用刻意購買, 故事很普通", "timestamp_created": 1469240770, "timestamp_updated": 1469240770, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.511558", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24413711": {"recommendationid": "24413711", "author": {"steamid": "76561197963151480", "num_games_owned": 336, "num_reviews": 1, "playtime_forever": 254, "playtime_last_two_weeks": 0, "last_played": 1468946909}, "language": "english", "review": "+\n\n* nice atmospheric soundtrack\n* nice retro graphics\n\no\n\n* story is nothing special\n* at some points of the game you have to grind though it's not really annoying as the RNG is pretty fair\n* the puzzles are easy\n* approx. 4 - 6 hours long; could be negative for some people\n* combat system is not challenging after you know how tu use weapons, tattoos etc.\n\n-\n\n* pretty early in the game you get the last available weapon\n\nConclusion: \n\nFor a game lasting approx. five hours i was satisfied. The flaws i mentioned above did not compromise my experience so i recommend this game to everyone who has an affection for early nineties rpg-adventure hybrids.", "timestamp_created": 1468957860, "timestamp_updated": 1468957860, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.547325", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24341431": {"recommendationid": "24341431", "author": {"steamid": "76561198027985487", "num_games_owned": 265, "num_reviews": 8, "playtime_forever": 239, "playtime_last_two_weeks": 0, "last_played": 1477643417}, "language": "russian", "review": "Очень советую. Хорошая прогрессия стандартных point and click адверчур, есть крафт, есть пошаговые бои, апгрейты, отличная атмосфера, и даже элементы хорора.", "timestamp_created": 1468616388, "timestamp_updated": 1468616388, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.525566", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24282151": {"recommendationid": "24282151", "author": {"steamid": "76561198014962659", "num_games_owned": 3182, "num_reviews": 13, "playtime_forever": 454, "playtime_last_two_weeks": 0, "last_played": 1467647420}, "language": "english", "review": "Independent British studio Arif Games published its horror adventure Dark Fear on mobile platforms and now on Steam. In pixelate retro graphics, which pays homage to classics from the Sierra, creating a small drama that puts you in the poor and unenviable situation.\n\nYou find yourself in an abandoned hut, can’t see a thing, the entrance doors are nailed and you don’t know what is happening. After the first introduction to the mechanics of the game you get out realizing that you are somewhere deep in the forest and mostly do not know who you are. The aim is to find out something about yourself, about the strange events and creatures you meet, and above all survive … oh and who’s that creepy guy in a picture inside that hut.\n\nClassic point & click adventure puzzles are followed by mini-games, like QTE, where you need to hunt and fish, so you can earn gold. With the money in town, where you will keep coming back, you can buy potions, protective spells and unlock better weapons and armor. Everything you need for next mini-game - fights. They are turn-based where you can attack, defend or use a potion. In the course of the game you can also choose the type of weapon used. Some monsters can be killed with only certain weapons and moreover it’s necessary to use a protective spell against their special ability. Combat system slightly reminds an old game Elvira (older gamers remember). Most opponents are coming as the story progress and therefore it’s necessary to first obtain the equipment needed to defeat them. In a classical adventure journey it’s a very nice RPG like feature.\n\nNeedless to say, the Dark Fear thrives to capture the atmosphere of the forest and 80’s games of this genre with nice retro stylization. Conversely, artworks nicely illustrate the gloomy atmosphere and there’s no a downside that the game was originally released on the mobile platform.\n\nDark Fear could be described as bite-sized experience, since it lasts up to four or five hours. Considering the price and content of the game it’s an enjoyable title and I can recommend it to fans of adventure games and dark stories.\n\nThis review is part of the Steamified Community Review program. For similar reviews and fantastic giveaways please visit http://www.steamified.com/.", "timestamp_created": 1468355880, "timestamp_updated": 1468355880, "voted_up": true, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.624657", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24275658": {"recommendationid": "24275658", "author": {"steamid": "76561198006276098", "num_games_owned": 333, "num_reviews": 30, "playtime_forever": 459, "playtime_last_two_weeks": 0, "last_played": 1475419302}, "language": "english", "review": "Pretty delightful horror adventure. It contains a fairly interesting story as you the take the role of a man with no memory battling evil in strange world that I can only describe as a bit of a mix between a sort of American frontier gothic horror, along with a bit of medieval mystic fantasy. It relies on a few cliches but it feels pretty imaginative for the most part. A few moments in the game are geinunely startling when first encountered.\n\nAwaking in a dark cabin with no memory, your main goal becomes to eventually try to recover the truth of why you're here while you go about gathering all the map and amulet pieces scattered throughout the world - by solving a number of puzzles and battling monsters, wild animals, witches, and demons. You earn an assortment of armor, weapons, items, and other abilities throughout the game to assist you in fights with the use of gold. You earn gold at the end of battles but your primary source of earning money is from selling the game you catch in hunting and fishing. Success in battles relies mainly on planning ahead and being able to time your strikes to maximize damage. It's all really rather simple. Some of the final few encounters try to make things a bit more difficult by changing up the arrow speed in order to make it more challenging to deal a critical blow. Even if you're defeated in battle the game starts you instantly back at the Cabin without losing any progress or items you've already collected.  \n\nMost of the achievements unlock as you advance the story but a few can be missed if you're not paying attention to them and save the game to far along to go back. It's also best to play this game as it suggests, with headphones and in a dark quiet place to get the maximum enjoyment out of it. \n\nIt requires a certain amount of grinding but nothing to overwhelming. I honestly didn't mind the hunting and fishing, which I found to be sort of a relaxing rest point inbetween exploring and battles. The end revelation is fairly surprising if not a little bit silly. The ending tries to tie together most of your encounters but I feel like it could have been better if things weren't so simplified. I felt some of these things could have been better just left unsaid in the end. Sometimes the best parts of these games were what it allowed your own imagination to fill in. \n\nOverall Dark Fear has alot of the same charm splashed with a bit of cheesiness that made these games fun to play. You're probably looking at around 3-5 hours of gameplay total which isn't to bad for a game in this price range. Recommended for fans of horror adventure tales old and new alike.", "timestamp_created": 1468334730, "timestamp_updated": 1468401303, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.497942", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24265042": {"recommendationid": "24265042", "author": {"steamid": "76561197970253475", "num_games_owned": 927, "num_reviews": 11, "playtime_forever": 262, "playtime_last_two_weeks": 0, "last_played": 1468284781}, "language": "english", "review": "Very good game for the price.\n\nPositive:\nGreat point and click adventure\nFun combat\n\nNegatives:\nHunting / Fishing for money to pay for upgrades gets really boring really fast\nShort, even with grinding\n\nOverall:\nIt took me 4.5 hours and probably 1 hr of that was grinding for upgrades (which you need for combat).  I would have liked more adventure, less grind.\n\nThis game does a great job of making you feel like a monster hunter.  You need to know which weapons to use, what special ammo to stock up on, which potions and protective tattoos to apply.\n", "timestamp_created": 1468285120, "timestamp_updated": 1468285120, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.534314", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24258577": {"recommendationid": "24258577", "author": {"steamid": "76561197994782386", "num_games_owned": 779, "num_reviews": 102, "playtime_forever": 360, "playtime_last_two_weeks": 0, "last_played": 1468258784}, "language": "english", "review": "Essentially, an RPG-lite combined with some adventure gameplay. The visuals say for themselves: stylish, yet clear, and everything is quite comfortable and readable. \n\nIt was a lot of fun for me for six hours, although despite of large inventory, combining items and talking to people, there is a lot of combat in the game that depends on quick reflexes. Besides, you have to spend a lot of time on optional hunting/fishing activities in order to get money for better armor, weapons etc. Still, those activities were fun as well, like collecting all types of fish you can catch so - definitely recommended!\n\nOh, there are several jump-scares here as well, but not too much :)", "timestamp_created": 1468259799, "timestamp_updated": 1468259799, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.673653", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24203274": {"recommendationid": "24203274", "author": {"steamid": "76561198078582252", "num_games_owned": 876, "num_reviews": 94, "playtime_forever": 670, "playtime_last_two_weeks": 0, "last_played": 1467498656}, "language": "english", "review": "Great game, like the DOS games of old. Grindy near the end but not overly so.", "timestamp_created": 1468058482, "timestamp_updated": 1468058482, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.460526", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24142647": {"recommendationid": "24142647", "author": {"steamid": "76561198138598324", "num_games_owned": 46, "num_reviews": 10, "playtime_forever": 520, "playtime_last_two_weeks": 0, "last_played": 1506647547}, "language": "german", "review": "I think Dark Fear is a small masterpiece. It has many jump scares which will make you pee your pants (or at least make your heart beat 60 bpm faster) and is really addictive. Nice pixel arts, atmospheric music and at least 3-4 hours of fun. That's more than i could ask for this small price. I'd buy a sequel blindly.", "timestamp_created": 1467837103, "timestamp_updated": 1467837103, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502712", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24124420": {"recommendationid": "24124420", "author": {"steamid": "76561198040936230", "num_games_owned": 778, "num_reviews": 2, "playtime_forever": 256, "playtime_last_two_weeks": 0, "last_played": 1467682957}, "language": "english", "review": "Dark Fear is a love letter to Sierra and other games of that timeframe. It's a short but beautiful experience that knows to keep it's price affordable. I'll list off the pros and cons for you.\n\nPROS:\nMusic is great.\nGraphics are amazing. I love the art style to death.\nStory is also quite good.\n\nCONS:\nThe game is very, very short. My 4.3 hours is me beating the game in one sitting. The only con, to me, is just how short it is. It would have been even shorter if you didn't have to grind money using the hunting system. I think if you didn't have to do that, the game might have been around 3 hours instead.\n\nI really, really liked this game. It's worth the $4 I paid. I just hope that there's a sequel coming sometime.", "timestamp_created": 1467772594, "timestamp_updated": 1467772594, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.471698", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24107040": {"recommendationid": "24107040", "author": {"steamid": "76561197970571810", "num_games_owned": 512, "num_reviews": 90, "playtime_forever": 342, "playtime_last_two_weeks": 0, "last_played": 1467321834}, "language": "english", "review": "Once again I feel that Steam are missing out by not having a \"Meh\" button. I've chosen \"Not Recommended\" but in all fairness to Dark Fear it was just over the line.\n\nThis game is quintessentially mediocre, it's just good enough to hold your attention but its hardly a memorable plot or a particularly engaging gaming experience. Likened to the Horrorsoft games of the past I can see why people would make that comparison but I feel it's doing Horrorsoft a bit of a disservice. It's basically a simple point and click adventure with some basic combat and a little bit of grinding for stuff to make better armour/buy weapons.\n\nAs I said, it held my attention and I completed it but there are probably better ways to spend your cash. The original Horrorsoft games like Personal Nightmare or Elvira are much better options (although you'll need to go elsewhere to get them).", "timestamp_created": 1467718176, "timestamp_updated": 1467718176, "voted_up": false, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.533106", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24042660": {"recommendationid": "24042660", "author": {"steamid": "76561198045735890", "num_games_owned": 413, "num_reviews": 7, "playtime_forever": 222, "playtime_last_two_weeks": 0, "last_played": 1468077311}, "language": "english", "review": "The games got really good pixel art-style and a lot of dialogue. \nIt doesn't take itself, or the player, too serious sometimes, and has a goodportion of humour in it too.\nIt's also quite good at distracting you with it's dialogue.\nThe fighting is moderately hard, it's not too hard (if you stick to where you're supposed to be that is) but you still have to be careful and stock up on potions.\n\nFeel free to check out the first part of the game in my let's play video if you want to take a look at it before going to buy it for yourself. \nhttps://youtu.be/PwWGZd8-jt0", "timestamp_created": 1467537948, "timestamp_updated": 1467537948, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23933190": {"recommendationid": "23933190", "author": {"steamid": "76561197986585380", "num_games_owned": 94, "num_reviews": 2, "playtime_forever": 797, "playtime_last_two_weeks": 0, "last_played": 1467226591}, "language": "german", "review": "great game! 13 hours class a gameplay - no need fo fancy graphics!", "timestamp_created": 1467226805, "timestamp_updated": 1467226805, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23875760": {"recommendationid": "23875760", "author": {"steamid": "76561198079864162", "num_games_owned": 82, "num_reviews": 1, "playtime_forever": 503, "playtime_last_two_weeks": 0, "last_played": 1483157062}, "language": "english", "review": "I'm not too far into the game, but I am diggin' it! It takes me back to the old sierra games, and it succeeds in giving me the chills! It's easy to control and figure out as well. If you're interested in the feel of the game, I've been making a Let's Play of it https://youtu.be/MBald75cgB0 . Spoilers though, of course.", "timestamp_created": 1467066213, "timestamp_updated": 1467066213, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23866520": {"recommendationid": "23866520", "author": {"steamid": "76561198166006383", "num_games_owned": 292, "num_reviews": 12, "playtime_forever": 300, "playtime_last_two_weeks": 0, "last_played": 1467851683}, "language": "english", "review": "I had a lot of fun with this game. The retro style graphics were great, and the story kept me engaged enough to want to finish this game over the course of two sittings. None of the puzzles were very difficult, and the jump scares were more so fun than frightening. Overall, I enjoyed about 90% of this experience totally. \n\nMy only real gripe with the game is that the hunting/shop mechanic felt like it was put in there just to pad out the length of the game. The game is 4-5 hours long, and you spend at least an hour of that hunting things to earn gold so you can upgrade your load out. You have to do this, if you do not then you will encounter enemies that will simply one shot you. Of course, the game never ends with you dying...just like any good point and click...but you still end up wasting a ton of time hunting or fishing for gold. I get it, it is sort of a practice for combat since there is no pressure while hunting/fishing - but you could have just as easily given the player the necessary items to win through puzzle solving or because they need things like potions and are friendly to the NPCs. The game still would have been extremely enjoyable if it was only a 2-3 hour experience in old school horror gaming. \n\nSo, in spite of the grindy bits this is still a really solid game. It has enough charm that I can sit there clicking on pictures of animals for a while in order to progress the combat portions of the story. Worth a purchase for sure.", "timestamp_created": 1467045821, "timestamp_updated": 1467045821, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23834465": {"recommendationid": "23834465", "author": {"steamid": "76561198054790890", "num_games_owned": 261, "num_reviews": 11, "playtime_forever": 300, "playtime_last_two_weeks": 0, "last_played": 1466911345}, "language": "english", "review": "On the surface, Dark Fear seems like a point-and-click horror throwback that looks like something one would've played as a flash game years ago.  It's so much deeper than that.\n\nWhen playing, you'll discover a multi-faceted, horror-fantasy adventure with very light RPG elements that will provide a good 4-5 hour play time.\n\nYou wake up in a dark cabin with no memory of how you got there.  Start clicking and use items, and after getting out of the cabin you will happen upon a village where your adventure really begins.  From this point on, you'll embark on a very atmospheric and interesting adventure that, while it may not blow you away, will keep your interest to the end without feeling like a slog.\n\nThe graphics are very late-80s to early-90s pixel art, all of which are very well done and work to keep the environment creepy without feeling like they're trying too hard.  Through the game, you'll feel like there's a mix of medieval fantasy and early 1900s worlds colliding, which to me just adds to the charm of the game.  It really harkens back to the days when games didn't take themselves too terribly serious, and were out to entertain you and not be co-opted by hyper-political nitwits that think every game has to double as a commentary on society.\n\nThe RPG elements are very simple in both execution and progression.  You can hunt for pelts, which can be used for better armor, increasing your hit points.  There is no grind fighting or levelling up, although you may spend more time than you'd like hunting for certain pelts needed for later armors in the game, which based on the very-scripted path of battles you'll face, you'll need to get better armor before you can progress at certain points.\n\nAs for the horror aspect, it is well-executed.  Scenarios meant to be creepy pull it off well, and the music helps (The developer was even kind enough to explain the music is copyrighted, and offered an option to turn it off as a nod to content streamers who may face DMCA takedowns if they record a Youtube video with the music on).\n\nAll in all, for $4.00, you're getting a competently made horror-adventure game that really captures the feel of old sierra adventures.  You won't regret this purchase, especially if you've been as disappointed in the recent glut of horror games as I have.", "timestamp_created": 1466960377, "timestamp_updated": 1466960377, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23806051": {"recommendationid": "23806051", "author": {"steamid": "76561198054719118", "num_games_owned": 348, "num_reviews": 18, "playtime_forever": 553, "playtime_last_two_weeks": 0, "last_played": 1466890675}, "language": "english", "review": "Shit your pants. Fish your tremors away.\n\nAbrupt ending though.\n\n9/10.", "timestamp_created": 1466890770, "timestamp_updated": 1466890770, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.471464", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23793366": {"recommendationid": "23793366", "author": {"steamid": "76561198001622086", "num_games_owned": 1319, "num_reviews": 53, "playtime_forever": 736, "playtime_last_two_weeks": 0, "last_played": 1466813121}, "language": "german", "review": "Ich habs gesehen und mir einfach geholt, der Preis ist mehr als angemessen, ich hab volle 12  Stunden Spielzeit genossen 100% ingame und alle Achievements und es war ein echt geiles Spiel. \nDark Fear ist ein Pixel Horror Adventure mit RPG Elementen wie Armor und Waffen- upgrades es gibt auch den ein oder anderen Talisman zu erwerben welcher dir im Kampf einen Vorteil verschafft auch Heiltränke und Munition kann man kaufen. Geld bekommt man durch abgeschlossene Missionen oder die Jagd welche am Land, Luft od im Wasser stattfindet, die gesammelten Tiere bzw deren Haut braucht man auch für die Rüstungsherstellung. Das Kampf- und Jagdsystem is einfach gehalten passt aber perfekt ins Spiel. Die Musik ist auch immer sehr passend gewählt und unterstreicht die oftmals dunkle Atmosphäre. Also ein sehr gut gelungener Genre-Mix wovon man leider noch sehr wenig am Markt findet, ausserdem macht es recht schnell süchtig man will einfach wissen was für neue Rüstung oder Waffe man freischaltet. Viel Spass bei Dark Fear :D", "timestamp_created": 1466865625, "timestamp_updated": 1466865812, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.568705", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23784468": {"recommendationid": "23784468", "author": {"steamid": "76561197995595724", "num_games_owned": 172, "num_reviews": 14, "playtime_forever": 303, "playtime_last_two_weeks": 0, "last_played": 1466861356}, "language": "english", "review": "I wish more games were made like this: humble, craftsmanlike, functional, and fun. This game puts simple, direct writing, solid art and music, and unpretentious gameplay front and center, making for a fairly linear, mild puzzle, mild RPG game with horror elements. None of these is applied too heavily, making a short, jaunty game where you never get caught with too much grinding, or puzzling, or reading. The story is uncluttered and plain-spoken, which makes it effective. It's taken from obvious story tropes, but doesn't force you to read some endless soap opera or pretentious extended monologue. Characterization is succinct and the horror works -- all the jump scares got me. I really appreciate what the creators did here. Good game, worth the price for the hours you get out of it.", "timestamp_created": 1466845193, "timestamp_updated": 1466861590, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.599340", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23764226": {"recommendationid": "23764226", "author": {"steamid": "76561198066212470", "num_games_owned": 49, "num_reviews": 3, "playtime_forever": 313, "playtime_last_two_weeks": 0, "last_played": 1466791086}, "language": "english", "review": "I like this quirky little game.  It is short, about 3-5 hours of gameplay, but I loved the old school interfaces and the music is wonderful!\n\nIf you are in the mood for an old school puzzle/mystery/rpg then this game might be for you.", "timestamp_created": 1466791417, "timestamp_updated": 1466791417, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23741070": {"recommendationid": "23741070", "author": {"steamid": "76561197966544729", "num_games_owned": 86, "num_reviews": 9, "playtime_forever": 270, "playtime_last_two_weeks": 0, "last_played": 1466733229}, "language": "english", "review": "A couple puzzles I had to use my brain but it's mostly just memory and grinding. I can't say anything bad about the game itself. It's a good distraction and fits fine in that $1 per hour ratio. My only gripe was that a few achievements didn't trigger and I love doing achievements. I'll go another round when I get bored and remember to save before the achievements should pop up. All in all it's a good little game for $4.", "timestamp_created": 1466733454, "timestamp_updated": 1466733454, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23738421": {"recommendationid": "23738421", "author": {"steamid": "76561198030651302", "num_games_owned": 444, "num_reviews": 2, "playtime_forever": 270, "playtime_last_two_weeks": 0, "last_played": 1466725354}, "language": "german", "review": "What can I say, I really enjoyed this little game!\nIf you want to spend a nice atmospheric (not too scary) evening, I think Dark Fear is perfect for that.\n", "timestamp_created": 1466725622, "timestamp_updated": 1466725622, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23718270": {"recommendationid": "23718270", "author": {"steamid": "76561197983940348", "num_games_owned": 1051, "num_reviews": 1, "playtime_forever": 269, "playtime_last_two_weeks": 0, "last_played": 1466648342}, "language": "english", "review": "Played and finished this in one sitting (4.5 hours) but this reminds me a lot of the old Sierra Manhunter games in terms of look and ambience. It's a bit point and click, with (preset) turn-based battles. For such a simple game, I'm surprised at the weapon and armour upgrade system: the only grinding you'll do for cash and pelts for crafting involves a mini QTE. I loved this game, and kinda wished there was more of it. Definitely worth checking out, especially for that price.", "timestamp_created": 1466648719, "timestamp_updated": 1466648719, "voted_up": true, "votes_up": 14, "votes_funny": 2, "weighted_vote_score": "0.658300", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39444044": {"recommendationid": "39444044", "author": {"steamid": "76561198258332204", "num_games_owned": 30, "num_reviews": 2, "playtime_forever": 6, "playtime_last_two_weeks": 0, "last_played": 1470406912}, "language": "german", "review": "bad.", "timestamp_created": 1516305694, "timestamp_updated": 1516305694, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 103, "total_negative": 6, "total_reviews": 109}}
