{"reviews": {"39191476": {"recommendationid": "39191476", "author": {"steamid": "76561198135438892", "num_games_owned": 2182, "num_reviews": 3315, "playtime_forever": 227, "playtime_last_two_weeks": 227, "last_played": 1515461449}, "language": "romanian", "review": "Very nice game", "timestamp_created": 1515444981, "timestamp_updated": 1515444981, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37996660": {"recommendationid": "37996660", "author": {"steamid": "76561198315442176", "num_games_owned": 149, "num_reviews": 84, "playtime_forever": 244, "playtime_last_two_weeks": 0, "last_played": 1512719297}, "language": "tchinese", "review": "挂卡小游戏、喜加一。", "timestamp_created": 1512201987, "timestamp_updated": 1512201987, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36437950": {"recommendationid": "36437950", "author": {"steamid": "76561198212600571", "num_games_owned": 228, "num_reviews": 137, "playtime_forever": 185, "playtime_last_two_weeks": 0, "last_played": 1508641564}, "language": "schinese", "review": "挂卡小游戏", "timestamp_created": 1510391426, "timestamp_updated": 1510391426, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36421840": {"recommendationid": "36421840", "author": {"steamid": "76561198094803808", "num_games_owned": 1376, "num_reviews": 1148, "playtime_forever": 81, "playtime_last_two_weeks": 0, "last_played": 1510328860}, "language": "english", "review": "grab it on sale, not much to do in this game. 4/10", "timestamp_created": 1510329885, "timestamp_updated": 1510329885, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.490283", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35038607": {"recommendationid": "35038607", "author": {"steamid": "76561198375197825", "num_games_owned": 41, "num_reviews": 49, "playtime_forever": 178, "playtime_last_two_weeks": 0, "last_played": 1505098064}, "language": "schinese", "review": "biubbiu", "timestamp_created": 1505708072, "timestamp_updated": 1505708072, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34734992": {"recommendationid": "34734992", "author": {"steamid": "76561198180585209", "num_games_owned": 46, "num_reviews": 4, "playtime_forever": 386, "playtime_last_two_weeks": 0, "last_played": 1506590031}, "language": "schinese", "review": "喜加一的时候买的，游戏略难，要一遍控制方向、跳跃，一遍进行射击，我都是和小伙伴一起玩的，单机游戏活生生玩成多人游戏", "timestamp_created": 1504532580, "timestamp_updated": 1504532580, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "26104042": {"recommendationid": "26104042", "author": {"steamid": "76561198017967750", "num_games_owned": 939, "num_reviews": 590, "playtime_forever": 201, "playtime_last_two_weeks": 0, "last_played": 1477050506}, "language": "english", "review": "[h1]This game by Flump Studios is even wackier than previous![/h1]\nMaybe it's not exactly the kind of games I like, but it's well made game, with pretty decent soundtrack.\nIt may be a little to hard on me and achievements are really a deal to get them all.\n\nComparing to Horizon Shift (starting screen includes the same options :D), this game features:\n- single jump, but includes walljumping and jumping on enemies (blue)\n- mouse pointed (or analog stick) aiming -> crosshair\n- generating shield, as result on jumping on blue enemies\n- more bullets\n- more colorful\n- online leaderboards\n\nPS: Copy provided by developer. I hope your future games will get even better :)\nPaul is really nice guy - he's active on checking forums (generally community hub).", "timestamp_created": 1476811677, "timestamp_updated": 1476811742, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.497124", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "25852231": {"recommendationid": "25852231", "author": {"steamid": "76561198089191346", "num_games_owned": 98, "num_reviews": 6, "playtime_forever": 24, "playtime_last_two_weeks": 0, "last_played": 1475576285}, "language": "english", "review": "Hyper Bounce Blast combines the gameplay styles for twin stick shooters with platformers. It has a neon-like futuristic graphical style and has a high-octane sound track. It's a challenging game where the player has to get to grips with shooting enemies coming from all directions while jumping platforms and dodging more enemies and that is just on the first few levels. \n\nThis game is great for having a casual game but it will leave you with sweaty palms and ringing ears. Definitely a high for some. Hyper Bounce Blast plays well with an Xbox360 controller because of the twin stick element where you move with one stick and determine your shooting direction with the other. \n\nDeveloped by Indie developer Flump Studios it's definitely a high quality product and lines up well with their other games.", "timestamp_created": 1475578552, "timestamp_updated": 1475578552, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "25721640": {"recommendationid": "25721640", "author": {"steamid": "76561197975484779", "num_games_owned": 1277, "num_reviews": 9, "playtime_forever": 181, "playtime_last_two_weeks": 0, "last_played": 1470209514}, "language": "english", "review": "Disclosure: I was given a free key by the developer.\n\n-=The Good=-\n\nStylish vector visuals\nGood music\nInteresting combination of gameplay styles\nSolid controls\nCentipede-inspired bonus levels\nMultiple game modes\n\n\n-=The Bad=-\n\nUnkillable enemies\nOccasional cheap deaths\nLow powerup drop rate\nSlow \"Hyper\" filling\n\n\n-=The Details=-\n\nThe game itself is an interesting combo-pack of ideas, some of which are borrowed from Flump Studios' previous game, Horizon Shift (HS). From the vector graphic-designed enemies that look like they could have been in HS, to the animation playing faintly behind all of the action, it screams HS in look and presentation. However, the similarities end there for the most part. This is basically a twin-stick shooter, as you control the gun with the right stick, and movement with the left. But rather than just move around freely over the entire play area ala Smash TV or Robotron 2084, you're main area is along the bottom of the screen not unlike Space Invaders or Galaga.  From there, you'll go after the red and green enemies for score and bonuses while avoiding their bullets by either moving/jumping out of the way, or bouncing off of blue objects to make yourself invincible.\n\nYes, you heard right, you'll be jumping and bouncing in this game. By jumping onto a low-moving blue object (or using a wall jump like in NES' Ninja Gaiden to reach a higher blue object), you become invincible to bullets and enemies. Not only that, the destroyed blue objects leave gems behind for you to collect either by hitting the floor and catching as many as you can as they fall, or by hitting the ceiling and getting them all. Another perk of the blue enemies is that bouncing off of them allows you to absorb bullets to fill up a Hyper meter that can be used to unleash a large blast that destroys most enemies (or get a big bonus... if you know how). As a bonus, if you can destroy groups of green ships, you gain a star. And if you collect five stars, you get taken to a bonus level at the end of the current stage to fight in what is clearly an homage to Centipede.\n\nThe action starts slow, but gradually builds into a frenzied skirmish of shooting, avoiding and collecting. The bosses in the game are the same way; starting off simple, but getting more demanding with each new one in terms of how you damage it and its bullet patterns. Thankfully, the controls are responsive and the hit detection seems to be on point as well. And as you frantically do all of this, you'll have some enjoyable music to listen to thanks to the OST that features catchy, synthy beats.\n\nSounds good, right? And for the most part, it is. But there are some issues with the game. First and foremost, are the unkillable enemies. This is a personal taste thing, but I HATE enemies you can't kill, especially when there are a lot of them. I've always felt they were a somewhat cheap way to add difficulty to a stage or section (I'm all for making a given enemy-type tough, but not indestructible). And sadly, this game features these undying things in the form of laser cannons that fire when you touch the ground, laser cannons that fire at timed intervals, and buzzsaws that go around the edges of the entire play area. All you can do is avoid them, which gets tedious after awhile and frustrating toward the end of the game... especially when they cause an unfair death.\n\nYes, this game has them too. There have been times where I beat the level, but triggered the floor laser cannons just as the level was ending. The result was the cannon's firing while the rest of the stage was blowing up. More than once, I found myself unavoidably falling into the laser blast and losing a life as the stage ended. I also encountered similarly unfair deaths after dropping from the ceiling. See, when you touch the ceiling and get all of the gems on-screen, you drop to the floor again. The problem is, you can't land on any blue objects as you fall. You just pass through them due to the invincibility you're given at that moment. When you hit the floor again, you become vulnerable again right away and that's where I got killed by bullet groups that I couldn't avoid thanks to how hectic things start getting around the mid-way point of the game.\n\nA final pair of complaints come from the way powerups are handed out and how long it takes to fill the Hyper meter. It seems as if the powerups drop rather infrequently, and I've yet to figure out if it's because I'm not doing something right/often enough to trigger them, or if the game's just stingy with them. Either way, you really start feeling under-powered when you play through 15 stages and only get one powerup (if you're lucky). Lastly, the Hyper meter always seems to take forever to fill. And as if that weren't enough, I've watched it get emptied out without using it or dying. I'm still trying to figure out if that last part's intentional, or a bug in the game.\n\nSo in the end, what can be said about Hyper Bounce Blast? It's a fun little game and at 30 somewhat short levels, it can be a one-sitting type of game as well. The visuals, the music, the gameplay, several modes to choose from... it all works together pretty well to make for an entertaining game that keeps you on your toes. But issues like questionable deaths, unkillable enemies and some potentially iffy powerup frequency choices put a few blemishes on this game's vector graphics-inspired visage. So while it is a game I recommend, it's one that could have used a few tweaks in my opinion.\n\nScore- 7.5 / 10", "timestamp_created": 1474964203, "timestamp_updated": 1474965103, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "25683506": {"recommendationid": "25683506", "author": {"steamid": "76561198007513026", "num_games_owned": 535, "num_reviews": 211, "playtime_forever": 25, "playtime_last_two_weeks": 0, "last_played": 1474773555}, "language": "english", "review": "Worst platformer/shooter I've played in ages.\n\nThis game gets it all wrong. Gamepad controls can't be configured and the configuration is badly chosen. Rules are poorly explained, complex and not any fun. \n\nAnd finally, after only a few minutes of gameplay, when I tried to restart from the first level in classic mode the game locked up on me.", "timestamp_created": 1474773240, "timestamp_updated": 1474773847, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.444413", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25551827": {"recommendationid": "25551827", "author": {"steamid": "76561198043367667", "num_games_owned": 1030, "num_reviews": 147, "playtime_forever": 82, "playtime_last_two_weeks": 0, "last_played": 1475948314}, "language": "english", "review": "This is an amazing 80s arcade game with modern sensibilities. The confluence of the mechanics is intoxicating -- the shooting, jumping, combos and risk/reward elements really pull me in. This is something I'll be coming back to long enough that it will certainly be a worthwhile purchase for me. If you like arcade games that require skill and blend different genres then you will likely feel the same as me.", "timestamp_created": 1474132371, "timestamp_updated": 1474132371, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.473934", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25255885": {"recommendationid": "25255885", "author": {"steamid": "76561198058432239", "num_games_owned": 112, "num_reviews": 2, "playtime_forever": 235, "playtime_last_two_weeks": 0, "last_played": 1481379945}, "language": "english", "review": "loads of fun!\n\nYou can spend hours playing this without realising, just trying to beat your high score.", "timestamp_created": 1472586985, "timestamp_updated": 1472586985, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24831879": {"recommendationid": "24831879", "author": {"steamid": "76561197983874667", "num_games_owned": 724, "num_reviews": 60, "playtime_forever": 72, "playtime_last_two_weeks": 0, "last_played": 1509079155}, "language": "english", "review": "Their hasn't been a Flump Studios Video game i did'nt like. their like the Quentin Tarantino and Robert Rodriguez's of Old school games. Even their bad games are fun. Really their aren't bad games. i have ownd them all. love them all.", "timestamp_created": 1470946966, "timestamp_updated": 1470946966, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.463776", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24820774": {"recommendationid": "24820774", "author": {"steamid": "76561197990619440", "num_games_owned": 266, "num_reviews": 31, "playtime_forever": 40, "playtime_last_two_weeks": 0, "last_played": 1470789182}, "language": "english", "review": "I have played a couple of games from FlumpyStudiosUK so I was prepared for how inovative they can be with their games, but this game blew me away.  It manages to blend to types of classic games into one and they did an amazing job with it.  Not only is it a fixed shooter but it is also a platformer.  That is just awesome!  Imagine Mario and Space Invaders had a baby.  That baby is this game.\n\nThere are times when you will have hordes of enemies decending upon you firing massive amounts of slow moving projectiles and the only way to survive is to start platforming on other enemies so that you have a shield that can absorb the bullets in mid air.  Those are the times when \"the floor is lava\" is a good concept to have because as soon as you touch the bottom of the level again you loose your bullet absorbing shield.  That tends to end badly.\n\nIf you ever play any classic style games then you need to put this at the top of the list.  One of my favorite things about this game is ths difficulty scaling.  Some classic style games are so hard that after a short period of time you rage quit, maybe eve break a controller if you are using one (been there done that).  This game doesn't cause that.  It does present some challenge but it isn't so hard that you immediately give up.\n\nDon't forget the price of this game.  It's only 5 bucks!  These guys are practically giving this game away.  What can you buy for $5 that will be this much fun?  I'll tell you what, nothing.  Well, nothing that's legal, lol.  \n\nSo in conclusion, this game is definitely worth buying.  It perfectly blends two of the best classic styles of gaming.  The fun factor is cranked up to 11!  Plus, it is only $5.  You can't even buy a meal at McDonalds for $5.  Screw McDonalds.  Keep you money and buy this game.  You won't regret it.\n\nIf you want to see some gameplay fo yourself then check out my Let's Play video for this game.  \nhttps://youtu.be/aAsUYE-EKzo", "timestamp_created": 1470891614, "timestamp_updated": 1470891614, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.456291", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "24508427": {"recommendationid": "24508427", "author": {"steamid": "76561197970737065", "num_games_owned": 2258, "num_reviews": 33, "playtime_forever": 255, "playtime_last_two_weeks": 0, "last_played": 1468009878}, "language": "english", "review": "[table]Disclaimer - Developer submitted me a free key for the game for review purposes.[/table]\n\nHyper Bounce blast is an interesting take on the Shmup genre. By combining it with elements of platform games and puzzle games, Hyper Bounce Blast is a unique, if unimpressive shooter.\n\nThe idea is to shoot the red enemies, and jump on the blue enemies while collecting fragments that the red ships leave behind. Once you've gained a plethora of these fragments, the aim is to \"bank\" the points by jumping to the top of the screen before the wave ends.\n\nThe vector styled graphics suit the game well, and controller support is tight and responsive. It also makes you brain think asymmetrically as you have to figure out which enemies to shoot and when to shoot them, as shooting a blue enemy renders it unable to be jumped on, and jumping on enemies is the only way to make your ship impervious to enemy fire. \n\nWhile the ideas around the game are great, keyboard and mouse movement lacks finesse, and it's very easy to lose track of your subtly coloured aiming reticle. The bosses and bullet patterns are also unfortunately very generic, seemingly ripped directly from Cave Shmups.\n\nThat being said, the game has a definitely high difficulty curve, and the price is right, so if you fancy a challenge, it's worth taking a look at. It's a good game, but not a great one.\n\nMy rating: 6 out of 10.\n\nVideo review here:\n[url]https://www.youtube.com/watch?v=0sjQ7Y09hsg[/url]", "timestamp_created": 1469400266, "timestamp_updated": 1469400316, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "24282773": {"recommendationid": "24282773", "author": {"steamid": "76561198030789129", "num_games_owned": 341, "num_reviews": 31, "playtime_forever": 236, "playtime_last_two_weeks": 0, "last_played": 1466959302}, "language": "english", "review": "[i]Hyper Bounce Blast[/i] is the latest game from Flump Studios, which you may have heard of from their successful titles, such as Horizon Shift.\n\nAlways faithful to the genre, [i]Hyper Bounce Blast[/i] is a sweet and delicious homage to the 80-90's Shm'up wave, and it succeeds wonderfully in offering unique gameplay mechanics.\n\nYou're controlling a bouncing ship with the ability to wall jump and bounce on the ennemies. \nAs long as you're in the air, you're entirely invincible from every form of threat. But if you land on the ground, you'll be vunerable ! As compensation, you will also get to collect the points from the kills you've just made. And if you reach the ceiling, you will bank your chain.\n\nAnd that is what the game is mostly about. You need to focus either on jumping or shooting, or maybe both if you're awesome like that.\n\nOh, should I talk about the Hyper ? When your Hyper bar is full, you can release your full power, and give headaches to your ennemies by going BWAAAAAAAAAAAAH for a few seconds. This can save your life, really. And give you hell of a lot of points, secondarily, but make sure to activate it as close as you can from the top of the screen!\n\nAs usual, you have access to different game modes, each with their own leaderboards. While I do wish the game the success it deserves, I must admit I love the small community it currently gathers, just for the fact you can have a say with your scores, as modest as they are. It's way more rewarding than ending up in the 100th page of leaderboards, where nobody will ever find you again. \n\nI found [i]Hyper Bounce Blast[/i] graphically stunning, and it runs smoother than ever. Every new game from the Studios is yet another big step towards indie professionalism (careful not to go too far, or you'll get tired, Paul!), and I'm really excited to see what is next to come out of their magic hat of high-quality games.\n\nWhether you're a retro gamer, shmup-lover, or simply someone who wants to discover that genre, I can only recommend [i]Hyper Bounce Blast[/i] : it is made with passion, doubtlessly.", "timestamp_created": 1468357941, "timestamp_updated": 1468358425, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.629139", "comment_count": "3", "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "24214455": {"recommendationid": "24214455", "author": {"steamid": "76561197979772705", "num_games_owned": 163, "num_reviews": 13, "playtime_forever": 19, "playtime_last_two_weeks": 0, "last_played": 1470539177}, "language": "english", "review": "A Hyper fast paced Shooter, with Retro style neon graphics, set to a Musical Melee! \nFace the Bullet Hell Storm and keep Bouncing on the Blue nuetral/enemies and you're indestructable!\n\nThis game is REALLY fun! It has that retro arcade shooter appeal but the bounce mechanic adds a level of intensity that you just can't describe until you play it! It's definitely worth the cost. CHECK OUT MY REVIEW VID!\n\nhttps://www.youtube.com/watch?v=8C57PZPAK1M&index=4&list=UUxjgXmU3z_4gYORnpjFmi2w", "timestamp_created": 1468091746, "timestamp_updated": 1468349349, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24153657": {"recommendationid": "24153657", "author": {"steamid": "76561198074672646", "num_games_owned": 4374, "num_reviews": 593, "playtime_forever": 113, "playtime_last_two_weeks": 0, "last_played": 1465972854}, "language": "french", "review": "[h1]Hyper Bounce Blast est un bon jeu de tir avec des éléments de plateformes[/h1]\n\nD’abord, je tiens à vous rappeler que l’auteur de ce jeu est aussi responsable de la petite merveille qu’est [b]Horizon Shift[/b].\n\nAttention, Hyper Bounce Blast s’adresse uniquement aux joueurs très à l’aise avec les shoot them up. Si vous êtes débutant ou si vous commencez, ce n’est pas le jeu que je vous conseille d’acheter de suite, plus tard, oui. Pour être plus précis, c’est un jeu de type bullet hell. C’est à dire que vous êtes noyé sous le tir ennemi et que vous passer à travers les « balles » pour vous en sortir.\n\nHyper Bounce Blast a des éléments de jeu de plateformes. En effet, votre vaisseau (de la vieille génération) ne peut pas naviguer à travers l’espace, il doit sauter sur les lignes pour évoluer en hauteur. Vous pouvez en profiter pour sauter et écraser les ennemis ce qui vous donne temporairement  une sorte de bouclier.\n\nConclusion : Très bon jeu à petit prix à posséder dès que vous vous sentez suffisamment bon dans ce style de jeu !\n\n[url=www.graal.fr/2016/06/16/test-hyper-bounce-blast-la-version-pour-steam/]Pour lire l'ensemble de mes impressions sur Hyper Bounce Blast.[/url]", "timestamp_created": 1467885081, "timestamp_updated": 1467885081, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.537247", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24097498": {"recommendationid": "24097498", "author": {"steamid": "76561198036226519", "num_games_owned": 204, "num_reviews": 6, "playtime_forever": 11, "playtime_last_two_weeks": 0, "last_played": 1467678283}, "language": "english", "review": "Wow. This is a SUPER fast-paced awesome arcade shooter. It made me fee like I was actually sitting in front of an arcade console. The bouncing is KEY in this, but you can't forget to shoot either! I had a LOT of fun with this game. \n\nThank you, Flump Studios, for providing me with what I'm sure will be hours of fun!", "timestamp_created": 1467680354, "timestamp_updated": 1467680354, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "24067548": {"recommendationid": "24067548", "author": {"steamid": "76561198095348647", "num_games_owned": 622, "num_reviews": 26, "playtime_forever": 104, "playtime_last_two_weeks": 0, "last_played": 1467526243}, "language": "english", "review": "[quote][i]Review copy provided from developer. Note that my ability to enjoy a game is not influenced by how I recieved it.[/i][/quote]\n\n[h1]Hyper Bounce Blast[/h1] is a hectic arcade shoot 'em up, with a bit of platforming blended in to add an extra bit of flavour. \n\nGameplay-wise, you take on the role of an energetic shooting machine and plough your way through chaotic waves with the ability to not only blast an infinite amount of bullets in your enemies' path, but to bounce your way whilst doing so. But does this platforming mechanic affect the gameplay enough for it to be an effective use of innovation, [i]and warrant a whole word in the title[/i]? Definitely. You'll see why as I go on to explain. Throughout [i]Hyper Bounce Blast[/i] you'll be constantly trying to stay off the floor. Why? Whenever you are touching this floor, you are vulnerable to bullets. However, when you bounce your way through the level (via jumping on to anything that's blue) you are not only invulnerable to these bullets, but also absorbing them, turning your [i]bullet hell[/i] into a [i]bullet heaven[/i]. There are also other features of the bounciness, such as multipliers and the screen-clearing [i]hyper[/i] that annihilates everything with some serious visual displays.\n\nYou have a couple of gamemodes to choose from which sounds like it would be a huge portion of the replayability, but unfortunately each mode doesn't seem [i]that[/i] worthy of its own mode and rather changes some minor settings such as number of lives, etc. Then there's the [i][b]Tournament Mode[/b][/i]. The speed of the game is changed to an incredibly fast pace (this can be done yourself in the settings for the all gamemodes, so I don't see why it has been granted its own mode) which ultimately conflicts with your platforming abilities. There is no skillful way to speedily bounce through a level, you will almost always fail or be granted success by pure chance. This being said, the gameplay as a whole is [i]very[/i] entertaining and will provide both an enjoyable and satisfying experience through both classic shoot 'em up action and innovation.\n\nOn an aesthetic side of things, Hyper Bounce Blast does provide a vibrant experience, but one that is merely passable. There is nothing special about these graphics and whilst having and overwhelming amount of colourful visuals, they unfortunately show to be slightly underwhelming. This being said, they are by no means 'bad'.\n\n[i]Hyper Bounce Blast[/i] is filled with electronic tunes from the musical mastermind, [i]Quantum Firefly[/i]. I will say that whilst not being outstandingly complex they will soothe a simple mind, thus I enjoyed them. \n\nUSD $5 is a fair enough asking price. Not the cheapest, but I assume on sale it will be very much worth it.\n\nWant to know if you can configure and rebind everything to your hipster needs? Sure. There is an extensive list of settings that you can knock yourself out with.\n\n\n[h1][b]Summary:[/b][/h1]\n\n[b]Pros:[/b]\n✔ Enjoyable, innovative gameplay\n✔ Combination of genres works\n✔ Slick electronic tunes\n\n\n[b]Cons:[/b]\n✘ Gamemodes aren't that great, especially the [i][b]Tournament Mode[/b][/i]\n\n[b]Conclusion:[/b]\n[b]Hyper Bounce Blast[/b] is something new to a seemingly crowded genre of shoot 'em up games. It will provide an enjoyable and unique experience, one that's not to be missed by people wanting something refreshing.\n\n[b]Rating:[/b] \n7.3/10 - ★★★☆☆\n\n[code]Did you enjoy that review? Make sure to check out my curator page at [url=http://store.steampowered.com/curator/6899805/]Sour Fruits United[/url] and/or read my [url=http://steamcommunity.com/profiles/76561198095348647/recommended/]other reviews[/url]. If you had any things you liked/disliked make sure to tell me in the comments below.[/code]", "timestamp_created": 1467597914, "timestamp_updated": 1467598014, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23942830": {"recommendationid": "23942830", "author": {"steamid": "76561198041860169", "num_games_owned": 116, "num_reviews": 2, "playtime_forever": 26, "playtime_last_two_weeks": 0, "last_played": 1467211399}, "language": "english", "review": "Had quite a lot of fun with this game! More than you think you might have...;)\nhttps://www.youtube.com/watch?v=SgZRELcgaR0", "timestamp_created": 1467253755, "timestamp_updated": 1467253755, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23923770": {"recommendationid": "23923770", "author": {"steamid": "76561198037499511", "num_games_owned": 379, "num_reviews": 21, "playtime_forever": 29, "playtime_last_two_weeks": 0, "last_played": 1467115735}, "language": "english", "review": "I was really surpirsed by this game. Its a very interesting premise that combines platforming, shump bullet hell, and intense colours. And it works, its a lot of fun to play, easy to learn and difficult to master.\n\nCheck out my Let's Play if you want to see what the game is like\n\nhttps://www.youtube.com/watch?v=AyeadDMUxsM\n\nSubscribe to keep to date with indie games and be part of the Fox Nation", "timestamp_created": 1467204736, "timestamp_updated": 1467204736, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.564467", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23896037": {"recommendationid": "23896037", "author": {"steamid": "76561198118557803", "num_games_owned": 49, "num_reviews": 2, "playtime_forever": 302, "playtime_last_two_weeks": 0, "last_played": 1477180630}, "language": "english", "review": "Hyper Bounce Blast is a very fun but also challengeing game, but it also wasn't too hard.  It would be way harder if there wasn't checkpoints right before and after bosses.  I only played the first three stages and didn't finish the third.  The game is also really easy to get the hang of and get better at.  The part that is hard isn't the fact that there is hundreds of things that can kill you that are on the screen, it is that you will accidentially run into them from messing up.  Im pretty sure the game would be impossible if all of the circle was the hitbox instead of just the white dot.\n\nYou can check out my video of first playing the game:\nhttps://www.youtube.com/watch?v=XT8fjBw1HUw", "timestamp_created": 1467126976, "timestamp_updated": 1467126976, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23869202": {"recommendationid": "23869202", "author": {"steamid": "76561198002594586", "num_games_owned": 463, "num_reviews": 17, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1468673490}, "language": "english", "review": "Bega huge SHMUP fan i try my best to check out all shooter releases on steam, and this one from the artwork and trailers looked pretty cool however it's a Twin Stick shooter and being oldschool myself i prefer to play with an Arcade Stick however i was pleasently surprised that the dev included an arcade stick control method in the options but it is a lot harder to master playing it that way so i did resort back to pad and twin stick, and i gotta say its a lot of fun. The Bounce mechanic is a really good idea. the game is a combination of platforming blasting and dodging with a clever score system. this is an addictive little gem i highly reccomend.", "timestamp_created": 1467051547, "timestamp_updated": 1467051547, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23860904": {"recommendationid": "23860904", "author": {"steamid": "76561197960364629", "num_games_owned": 3070, "num_reviews": 216, "playtime_forever": 161, "playtime_last_two_weeks": 0, "last_played": 1467043895}, "language": "english", "review": "[h1][b]Little Old School With a Bit of Something Different[/b][/h1]\n\nYeah this game is for those that liked old games from the past with a twist. The game plays like a old Space Invaders but has a twist with Platform mechanics . The game is very Bullet Hell and can be very challenging. The game has very old school vibrant look and runs pretty slick. The games soundtrack is good enuf to enjoy as you play. The Boss Battles are pretty neat and challenging also with so much going on!\n\nI say if you like old school arcade shooters pick this one up ! \n\n{{Side note also the DEV is a really nice guy and im sure if thier is any issues with the game im sure he will address it ASAP.}}", "timestamp_created": 1467032749, "timestamp_updated": 1467033020, "voted_up": true, "votes_up": 19, "votes_funny": 1, "weighted_vote_score": "0.660443", "comment_count": "3", "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23713686": {"recommendationid": "23713686", "author": {"steamid": "76561198042083466", "num_games_owned": 65, "num_reviews": 7, "playtime_forever": 120, "playtime_last_two_weeks": 0, "last_played": 1493325439}, "language": "english", "review": "Ok at first when i got email asking me to reaview this game i thoguh \"oh no another developer trying to promote his game\" but then i though to give it a try and it was actually damn fun , from amazing challenge to great visuals the game seem to entertain the f*ck out of me . So yeah i decided to make a Gaming Spotlight episode after all :) https://www.youtube.com/watch?v=g1sSN8emIpw", "timestamp_created": 1466628706, "timestamp_updated": 1466628706, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23709250": {"recommendationid": "23709250", "author": {"steamid": "76561198036535976", "num_games_owned": 294, "num_reviews": 9, "playtime_forever": 102, "playtime_last_two_weeks": 0, "last_played": 1465876844}, "language": "english", "review": "\"Overall, Hyper Bounce Blast is an amazingly fun experience that should be picked up by gamers that like a bit of a challenge from their shooters. The bounce mechanic offers something a bit different that also adds a whole new layer to this kind of game. Much like Horizon Shift, we definitely recommend Hyper Bounce Blast.\"\n\nhttp://attackongaming.com/original-articles/hyper-bounce-blast-review/", "timestamp_created": 1466614084, "timestamp_updated": 1466614084, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23689747": {"recommendationid": "23689747", "author": {"steamid": "76561197993402398", "num_games_owned": 159, "num_reviews": 1, "playtime_forever": 23, "playtime_last_two_weeks": 0, "last_played": 1465527643}, "language": "english", "review": "This is a really fun game! Super Fun to play! Get those High Scores and Feel like a Super Pro all while dodging tons of Projectiles!!!\nIf your looking for some fun then check out Hyper Bounce Blast! You won't be disappointed!!!\n\nhttps://www.youtube.com/watch?v=5MHuXbknmG0", "timestamp_created": 1466532028, "timestamp_updated": 1466532105, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23671260": {"recommendationid": "23671260", "author": {"steamid": "76561198000764871", "num_games_owned": 573, "num_reviews": 14, "playtime_forever": 286, "playtime_last_two_weeks": 0, "last_played": 1466361065}, "language": "english", "review": "Fun static screen, bullet hell, platformer, arcade, scoregasm title! This game is a static screen shmup with a twist. That twist is the ability to jump up onto some enemies to boost your score and becoming invulnerable to bullets in the process. This may be the most entertaining mechanic in any game I've ever played. It'll take some time to nail down your platform movement while still hitting your targets, but once you get on point you feel like a legit boss! Hyper Bounce Blast has tons of replay value and is super entertaining. Personally I can't get enough of these fast paced arcade titles.", "timestamp_created": 1466440785, "timestamp_updated": 1466440785, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "4.980100", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23665335": {"recommendationid": "23665335", "author": {"steamid": "76561198033402237", "num_games_owned": 56, "num_reviews": 2, "playtime_forever": 144, "playtime_last_two_weeks": 0, "last_played": 1479570727}, "language": "english", "review": "A fun and challenging game where you will feel like a pro getting highscores and just barely dodging bullets.\n\nFirst impression:\nhttps://www.youtube.com/watch?v=ZUmEshgDG5U", "timestamp_created": 1466410903, "timestamp_updated": 1466410903, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.653998", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23617193": {"recommendationid": "23617193", "author": {"steamid": "76561198070668774", "num_games_owned": 396, "num_reviews": 11, "playtime_forever": 579, "playtime_last_two_weeks": 0, "last_played": 1465957991}, "language": "english", "review": "Do you like bullet hell shoot em ups and platforming? Well you should check out Hyper Bounce Blast. The creators of Horizon Shift, Flump Studios are back again for some adrenline pumping action. If you played Horizon Shift, you will definitely fall in love with this game as well, with great gameplay modes, great graphics, and easy controls. A leaderboard can also be found, where you can see if you can get the highest game score. Hyper Bounce Blast is addicting, tough, and fun!\n\nI did a full review of Hyper Bounce Blast below:\n\nHeavy Metal Gamer: Hyper Bounce Blast Review:\nhttp://www.youtube.com/watch?v=27dLhw8iqRM\n", "timestamp_created": 1466183122, "timestamp_updated": 1466183122, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.524627", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23576728": {"recommendationid": "23576728", "author": {"steamid": "76561197966072008", "num_games_owned": 516, "num_reviews": 3, "playtime_forever": 6, "playtime_last_two_weeks": 0, "last_played": 1466025953}, "language": "english", "review": "What do you get if you try to put the mechanics of a Mario game into a shmup? Hyper Bounce Blast is what!\n\nThis game is awesome, it's like shmup equivalent of patting your head whilst rubbing your tummy - playing a twin stick shooter to kill off the red / green bad guys whilst simultaneously trying to keep airbourne by bouncing off the blue ones so that your shield stays active and you can absorb enemy bullets to charge your hyper for the bosses.\n\nLike all shmups it improves as you learn the levels, and the bosses are sort of where this game shines, they're a cross between the koopa bosses out of Super Mario World on the SNES and geometry wars.\n\nRegardless of anything else, this game is worth owning just for the sheer audacity of the play mechanic combination!!", "timestamp_created": 1466026273, "timestamp_updated": 1466026273, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23572360": {"recommendationid": "23572360", "author": {"steamid": "76561197998896178", "num_games_owned": 561, "num_reviews": 65, "playtime_forever": 108, "playtime_last_two_weeks": 0, "last_played": 1466013384}, "language": "english", "review": "Curator Review:\n\n\"I thoroughly enjoyed this game and recommend it as an option for all bullet hell and shoot em up fans. 7.5/10\"\n\nhttps://youtu.be/g-DJsMaSyzQ", "timestamp_created": 1466009064, "timestamp_updated": 1466009064, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23571076": {"recommendationid": "23571076", "author": {"steamid": "76561198016432675", "num_games_owned": 866, "num_reviews": 329, "playtime_forever": 148, "playtime_last_two_weeks": 0, "last_played": 1465926524}, "language": "english", "review": "[b] Target Audience: [/b] [I] SHMUP fans wanting an alternative experience. [/i]\n\n[b] Summary: [/b]\nIf you're looking for the same old same old from the SHMUP experience, you can look away from Hyper Bounce Blast. Just like Horizon Shift, it makes a small twist in the genre by adding a platforming mechanic, and that mechanic is well implemented in terms of gameplay. There's something satisfying to bouncing from enemy to enemy while shooting everything in site. And this core gameplay feels fresh in the genre, even if it may not have a lot of staying power over the long haul. Look, this is a 5 dollar game, and there are things that could have raised the game to the next level in terms of replayability, such as some random enemy formats or different options. But the core experience keeps thing simple and yet fun, allowing you to focus on small simple bite-sized elements in the game that combine to a good couple hour experience. It's a developer that doesn't want to make the same old game: he's experimental: and not in the “artsy” type of way. It's the gameplay mechanics he plays with: and I will openly admit, I'm always fascinated by those who try something different in a genre that usually keeps things safe. And good on Flump studios for producing games that change things up: and deliver an enjoyable experience.\n\n[b]Video Review: [/b] https://www.youtube.com/watch?v=jUGUbQabLmI\n\n[u] Lists: [/u]\n[b]Positives:[/b]\n[list]\n[*]  The addition of the platforming mechanic adds to the chaos, and it does work. Gives good incentive to use with not only the point multiplier, but the ability to absorb bullets. Complements gameplay, without being distracting.\n[*] Boss battles do a good job of testing skill, without being overly complicated. Introduces small new mechanics that don't go too far off what has been played up to that point.\n[*] Simple aesthetic compliments the gameplay here. Simple to see action, and even through the chaos, I felt like I could easily see everything at all times.\n[*] Bank system is cool. Gives good incentive while not being forced to use it. A good point chasing mechanic.\n[*] Color mechanic. Every enemy is easily identifiable in terms of weaknesses because of this color system. Good information that's easily processed by the player.\n[*] Controls works for the game on both the controller and keyboard/mouse (I prefer the controller here). \n[*] Music selection once again complements the action here (yes, I have used the word complement a lot in this review, but when a word works, it works.)\n[/list]\n\n[b]Negatives:[/b]\n[list]\n[*] Some modes don't work, like the Tournament mode. The new platforming mechanic + the speed element makes movement too fast, not letting you capitalize on the gameplay in question. \n[*] A mode that had some randomization of enemy placement would have really taken the replayability of the game to the next level. \n[*] A lot of my complaints really comes down to mechanics regarding the length/variety of the game over time. Again, at the 5 dollar price tag, I shouldn't expect a lot, but I do wonder if the next game in the series can really push the envelope with enemy variety and mechanics, and make a indie hit. I end up wanting more.\n[*] Would have liked to see an option to change the color on the aiming reticle. The gray on the black background, while not distracting, doesn't really help. \n[/list]\n", "timestamp_created": 1466003850, "timestamp_updated": 1466003850, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.562259", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23570792": {"recommendationid": "23570792", "author": {"steamid": "76561198046203976", "num_games_owned": 223, "num_reviews": 33, "playtime_forever": 9, "playtime_last_two_weeks": 0, "last_played": 1465816018}, "language": "english", "review": "Hyper Bounce Blast is a stomach-churning retro shooter blended with classic platforming action. Bounce, shoot and dodge to survive the ever-increasing enemy attack. Bring it on! https://youtu.be/J8cgA-nwmoo", "timestamp_created": 1466002716, "timestamp_updated": 1466002716, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23555998": {"recommendationid": "23555998", "author": {"steamid": "76561198095717084", "num_games_owned": 25, "num_reviews": 5, "playtime_forever": 156, "playtime_last_two_weeks": 0, "last_played": 1467311423}, "language": "english", "review": "This game is absolutely amazing and really reinvigorates this genre of gaming. Thank you Flump Studios for sending me a key to this game.\nhttps://www.youtube.com/watch?v=HJ7km8aCQfg", "timestamp_created": 1465927311, "timestamp_updated": 1465927311, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23554903": {"recommendationid": "23554903", "author": {"steamid": "76561198126482345", "num_games_owned": 861, "num_reviews": 8, "playtime_forever": 163, "playtime_last_two_weeks": 0, "last_played": 1486436672}, "language": "english", "review": "Hey guys what can i say I love this game its a fast pace bouncey platformer shootumup dodge game. It has great music and is a hella lot of fun check out my video of the game.\nAlso the devs are amazing .\n\n\n\n\nhttps://www.youtube.com/watch?v=vbrvl6Z4GvY", "timestamp_created": 1465923314, "timestamp_updated": 1465923314, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23541685": {"recommendationid": "23541685", "author": {"steamid": "76561198053768800", "num_games_owned": 66, "num_reviews": 3, "playtime_forever": 136, "playtime_last_two_weeks": 0, "last_played": 1466031182}, "language": "english", "review": "Yo everyone! This game is pretty stellar. Fast paced, tight controls, just overall a... Blast to play! I did to a series on it, starting today, which you can check out right here! https://youtu.be/DYFecer5yrA\n\nThe series will be 8 episodes long, playing and going over each game mode, and taking some Hi-Scores on the leaderboard!\n\nHope you all enjoy this game as much as I did!", "timestamp_created": 1465846817, "timestamp_updated": 1465846817, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23541124": {"recommendationid": "23541124", "author": {"steamid": "76561198019169430", "num_games_owned": 491, "num_reviews": 170, "playtime_forever": 214, "playtime_last_two_weeks": 0, "last_played": 1466853188}, "language": "english", "review": "Hyper bounce blast isn't an easy game, if you're used to the games of the same developer, you know what I'm talking about. The game's a 'bullet rain simulator', as bouncing basically makes you invincible from everything, so you understand that touching the ground geanerally means instadeath.\nGameplay is super fast, music is not bad, visuals are nice (framerate isn't super smooth tho), and skill is really all you need to beat the game.\nI know this kind of game isn't for every gamer, so I'd say this is a good value for those who like these hard challenging games.\nI hope I could help you decide buying it or not!\n\nPS: Achievement hunters beware", "timestamp_created": 1465844536, "timestamp_updated": 1465844536, "voted_up": true, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.524627", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23526986": {"recommendationid": "23526986", "author": {"steamid": "76561198054715218", "num_games_owned": 69, "num_reviews": 3, "playtime_forever": 37, "playtime_last_two_weeks": 0, "last_played": 1480373759}, "language": "english", "review": "Absolutely love this game to bits. Played a lot of Geometry Wars on my DS many years ago and this gave me a similar vibe aestheically, but I kindof expected a clone when I first played it. I was really wrong though, the mixture of the platforming makes it feel really fluid, and the mass of bullets around you becomes a blur as you bounce around then land and suddenly realise how massively screwed you are. Play. This. Games. Forreal. I saw this game on insomnia first and the guy gave me a freaking key, but I assure you that my gushing is honest. I can't wait to be done from exams so I can smash out even more of this game.", "timestamp_created": 1465764130, "timestamp_updated": 1465764130, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23526861": {"recommendationid": "23526861", "author": {"steamid": "76561198220400565", "num_games_owned": 92, "num_reviews": 1, "playtime_forever": 142, "playtime_last_two_weeks": 0, "last_played": 1465778671}, "language": "english", "review": "Recorded a video for this game. I had great fun for it. It was unique and speical. Defo worth buying for those who are reading the reviews. I was offered this game on my Youtube channel to give it a review. It was great fun!\n\nhttps://www.youtube.com/watch?v=oNVTxc0yKWQ", "timestamp_created": 1465763596, "timestamp_updated": 1465773952, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23523114": {"recommendationid": "23523114", "author": {"steamid": "76561198031854472", "num_games_owned": 596, "num_reviews": 1, "playtime_forever": 331, "playtime_last_two_weeks": 0, "last_played": 1468113388}, "language": "english", "review": "Hyper Bounce Blast is a fun SHMUP Platformer.  The game has simple controls to play which are hard to master.  The main thing to remind yourself while playing is that bouncing is life, never stop bouncing.    \nAfter beating Arcade classic, the player has the option to make the game more difficult by changing the settings of the game or playing one of the different modes.  This adds more replayability to the game and allowed for some fun experimentation of how different the game can be given the right parameters.\n\nTo any fans of SHMUPs/Bouncing I would definitely reccomend this game. \n\nAs it is the game has about 6 modes and the capability to jump into any wave the player chooses once that wave has been completed.\n\nHere are the modes offered by the game :\nArcade Classic \n   Start with 3 lives and work your way through all the phases of the game.\nArcade Arrange\n   Start with zero lives and work your way through all the phases of the game.  Checkpoints after each level\nTime Rush\n   Start with fully powered-up ship while the game increases speed with each wave\nTournament Mode\n   Start at 200% speed with 3 lives to get through the whole game\nFree Run\n   Infinite lives but your score is halved each time you die\nBoss Challenge \n   Beat all the bosses with 1 life\n\nHere is a video I made covering some of these modes.\nhttps://youtu.be/FFeb5Xw4ibU\n", "timestamp_created": 1465749253, "timestamp_updated": 1465749253, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23517583": {"recommendationid": "23517583", "author": {"steamid": "76561197975699292", "num_games_owned": 904, "num_reviews": 1, "playtime_forever": 174, "playtime_last_two_weeks": 0, "last_played": 1464142090}, "language": "english", "review": "While it may look simple, Hyper Bounce Blast offers a wildly addictive gameplay mechanic that sees players bouncing off walls and jumping on enemies. It's a clever gimmick that is unlike any other shoot-em-up I've seen before and is worth the price of admission alone. That said, the 30 stages are over too soon and I wish there were more power-ups to play around with. But even though it never fully reaches its potential, Hyper Bounce Blast is a fun and unique 2D shooter.\n\nhttps://www.youtube.com/watch?v=TGFz7-hCVJY", "timestamp_created": 1465725570, "timestamp_updated": 1465725570, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.528364", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23509831": {"recommendationid": "23509831", "author": {"steamid": "76561198166566291", "num_games_owned": 267, "num_reviews": 2, "playtime_forever": 272, "playtime_last_two_weeks": 0, "last_played": 1465683897}, "language": "english", "review": "Very cool and creative twin-stick shoot 'em up with platforming elements. If you are a fan of bullet hell shooters or if you like good games in general, you might want to check this one out. The elaborate scoring system makes it a fantastic arcade game that you can sink countless hours into. The developer is also very helpful and fixed a problem I had with the controls right away.", "timestamp_created": 1465681685, "timestamp_updated": 1465681685, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23488224": {"recommendationid": "23488224", "author": {"steamid": "76561198120884285", "num_games_owned": 423, "num_reviews": 26, "playtime_forever": 109, "playtime_last_two_weeks": 0, "last_played": 1465523984}, "language": "english", "review": "Flump Studios contacted me and asked me to review/spotlight the game on my channel. First of all, let me state that Flump Studios is incredibly humble, kind and generous. Second, this game is absolutely genius in so many different ways.\nFind out more info in the quick video I did:\nhttp://www.youtube.com/watch?v=jUwJm69DcVU&feature=gp-n-y&google_comment_id=z13det2hnsbyyl0sl225txri2uetzjpr504\n1. Perfect blend of shooter and platformer\n2. Unique multiplier system\n3. Difficult, yet incredibly fun gameplay\n4. Involves multitasking, tactics and strategy in a super fun way\n5. Fast paced, blood-pumping action\n6. AMAZING soundtrack from Quantum Firefly\n7. Six different game modes\nI recommend this game to anyone. If you love shooters, platformers, retro-style, 2D and more. Especially if you grew up in the age of Galaga in the arcades - this game is for you.\nOnce I get more than 20 hours on record, I plan to update my review. For now, here it is :)", "timestamp_created": 1465582029, "timestamp_updated": 1465582029, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.524627", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23476740": {"recommendationid": "23476740", "author": {"steamid": "76561198036611695", "num_games_owned": 528, "num_reviews": 10, "playtime_forever": 16, "playtime_last_two_weeks": 0, "last_played": 1465518646}, "language": "english", "review": "I always look forward to trying out a new Flump Studios shooter -- look forward to, and dead. I dread having my fragile mind blasted into tiny mewling fragments while trying to come to grips with the batshit crazy mechanics I come to expect from these games.\n\nFlump Studios' games always demand your brain be running on more than one core. You're gonna need those extra threads to handle all the bizarre, out of context, new and fresh tasks they relentlessly pummel you with.\n\nHyper Bounce Blast is guilty of all of the above -- and it's freakin RAD. My favorite thing about this developer is his ability to subvert the shooter genre. Sure, this is kind of a 'vertical shooter'... but it's also a twin stick shooter, a platformer (with walljumping... WALLJUMPING) and a puzzler.\n\nThrow all of that in a blender with a super slick presentation and an awesome soundtrack, and you wind up with this... infuriatingly gorgeous video game that has (probably) \"for adrenaline junkies only\" plastered all over it.\n\nI salute Flump Studios for bringing me one step closer to a straight jacket being mandatory and therefore eliminating wardrobe decisions... AND giving me an alternative to caffeine.  <3 <3", "timestamp_created": 1465518217, "timestamp_updated": 1465518217, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23475869": {"recommendationid": "23475869", "author": {"steamid": "76561198240862168", "num_games_owned": 2398, "num_reviews": 101, "playtime_forever": 165, "playtime_last_two_weeks": 0, "last_played": 1465521858}, "language": "english", "review": "[h1]Introduction[/h1]\nHyper Bounce Blast was developed by Flump Studios and published by KISS ltd. It is described as a Shoot Em' Up combined with the classic platformer style which is kind of unique for this style of gameplay. It also seems to be a sort of bullet hell game but without the free flying and sort of wall jumping along.\n\n[h1]Gameplay[/h1]\nThis game seems to be a rather different kind of Shoot Em' Up/Bullet hell game with some platforming elements combined into the game, which make it much harder than your average Bullet Hell / Shoot Em' Up. The main mechanic is being able to wall jump from the left and right wall, which means there is also gravity involved in the game. This really separates it from other similar games of this genre, and makes a different sort of gameplay style from other games like this. I rather liked the platforming elements that are implemented into the game, it gives it that more difficult sort of feel when you are trying to avoid the bullets but are trapped in the corner.\n\nAlthough it seems to be that bit more different from the other sort of games of this genre, it does have a big flaw that I personally don't like. Some of the bosses in the game have a rapid amount of bullets that are being shot at you, and compared to the size of your character makes it so difficult to avoid the bullets. Especially if you wall jump and try to swerve your way through the bullets you are almost certain to get hit. I really don't like this, even though this game is really fun, but just a bit too difficult that takes some of that fun out of the game.\n\nWith the game being practically the same over and over again, you would expect there to be several different types of game modes. Some of which are locked and can be unlocked by progressing far enough into other game modes. You have the Arcade Classic, start with 2 lives and try to fight through all the waves, you get a checkpoint before and after each boss battle. Arcade Arrange is the same as Arcade Classic except you have no extra lives but you get a checkpoint after each level. Time rush, see how far you can get with in a fully powered up ship when the game speeds up each wave. Lastly there is Tournament Mode, see how far you can get in a fully powered up ship with each wave increased speed.\n\nThere is a nice range of different game modes to keep you entertained for longer than you normally would. There are also 2 locked gamemodes which I don't know what they are as I haven't progressed enough to unlock them. I for one don't personally like the locked gamemodes for the game, forces you to get far into the game to unlock other modes which you may or may not like. There is online leaderboards, if you are the more competitive sort of players and want to try to beat other people at their score, I for one am not very competitive so it doesn't compel me to play more and try to beat other peoples score.\n\n[h1]Pros[/h1]\n+ Has some platforming elements, makes it unique from other games of the similar genre\n+ Lots of Game Modes\n+ Online Leaderboards\n+ Full Controller Support\n+ Steam Trading Cards & Achievements\n\n[h1]Cons[/h1]\n- Lots of bullet, makes the game too hard and takes some fun from the game\n- 2 Locked gamemodes, unsure why they are locked\n\n[h1]Result / Final Thoughts[/h1]\nHyper Bounce Blast is a unique Shoot Em' Up / Bullet Hell game that has some platforming elements to it, the game itself is fairly difficult a bit too difficult that it takes the fun out of it at times. There is plenty of game modes to play through, although two of them are locked. There is a competitive leaderboard, full controller support, steam trading cards and Achievements. Would recommend to those of you who love Bullet Hell games.\n\n[b]Rating: 6.8/10[/b]", "timestamp_created": 1465513683, "timestamp_updated": 1465513859, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.549307", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23475444": {"recommendationid": "23475444", "author": {"steamid": "76561198083824220", "num_games_owned": 110, "num_reviews": 15, "playtime_forever": 38, "playtime_last_two_weeks": 0, "last_played": 1465500747}, "language": "english", "review": "This game.. OMG This game. Take bullet hell, take arcade style shooter, taking bounce chain mechanic from Mario, and some wall jumping, mix it all together and you get this greatness!\n\nThe gameplay seems simple but it's actually fairly difficult and that's what makes it addicting. I don't know about anyone else but it is SUPER satisfying to bounce through a whole level. And when you die when you're decently far, you just have to play again! So much fun!!\n\nSoundtrack is upbeat and goes very well with  the gameplay, not much more to say there.\n\nAnd when it's all said and done you can even up the game speed up to 200% for some insanely fast bouncing shooting action. I was just laughing so hard as I struggled with this sudden need for speed but it's still so much fun!!\n\nI got the game for free from the developers, they are super friendly, however this is a 5 dollars that is definitely sure to keep you entertained for hours!\n\n5/5 =]\n\n~Dan \n\nIf you want, you can check out my first experience with the game below. Nothing too crazy but you can get my reactions to take my word for it!\n\nhttps://www.youtube.com/watch?v=lnWaB6tOlFQ", "timestamp_created": 1465511668, "timestamp_updated": 1465511668, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23453901": {"recommendationid": "23453901", "author": {"steamid": "76561198277984478", "num_games_owned": 374, "num_reviews": 141, "playtime_forever": 47, "playtime_last_two_weeks": 0, "last_played": 1467678878}, "language": "english", "review": "Once I got the hang of this, I really started to enjoy it!\nI was alittle upset there's no way to map the jump button to something you want on a gamepad, the 3 presets just don't do it for me, jumping with r trigger isn't very natural .\nAside of that, I love the progression, the checkpoints, and the unique bosses ^^\nVery much recommend this to players that enjoy shoot em ups, but are looking for a unique twist to a stale format ^^", "timestamp_created": 1465401797, "timestamp_updated": 1465401797, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.381949", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23418641": {"recommendationid": "23418641", "author": {"steamid": "76561198119838973", "num_games_owned": 250, "num_reviews": 2, "playtime_forever": 43, "playtime_last_two_weeks": 0, "last_played": 1465217349}, "language": "tchinese", "review": "~個人該遊戲取得來自作者~\n這算是一款休閒小品遊戲，玩法簡單卻又不簡單\n簡單的純粹：閃子彈、打敵人，踩方塊作連擊刷高分。\n不簡單在於要左右協調。一手控制方向，一手控制射擊目標。建議開自動射擊\n剛接觸容易眼花撩亂手忙腳亂，熟悉關卡跟控制踩方塊的技巧後就容易上手\n特別是跳躍踩方塊，除了加分外最主要有保護作用能無視攻擊傷害。算是該遊戲核心攻略手段。\n\n目前遊戲的鍵盤控制，跳躍移動判定上頗生硬，不能如預想的作精細移動或跳躍，無法一起手就如示範影片般流暢控制(或許要用搖桿之類吧)特別是跳躍往上時碰觸其他方塊，不如預期般地給予再跳躍高度跟滯空控制，常導致踩方塊失敗。\n", "timestamp_created": 1465222588, "timestamp_updated": 1465222588, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23380968": {"recommendationid": "23380968", "author": {"steamid": "76561198044469409", "num_games_owned": 1791, "num_reviews": 355, "playtime_forever": 235, "playtime_last_two_weeks": 0, "last_played": 1465626512}, "language": "russian", "review": "Hyper Bounce Blast - это неплохой ретро шутер с элементами платформера. 6  различных  режиммов не дадут вам заскучать, а задорный саунд, написанный музыкантом Quantum Firefly добавит еще больше удовольствия от игры.", "timestamp_created": 1465050545, "timestamp_updated": 1465655567, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.360797", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23367366": {"recommendationid": "23367366", "author": {"steamid": "76561198052514327", "num_games_owned": 1192, "num_reviews": 56, "playtime_forever": 237, "playtime_last_two_weeks": 0, "last_played": 1464977864}, "language": "english", "review": "Funny and creative game :)", "timestamp_created": 1464983916, "timestamp_updated": 1464983916, "voted_up": true, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.579677", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23342453": {"recommendationid": "23342453", "author": {"steamid": "76561198060277415", "num_games_owned": 2216, "num_reviews": 630, "playtime_forever": 214, "playtime_last_two_weeks": 0, "last_played": 1464866040}, "language": "english", "review": "Hyper Bounce Blast is a game that I recommend because:\n- is a method to banish boredom\n- it has a good price\n- it has action \n- it is indie \n- it has trading cards\n\nEnjoy!", "timestamp_created": 1464866848, "timestamp_updated": 1464866848, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.261587", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23340748": {"recommendationid": "23340748", "author": {"steamid": "76561198011965365", "num_games_owned": 1691, "num_reviews": 1581, "playtime_forever": 739, "playtime_last_two_weeks": 0, "last_played": 1464970754}, "language": "english", "review": "Please NOTE:I did receive the game by the Developer.. \nGreat arcade stylish game! All you do is hold on the fire button, move around, and jump on the blue disk for multipliers which will also let you absorbed bullets for a small amount of time. Enjoyed the boss fights. Boss fights you can fight him straight on or hit the blue disk trying to get extra damage on him. Soundtrack actually goes really well with the game. After the 9th wave the game becomes a huge cluster mess!!\n\nPros\n-Boss battles\n-6 game modes to play (2 are locked)\n-Change effects (dynamic, scanlines, Crt, Inverse, overglow, and None\n-Change game speed &  auto fire\n-Colorful \n- online leaderboards\n-Game over, you can restart game or restart last checkpoint\n-Ingame scores to challenge friends and family to beat your high score\n\nCons\nNo coop or local coop", "timestamp_created": 1464857257, "timestamp_updated": 1465343172, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.535112", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23317897": {"recommendationid": "23317897", "author": {"steamid": "76561198072746024", "num_games_owned": 166, "num_reviews": 1, "playtime_forever": 119, "playtime_last_two_weeks": 0, "last_played": 1465332543}, "language": "english", "review": "Another sterling effort from Flump Studios. As an old-school gamer, I alwys value playability over any kind of story.\n\nThis title, much like the previously released Horizon Shift, epitomises how a progressive, balanced and well implemented set of gameplay mechanics can take a genre like the humble shmup and bring it bang up to date.\n\nAfter 5 waves, i was interested... After 10 waves, i was hooked! Invest your time into learning the stages and see your scores increase almost exponentially. Soon you\\'ll be bouncing and blasting your way around the screen with reckless abandon. And your reward for mastering these mechanics...? You can play them again, with MUCH harder settings!\n\nIf you consider yourself a lover of games, you really should own this one. Sublime work!", "timestamp_created": 1464737260, "timestamp_updated": 1464737260, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23317776": {"recommendationid": "23317776", "author": {"steamid": "76561198204814851", "num_games_owned": 141, "num_reviews": 12, "playtime_forever": 184, "playtime_last_two_weeks": 0, "last_played": 1464651377}, "language": "english", "review": "Hello everybody, Shaun Meyers here from Universal Gaming Reviews to bring you a short summary/review for Hyper Bounce Blast by Flump Studios.\n\nIf you\\'d like to read our full review, you can find it here: https://www.universalgamingreviews.com/hyper-bounce-blast-overview-and-review/\n\nHyper Bounce Blast is a unique combination of a bullet hell shoot \\'em up game and a 2D platformer. You control a circular \\\"ship\\\" as you defeat red enemies and bounce on blue ones.\n\nThe game has a wide range of different game modes to choose from including Arcade Classic, Time Rush and Tournament mode with 2 secret, unlockable modes that are just too hot to handle!\n\nThere\\'s also a lot of customization options you can mess with like game speed (Up to 200%) and various visual effects like pixelate or inverse (Inverse will set your cornias on fire, you have been warned).\n\nThe game is definitely Flump Studios\\' best release to date and they\\'ve improved on their shoot em up formula quite a bit with Hyper Bounce Blast as well and it\\'s great to finally have seen the final product as well.\n\nWe gave Hyper Bounce Blast 4.2 stars out of 5 in our full review and we\\'re going to be giving the game our recommendation here on Steam as well. Defijnitely worth checking out if you\\'re a fan of bullet hell games.\n\nWe\\'ve also recorded a gameplay video which you can find below, happy gaming!\n\nhttps://www.youtube.com/watch?v=weTfbhqOffE", "timestamp_created": 1464736728, "timestamp_updated": 1464736728, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23300851": {"recommendationid": "23300851", "author": {"steamid": "76561198187805790", "num_games_owned": 122, "num_reviews": 1, "playtime_forever": 8, "playtime_last_two_weeks": 0, "last_played": 1464656344}, "language": "english", "review": "Great game, I have only been able to play it breefly however I will find my self exploring this game for various hours in the near future. \nGreat gameplay quite easy to understand for new players, I've found in the short time I've played that the level difficulty is great is not too difficult but it does pressent a challenge.\n\nAmazing and entertaining game over all.", "timestamp_created": 1464656363, "timestamp_updated": 1464656363, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.528364", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23297990": {"recommendationid": "23297990", "author": {"steamid": "76561198043663560", "num_games_owned": 71, "num_reviews": 3, "playtime_forever": 53, "playtime_last_two_weeks": 0, "last_played": 1451964393}, "language": "english", "review": "fuck\n\nthats fun", "timestamp_created": 1464642045, "timestamp_updated": 1464642045, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23291883": {"recommendationid": "23291883", "author": {"steamid": "76561198109606362", "num_games_owned": 1254, "num_reviews": 30, "playtime_forever": 115, "playtime_last_two_weeks": 0, "last_played": 1496163561}, "language": "english", "review": "The developer asked me to test the controls for this game to see if everything felt normal, I'm glad to say that the controls are fine and have no issue to them, and even if you don't like them you can always change them in the main menu. I would also like to mention that the developer is a cool person and is willing to talk to customers about problems they have with their product.\n\nHere is my honest review, this review reflects my feelings towards this game and it's soundtrack.\n\nThe game is just pure fun. To go into more detail the game has unique concepts that blend well when you are playing the game. The platforming feels great, satisfyang, and responsive, which leads to some satisfyiong jump combos. The shooting also does it's job just fine. I use mouse and keyboard instead of controller, but I can only imagine that controllers are better than the M+K setup. The game is in all honesty just pure fun, I genuinely can't think of any cons at the moment; not to say that there aren't any cons, but none of any significance.\n\nI'm glad to say that the soundtrack is just as awesome as the game itself. The soundtrack not only sounds great, but also matches the game through the type of rythm's. During the waves of enemies the soundtrack is energetic, but before a boss it switches to give you a sense of approaching danger, then it goes to a new song that is different then the ones played during the waves. \n\nAll in all I couldn't recommend this game enough, espescially since the asking price is only 5$. I would also recommend everyone to check out other flump studio games, they are all fun.", "timestamp_created": 1464620099, "timestamp_updated": 1464620099, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23291699": {"recommendationid": "23291699", "author": {"steamid": "76561197963250636", "num_games_owned": 1389, "num_reviews": 7, "playtime_forever": 57, "playtime_last_two_weeks": 0, "last_played": 1464568017}, "language": "english", "review": "It have the worst dexterity and I'm terrible at it, but Hyper Bounce Blast feels less like a traditional schmup and more like an expansion of Undertale's brilliant bulletboard soul modes - developing the engaging platforming/collecting/avoiding dynamic and throwing more stuff on the screen that you can comfortably deal with. \n\nI have a really strange itch to keep playing.", "timestamp_created": 1464619415, "timestamp_updated": 1464619415, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.504132", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23286101": {"recommendationid": "23286101", "author": {"steamid": "76561197996501781", "num_games_owned": 408, "num_reviews": 1, "playtime_forever": 76, "playtime_last_two_weeks": 0, "last_played": 1465026680}, "language": "english", "review": "This game is a very creative take on a shmup with platforming elements. Shoot the reds, bounce on the blues. Kill all of the few green enemies in each wave to reach a very fun bonus round. Gameplay is simple and easy to start, but difficult to master with so much going on! I was immediately reminded of Geometry Wars not only by the visual style but also by the mess of things happening all at once. Fortunately, in this game you are completely invulnerable to enemy attacks as long as you stay airborne by bouncing off the blue enemies. As an added bonus, when bouncing, you actually absorb enemy fire to power up your screen-obliterating special attack! Despite the invulnerability, it can still be quite challenging as blue enemies aren't always spaced out evenly. If you aren't keeping the reds and their projectiles thinned out, hitting the ground can spell the instant loss of a life. Boss battles limit your bouncing and provide a bit more of a bullet hell experience, but are not too challenging and very fair once you learn their patterns.\n\nAll in all, Hyper Bounce Blast is a lot of fun and can be very addicting. I definitely recommend it!", "timestamp_created": 1464588531, "timestamp_updated": 1464588531, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23280303": {"recommendationid": "23280303", "author": {"steamid": "76561197974007233", "num_games_owned": 8339, "num_reviews": 15, "playtime_forever": 139, "playtime_last_two_weeks": 0, "last_played": 1515263656}, "language": "english", "review": "A shmup with a twist: shoot the reds and avoid their fire as you try to bounce off the blues to gain a shield and rack up bonuses. And don't forget  to destroy the greens for extra points while you're at it. Yes, it does get a wee bit hectic. All in glorious 80s inspired neon and laser art.", "timestamp_created": 1464555354, "timestamp_updated": 1464555354, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.565217", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23273931": {"recommendationid": "23273931", "author": {"steamid": "76561197992307996", "num_games_owned": 162, "num_reviews": 9, "playtime_forever": 23, "playtime_last_two_weeks": 0, "last_played": 1491160951}, "language": "brazilian", "review": "Esse é mais um jogo incrivelmente bom da Flump Studios!\nClaramente um upgrade do Horizon Shift.\n\nA criatividade deles é sem limites! Shmup e Plataforma!", "timestamp_created": 1464533798, "timestamp_updated": 1464533798, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23268949": {"recommendationid": "23268949", "author": {"steamid": "76561198004462117", "num_games_owned": 323, "num_reviews": 2, "playtime_forever": 12, "playtime_last_two_weeks": 0, "last_played": 1464513960}, "language": "english", "review": "Awesome game again from Flump studios. The platforming and Shmup genres actually go really well together and it makes for a frantic balance of trying to jump up and get the massive scores while still trying to stay alive. It really adds another dimension to the game.\n\nIf you're looking for some crazy Shmup action, this is the game for you.\n\nNot to mention the sound track is pretty cool!", "timestamp_created": 1464514178, "timestamp_updated": 1464514178, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23267795": {"recommendationid": "23267795", "author": {"steamid": "76561197984496626", "num_games_owned": 741, "num_reviews": 3, "playtime_forever": 25, "playtime_last_two_weeks": 0, "last_played": 1464506877}, "language": "english", "review": "Hyper Bounce Blast is a sort of follow up to Horizon Shift, as in it's an another game that puts an another new twist on the classic arcade shooter genre. Now Horizon Shift was a cool game however I felt confused by it's mechanics at times (probably my own fault because i'm not that used to crazy mechanics) however this game is a completely different story.\n\nHBB's main mechanic is as expected, bouncing! You bounce off blue platforms and enemies and while you are in the air bouncing, you cannot be killed and the higher you bounce, the more points you will get when shooting enemies. \n\nSo it becomes an interesting game of multitasking because you have to maintain your bouncing while also dealing with enemies and obstacles that appear in later waves and frankly? It never gets TOO HARD, it's always fair, so when I mess up it is my fault because I wasn't paying attention because everything in this game is telegraphed very well in advance.\n\nAlso the bosses definitely not dissapoint and make full use of the mechanics, so expect hectic platforming shooting action on those!\n\nOverall, I highly recommend this game for everyone, even those who do not play these games. PS. Try to get 5 stars so you can witness the amazing tribute to a classic ;)", "timestamp_created": 1464508665, "timestamp_updated": 1464508665, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.528700", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23266603": {"recommendationid": "23266603", "author": {"steamid": "76561198035764429", "num_games_owned": 163, "num_reviews": 2, "playtime_forever": 121, "playtime_last_two_weeks": 0, "last_played": 1464479533}, "language": "english", "review": "A fun twin-shooter that reminds you that bouncing is a blast. A definite recommend to shmup fans ^_^\n\nhttps://youtu.be/m_jzjYHVao4", "timestamp_created": 1464502283, "timestamp_updated": 1464502283, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23258130": {"recommendationid": "23258130", "author": {"steamid": "76561198075297061", "num_games_owned": 218, "num_reviews": 1, "playtime_forever": 53, "playtime_last_two_weeks": 0, "last_played": 1464898528}, "language": "english", "review": "Amazing and unique Shooter from Flump ! Really addictive and will have lots of replay value. I highly recommend you pick this game up !", "timestamp_created": 1464461080, "timestamp_updated": 1464461080, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23251321": {"recommendationid": "23251321", "author": {"steamid": "76561198067605244", "num_games_owned": 302, "num_reviews": 4, "playtime_forever": 5, "playtime_last_two_weeks": 0, "last_played": 1464428733}, "language": "english", "review": "Another great Shooter, unique and with a great soundtrack\nHighly recommend! And the Bonus stage just makes me smile :) Great game\n", "timestamp_created": 1464436950, "timestamp_updated": 1464436950, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.495868", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23246070": {"recommendationid": "23246070", "author": {"steamid": "76561198077528800", "num_games_owned": 135, "num_reviews": 2, "playtime_forever": 234, "playtime_last_two_weeks": 0, "last_played": 1469107730}, "language": "english", "review": "a very creative, simple gameplay for everyone to enjoy. it is not too hard for new gameplayers to enjoy or to get the hang of it.\nI liked that there are different options, music and the fact that it has simple controls. i also liked how bright the game is. \nthe only thing i kind of disliked is the fact in some levels it can be very confusing, but maybe this is just me :D\nGame Play: 7/10 - consdering i play 15minutes of it the first time round\nGraphics: 8.5/10 \nOverall: 15.5/20", "timestamp_created": 1464409325, "timestamp_updated": 1464409325, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.528364", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23243101": {"recommendationid": "23243101", "author": {"steamid": "76561197960650771", "num_games_owned": 120, "num_reviews": 2, "playtime_forever": 43, "playtime_last_two_weeks": 0, "last_played": 1464518744}, "language": "english", "review": "A 2D shmup where Mario jumping meets Jeff Minter-esque shooting. It also feels a like a rhythm action title with the bouncing to the music whilst shooting. It shouldn't work in practice but the Devs have pulled it off in a playable slick package. Great!", "timestamp_created": 1464392502, "timestamp_updated": 1464392502, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.527559", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23241719": {"recommendationid": "23241719", "author": {"steamid": "76561197973052125", "num_games_owned": 2966, "num_reviews": 294, "playtime_forever": 338, "playtime_last_two_weeks": 0, "last_played": 1465866075}, "language": "english", "review": "Fast-paced arcade action; shoot and jump, avoid the bullets until you can aborb them, and get the highest chain you can.\n\nSimple gameplay with a little bit of challenge and strategy.  Feels like my childhood ... especially if you can make it to the bonus round.", "timestamp_created": 1464385773, "timestamp_updated": 1464385773, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23239507": {"recommendationid": "23239507", "author": {"steamid": "76561198175145859", "num_games_owned": 53, "num_reviews": 1, "playtime_forever": 28, "playtime_last_two_weeks": 0, "last_played": 1464376586}, "language": "english", "review": "Really addictive and fun", "timestamp_created": 1464376624, "timestamp_updated": 1464376624, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23237068": {"recommendationid": "23237068", "author": {"steamid": "76561198031151772", "num_games_owned": 498, "num_reviews": 50, "playtime_forever": 302, "playtime_last_two_weeks": 0, "last_played": 1462312949}, "language": "english", "review": "Amazing little shooter, and way better than Flump's other, admittedly fun, games. It's fast, frentic, strategic and brings a nice little twist to the genre. So, again, a lot like Flump's other games. Don't hesitate, snap it up. It's a real steal at this price.\n\nYou can also check out my impressions on the discussions board!\n\nhttp://steamcommunity.com/app/407940/discussions/0/357284767241159919/", "timestamp_created": 1464367345, "timestamp_updated": 1464367345, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500901", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "23233548": {"recommendationid": "23233548", "author": {"steamid": "76561198073535369", "num_games_owned": 669, "num_reviews": 93, "playtime_forever": 2523, "playtime_last_two_weeks": 0, "last_played": 1514634937}, "language": "english", "review": "disclaimer I was a Beta tester \n\n\nIm having so much fun with this,Even though the games short it has a lot of replay value. It has words  explaining how to play hyper bounce blast. hyper bounce blast is very unique to the genres shoot em up.", "timestamp_created": 1464352818, "timestamp_updated": 1479938096, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.543027", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 71, "total_negative": 3, "total_reviews": 74}}
