{"reviews": {"39441476": {"recommendationid": "39441476", "author": {"steamid": "76561197972404696", "num_games_owned": 312, "num_reviews": 6, "playtime_forever": 818, "playtime_last_two_weeks": 75, "last_played": 1516297171}, "language": "french", "review": "Ce jeu peut valoir le coup si vous avez du mal à apprendre les katakana par vous même (par coeur + papier/crayon). C'est peut être plus long d'avancer avec le jeu car vous devez faire des quêtes et vous deplacer. Le jeu en lui même n'est pas interessant (l'intrigue, la psychologie des persos, ...). Néanmoins je le recommande à ceux qu'un livre, une méthode d'apprentissage, etc ont pu refroidir. Là on joue et à l'instar des persos, on apprend quelque chose. C'est une initiative sympa mais dispensable.\n\nA noter que vous aurez besoin d'apprendre à écrire les katanas que vous utilisiez ce jeu ou une autre méthode.  Donc papier + crayon quoi que vous décidiez.\n\nLe vrai point négatif du jeu et sa réusabilité. Vous aurez besoin de reviser souvent pour bien mémoriser. Des outils d'apprentissages en ligne sont bien meilleurs à ce niveau. Là, les menus, les cours divisés par type de katakanas n'aident pas.", "timestamp_created": 1516297978, "timestamp_updated": 1516298898, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39436276": {"recommendationid": "39436276", "author": {"steamid": "76561197970314683", "num_games_owned": 314, "num_reviews": 9, "playtime_forever": 524, "playtime_last_two_weeks": 332, "last_played": 1516279333}, "language": "english", "review": "Let's get the non-negative stuff out of the way first, which is the most subjective part of my review.  I enjoyed the music and artwork for a $7 title.  I'm mixed about the voice acting; the competence of each actor varied quite a bit, and Satomi's was the only one who stood out to me, albeit in a positive way. Understandably, all of the characters have an American accent despite their backstory.  I don't have much to say about the story and whatever else I don't mention.\n\nAs for the negative:\n– No real-time challenges. Whenever you read, speed is important, and this game offers no benefit for speed. Even just having a FF7/8-esque ATB system would be a huge improvement.\n– Difficulty is extremely low. I just rushed through the story and absolutely destroyed everything, including the final boss.\n– The organized Answer menu makes it way too easy to deduce the correct answer for romaji enemies without learning the katakana well.  You can ace all the answers by memorizing slightly over 20% of all the katakana.  OCR could be used instead.\n– The vast majority of the enemies have attributes that scale with how recently you received their associated lesson, making it even easier to deduce the correct answer without learning katakana.\n– Too often, the same enemies will appear in exactly the same positions. Compounded by a menu that remembers your previous commands, this makes it even easier for players to succeed without learning much katakana.\n– Poor balancing between the number of katakana enemies and number of romaji enemies.\n– The challenge castle is pointless. The NPC who takes you there makes it sound like a big deal, but it looks like unfinished content.\n– Katakana [i]words[/i] are shown literally once ever in battle.  In my experience, I've only really encountered individual katakana characters in manga, and they aren't very important.\n– Some of the sidequests require you to purchase a specific item so that you can receive the lesson that helps you identify that item. This is backwards and I don't understand the logic.\n– Barely any \"RP\" in what's sold as an \"RPG\".  Your choices are basically inconsequential, and only have a minor impact during the character affection sequences.\n– The gameplay and design have nothing interesting at all.\n\nThere are way better budget RPGs out there, and if you just want to learn katakana, there are plenty of free katakana flash games out there that would help you learn much faster.  Personally I think playing with a katakana Anki deck is one of the fastest ways to drill individual characters into your head, and if you can't even handle that, then good luck making any meaningful progress towards learning Japanese, one of the hardest languages for people who don't natively speak an East Asian language.", "timestamp_created": 1516282311, "timestamp_updated": 1516338965, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.585253", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39145929": {"recommendationid": "39145929", "author": {"steamid": "76561198285605207", "num_games_owned": 1224, "num_reviews": 247, "playtime_forever": 259, "playtime_last_two_weeks": 0, "last_played": 1515317137}, "language": "schinese", "review": "2D的RPG无中文，掉卡，删游戏。\n[spoiler]习惯性拇指向上，不具参考性[/spoiler]", "timestamp_created": 1515317258, "timestamp_updated": 1515317258, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.478261", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39092687": {"recommendationid": "39092687", "author": {"steamid": "76561198337214950", "num_games_owned": 64, "num_reviews": 3, "playtime_forever": 784, "playtime_last_two_weeks": 570, "last_played": 1515742902}, "language": "russian", "review": "****\nРУС\n****\nХорошая подача материала в игровой форме. Гемплей сделан в виде сюжета, где ты сначала учишь 5 слогов катаканы, а потом ходишь по миру и сражаешься с монстрами, тем самым закрепляя изученный ранее материал. Кроме того в мире есть побочные герои, которые научат основным японским словам, из чтению на хирагане и ромадзи. Так же присутствует некая система прокачки персонажей. Рекомендую покупать игру по скидке, тогда есть шанс окупиться коллекционными карточками.\n\n*****\nENG\n*****\nGood presentation of material in the game form. The gameplay is made in the form of a plot where you first learn 5 syllables of katakana, and then you walk around the world and fight monsters, thereby fixing the material studied earlier. In addition, there are side heroes in the world who will teach basic Japanese words, from reading on hiragana and romaji. There is also a certain system of pumping characters. I recommend buying a game at a discount, then there is a chance to pay off with collectible cards.\n10/10", "timestamp_created": 1515177739, "timestamp_updated": 1515177739, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38533180": {"recommendationid": "38533180", "author": {"steamid": "76561197984752312", "num_games_owned": 131, "num_reviews": 3, "playtime_forever": 722, "playtime_last_two_weeks": 0, "last_played": 1513947775}, "language": "english", "review": "The game itself is pretty easy, but it's great as learning tool.", "timestamp_created": 1513950461, "timestamp_updated": 1513950461, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38034303": {"recommendationid": "38034303", "author": {"steamid": "76561198120553714", "num_games_owned": 82, "num_reviews": 3, "playtime_forever": 930, "playtime_last_two_weeks": 0, "last_played": 1511724315}, "language": "english", "review": "Not a perfect game neighter as an rpg or a tool for learning japanese, but still entertaining and manages to awaken my hunger for both playing rpgs and learning japanese. Also makes me wish I had the knowlegde and lets face it WILL to make my own game. In short this game is a diamon in the rough. \n\nBad stuff:\n\nA1. Dialog in english.\nA2. Missed opportunity at writting actual word in battles.\nA3. Enemies are quiet alike..\nA4. Repeative missions\nA5. Forced lessons to proceed\n\nGood stuff\n\nB1. affection meter\nB2. character seperat story\nB3. side quests\nB4. crystal store\nB5. short game\nB6. achievements\n\nThe bad in more depth:\n\n\nA1. Dialog in english.\nIt's a issue I have with most language tools. Too much english. A option for having the dialog read in japanese would help me learn even more. Listening to english kinda feels like a waste of time when I trying to learn japanese and since there are subtitles why not? I could listen to the japanese and read the english. Of course I do understand that newcomers might find listening to japanese overwhelming and finding and recording dialog in 2 languages (and translating the dialog) cost more money. Yet it would have been a nice option.\n\nA2. Missed opportunity at writting actual word in battles.\nThe monsters or Obake you fight appear in shape of japanese letters. In most battles there are multiple letters on screen. Yet they don't say anything. This feels like a perfect opertunity to teach some more japanese words or remind us of words we've seen earlier in the game. All that would be needed is just to arrage what letters pop up at a specific battle and maybe the translation of the word writen at the top of the screen. A missed opportunity.\n\nA3. Enemies are quiet alike\nNot much difference between one battle and the other. Only difference was the bosses which change from one letter to another once the last one had been defeated until the final form. In my oppion this should have been the model for the normal enemies. Once I attacked ア with A there is no educational value in me attacking it with A again with a different member of my group. However if it after the first attack switched appearence to a different katakana which I would have to identify then we would learn more wouldn't we? Maybe some of the enimies could have cofused a party member. Maybe the others could have cured this by spelling out his or her name! There were of course some battles that toke place in another dimention where the monsters appeared as latin letters and one had to defeat them by attacking with right katakana. A good idea, but it wasn't used enough. Also a sweet idea that just poped. If one could attack Obake from both dimetions at the same battle. Maybe once party memebers could switch between the option of katakana or latin. Might take a move to do. Hmm...\nAnd maybe throw in some really hard enemies once in a while... wait the game did this, but there weren't just hard enough. There's a escape button that I rarely use. \n\nA4. Repeative missions\nThis wasn't a issue at the start of the game while one was limited to the first town. But the later part when one has to travel to another part on the map to fight some small Obake before a bossbattle only to end up back in town 1 to repeat the process in the next part of the game. No sleep overs, No traveling without a party member or wich a curse one has yet to learn how to remove. Now the game is not the only rpg with this problem. And as I said before this isn't a problem in the begining of the game. Maybe because you can kinda see what difference you've made.. or because the walk to the action was shorter.\n\nA5. Forced lessons to proceed\nKinda a part of the last complaint, but it comes from a different place. I've tried to learn japanese on and of for some years. So I kinda don't need these lessons, but to progress in the story and to get access to other \"tools\"(in lack of a better word) in the game to teach me some japanese I don't know I have to sit thorugh them. Kinda wish this would have been optional.\n\nGood stuff more in depth\n\nB1. affection meter\nDone a lot of ginding in other games to empower my partymembers. Rarly grinded to improve affection. Still grinding, but now it had more of a pay off. A simple short little cut cusceen. Well done! Grinding now has more of a purpose.\n\nB2. character seperat story\nThe charaters in the story are kinda simple minded, but still kinda entertaining. Or maybe it just me. Yet The final cutsceens (especially Owens) gave me such hunger to learn more. Well written.\n\nB3. side quests\nThe side quest were enjoyable and the reward was a to learn more japanese words and sometimes there was a quiz at the end. Those quizes were fun... maybe because they were so easy that I acced everyone except the ones that I kinda messed up on...\nAlso The simple bubble with the text \"rock on super star\" that appeared everytime you finnished a quest. Really got me hyped for some reason.\n\nB4. crystal store\nIn some battles you receive crystals which you can exchange for items that permanatly boost your characters stats. Love having this opion. So now I can make my weakest character the strongest or the slowest the fastest or... I could just speed up my mages for the best results in future battles... Yet the option to modify like this gives freedom to do it all. Turn a warrior to a mage or a mage into a battle mage. Freedom like this is oe of the best features in gameplay probably only riveled by joy of double jump.\n\nB5. short game\nI'm old. I have a job and lots of other things I want to do. So Good things come in small packages and don't take up to much of my time. I rather play a short game than a long one that looses it's charm because of the time it steals from other activities or because fun of the game stoped being fun after 50 hours and you still have 100 left,,,\nI know there are young people out there that want a game to last forever,,, but you will learn.\nStill a ultimate boss to fight after would have been nice...\n\nB6. achievements\nNever thought that this would ever become important to me, but it did... and that is why I haven't fibbished Hiragana wars... Yet I found myself playing though this game in less than a week. Nice upgrade... Now please path the first game so with achievements as well... please..\n\nSpecial thanks!\n\nTo Sleepy duck! I might have called your game a diamond in the rough, but that's still a diamond. Please continue your work. I want more fun japanese education and you seem to pretty good with motivation as well. Keep making more! Looking foward to playing kanji wars. puzzled by how it will work with the battle mechanics. Guessing you are not going to inclued all what 4000 kanji... Rock on super star!!", "timestamp_created": 1512310934, "timestamp_updated": 1512310934, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37976889": {"recommendationid": "37976889", "author": {"steamid": "76561198219449433", "num_games_owned": 117, "num_reviews": 2, "playtime_forever": 2084, "playtime_last_two_weeks": 0, "last_played": 1512712730}, "language": "english", "review": "Good game to begin learning the Katakana if you don't know where to start. It's easy and fun. A there are a number of good surprises about this game. Plus it is well put together. Very good for beginners. Intermediate students may find this a bit more tedious, but the game play will still be fun. Recommended.", "timestamp_created": 1512136557, "timestamp_updated": 1512136557, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525066", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37973527": {"recommendationid": "37973527", "author": {"steamid": "76561198057370688", "num_games_owned": 312, "num_reviews": 12, "playtime_forever": 799, "playtime_last_two_weeks": 0, "last_played": 1512579718}, "language": "brazilian", "review": "Fiz a analise do Hiragana Battle e agora volto pra falar de Katakana War, fazendo algumas comparações com o jogo antigo.\n\nEm primeiro lugar, você não precisa jogar o jogo antigo para jogar este, mas vai te ajudar MUITO se o fizer, já que o jogo tem palavras escritas em Hiragana o tempo todo, além de que, existem simbolos em Katakana muito parecidos ou iguais ao Hiragana, como exemplo: \nHe = へ　\nYa = や/ヤ　\nKa = か/カ　\n\nBom, Katakana War não segue uma continuação do jogo passado, mas segue o mesmo estilo de gameplay: uma cidade foi invadida por símbolos japoneses e é seu dever acabar com eles.\n\nLADOS POSITIVOS:\n\n1.Aqui já temos um progresso, uma vez que, no jogo passado, ele funcionava igual grama do pokemon, que tu passa em cima várias vezes até encontrar um oponente, mas nesse jogo você vê a letra e tem a opção de mandar o ronaldinho nela, evitando um combate. Isso faz com que o jogo, em primeira instancia, pareça mais dinâmico que o anterior, mas existem problemas aqui que serão falados mais pra frente.\n\n2. Outro ponto positivo é o menu de letras estarem infinitamente mais organizado. CUIDADO! Não decore o simbolo pela linha que ele se encontra. Entenda que, esse é um jogo educacional, então duele com todos os monstros se possível e decore de forma com que você não esqueça.\n\n3. Nesse game temos dublagem. Ela é uma merda, mas auxilia na hora do combate. \nQuando você vai lutar contra um simbolo e aí seleciona uma tradução, o personagem fala em voz alta o que foi selecionado e escreve na tela. Isso é bom por termos tanto apoio visual quanto auditivo e facilita na hora do aprendizado. \n\n4. O uso das magias, pelo menos pra mim, foi superior tambem. No jogo passado era só pegar o personagem, socar level e itens que dão força pra dar hit kill mas nesse aqui, os personagens são mais fracos e as magias auxiliam. (Charllote é healer e roubada, use-a)\n\n5. O jogo também tem nível de interação. Tu consegue fazer amizade e super amizade com a sua party e eles ganham buffs adicionais.\n\nAgora vem os defeitos:\n\n1. Me incomoda o tanto de diálogo entre personagens. Eu particularmente não dei a mínima pra interação dos personagens e nem pela história, que é completamente enfadonha. O jogo é educacional e deveria se comportar como tal. Isso faz você perder algum tempo só tendo que dar skip.\n\n2. Tem um bug chato que faz o fps do game cair pra 1 quando seu personagem vai upar de classe. Isso faz você perder tempo também.\n\n3. Achei os mapas bem pequenos, então se você for apressado, tu pode sair rushando o jogo e não aprender muito, o que no jogo passado, era impossível.\n\n4. Dublagem. É ruim gente, desculpa.\n\n5. Acho errado num jogo que era pra focar apenas nos simbolos querer me ensinar palavras. A melhor forma de aprender palavras é em textos, não no avulso. Pelo menos o final não teve o lance do final anterior, então ta bom.\n\nCONCLUSÕES FINAIS:\n\nSim, você aprende jogando tanto esse quanto o outro, mas não sei ao certo o quão efetivo é. \nPosso dizer que, pra mim, os dois jogos me deram o pontapé inicial e eu consigo ler hiragana e katakana com facilidade, mas eu uso outros sites de apoio e estou sempre escutando o idioma, talvez tenha sido mais fácil, não sei como vai ser pra você.\n\nQuero só ver como vão fazer com o jogo de Kanji (que parece que a Claire vai voltar <3)", "timestamp_created": 1512125316, "timestamp_updated": 1512125316, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.565217", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37954113": {"recommendationid": "37954113", "author": {"steamid": "76561198096658035", "num_games_owned": 54, "num_reviews": 11, "playtime_forever": 1143, "playtime_last_two_weeks": 0, "last_played": 1512051343}, "language": "english", "review": "finished this in 19 hours,, another great educational game  just  like its prequel the Hiragana battle, recommended for those who wants to deepen their knowledge in the Japanese language, Katakana is easier since it is based on non-japanese words translated into the writing system, マグフィシーネント ゲーム！ (i wonder if thats alright..)", "timestamp_created": 1512053674, "timestamp_updated": 1512053800, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37830115": {"recommendationid": "37830115", "author": {"steamid": "76561198263440997", "num_games_owned": 47, "num_reviews": 4, "playtime_forever": 609, "playtime_last_two_weeks": 0, "last_played": 1513804150}, "language": "english", "review": "I'll be honest, it's not the most fun game out there. However, it's a lot better than studying out of a book, and that's what I used it for. Really helped me to focus on memorizing the Katakana for my college Japanese class. If you want to be able to read Katakana, pick this up. If you want to learn to speak Japanese, you learn some phrases but not many.", "timestamp_created": 1511821415, "timestamp_updated": 1511821415, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37353539": {"recommendationid": "37353539", "author": {"steamid": "76561198008009643", "num_games_owned": 177, "num_reviews": 1, "playtime_forever": 554, "playtime_last_two_weeks": 0, "last_played": 1495931164}, "language": "english", "review": "Pretty helpful with learning the basics.", "timestamp_created": 1511536367, "timestamp_updated": 1511536367, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37287131": {"recommendationid": "37287131", "author": {"steamid": "76561198170866389", "num_games_owned": 13, "num_reviews": 3, "playtime_forever": 1524, "playtime_last_two_weeks": 0, "last_played": 1498466670}, "language": "english", "review": "Although the title would suggest otherwise, Katakana War is a pleasant RPG focused more about learning to read and write from the fundamental form of the language of a country which has never fired a missile outside its own territory, and is among the highest among both the Human Development and World Peace Indeces.\n\nIt's also a lot less about combat in any sense, and more about having Pokemon battles with Unown-like creatures. And, of course, getting to know your \"characters\" better! :P", "timestamp_created": 1511511336, "timestamp_updated": 1511511336, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37123770": {"recommendationid": "37123770", "author": {"steamid": "76561198061864241", "num_games_owned": 45, "num_reviews": 5, "playtime_forever": 692, "playtime_last_two_weeks": 0, "last_played": 1487025384}, "language": "english", "review": "learn japanese game", "timestamp_created": 1511454398, "timestamp_updated": 1511454398, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.527027", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36879817": {"recommendationid": "36879817", "author": {"steamid": "76561198072825787", "num_games_owned": 216, "num_reviews": 6, "playtime_forever": 809, "playtime_last_two_weeks": 0, "last_played": 1486285353}, "language": "english", "review": "EN:\nBeautiful and useful game if you wanna learn, or revise, katakana.\nSo buy it and start learning that wonderful language! :)\n\nP.s.\nNominated in my custom category \"Let's learn by playing!\" for the Steam Awards 2017.\n\nIT:\nBello e utile gioco per imparare, o ripassare, il katakana.\nQuindi compratelo e iniziate ad imparare quella meravigliosa lingua! :)\n\nP.s.\nNominato nella categoria custom \"Let's learn by playing!\" per gli Steam Awards 2017.", "timestamp_created": 1511398912, "timestamp_updated": 1511398912, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.481481", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36790473": {"recommendationid": "36790473", "author": {"steamid": "76561197973626569", "num_games_owned": 116, "num_reviews": 2, "playtime_forever": 317, "playtime_last_two_weeks": 0, "last_played": 1512735222}, "language": "french", "review": "Ludique et éducatif, ce jeu vous permet d'apprendre tout en suivant une histoire intéressante et sympathique.  Hâte à la suite avec les Kanji.", "timestamp_created": 1511383008, "timestamp_updated": 1511383008, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35998896": {"recommendationid": "35998896", "author": {"steamid": "76561197971595199", "num_games_owned": 248, "num_reviews": 4, "playtime_forever": 814, "playtime_last_two_weeks": 0, "last_played": 1508970822}, "language": "english", "review": "Nice game, but hiragana (part I) was much better... This gme is quite to easy... In the hiragana version you had to grind a level one or two times to make it, use items and magic wisely... In this game you can simply ignore all items and magic and running throuhg... Because of that you do not repeat the katakana signs often enough to be able to remember them a day after you learned it...\nBesides of that i still am missing some of the side quest, even I had revisited all the places, I still do not know where to find them...\nStill it is a nice game, but the quality decreased massivly relatively to the first episode... I hope the Kanji part will be better again...", "timestamp_created": 1508971217, "timestamp_updated": 1508971217, "voted_up": false, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.514204", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35997366": {"recommendationid": "35997366", "author": {"steamid": "76561198317926865", "num_games_owned": 3, "num_reviews": 1, "playtime_forever": 127, "playtime_last_two_weeks": 0, "last_played": 1512960274}, "language": "english", "review": "Actually the greatest game ever. Real fun, mate.\n\nExcellent and enjoyable way to learn katakana for beginners and experienced people alike", "timestamp_created": 1508964691, "timestamp_updated": 1508964691, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35871300": {"recommendationid": "35871300", "author": {"steamid": "76561198089692652", "num_games_owned": 122, "num_reviews": 2, "playtime_forever": 52, "playtime_last_two_weeks": 0, "last_played": 1508526159}, "language": "brazilian", "review": "Muito bom, gostei muito ajudou muito com a memorização das letras japonesas, bom trabalho pro pessoal que fez esse jogo, recomendo pra quem quiser aprender as letras pois vai ajudar.", "timestamp_created": 1508526274, "timestamp_updated": 1508526274, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35631544": {"recommendationid": "35631544", "author": {"steamid": "76561198128843197", "num_games_owned": 201, "num_reviews": 8, "playtime_forever": 605, "playtime_last_two_weeks": 0, "last_played": 1507957744}, "language": "english", "review": "Absolutely love this game and it's predecessor! Would instantly buy it if they made a Learn Kanji to Survive game!!!!!", "timestamp_created": 1507696487, "timestamp_updated": 1507696487, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35182413": {"recommendationid": "35182413", "author": {"steamid": "76561198273880942", "num_games_owned": 14, "num_reviews": 2, "playtime_forever": 491, "playtime_last_two_weeks": 0, "last_played": 1506263162}, "language": "english", "review": "What a fun way to learn Katakana. This game surprised me, it is quite captivating even though there are a few bugs here and there (WASD controls don't seem to work even though it's a setting). It works the same as the Hiragana version, only it seems more polished than the previous one. The gamestyle and gameplay reminds me of the old Pokemon games.\nI will totally be backing a Kanji game if there'll ever be one!", "timestamp_created": 1506263481, "timestamp_updated": 1506263481, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.520000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 116, "total_negative": 9, "total_reviews": 125}}
