{"reviews": {"38737899": {"recommendationid": "38737899", "author": {"steamid": "76561198292375107", "num_games_owned": 19, "num_reviews": 6, "playtime_forever": 795, "playtime_last_two_weeks": 0, "last_played": 1511291633}, "language": "german", "review": "Ist ein Tolles Spiel was viel Spaß macht, es gibt epische Bossfights, man kann Resourcen sammeln um sich Waffen herzustellen (Scherter, Bögen und mehr). Die Welt ist groß, doch dadurch muss man auch viel Zeit zu Laufen investieren (kann eine Weile dauer). Es gibt Secrets doch auch einige Bugs, wie z.B. dass sich die KIs nicht mehr bewegen oder dass man Wertvolle Items mehrmals bekommen kann. Bis jetzt gibt es 5 Hauptabenteuer, doch es kommen immermehr hinzu.\nDoch es ist noch Early Acces.", "timestamp_created": 1514381470, "timestamp_updated": 1514381470, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38499915": {"recommendationid": "38499915", "author": {"steamid": "76561198065887052", "num_games_owned": 469, "num_reviews": 7, "playtime_forever": 251, "playtime_last_two_weeks": 0, "last_played": 1498437687}, "language": "english", "review": "Very cute and fun, I wouldn't recommend getting the game just yet because it's incomplete but once the devs finish the game, it will definitely be worth the buy!", "timestamp_created": 1513883028, "timestamp_updated": 1513883028, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.553863", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38421830": {"recommendationid": "38421830", "author": {"steamid": "76561198378257680", "num_games_owned": 55, "num_reviews": 20, "playtime_forever": 277, "playtime_last_two_weeks": 0, "last_played": 1513291585}, "language": "english", "review": "wonderful simply wonderful.. cooking, crafting, creatures and bee killing.. wack a lot and learn i lot I did.", "timestamp_created": 1513648814, "timestamp_updated": 1513648814, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.461538", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38253189": {"recommendationid": "38253189", "author": {"steamid": "76561198220470803", "num_games_owned": 65, "num_reviews": 2, "playtime_forever": 154, "playtime_last_two_weeks": 0, "last_played": 1513070434}, "language": "english", "review": "I was pleasantly surprised by how much I enjoyed playing this game. The graphics are beautiful and each boss fight is unique. I love the puzzles as well. I hope there will be more updates in the near future.", "timestamp_created": 1513071030, "timestamp_updated": 1513071030, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.495902", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37539265": {"recommendationid": "37539265", "author": {"steamid": "76561198353248355", "num_games_owned": 132, "num_reviews": 4, "playtime_forever": 237, "playtime_last_two_weeks": 0, "last_played": 1511622825}, "language": "german", "review": "Wow, in diesem Spiel steckt weit weit mehr als erwartet! \nEine wirklich schön designte Spielwelt, gehüllt in tolle Grafik mit einzigartigem Sound-Design und gesamt-gesehen in Kombination mit einer kurzlebigen, aber sehr interressanten Story.\n\nFazit: Ich bin rundum begeistert von diesem Titel! ;)", "timestamp_created": 1511622982, "timestamp_updated": 1511622982, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34986519": {"recommendationid": "34986519", "author": {"steamid": "76561197993271123", "num_games_owned": 47, "num_reviews": 1, "playtime_forever": 23, "playtime_last_two_weeks": 0, "last_played": 1512447157}, "language": "english", "review": "I only just started playing this game, but already I am in love with it. I have always wanted to play a Zelda game on a PC, and your game has that same style and feel to it. I love the crafting, controls, graphics, and the story which has already started to unfold. I can't wait to keep playing. Worth every cent.", "timestamp_created": 1505531753, "timestamp_updated": 1505531753, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34972153": {"recommendationid": "34972153", "author": {"steamid": "76561198258233527", "num_games_owned": 11, "num_reviews": 3, "playtime_forever": 361, "playtime_last_two_weeks": 0, "last_played": 1514298097}, "language": "german", "review": "Noch nicht kaufen! Ich habs mir im Summer Sale 2017 gekauft. Nach 5 h Spielzeit hieß es ich soll einen Tempel betreten, um mit der Story fortzufahren. Aber der ist noch nicht mal implementiert! Man sieht, dass man E drücken soll um ihn zu betreten, aber es passiert nichts, nicht mal \"Thanks for playing Alpha Schlagmichtot\". Und ich habe 100% der Erfolge erfüllt, also ist das Spiel durch. Und ich bin nur auf 5h gekommen, weil ich ne Menge Bullshit (Umsonst) gemacht habe. Das Spiel wurde Seitdem ich es habe auch nicht gepatcht. Sollte das Spiel noch in diesem Leben fertig werden, könnte es evtl ganz nice sein, aber bisher war das Geld einfach nur aus dem Fenster geworfen.", "timestamp_created": 1505483102, "timestamp_updated": 1505483102, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.458716", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34617508": {"recommendationid": "34617508", "author": {"steamid": "76561198171367833", "num_games_owned": 139, "num_reviews": 13, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1509262397}, "language": "schinese", "review": "五月份买的游戏，一直在等完善\n\n对于有了简体中文表示非常开心\n\n试玩了一会，游戏完成度依旧非常之低，BUG也是极其的多\n\n卡通版老滚，连挥剑（棒子？）的姿势也是一摸一样\n\n能挖矿能砍树，也有洞穴小副本\n\n价格不错，打起折也非常狠\n\n于是安静等待正式的版本\n（估计有生之年了）", "timestamp_created": 1504124720, "timestamp_updated": 1504124761, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.570447", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33849550": {"recommendationid": "33849550", "author": {"steamid": "76561198217648375", "num_games_owned": 308, "num_reviews": 7, "playtime_forever": 309, "playtime_last_two_weeks": 0, "last_played": 1501142647}, "language": "schinese", "review": "游戏整体性还是可玩的，简易的画风，轻松的战斗，自己收集材料打造装备，根据自己的喜好选择近战 弓箭 法师不同的玩法，难易度较低〔手残除外〕，但是最令人费解的就是这么多让人想卸游戏的bug，不去修复么。\n以下bug算是略微剧透吧\n\n\n\n\n\n\n我不止一次的卡在石头缝中，出不来 只能退出重开，砍树的判定是树必须倒地才会变成木材，而我不止一次的砍完树倒在房子啊 其他的树上，就形成了一颗bug树。\n重开后所有的矿石，材料，就连宝箱里的物品都会复原，相信不少人用这个方法早早的就刷出了一套好装备，大大的缩短了游戏的奈玩性。\n到达沙漠地带后，在一些特定的地点可以碰见一种类似沙虫一样的怪物，有时候会钻入土里，然后靠近你钻出来打你，然后这里贴图bug就出来了，你根本看不见虫子在哪 只能任他打，不过稍微跑远点后就又能看见了。\n在拿到钥匙后去算是智者的NPC那里完成任务，你会发现你的钥匙从背包中不见了。而打开金字塔进入最终boss的道具必须有这个钥匙，当时因为这bug卡了好久，然后绕回去才发现原地又刷了一把钥匙。拿到全部任务道具后进入金字塔，准备打boss，金字塔中和迷宫一样，有一处还是隐藏门，无意中开出来的，打开所有开关后到达最底层。\n另外说一下，金字塔内部是一个巨大的坑洞，而坑中是紫色的毒水，进去就会直接死，开开关的目的就是为了排掉这些毒水。当我开完所有开关后，由于没有保存进度直接下去了，在一处用法术瞬移过去的机关点被吸进了墙里，然后活生生被机关打死了。之后我的复活点不是在上一个存档点去重新开机关，而是直接在最底层，机关属于全关闭状态。于是我boss房进不去，头上是一片毒水，也回不去，直接卡关了。没办法，卸游戏了。希望可以改善改善吧。", "timestamp_created": 1501223988, "timestamp_updated": 1501223988, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33766893": {"recommendationid": "33766893", "author": {"steamid": "76561198150302463", "num_games_owned": 62, "num_reviews": 34, "playtime_forever": 34, "playtime_last_two_weeks": 0, "last_played": 1500884534}, "language": "tchinese", "review": "模組畫風簡易，遊戲採第一人稱視角，操作上也沒有困難度。\nRPG冒險遊戲，目前遊玩上感覺難度並不高。\n\n遊戲為英文版，網路上已有3DM漢化補丁，有興趣遊玩的人可以抓來用用。", "timestamp_created": 1500906125, "timestamp_updated": 1500906125, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33665032": {"recommendationid": "33665032", "author": {"steamid": "76561198042270191", "num_games_owned": 809, "num_reviews": 65, "playtime_forever": 367, "playtime_last_two_weeks": 0, "last_played": 1511453133}, "language": "english", "review": "I am going to be extremely critical because I want this game to be good. I will also use The Legend of Zelda as a good reference point in several aspects because that is what the game wants to be like.\n[h1] TL;DR: \t[/h1]\nIt is a gorgeous game with great exploration and ideas that are ruined by flaws in combat, effectively no way of interacting with your environment or obtaining new items to allow you to complete puzzles or interact with your environment and exploring the world with too much walking especially in the desert area of the game. \n\nI have seen lots of reviews saying that this is like a 3D like Zelda game with exploration and good combat. Honestly, yea i can see it and I enjoy the art style and the overall feel of the game. It just isn't polished or really fun and loses its charm after the first dungeon. The dungeons honestly are the most fun part about it.\n[h1] The combat [/h1] \nThe combat gets repetetive and although you feel the impact of your swings it all turns into circle the enemy and charge your attacks, swing, and repeat until it's dead. The first boss was challenging although somewhat too difficult until I found out you can just pause the game, eat food or chug potions, and run around while your health regens. The food isn't difficult to make because with enough time you can just run around the main character's home and makes stacks of infinite food. Then one boss was literally wait around until its weak point comes out, but he doesn't let his actual attackable spot out of his body until a repetetive cycle of move a quarter around a circle and shoot a ball of arcane magic literally about 7 times in a row and it takes forever. It took nearly 4 to 5 cycles of this just to defeat this boss. It was by far the most boring fight and easiest because you literally just stop and when he shoots the ball, you move to the side. \n\n[h1] The exploration [/h1] \nI am going to give the game and the devs huge props on making a gorgeous world that you want to explore. I am however, going to complain that it takes forever to walk to places and this is most noticeable in the desert. Literally dunes of sand and lots of walking back and forth which is just unecessary or can be resolved by adding a horse or faster method of travel. You have a sprint, but you sprint, stop to let it charge back up, sprint more, and repeat. When your stamina runs out you walk slower than you originally were walking. Traveling in this gorgeous world is painful and takes so long. Then, after completing your objective you have to walk slowly through the same area to get back or sometimes you compelte the objective, walk back to get your next objective and are told to walk through the exact same place you just were at. Another idea to fix this issue is maybe let the player teleport to totems or waypoints from the map after discovering and saving at one. This would eliminate walking through the area you just got done walking through for the 3rd time.\n\n[h1] Crafting and Equipment [/h1] \nCrafting is cool. Until you make iron stuff then everything else is useless until gold which again makes everything else useless. There are only 3 types of magic and they all do the same thing except do a different type of damage and there is literally just a weak and strong version which do the same thing and look the same except maybe adds a new visual effect. 4th magic spell that acts like a grapple hook, but you only use it in the final dungeon and is only useable on these weird blue squares instead of being able to use it anywhere like the grapple hook. So pretty useless\n\nAlso, in the Legend of Zelda you had items that let you interact with your environment or even use them in combat. You don't get that in this game. You don't have a boomerang, you can't use ice magic to freeze water and make platforms. You can't get a sand wand that builds up blocks of sand to climb to higher platforms. You get your same basic fighting with simple magic that is effectively another method of killing your enemy instead of circling around them with your sword you will shoot magic, run back some few feet and shoot magic and rinse and repeat. \n\nTHE GAME IS NOT DONE (That or I ran into a game breaking bug and I am assuming it is the former) -  I Know it is early Access but it has been released for a year and there are only like 2 areas mainly and the Desert isn't even done. With no indication to this,[spoiler]  you get to a part where you go to a pyramid with some ancient key and go to each corner of this big ass pyramid to get 4 artifacts and then run back to the guy in front of the pyramid for him to not say anything new or let you in the pyramid. \t[/spoiler]\nEDIT: IT IS A FUCKING BUG WHERE THE KEY IS REMOVED FROM YOUR INVENTORY SO YOU HAVE TO RUN ALL THE WAY BACK TO THE OTHER FUCKING SIDE OF THE GOD DAMN MAP TO GET THE KEY. THEN YOU RUN ALL THE WAY THE FUCK BACK AND OPEN THE PYRAMID NOW. WHY IS THIS STILL NOT FIXED???!?!?!? GUESS WHAT THE FINAL BOSS IS. YOU WALK AROUND AND CHARGE YOUR FIREBALL AND SPAM IT AND WIN EASILLY. I AM REALLY PISSED BECAUSE YOU TALK TO A FUCKING ORB AND THE DIALOGUE SOFT LOCKS YOUR GAME AND MAKES IT IMPOSSIBLE TO PROGRESS. SO IS THE GAME DONE?!?! I DON'T FUCKING KNOW!\n\nOverall, it's beautiful and somewhat unique at the begining of the game. The combat gets boring, the puzzles are simple, the exploration is fun and cool until you get these unecessary long distances that bore you out of your mind because most of the time you are back tracking or going to this area with no purpose whatsoever except to look nice. ALSO, THE END IS BROKEN. IS IT THE END? I DON'T KNOW STILL\nI would hold off on this game until further development is made or some of it is ironed out. Or maybe until the game is done. It is a one man project though, but I don't think the game is worth its asking price right now.\n\nEDIT: The new content has been out for 3 months. I played it. The soft-lock issue is fixed and you go to a new area that adds about an hour and a half of content where the main mechanic is literally just craft and mine and collect the items needed to finish the dungeon. Make 2 of those cores and the new armor and the new weapon and the boss can literally be safe-spotted. As in there is a spot where you can just spam ice magic and win without getting hit.\n\nWhen the area is finished you run into basically the end again where you speak to the sage and this time you aren't soft-locked. It tells you with a pop-up message that this is not available yet in early-access. Good that it isn't just an abrupt you are stuck in this text and can't do anything about it.", "timestamp_created": 1500525180, "timestamp_updated": 1511453409, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.497138", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33512413": {"recommendationid": "33512413", "author": {"steamid": "76561198375029180", "num_games_owned": 160, "num_reviews": 115, "playtime_forever": 358, "playtime_last_two_weeks": 0, "last_played": 1499981614}, "language": "brazilian", "review": "Eu não costumo comprar um jogo que ainda está em desenvolvimento, mas tive que arriscar dessa vez prqê simplesmente me apaixonei quando vi as imagens tão bonitas na página da loja.. e realmente o jogo é incrível... para descrever de forma clara e simples, para mim Windscape é um Skyrim só que fofo e bem colorido, com gráficos simples mas chamativos... a jogabilidade é realmente muito parecida com Skyrim e os Bosses surpreenderam pela criatividade e necessidade de entender como vencê-los e não simplesmente atacar sem parar... não prestei muita atenção na história, mas só pelo fator de exploração e de criatividade já recomendo muito... porém, cheguei ao que parece ser o final dele em 6 horas nas condições atuais, em uma pirâmide sem caminho pra continuar, e não sei se algum dia o desenvolvedor vai finalizar embora tenha prometido ter cinco ilhas totalmente diferentes umas das outras (sendo que atualmente há apenas duas).. não tenho muita fé de que ele vai terminar, mas de todo coração gostaria muito que o fizesse, prqê foi um dos jogos mais maravilhosos que já joguei, e juro que fiquei 5 horas seguidas presa nele e senti que tudo passou tão rápido... preciso de mais dessa sensação, preciso alimentar mais essa vontade... por favor senhor desenvolvedor continue trabalhando nessa obra de arte até o fim.. nunca te pedi nada ;-;", "timestamp_created": 1499981113, "timestamp_updated": 1499981113, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.521531", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33500208": {"recommendationid": "33500208", "author": {"steamid": "76561197970754349", "num_games_owned": 582, "num_reviews": 125, "playtime_forever": 46, "playtime_last_two_weeks": 0, "last_played": 1499677664}, "language": "english", "review": "Windscape is one of those rare really high quality indie games. It feels a lot like an online game that plays single-player because of all the resource gathering and fetch quests, but in a way it's refreshing.\n\nThe graphics are also beautiful! Here's some gameplay if you're interested https://www.youtube.com/watch?v=b5b6ks6tG20", "timestamp_created": 1499941801, "timestamp_updated": 1499941801, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.459307", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "33387484": {"recommendationid": "33387484", "author": {"steamid": "76561198267393126", "num_games_owned": 981, "num_reviews": 40, "playtime_forever": 466, "playtime_last_two_weeks": 0, "last_played": 1509040221}, "language": "english", "review": "Overall this game is a lot of fun and it's got a hell of a lot of potential, I definitely think it could be improved on and I'll go over it below, but honestly, if you enjoy games where you can just wander about, I'd recommend supporting this game\n\nOkay, points of improvement and ideas (warning, long af)\nImprovements/changes/bugs/etc\n- I think the game would work better as a third person game, however I also tend to prefer those kinds of games so I could be biased. At the very least, the option to play in third person should be available, cause I know a lot of people who who will get motion sickness from the movement, and won't be able to play otherwise\n- Being able to lock on to enemies, just because of the first person aspect, it would make fighting less disorientating, and help with locking onto specific characters etc\n- I love the style, but the environment is very easy to get caught on because of it. Unsure what could be done instead, but it's something to be considered\n- Change action button from E to left mouse click. Also the hit boxes tend to overlap each other, meaning I have to circle around until I hit a point where I can interact with one thing, and don't immediately get pulled into a conversation I have already seen\n- The sounds the people make are a bit disorientating and sudden, I'm never actually expecting them and it unnerves me every time somehow. I think it would work fine with body language and no sound or at least a bit softer?\n\nIdeas\n-  Incetive for ignoring the main quest and just wandering about, secrets and items and such\n- Certain levels you can increase? Either through equipping items or doing certain quests or doing something enough?\n[list]\n    [*] Endurance: Stamina would go down slower\n    [*] Attack: take less hits to kill something\n    [*] Charm: Could get information easier, get quests you can't otherwise, better items, etc\n[/list]\n- More types of weaponry, and clear differences between them when it comes to fighting. All have pro's and cons\n[list]\n    [*] Club: Balanced but weak\n    [*] Mace: High damage, slow swing speed\n    [*] Sword: Good damage, fast swing speed\n    [*] Bow: Has high damage if aim is perfect and time is taken for the shot\n    [*] Spear: Slow swing speed, low damage, keeps enemies away\n[/list]\n- Having buffs and debuffs would also be good, although I'd say start out with good old poison or bleed and see how that works\n- I like having party members and such, but I do enjoy the solitary aspect of Zelda games, maybe for quests you could have characters you can fight with and then after that you can hire them to go with you for certain amount of time or to and from a specific area? Also maybe you could gain pets to help with fighting, or would be able to find hidden paths or rare items\n- I wanna climb, maybe you need to do certain actions to either get or craft a set of climbing gloves and boots? A specific monsters claws for instance that is difficult to kill\n- Maybe a camp set up that you can buy to make food and such on the way", "timestamp_created": 1499552312, "timestamp_updated": 1499552312, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33180488": {"recommendationid": "33180488", "author": {"steamid": "76561198268615603", "num_games_owned": 158, "num_reviews": 5, "playtime_forever": 336, "playtime_last_two_weeks": 0, "last_played": 1504238188}, "language": "english", "review": "buy have fun", "timestamp_created": 1499083322, "timestamp_updated": 1499083322, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.436110", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32889764": {"recommendationid": "32889764", "author": {"steamid": "76561198077236050", "num_games_owned": 340, "num_reviews": 13, "playtime_forever": 124, "playtime_last_two_weeks": 0, "last_played": 1481566466}, "language": "italian", "review": "CAREEENO", "timestamp_created": 1498598505, "timestamp_updated": 1498598505, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "32877173": {"recommendationid": "32877173", "author": {"steamid": "76561197979474719", "num_games_owned": 612, "num_reviews": 2, "playtime_forever": 242, "playtime_last_two_weeks": 0, "last_played": 1498568691}, "language": "english", "review": "Nice little game. However there is still a lot of work. Some parts are extremely unbalanced. Maps are too big.", "timestamp_created": 1498589825, "timestamp_updated": 1498589825, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32798809": {"recommendationid": "32798809", "author": {"steamid": "76561198086469883", "num_games_owned": 168, "num_reviews": 17, "playtime_forever": 305, "playtime_last_two_weeks": 0, "last_played": 1495655262}, "language": "spanish", "review": "10/10", "timestamp_created": 1498448362, "timestamp_updated": 1498448362, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32525348": {"recommendationid": "32525348", "author": {"steamid": "76561198120884285", "num_games_owned": 423, "num_reviews": 26, "playtime_forever": 221, "playtime_last_two_weeks": 0, "last_played": 1512926561}, "language": "english", "review": "I received this game from the developer during its very first version, and I've been continuously playing ever since.\nIn short, do I recommend this game? Yes! However, if you are not a fan of Zelda-esque games, then I would probably look into it a bit more.\n\nHere are some pros:\n- Fun Story\n- Female Protagonist (I always find a female protagonist fun :P )\n- Smooth gameplay and game mechanics\n- Crafting system is easy to use/understand, and that makes it fun to do\n- Cooking is fun and easy\n- Foraging makes you want to constantly explore\n- Great soundtrack\n- Characters and enemies are creative and always interesting to come into contact with\n- Game design is very well done. I really enjoy the way the world/map is designed\n- Graphics may seem crude to some people, but personally I really enjoy them. I love the colorful world and characters. There's also something nostalgic about the graphics as well, almost like I'm playing on my N64 again :D\n\nI was going to write a list of cons here, but honestly I really can't think of any cons that haven't already been fixed or patched. Plus, given the fact this is an early access game I find it unfair to point out \"can't access part of map\" or \"this aspect is a bit buggy\". \nWe've all played early access games where we have PAID MONEY and received absolute broken crap. \nThis on the other hand is a well made and designed game that is constantly progressing and being fixed/patched.\n\nAll-in-all, I honestly do recommend this game. If you love Zelda, you'll absolutely LOVE this. If you love exploration games, you'll want to get this. If you like games where there is an intensive crafting system and giant skill trees, then... well... you *might* like this.\n\nWindscape is charming to its core, and I absolutely adore it. Get it while it's hot, and support indie devs ;)", "timestamp_created": 1497756346, "timestamp_updated": 1497756502, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.634107", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "32387971": {"recommendationid": "32387971", "author": {"steamid": "76561198137307141", "num_games_owned": 88, "num_reviews": 1, "playtime_forever": 409, "playtime_last_two_weeks": 0, "last_played": 1504365978}, "language": "english", "review": "awsome", "timestamp_created": 1497358664, "timestamp_updated": 1497358664, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.405248", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32349158": {"recommendationid": "32349158", "author": {"steamid": "76561198126293102", "num_games_owned": 407, "num_reviews": 18, "playtime_forever": 135, "playtime_last_two_weeks": 0, "last_played": 1497212446}, "language": "turkish", "review": "Oyun daha çok yeni ama neredeyse hikayenin %60 ı tamamlanmış denebilir. Görsellerdeki grafikler çok hoş değil mi ? Aynı grafikler oyun içinde de var.  İndirime girdiğinde kesinlikle almalısınız. Ufak, vakit geçirmelik hoş bir oyun olacaktır sizin için. \n\nOyunun içeriği : \n\nHikayemizde bir kızımız hadi maceraya diyip babasından aldığı odun kılıcı ile şehrin yolunu boyluyor. Şehirde babasından alacağı olan bir demirciye emaneti verdikten sonra çeşitli görevler onu bekliyor. Görevleri tam olarak söylemeyeceğim ama şehirdeki görevler bittikten sonra bir zeplinle çöle gidiyorsunuz. (Bulunduğunuz yer aslında bir uçan ada olup uçan bir çöle gidiyorsunuz.) Şimdilik sadece bu iki adacık var ama ileride onu da geliştireceklerini düşünüyorum. \n\nOynanış :\n\nOynanış aslında pek güzel değil. Vuruş hissiyatı yok ve yapay zeka sıra tabanlı strateji oyunlarındaki gibi saldırıyor. Bir vuruyor sonra bekliyor. Yani bizden istenilen onlar vururken kalkan kullanmak ve onlar vurduktan sonra beklerken saldırmak. Oyunu 5-6 saat oynadıktan sonra bıkıyorsunuz bu savaş sisteminden haliyle.\n\nMüzikler :\n\nOyunu oynarken sanki Zelda oynuyormuş gibi hissettim. Müzikleri Zelda kıvamında.", "timestamp_created": 1497205821, "timestamp_updated": 1497205899, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.646113", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32122770": {"recommendationid": "32122770", "author": {"steamid": "76561198070405796", "num_games_owned": 49, "num_reviews": 2, "playtime_forever": 270, "playtime_last_two_weeks": 0, "last_played": 1496384398}, "language": "english", "review": "Sadly the game gets boring really fast..... The combatsystem is crap. You get aggro from everything. The bosses are hard to beat, since you need time to do a hard strike youdon'T get at all. But you can cheat if you go to the savestation shich heals you, so you can beat any boss + if you get a bow you can just shoot bosses from afar without getting aggro and it takes even less time than real battling. Most of the time you will spend running from one mission to the other without seeing new enemies just old ones in a different coat. You do not even need to craft much. right after the first mission I had the best weapon possible there and also a bow which dealt 10 dmg 4 more than the sword..... All in all fun to play, but not really balanced yet", "timestamp_created": 1496384759, "timestamp_updated": 1496384759, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503521", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32116015": {"recommendationid": "32116015", "author": {"steamid": "76561198151097535", "num_games_owned": 608, "num_reviews": 12, "playtime_forever": 1366, "playtime_last_two_weeks": 0, "last_played": 1502730721}, "language": "german", "review": "Windscape ist ein klasse RPG Aventure, welches sich lohnt gespielt zu werden!\nDer Spieler schlüpft in die Rolle einer tapferern Heldin und erlebt ein spannendes Abenteuer. \nMit ständigen Content Updates wird das Spielerlebniss erweitert und brint eine menge Spaß mit sich! :-)", "timestamp_created": 1496353260, "timestamp_updated": 1496353260, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.475170", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "32088116": {"recommendationid": "32088116", "author": {"steamid": "76561198079277855", "num_games_owned": 78, "num_reviews": 51, "playtime_forever": 644, "playtime_last_two_weeks": 0, "last_played": 1489160537}, "language": "german", "review": "Windscape erinert irgendwie ein bisschen an Zelda.\nDas Spiel ist trotzdem cool und ist schön Design macht auch viel Spaß.\nAber das Spiel brach leider ein bisschen lange zum Updaten und das ist Schade!\n\nIst trotzdem zu entfehlen!", "timestamp_created": 1496244954, "timestamp_updated": 1496244954, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.497129", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32051695": {"recommendationid": "32051695", "author": {"steamid": "76561198140190510", "num_games_owned": 968, "num_reviews": 1, "playtime_forever": 357, "playtime_last_two_weeks": 0, "last_played": 1496097056}, "language": "english", "review": "Recommended for sure. It has a nice art style, fitting music and a great atmosphere. There are some bugs for sure (Hit with the mace and block directly or dead ends when skipping a dialog and directly starting a new one) but you should try it yourself and support the developer to finish his great game. Keep up!", "timestamp_created": 1496098709, "timestamp_updated": 1496098793, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32050124": {"recommendationid": "32050124", "author": {"steamid": "76561198056669067", "num_games_owned": 94, "num_reviews": 9, "playtime_forever": 733, "playtime_last_two_weeks": 0, "last_played": 1504677973}, "language": "english", "review": "4 hours in I'm loving it so far.  I'm having some techincal issues with the game but, have sent in crash logs and I acknowledge it's early access so, I'm expecting some sort of bugs.", "timestamp_created": 1496093367, "timestamp_updated": 1496093367, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32027532": {"recommendationid": "32027532", "author": {"steamid": "76561197977250280", "num_games_owned": 341, "num_reviews": 136, "playtime_forever": 232, "playtime_last_two_weeks": 0, "last_played": 1496335112}, "language": "english", "review": "I nice little RPG with quite a lot of potential and beautiful yet simple graphics. There are some obvious bugs, mostly the AI that sometimes forget what it’s doing and the physics are a pit slow and floaty. Also I wish you could turn off the bloom lighting. My laptop doesn’t have a dedicated graphics card and this game lags on higher graphics settings because of it.", "timestamp_created": 1496000319, "timestamp_updated": 1496000319, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32003285": {"recommendationid": "32003285", "author": {"steamid": "76561198072296789", "num_games_owned": 809, "num_reviews": 177, "playtime_forever": 169, "playtime_last_two_weeks": 0, "last_played": 1496676324}, "language": "german", "review": "*Tut mir leid wegen mein deutsch ich lebe erst seit gut 3 jahren hier.\n\nDas game macht echt laune und gefält mir echt gut !  ich finde es anspuchvoll und denoch einige dinge seltsam ^^ \n( seltsam das am anfang erz da ist und sobald man eine spitzhacke hatt ist das erz weg ^^ )\n\nEin LetsPlay habe ich auf mein neuen Youtube Account für euch gemacht .\nschaut doch mal rein. \n🌟Wenn es euch gefällt, lasst doch ein Like, Kommentar oder gar ein Abo da!  🌟\n\n\"Der Ton wirt noch verbessert !  \" \nLink: Windscape\n►http://store.steampowered.com/app/363950/Windscape/\n\n", "timestamp_created": 1495911230, "timestamp_updated": 1495911230, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.362846", "comment_count": 0, "steam_purchase": true, "received_for_free": true, "written_during_early_access": true}, "32002590": {"recommendationid": "32002590", "author": {"steamid": "76561198144059764", "num_games_owned": 44, "num_reviews": 1, "playtime_forever": 451, "playtime_last_two_weeks": 0, "last_played": 1503552476}, "language": "english", "review": "pretty fun still has a ton of glitches and bugs but has promise", "timestamp_created": 1495909080, "timestamp_updated": 1495909080, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31983454": {"recommendationid": "31983454", "author": {"steamid": "76561198079967614", "num_games_owned": 138, "num_reviews": 5, "playtime_forever": 805, "playtime_last_two_weeks": 0, "last_played": 1504292399}, "language": "english", "review": "I really like this game, can't wait for the full release. Great early access buy.", "timestamp_created": 1495837598, "timestamp_updated": 1495837598, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31973558": {"recommendationid": "31973558", "author": {"steamid": "76561198076911749", "num_games_owned": 93, "num_reviews": 7, "playtime_forever": 272, "playtime_last_two_weeks": 0, "last_played": 1495805947}, "language": "english", "review": "This review serves as a reminder why I shouldnt buy early acces games, i just hope that it maybe will serve you in the same way. As of right now, the combat system gets boring fast, the resource-gathering gets tedious fast and the game loses its charm after 5 hours of playing. Dont buy. Go outside.", "timestamp_created": 1495806297, "timestamp_updated": 1495806297, "voted_up": false, "votes_up": 8, "votes_funny": 2, "weighted_vote_score": "0.455546", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31964218": {"recommendationid": "31964218", "author": {"steamid": "76561198043607189", "num_games_owned": 560, "num_reviews": 26, "playtime_forever": 90, "playtime_last_two_weeks": 0, "last_played": 1495767961}, "language": "english", "review": "the game is quite pretty, and the soundtrack is alright, but apart from that there isn't much here. The fights are rather simple and the combat feels very shallow, I went through the first dungeon and it was disappointing, honestly. The boss is super simple and easy, and if you use the bow it's too easy, and if you use melee weapons, it feels very monotone, block, hit, and if you see an enemy from distance you charge your attack to kill them, but blocking doesn't cause them to flinch and there is no way to get distance while in battle to try to charge your hit. The crafting is also very simple and revolves around a few items that can be randomly found in many places. The quests are your typical fetch this kill that, for the most part, or at least as far as I have played.\n\nI got this game on sale for 66% discount, and I honestly don't feel like I got my money's worth; It may be a taste thing, I want games to be challenging or smart, pretty isn't enough to cut it. also, for some reason this game makes my gaming laptop catch on fire even with really low settings (as if I was playing a big AAA demanding game).\nI will not further play the game as I have deemed it not to be worth my money and will thus ask for a refund before I clock 2 hours of playtime.", "timestamp_created": 1495768420, "timestamp_updated": 1495768420, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.533669", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31956586": {"recommendationid": "31956586", "author": {"steamid": "76561198120701565", "num_games_owned": 45, "num_reviews": 2, "playtime_forever": 237, "playtime_last_two_weeks": 0, "last_played": 1512247009}, "language": "german", "review": "Das Spiel vermittelt eine schöne Atmosphäre und hat mich die ersten Stunden auch wirklich gepackt.... aber ... die Tatsache, das das Spiel zwanghaft versucht wie zelda zu sein und spätestens beim ersten dungeon massive Bugs aufweist hat mich schnell genervt. So kann es sein, dass man in Felsspalten festhängt, von gegnern 100 meter in die luft geworfen wird oder zwischen zwei stufen einer treppe festhängt. ich würde also auf Bugfixes warten bevor ich zuschlage und hoffen, das die Entwickler mich nicht im Regen, der durch die Dächer glitscht stehen lassen. XD", "timestamp_created": 1495734946, "timestamp_updated": 1495734946, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.499554", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31952905": {"recommendationid": "31952905", "author": {"steamid": "76561198086827230", "num_games_owned": 631, "num_reviews": 10, "playtime_forever": 96, "playtime_last_two_weeks": 0, "last_played": 1496848148}, "language": "schinese", "review": "+美术风格和BGM质量还不错\n+游戏体验尚可\n-Bug太多了，我才玩了这么点时间就莫名其妙的出现物品消失、对话框关不掉之类的事情，甚至有些物品的名字还带着代码，这游戏在EarlyAccess里面也算相当早期了", "timestamp_created": 1495723663, "timestamp_updated": 1495723663, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.522059", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31937669": {"recommendationid": "31937669", "author": {"steamid": "76561198073736764", "num_games_owned": 336, "num_reviews": 25, "playtime_forever": 6, "playtime_last_two_weeks": 0, "last_played": 1495229378}, "language": "turkish", "review": "Rezalet . Ben de bi boku beğenmiyom aq. Ama harbiden tarraq gibi oyun. Nota lüzum yok ;( İade ettim. Her önüne gelen öküze oyun yap dersen biz oyun alanlar da böyle zik gibi inceleme yapar aq.", "timestamp_created": 1495645662, "timestamp_updated": 1498090896, "voted_up": false, "votes_up": 46, "votes_funny": 2, "weighted_vote_score": "0.659690", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31933144": {"recommendationid": "31933144", "author": {"steamid": "76561198065206929", "num_games_owned": 178, "num_reviews": 28, "playtime_forever": 23, "playtime_last_two_weeks": 0, "last_played": 1495572352}, "language": "english", "review": "I really like this game", "timestamp_created": 1495626934, "timestamp_updated": 1495626934, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.466926", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31915199": {"recommendationid": "31915199", "author": {"steamid": "76561198049006623", "num_games_owned": 115, "num_reviews": 1, "playtime_forever": 272, "playtime_last_two_weeks": 0, "last_played": 1495534464}, "language": "english", "review": "This game is adorable. I'm excited for future updates!", "timestamp_created": 1495534778, "timestamp_updated": 1495534778, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.466926", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31896522": {"recommendationid": "31896522", "author": {"steamid": "76561198090973528", "num_games_owned": 33, "num_reviews": 2, "playtime_forever": 1341, "playtime_last_two_weeks": 0, "last_played": 1505128081}, "language": "german", "review": "das spiel ist super, es macht riesig spass ist spannend und macht süchtig :D\n\nich komm nur in der wüste nicht weiter, ich kann die 4 artefakte nicht abgeben bei gaasi obwohl ich alle habe.\nhat jmd einen rat? \n\nansonsten mag ich eig. alles an dem spiel :)", "timestamp_created": 1495434206, "timestamp_updated": 1495434206, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "31895601": {"recommendationid": "31895601", "author": {"steamid": "76561198106626564", "num_games_owned": 297, "num_reviews": 22, "playtime_forever": 352, "playtime_last_two_weeks": 0, "last_played": 1513185577}, "language": "schinese", "review": "BGM也不错", "timestamp_created": 1495427393, "timestamp_updated": 1495427393, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.547325", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31890269": {"recommendationid": "31890269", "author": {"steamid": "76561198094477406", "num_games_owned": 136, "num_reviews": 10, "playtime_forever": 396, "playtime_last_two_weeks": 0, "last_played": 1495397263}, "language": "german", "review": "Top mit paar Bugs.^^\n\nOb Schwert mit Schild, Bogen oder Magie ist alles dabei...\nNimm die Keule heraus und schlag zu.\n\nSpeichert von alleine wenn ihr an der seule vorbei leuft, dazu kann man waffen, Rüstugen selber herstellen, wobei man gleich sich die besten sachen machen kann und nur damit rum läuft, wie ich z.b nur Bogen, aufladen und schuß, tot... soll das ein op Bogen sein\"Lach\" \n\nVon sammeln muss ich nicht viel sagen, ihr findet recht oft alles am gleichen punkt wieder. hehe\n\nhat einen Quest Bug. Hab was vorher gemacht, was eine Quest war nun kann ich die nicht beenden und so gehst nicht weiter mit der Story... Kein Laden punkt\n\nTipp; bevor ihr eine quest sieht erst an nehmen und dann sammeln.\n\nEs macht Süchtig und Würde es euch empfehlen es zu kaufen zum Angebot bei steam.\nViel spaß", "timestamp_created": 1495398111, "timestamp_updated": 1496245174, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.552574", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "30501828": {"recommendationid": "30501828", "author": {"steamid": "76561198004492185", "num_games_owned": 540, "num_reviews": 58, "playtime_forever": 368, "playtime_last_two_weeks": 0, "last_played": 1483912605}, "language": "english", "review": "It's like Legend of Zelda, but in first person. The game is incomplete though at the moment. Stay tuned...", "timestamp_created": 1489465388, "timestamp_updated": 1489465388, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.471014", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "30487981": {"recommendationid": "30487981", "author": {"steamid": "76561198208708711", "num_games_owned": 49, "num_reviews": 5, "playtime_forever": 483, "playtime_last_two_weeks": 0, "last_played": 1514292666}, "language": "german", "review": "Sehr gelungenes Spiel doch kann man viele Recourcen nur sehr begrenzt finden. Außderdem habe ich den Bug, dass ich eine Quest beid der Wüsten Oase nicht beenden kann obwohl ich nur mit der Person da reden muss(danach kommt die Quest nochmal und ich kann nicht nochmal diese Redeoptionen benutzen). Ich finde es zwar gut , doch möchte ich die Story gerne machen. Auch eine Charakter Bearbeitung wär nett. Und auch die Rüstung, die ich angelgt habe möchte ich sehen. Sonst ist es gut.", "timestamp_created": 1489399233, "timestamp_updated": 1489399233, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "30345620": {"recommendationid": "30345620", "author": {"steamid": "76561198148904171", "num_games_owned": 26, "num_reviews": 2, "playtime_forever": 108, "playtime_last_two_weeks": 0, "last_played": 1474136779}, "language": "brazilian", "review": "Otimo jogo, recomendo ele muito.", "timestamp_created": 1488747810, "timestamp_updated": 1488747810, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.458136", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "29451292": {"recommendationid": "29451292", "author": {"steamid": "76561198082629280", "num_games_owned": 73, "num_reviews": 10, "playtime_forever": 369, "playtime_last_two_weeks": 0, "last_played": 1485226357}, "language": "english", "review": "It's a fun game, albeit extremely simple. The most complicated mechanics I've come up against were strafe to the side to dodge projectiles, or move behind an enemy when they use a frontal attack. Ranged attacks are completely overpowered and often times there's no reason to use a melee weapon over a bow or spell.\n\nBut overall, it's still a fun game to play with a nice art style going for... well truth be told with the name Windscape, it makes me think of Runescape.\n\nIt's also still in development and while I've nothing to say on the speed of the development, at the time of this post the game is quite short. You might get a couple hours of it exploring every corner of the map.", "timestamp_created": 1485211225, "timestamp_updated": 1485211275, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "29406864": {"recommendationid": "29406864", "author": {"steamid": "76561198174360705", "num_games_owned": 16, "num_reviews": 1, "playtime_forever": 660, "playtime_last_two_weeks": 0, "last_played": 1492873471}, "language": "english", "review": "Legit best game i have played in years, doesnt feel early acces and the music is great i highly reccomend this game to all!", "timestamp_created": 1485031466, "timestamp_updated": 1485031466, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.465686", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "28942012": {"recommendationid": "28942012", "author": {"steamid": "76561198144894208", "num_games_owned": 16, "num_reviews": 2, "playtime_forever": 747, "playtime_last_two_weeks": 0, "last_played": 1504165960}, "language": "polish", "review": "Mocne 8/10 tylko zbyt droga.", "timestamp_created": 1483366881, "timestamp_updated": 1483549247, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "28911775": {"recommendationid": "28911775", "author": {"steamid": "76561198057786313", "num_games_owned": 894, "num_reviews": 89, "playtime_forever": 220, "playtime_last_two_weeks": 0, "last_played": 1488643632}, "language": "english", "review": "This game is too polished to believe that it's actually an early access game. I've experienced zero bugs - yes, seriously! Yes, girls and guys, this is exactly how an adventure game should be. The missions are really exciting, there is a variety of enemies, and the bosses are pleasantly original. For now, the only disadvantage I could find is that the game is too small. It took me 3 hours to finish it without even rushing. No worries though, more missions will be added in the next update. There's a reason why this game has 100% positive reviews, at least until the moment I wrote this review. Trust me, this game deserves its full price. As long as it gets the love it deserves from us, many more missions will be added.", "timestamp_created": 1483295157, "timestamp_updated": 1483295157, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.630078", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "28760017": {"recommendationid": "28760017", "author": {"steamid": "76561198109102339", "num_games_owned": 25, "num_reviews": 1, "playtime_forever": 394, "playtime_last_two_weeks": 0, "last_played": 1496535313}, "language": "english", "review": "Great story, great scenery, great everything! I highly recommend this game, because its also very fun and enjoyable. You have to play it for yourself.", "timestamp_created": 1482947534, "timestamp_updated": 1482947534, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.465686", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "28637961": {"recommendationid": "28637961", "author": {"steamid": "76561198231073272", "num_games_owned": 112, "num_reviews": 4, "playtime_forever": 221, "playtime_last_two_weeks": 0, "last_played": 1490526883}, "language": "english", "review": "Hopefully it keeps getting updates. It seems really great so far, but it's short. Only about 3 hours at most to beat everything. What there is is really good, though.", "timestamp_created": 1482681603, "timestamp_updated": 1482681603, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "28590442": {"recommendationid": "28590442", "author": {"steamid": "76561198143269256", "num_games_owned": 172, "num_reviews": 1, "playtime_forever": 378, "playtime_last_two_weeks": 0, "last_played": 1489232941}, "language": "english", "review": "This game is a lovley combination of Skyrim and The Legend of Zelda - The Windwaker. The gameplay is very nice and the crafting system is not to complex. I hope there will be more coming soon :3", "timestamp_created": 1482577333, "timestamp_updated": 1482577333, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "28516244": {"recommendationid": "28516244", "author": {"steamid": "76561198031688739", "num_games_owned": 73, "num_reviews": 5, "playtime_forever": 376, "playtime_last_two_weeks": 47, "last_played": 1515209341}, "language": "english", "review": "Really fun so far, love the exploration and the combat. Reminds me of Skyrim and Zelda sort of. Highly reccomend buying and or keeping an eye out for this one! Huge potential!", "timestamp_created": 1482355820, "timestamp_updated": 1482355820, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "28384700": {"recommendationid": "28384700", "author": {"steamid": "76561198074672646", "num_games_owned": 4370, "num_reviews": 593, "playtime_forever": 142, "playtime_last_two_weeks": 0, "last_played": 1475048776}, "language": "french", "review": "[h1]Windscape, ce jeu de rôle et d’action est une belle surprise[/h1]\n\nJe dois avouer qu’au premier abord, je n’étais pas emballé par Windscape. Après 30 minutes de jeu, j’étais le nez collé à l’écran à jouer encore et encore sans voir passer les minutes, les heures.\n\nLa réalisation, le graphisme, la modélisation des objets, l’histoire... tout est superbe, sans compter que le jeu est bien dosé avec une difficulté progressive.\n\nVous jouez une jeune fille dont les parents tiennent une ferme. Votre père vous demande d’aller porter un paquet en ville, c’est le début du jeu et d’une longue aventure.\n\nDeux points importants, quand j’ai testé le jeu, il était (et il l’est toujours d’ailleurs) en accès anticipé et le second point, derrière le jeu, il n’y a qu’une seule personne... il y met tout son coeur et ça se ressent !\n\n[url=www.graal.fr/2016/09/29/test-windscape-la-version-pour-steam/]Pour découvrir l’intégralité de mon test sur Windscape.[/url]", "timestamp_created": 1481795650, "timestamp_updated": 1481795650, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504728", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "28235991": {"recommendationid": "28235991", "author": {"steamid": "76561198055440727", "num_games_owned": 43, "num_reviews": 1, "playtime_forever": 326, "playtime_last_two_weeks": 0, "last_played": 1488825457}, "language": "german", "review": "Das Ganze Review gibts hier: https://pixelnostalgie.de/2016/11/windscape/\n\nIch muss sagen das ich direkt vom ersten Moment an absolut begeistert war. Das Setting einer Fabelwelt mit fliegenden Inseln ist vielversprechend und schon jetzt hat Windscape einige Stunden Spielspaß zu bieten.\n\nEs befindet sich noch im Early Access, daher ist auch noch nicht alles perfekt. Der Entwickler ist aber sehr bemüht Windscape voranzutreiben und geht im Forum auf jegliche Art von Feedback ein.", "timestamp_created": 1481118322, "timestamp_updated": 1483441072, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.504720", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "28135846": {"recommendationid": "28135846", "author": {"steamid": "76561198096956888", "num_games_owned": 195, "num_reviews": 1, "playtime_forever": 163, "playtime_last_two_weeks": 0, "last_played": 1480673359}, "language": "english", "review": "Sure this early access is ~$18 if your in the US, but after beating the current build (V2.1) I see great potential for this game. If what i heard about this game is true, they plan on adding some sort of player housing, weither that be free build or plot based building with pre-fabricated building peices, i don't know. either way, this is the game thats going to be on my watch list for updates. great art style, vibrant colors, easy to follow story line (if you read the quest journal), simplistic crafting (might change) again this is an early release so anything and everything could change. I would give this game a 8/10 in overall gameplay, there are still a few AI bugs and some surfaces need to be smoothed over but its a great game.", "timestamp_created": 1480674092, "timestamp_updated": 1480674273, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "27917936": {"recommendationid": "27917936", "author": {"steamid": "76561198107700461", "num_games_owned": 172, "num_reviews": 1, "playtime_forever": 702, "playtime_last_two_weeks": 0, "last_played": 1514984017}, "language": "english", "review": "Just a really great, no, AMAZING game.  10 out of 10 would recommend", "timestamp_created": 1480310409, "timestamp_updated": 1480310409, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.444069", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "27907076": {"recommendationid": "27907076", "author": {"steamid": "76561198107999659", "num_games_owned": 58, "num_reviews": 6, "playtime_forever": 432, "playtime_last_two_weeks": 0, "last_played": 1511225121}, "language": "english", "review": "This is Windwaker on PC 10/10", "timestamp_created": 1480298124, "timestamp_updated": 1480298124, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.484887", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "27033866": {"recommendationid": "27033866", "author": {"steamid": "76561198116690832", "num_games_owned": 88, "num_reviews": 2, "playtime_forever": 302, "playtime_last_two_weeks": 0, "last_played": 1479964867}, "language": "schinese", "review": "啊！\nbug！\n特别痛苦的bug！\n如果能加多几个存档就好了！\n只能玩一份，删档没提示太痛苦了！\n手一滑存档就没了啊啊啊啊啊！！！！！\n不过还是蛮喜欢这个游戏的，除了他们的bug！\n这游戏我先后玩了三个存档，第一个存档误入bug再也出不去表示GG,第二个存档因为BUG根本进不去某个屋子GG，第三个存档玩到最后被我误删了！！！！！！！！！！！！！！！！！", "timestamp_created": 1479965150, "timestamp_updated": 1479965150, "voted_up": true, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.508600", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26595269": {"recommendationid": "26595269", "author": {"steamid": "76561198059561891", "num_games_owned": 859, "num_reviews": 416, "playtime_forever": 326, "playtime_last_two_weeks": 0, "last_played": 1479025163}, "language": "english", "review": "Windscape is an ambitious title that looks to mix the old parts of games you love with the new trends of today. One part Zelda, two parts Elder Scrolls is a good way to sum up the formula for Windscape. Developer Magic Sandbox aims to accomplish this gargantuan goal in simple ways. However, filling the Steel Boots of these epic titles is far from an easy task and drowning in a Lake Hylia is more then likely if one doesn't tread carefully.\n\nFrom the onset Windscape is doing rather well for itself, currently in its early development stage. The moment you load up into the game your eyes are overwhelmed by the bright colorful world. Aesthetically, Windscape aims to have simple graphics, reminiscent of the classic Ocarina of Time but with more of clean crisp look. Needless to say, but the game is extremely polygonal, The people, monsters, caves, mountains, clouds, everything is polygons. At first this is going to take some adjustment, at least for me it did. Once you do adjust though you realize how beautiful the game looks with its vibrant tones.\n\nDeeper areas of the Early Access show the versatility of this art style, as everything goes from bright and cheery to dark and sinister. I personally can't wait to see what future areas are going to be like and how far this style can go. Other aspects shine as well, such as level design, use of lighting and particle effects. There are some areas for improvement of course. The UI needs improvement, house designs become repetitive, and other little things here and there.\n\nAnother highlight we should talk about is the music of Windscape. As soon as you embark on your adventure you are greeted by a soundtrack full of levity and excitement. The tracks capture perfectly the inspiration for the game but doesn't feel copied nor does it drag at any point. It's definitely one of the areas I enjoyed most about Windscape. I could just sit there and enjoy the music for quite a bit. In short, the developer has nailed the overall feeling of the game and just needs to keep moving forward and keep things interesting.\n\nTouching upon those Elder Scroll elements, we have the first person combat and crafting. Windscape takes the scheme of other survival crafting titles and simplifies most of it. Unlike in Zelda, here you can craft your own weapons and tools to use in combat. As of right now there are spells, bows, blunt weapons, and sharp weapons, all corresponding with a different damage stat.\n\nHow this is going to be expanded upon will be interesting to see, as there is no hunger bar or really any other survival mechanics outside of your health bar. While crafting in the game is simple, it ended up feeling a little bit like a chore for me. It especially sapped the joy out of opening huge treasure chests. which usually just contained materials to craft something or meat. So much meat. Crafting materials tend to pile up.\n\nThe reason it felt like a chore is because the combat is rather simple and easy to exploit.(Of course that will likely change) Using saving totems automatically refills your health, so items such as food or health potions only become necessary on rare occasion. The resistance to damage type potions, I never used once, despite them being a huge chunk of crafting. The crafting system though does have plenty of room to grow in good ways, from crafting armor, shields, and magic accessories. The only problem is going to be making it fun and exciting.\n\nCombat is great but does suffer from quite a few bugs, AI randomly going brain dead and standing still, little variation in tactic beyond just charging up a shot, hitting and backing off. It becomes a very much rinse and repeat scenario. Situational awareness is an issue with no HUD as well. Boss fights on the other hand, when they do work, feel like epic show downs. You gotta move fast and play smart as they have far superior health and damage.\n\nWith currently about two whole areas to explore, you will get about four hours out of the game. That is stretching it if you want to craft everything. Obviously more content is on the way with a plethora of changes. I can see why people are excited about Windscape, the game does have plenty of potential, but it needs to build on itself in a pretty massive epic way. There are areas that need some tender loving care such as combat, bugs, AI. Ideas that can bring more life to the game such as voice acting, personal housing, and what I loved most of all about Ocarina of Time mini-games and secrets around every corner!\n\nAt $16.99 currently, keep in mind purchasing this title is mostly to SUPPORT THE DEVELOPER, as there is hopefully way more content coming. Given the developers constant updates, great publisher and passionate game intro, from the developer on the Steam page, I wouldn't worry about the game being completed. So keep your eyes on this one as it grows into a classic for sure.", "timestamp_created": 1479101792, "timestamp_updated": 1479101792, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.620345", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "26495875": {"recommendationid": "26495875", "author": {"steamid": "76561198143280640", "num_games_owned": 25, "num_reviews": 2, "playtime_forever": 73, "playtime_last_two_weeks": 0, "last_played": 1480367965}, "language": "english", "review": "Within the first 10 seconds of clicking the \"new game\" button, I had 2 separate shivers down my spine, this game is so beautiful. The art style is amazing, the story is (from what I've seen so far) interesting, if not a little slow, and this game is still in development! I can't express how much I love this game, and I really recommend it if you enjoy the quest-y Zelda category of games.", "timestamp_created": 1478643512, "timestamp_updated": 1478643512, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500427", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26457312": {"recommendationid": "26457312", "author": {"steamid": "76561198018686466", "num_games_owned": 524, "num_reviews": 89, "playtime_forever": 39, "playtime_last_two_weeks": 0, "last_played": 1492969767}, "language": "english", "review": "I could barely even tell this was early access so far. I noticed a little minor clunkiness with some combat, but aside from that it feels fairly polished and looks great. Definitely a fun exploration/quest Zelda-ish kind of game and the artwork/graphics look absolutely amazing. Even though it's early access, I had no issues at all with the game - ran perfectly without any bugs or performance issues on my Win10 machine with Xbone controller. \n\nJust buy it.", "timestamp_created": 1478442206, "timestamp_updated": 1478442206, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.535494", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26376349": {"recommendationid": "26376349", "author": {"steamid": "76561198052569964", "num_games_owned": 59, "num_reviews": 3, "playtime_forever": 103, "playtime_last_two_weeks": 0, "last_played": 1478192076}, "language": "german", "review": "Windscape ist ein sehr liebevoll gestaltetes Erkundungsadventure und erinnert im Stil etwas an Zelda. Stimmungsvolle Musik und Gespräche. In diesem Openworld-Adventure spielen auch verschiedene Rätsel und Bosskämpfe eine Rolle. \n\nDer Titel befindet sich noch im Early Access und wird von dem deutschen Entwickler Dennis Witte kontinuierlich weiter entwickelt und auch regelmäßig gepatchet.", "timestamp_created": 1478106877, "timestamp_updated": 1478106877, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "26369876": {"recommendationid": "26369876", "author": {"steamid": "76561198322775999", "num_games_owned": 14, "num_reviews": 2, "playtime_forever": 249, "playtime_last_two_weeks": 0, "last_played": 1489405303}, "language": "english", "review": "I come from China, my English is not very good, but the game is really great, I like this game very much, the world is really beautiful, I hope the author can update the Chinese version, so that I can get a better game experience, I hope you can accept my advice.", "timestamp_created": 1478077665, "timestamp_updated": 1478077665, "voted_up": true, "votes_up": 44, "votes_funny": 1, "weighted_vote_score": "0.769076", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26350529": {"recommendationid": "26350529", "author": {"steamid": "76561198087280883", "num_games_owned": 80, "num_reviews": 12, "playtime_forever": 108, "playtime_last_two_weeks": 0, "last_played": 1477978033}, "language": "english", "review": "make the playstyle like runescape and this game will be the best", "timestamp_created": 1477989329, "timestamp_updated": 1477989329, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.359819", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26322284": {"recommendationid": "26322284", "author": {"steamid": "76561198167660575", "num_games_owned": 667, "num_reviews": 13, "playtime_forever": 684, "playtime_last_two_weeks": 0, "last_played": 1504109740}, "language": "german", "review": "Sieht Wunderschön aus und macht richtig spass :D", "timestamp_created": 1477853153, "timestamp_updated": 1484163141, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500427", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26187457": {"recommendationid": "26187457", "author": {"steamid": "76561198269464963", "num_games_owned": 222, "num_reviews": 16, "playtime_forever": 708, "playtime_last_two_weeks": 0, "last_played": 1500840826}, "language": "german", "review": "Einfach wunderschön. Dieses Spiel wächst durch die Community, Ideen und Feedback. Also nicht überlegen..kaufen.. !!", "timestamp_created": 1477247999, "timestamp_updated": 1477247999, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503135", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26131892": {"recommendationid": "26131892", "author": {"steamid": "76561198113346791", "num_games_owned": 49, "num_reviews": 10, "playtime_forever": 398, "playtime_last_two_weeks": 0, "last_played": 1504200106}, "language": "german", "review": "Ich habe jetzt ein parr Stunden gespielt und muss sagen, ich bin echt süchtig!\nLeider ist es erst im Early-Access und man kann noch nicht viel machen.\nEs erzählt eine wunderbare Geschichte und hat ein interessantes Kampf- und Lebenssystem.\nIch freue mich schon, wenn neue Updates für das Spiel herauskommen werden.\n\nBITTE MEHR!!!", "timestamp_created": 1476982186, "timestamp_updated": 1476982186, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.505695", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26131371": {"recommendationid": "26131371", "author": {"steamid": "76561198152760885", "num_games_owned": 5154, "num_reviews": 343, "playtime_forever": 100, "playtime_last_two_weeks": 0, "last_played": 1476897596}, "language": "english", "review": "[h1]Introduction[/h1]\nWindscape is developed by Magic Sandbox and published by Headup Games. With no surprise, the publisher entrusted another promising developer, since I found this game to be a perfect break from the “traditional” looks and feel of many RPGs played by yours truly for quite some time.\n \n[h1]Gameplay[/h1]\nThe initiatory journey in Windscape is partaken by a brave female protagonist which quickly turns from errand girl for her family into a fully fledged warrior for an entire fantasy kingdom. The first few objectives seem simple enough, but the difficulty is appropriately ramped up as combat becomes unavoidable. Speaking of which, both the shield defense and the attack (from several melee option as well as a bow) will require some grinding for the resources required to craft the aforementioned weaponry. I still consider it a far more suiting alternative to simply buying better equipment as you progress. You will need to purchase some tools necessary for gathering/harvesting some materials, but it’s not a problem since coins are also easy to come by. The presence of different potions found in one particular in-game store, does hint most likely to a magical combat option, which remains to be implemented. Indeed many parts of the map are currently locked in Windscape’s Early Access stage. But I do like what I’ve seen so far and the story along with its heroine show enough potential.\n \nI really like the minimal style adopted by this game. It reminded me dearly of a tougue-in-cheek mod for Skyrim in which you can play in a similar visual mode with the textures being “below the lowest initial setting”. In reality, it offered the game a new identity and as I like to quote the remarkable catchphrase, “less is more”. Vivid colors and a relaxing soundtrack smoothen the experience even further. While the visual assets (from locations and down to the enemies themselves) are diversified enough, the same cannot be said of the sounds. I really missed even a slight form of voice acting but perhaps there’s still hope for that, in the final published stage of this title. It would breathe further life into an already intriguing RPG.\n \n[h1]Pros[/h1]\n+ Beautiful minimalist graphics\n+ Interesting story and setting\n+ Crafting system\n+ Steam Achievements\n\n[h1]Cons[/h1]\n- Still in Early Access\n- Needs more sound variation (and voice acting)\n- No Steam Trading Cards \n\n[h1]Result / Final thoughts[/h1]\nI would have played the game for much longer if it had any levels left outside of Early Access. It was fairly gripping and with so few issues, it’s a strong contender for this year’s best indie role playing game.\n\n[b]Rating 8/10[/b]\n \n[quote]This review was submitted for [url=http://steamcommunity.com/groups/elitegives]Elite Giveaways[/url], check us out for more reviews ranging from Indie games to AAA titles.[/quote]", "timestamp_created": 1476980193, "timestamp_updated": 1489235844, "voted_up": true, "votes_up": 35, "votes_funny": 1, "weighted_vote_score": "0.656792", "comment_count": "13", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "26034708": {"recommendationid": "26034708", "author": {"steamid": "76561198237007918", "num_games_owned": 19, "num_reviews": 3, "playtime_forever": 1064, "playtime_last_two_weeks": 0, "last_played": 1497318084}, "language": "english", "review": "Pleasantly Surprised!\nRan across this game and thought it looked interesting.  After playing the early access version I can say I really like this game.  A lot of people will say it has potential, yet I think it surpasses that already.  The gameplay is fun and gave me multiple things to do.  I was sad when I completed all of the current goals and crafting.  It is very exciting to see this game at this point in development.  Windscape has everything a good, fun, creative indie title needs.  I actually wouldn't change much about the gameplay at all.  Once they have added more of the map and there are more dungeons/caves etc there will be plenty to do.  The art style is cool looking and I felt like I was playing a cartoon (which to me is awesome!). I look forward to the developer’s updates.", "timestamp_created": 1476473392, "timestamp_updated": 1497317619, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.501378", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25958296": {"recommendationid": "25958296", "author": {"steamid": "76561198086343115", "num_games_owned": 592, "num_reviews": 5, "playtime_forever": 508, "playtime_last_two_weeks": 0, "last_played": 1489780093}, "language": "norwegian", "review": "A beautiful game with a little bit The Legend Of Zelda feeling i love it.", "timestamp_created": 1476059750, "timestamp_updated": 1476059750, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25915667": {"recommendationid": "25915667", "author": {"steamid": "76561197994002775", "num_games_owned": 3269, "num_reviews": 657, "playtime_forever": 119, "playtime_last_two_weeks": 0, "last_played": 1476914752}, "language": "english", "review": "I enjoyed the first time playing it, it's like a first person of some kind of legend of zelda game. \nOnly link is a girl now, i'm very curious to play this game till the end.\nAny plans for VR support?\n\nhttps://www.youtube.com/watch?v=RtunspYnuAQ", "timestamp_created": 1475890648, "timestamp_updated": 1475890648, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.468154", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25892656": {"recommendationid": "25892656", "author": {"steamid": "76561197965749794", "num_games_owned": 160, "num_reviews": 3, "playtime_forever": 744, "playtime_last_two_weeks": 0, "last_played": 1506931528}, "language": "english", "review": "Pros:\n\n-> Well done graphic-style. Needs a bit more refinement, but overall very fitting for the game\n-> Do you like Zelda? It is fitting to say, that this feels like 1st person Zelda \n-> Even for a very early \"Early Access\" Game (Patch 1.1 at the time this is written), good game balance and variety in weapons\n-> Range Combat (Bow) feels kinda skill based, but not to hard to learn\n-> Monster respawn und over time tweaks in the World makes it a blast to farm for the better Weapons\n-> Very easy to understand everything\n-> Good Content, if you consider the early state\n-> Developer cares about his (growing) Community and talks with us\n-> Hope for more expansions as time goes on.\n\nCons:\n\n-> Pretty hefty Price for 2-3 Hours of actual Gameplay (With Grinding for better \"Gear\" a hour more)\n-> THis game NEEDS voice acting \n-> There is no clear story which is told\n-> Menuing is a bit unintuitive. Should be integratet into the Game and not into the Menu (Inventory, Quests, etc.)\n-> Many things to be ingame already, but not yet achiveable\n\nOverall Impression:\nI played this game for 2,4 Hours and yes, that is all, it has to offer for me. But i am very curious, what is coming :D This game is actualy very fun to play. It runs Smoothly, no crashes, no bugs. Good Difficulty. Let the time tell!\n\nWould i recommend the buy?\nIf you like and trust Ealy Access and a nice little Game, this 16,99 Euro shouldn't be the Problem.\n\nDo not buy this, if you want a full fletched game, with intense Stroy and incredible new mechanics to offer. This not what you get!\n\nEDIT (Version 2.1 released):\nThis Content-Patch brang some big changes with it. \n\n-> You can craft and use Ice and Fire Spells now. (Very effective)\n-> Completely new Area with 2 Quests and 2 Dungeons where added\n-> Last Dungeon in this Update is very much fun and adds a lot of new Gameplay-Elements like Platforming and resistences. Many Bosses and Story included. \n-> Dark and Helloweeny Atmosphere for much fun!\n-> New Weapons, New Potions, New enemys\nAll in all the Playtime extended about 2-3 Hours if you hadn't grinded your Weapons before. This is very very good Update. I hope for more in this Quality. And i hope for the Story to not suck.\n\nEDIT 2 (Version 3.2):\n\nThis Update featured some heavy new assets and enemys. \n\n-> Completely new Region, which is implemented greatly into the story\n-> New Weapons, ressources and enemys\n-> Great new puzzels to figure out\n-> incredible atmosphere in the new region\n-> more challanging monsters and content \n\nI am very happy to see a new update to release. Yes it took pretty long, but overall this game gives you right now like 8-12 hours of gameplay. So this is still not worth 16,99, if you are seeking a fleshed out game, but you can see a very good adventure game grow. So this game was ultimately worth my bucks! \n\nWould I recommend now? Yes, right now, this game is good enough and has a very competent and communicative developer.", "timestamp_created": 1475792470, "timestamp_updated": 1489345106, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502910", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25864727": {"recommendationid": "25864727", "author": {"steamid": "76561198151449698", "num_games_owned": 80, "num_reviews": 2, "playtime_forever": 1673, "playtime_last_two_weeks": 0, "last_played": 1500017828}, "language": "german", "review": "Ein bißchen Zelda, ein wenig Minecraft, nomalerweise geht so etwas in der Regel schief, hier jedoch funktioniert es....\nIch bin schon gespannt, wie es weitergeht und hoffe, dass das nächste Update bald kommt...\n\n29.10.2016 das neue Update scheint noch sehr bug-behaftet zu sein....zumindest bei mir...", "timestamp_created": 1475646359, "timestamp_updated": 1477770883, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500760", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25695522": {"recommendationid": "25695522", "author": {"steamid": "76561198145764128", "num_games_owned": 139, "num_reviews": 16, "playtime_forever": 172, "playtime_last_two_weeks": 0, "last_played": 1474839655}, "language": "english", "review": "Feels like a well made and fun game so far considering It's early access, looking forward to seeing more", "timestamp_created": 1474820291, "timestamp_updated": 1474820291, "voted_up": true, "votes_up": 24, "votes_funny": 0, "weighted_vote_score": "0.659401", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25656400": {"recommendationid": "25656400", "author": {"steamid": "76561198010144356", "num_games_owned": 4758, "num_reviews": 14, "playtime_forever": 301, "playtime_last_two_weeks": 0, "last_played": 1480395001}, "language": "english", "review": "I did get this game free but it was from a Steam Group and not the Developer.  Thanks to The_Cpt_FROGGY\n\nThis game...Just...Wow.  This is the game I never realized I was wanting.  The feel of Elder Scrolls with the look of Wind Waker.  I love it.  The only negative I can really say is that it ended far too soon.  I can't wait for further content.  \n\nThis game is a really good quest based adventure game.  You wander around doing quests, discovering new things, and helping people.  Of course much of this involves killing a large number of creatures that are in your way.  You get rewarded for doing these tasks with items to help you with future tasks.  I'm sure all of you have played these kinds of  games.  But, this one feels special.  The look of the game, the beautiful vistas, the well realized enemies; this all comes together to create a great thing.\n\nPositives, \n\nGraphics\nSound\nGameplay\nStory?  (We'll have to see, only the bare bones are there so far.)\n\nNegatives\nThere are some AI issues with the enemy AI, sometimes they forget what they are doing and stand there.\nToo short, This isn't really a negative as this game is in development and this is only what they have opened so far.  There is far more to come from what I've seen and read.\n\n\nI recommend this game without any reservations.  It's a wonderful experience and just  a lot of fun.", "timestamp_created": 1474659904, "timestamp_updated": 1474659904, "voted_up": true, "votes_up": 2, "votes_funny": 9, "weighted_vote_score": "0.548387", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25636748": {"recommendationid": "25636748", "author": {"steamid": "76561197970329288", "num_games_owned": 1762, "num_reviews": 968, "playtime_forever": 100, "playtime_last_two_weeks": 0, "last_played": 1474556813}, "language": "english", "review": "The video below features 'first hand' gameplay experience of the game only:\nhttps://www.youtube.com/watch?v=AwJTIZ2GlSM\n\nMy Thoughts:\nAn entertaining crafting adventure with cool graphics and a captivating world.\n\nGame Details:\nIn Windscape you play as a young girl living on your parents’ farm, set in a lovely world made up of floating islands in the sky. As you discover the world you learn that something has gone terribly wrong - islands are breaking apart and falling from the sky!", "timestamp_created": 1474558603, "timestamp_updated": 1474568736, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.475533", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25626458": {"recommendationid": "25626458", "author": {"steamid": "76561198119638567", "num_games_owned": 1024, "num_reviews": 64, "playtime_forever": 753, "playtime_last_two_weeks": 0, "last_played": 1474537287}, "language": "brazilian", "review": "[h1]Review powered by [url=http://steamcommunity.com/groups/mamilosclub]Mamilos Club Group.[/url][/h1]\n\nWindscape é um jogo do estilo [i]Primeira pessoa / RPG / Aventura[/i] que irá surpreender os jogadores com tanta emoção em um pequeno jogo. De certa forma, o jogo estimula sua criatividade com sua jogabilidade encantadora, na qual as missões são realizadas através de interação com outros NPCs.\n\nNo início o enredo se passa em uma pequena fazenda com uma garota chamada \"Ida\" que mora com seus pais. As primeiras missões do jogo foram um tanto desanimadoras, tive que realizar tarefas na fazenda que por fim eu cozinhei uma sopa com carne, ou \"ensopado de carne\" se preferir; pensei que o jogo se baseava sómente naquilo e acabava ali ... Mas não! Como surpresa, após tratar mais Quests com o \"Pai de Ida\" o jogo começa a se revelar.\n\nDurante as aventuras, e completando cada vez mais Quests, você encontrará nos caminhos vários Mobs com armas e magias para você derrotar. Com o dinheiro adquirido por matar cada Mob você pode utilizá-lo para comprar poções de vida, e em outros locais picaretas e machados.\n\n[h1]+Pros[/h1]\n\n+Jogabilidade\n+Gráficos\n+Facilidade de realizar ações\n\n[h1]-Cons[/h1]\n\n-Algumas animações não batem com a ação do jogador\n-História um tanto curta\n-Não possui Trading Cards", "timestamp_created": 1474494863, "timestamp_updated": 1475586073, "voted_up": true, "votes_up": 12, "votes_funny": 2, "weighted_vote_score": "0.506481", "comment_count": "3", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25620655": {"recommendationid": "25620655", "author": {"steamid": "76561197983076651", "num_games_owned": 161, "num_reviews": 10, "playtime_forever": 10, "playtime_last_two_weeks": 0, "last_played": 1474713100}, "language": "english", "review": "Well, I won this in a giveaway and I'd like to say a few things:\n\nPro's\n\nThis game is very good currently. It's new aswell.\nIt has a very good AI and the features of this game are amazing.\nI like the way the creator/developer has used artistic kind of features to make this.\n\nOverall: great game :D get it! very good!", "timestamp_created": 1474471258, "timestamp_updated": 1474471258, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497512", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25619425": {"recommendationid": "25619425", "author": {"steamid": "76561198003030375", "num_games_owned": 2227, "num_reviews": 338, "playtime_forever": 529, "playtime_last_two_weeks": 0, "last_played": 1474460389}, "language": "english", "review": "Windscape:\n~~~~~~~~~\n  \nWhat scenery! Sitting against a stack of hay, looking at the beautiful blue sky with floating islands all around - it’s magic! It’s times like this that make living on a farm truly blissful. Well, your five minutes of rest are up! There are plenty of responsibilities on and around the farm. Hop up my friends, let’s explore the world of Windscape. \n\nWindscape is a first person/adventure/RPG game where you play Ida, a young girl who lives on her parents’ farm.  At the start of the game, Ida will have to do a couple of farm quests so she can make a meat stew for dinner. After successfully cooking your first meal, your father will give you a quest to complete, along with a club and shield to defend yourself for your upcoming encounters during your travel.\n\nWhat would you encounter within each quest? Angry wolfs, giant bees, spiders and nasty bandits, of which some will be armed with weapons and others will shoot fire balls. As this game is currently on early access, they are only a few quests at this stage. One aspect of the game I really enjoy is the crafting experience, it is great and simple. It will tell you how many items and quantities to collect to craft either a weapon, a potion or a meal, which restore some of your health. Also, each time you reach a totem, your game will be saved automatically and your health will be restored.\n\nThe fighting scene can be a bit awkward at times, but you will get used to it fairly quickly. As you eliminate an enemy, you might receive a bag of gold which you can use to purchase useful items at the general or alchemist stores, as well as hearts which will restore your health or other items. When you visit one of the general stores, make sure to purchase an axe to cut trees and a pick axe to brake stones.\n\nThis early access is full of potential in my opinion; I like the artwork and the feel of the game. For the controls, I would use the mouse and keyboard but this is a personal preference. In regards to music, it blends really well with the game. \n\nPositives:\n~~~~~~~  \n\n-\tGreat artwork\n-\tEasy crafting\n-\tNice gameplay\n\nNegatives:\n~~~~~~~~ \n\n-\tNeed more content\n-\tNo achievements or trading cards\n\nWindscape is definitely a game to keep an eye on. I am looking forward to new updates! Great potential!\n\n7/10\n\nKey provided by developer/publisher for review purposes. Any opinions expressed are entirely my own!\n\n[url=https://www.zeepond.com/reviews][b]EPIC “THE CPT FROGGY” REVIEWS UP NOW ON ZEEPOND, THE HOME OF THE ALMIGHTY FROG![/b][/url]\n\n[url=http://steamcommunity.com/groups/thecptfroggyclub#curation][b]FOLLOW THE CPT FROGGY CURATOR PAGE HERE[/b][/url]\n", "timestamp_created": 1474466229, "timestamp_updated": 1474466229, "voted_up": true, "votes_up": 17, "votes_funny": 1, "weighted_vote_score": "0.632398", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25616849": {"recommendationid": "25616849", "author": {"steamid": "76561198132872056", "num_games_owned": 156, "num_reviews": 97, "playtime_forever": 311, "playtime_last_two_weeks": 0, "last_played": 1474163976}, "language": "english", "review": "Tranquil, healing, and full of hidden wonder, Windscape captures the imagination in a gentle caress. Its appeal lies not in brute force nor the addictive hook of a levelling system, but in the subtle yet powerful ways it enables player curiosity through whimsical melodies, a charming graphical approach, and a plethora of different personalities to interact with. Windscape is a triumph of the imagination.  \n\nPROS\n\n+ Immersive world\n+ Unique, polygonal artistic style\n+ Compelling narrative\n+ Varied gameplay\n+ Dreamy, adaptive soundtrack\n\nCONS\n\n- Sometimes repetitive\n- Boss fights should be more difficult\n\nYou can view the full review here: http://www.keengamer.com/article/14162_windscape-review", "timestamp_created": 1474454492, "timestamp_updated": 1487567526, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25608902": {"recommendationid": "25608902", "author": {"steamid": "76561198006819601", "num_games_owned": 1107, "num_reviews": 38, "playtime_forever": 188, "playtime_last_two_weeks": 0, "last_played": 1474400261}, "language": "russian", "review": "Windscape - это игра, на которую ни за что не стоит закрывать глаза.\n\nИз того, что привлекло:\n\n1) Стилистика\n\nИгра Windscape имеет очень приятный low-poly стиль. Этим игра меня изначально и заманила.\n\n2) История.\n\nИгра по своей сути жанра \"Adventure\". В игре вам предстоит сыграть за дочь фермера. Ваш \"отец\" попросит вас кое-что для него сделать.. С этого  момента и начинается приключение по миру Windscape.\n\n3) Эмоции.\n\nЭмоции, которые оставляет после себя игра, превосходны. Подземелья, красивые леса - мир Windscape меняет ваш взгляд на объективную реальность минуту за минутой. \n\n4) Квесты\n\nЯ, как огромный фанат RPG, обожаю систему квестов в играх, и Windscape - не исключение.\n\n5) Система крафта.\n\nДля создания каких-либо предметов разработчики выбрали лучшую систему - систему крафтинга. Я, как большой любитель гриндилок, рад тому, что здесь есть что крафтинг. \n\n6) Оптимизация.\n\nИгра выдает стабильные 60 FPS. Я, честно признаться, приятно удивлен. После инди-проектов, которые выглядят достойно (пример: Lost World Zero) но имеют 20 и менее FPS видеть такую приятную картинку и не видеть проблем с FPS - очень приятно.\n\nИз минусов хочу отметить:\n\n1) Early Access. Страшно за будущее игры. Не могу предугадать, что ждет игру впереди.\n2) Баги с AI (иногда мобы зависают..спишем на Early Access)\n3) Недоступность некоторых локаций (Early Access тому причина)\n\nИгра очень красивая, интересная, перспективная. С радостью жду её выхода из Early Access, т.к планирую продолжать играть в неё.\n\nМоя оценка: 8/10. (Может измениться после выхода из Early Access)", "timestamp_created": 1474402488, "timestamp_updated": 1474408993, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.549665", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25604888": {"recommendationid": "25604888", "author": {"steamid": "76561198000141573", "num_games_owned": 462, "num_reviews": 11, "playtime_forever": 172, "playtime_last_two_weeks": 0, "last_played": 1481790342}, "language": "english", "review": "I've played through all the available content at this point and other than the jumping system. I love every part of this game.", "timestamp_created": 1474387207, "timestamp_updated": 1474387207, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25584634": {"recommendationid": "25584634", "author": {"steamid": "76561198044469409", "num_games_owned": 1791, "num_reviews": 355, "playtime_forever": 145, "playtime_last_two_weeks": 0, "last_played": 1474011048}, "language": "russian", "review": "Даже не знаю, как лучше описать данный проект. Представте, что вдруг смешали Раст и Скайрим, плюс добавили туда яркую мультяшную графику.Представили?! А теперь сравните свои ожидания с самим продуктом, однозначно не пожалеете. Играть мы будем за девушку (да-да,выбор на этот раз не дается), которая оставила свой дом позади и вооружившись  щитом и другим разнообразным оружием отправилась узнавать,что же неладное случилось в \"датском королевстве\". Ну а дальше все сводится к процессу знакомому вам по другим походим RPG проектам. Путешествуем, помогаем встречным поперечным,выполняя их задания, занимаемся собирательством и крафтом. Вообщем полный набор.\nС технической же стороны не все так гладко. Графика лично мне понравилась, хоть эталоном для  RPG игр ее трудно назвать.Вот со звуком не всегда все путёво получается. Иногда происходит своеобразная рассинхронизация его с проделываемым процессом. Есть еще другие шероховатости, но учитывая,что проект еще в раннем доступе -думаю всё доведут до ума со временем. Хотелось бы еще увидеть русскую локализацию,но это наверное вообще мечты за гранью фантастики. Коллекционных карт и достижений, к моему глубочайшему сожалению,нету.\nВ целом получился довольно бодрый проект, однако сказать,что он стоит своих денег у меня язык не повернется. Пока -сыроват,а цена - как треть цены Ведьмака.", "timestamp_created": 1474276121, "timestamp_updated": 1474276121, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.379829", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "25576393": {"recommendationid": "25576393", "author": {"steamid": "76561198140908266", "num_games_owned": 1366, "num_reviews": 109, "playtime_forever": 138, "playtime_last_two_weeks": 0, "last_played": 1477850997}, "language": "russian", "review": "Windscape - отличная низкополигонная RPG. В игре вам предстоит играть за молодую девушку, которая живет на ферме своих родителей, в прекрасном мире из плавающих островов в небе. Путешествуйте по миру, собирайте ценные ресурсы а также сражайтесь с разнообразными монстрами и боссами. Также игра порадует вас приятной графикой, неплохой музыкой и крафтом. Думаю игра свою цену полностью оправдывает, любителям RPG советую.", "timestamp_created": 1474227132, "timestamp_updated": 1474227132, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.476540", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "25567055": {"recommendationid": "25567055", "author": {"steamid": "76561198036972531", "num_games_owned": 398, "num_reviews": 4, "playtime_forever": 149, "playtime_last_two_weeks": 0, "last_played": 1474197715}, "language": "english", "review": "This game is SO MUCH FUN!!! If you like the art style it has so much to offer. Sure, it is simple and not tons of stuff to do but content gets updates every now and then making this a long lasting expierience. Enjoy!", "timestamp_created": 1474197827, "timestamp_updated": 1474197827, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "25558593": {"recommendationid": "25558593", "author": {"steamid": "76561198139681927", "num_games_owned": 1806, "num_reviews": 85, "playtime_forever": 32, "playtime_last_two_weeks": 0, "last_played": 1474156563}, "language": "russian", "review": "Windscape или Скайрим для майнкрафтеров.\n\nПервое, что я увидел при загрузке игры, что можно использовать геймпад. И что даже в стиме пишут про полное использование. Но вот в самой игре столкнулся с проблемой, что он не работает.\nЯ так и не решил эту проблему. Но хотелось бы поиграть именно на геймпаде.\n\nИгра начинается с того, что наша главная героиня любит почитать где-то в сене и не против приключений\\помощи родителям.\nЧто последние с радостью и делают.\nПервый квест со сбором урожая и приготовкой еды. Далее дают оружие и щит и тут начинается \"полное погружение\" в игру (блок щита вообще читерский какой-то. 100% Не девушка, а паладин в хеви!)\n\nГрафика яркая, красивая и сочная, порой даже глаза выедает. Но это в первых уровнях, надеюсь дальше будут какие-то данжи или \"пещеры с волками\"\nМузыка стандартная\nОзвучки не слышал\nГеймплей, как и для других РПГ игр, все везде похоже. Не думаю, что вы удивитесь чему-то.\n\nИз минусов хотелось выделить:\n- настройку геймпада и его использование (у меня не работал)\n- наличие более 2х языков. (хотелось русский конечно)\n\nИз плюсов:\n- Забавная, легкая и интересная игра.\nФанаты РПГ игр оценят и Windscape затянет вас к себе надолго.\n- Средняя цена, как для такого жанра и вообще игры.\n\nЯ все.", "timestamp_created": 1474156585, "timestamp_updated": 1474156585, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.440119", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "25548119": {"recommendationid": "25548119", "author": {"steamid": "76561198128201856", "num_games_owned": 1198, "num_reviews": 104, "playtime_forever": 105, "playtime_last_two_weeks": 0, "last_played": 1474124448}, "language": "russian", "review": "Приятная игрушка с низкополигональной, но в тоже время красивой графикой.\nВы живете в прекрасном мире с небесными островами, но в один момент они начинают рушиться и падать с небес, что-же происходит? Вы должны это выяснить.\nВ игре мы будем путешествовать по миру, собирать ресурсы (из который дальше можно изготавливать предметы), выполнять различные квесты, а так же сражаться с различными монстрами и боссами, по пути обчищая пещеры от различных монстров.\nТак же разработчик постарался сделать не однотипные острова, в итоге каждый остров будет отличаться от предыдущего не только монстрами, но так же своим стилем и атмосферой.\nИгра действительно впечатляет, советую попробовать.", "timestamp_created": 1474120785, "timestamp_updated": 1474120819, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.433246", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25546396": {"recommendationid": "25546396", "author": {"steamid": "76561198057334690", "num_games_owned": 2495, "num_reviews": 192, "playtime_forever": 301, "playtime_last_two_weeks": 0, "last_played": 1474113346}, "language": "russian", "review": "[h1] Низкополигональные приключения[/h1]\n\nВ огромном разнообразии игр с реалистичной, и претендующей на реалистичность, графикой недавно появилась брешь. И в эту брешь пробралась игра \"Windscape\" с запоминающейся и очень приятной низкополигональной красочной мультяшной картинкой. \nНе смотря на свою стилистику, визуально игра выглядит довольно детализированно, а пейзажами даже можно любоваться.\n\nЖанрово игра принадлежит к адвенчурам. Речь здесь идёт о приключениях дочки фермера, которая по поручению отца покидает дом, и как это водится в подобных (и рпг) играх - начинаем исследовать мир и помогать всем и каждому.\n\nПеремещаясь по миру встречаем диких животных, собираем ресурсы, зачищаем пещеры, и конечно же, делаем квесты. Так же присутствует система крафта, алхимии и даже обучение магии.\n\nНекоторые объекты и локации пока не доступны (ранний доступ всё-таки). Плюс встречаются некоторые ошибки:\n- при повторном заходе в игру сбросилась чувствительность мыши и активные квесты\n- в меню \"квесты\" выбор активных квестов никак не сопровождается звуками или графически. В итоге я наклацал и получил 4 одинаковых активных квеста, отображаемых с правой стороны экрана\n- после нескольких ударов дубиной по волкам некоторые из них просто зависали и не двигались, давая мне спокойно их избивать\n- звук сбора трав явно не соответствует самому процессу\n\nОднако эти, по большей части несущественные, не сильно омрачают игру. Количество плюсов явно перевешивает.", "timestamp_created": 1474115098, "timestamp_updated": 1474115098, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.512652", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25518821": {"recommendationid": "25518821", "author": {"steamid": "76561198329616167", "num_games_owned": 42, "num_reviews": 7, "playtime_forever": 720, "playtime_last_two_weeks": 0, "last_played": 1495823874}, "language": "koreana", "review": "너무 재밌어요\n아기자기한 그래픽에 이곳저곳 파밍하고\n조작도 어렵지 않고 귀여운 무기 만드는 재미도 있구\n뭔가 귀여운 디아같으면서도 마비노기 스럽기도하고 여튼 너무 제취향의 게임..\n완성된 게임이 아닌걸 구입하고서야 알았지만 업데이트가 기다려져요\n2시간정도 플레이했더니 업데이트를 기다려야하네요 언능 업뎃이 됬으면~~\n한글화가 되진 않았지만 어렵지 않게 플레이 할 수 있어요", "timestamp_created": 1473981860, "timestamp_updated": 1512963649, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25498373": {"recommendationid": "25498373", "author": {"steamid": "76561198207484137", "num_games_owned": 5763, "num_reviews": 28, "playtime_forever": 130, "playtime_last_two_weeks": 0, "last_played": 1472933070}, "language": "english", "review": "[b]pre-review[/b]\n(might change/update when it comes out of early access, but this is my view on it so far)\n\nFor being early access I am quite fond of this game as it is fun to play.\nAt the moment not everything is unlocked yet but I’m sure that will come in time.\nI can see this game grow to a nice potential RPG adventure game.\n\nThe graphics are stunning and colorful. Some of the details are so nice to catch, it takes you by surprise. Which is in my opinion awesome. \nI also do like the music but I kinda secretly hope there will be added more tunes as after a while it gets a bit repetitive for me personally.\n[spoiler] And not to mention the cute owl at the check point or the creepy weird-ish scarecrows in the fields.[/spoiler] \nThe battling, crafting, exploring,... Hihi, I love it!\n\nSo my overall experience until now says, this game has a lot of potential and I’m looking forward to more updates and stuff being added, as it has surprised me so far.\nTherefore I am looking forward to many more to explore, craft,…\nThank you for the early access fun so far. <3", "timestamp_created": 1473792545, "timestamp_updated": 1473792545, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.577211", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25481604": {"recommendationid": "25481604", "author": {"steamid": "76561198249281112", "num_games_owned": 64, "num_reviews": 2, "playtime_forever": 22, "playtime_last_two_weeks": 0, "last_played": 1473699671}, "language": "french", "review": "Pour quelques Minutes ou heures \nFranchement ! :)\nJ'ai kiffé mise a par que mon pc et pas un gamer je tourne a 30fps en Ultra 720p qui est mafois pas mal\nmais je suis un adepte du 60fps donc j'attend impatient ma nouvelle carte graphique qui fera largement l'affaire je pense \n\nLes Qualité du jeux : \n- Simple\n- Jolie \n- Fluide ( si bon pc )\n- Complets ( pour un Early Access )\nLes default  du Jeux :\n- Peux pas aller dans l'eaux\n- Bon pc ( Xd )\n- Quelque bug quand tu va dans l'herbe ( rien de grave )\n\nBref si vous avait 17e a mettre la dedans aller s'y mais verifier si votre pc fait l'affaire je vous mets ma config en dessous pour vous mettre une idée\n\nx4 AMD 2.50Ghz\n8go 1866Mhz HyperX Fury\nGT 710 900Mhz DDR3 2GB\n\nJe compte prendre une \nR9 380 \nFX 6300\n", "timestamp_created": 1473700199, "timestamp_updated": 1473700199, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25481366": {"recommendationid": "25481366", "author": {"steamid": "76561198044035986", "num_games_owned": 146, "num_reviews": 7, "playtime_forever": 75, "playtime_last_two_weeks": 0, "last_played": 1473200391}, "language": "english", "review": "For what i have played so far, this game is very inspired and good. at first it feels like it will be just another survival type game. but with it's apealing art, and enjoyable, casual, Zelda sort of game play mixed with survival traits. it kept me eager and wanting to play more. I can't wait to see the finished product. \n\nVideo playthrough:\n\nhttps://www.youtube.com/watch?v=wbfAsf6Sfsw", "timestamp_created": 1473699168, "timestamp_updated": 1473699168, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "25475990": {"recommendationid": "25475990", "author": {"steamid": "76561198028769630", "num_games_owned": 1406, "num_reviews": 97, "playtime_forever": 98, "playtime_last_two_weeks": 0, "last_played": 1473668494}, "language": "schinese", "review": "幼儿园版的老滚，画风讨喜，操作尚可。\n目前抢先测试阶段内容较少，BUG也挺多，建议养肥了再玩", "timestamp_created": 1473668648, "timestamp_updated": 1473668648, "voted_up": true, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.681172", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25463903": {"recommendationid": "25463903", "author": {"steamid": "76561198025495124", "num_games_owned": 720, "num_reviews": 3, "playtime_forever": 48, "playtime_last_two_weeks": 0, "last_played": 1473605263}, "language": "english", "review": "Windscape is surprisingly fun. \nThe combat is simple and works.\nVisuals looks great aside from human models.\nCrafting is intuitive.\nFeels very zelda mixed with a bit of minecraft. \n\nPretty solid so game so far. Downside is there is only about an hour of actual game at the moment.", "timestamp_created": 1473605453, "timestamp_updated": 1473605453, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25463888": {"recommendationid": "25463888", "author": {"steamid": "76561198080346606", "num_games_owned": 155, "num_reviews": 13, "playtime_forever": 73, "playtime_last_two_weeks": 0, "last_played": 1473602788}, "language": "english", "review": "Windscape is a beautifully crafted little game, with cute little references to the Elder Scrolls as well as major ones to Zelda and such kind of older RPGs. Your surroundings are always beautiful, be it a jewel-coated cave, or simply a small little town with a smithy, alchemist and other NPCs you can talk to. Starting in your parents' little farm, you learn to cook a stew that'll be your best friend throughout just about every battle. From there, you are sent out to deliver a package to the local smithy, which starts you out on your adventure to [spoiler]save the floating islands across the sky, as they break apart and threaten to die[/spoiler]! Of course, this game is [u]NOT finished[/u] yet. In it's current state though, it is more than recommendable if you like adventure games with simplistic, yet beautiful graphics, calming music and well designed cities and landscapes.\n\n- Vee", "timestamp_created": 1473605391, "timestamp_updated": 1473605391, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25453014": {"recommendationid": "25453014", "author": {"steamid": "76561198260969042", "num_games_owned": 18, "num_reviews": 1, "playtime_forever": 296, "playtime_last_two_weeks": 0, "last_played": 1499696254}, "language": "english", "review": "=Windscape=\n \nA beautiful Early Access Game with a wonderfull world full with lights that i never seen before.\nIt has a little The Legend Of Zelda feeling from the world to the dungeon :)\nOf course im  looking for new updates to see what new surprises do the game have. There´s much love in there with the NPC,s the City and of course the biome´s.\n\nA great game that surprised me with his style :D", "timestamp_created": 1473551378, "timestamp_updated": 1473551378, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.504082", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25445737": {"recommendationid": "25445737", "author": {"steamid": "76561198025330915", "num_games_owned": 123, "num_reviews": 2, "playtime_forever": 91, "playtime_last_two_weeks": 0, "last_played": 1473516703}, "language": "german", "review": "Erst eindruck super\n\n[url=https://www.youtube.com/watch?v=Hu4VtBuCmrY]Windscape 1.1 reingeschnuppert[/url]", "timestamp_created": 1473523618, "timestamp_updated": 1473523618, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "25443179": {"recommendationid": "25443179", "author": {"steamid": "76561198222524540", "num_games_owned": 10, "num_reviews": 1, "playtime_forever": 399, "playtime_last_two_weeks": 0, "last_played": 1508926992}, "language": "german", "review": "das spiel ist empfelenswerd aber es sollte das nächste uptate raus kommen damit man auf den friedhof kommt ich finde das spiel aber trotzdem richtig empfelenswerd ,weil es einfach totalen spaß macht es ist so wie das bessere minecraft nur besser", "timestamp_created": 1473514742, "timestamp_updated": 1473514742, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.480264", "comment_count": "7", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25439181": {"recommendationid": "25439181", "author": {"steamid": "76561198083340491", "num_games_owned": 98, "num_reviews": 3, "playtime_forever": 87, "playtime_last_two_weeks": 0, "last_played": 1473492799}, "language": "english", "review": "Hello,\n\nI have completely explored everything this game has to offer so far, and let me say this game has ALOT of potential. I loved what I did play, I experienced very minor glitches, riveting battle, a beatuifully crafted soundtrack, secrets arcoss the land, and a decent storyline. I will go over the Pros and Cons of this game and give my general opinion.\n\nPros:\n\nBeautiful Graphics - Everything looked great for cel shading and it ran very smooth at 60fps. I loved the way leaves fell from trees, the effects when mining rocks or chopping trees, the poofs of smoke monsters disappear into. Visually stunning land scapes and trees are most of the game so far, however there are some caves and mines that looked great as well. Crystal glowing effects looked good and really added to the depth of exploring. The only bad part about the graphics is the water. No sound effects when you're walking in it, it is static and never moves, and it seems shoed in. \n\nSoundtrack - This game has the music. Evergreen island has a beautiful overworld theme, however it becomes repetitive after awhile. I wish it would change depending on what section of the world you were in. Sky Harbor's theme has to be my favorite. It sounds like a lively town and I enjoyed exploring it with NPCs walking around, even if there wasn't much to do.\n\nSound Effects - They were good, but could have been better. I wish that when you harvested purple herbs it didn't sound like a hachet going to town on the leaves. It feels out of place, some of the sword hits on Rat Bandits as well felt a little weaker. The web slinging spiders sounded great, and I was disgusted fighting them. The honey pots were awesome, a lively hive awaits perfect honey! \n\nRewarding Exploration - There were times where I set off in a direction just to see what something was. I found a cave hidden in the far corner of the map with it's own story to tell, a man living in a tree fearful of his angry wife, and a mysterious shrine shrouded in magic. I felt like the areas didn't feel reused or tacked in with a couple different rooms, each felt unique with it's own story to tell. I would add more things around the world, a quick 15 minute swoop of the 2nd area in the game and I had completely gathered all the crafting materials.\n\nCons:\n\nWeapons - There is a lack of weaponry, and after you get the bow the game becomes very easy. I would recommend not making a bow to have a real challenge. The one boss fight in the game is a breeze with the bow, halfway through I adjusted to the sword to have a real challenge. It was easy, but better than the bow. I wish there were more weapons for crafting, and that iron was easier to get as the iron sword and bow are really over powered. \n\nAI - This needs work. Enemies would rush towards me if I was miles away. It felt as if their detection rating was too far, and that they would charge you from across the map. Sometimes I would be off exploring and the spider I saw across the hill far away from me would come to tussle. Most of the time they would miss their attacks as well if I slowly strafed to the right or left. Combat felt dull at times.\n\nCrafting Materials - After you start exploring, you'll notice that it's just the same 5 or 6 things scarcely scattered across the land. The worst part is once you gather all of these items, you never really use them. Dry Wood, Ore (which is just copper and a rare ore Pallas that only has 3 on the map), and logs. Cutting down trees takes forever, and it only rewards you with four logs no matter the size of the tree. 4 logs is 1 charcoal bag, and the conversion rate is slow and grindy to get. There are only two tools, a picaxe and an axe. Most of the materials either sat in my inventory or were sold to buy more arrows. I never felt the need for potions as the game never challenged me enough to make them useful. There is only one cooking recipe in the game and it feels way too overpowered. I could eat a soup at 50 hp and go full, whilst still taking combat damage during the healing process.\n\nCollision/Detection - Finally, the last piece of the review before my rating. If you take a sharp turn around a wall or NPC, you will start to move very slowly and occasionally freeze wherever you are standing. This happended very frequently. If you turn a corner too sharp, try to pass grey rocks, or go around NPCs, you will encounter this bug. This happens as well if you try to jump up something you're not suppose to or if you go near any water. It really took away from the games otherwise polished movement. It was very frustarting going through the mineshaft at the end as every corner felt like a trap. The hidden secret inside the mine as well that requires a bit of jumping/platforming was much more difficult than it needed to be. There was a puzzle in the mine as well that I almost got stuck in. During the three color step puzzle, I was walking inbetween one of the steps and my character froze in between steps, I broke free after multiple jumps and walking backwards slowly.\n\nSometimes I would charge a power attack with the copper sword to strike at the bees with, but the attack would not register. I would point blank hit the bee, but no damage would be applied. It was frustrating charging an attack several times for it to miss. I know, just use normal attacks, but that would not help the developer polish this game more. It is not all bad, the bow and arrows really felt dynamic as the arrow has drop off the farther it flies, phyics in how much power it took to draw the bow and how far it was going, and damage at certain ranges. The arrow never missed no matter what part of the hurtbox I shot at.\n\nOverall Rating - As I stated at the start of this review, this game has ALOT of potential. I really did enjoy what I played, and I really have high hopes for this game. For the 90 minutes that I played I find it is obvious that the developer has put care into this game and has created something I believe a lot of people are going to enjoy. When this product is finished I think it will be one of the better indie games for your buck on Steam. Despite a few problems during play, the game ran very smoothly. For an early access game, Windscape was an enjoyable experience that I would recommend to anyone reading this review.\n\n8.5/10\n\n", "timestamp_created": 1473495154, "timestamp_updated": 1473495154, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.586986", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25437726": {"recommendationid": "25437726", "author": {"steamid": "76561198095992168", "num_games_owned": 145, "num_reviews": 16, "playtime_forever": 185, "playtime_last_two_weeks": 1, "last_played": 1515731250}, "language": "english", "review": "For early access this game runs quite well. It's charming in a way, really love the visuals and sound. However, character's dialogue could use a little more pizzazz, but other than that: quite solid.", "timestamp_created": 1473486478, "timestamp_updated": 1473486478, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.544725", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25436499": {"recommendationid": "25436499", "author": {"steamid": "76561197980629860", "num_games_owned": 343, "num_reviews": 4, "playtime_forever": 104, "playtime_last_two_weeks": 0, "last_played": 1473516215}, "language": "english", "review": "When the creator of this game says that he was a fan of Zelda, Golden Axe Warrior, Secret of Mana... this is something that grabs my attention. The Zelda series was one of my favorite to get lost in growing up. Secret of Mana was an entire summer of my childhood... from when I'd wake, until it was time for bed. I think that Dennis and Magic Sandbox have done a great job at showing this influence in their early access game, Windscape.\n\nPros\n-\n1. Story in place is a great start! Looking forward to more content patches that allow for exploration of more areas, continuation of the story.\n2. Gathering doesn't feel burdensome - you naturally come across what you need.\n3. Combat is a great start with a selection of 7-8 different weapons you can craft so far.\n4. Art style is great - it's going to be something people either enjoy or don't. There won't be people that are \"ok\" with it.\n5. Music isn't heavy or intrusive to the experience. Ambience is great as well. Music fits where you are, sound effects reflect your surroundings.\n6. Non-linear - You can explore. Love this <3\n\nCons\n-\n1. Mouse sensitivity is VERY low when initially launched. Easy fix - Options menu is easy enough to traverse.\n2. Crafting could get boring over time - Click, click, and done. Maybe add some possibilities for additional interaction for improved/better crafts?\n3. I know it's early access. This will get fixed.. but there are spelling errors in 4-5 different places that I saw.\n4. Listing this as people will inevitably say it: Too short for the price. I was able to finish what was available (from what I could tell) within an hour livestream. I'm happy to pay the $17 price tag to invest in a future game. Some won't be.\n\nI'm clicking that I recommend this game as I do think that, based off what is currently present, this game will be a fun one! However, if you don't want to pay to invest in the future.. and support the developer.. I'd recommend waiting until there is a bit more than 60 minutes worth of gameplay (unless I missed something!)\n\nInterested in seeing the game before buying?! Check out the attached video. Please note: SPOILERS.\n\nhttps://youtu.be/Xh7QMQIv5U0?t=49\n\nDisclaimer: In the interest of transparency - I was given a code to this game for the purpose of reviewing it. This has not, and would not, influence my enjoying, experience, or review of this game.", "timestamp_created": 1473478607, "timestamp_updated": 1473478607, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25436343": {"recommendationid": "25436343", "author": {"steamid": "76561198084778374", "num_games_owned": 91, "num_reviews": 24, "playtime_forever": 122, "playtime_last_two_weeks": 0, "last_played": 1477861502}, "language": "english", "review": "a short but brand spanking new early access game that shows intense potential\nhighly suggest you perchese if your looking to support a dev that puts his blood and sweat makeing an already promising game!", "timestamp_created": 1473477469, "timestamp_updated": 1473477469, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.445274", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25417212": {"recommendationid": "25417212", "author": {"steamid": "76561198057252117", "num_games_owned": 100, "num_reviews": 1, "playtime_forever": 37, "playtime_last_two_weeks": 0, "last_played": 1473282118}, "language": "german", "review": "Ich finde das spiel echt gut gelungen und wer gern zelda spielt oder gespielt hat ist es das perfekte spiel", "timestamp_created": 1473371899, "timestamp_updated": 1473371899, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "25414908": {"recommendationid": "25414908", "author": {"steamid": "76561197970839144", "num_games_owned": 471, "num_reviews": 34, "playtime_forever": 272, "playtime_last_two_weeks": 0, "last_played": 1512253970}, "language": "german", "review": "Ich kann die positiven Meinungen zu diesem Spiel einfach nur bestätigen.\nDas ist ein wirklich sehr schön gemachtes Spiel.\nDas Gameplay ist einfach gehalten und der Grafikstil passt voll dazu, einfach und doch mit Details.\nGenau diese Mischung macht dieses Spiel interessant.", "timestamp_created": 1473360633, "timestamp_updated": 1473360633, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.529534", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25399483": {"recommendationid": "25399483", "author": {"steamid": "76561198298753637", "num_games_owned": 138, "num_reviews": 15, "playtime_forever": 113, "playtime_last_two_weeks": 0, "last_played": 1488718676}, "language": "english", "review": "Hi ! First of all, let me congratulate the game developers on making this game.\n\nLive feed of the game : https://www.twitch.tv/decekapa24/v/88094871\n\nLets start with Pros:\n\n-Very relaxing atmosphere\n-Despite the bugs it is addictive!\n-Soundtrack is very nice!\n\nNow the Cons:\n\n-Few languages yet available.\n-The AI is still a bit dumb, and weapons are a bit overpowered yet!\n\n\nI will rate this game a good 8/10 if you keep updating it and improving.\nIf it stays like this it is only a 6/10, still the experinece is good !\n\n", "timestamp_created": 1473269285, "timestamp_updated": 1473269285, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25397045": {"recommendationid": "25397045", "author": {"steamid": "76561198101674041", "num_games_owned": 206, "num_reviews": 12, "playtime_forever": 314, "playtime_last_two_weeks": 0, "last_played": 1477668920}, "language": "russian", "review": "Давно искал подобную игру, милая графика, разнообразные мобы, оптимизирована отлично, минусы были, но создатель очень много фиксит багов за одно обновление, хоть они и не часто выходят.\nМало оружия и брони,\nВсё это списываем на раннюю версию игры,  в принципе игра очень хороша даже на этой стадии, советую к покупке и надеюсь, что у игры будет отличное будущее", "timestamp_created": 1473259757, "timestamp_updated": 1476818213, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25394816": {"recommendationid": "25394816", "author": {"steamid": "76561198053953735", "num_games_owned": 139, "num_reviews": 60, "playtime_forever": 26, "playtime_last_two_weeks": 0, "last_played": 1473038239}, "language": "english", "review": "From what I can see from This game is surprisingly not bad, there's something compelling about it, see what I mean with in my #worth video https://youtu.be/T5252Af5QVM", "timestamp_created": 1473249047, "timestamp_updated": 1473249047, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25384372": {"recommendationid": "25384372", "author": {"steamid": "76561198023028864", "num_games_owned": 67, "num_reviews": 3, "playtime_forever": 217, "playtime_last_two_weeks": 0, "last_played": 1473169735}, "language": "swedish", "review": "Spelet var riktigt bra, hoppas på att dom gör det större och fler uppdrag annars 8 av 10. :)", "timestamp_created": 1473185457, "timestamp_updated": 1473185457, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25378085": {"recommendationid": "25378085", "author": {"steamid": "76561198087373465", "num_games_owned": 128, "num_reviews": 12, "playtime_forever": 549, "playtime_last_two_weeks": 0, "last_played": 1504173013}, "language": "german", "review": "Diese Spiel ist wunderschön. Es wurde sehr liebevoll gestaltet und die Story ist auch sehr schön.\n\nLeider kann man (Version 1) jetzt noch nicht den 2 Dungeon betreten.\n\nAlles in einem ein sehr schönes Spiel. Ihr solltet es euch hollen wenn euch die Zelda spiele gefallen.", "timestamp_created": 1473156574, "timestamp_updated": 1490198483, "voted_up": true, "votes_up": 10, "votes_funny": 2, "weighted_vote_score": "0.604486", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25371874": {"recommendationid": "25371874", "author": {"steamid": "76561198063448067", "num_games_owned": 131, "num_reviews": 39, "playtime_forever": 229, "playtime_last_two_weeks": 0, "last_played": 1485291702}, "language": "brazilian", "review": "Muito bom. vale a pena.", "timestamp_created": 1473112985, "timestamp_updated": 1473112985, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25371034": {"recommendationid": "25371034", "author": {"steamid": "76561198166060889", "num_games_owned": 85, "num_reviews": 2, "playtime_forever": 831, "playtime_last_two_weeks": 0, "last_played": 1504173388}, "language": "german", "review": "Es sehr schönes Spiel was mit Liebe und Humor (Pfeil ins Knie ;D) gemacht zu sein scheint. Die Grafik ist süß gehalten, was ich mag und Steuerung mit dem Controller (XboxOne) funktioniert. Es gibt eine kleine Story die noch denk ich mal weitergeführt wird und man kann (noch im kleinen Stil) sammel und craften (aktuell nur Waffen, Essen, Tränke).\nIch freue mich auf die Zukünftigen Udates und kann es nur weiterempfehlen.", "timestamp_created": 1473109587, "timestamp_updated": 1473109769, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25361925": {"recommendationid": "25361925", "author": {"steamid": "76561198091321312", "num_games_owned": 200, "num_reviews": 40, "playtime_forever": 206, "playtime_last_two_weeks": 0, "last_played": 1479037760}, "language": "turkish", "review": "Mükemmel Legend Of Zelda'ya Benzeyen Bir Rpg Oyunu!\nDaha Early Acces Olmasına Rağmen Çok Eğlendim , Gelişince Nasıl Olucak Acaba ^^", "timestamp_created": 1473072535, "timestamp_updated": 1473072535, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.520000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "25346690": {"recommendationid": "25346690", "author": {"steamid": "76561198122137610", "num_games_owned": 73, "num_reviews": 2, "playtime_forever": 142, "playtime_last_two_weeks": 0, "last_played": 1473351094}, "language": "german", "review": "ich finde es ist ein ausgezeichnetes spiel die ersten questen haben mir sehr sehr gut gefallen auch die nebenquesten sehr gut nur ich würde mir gerne wünschen das mehr orte und questen schon intigriert weren als beispiel mehr leute in der stadt die nebenquesten haben oder das der frithof etc schon drinne wäre war traurig nicht weiter machen zu können wünsche mir wirklich das das spiel ganz groß wird und viele neue waffen secrets und geheime dungens hinzugefügt werden voralem waffen / orte", "timestamp_created": 1472998837, "timestamp_updated": 1472998837, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.474138", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25343568": {"recommendationid": "25343568", "author": {"steamid": "76561198032781249", "num_games_owned": 234, "num_reviews": 1, "playtime_forever": 433, "playtime_last_two_weeks": 0, "last_played": 1499031344}, "language": "german", "review": "Es hat schon wirklich was von Zelda, sehr schönes Spiel! :D", "timestamp_created": 1472987181, "timestamp_updated": 1472987181, "voted_up": true, "votes_up": 5, "votes_funny": 2, "weighted_vote_score": "0.541252", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25341141": {"recommendationid": "25341141", "author": {"steamid": "76561198046259498", "num_games_owned": 199, "num_reviews": 10, "playtime_forever": 94, "playtime_last_two_weeks": 0, "last_played": 1498638650}, "language": "english", "review": "10/10\nBuy it", "timestamp_created": 1472976834, "timestamp_updated": 1472976834, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.399201", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "25331629": {"recommendationid": "25331629", "author": {"steamid": "76561198145939851", "num_games_owned": 70, "num_reviews": 1, "playtime_forever": 309, "playtime_last_two_weeks": 0, "last_played": 1513969568}, "language": "german", "review": "Sehr tolles Spiel.\nFür eine Early Access Version ist mit 1 Stunde Spielzeit sehr viel Spaß und Abenteuer vorhanden.\nNatürlich kann man auch jetzt schon neben den Quest weiter Spielen wobei man die gesammte Welt erkunden kann. Eine Liebevolle Grafik und Schöne Landschaften tragen zum Spielspaß bei.\n\nIch kann das Spiel nur Empfehlen.\nEcht Super Spiel!!!", "timestamp_created": 1472930788, "timestamp_updated": 1472930788, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25329737": {"recommendationid": "25329737", "author": {"steamid": "76561198135968494", "num_games_owned": 262, "num_reviews": 32, "playtime_forever": 106, "playtime_last_two_weeks": 0, "last_played": 1489437739}, "language": "english", "review": "Cute little game.  After 90min of doing quests the game adds a quest to go to the graveyard which is a part of the game thats not finished yet.  So the game consists of around 90min of gameplay,  not to mention I did \"Not\" explore everything,  So their is a good chance that their is more to do. This game reminds me a lot of zelda ocarina of time type of adventure,  Not as well fleshed out but a pretty fun little game so far.  I think it's worth a buy while it's on sale,  Not sure it's worth full price for the amount of quests that are in the game as of release.", "timestamp_created": 1472924662, "timestamp_updated": 1472924662, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502573", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25317631": {"recommendationid": "25317631", "author": {"steamid": "76561198319901900", "num_games_owned": 2, "num_reviews": 3, "playtime_forever": 139, "playtime_last_two_weeks": 0, "last_played": 1485581729}, "language": "english", "review": "I recommend the game if ur a Skyrim Fan or an RPG fan. But I had a problem and its that it lags on medium settings when i have 80 fps. Thats all. Oh and you will get 60 minutes out of the game if u follow the quests only.", "timestamp_created": 1472875695, "timestamp_updated": 1472875695, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.473684", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25317422": {"recommendationid": "25317422", "author": {"steamid": "76561198126636269", "num_games_owned": 816, "num_reviews": 101, "playtime_forever": 161, "playtime_last_two_weeks": 0, "last_played": 1489305954}, "language": "schinese", "review": "简单的描述一下这个游戏\n画风稍微魔性√\n非常早期的版本×\n地图好多空气墙跑得不够自由×\n简单明了的游戏设定√\n貌似适应了某种设定貌似就能接受了√\n其他想说的没啥好说的×\n操作手感勉强可以√\n在这个版本里，这个游戏的内容实在太少了，所以很不推荐现在就入这个游戏。", "timestamp_created": 1472874502, "timestamp_updated": 1472874502, "voted_up": true, "votes_up": 7, "votes_funny": 2, "weighted_vote_score": "0.603818", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "25314085": {"recommendationid": "25314085", "author": {"steamid": "76561198071252933", "num_games_owned": 358, "num_reviews": 127, "playtime_forever": 97, "playtime_last_two_weeks": 0, "last_played": 1473928761}, "language": "german", "review": "Die Momentane Spielzeit dieser Version beträgt 1-2 Stunden.\n\nHier ein kleiner First Look: https://youtu.be/z9A-bG92tSI\n\nIn dieser Spieldauer entdeckt man ca eine Hand voll Höhlen zum entdecken, einen Dungeon ala Zelda mit leichten Rätzeln, einige Kampfsituationen die leider sehr leicht zu meistern sind und man sich nicht wirklich Schützen muss mit dem Schild und ein Crafting System welches simple aber auf dauer etwas nervig werden kann, da einige Interaktionen mit dem Abbauen der Ressourcen auf dauer sehr eintönig und langweilig wirken. \n\nNatürlich warten auf euch aber eine Main Quest ( Die Momentan leider nicht viel her gibt., etwas Spannung fehlt hier. ) die euch durch das vorhandene Gebiet zieht mit einigen Nebenmissionen. \n\nAlle Quests werden in Text Bubbles erzählt während die Personen selbst eine eigene \"Sprache\" benutzen ähnlich wie in Zelda.\n\nZudem bekommt ihr einen einzigartigen Grafikstil mit viel Potenzial nach Oben und eine Art Open World wie man Sie aus beliebten Titeln wie Secret of Mana, Vampires Dawn oder eben Zelda kennt. \n\nTrotz der kurzen Spieldauer hatte ich eindeutig meinen Spaß.\n\nUnd der neue Content soll im nächsten Patch enthalten sein welcher auf  interessanten Content hoffen lässt.\n\nEin größer Pluspunkt hierbei ist ähnlich wie in Dark Souls sollen dort auch Fallen bzw Beile von der Decke hängen, endlich bekommt es ein First Person RPG hin Fallen in die Dungeons einzubinden!\n\nVon der KI bin ich etwas enttäuscht, vielleicht bin ich aber auch nicht die passende Alters Klasse.\n\nDiese läuft nämmlich Blind auf euch zu ohne wirklich auszuweichen und kann ganz einfach mit einem Ständigen druck auf die D Taste mit einem druck auf die Linke Maustaste fürs Schlagen ohne Probleme besiegt werden.\n\n Dabei spielt es keine Rolle ob es 1 Bandit oder 4 sind die vor euch stehen.\n\n\nEs sei auch noch anzumerken das die \"Hauptstadt?\" etwas klein und komisch wirkt vom Aufbau her wirkt Sie für mich ehr fehl am Platz bzw zu Abstrakt zu Leer, ebenso sind die Bewohner der Stadt immer nur auf einem Fleck anstatt irgendwelchen Tätigkeiten nach zu gehen. \n\nEbenfalls könnte das Level Design hier und dort ein Apfelbaum, einen Baum mit einer Eule drauf, Spezielle Stein Formationen oder alte Ruinen oder ähnliches vertragen, vieles wirkt wie ein Brush die man über die Landscapes gezogen hat ohne spezielle Elemente hinzuzufügen. \n\nZudem verstehe ich den Sinn der ganzen Tore nicht, vielleicht sind diese auch nur in der EA Fassung enthalten um eine Art richtung zu weisen für den Content der momentan enthalten ist.\n\nIch hatte die ganze Zeit das Gefühl so keine wirkliche \"Offene Welt\" zu haben sondern ständig von einem Käfig in den nächsten zu springen. \n\nEine Stärke wiederrum sind aber wirklich die Höhlen & die Dungeons diese sind sehr gut gestaltet und entfalten nicht nur eine gute Atmosphäre sondern sie wecken auch noch den Erkundungsdrang.\n\nDa ich aber Momentan wirklich gespannt bin wie sich Windscape weiter entwickelt und wie Sie das volle Potenzial ausschöpfen möchten im laufe der Entwicklung, gebe ich meinen Daumen nach Oben.\n\nDa ich genrell schon sehr lange darauf warte das jemand das gute alte Konzept in etwas neuem Umwandelt und eventuell seine eigene Feder mit hineinbringt um ein altes Gerne mit etwas Salz und Zitrone etwas aufzufrischen.", "timestamp_created": 1472855995, "timestamp_updated": 1474005223, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.489362", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "25313162": {"recommendationid": "25313162", "author": {"steamid": "76561198108772141", "num_games_owned": 534, "num_reviews": 52, "playtime_forever": 140, "playtime_last_two_weeks": 0, "last_played": 1472656196}, "language": "german", "review": "Windscape von Headup Games ist ein wunderbares Abwenteuer Spiel welche zudem Sanbox und RPG vermischt  und für jeden Abenteur Liebhaber und sich gerne an spiele wie Zellda zurück erinnert sicher einen blick wert !\n\nDoch schaut es euch am besten gleich mal in meinem Kleinen Preview Video an:\n\nhttps://www.youtube.com/watch?v=mno0uVO4GKc&feature=youtu.be\n\n\nIch kann es einfach nur empfehlen für alle Abenteuer und RPG Liebhaber ;))", "timestamp_created": 1472852316, "timestamp_updated": 1472852316, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502075", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25311101": {"recommendationid": "25311101", "author": {"steamid": "76561198125215195", "num_games_owned": 94, "num_reviews": 13, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1481212754}, "language": "german", "review": "Sehr Schön Das Spiel, Abenteuer Und Crafting Schön Kombiniert wie ich Finde :)\nEin Ersteindruck Sieht Man Im Ersten Video / Part Von Mir.\nhttps://www.youtube.com/watch?v=N0UxJL4jrFU", "timestamp_created": 1472844575, "timestamp_updated": 1472844575, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.478261", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "25310566": {"recommendationid": "25310566", "author": {"steamid": "76561198053204237", "num_games_owned": 185, "num_reviews": 9, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1472841336}, "language": "spanish", "review": "Spain:\n________________________\nParece increible. Lo tengo y he hecho un video al respecto y la verdad es que es bonito de ver.\nRecomendado.\n\nEnglish:\n________________________\nIt looks incredible. I got it and I made a video of the game and it's really nice to see.", "timestamp_created": 1472842869, "timestamp_updated": 1472842869, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.408805", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "25309610": {"recommendationid": "25309610", "author": {"steamid": "76561198160129676", "num_games_owned": 54, "num_reviews": 1, "playtime_forever": 505, "playtime_last_two_weeks": 0, "last_played": 1488678857}, "language": "english", "review": "relaxing game love the story so far really good crafting system good creaters and hope them good luck whit early access.", "timestamp_created": 1472839583, "timestamp_updated": 1472839583, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.472441", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25307167": {"recommendationid": "25307167", "author": {"steamid": "76561198035274447", "num_games_owned": 195, "num_reviews": 2, "playtime_forever": 459, "playtime_last_two_weeks": 0, "last_played": 1488990436}, "language": "english", "review": "I find the game really nice and cannot wait for a full release. The low poly artstyle fits well, but some objects feel out of place. The gameplay elements are nice, but not new. Still, the rpg and adventure elements are good. You can explore a world full of creatures and fight bosses, craft items and solve puzzles. The game needs polishing, but in its current state its nice to play and explore.", "timestamp_created": 1472831724, "timestamp_updated": 1472831724, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.564541", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25305443": {"recommendationid": "25305443", "author": {"steamid": "76561198304249014", "num_games_owned": 12, "num_reviews": 1, "playtime_forever": 76, "playtime_last_two_weeks": 0, "last_played": 1506175651}, "language": "german", "review": "Windscape\n\n\nIch habe das Spiel jetzt knapp über eine Stunde gespielt und kann sagen es macht mir wirklich Spaß. Eigentlich bin ich keine großer Fan von Rollenspielen aber ich muss sagen hier fühlt sich der Einstieg in das Spiel sehr \"leicht\" an. Für ein Ein-Mann Projekt finde ich es schon beeindruckend was in diesem Spiel so alles möglich ist. Meine Vorurteile bezüglich der Optik wurden ganz klar wiederlegt. Wenn man sonst hauptsächlich aktuelle Vollpreis 3D Titel spielt ist Windscape eine echt farbenfrohe Abwechslung. Was ich auch noch sehr gelungen finde sind die für meinen Geschmack sehr witzigen Figuren die man hier und da antrifft. Da musste ich doch teilweise echt schmunzeln über die Phantasievolle Gestaltung.\n\nIch werde den Verlauf des Spiels definitiv weiter verfolgen und freue mich auf mehr und neue Inhalte.", "timestamp_created": 1472825941, "timestamp_updated": 1472825941, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25304938": {"recommendationid": "25304938", "author": {"steamid": "76561198031510167", "num_games_owned": 932, "num_reviews": 15, "playtime_forever": 385, "playtime_last_two_weeks": 0, "last_played": 1477671605}, "language": "english", "review": "This game is currently EARLY ACCESS so buy only if you wish to support the developer.\n\nThis game is a brilliant love letter to Legend of Zelda and games like Lands of Lore, The art style simplistic but intricate at the same time. What few areas are currently available to explore are well designed.\n\nI strongly advise keeping an eye on this title. If you aren't into early access, definitely add it to your wishlist and show support to the developers in other ways.", "timestamp_created": 1472824175, "timestamp_updated": 1472824175, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.520000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25303626": {"recommendationid": "25303626", "author": {"steamid": "76561198162677079", "num_games_owned": 26, "num_reviews": 2, "playtime_forever": 121, "playtime_last_two_weeks": 0, "last_played": 1474897283}, "language": "german", "review": "Erstmal um das anzumerken - wunderschönes spiel \n\n(Abschnitt für den Entwickler) \nIch hatte ein paar kleine Dinge, welche mich leicht gestört haben. \n# meckern auf hohem Niveau\nNormal bin ich bei einem MAUSSPEED von etwa 7k dpi und das hat sich zu Beginn etwas langsam angefühlt auf Stufe 10 der ingame-Einstellung. Man gewöhnt sich daran. \nIch finde die Musik ist sehr schön und ich habe sie auch sehr genossen obwohl ich normalerweise alles ohne Sound spiele. Damit kommen wir auch zu dem einzigen Punkt der meiner Meinung nach wirklich fehlt und das ist ein Regler in den Einstellungen für EFFEKTLAUTSTÄRKE. \nOptional wäre vielleicht noch ein SCHWIERIGKEITSREGLER einzufügen aber das ist nicht nötig. \n\n(Für alle Kaufinteressenten)\nJetzt den guten Sachen :D \nSehr gefallen haben mir die Baum-fäll-Animation und die Liebevoll gestaltete Landschaft.\nDie Aggro-range ist einfach Sichtweite und Sichtfeld entsprechend was Windscape endlich zu einem Game macht wo das realistisch geregelt ist.  \nUnd es ist überraschend wie viel auf einer so „kleinen“ Map unterzubringen ist.\n\nEs wird von mir bestimmt noch ein Video geben aber das muss noch ein wenig warten :D\nVlt auch einen Stream mal schauen :) \n\nhttps://www.youtube.com/channel/UCDKcrY1AnQyhbXKXphZXlSg\nhttps://www.twitch.tv/luckytrickshotlp\n\n-Luckytrickshot \n", "timestamp_created": 1472819511, "timestamp_updated": 1472819511, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.547325", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25302324": {"recommendationid": "25302324", "author": {"steamid": "76561197998607723", "num_games_owned": 204, "num_reviews": 6, "playtime_forever": 147, "playtime_last_two_weeks": 0, "last_played": 1474544489}, "language": "english", "review": "Runescape in FP - and singleplayer", "timestamp_created": 1472813554, "timestamp_updated": 1472813554, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25302169": {"recommendationid": "25302169", "author": {"steamid": "76561198318649162", "num_games_owned": 1, "num_reviews": 1, "playtime_forever": 1598, "playtime_last_two_weeks": 0, "last_played": 1492425599}, "language": "german", "review": "Interssantes Spiel mit farbenfrohen Welten. Selbst Höhlen leuchten in einer Farbenpracht wie man es von anderen Spielen nicht kennt. Der etwas simple Anfang steigert sich schnell zu süchtig machenden Abenteuern und großen, komplexen Welten. Die Polygonwelt ist erst etwas ungewohnt wenn man von einem fotorealistischen Spiel kommt. Dann empfindet man sie aber eher als angenehm und als sehr phantasievoll. In einem Spiel ist es schön, Dinge zu sehen, die es im wirklichen Leben so nicht gibt. So etwas fotorealistisch zu bauen, würde den Spielepreis wahrscheinlich verdreifachen und tut gar nicht nötig. Im Gegenteil ich finde es sogar so besser. Die unterlegte Musik nervt nicht und passt sehr gut zu den Szenen. Hilfreich fand ich auch die zusätzlich unterlegten Töne zur besseren Orientierung. Man kann diese präzise orten. Z.B. den Hammerschlag vom Schmied um ihn zu finden. windscape fordert aber auch eine gewisse logische Denkweise. Läuft man einfach nach Versuch und Irrtum da wieder herau wo man reingekommen ist, verplempert man unnötige Zeit und das wird durch entsprechende Angriffe bestraft. Aber ich will nicht zu viel verraten. Probiert es selber aus! Es lohnt sich. Ich finde das Spiel ist eine gelungene Mischung aus Aufgaben, Action und Gesprächen mit den Figuren.", "timestamp_created": 1472812727, "timestamp_updated": 1472813636, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "25299208": {"recommendationid": "25299208", "author": {"steamid": "76561197982647015", "num_games_owned": 268, "num_reviews": 13, "playtime_forever": 512, "playtime_last_two_weeks": 0, "last_played": 1477830718}, "language": "german", "review": "WINDSCAPE\n\nIch wollte das Spiel nur kurz angespielt haben für ein Review-Video.(Link ganz unten im Post)\nDoch schnell wurden aus den geplanten 30 Minuten über 60. \nDas Spiel ist sehr einfach gehalten was die Steuerung und die Grafik angeht. Das tut dem Ganzen allerdings keinen Abbruch, da der Rest einfach sehr harmonisch ist. \nMusik, Gameplay und Stimmung passen einfach zusammen. \n\nWir spielen als junges Mädchen einer Bauernfamilie und wollen natürlich etwas aufregenderes machen als Kochen und Heu ernten.\nAlso beauftragt uns unser Vater mit einer Aufgabe. Wir sollen ein Päckchen in die nächste Stadt bringen und \ngenau hier beginnt unser Abentuer. \n\nDas Spiel ist im Ganzen gesehen ein knuffiges Rollenspiel für passionierte Spieler und ich denke Mal sein Geld wert. \nWer sich einen kleinen Einblick in das Spielgeschehen machen möchte hat hier knapp 60 Minuten Zeit dazu in meinem Videoreview:\n\nViel Spaß!\n\nhttps://www.youtube.com/watch?v=pRfG11cjet8", "timestamp_created": 1472793930, "timestamp_updated": 1472793930, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.563248", "comment_count": "3", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25299107": {"recommendationid": "25299107", "author": {"steamid": "76561198277984478", "num_games_owned": 374, "num_reviews": 141, "playtime_forever": 289, "playtime_last_two_weeks": 0, "last_played": 1478052911}, "language": "english", "review": "Early access game - early access review!\n\nThis game is abouta few things, style is the #1 thing to take away from this game.\nThe visuals are amazing and simple at the same time, all while  running very smoothly, even on lower-end systems. Most games with cel shading, or even quasi cel shading generally run poorly, but Windscape doesn't seem to suffer from this.\n\nA simple story, a VERY accesible crafting/gathering system means everyone can figure this stuff out, and very fast too.\n\nThe enemies may not be brightest, but those are neither here nor there. I never cared abotu enemy AI in Zelda games, except for maybe the bosses.\n\nWhich.. well the first boss totally bugged out on me, and just sorta stopped moving, (it's worth mentioning I am the undisputed Queen of breaking games)\n**UPDATE- A new update to the game fixes this boss bug ! It's an impressive fight now ^^b cheers!\n***\n\nThese small things will be fixed as the devs pour even more love into the world!\n\nWhat I don't see here is .. hard to put my finger on it.\nCharm is it? The people in the world seem a little too straight forward, and I would expect them to be very whimsical and silly, given the game's aesthetic. \n\nThey are good, and the dialogue is well done, I was just expecting it to be liek Zelda all the way! \nWit that being said, I really enjoy this game for what it is, and what it's trying to do: which it succeeds, imo.\n\nA very accessible open world game with clever and simple mechanics to keep you invested ^^\n\nCertaintly worth keeping an eye on this one as it develops more!\n\nRecommended ^^", "timestamp_created": 1472793357, "timestamp_updated": 1473374901, "voted_up": true, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.509024", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25295044": {"recommendationid": "25295044", "author": {"steamid": "76561198041596466", "num_games_owned": 870, "num_reviews": 33, "playtime_forever": 47, "playtime_last_two_weeks": 0, "last_played": 1472688251}, "language": "german", "review": "WINDSCAPE REVIEW\n\n[h1] WINDSCAPE VERSION 1 REVIEW (WIRD REGELMÄßIG GEUPDATED) [/h1]\n\n[b] Pro [/b]\n\n- Einige optionale Quests [spoiler] Benjamin... [/spoiler]\n- große Welt\n- schöne Charaktere & Dialoge \n- nette Grafik\n- Crafting\n\n[b] Contra [/b]\n\n- man kann drei Feinde gleichzeitig stunen & besiegen (etwas OP meiner Meinung nach)\n- wenige Grafikbugs\n\n\n[b] FAZIT [/b]\nAlles in allem, finde ich das es ein gutes Spiel ist und es sich aufjedenfall lohnt sich mal es anzuschauen bzw. zu spielen!", "timestamp_created": 1472771615, "timestamp_updated": 1472773804, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.496101", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25293995": {"recommendationid": "25293995", "author": {"steamid": "76561198020085437", "num_games_owned": 693, "num_reviews": 345, "playtime_forever": 153, "playtime_last_two_weeks": 0, "last_played": 1472645962}, "language": "english", "review": "Windscape is a Adventure RPG, you gather resources, you craft weapons, potions and make food, you explore, you gear up, you fight bosses and explore deep dungeons, sounds familiar? :) but yea its what it is, its quite charming, with some nice simple visuals, its a very casual kind, its not very difficult so everyone can play this. Early access so some parts of the game is still not in yet, and the AI is pretty dumb :) but its work in progress, So far its a very entertaining and fun little RPG experience.\n\nGameplay:\nhttps://youtu.be/LjJw3sDplIo\nhttps://youtu.be/J2DcA_B4nh8\n", "timestamp_created": 1472767135, "timestamp_updated": 1472767135, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.463007", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25293822": {"recommendationid": "25293822", "author": {"steamid": "76561197997959141", "num_games_owned": 466, "num_reviews": 12, "playtime_forever": 83, "playtime_last_two_weeks": 0, "last_played": 1472680660}, "language": "english", "review": "7 / 10 (In it's current state)\n\nAlthough it's a bit hard to rate an unfinished game, it is a product up for sale and therefore must be done. Remember that when buying this game you are installing faith in the developer and in a way you are making an investment.\n\nThe Looks:\nThe game definately has that grow home, polygon style that many gamers love. Although some may not find it the most graphically pleasing, the developer has done well to use it to make an immersive world that does show some impressive scenery. The character design of some characters may seem a bit \"derpy\" but thats the endearing style that the game was going for and i think it works. \n\nThe Mechanics:\nThe game offers quite alot in terms of mechanics. The dark souls-esk combat is enjoyable, however doesn't retain the same difficulty, thankfully. The choices of different weapons you can wield is something i've always enjoyed in a game, where the gamer can choose their prefered fighting style and go down the route they want, rather than being forced to use one single monotonous weapon choice. The game fortunately allows you to do this, and not only this but to craft you're own weapon too. The crafting element is introduced very quickly in the game as if to say it's a main focus. It seems alot more of a open world suvival game with the crafting elements which works well as you gain materials as a reward piece when defeating enemies. The puzzles itself, i wasn't able to explore too much of but it seems fairly easy to beguin with, which you can only think would get progressively harder as you go through the game. \n\nIf you want to check out some game play there is a video here, however this video is from the older version of the game and the up to date version may differ: https://www.youtube.com/watch?v=mY8Ig7CV0AM&feature=youtu.be", "timestamp_created": 1472766512, "timestamp_updated": 1472766512, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.553348", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 128, "total_negative": 6, "total_reviews": 134}}
