{"reviews": {"39419330": {"recommendationid": "39419330", "author": {"steamid": "76561198060979976", "num_games_owned": 90, "num_reviews": 3, "playtime_forever": 152, "playtime_last_two_weeks": 152, "last_played": 1516211894}, "language": "japanese", "review": "すっごい酔うよ！！特にプロ操作(エスコンのビギナーとノーマルの違いと一緒。ラダー手動、ロール＆ピッチの制限解除)すると余計クルよ！！\nでも旅客機に最初に乗った時、全く同じ酔い方したよ！！\n\nこれですよ待ってたのは。自分の魂は間違いなく、ＰＣ前じゃなくて、架空かも知れなくても空にあった。\n\n操作系が本当に「エア」スティックを引いたりしなきゃいけないから、操作範囲を超えていきなりスティック手放した判定受けたりとか、何のチュートリアルもなくいきなりカメラ撮影しろって言われて目の前の計器（スマホ）を取り外して撮影したりとか、一見トゥーンレンダリングされて非リアルな景観にガッカリしたりとか、そりゃあ言いたい事は何にもない訳じゃない。だけど。\n少しずつ高度を上げて（或いは初期エネルギーをロケットで自力上昇するグライダーで一気に）に、ふと見降ろした海面は「着陸寸前の旅客機の客席から見える海面」と寸分たがわなくて。何より航空力学を相当忠実に再現したのだな、と思える空力モデルを採用していて。（コメント著者はDCS, RiseOfFlight, FSX@pmdg, などのフラシムヲタです）\nVRゲーをぶっ続けで4時間遊び、コントローラの電源が足りなくなるまで使い尽くしたのはこのゲームが初めてでした。\n\n家に空を持ち込みたい人は即刻買いましょう。", "timestamp_created": 1516213856, "timestamp_updated": 1516213856, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39326463": {"recommendationid": "39326463", "author": {"steamid": "76561198052762749", "num_games_owned": 166, "num_reviews": 5, "playtime_forever": 103, "playtime_last_two_weeks": 70, "last_played": 1515893128}, "language": "english", "review": "BUY IT BUY IT BUY IT. Let me just state that I I am avid flight sim fan, so flying games appeal to me. This is unique ittle gem. If you are coming with FS background, the whole abstract graphics might be a bit of a turn off - fear not, this is a wonderful flight sim game. There are two modes more casual arcade mode and more of a sim. Keep in mind this is not your Falcon or DCS, but this game provides you with a pure joy of flight. YOu will not regret it - buy it even for the full price. Devs are activly suporting this game.\n\nNow about VR aspect - I am fairly new to VR - got RIft back in December 2017. This game helped me get over my motion sickness. I had fairly sever case whereas I was not able to do any VR motion for more then few minutes. Repeated short exposure in Ultrawings eventually got me over the hump and now I can enjoy ANY VR motion for the duration of my gaming session - from an hour and longer without any issues. This is reason alone to get this game. I recommend this game wholeheartedly! \n\nThe game offer number of simply missions that get more complex and challenging as you prohress. With each completed mission you earn cash that allows you to unlock additional planes - starting with ultralight, jet powered glider and finally a sports plane resembling Extra 300. All three planes are different experience and even after you unlock the new planes, the old ones are still joy to fly. \n\nDevelopers - consider adding multiplayer for Ultrawings 2 - yeah, there's gotta be Ultrawings 2 - please make it so! Let us support your efforts - release DLCs - more islands, additional planes, maybe a helicopter or gyrocopter? MORE PLEASE!\n\nBeside Elite Dangerous, Ultrawings is the game that would easily justfy buying HMD. \n\nAWESOME GEM - screw sales just buy it now!!", "timestamp_created": 1515896959, "timestamp_updated": 1515896959, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39221028": {"recommendationid": "39221028", "author": {"steamid": "76561198085605855", "num_games_owned": 175, "num_reviews": 15, "playtime_forever": 14, "playtime_last_two_weeks": 0, "last_played": 1514666265}, "language": "english", "review": "Firts it gave me motion sickness then it gave me fun", "timestamp_created": 1515548093, "timestamp_updated": 1515548093, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39214503": {"recommendationid": "39214503", "author": {"steamid": "76561198033650157", "num_games_owned": 90, "num_reviews": 19, "playtime_forever": 419, "playtime_last_two_weeks": 0, "last_played": 1515115851}, "language": "english", "review": "fun", "timestamp_created": 1515525136, "timestamp_updated": 1515525136, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39162580": {"recommendationid": "39162580", "author": {"steamid": "76561197986705590", "num_games_owned": 254, "num_reviews": 8, "playtime_forever": 255, "playtime_last_two_weeks": 0, "last_played": 1515162840}, "language": "english", "review": "Super fun flying sim :) \n\nThere's just two changes that I'd like to see:\n- Trigger grab (gets painful with Vive controller over extended sessions)\n- Sandbox mode, where you can try out all the planes without having to finish story mode first (which also doesn't sync with Steam Cloud...)\n\nOther than that, definitely recommended !", "timestamp_created": 1515355116, "timestamp_updated": 1515355116, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39134070": {"recommendationid": "39134070", "author": {"steamid": "76561197971075117", "num_games_owned": 629, "num_reviews": 8, "playtime_forever": 466, "playtime_last_two_weeks": 215, "last_played": 1515456292}, "language": "english", "review": "Ultrawings is hands down one of the best VR games of 2017.  Both the Vive and the Rift offer up a quality flight-sim experience that perfectly balances arcade and simulation with a seemingly endless array of challenges that will keep you playing for countless hours. I found the Oculus with the Touch controllers delivered the most immersive and comfortable experience; at least from a control standpoint where you can either using your hand to actually grip a virtual stick to fly your aircraft, or just use the analog sticks on the Touch. Gripping the virtual stick offers up a more realistic experience within the game at the expense of the strain and soreness of having your hand extended for long periods of time holding onto nothing.   There is also an option for a gamepad on PC, but this offers the least impressive experience; especially in later levels when you are trying to take photos and shoot balloons. Vive controllers offer the same virtual hands as the Touch but the triggers become painful to squeeze for long periods of play and the orientation in which you hold them don’t feel natural. Additionally, the rudder controls on Vive are overly sensitive due to apparent lack of true analog input.\n\nOnce in the air there is so much to experience and accomplish based on the job you’ve selected from the computer terminal in airport offices located on several lush tropical islands. As you complete jobs you’ll earn money to purchase new aircraft and buy new airports on other islands, all of which keeps adding to the job listings and your piggy bank. Jobs come in several categories. There are the typical target ring courses that reward you for speed and accuracy, as well as a fun photo mode where you have to find specific landmarks and take a photo with your tablet device. There is a balloon pop mode where you fly with one hand and aim a pistol with the other to shoot colorful balloons scattered around the islands within a time limit, and perhaps the most challenging mode; precision landing where you have to stall, and land your plane with almost zero airspeed to drop onto a ringed target. Or you can just lose yourself in countless hours of exploration and free flight…at least until you run out of fuel.\n\nPerhaps the best thing about Ultrawings is the comfort level; especially on the PC version, which I played for six hours straight with no issues other than a sweaty forehead. You can kick back in a recliner and play this game forever. The framerate is fluid and the draw distance is impressive with only some minor pixel stair-stepping on distant lines.   The draw distance is surprisingly good, and there are nice touches of environmental detail such as other aircraft, boats, and even some cars. The N64-esque landscape itself is intentionally simple, which keeps the game both charming and fun as well as maximizing the framerate. The most complex model in the game is your plane and its functional instrument panel. One of the more impressive details on the PC were these flocks of birds that would swarm around the various island bluffs in realistic patterns, but the most impressive detail on the PC for me was the real-time shadows of the plane’s wing and canopy frame that would slowly drift across my cockpit and controls as my course changed in relation to the sun. I could even lean forward and see smudges and scratches on the Plexiglas panels of my cockpit.\n\nUltrawings is an amazing VR flight game that will delight the entire family. They even have these charming crash visuals of you either floating through stars or underwater bubbles depending on how you crash, followed by an obituary on your office computer when you restart. Motion sickness is of limited concern unless you play for extended hours, which is easy to do because of the progressive and addictive challenges that continually fuel your desire to keep playing and see what’s next.   I would have enjoyed more islands and planes or maybe even a hang glider mode that uses thermal updrafts around those island spires and bluffs, but that is only because I love this game so much.  For $25, you get plenty of gameplay and entertainment value.\n\nTo sum it up, Oculus Rift is a near-perfect experience in presentation, controls, and gameplay as long as you are using the Touch. The Vive is a close second with only the awkward motion control wands creating some painful issues during extended play.   No matter which VR system you own, Ultrawings is a must-play game that totally delivers the thrill and sensation of flight in a way only VR can do.\n\nFor the FULL review including PSVR comparisons visit http://gamechronicles.com/video-games/ultrawings-review-rift-vive-psvr/\n", "timestamp_created": 1515279933, "timestamp_updated": 1515279933, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "39108610": {"recommendationid": "39108610", "author": {"steamid": "76561198384127453", "num_games_owned": 31, "num_reviews": 27, "playtime_forever": 71, "playtime_last_two_weeks": 29, "last_played": 1516356808}, "language": "english", "review": "I was a big fan of Pilot wing on snes for the time it came out and this is like reliving it only way better!\nMay have cartoon graphics but it seems like really being in the air this game really nails it.", "timestamp_created": 1515220207, "timestamp_updated": 1515220207, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39094726": {"recommendationid": "39094726", "author": {"steamid": "76561198038577529", "num_games_owned": 56, "num_reviews": 3, "playtime_forever": 430, "playtime_last_two_weeks": 254, "last_played": 1515928233}, "language": "english", "review": "The game is very fun and nice to play if you just want to chill out. There were a couple of annoying things in certain levels, like the plane getting stuck, but for the money its a really nice arcade/sim flight game. 9/10", "timestamp_created": 1515181889, "timestamp_updated": 1515181889, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39065747": {"recommendationid": "39065747", "author": {"steamid": "76561198077432213", "num_games_owned": 1643, "num_reviews": 335, "playtime_forever": 49, "playtime_last_two_weeks": 43, "last_played": 1515937212}, "language": "russian", "review": "Это монополист! Игра сделана на отлично и аналогов ей пока ещё не видел.", "timestamp_created": 1515106872, "timestamp_updated": 1515106872, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39064790": {"recommendationid": "39064790", "author": {"steamid": "76561197988767969", "num_games_owned": 41, "num_reviews": 2, "playtime_forever": 190, "playtime_last_two_weeks": 40, "last_played": 1516296216}, "language": "english", "review": "Amazing game! This is what I always dreamed of when playing flight games years ago. The flight controls work surprisingly well.\nIt manages to be both fun and challenging at the same time.", "timestamp_created": 1515104547, "timestamp_updated": 1515104547, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39001658": {"recommendationid": "39001658", "author": {"steamid": "76561197989720335", "num_games_owned": 81, "num_reviews": 2, "playtime_forever": 774, "playtime_last_two_weeks": 311, "last_played": 1515812173}, "language": "english", "review": "Great game but a few bugs have stopped my progress. My achievements don't always register and the first balloon mission begins with me on the ground (not the runway) and no fuel.  I've tried re-flying entire levels but keep running into the same problems in the same places.", "timestamp_created": 1514962757, "timestamp_updated": 1514962757, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38991045": {"recommendationid": "38991045", "author": {"steamid": "76561197973389596", "num_games_owned": 321, "num_reviews": 34, "playtime_forever": 110, "playtime_last_two_weeks": 0, "last_played": 1514932070}, "language": "english", "review": "This game, in its current state, can not be recommended to Vive users at all. You'll end up with some serious tendonitis if you play long enough. \nThe control scheme is purely setup for the oculus touch controllers, which results in an incredibly painfgull and frustrating user experience.\nYou have to continuously press the trigger of your Vive controller to hold on to the yoke. That  seems okay, until you fly for more than 5mn, basically death-gripping your controller while it vibrates nastily in a random fashion. As the orientation of the *VIVE* controller is not natural for a plane joystick and due to the fact that you are holding \"air\" you will end up contorting your wrist in some hideous and painfull ways whilst  moving your chair backward in order to be able to pull the joystick somehow.\nAdd to that the fact that the developer, in his wisdom, decided to ignore analog inputs for the rudder (at least on the Vive controllers ... I guess the mini joystick on the touch works analoguously in this game), which means that controlling the yaw of the aircraft requires you to press the left or right side of your touchpad to apply *always full* rudder.\n\nAnother (very big) publisher got flak from Oculus owners because their game was advertised as \"Vive Only\", not because it wouldn't work on an Oculus CV1 but because the controls were designed for the Vive Controller. I'd suggest the publisher of Ultrawings does the same and removes the Vive from the supported devices, until Vive owners can actually play this game in a correct fashion.\n", "timestamp_created": 1514932939, "timestamp_updated": 1514932939, "voted_up": false, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.567530", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "timestamp_dev_responded": 1514939003, "developer_response": "Two things:\n\n1) We are implementing toggle grab in the next patch.  \n\n2) Rudder percentage scales based on where you push your thumb on the trackpad."}, "38942673": {"recommendationid": "38942673", "author": {"steamid": "76561198176808819", "num_games_owned": 119, "num_reviews": 1, "playtime_forever": 269, "playtime_last_two_weeks": 0, "last_played": 1514824035}, "language": "english", "review": "Great game to get into flight sims.  I don't have a joystick but the Oculus touch controls work really well and makes it very immersive.  The only con is the number of aircraft that are available.  I believe there are only four available at this time.", "timestamp_created": 1514825846, "timestamp_updated": 1514825846, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38933736": {"recommendationid": "38933736", "author": {"steamid": "76561197970367263", "num_games_owned": 242, "num_reviews": 1, "playtime_forever": 359, "playtime_last_two_weeks": 0, "last_played": 1514914666}, "language": "english", "review": "Fun Game and Cant wait for more", "timestamp_created": 1514808594, "timestamp_updated": 1514808594, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38927524": {"recommendationid": "38927524", "author": {"steamid": "76561198036861219", "num_games_owned": 592, "num_reviews": 3, "playtime_forever": 94, "playtime_last_two_weeks": 0, "last_played": 1514097804}, "language": "english", "review": "So, I've always wanted to fly... this is as close I'm going to get with out emptying my pockets. Flight mechanics are almost exact compaired to full scale airplanes. It's fun and anyone can learn to play it.\nPros:\nClean graphics \nSimple but scale and realistic controls\nVive controllers work really well\n\n\n\nCons:\nNot much in the way of scenery\nSo far not much else.\n\nI got this game during the holiday sale half off but it's more than worth full price in my opinion. Weather you've always wanted to try scale flying or looking for a great simulator or just something to try it's amazing and fun.", "timestamp_created": 1514792301, "timestamp_updated": 1514792301, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38915500": {"recommendationid": "38915500", "author": {"steamid": "76561197989847571", "num_games_owned": 161, "num_reviews": 4, "playtime_forever": 52, "playtime_last_two_weeks": 0, "last_played": 1514755848}, "language": "english", "review": "I like this game, simple but lot of fun.\nIt is really user friendly and will need about 5-10min to know the controls so you will no need to activate 50 bouttons to fly.", "timestamp_created": 1514756164, "timestamp_updated": 1514756164, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38907237": {"recommendationid": "38907237", "author": {"steamid": "76561197970573134", "num_games_owned": 1542, "num_reviews": 34, "playtime_forever": 60, "playtime_last_two_weeks": 34, "last_played": 1515443565}, "language": "german", "review": "Auch von mir ein Daumen nach oben, sehr gutes VR Game, gehört in jede VR Sammlung.\n\nJeder der Spass am Fliegen hat, sollte zuschlagen.", "timestamp_created": 1514738163, "timestamp_updated": 1514748007, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.636807", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38875225": {"recommendationid": "38875225", "author": {"steamid": "76561197990438033", "num_games_owned": 121, "num_reviews": 3, "playtime_forever": 288, "playtime_last_two_weeks": 0, "last_played": 1514664605}, "language": "german", "review": "Wer Pilotwings auf dem N64 geliebt hat, wird mit diesen Spiel rundum begeistert sein.\n\nDIe VR-Umsetzung ist brilliant.\n", "timestamp_created": 1514666157, "timestamp_updated": 1514666157, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38855851": {"recommendationid": "38855851", "author": {"steamid": "76561198018265006", "num_games_owned": 25, "num_reviews": 7, "playtime_forever": 42, "playtime_last_two_weeks": 0, "last_played": 1513962574}, "language": "italian", "review": "Bellissimo titolo i comandi sono ben implementati e precisi,rende molto bene la sensazione di volo ricorda titoli simili usciti in passato primo fra tutti Pilotwing ma stavolta ii all interno del veicolo grazie alla VR.", "timestamp_created": 1514632640, "timestamp_updated": 1514632640, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38849956": {"recommendationid": "38849956", "author": {"steamid": "76561198024270997", "num_games_owned": 353, "num_reviews": 108, "playtime_forever": 262, "playtime_last_two_weeks": 0, "last_played": 1514781761}, "language": "english", "review": "Very fun ! It's like play a Nintendo game in VR !", "timestamp_created": 1514619147, "timestamp_updated": 1514619147, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502058", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38822031": {"recommendationid": "38822031", "author": {"steamid": "76561198005206359", "num_games_owned": 229, "num_reviews": 3, "playtime_forever": 71, "playtime_last_two_weeks": 0, "last_played": 1514475607}, "language": "french", "review": "Très immersif et fun. L'un des meilleurs jeux VR que j'ai essayé. Il manquerait juste un peu de contenu.", "timestamp_created": 1514560334, "timestamp_updated": 1514560334, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38807439": {"recommendationid": "38807439", "author": {"steamid": "76561198045315281", "num_games_owned": 177, "num_reviews": 1, "playtime_forever": 117, "playtime_last_two_weeks": 3, "last_played": 1516290988}, "language": "english", "review": "Steam currently says I only have 1.3 hours, but I have closer to 8. I'm loving this game so far, very reminiscent of Wii Sports Resort (which is based off Pilot Wings 64). Flying is very fun, no nausia or acrophobia. The progression is very fun and satisfying, though it can be harsh at points. You get money from completing 2-5 minute missions, and you get medal for you performance. Roughly, Gold = Perfect, Silver = 99-75%, Bronze 74-0%. Just missing gold and getting silver means reciving 50% less pay, which can be very frustrating to just miss that last ring and get $3000 instead of $6000.  \n  \nAlso, while I do love this game, I wish there was more islands to explore and more planes to unlock. One of the most fun part of Wii Sport Resorts flying was the amount of exploration, paths to follow that had meaning-full ends. This game lacks this. There needs to be more reward for exploration, wether it be through money or through interesting points. This could be partially becuase Nintendo made the island for more than just flying, but honestly I wouldn't mind this dev making a full on Wii Sports Resort ispired game for VR, I'd pay $30-$40 for that.  \n  \nOverall I love this game and would reccomend this to anyone with VR. Devs, please make more content or a sequel!", "timestamp_created": 1514526303, "timestamp_updated": 1514526303, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38807427": {"recommendationid": "38807427", "author": {"steamid": "76561198047276573", "num_games_owned": 404, "num_reviews": 93, "playtime_forever": 35, "playtime_last_two_weeks": 0, "last_played": 1514913287}, "language": "english", "review": "yes", "timestamp_created": 1514526277, "timestamp_updated": 1514526277, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38792668": {"recommendationid": "38792668", "author": {"steamid": "76561197996495504", "num_games_owned": 140, "num_reviews": 12, "playtime_forever": 1148, "playtime_last_two_weeks": 0, "last_played": 1515120899}, "language": "english", "review": "Simple, challenging, and fun. A great VR flight game. Highly recommend this one!", "timestamp_created": 1514490926, "timestamp_updated": 1514490926, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38745651": {"recommendationid": "38745651", "author": {"steamid": "76561198035986909", "num_games_owned": 110, "num_reviews": 6, "playtime_forever": 195, "playtime_last_two_weeks": 0, "last_played": 1514561985}, "language": "english", "review": "Got this game while it is on sale (50% off) and really enjoy it.\n\nPlayed 1.4 hours so far and I still have a lot of things to do.\n\nIf you're interested in flying at all I would recommend this game.", "timestamp_created": 1514394465, "timestamp_updated": 1514394465, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38705079": {"recommendationid": "38705079", "author": {"steamid": "76561197981601314", "num_games_owned": 355, "num_reviews": 6, "playtime_forever": 190, "playtime_last_two_weeks": 0, "last_played": 1515174469}, "language": "french", "review": "Il s'agit de l'un des premiers jeux VR que j'achète sur Steam.\nEt par rapport aux autres, ça fait du bien d'avoir une bonne reconnaissance des touchs de l'Oculus Rift.\n\nLe jeu est plaisant et agréable à parcourir, le rendu n'est clairement pas réaliste mais le style \"low poly\" donne un coté très mignon au titre.\n\nLe principe est simple, réaliser des missions à bord de plusieurs petits avions, missions assez diversifiées dans l'ensemble avec des courses ou il faut passer dans des cible, prendre des photos, éclater des ballons.\nLe jeu est à faire par petites sessions pour éviter de se lasser et surtout de le finir trop vite.", "timestamp_created": 1514309754, "timestamp_updated": 1514309754, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38701446": {"recommendationid": "38701446", "author": {"steamid": "76561198051811313", "num_games_owned": 103, "num_reviews": 1, "playtime_forever": 224, "playtime_last_two_weeks": 0, "last_played": 1514340045}, "language": "english", "review": "I think this game is absolutely brilliant. I found that most vr games atm are either extremely expensive or just very phisically demanding to be played casually, but this is neither. It's just a really relaxing game with a very nice balance of lots of factors:\n- clean, light and pleasant graphics\n- fun and engaging activities to do on yout aircraft\n- really fun flying experience in said aircrafts\n- just the right amount of gaming content for just about the right price-tag (IMO no reason to make a game like this into a 40hrs experience or something like that...)\n- bonus: I think it's a great game to be shared with casual and non-gamers\n\nKudos to the developers.", "timestamp_created": 1514303138, "timestamp_updated": 1514303186, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.525547", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38698106": {"recommendationid": "38698106", "author": {"steamid": "76561198050251717", "num_games_owned": 72, "num_reviews": 12, "playtime_forever": 203, "playtime_last_two_weeks": 25, "last_played": 1515666082}, "language": "english", "review": "Pros: \n- Nice flight model, i prefer simulation mode personally but that's subjective. \n- some really fun missions in particular the ultra light shooting levels. \n- graphics are both pro and con. In the pro, they are simple clean and as a result easy on the computer system so fps is  not an issus at all. \n- the overall sense of flight is great, and if you remember pilotwings on the N64 then this is that but you are in the cockpit!!!\n- Controls are fun, oculus touch of vive controllers are a MUST for this. Don't buy it if you don't have them. \n- Overall an outstanding game highly recommended. \n\nCons\n- missions are incredibly repetative and as a result i suspect replay value is not great. add to that progressin becomes a bit grindy but it's nothing compared to other games. \n- If you are prone to motion sickness (simulator sickness) then this one is gonna make you hurl. I am not luckily but even i had some moments where i didn't feel 100% \n- Graphics, well just too simple, tho as previously mentioned in pros it helps a lot with a smooth experience so it's a trade off there. \n- Lifeless world. the world is dead and lifeless and it's a real shame. \n- The mission design should have had way more of the shooting stuff and way less of the repetative mundane flight through a circle and land type stuff, also the landing missions are just bad. simple as that. bad and annoying. \n- if you plan to use a controller prepare yourself for shockingly bad dead zones so touch and vice motion controllers are highly recommended. \n\n100% worth buying despite the cons' the pros totally outweigh them and make for a great VR experience.", "timestamp_created": 1514297768, "timestamp_updated": 1514297910, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.574607", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38678891": {"recommendationid": "38678891", "author": {"steamid": "76561198072355407", "num_games_owned": 26, "num_reviews": 1, "playtime_forever": 183, "playtime_last_two_weeks": 0, "last_played": 1514250290}, "language": "brazilian", "review": "Amazing flying sensation.\nShooting phases are awesome.\nPhoto ones are too hard.\nHope to find games like this with more realistic graphics on the future.\nWoth buying it.", "timestamp_created": 1514250440, "timestamp_updated": 1514250440, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38667403": {"recommendationid": "38667403", "author": {"steamid": "76561197996178362", "num_games_owned": 421, "num_reviews": 4, "playtime_forever": 339, "playtime_last_two_weeks": 0, "last_played": 1514741342}, "language": "english", "review": "ok lets start off with the cons\n1/ theres 3 planes\n\nyup thats it for cons heres the pros\n1/ first motion control game I've played and like 2 hours passed where I havent felt sick\n2/ you know when you play games like GTAV you get a plane and just wanna see what nose diving it into the ground would do... yea this game scares you out of it you literally feel like your falling so you pull out last second. \n3/ remember 2? well after you pull out last second keep pulling cause once you make your first loop your response is \"OH MY GOD THIS IS AMAZING\"\n4/ After you messed around in freeflight for about 10-15 minutes (yes 2 and 3 were me in freeflight) you realise your first plane is a bit slow and you cant cover enough ground in it because the fuel runs slow so you go earn your license for the thing.\n5/ earning money is very generous after you've earned like 4-5 gold medals by flying through rings, landing the plane and just staying in the air for a minute or 2 you've earned enough money to get your first airport the next island over opening you up to more missions and an idea on where to go next.\n\nhonestly at this point I am just getting the paraglider \"with experimental rocket technology yes the game teases with that\" seriously the moment you press ignition your like \"OH MY GOD OH MY GOD\", I havent played in simulation mode yet just arcade (I assume it means landings much nicer in arcade cause I dont think I could land half the stuff I've landed already).\n\nnow I will suggest a few things that could be fixed or changed\n1/ using the phone camera can sometimes just freak out and show alot of graphical issues on the camera itself like I can see an island perfectly but the cameras like \"naw dude thats a blue scale cube and triangle freaking its shit out trying to escape your phone\" thats really annoying when you want to take cool pictures\n2/ 3 planes? I know I only got the second plane just now but this can be fixed with either more planes update or allowing for mod support could fix this\n*3/ I would say multiplayer for this would be amazing I mean we already see games in vr with multiplayer thats reached a respectable or meme status \"looking at you vr chat\" so flying around with say 11 other people with people crashing into each other, completling objectives or just doing cool things in general would be great.\n\n*I am aware that multiplayer has been discussed and will be likely in the sequel to which all I can say is \"wow this games reached a big enough following to warrant a sequel that is amazing\"", "timestamp_created": 1514225851, "timestamp_updated": 1514225851, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38660732": {"recommendationid": "38660732", "author": {"steamid": "76561198005772688", "num_games_owned": 323, "num_reviews": 69, "playtime_forever": 21, "playtime_last_two_weeks": 0, "last_played": 1514212436}, "language": "english", "review": "Was exactly as I was hoping it would be; Pilotwings 64 within VR. Really enjoyed it so far!!", "timestamp_created": 1514213549, "timestamp_updated": 1514213549, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38634272": {"recommendationid": "38634272", "author": {"steamid": "76561197978829443", "num_games_owned": 852, "num_reviews": 26, "playtime_forever": 74, "playtime_last_two_weeks": 0, "last_played": 1514092344}, "language": "english", "review": "\"Pilotwings in VR\" is, honestly, pretty apt.\n\nThe game has arcade and simulation control modes. I haven't tried the arcade mode, but the simulation mechanics feel just about right -- not realistic, not trivial, plausible fantasy, and not too challenging.\n\nIt's like junk food that makes you feel good. There's a lot of progression-based content, and I can see this being a game to return to and relax with.\n\nIt's also a game you can feel the love in.\n\nIf you like the video, try it.", "timestamp_created": 1514144831, "timestamp_updated": 1514144831, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38632210": {"recommendationid": "38632210", "author": {"steamid": "76561198082601768", "num_games_owned": 1419, "num_reviews": 28, "playtime_forever": 50, "playtime_last_two_weeks": 0, "last_played": 1514229176}, "language": "english", "review": "Pilotwings in VR.\n\nAfter 22 minutes of playtime on my HTC Vive, I went and purchased this for my Gear VR as well. \n\nBecause I want this game in as many places as possible.\n\n", "timestamp_created": 1514140651, "timestamp_updated": 1514140651, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38626640": {"recommendationid": "38626640", "author": {"steamid": "76561198253328598", "num_games_owned": 211, "num_reviews": 25, "playtime_forever": 111, "playtime_last_two_weeks": 0, "last_played": 1514142805}, "language": "english", "review": "Only an hour in but man o man, honestly just the depth of flying sells it for me. being able to look down and see the actual distance from the water is insane. Also I hopped out of my chair and walked around while i was still flying the plane and it was really fun yet trippy. great game", "timestamp_created": 1514129927, "timestamp_updated": 1514129927, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38547685": {"recommendationid": "38547685", "author": {"steamid": "76561198066621031", "num_games_owned": 136, "num_reviews": 8, "playtime_forever": 82, "playtime_last_two_weeks": 0, "last_played": 1514271684}, "language": "schinese", "review": "买", "timestamp_created": 1513972610, "timestamp_updated": 1513972610, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38383399": {"recommendationid": "38383399", "author": {"steamid": "76561198344466017", "num_games_owned": 16, "num_reviews": 1, "playtime_forever": 410, "playtime_last_two_weeks": 67, "last_played": 1515851814}, "language": "french", "review": "Trés bonne sensation de vol en toute simplicité.\nPetit jeu très agréable", "timestamp_created": 1513536069, "timestamp_updated": 1513536069, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38162218": {"recommendationid": "38162218", "author": {"steamid": "76561198283464948", "num_games_owned": 29, "num_reviews": 1, "playtime_forever": 118, "playtime_last_two_weeks": 0, "last_played": 1514992786}, "language": "italian", "review": "non esiste un manuale on line per la configuraziopne del game pad xbox 360 e per altre eventuali informazioni???????\n", "timestamp_created": 1512765674, "timestamp_updated": 1512765674, "voted_up": false, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.477915", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "timestamp_dev_responded": 1512767722, "developer_response": "Just connect your controller to your PC and it should just work.  There is a controller instruction card in the office that shows you the controls."}, "38141112": {"recommendationid": "38141112", "author": {"steamid": "76561198171435438", "num_games_owned": 28, "num_reviews": 2, "playtime_forever": 130, "playtime_last_two_weeks": 0, "last_played": 1512907185}, "language": "english", "review": "Pure fun! I love everything related to flying and this simulator is very enjoyable game, The rough graphics doesn't take much from the pleasure of microlight flight. Make sure to set up the game to simulation mode - arcade is slightly too easy.", "timestamp_created": 1512691764, "timestamp_updated": 1512691764, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38086902": {"recommendationid": "38086902", "author": {"steamid": "76561197960423919", "num_games_owned": 174, "num_reviews": 1, "playtime_forever": 585, "playtime_last_two_weeks": 0, "last_played": 1512500483}, "language": "english", "review": "If you like flight sims and/or PilotWings this is a great little game. Great sensation of flying, and the rocket glider in particular is a hoot to pilot. It is very nearly a *perfect* game but just misses the mark due to a few little issues (need some sort of feedback/warning when your hand comes off the handle, instruments can't be seen unless sunlight is directly on them, occasional glitch with a few mission or two, etc). and the fact that it can be beaten 100% in 10-15 hours easily with not much replayability beyond that. It really needed one more aircraft or island (location) to really bring tremendous value, but regardless I would still definitely recommend this game. 4.5 of 5 stars", "timestamp_created": 1512501465, "timestamp_updated": 1512501465, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.514955", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38072015": {"recommendationid": "38072015", "author": {"steamid": "76561197978266558", "num_games_owned": 1465, "num_reviews": 231, "playtime_forever": 366, "playtime_last_two_weeks": 0, "last_played": 1507086706}, "language": "english", "review": "This is sort of a 'Pilot Wings for VR'. Not ultra-realistic, simple to play, and fun short challenges (fly through rings, land on a bullseye, take aerial photos, etc.). Each mission earns you money which can be spent to unlock new islands and planes. All the plane types handle intuitively, but very different from each other. The cockpit controls are colorful and built for comfort while holding tracked controllers.\n\nThe music and whole vibe of the game is very upbeat, but can feel repetitive after a while. Your radio operators play sort of a good cop, sarcastic cop role. They're voice well and add a rewarding layer of feedback to the game. You need a slightly strong stomach for while things get out of control, but the game provide nice comfort options that may help such as blacking out cockpit windows in your peripheral vision.", "timestamp_created": 1512449314, "timestamp_updated": 1512449314, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "38044619": {"recommendationid": "38044619", "author": {"steamid": "76561197961321000", "num_games_owned": 316, "num_reviews": 3, "playtime_forever": 260, "playtime_last_two_weeks": 0, "last_played": 1515039821}, "language": "english", "review": "I have actually had way more fun with this game that I thought I would. I originally bought it thinking it would be cool just to fly around a bit, but the challenges that you can do are a blast!  I always catch myself saying \"just one more try!\"  I highly recommend this!!!", "timestamp_created": 1512339193, "timestamp_updated": 1512339259, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37991046": {"recommendationid": "37991046", "author": {"steamid": "76561197986662298", "num_games_owned": 169, "num_reviews": 3, "playtime_forever": 179, "playtime_last_two_weeks": 0, "last_played": 1512610222}, "language": "english", "review": "Lots of fun and with the latest patch it works great on Windows MR.  Definitely recommended!", "timestamp_created": 1512179977, "timestamp_updated": 1512179977, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502262", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37976994": {"recommendationid": "37976994", "author": {"steamid": "76561198030621877", "num_games_owned": 85, "num_reviews": 1, "playtime_forever": 507, "playtime_last_two_weeks": 0, "last_played": 1512953710}, "language": "brazilian", "review": "Jogo muito legal!\nRealmente até o momento melhor jogo de vôo de VR.\nVale a pena!\n", "timestamp_created": 1512136837, "timestamp_updated": 1512136837, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.525862", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37921936": {"recommendationid": "37921936", "author": {"steamid": "76561198027929871", "num_games_owned": 325, "num_reviews": 5, "playtime_forever": 29, "playtime_last_two_weeks": 0, "last_played": 1514957806}, "language": "english", "review": "My play time is not accurate, i have probably close to 4-5 hours and just purchased the stunt plane, but I have really enjoyed the game so far. The music and some of the engine noises are a bit repetitive, but the gameplay is solid and I haven't seen any other VR games that let me fly around  in such a chill enviroment. Would love to some some small helicopters, wingsuits, or paragliding added to the game as dlc or expansion, but base is certainly worth the price of admission.", "timestamp_created": 1511941209, "timestamp_updated": 1511941209, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37863843": {"recommendationid": "37863843", "author": {"steamid": "76561198132845068", "num_games_owned": 470, "num_reviews": 88, "playtime_forever": 69, "playtime_last_two_weeks": 0, "last_played": 1513654505}, "language": "schinese", "review": "好玩是好玩，不过时间稍微一长就恶心。", "timestamp_created": 1511859962, "timestamp_updated": 1511859962, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37583863": {"recommendationid": "37583863", "author": {"steamid": "76561198035960288", "num_games_owned": 117, "num_reviews": 8, "playtime_forever": 323, "playtime_last_two_weeks": 0, "last_played": 1511855142}, "language": "english", "review": "Ultrawings is a great flying sim for people who fly for the sake of flying. Enviroments are stylized in a simplistic cartoony way making the game not only easy to look at but also easy on your hardware. \n  Its controls are intuitive and have a decent level of realism allowing you to adjust the throttle, raise or lower the flaps and move the rudder to the left or right using the touchpad, on top of banking and adjusting the pitch using the yoke. \n  If you're worried about getting motion sickness, the game has multiple comfort levels to choose from which have been implemented quite well. There is also the option to play in either arcade or simulator mode, arcade being easier to control and more bearable for those who may get nauseous while simulator mode makes the plane react much more realistically while banking and using the rudder.\n As far as content goes you start on a small island with an ultralight and have to earn money by comleting a variety of challenges to be able to purchase new islands and new aircraft. The challenges seem interesting, but nothing too exciting as of yet so in my opinion this game is more for the casual flyer. \n  My only gripe would be the lack of input support, I don't mind using the vive controllers for most of the controls, but I'd love to hook up some pedals since it can get a little awkward using the touchpad while trying to steer. \n  All around I love the game and would love to see it get some new content, a mutliplayer mode would be an amazing addition whether that be racing through rings or dare I say it, a dogfight mode ;)", "timestamp_created": 1511643983, "timestamp_updated": 1511644582, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.547038", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37061649": {"recommendationid": "37061649", "author": {"steamid": "76561197998242775", "num_games_owned": 759, "num_reviews": 12, "playtime_forever": 514, "playtime_last_two_weeks": 0, "last_played": 1514038683}, "language": "japanese", "review": "良い点：\nVTOL VRより手軽に飛行機操縦感が味わえる\n３種類の飛行機とそれぞれに幾つかのカテゴリに分かれたミッションがあるため、\nボリュームは10時間程度はありそう。\n\n悪い点：\nハンドガンの銃撃は楽しいが、操作に難有り\n着陸ミッションの評価が綺麗に着陸するのではなく、\nど真ん中に頭から突っ込むのが推奨されるため、飛行機ゲーとしてはいかがなものか\n\n\n今後に期待：\n海に点在する島が舞台なので、基本的にスケールが狭く、\n景色のほとんどが海なのがもったいない\nDLCか続編で雪山やトンネル潜りなどのシチュエーションが増えてほしい", "timestamp_created": 1511443503, "timestamp_updated": 1511443503, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.581749", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36385667": {"recommendationid": "36385667", "author": {"steamid": "76561198030519086", "num_games_owned": 731, "num_reviews": 63, "playtime_forever": 175, "playtime_last_two_weeks": 0, "last_played": 1511707284}, "language": "english", "review": "Brilliant title - a real feeling of freedom as i'm buzzing around the skies and pulling off stupid stunts - simple controls and i'm all the more thankful for it - in no time I was wizzing through the startup process like a pro :D  And as everyone has said totally hits that Pilotwings itch!  Comfort options really help for my friends who suffer slightly more from Simulation Sickness than I do - hits all the marks.  I wish there was more Islands added, just because the game is so good I want mooooore, but even as is its a superb title.", "timestamp_created": 1510184816, "timestamp_updated": 1510184816, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36306599": {"recommendationid": "36306599", "author": {"steamid": "76561197965385329", "num_games_owned": 590, "num_reviews": 8, "playtime_forever": 102, "playtime_last_two_weeks": 0, "last_played": 1510163927}, "language": "german", "review": "Auch von mir ein Daumen nach oben, sehr geiles VR, gehört in jeder VR Sammlung.", "timestamp_created": 1509910153, "timestamp_updated": 1509910153, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35963495": {"recommendationid": "35963495", "author": {"steamid": "76561198048300961", "num_games_owned": 50, "num_reviews": 54, "playtime_forever": 21, "playtime_last_two_weeks": 0, "last_played": 1508837206}, "language": "english", "review": "good flight Simulator", "timestamp_created": 1508840436, "timestamp_updated": 1508840436, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35939947": {"recommendationid": "35939947", "author": {"steamid": "76561198130202824", "num_games_owned": 131, "num_reviews": 13, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1508743847}, "language": "english", "review": "I really enjoy this game. I have less that an hour so perhaps it will get redundant at some future point, but right now the controls feel very intuitive and looking around 360 degrees as still exciting.\nThe architecture is a bit boxy which I’m fine with since we’re still early in the VR process. So far I’m finding it a lot of fun.", "timestamp_created": 1508745684, "timestamp_updated": 1508745684, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35935724": {"recommendationid": "35935724", "author": {"steamid": "76561198020353001", "num_games_owned": 62, "num_reviews": 12, "playtime_forever": 1560, "playtime_last_two_weeks": 0, "last_played": 1509316968}, "language": "english", "review": "Lots of fun, feels like flying a real plane! Would recommend to anybody that enjoys driving things.", "timestamp_created": 1508724480, "timestamp_updated": 1508724480, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35932199": {"recommendationid": "35932199", "author": {"steamid": "76561197998882336", "num_games_owned": 257, "num_reviews": 15, "playtime_forever": 151, "playtime_last_two_weeks": 0, "last_played": 1512341652}, "language": "english", "review": "This is a fun, low-poly flying game. It's not as complicated or as detailed a full-blown flight simulator, but instead it focuses on the fun of flying in an island paradise.\n\nIf you're looking for something to fill out your staple of non-combat VR games, this is a good family-friendly choice.", "timestamp_created": 1508708565, "timestamp_updated": 1508708565, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35916150": {"recommendationid": "35916150", "author": {"steamid": "76561197994264763", "num_games_owned": 42, "num_reviews": 2, "playtime_forever": 1886, "playtime_last_two_weeks": 0, "last_played": 1512861595}, "language": "italian", "review": "Se volete rilassarvi, provare un senso di libertà... con tanto di missioni da realizzare.. eccolo!  Bellissimo gioco, strumentazione a bordo, sole, vento e tanto altro... Divertente..!", "timestamp_created": 1508667097, "timestamp_updated": 1508667097, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35853866": {"recommendationid": "35853866", "author": {"steamid": "76561197990404202", "num_games_owned": 197, "num_reviews": 12, "playtime_forever": 26, "playtime_last_two_weeks": 0, "last_played": 1514431956}, "language": "english", "review": "Ok Ultrawings gets the esscense of flighting correct. They kept the visual fidelity cartoony so everything runs fast and is smooth. The environment and planes are consistent and the menu is perfect for what you are trying to accomplish. \n\nI would like to see more planes and maybe more stages in an update. But I like what I have so far. I have a bit of time logged, and it's definitely the thing I have played the most as of recent. \n\n", "timestamp_created": 1508465700, "timestamp_updated": 1508465700, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35729505": {"recommendationid": "35729505", "author": {"steamid": "76561198164246672", "num_games_owned": 64, "num_reviews": 3, "playtime_forever": 21, "playtime_last_two_weeks": 0, "last_played": 1501561725}, "language": "english", "review": "One of the first games I bought once I got the Rift.  Overall I like the game and the feel and the graphics work for a fun flight game.  Its a good game to show off what the Rift can do with immersion.", "timestamp_created": 1508015244, "timestamp_updated": 1508015244, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523622", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35721735": {"recommendationid": "35721735", "author": {"steamid": "76561197970542682", "num_games_owned": 422, "num_reviews": 38, "playtime_forever": 673, "playtime_last_two_weeks": 0, "last_played": 1508672414}, "language": "french", "review": "c'est pas bien compliquer!!! c'est le meilleur jeux VR a ce jour pour moi!\n\nles activitées sont assez nombreuses et on se prend bien au jeux des missions pour amasser du pognon et le depenser!\nles sensations sont absolument exellentes,l'altitude est vraiment bien representer et la maniabilitée geniale,le rendu graphique est peut etre simple mais est superbe!\n\nplein de petites animation donne vie a l'environnement (bateaux,divers avion,animaux,voiture,etc)\nles sons aussi sont convaincant!\nvoila ce que j'appelle UN JEUX car on s'amuse,c'est exaltant sans prise de tete,JE PRECISE que je suis tres tres tres DIFFICILE sur les jeux VR car je trouve que 99% des jeux sont des daube sans nom!\nrare sont les jeux VR que j'aprecie!", "timestamp_created": 1507995481, "timestamp_updated": 1507995481, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.547325", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35629409": {"recommendationid": "35629409", "author": {"steamid": "76561197967111467", "num_games_owned": 109, "num_reviews": 1, "playtime_forever": 219, "playtime_last_two_weeks": 0, "last_played": 1509029507}, "language": "english", "review": "if u liked pilotwings 64: get it!\nits a really cool game. it looks nice and it flys great.\nvery enjoyable", "timestamp_created": 1507685643, "timestamp_updated": 1507685643, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.627828", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35586305": {"recommendationid": "35586305", "author": {"steamid": "76561198106962215", "num_games_owned": 153, "num_reviews": 5, "playtime_forever": 586, "playtime_last_two_weeks": 0, "last_played": 1507678923}, "language": "english", "review": "I just landed an ultralight on the deck of a small yacht. 10 out of 10, would crash a millionaire's party again.\n\nThis is another game in a long line I've seen that are a weird combination of arcadey style video game, and real world physics simulation (kinda like KSP, for example). The game's atmosphere is relaxing, and has an in depth and colorful cartoony world to explore. There are 3 different aircraft to choose from, and a number of islands with different geographies. The game consists of a decent difficulty curve, a simple economic and progression system, and dozens of challenges, from the relaxing to the hair raising.\n\nIf you are interested in learning how to fly, but know LITERALLY NOTHING about flight, then pick up this game. Despite its arcadey feel, the flight models of the 3 aircraft are surprisingly realistic... There are 2 flight models; \"Arcade\", and \"Simulator\"... I highly recommend that, regardless of how new you are to flight, that you switch it to simulator immediately. You can learn actual basic flying skills from this game, but you'll only pick those skills up if you start off with the simulator flight model right off the bat. The arcade one will only teach you bad habits... Also, the simulator model lets you push the plane closer to its limits, meaning you're more likely to get better scores on the challenges if you master it.\n\nThe flight models feel right. The ultralight, even right down to a tendency to side slip, the glider feels like a glider, soaring on practically nothing for quite a while, and the sports plane feels like a sports plane... Twitchy as all hell, and prone to stalling and flat spins.\n\nEach one teaches you new skills. The ultralight is an introduction to basic flight, and is so easy to fly, you're have to TRY to crash it. The glider teaches extreme power and speed management (it's rocket powered, but only fires in bursts, and has extremely little fuel) as well as unpowered landings, and the sports plane teaches the importance of fine controls, and feeling a stall before it occurs.\n\nI'd honestly probably use this game as a teaching tool before moving someone on to more realistic flight sims like Microsoft X. The great advantage of this game is that it was built from the ground up for use with VR, while flight sims like X-Plane and Microsoft X only have VERY clunky and glitchy paid mods for VR support. There NEEDS to be a new training sim dedicated to VR, but until that sim comes, this is pretty much the closest (besides DCS and WT, but those are combat games).\n\nThe 8 hours I spent was a joy, and I plan on palying much more of it... That being said, it is not a perfect game. This is where my criticisms come in.\n\nFirstly, this game only relies on touch controls for controlling the aircraft. I found a post on here of one of the devs stating that they weren't going to introduce joystick and hotas support because it would be a UI nightmare. I can see where they're coming from, but honestly, it's a NECESSITY. Yes, it's a UI nightmare for you, but if you take on the challenge of coding that, it saves the PLAYER of the nightmare of trying to control an aircraft with touch controllers.\n\nI've seen this problem in the Microsoft X paid VR mod as well. Sure, the idea of using touch controllers to grab a virtual yoke, and interact with the cockpit sounds nice IN THEORY, but it rarely works out, and instead usually just detracts from the experience. For myself, I had difficulty even grabbing the stick because my sensors can't see very well below keyboard level. And the complete and total lack of feeling an actual stick made it hard to fly by muscle memory. I'd be rotating the touch controller to the left, but instead the plane would roll right because my hand was on the right. It's hard to tell when you're even successfully grabbing the control stick because it's all VR... There's nothing there TO grab.\n\nThere is an alternative. You can simply resort to using the thumb sticks, as I did... Flying a plane with thumbsticks just isn't natural. It's why I hate flying in console games. In fact, using the left thumb stick is actually required in this game, as it's the only way to control yaw. And these thumbsticks have a very large deadzone as well, making the planes twitchy to fly this way... This isn't a problem for the glider or ultralight as they're pretty chill, but it became a BIG problem when I first started flying the sports plane. That thing is twitchy enough as it is. With it, I NEED the sensitivity that the big deadzone takes away from me... Not that thumbsticks are very sensitive to begin with. Problems get worse when there are moments you're actually required to use the touch control scheme for certain things. You still need to physically grab the throttle, and you have to use the touch control on the stick to take pictures and fire at balloons in certain mission. So it becomes awkward switching back and forth from using thumbsticks to make a 180 turn, and then grabbing the stick for an attack run. I can't make my own key bindings, I can't change the stick sensitivity or deadzone... This isn't just stuff any flight sim would have, this is stuff most GAMES have. And don't get me wrong, I get it, VR UIs are REALLY hard to do compared to the normal UIs you see in video games. But it's NEEDED. Touch controllers are in their infancy. This is the first generation that I know of that not only detect the location of your hands, but also what gesture they're making. It's amazing technology, it truly is... But it's inconsistent and clunky. Half the time the controller loses connection, and next thing you know, the plane rolls over and crashes. It's obnoxious to keep my finger pointed 24/7 to push the rocket button in the glider during a hair-raising, corner-cutting race, only to be distracted by the fact that the button isn't registering my movement, or because I keep accidently flicking the magneto switch when I go to push the button.\n\n... It's CLUNKY. When I crash, or fail a challenge, I want it to be because I am the one who failed... Not because my stupid Occulus controllers are practically prototypes. Touch controllers are nice, but they only work well in very specific circumstances, like in horror games, or those cheesy room scale games like job simulator... It simply doesn't work where vehicle controls are involved. For a racing VR game, I'd rather have pedals and a logitech steering wheel. For flight VR games, I'd rather have my logitech extreme 3D pro. These things offer me the real world tactile feedback I NEED to fly and drive well. Without them, the gameplay suddenly becomes frustrating.\n\nThis is all a major problem of VR in general, not just this game. That being said, there is one thing the devs of this game could do to alleviate this problem for their game in particular: introduce Hotas and joystick support, with remappable options... That would make this game literally 10 times better than it already is. It would make it a far more useful educational tool as well. And there's a very simple and easy way to avoid most of the \"UI nightmare\": Start the game in a launcher window. Make it so that the game's settings are only accessible through this really simple 2D launcher. Here, players can go through, set up their joystick or hotas the way they like, and then launch the game when they're ready. There. That solves most of the problem of implementing a key binding UI in a VR environment. I am litterally on my hands and knees begging you to add this right now. It would make the game far more accessible to the demographic most likely to buy this game: Flight sim buffs. Put in the effort now to implement better joystick and hotas support, and you'll be rewarded with sales.\n\nBesides that, most of the issues I take with the game are nit picks. Bugs that are obviously going to eventually get worked out (like my issue with the glider's nose wheel steering control being inverted for no apparent reason). See replies for more.", "timestamp_created": 1507511085, "timestamp_updated": 1507511085, "voted_up": true, "votes_up": 9, "votes_funny": 3, "weighted_vote_score": "0.600530", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35387972": {"recommendationid": "35387972", "author": {"steamid": "76561198073507135", "num_games_owned": 63, "num_reviews": 4, "playtime_forever": 181, "playtime_last_two_weeks": 0, "last_played": 1506823827}, "language": "english", "review": "Its cool, not worth 25 dollars. Maybe 10. Buy on sale", "timestamp_created": 1506874791, "timestamp_updated": 1506874791, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.479983", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35345666": {"recommendationid": "35345666", "author": {"steamid": "76561197971253824", "num_games_owned": 405, "num_reviews": 3, "playtime_forever": 305, "playtime_last_two_weeks": 0, "last_played": 1510508299}, "language": "english", "review": "Really enjoying this game! It's loads of fun, easy to get into and has decent flight mechanics. Glad it finally made the jump to Vive.\n\nAgree with other reviews that the option for joystick controls would be good to include; that said the current contol scheme with the Vive controllers works well and really engages you with the game.\n\nAlso completely agree that it brings up a Pilotwings vibe which is a really good thing (especially for any crusty 'back-in-the-day' SNES/N64 veterans, like me). Any chance Bit Planet could throw in a hang glider, a jet pack (think Omega agent clone) and a skydive?\n\nHighly recommended if you want a fun VR flight sim experience which is easy to jump into.", "timestamp_created": 1506789798, "timestamp_updated": 1506789798, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35040916": {"recommendationid": "35040916", "author": {"steamid": "76561197969452738", "num_games_owned": 262, "num_reviews": 23, "playtime_forever": 234, "playtime_last_two_weeks": 0, "last_played": 1505978317}, "language": "english", "review": "I just really love this game! I keep finding myself coming back to it! There are lots of different types of missions and locations to unlock as well different planes.\n\nI didn't pick this one up right away due to the price, but it really is worth it, even at full price. This is one of the few polished and content-rich games in out there and one of the only good flying games IMO.\n\nhttps://www.youtube.com/watch?v=QMHwAkl8Bdg\n\nAlso love the voice acting, the guy sounds a little like Tom Hanks!\n\nhttp://store.steampowered.com/app/639130/Ultrawings/", "timestamp_created": 1505721260, "timestamp_updated": 1505725555, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34987623": {"recommendationid": "34987623", "author": {"steamid": "76561197978695376", "num_games_owned": 180, "num_reviews": 35, "playtime_forever": 228, "playtime_last_two_weeks": 0, "last_played": 1506901990}, "language": "english", "review": "I think VR in general is a quicky expiring fad, but that said, ultrawings is a delight to play. I suggest you buy it because all the other \"games\" for your $800 peripheral are mediocre at best.", "timestamp_created": 1505536803, "timestamp_updated": 1505536803, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.255465", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34925906": {"recommendationid": "34925906", "author": {"steamid": "76561197993904628", "num_games_owned": 93, "num_reviews": 6, "playtime_forever": 442, "playtime_last_two_weeks": 0, "last_played": 1514437121}, "language": "english", "review": "Having a lot of fun in this one, I was worried about the motion sickness that I'm prone to but I adjusted pretty quickly after the first playing session and it's not a problem any more.  As others have said it's Pilot Wings VR basically, and I loved that game so this is right up my alley.  \n\nI feel the need to address some of the negative reviews.  One person complained about wanting to be able to use a HOTAS.  For those that have them I agree that would be a good feature to add.  But I don't feel limited by using the Vive controllers - it's actually pretty accurate and I feel it adds to the immersion.  Sometimes I have to recenter my location so the stick is not too far ahead, but once you do that you can rest your arm on your leg and it is comfortable.\n\nAnother said it doesn't have enough content.  Keep in mind at time of writing that person has ~0.4 hours of playtime.  I'm at 3 hours and it says I have beat ~17%.  Trying to get gold on each challenge could take a while.  Plenty of content.\n\nFinally the last complaint I read was that the difficulty curve was too high.  I didn't seem to have a problem - the first Ultralight plane is pretty forgiving to fly and the tutorial levels step you through the flight characteristics pretty well.  My 8 year old was able to figure it out.\n\nOverall this game is definitely a buy.", "timestamp_created": 1505331268, "timestamp_updated": 1505331268, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.542546", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34851454": {"recommendationid": "34851454", "author": {"steamid": "76561198042096768", "num_games_owned": 280, "num_reviews": 19, "playtime_forever": 72, "playtime_last_two_weeks": 0, "last_played": 1505010243}, "language": "english", "review": "If you feel like getting put down by VR Voices in your head. This is the game for you. Tho it is a great game -the joystick breaking every now and then. I just don't like geting talked down to. Also the gunplay needs some work.", "timestamp_created": 1505010518, "timestamp_updated": 1505010518, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34766957": {"recommendationid": "34766957", "author": {"steamid": "76561197980661061", "num_games_owned": 478, "num_reviews": 6, "playtime_forever": 453, "playtime_last_two_weeks": 0, "last_played": 1508157842}, "language": "english", "review": "pilotwings anyone? this gives me the same feelings i felt when i first tried n64", "timestamp_created": 1504657668, "timestamp_updated": 1504657668, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34717970": {"recommendationid": "34717970", "author": {"steamid": "76561198007223119", "num_games_owned": 190, "num_reviews": 15, "playtime_forever": 247, "playtime_last_two_weeks": 0, "last_played": 1511629118}, "language": "german", "review": "Hab jetzt gut über 50% durch und kann VR-Piloten das Game nur wärmstens empfehlen.\n\nDie Optik ist zwar einfach, aber sehr zweckmäßig. Die Vertonung ist exzellent und die Flugphysik glaubwürdig. Ein Highlight ist die Touchcontroller Unterstützung mit der man alle Schalter und Hebel bedienen kann. Es passiert zwar hin und wieder, dass man den Hebel aus der Hand verliert wenn man zu weit zieht oder drückt. Aber alles in allem ist die Touchsteuerung gut umgesetzt  und auch Gold Medaillen sind damit problemlos erreichbar. Ähh ... vorausgesetzt man ist geübter PC-Pilot. Daneben kann man das Ganze auch mit einem Gamepad steuern.\n\nGenial sind die unterschiedlichen Aufgaben,vom fliegen durch Ringe, mit und auch ohne Zeitdruck. Über Landungen auf markierte Stellen der Insel. Bis hin zum ab ballern von Ballons, auch hier zum Teil mit Zeitdruck oder Treibstoffmangel. Daneben müssen auch mal Photos von vorgegebenen Bereichen der Inseln gemacht werden. Zu guter Letzt gibt es auch noch Notfalljob´s die mit fast keinem Treibstoff beginnen. Das ganze ist in den Anfangslevel noch gut zu beherrschen und geht dann nach und nach über in sehr fordernde Aufgaben.\n\nBis jetzt kenne ich 3 Flugzeuge: Ultralightflieger, Segelflugzeug mit Raketentriebwerk und n einmotoriges Sportflugzeug mit Propeller. Dazu gibt es 6 Flughäfen auf 3 Inseln verteilt. So weit mir bekannt ist des auch der gesamte Inhalt des Games. Das ganze reicht aber auch für vieeele Spielstunden, selbst wenn man geübter Simulationspilot ist.\n\nDa mir generell in VR nicht übel wird, kann ich dazu wenig sagen. Aber selbst mir wird bei extremen Manöver leicht schwindlig, bzw. ich bekomme ein Gefühl der Schwerelosigkeit im Magen und Hirn. Aber genau das zeichnet ja eine gute (Arcade-)Simulation aus. ;)\n\nVon mir bekommt das Game 9 von 10 Punketen. Nur ein Wettersystem und vielleicht etwas realistischere Grafik fehlt, um die absolute Höchstwertung von mir zu bekommen.\n\nPS: die 3,9 Std. Spielzeit geben ein falsches Bild. Starte Ultrawings direkt aus Oculus Home heraus. Daduch werden weder meine Erfolge noch meine Spielzeit aufgezeichnet. Dafür wird das Spiel hoffentlich nicht durch unnötige Hintergrundprograme ausgebremst.", "timestamp_created": 1504461614, "timestamp_updated": 1504527843, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34710738": {"recommendationid": "34710738", "author": {"steamid": "76561198152192744", "num_games_owned": 43, "num_reviews": 5, "playtime_forever": 170, "playtime_last_two_weeks": 0, "last_played": 1506121413}, "language": "english", "review": "[b]PLEASE allow Hotas[/b], that's how planes are flown since one century.\nEVERYTIME I fail a mission it's controller's fault.\n\nSometime despit pressing the button the joystick \"disengage\", the throttle and flaps are not easy to adjust precisely in rush, etc. etc.\nI just failed my last 4 advanced missions ONLY because of controls. It would never happened with an HOTAS it's very frustrating.\n\nI'll change my review if by any chance this flight simulator get descent [b]plane[/b] controls.\n", "timestamp_created": 1504442425, "timestamp_updated": 1504442425, "voted_up": false, "votes_up": 2, "votes_funny": 4, "weighted_vote_score": "0.421822", "comment_count": "11", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34659710": {"recommendationid": "34659710", "author": {"steamid": "76561198045894934", "num_games_owned": 68, "num_reviews": 6, "playtime_forever": 17, "playtime_last_two_weeks": 0, "last_played": 1507557331}, "language": "english", "review": "wasn't a fan of flying coz i hate the feeling of vertigo,, but hell this game is awesome! lots of adrenaline starts after takeoff, if you are fond of airplanes , or piloting one, this is the game for you :)", "timestamp_created": 1504272125, "timestamp_updated": 1504272125, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.478261", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34638855": {"recommendationid": "34638855", "author": {"steamid": "76561198302689631", "num_games_owned": 99, "num_reviews": 20, "playtime_forever": 24, "playtime_last_two_weeks": 0, "last_played": 1501383919}, "language": "english", "review": "Have no clue why people like this game. It has very little content for the price.\nIf this game wasn't VR it wouldn't be worth more than 5 dollars...\nShould I pay more money for games that support 4k or 144hz monitors too?", "timestamp_created": 1504199387, "timestamp_updated": 1505235327, "voted_up": false, "votes_up": 3, "votes_funny": 2, "weighted_vote_score": "0.452519", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34577431": {"recommendationid": "34577431", "author": {"steamid": "76561198139266525", "num_games_owned": 39, "num_reviews": 1, "playtime_forever": 132, "playtime_last_two_weeks": 0, "last_played": 1510937568}, "language": "english", "review": "I write this review after playing for half an hour.\n\nMy impression: Fun!\n\nSure, the game looks soooooo minecraft graphics, and the flight physics is pretty much basic.\nBut heck, playing sim using the Vive Controllers makes the game so immersive !\nUsing hand gestures to start the engine, add flaps, adjust the throttle and move the stick is what makes this game so fun!\nIt runs very smoothly on my not-so-OP machine (pretty much due to childish graphics) hence I dont get dizzy whatsoever.\n\nOverall, I really liked the game, it's simple, loads of fun for those who are into flight sim games.\n\nPros:\n- Very Immersive Controls\n- Forgiving Flight Physics\n- Stable FPS\n\n\nCons:\n- Cartoon Graphics\n- Takes some practice for those who are not used to flight sim games.", "timestamp_created": 1504014031, "timestamp_updated": 1504014031, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.463458", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34550069": {"recommendationid": "34550069", "author": {"steamid": "76561197970554526", "num_games_owned": 569, "num_reviews": 11, "playtime_forever": 483, "playtime_last_two_weeks": 0, "last_played": 1513356204}, "language": "french", "review": "Excellent, au premier décollage j'ai eu le vertige.\nTout répond bien, le pilotage est top pas prise de tête. Avec un ventilateur en face de soi on s'y croirait :)\n\nLes graphismes sont simple mais tant mieux ça reste fluide ( ça tourne pas trop mal avec une 870m) \n", "timestamp_created": 1503918362, "timestamp_updated": 1503918362, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34489941": {"recommendationid": "34489941", "author": {"steamid": "76561198100301831", "num_games_owned": 216, "num_reviews": 33, "playtime_forever": 5, "playtime_last_two_weeks": 0, "last_played": 1503687436}, "language": "english", "review": "*Oculus User here, so it doesn't log my playtime in the Oculus store*\n\nHonestly, the developers forgot what a difficulty curve was and do know what a cliff is.\n\nSeriously, fuck the glider.\n\nThe game's great for flying, but if you want to actually get anywhere you have to do missions.\n\nLike I said, the difficulty curve is nonexistent. It's a fucking cliff.", "timestamp_created": 1503694831, "timestamp_updated": 1504118772, "voted_up": false, "votes_up": 0, "votes_funny": 3, "weighted_vote_score": "0.315358", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34432481": {"recommendationid": "34432481", "author": {"steamid": "76561198083373954", "num_games_owned": 64, "num_reviews": 9, "playtime_forever": 439, "playtime_last_two_weeks": 23, "last_played": 1516041339}, "language": "english", "review": "you can have a fun with touch controls , you will pilot the plane controling the ( virtual ) stick by your touch control or wand , looks fun , there is some challenge if you try to pop up the ballons while controling your pilot by your touch control , you can buy plane and airport , to earn money you should complete a missions , its not just only free flight game , i wish for more content , looks simple and fun game , however i know its price looks more expensive as a game like this , but it feels new idea on how you control the plane and its VR , but its not worth the price in my opinion but i liked it , and the dev may add more mission and contents as new island ( i Hope )\n\nupdate : \n\nDev is listening to everyone ,and plan to expand the game , and maybe to make another game , he deserve support and send thanks to him", "timestamp_created": 1503475148, "timestamp_updated": 1515164050, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34426351": {"recommendationid": "34426351", "author": {"steamid": "76561197970459072", "num_games_owned": 154, "num_reviews": 21, "playtime_forever": 160, "playtime_last_two_weeks": 0, "last_played": 1503690874}, "language": "english", "review": "Kicking myself I've been eyeing this game for seven months and never pulled the trigger until today. It's really fun, and I was expecting a complete arcade flight model (I'm a real life PPL) so I held off. The FM is just realistic enough to make it enjoyable. Have never seen an ultralight with flaps though lol As a kid I dreamt of owning a \"Quicksilver MX\" ultralight and this kind of fulfills that for me. I fly bigger planes now, but I still love the idea of ultralights.", "timestamp_created": 1503445717, "timestamp_updated": 1503445717, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34406974": {"recommendationid": "34406974", "author": {"steamid": "76561198210811528", "num_games_owned": 24, "num_reviews": 1, "playtime_forever": 247, "playtime_last_two_weeks": 11, "last_played": 1516020062}, "language": "english", "review": "Really great Flight sim, they have really nailed the realistic (im assuming) feel of flight, and have handled how you crash quite well, \nWould love to see future updates with more planes, one that would have turn on a dim type manuverability, like the rocket glider but powered all the time\n", "timestamp_created": 1503368985, "timestamp_updated": 1503368985, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34301589": {"recommendationid": "34301589", "author": {"steamid": "76561198033944045", "num_games_owned": 270, "num_reviews": 1, "playtime_forever": 90, "playtime_last_two_weeks": 0, "last_played": 1502764252}, "language": "english", "review": "Unlocked all planes, landed at all areas, lots of stuff to do, enjoyed it immensely. The three aircraft operate and feel very different to fly.\n\nMotion sickness is a thing to take care of. I couldn't play for more than an hour at a time... motion sickness may be more intense with the third aircraft.\n\nI'd really love to see some more in the game. Larger areas with more \"barn stroming\" would have made this the perfect game...\nI think what I'm really asking for is for someone to make that old PS2 game Sky Oddesy into a full vr game.", "timestamp_created": 1502954210, "timestamp_updated": 1502954210, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.547325", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34299757": {"recommendationid": "34299757", "author": {"steamid": "76561198109901936", "num_games_owned": 95, "num_reviews": 5, "playtime_forever": 532, "playtime_last_two_weeks": 0, "last_played": 1512962335}, "language": "english", "review": "Solid Game. I have gotten in loads of gameplay which justifies the big price tag. Has a nice polished look despite being fairly simple. Also I can fly planes now!!!!! It does have a steep learning curve if you play in simulator mode but it is very worth it. I just unlocked the sport plane and am having fun trying to tame it. I flew between some buildings which felt super cool. Every plane has its charms though and I still fly the first one even though it is the \"beginner\" plane.", "timestamp_created": 1502943727, "timestamp_updated": 1502943727, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.557971", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34269639": {"recommendationid": "34269639", "author": {"steamid": "76561197968793057", "num_games_owned": 182, "num_reviews": 4, "playtime_forever": 490, "playtime_last_two_weeks": 0, "last_played": 1513983231}, "language": "english", "review": "This game is totally amazing. I was skeptical about it being $25, but there's quite a bit of content and I'm sure they'll be adding more with greater adoption. It exceeded my expectations and I set the bar pretty high. It's definitely comparable to Pilotwings, but add amazing VR immersion. The game gets even better when you unlock the second craft, and my jaw dropped when I got to the balloon missions.", "timestamp_created": 1502859943, "timestamp_updated": 1502859943, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502262", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34236134": {"recommendationid": "34236134", "author": {"steamid": "76561198011373553", "num_games_owned": 238, "num_reviews": 5, "playtime_forever": 936, "playtime_last_two_weeks": 0, "last_played": 1510593954}, "language": "french", "review": "\"Allo Papa Tango Charly 9 Fox Trot. Autorisation de décoller\".... J'ai eu l'autorisation,et, je dois admettre que je me suis  fait vraiment plaisir. Même si, pour l'instant, la météo est toujours au beau fixe. (vu le paysage féérique, ce serait dommage  de se choper un Cunimb et 30 noeuds de vent en latéral au moment de l'approche !). Merci pour ce petit bijou qu'est Ultrawings.", "timestamp_created": 1502719195, "timestamp_updated": 1502719464, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34201114": {"recommendationid": "34201114", "author": {"steamid": "76561198048824773", "num_games_owned": 520, "num_reviews": 25, "playtime_forever": 332, "playtime_last_two_weeks": 0, "last_played": 1502626891}, "language": "german", "review": "Sehr lustige Flugsim ala Pilotwings. Sehr zu empfehlen.", "timestamp_created": 1502576455, "timestamp_updated": 1502576455, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502262", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34185120": {"recommendationid": "34185120", "author": {"steamid": "76561197998225628", "num_games_owned": 183, "num_reviews": 17, "playtime_forever": 299, "playtime_last_two_weeks": 0, "last_played": 1503732098}, "language": "german", "review": "Super *****", "timestamp_created": 1502520818, "timestamp_updated": 1502520818, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34177880": {"recommendationid": "34177880", "author": {"steamid": "76561197974571025", "num_games_owned": 77, "num_reviews": 2, "playtime_forever": 1162, "playtime_last_two_weeks": 0, "last_played": 1514433204}, "language": "english", "review": "Love this game! If you loved Pilotwings this game is for you! the sense of flying ia awesome! Found sitting in a recliner with my feet elevated works great for immersion. Get this game!!! No regrets!", "timestamp_created": 1502488494, "timestamp_updated": 1502488494, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.525862", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34172992": {"recommendationid": "34172992", "author": {"steamid": "76561198353070688", "num_games_owned": 11, "num_reviews": 2, "playtime_forever": 23, "playtime_last_two_weeks": 0, "last_played": 1502473689}, "language": "schinese", "review": "希望官方能更新支持HYPEREAL头显和手柄啊，头显定位不准，手柄游戏貌似不能识别，谢谢！", "timestamp_created": 1502472036, "timestamp_updated": 1502472036, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.496241", "comment_count": "6", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34170452": {"recommendationid": "34170452", "author": {"steamid": "76561197973777810", "num_games_owned": 143, "num_reviews": 3, "playtime_forever": 50, "playtime_last_two_weeks": 0, "last_played": 1502484528}, "language": "english", "review": "This is probably my favorite VR game so far, and it´s one of the few that I can see coming back to again and again.  Simply put, it´s an engaging, easy to learn but relatively deep flight sim (not as hardcore as a PlaneX or MS flight simulator, but more immersive due to VR).  The feeling of height, depth and speed is very well conveyed, and the controls feel intuitive quite quickly.  The visual style is perfect for these early days of VR- it's immersive and evocative while remaining cartoony and fun, making rendering easier and avoiding the stutters common to games to strive for photorealism.  \n\nThe game itself is a series of \"jobs\" and training mission, which start by teaching you how to fly, then get progressively more challenging.  It is reminiscent of the old SuperNES Pilotwings, and that's a good thing!  You can also just freefly, which is super fun and relaxing.", "timestamp_created": 1502464317, "timestamp_updated": 1502464317, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34146884": {"recommendationid": "34146884", "author": {"steamid": "76561198271723034", "num_games_owned": 105, "num_reviews": 2, "playtime_forever": 294, "playtime_last_two_weeks": 0, "last_played": 1508400999}, "language": "japanese", "review": "初めに　二時間ほどプレイした感想なので間違いがあるかもしれません。日本語レビューが無いため、今後のプレイヤーの為に少しでも役に立てればと思い、レビューしました。\n\n　主な流れとしては、初めにいくつか操縦テスト（機体を購入するごとにその機体の操縦テストがある）をこなした後、制限時間内に的を通り抜けるジョブや目標地点に着地するジョブをこなし、お金を貯め、次の飛行場へ。の繰り返し\n\n　しかし、空を飛ぶ爽快感によってなのか全く飽きを感じることはありませんでした。慣れるまでは操作感覚が掴めず、かなり苦労しますが、慣れてしまいさえすれば自由に空を飛ぶ快感を味わえます。どうしても無理だと思ってもアーケードの操作方法もありますので操作に関しては問題ないと思います。また、日本語には対応していませんが、英語がわからなくても全く問題はなかったです。ただ一つ問題点を挙げるとすれば、やはり「酔い」だと思います。これはVRの宿命というか、仕方ないものですが、この作品は特に酔いやすいです。今まで滅多に酔った事はないのですが、長時間プレイすると少し頭痛がしたりしました。\n\n　それでも、VRを持っていて飛行機が好きな方、或いはそうでなくともVRならではの爽快感や没入感を味わいたい方には是非プレイして頂きたい作品です。", "timestamp_created": 1502372937, "timestamp_updated": 1502376851, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.608414", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34136784": {"recommendationid": "34136784", "author": {"steamid": "76561198102957730", "num_games_owned": 57, "num_reviews": 4, "playtime_forever": 629, "playtime_last_two_weeks": 0, "last_played": 1514607524}, "language": "english", "review": "Best VR game i have ever played", "timestamp_created": 1502328941, "timestamp_updated": 1502328941, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34097618": {"recommendationid": "34097618", "author": {"steamid": "76561198411384712", "num_games_owned": 3, "num_reviews": 1, "playtime_forever": 353, "playtime_last_two_weeks": 51, "last_played": 1515975012}, "language": "english", "review": "Glidester made it all worth it. 8/10", "timestamp_created": 1502176853, "timestamp_updated": 1502176853, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34084555": {"recommendationid": "34084555", "author": {"steamid": "76561198040854316", "num_games_owned": 95, "num_reviews": 33, "playtime_forever": 144, "playtime_last_two_weeks": 0, "last_played": 1502578222}, "language": "english", "review": "I love it....easy to fly ultra light, fun game!", "timestamp_created": 1502121765, "timestamp_updated": 1502121765, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34082877": {"recommendationid": "34082877", "author": {"steamid": "76561197970344894", "num_games_owned": 198, "num_reviews": 4, "playtime_forever": 312, "playtime_last_two_weeks": 0, "last_played": 1506271750}, "language": "norwegian", "review": "I'm addicted to VR-flying. I fly at least one trip every day with X-Plane 11( A fantastic VR-feel btw). Ultrawings is an other ballgame, but what a blast this is!! The only thing i want is an aircraft carrier, helicopters and a bigger map. This is a must for every plane-lover out there!", "timestamp_created": 1502116313, "timestamp_updated": 1502116313, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34004602": {"recommendationid": "34004602", "author": {"steamid": "76561197972025376", "num_games_owned": 515, "num_reviews": 121, "playtime_forever": 500, "playtime_last_two_weeks": 0, "last_played": 1503207817}, "language": "english", "review": "This is a lot of fun. You start with an ultralight glider and do missions to earn money that let you buy better planes and access to new airports and islands. I've unlocked 3 aircraft so far, and there appear to be more. The missions include flying through rings, landing on targets, popping balloons, aerial photography, etc. I didn't realize until 3 hours in that you can adjust the sound effect and music volume with dials on the stereo in each office.", "timestamp_created": 1501804931, "timestamp_updated": 1501804931, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.549180", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33964085": {"recommendationid": "33964085", "author": {"steamid": "76561198125335359", "num_games_owned": 78, "num_reviews": 4, "playtime_forever": 364, "playtime_last_two_weeks": 0, "last_played": 1511197659}, "language": "english", "review": "PLEASE FIX OR ADDRESS - VERY HARD TO PRESS STARTER BUTTON IN VIVE. TAKES A LOT OF THE FUN OUT OF THE GAME AND IS TRULY FRUSTRATING. ALONG THE SAME LINES, JET SAILPLANE SOMETIMES FIRES THE NEXT ROCKET AND SOMETIMES DOESN'T. IDK IF THIS IS A QUIRK DESIGNED TO MAKE US WORK HARDER OR AN OVERSIGHT; IN ANY CASE IT'S NEARLY IMPOSSIBLE TO DEAL WITH DUE TO THE TEENY, TINY START BUTTON FUNCTION AREA. Also, on the instructional controls plaque brake is spelled wrong. Wheel brakes, not wheel \"breaks.\"\n\nI grew up playing Pilot Wings N64, am a pilot, and an avid flight simmer, so when I saw this pop up with quite a few positive reviews I was ecstatic. I'm about 4hrs in and just unlocked the 3rd aircraft. There will be many many more hours of flying for me. \n\nPros:\nNice stick and rudder characteristics - arcade-like in lots of ways, but flies nicely\nCharming visual style and quirks\nNo motion sickness (for me) even with the cockpit set to minimal obstructions\nFun/challenging missions\nVariety squeezed out of just 3 aircraft\n\nCons:\nNoted above - starter button is outrageously difficult to press for Vive users, very small functionality area. Lots of flailing.\nWould love to see more aircraft (not so much a con, just a hope)\n\nAll and all, well worth the $25 to me. Can be mellow or a challenge depending on your mood, both very satisfying. A little polishing needed, but plenty of content for the money.", "timestamp_created": 1501651351, "timestamp_updated": 1501651351, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33940798": {"recommendationid": "33940798", "author": {"steamid": "76561197994291537", "num_games_owned": 618, "num_reviews": 4, "playtime_forever": 111, "playtime_last_two_weeks": 0, "last_played": 1501727564}, "language": "english", "review": "It's basically Pilot Wings VR and it's a hoot. A must have for any flying fan.", "timestamp_created": 1501556424, "timestamp_updated": 1501556424, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33940484": {"recommendationid": "33940484", "author": {"steamid": "76561198255972225", "num_games_owned": 72, "num_reviews": 1, "playtime_forever": 211, "playtime_last_two_weeks": 31, "last_played": 1515462126}, "language": "english", "review": "Just what I always wanted. To be a pilot. This game is the most fun flight sim for the Vive/Rift to date. Being able to use the tracked controllers makes it feel soooo real. Worth the price. I've had my Vive for a year now and I have the most time in this game. \n\nJust hope it gets some funding and adds some more planes/ a better envirnment. Also a more realistic flight physics mode. But being the only tracked controls flight sim on steam right now, it's everything is needs to be.", "timestamp_created": 1501554825, "timestamp_updated": 1501554825, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502262", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33928868": {"recommendationid": "33928868", "author": {"steamid": "76561198060691648", "num_games_owned": 168, "num_reviews": 9, "playtime_forever": 516, "playtime_last_two_weeks": 35, "last_played": 1515376746}, "language": "russian", "review": "Браво, рекомендую всем кто хоть раз в жизни мечтал опробовать на себе роль пилота.", "timestamp_created": 1501512296, "timestamp_updated": 1501512296, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.478448", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33918952": {"recommendationid": "33918952", "author": {"steamid": "76561197996837614", "num_games_owned": 102, "num_reviews": 3, "playtime_forever": 214, "playtime_last_two_weeks": 0, "last_played": 1501899286}, "language": "english", "review": "This is a great little title. I appreciated that they have different comfort modes, but I turned mine off almost immediately because I felt cramped in the cockpit. I really enjoyed the tutorial and it really felt like a good progression. My only complaint was that I got to the point where I could buy into the next airport, I did, then I buzzed the lighthouse too closely and I accidentally crashed. When I \"came to\" at the original airport I saw the money drained from my account (presumably for the aircraft I just trashed) and it looked like I had to do the whole flight to buy the new airport again. I feel that should have been saved the moment I bought it. Otherwise, this is a great demo. I hope \"Arcade\" mode allows the plane to be crashed without costing money, otherwise I won't share this one with friends and family. I will test that out next time I play.", "timestamp_created": 1501469037, "timestamp_updated": 1501469037, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33910233": {"recommendationid": "33910233", "author": {"steamid": "76561198036561533", "num_games_owned": 97, "num_reviews": 13, "playtime_forever": 671, "playtime_last_two_weeks": 0, "last_played": 1512522860}, "language": "english", "review": "This is my favourite game in VR, but I would love to see more updates and content. I feel the game hasn't evolved since it was released", "timestamp_created": 1501436858, "timestamp_updated": 1512514994, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33908480": {"recommendationid": "33908480", "author": {"steamid": "76561198030420912", "num_games_owned": 258, "num_reviews": 1, "playtime_forever": 206, "playtime_last_two_weeks": 0, "last_played": 1502039459}, "language": "english", "review": "Very cool game.  Most accurate sim of flying an actual ultralight!!  Physics are great and controls are very natural and fun to learn.", "timestamp_created": 1501431781, "timestamp_updated": 1501431781, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33905782": {"recommendationid": "33905782", "author": {"steamid": "76561198170863395", "num_games_owned": 31, "num_reviews": 3, "playtime_forever": 445, "playtime_last_two_weeks": 0, "last_played": 1513459290}, "language": "english", "review": "Overall, I think this will be a good game.  A agree with others that more content will be welcome (i.e. More airplanes and the possibility of multiplayer.)  I would also like to see more complexity in the game, like clouds and more instruments.\n\nTwo drawbacks:  I wish you could adjust the \"dead spot\" on the yoke.  It is WAY too dead as is now.  Very slow response to input.  The second is nausea.  Caution if you get any nausea with other \"motion\" games.  I will say, the comfort mode goes a long way, and I believe with time I will build up my tolerance too this.\n\nUPDATE!!  \nWOW! After some more play time, now at 2 hours, I am really impressed.  The nausea has worn off, and this really is a fun and immersive game.  Got to the rocket glider.  I can \"feel\" the power.  Sound effects are unreal and the feeling of shooting straight up into the air is fantastic!  And yes, the controls do get tighter.  I see now the genious . . . .  \n\nBTW, love the special touches, for example, the scrapes and texture of the glass conopy on the glider.  Can't wait to get to the next plane . . .", "timestamp_created": 1501424213, "timestamp_updated": 1501901371, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.503194", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33895055": {"recommendationid": "33895055", "author": {"steamid": "76561198350030085", "num_games_owned": 27, "num_reviews": 4, "playtime_forever": 20, "playtime_last_two_weeks": 0, "last_played": 1501012669}, "language": "english", "review": "Obviously most people like this game.  I liked it also, but I could not take keeping pressure on the trigger the entire time in order to grip the yoke when flying.  I have arthritis in my hands, and keeping constant pressure on the trigger like that is PAINFUL.  I addressed this with the devs in the discussions, and they said they weren't ready to change that.\n\nAlso, in reading the discussions, it seems that there are an inordinate amount of bugs/problems in the game.  To their credit, the devs respond very quickly to problems, but it just seems like the game has been released too soon.  There are just way too many problems.\n\n\nI decided to request a refund because of pain and bugs.  I'm giving it a positive, because what I experienced, I liked.  I'll keep checking back to see if the bugs/pain level improve, and I may buy it again if things get better.\n\n", "timestamp_created": 1501381742, "timestamp_updated": 1501381742, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.497738", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33871531": {"recommendationid": "33871531", "author": {"steamid": "76561198069959204", "num_games_owned": 95, "num_reviews": 1, "playtime_forever": 380, "playtime_last_two_weeks": 0, "last_played": 1514001946}, "language": "english", "review": "This game is amazing! Really worth the $25. Beware of a bit of motion sickness :)", "timestamp_created": 1501298980, "timestamp_updated": 1501298980, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502262", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33862564": {"recommendationid": "33862564", "author": {"steamid": "76561198095909830", "num_games_owned": 59, "num_reviews": 5, "playtime_forever": 413, "playtime_last_two_weeks": 0, "last_played": 1512928112}, "language": "english", "review": "Fly a plane through a set of islands? Couldnt be better! I'm so glad we now have a VR game that lets you control a plane through a cockpit!", "timestamp_created": 1501267602, "timestamp_updated": 1501267602, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502262", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33854298": {"recommendationid": "33854298", "author": {"steamid": "76561197969008167", "num_games_owned": 131, "num_reviews": 4, "playtime_forever": 617, "playtime_last_two_weeks": 0, "last_played": 1511625180}, "language": "english", "review": "Great game in the spirit of \"Pilotwings\". Easy to get into, with the missions becoming more challenging after a while, thus demanding more piloting skills.\nGraphics are simple and comicy, but very crisp and offering a solid framerate. This and the availalbe comfort mode options should enable players prone to motion sickness to ease into the game.\nVery enjoyable, I suggest you listen to some uplifting music while airborne.", "timestamp_created": 1501243804, "timestamp_updated": 1501243804, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.547325", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33847929": {"recommendationid": "33847929", "author": {"steamid": "76561198003173782", "num_games_owned": 178, "num_reviews": 8, "playtime_forever": 755, "playtime_last_two_weeks": 0, "last_played": 1510350372}, "language": "english", "review": "This is what VR was made for. Ultrawings gives you such an immersive and smooth experience, love it. Please keep up with new development, nice job gang!\n\nSide Note: Devs are actively checking boards and on top of issues. Big +", "timestamp_created": 1501216390, "timestamp_updated": 1501289832, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502262", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33834114": {"recommendationid": "33834114", "author": {"steamid": "76561197966557769", "num_games_owned": 204, "num_reviews": 1, "playtime_forever": 6, "playtime_last_two_weeks": 0, "last_played": 1501131915}, "language": "english", "review": "A fun casual VR flying game with a lot of personality and interesting challenges", "timestamp_created": 1501167565, "timestamp_updated": 1501167565, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33825721": {"recommendationid": "33825721", "author": {"steamid": "76561197970343521", "num_games_owned": 238, "num_reviews": 1, "playtime_forever": 6, "playtime_last_two_weeks": 0, "last_played": 1501137496}, "language": "english", "review": "Pilot Wings plus VR - Yes Please!", "timestamp_created": 1501138422, "timestamp_updated": 1501138422, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33820015": {"recommendationid": "33820015", "author": {"steamid": "76561198040532093", "num_games_owned": 498, "num_reviews": 50, "playtime_forever": 66, "playtime_last_two_weeks": 0, "last_played": 1503310544}, "language": "english", "review": "Terrific sense of 'being there' in your Ultra-Light. Definitely has that Pilot Wings feel to it, but on a whole new level. Was on the fence at first but now Ive experienced it for myself I can safely say it was well worth the purchase. I used to buy most releases when I first got the HMD, but am more picky now because there's too much trashy tech demos with not much substance. This game does NOT fall into that category. Should of had multi-player as standard, but maybe that's something for the games successor. Highly Recommended!", "timestamp_created": 1501111588, "timestamp_updated": 1501111588, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.511871", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33805004": {"recommendationid": "33805004", "author": {"steamid": "76561197976314677", "num_games_owned": 755, "num_reviews": 90, "playtime_forever": 423, "playtime_last_two_weeks": 44, "last_played": 1515812666}, "language": "english", "review": "It's really good.  Flying with motion controllers is so much better than a controller.  (you have the option to use either.)  Maybe use a flight stick?  Not yet?  IDK haven't tried.\n\nFlying on here with motion controls reminds me of a little game called \"XCavalypse\" in VR.  And looks kinda like Final Approach: Pilot Edition.  But Ultrawings has more of a simulation feel.\n\nPhotography missions can be tricky because you have to center shots perfectly.  Some are just way harder to get than others.\n\nI'm guessing this game is meant to be played on a chair with no arm rests because when you recenter.  I can't reach the throttle because the couch is in the way.  So I either have to sit on the couch sideways or slightly stand up and recenter.  The Rocket Glider doesn't have a throttle at all so it's not even an issue.\n\nIt's great though.  Ultrawings has a lot of missions.  My son knows Aerofly FS 2 so as soon as he saw me playing this he pretty much forcibly removed me from the HMD and it's an automatic HIT for kids.  They learn to actually use throttle, rather than pressing buttons.\n\nI recommend this to all friends.", "timestamp_created": 1501061999, "timestamp_updated": 1501248939, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.560708", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33785462": {"recommendationid": "33785462", "author": {"steamid": "76561197961439297", "num_games_owned": 93, "num_reviews": 35, "playtime_forever": 151, "playtime_last_two_weeks": 0, "last_played": 1500984788}, "language": "english", "review": "A nice little game, a tad overpriced imho but hey ho. Don't know what's happened, I was enjotying this initially but it's just made me motion sick, sweating and feel like vomiting had to refund :/", "timestamp_created": 1500985159, "timestamp_updated": 1500985159, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.474138", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33778870": {"recommendationid": "33778870", "author": {"steamid": "76561198011173488", "num_games_owned": 119, "num_reviews": 2, "playtime_forever": 331, "playtime_last_two_weeks": 120, "last_played": 1515563296}, "language": "english", "review": "First off, I would like to say that Ultrawings is a fantastic game and would recommend to anyone with a Rift or Vive. Its a relaxing flying game in which you fly over islands completeing various tasks. If you played pilot wings for the N64, its alot like that but on another level. The only negative I can say about this game is that when I play missions in which you take pictures of various land marks the game tends to crash. Im not sure if this is only something im experiencing or if it is an issue with everyone. Even with this it is still well worth the 25 bucks.", "timestamp_created": 1500954513, "timestamp_updated": 1500954513, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.494776", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33774729": {"recommendationid": "33774729", "author": {"steamid": "76561198001948826", "num_games_owned": 301, "num_reviews": 18, "playtime_forever": 199, "playtime_last_two_weeks": 0, "last_played": 1503202439}, "language": "english", "review": "This game is wonderful.\n\nI think I got put onto this by the Vive subreddit but I sort of bought this game on a whim and hopped in after work with the intention to potter about and move onto some other things.\n\nI lost about 2 hours to this game.\n\nManipulating the simplified (relative to flight sims) controls for controlling fuel rate, magneto and engine starter shifts makes you feel suitably 'pilotsy' in this beautiful cartoon world and the little missions are a real giggle. I've gotten as far as the 2nd unlockable plane (the jet glider). I'm warming up to the mechanics after completing the license challenges but it has its charm.\n\nThe sound design is really good. The two voice actors are pleasant and inject a bit of playful charm into the mission briefings and I love the little buzz of the ultralight engine and the little bit of satisfaction you get when you ease back the throttle and settle in for a cruise. The rocket glider makes me feel like a kerbal when i hit the engine start button, i almost wish it had a flippy cover you had to lift over and rather than a push button it was a big thing you slammed your fist onto. At the moment, with the vive controllers i can find the button press a little... finnicky. Not fun killingly so though.\n\nI almost wish there was an in-between from the ultralight to the glider. I could have helped do some low swoops/crop dusting, or some showy fly-by/low passes on the boating people down below, that would have been a nice little interlude between the balloon popping and photo missions - that being said, the photo missions are a LOT of fun.\n\nA friend of mine is a flight sim fan and I can't wait to get his opinion. If you're looking for a grand cockpit experience, give it a go!", "timestamp_created": 1500933918, "timestamp_updated": 1500933918, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502262", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33773843": {"recommendationid": "33773843", "author": {"steamid": "76561197970612037", "num_games_owned": 197, "num_reviews": 47, "playtime_forever": 1874, "playtime_last_two_weeks": 139, "last_played": 1516307332}, "language": "english", "review": "played it on the vive. it's outstanding. i finally got the sportsplane, the 3rd and last plane as buyable achievment. the game is lots of fun, even for just flying around with the first plane and not caring about completing missions. but if flight simming is your game and if you buy this game because you wanna knife edge this lil extra 300 through tiny gaps between skyscrapers in manhatten and if you have the drive and skills to progress fast in games like this then you just might want to rush through all those challenging missions. because once you got the sports plane, the fun REALLY begins! well worth the money, 10/10, would bug report again!", "timestamp_created": 1500930158, "timestamp_updated": 1501701224, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.491133", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33766714": {"recommendationid": "33766714", "author": {"steamid": "76561197992977221", "num_games_owned": 391, "num_reviews": 65, "playtime_forever": 99, "playtime_last_two_weeks": 0, "last_played": 1500908485}, "language": "english", "review": "Just got this and it's fuckin awesome", "timestamp_created": 1500905615, "timestamp_updated": 1500905615, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.436252", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33756542": {"recommendationid": "33756542", "author": {"steamid": "76561198307072023", "num_games_owned": 16, "num_reviews": 1, "playtime_forever": 77, "playtime_last_two_weeks": 0, "last_played": 1501130976}, "language": "english", "review": "Excellent, finally a flight simulator that you control with your hands.  Can't wait for the f-22", "timestamp_created": 1500859245, "timestamp_updated": 1500859245, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.518390", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33753889": {"recommendationid": "33753889", "author": {"steamid": "76561198119573921", "num_games_owned": 37, "num_reviews": 1, "playtime_forever": 621, "playtime_last_two_weeks": 13, "last_played": 1515276405}, "language": "english", "review": "i love this game so much, they can really work on the start engine button with the oculus touch but other than that its amazing", "timestamp_created": 1500847362, "timestamp_updated": 1500847362, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.494776", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33750089": {"recommendationid": "33750089", "author": {"steamid": "76561197970329288", "num_games_owned": 1762, "num_reviews": 968, "playtime_forever": 20, "playtime_last_two_weeks": 0, "last_played": 1500833836}, "language": "english", "review": "GTX 1060 Gameplay (With Commentary)\nhttps://www.youtube.com/watch?v=BlRusKT_s-o\n\nMy Thoughts:\nOne of my 1st arcade flight games in VR and as a big fan of the original Pilotwings I cannot recommend this game enough. The sensation of flying in VR is simply amazing! \n\nGame Details:\nUltrawings is the first aerial-themed, open-world game where you'll pilot multiple aircraft to complete a variety of missions across an island-themed world. \nThe game features full Oculus Touch support allowing players to use their hands to virtually interact with each aircraft's flight instruments for a truly unparalleled flight experience!", "timestamp_created": 1500834747, "timestamp_updated": 1500834775, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.324748", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "33742564": {"recommendationid": "33742564", "author": {"steamid": "76561197971137324", "num_games_owned": 98, "num_reviews": 6, "playtime_forever": 476, "playtime_last_two_weeks": 0, "last_played": 1511385298}, "language": "english", "review": "Great game which gave me VR-feels like I haven't felt like some time! In a good way I might add.\n\nProfessional look & feel, overall well polished, and loads of stuff to do, next to the free flying (which is also great fun)", "timestamp_created": 1500811307, "timestamp_updated": 1500811307, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502851", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33742205": {"recommendationid": "33742205", "author": {"steamid": "76561198002739467", "num_games_owned": 793, "num_reviews": 20, "playtime_forever": 302, "playtime_last_two_weeks": 0, "last_played": 1510841779}, "language": "english", "review": "I love the flight physics of Ultrawings. I love the feeling of speed, the feeling of height. This is the best flying experience for the HTC Vive. Made with lots of love for details. Virtual flying never felt so real.", "timestamp_created": 1500810153, "timestamp_updated": 1500810153, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.604606", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33741063": {"recommendationid": "33741063", "author": {"steamid": "76561198294969782", "num_games_owned": 104, "num_reviews": 40, "playtime_forever": 171, "playtime_last_two_weeks": 0, "last_played": 1501055275}, "language": "english", "review": "Lots of Fun! Great game! Pick up your helmet on table and fly!\nTurn the knobs and push the starter to ignite those engines! \nStart with a Mission or Free flight!\nFly across the different islands and\nSave money for the Airports and Planes or fuel!\nYou start with a basic plane and work your way up!\nLots more also guns etc...\n\nI have Been playing 1.6 hrs and haven't bought my first plane!\nLong game lots of fun! \n\nLots of setting for motion sickness if you have any.", "timestamp_created": 1500806069, "timestamp_updated": 1500806069, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.512656", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33733733": {"recommendationid": "33733733", "author": {"steamid": "76561197996186550", "num_games_owned": 2766, "num_reviews": 121, "playtime_forever": 41, "playtime_last_two_weeks": 0, "last_played": 1502516982}, "language": "english", "review": "Quite a relaxing VR flight game able to employ the use of motion controllers.\nSimple yet fun controls makes the game shine and immersive.\n\nThe game would be perfect if offer more content like a bigger map and more larger aircrafts.", "timestamp_created": 1500773366, "timestamp_updated": 1500773366, "voted_up": true, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.543639", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33732529": {"recommendationid": "33732529", "author": {"steamid": "76561197970806183", "num_games_owned": 113, "num_reviews": 1, "playtime_forever": 146, "playtime_last_two_weeks": 0, "last_played": 1505021806}, "language": "english", "review": "This game is very fun. The controls are good, the challenges are fun and the immersion is great!", "timestamp_created": 1500767939, "timestamp_updated": 1500767939, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500175", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33728976": {"recommendationid": "33728976", "author": {"steamid": "76561198013598973", "num_games_owned": 240, "num_reviews": 61, "playtime_forever": 369, "playtime_last_two_weeks": 0, "last_played": 1503221114}, "language": "french", "review": "En VR, il ne faut pas 50 heures pour évaluer un jeu, soit ça marche, soit ça ne marche pas . Eh bien, avec Ultrawings ça marche !!!\nGraphiquement c'est très joli, typé cartoon et bien optimisé. ça ressemble un peu à wii sports resort.\nJ'étais un peu septique concernant le maniement des avions avec les controleurs du vive, et finalement ça fonctionne plutôt bien.\nSi vous aimez voler (arcade) ce jeu est fait pour vous. Bon vol.\n", "timestamp_created": 1500754740, "timestamp_updated": 1500754740, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.615385", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33728875": {"recommendationid": "33728875", "author": {"steamid": "76561198006488788", "num_games_owned": 195, "num_reviews": 1, "playtime_forever": 760, "playtime_last_two_weeks": 0, "last_played": 1506038928}, "language": "english", "review": "I don't write a lot of reviews (for reasons which I won't get into) but this game compels me to do so, as THIS is the kind of content I would like to see more of for VR.\n\n5.8 hours in and it's better even than I expected. The graphics are clean and bright, the tutorials and mission progression is intuitive, and the controls (Oculus Touch) feel pretty good for the current technology.\n\nThe game takes me back to the first time I played Starfox on the NES. GREAT feeling of flight.\n\nI prefer to have more tactile feedback in ALL the games I play (especially in VR) but the touch controller implementation is good.\n\nI often find myself letting my hand drift away from the flight stick (and I won't lie, that's frustrating) but I am becomming more aware of hand positioning.\n\nJoystick support (not just gamepad, bleh) such as throttle, pedals and joystick would earn this game a 5/5 stars for me.\n\nOverall, the game so far (I am a completionist so I only just bought the rocket-glider) is crisp, well polished, fun for all skill levels and very much worth the asking price.\n\nI give it a 4.5 out of 5 until/unless they add real controller support.\n\nAlso, for the folks who have trouble getting the view height to a comfortable position, I would suggest recalibrating your HMD. It is spot-on for me and minor head movement while re-centering the view put the stick EXACTLY where I want it.\n\nGREAT JOB devs! Keep good content like this coming.", "timestamp_created": 1500754383, "timestamp_updated": 1500754383, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500175", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33726483": {"recommendationid": "33726483", "author": {"steamid": "76561198003959361", "num_games_owned": 303, "num_reviews": 124, "playtime_forever": 180, "playtime_last_two_weeks": 0, "last_played": 1501974983}, "language": "brazilian", "review": "Gráficos cartoonescos, mas mesmo assim, melhor jogo de vôo até agora xD", "timestamp_created": 1500746983, "timestamp_updated": 1500746983, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33724074": {"recommendationid": "33724074", "author": {"steamid": "76561197965380769", "num_games_owned": 235, "num_reviews": 17, "playtime_forever": 149, "playtime_last_two_weeks": 0, "last_played": 1512259373}, "language": "english", "review": "this is a ton of fun! GO DEVS GO", "timestamp_created": 1500739420, "timestamp_updated": 1500739420, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.511687", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33717800": {"recommendationid": "33717800", "author": {"steamid": "76561198297581073", "num_games_owned": 244, "num_reviews": 105, "playtime_forever": 1820, "playtime_last_two_weeks": 0, "last_played": 1507210580}, "language": "english", "review": "3 rd update:\nJust get it if you have the slightest intrrest in flying in VR. This game is a totally underrated gem. You won´t regret it. Its hands down the best Flying game in VR.\n\n2nd update: I am at 80% now and it is a joy to play. It earned a place in my heart forever.\n\nUpdate: This game is awesome. Get it you won´t regret it. Its already im my VR Hall of Fame.\nIt is cheap for what you get!\n\nOkay this is a flight sim. made for VR. If you liked Pilotwings on the SNES back than you will probably enjoy this one. The progression system and the missions are fun. It takes a little while to get used to the controlls. They are very sensitive. Tip: Don´t oversteer and  get used to the Rudders. I wish the islands were more detailed. Instead of all islands on the map i would have prefered to get different maps with one island each but more detailed ones.\nBut it is how it is and i can finally enjoy a made for VR flight game. It is somehow really relaxing.", "timestamp_created": 1500719650, "timestamp_updated": 1502790412, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.458273", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33706808": {"recommendationid": "33706808", "author": {"steamid": "76561198049201937", "num_games_owned": 46, "num_reviews": 5, "playtime_forever": 175, "playtime_last_two_weeks": 0, "last_played": 1500855456}, "language": "english", "review": "Outstanding.  Excellent production, reasonable flight models, fun missions, and progression!  Also, I'm prone to motion sickness and haven't had any problems whatsoever with this game.", "timestamp_created": 1500674470, "timestamp_updated": 1500674470, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.502661", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33705923": {"recommendationid": "33705923", "author": {"steamid": "76561198098975734", "num_games_owned": 272, "num_reviews": 10, "playtime_forever": 88, "playtime_last_two_weeks": 0, "last_played": 1500671104}, "language": "english", "review": "Some things that seem to be off on the game mechanics  is the fact that more often then not my hand isnt being recognized on the flight stick causing me to jerk in the opposite direction then what I want and in a game like this where precision is key it caused a lot of frustrating moments  where I just rage quit out because I would be on the last ring to fly though for the gold and my flight stick would spaz out causing me to go into the nearest ditch, if I wanted that I would just play Dirt Rally. Will revisit review when and if the controls are revised.", "timestamp_created": 1500671529, "timestamp_updated": 1500671529, "voted_up": false, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.463238", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33705110": {"recommendationid": "33705110", "author": {"steamid": "76561197976517583", "num_games_owned": 672, "num_reviews": 23, "playtime_forever": 59, "playtime_last_two_weeks": 0, "last_played": 1508613917}, "language": "english", "review": "Sweeeeet, very much fun to fly with the vive-sticks!\nGraphics really aren´t ugly...\n\nRecommended :)\n", "timestamp_created": 1500668852, "timestamp_updated": 1500668852, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497512", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33701350": {"recommendationid": "33701350", "author": {"steamid": "76561198026955953", "num_games_owned": 225, "num_reviews": 2, "playtime_forever": 156, "playtime_last_two_weeks": 0, "last_played": 1502416332}, "language": "english", "review": "Fantastic!! Great work guys, really this is got it..\n\nI am only still on the ultralight, and having a blast. \n\nJust wish there was an option to get to all the planes once you pass basic training!!\n\n\nGet this game!", "timestamp_created": 1500657552, "timestamp_updated": 1500657552, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500175", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33698114": {"recommendationid": "33698114", "author": {"steamid": "76561197967267709", "num_games_owned": 838, "num_reviews": 48, "playtime_forever": 133, "playtime_last_two_weeks": 0, "last_played": 1502311162}, "language": "english", "review": "A quick look at the first half hour or so: https://www.youtube.com/watch?v=p0Wry0nFZaM&feature=youtu.be", "timestamp_created": 1500648148, "timestamp_updated": 1500648148, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.543152", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33692028": {"recommendationid": "33692028", "author": {"steamid": "76561198015082671", "num_games_owned": 345, "num_reviews": 13, "playtime_forever": 59, "playtime_last_two_weeks": 0, "last_played": 1500768077}, "language": "english", "review": "What a wonderfull first try  ... I have done 30 minutes and i think that will do me for now i dont want to be sick in this game\nI feel the RUSH  mission was brought in a little to soon i got very wonky on that very quickly i think maybe some more gentle mission to start with maybe ? \n\nBut over all i love it !!", "timestamp_created": 1500628296, "timestamp_updated": 1500628296, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500175", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33689826": {"recommendationid": "33689826", "author": {"steamid": "76561198063942102", "num_games_owned": 219, "num_reviews": 160, "playtime_forever": 459, "playtime_last_two_weeks": 0, "last_played": 1502112858}, "language": "english", "review": "It's like a kiddy flight sim but the flight model is realistic enough to offer some depth..  \nA bit less immersive than the big flght sims due to the cartoon graphics but it's fun \neasy to pick up and play thanks to the native VR support.\n\nThe virtual HOTAS is fun and works well.  You can play it standing too.", "timestamp_created": 1500618726, "timestamp_updated": 1500618726, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.499343", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33688384": {"recommendationid": "33688384", "author": {"steamid": "76561198191401023", "num_games_owned": 1643, "num_reviews": 43, "playtime_forever": 28, "playtime_last_two_weeks": 0, "last_played": 1511860553}, "language": "english", "review": "It's very good so far. As a fan of Aerofly FS 2 : Flight Simulator which I play with a flightstick it's impressive how well this works just grabbing onto and using the vitrual flight stick. Definitely on the sim side of handling, not arcade. The area seems a bit small but don't know if I've done enough yet to reveal anything further there might be. It feels right and that's key in something like this. I'm glad I bought it, maybe you will be too.", "timestamp_created": 1500611926, "timestamp_updated": 1500611926, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.531740", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33687977": {"recommendationid": "33687977", "author": {"steamid": "76561198239866726", "num_games_owned": 52, "num_reviews": 9, "playtime_forever": 97, "playtime_last_two_weeks": 0, "last_played": 1509152346}, "language": "english", "review": "Game is nice but seat is to low and turning can be a little awkward because of it.I have to move back behind the seat for me to even play right.", "timestamp_created": 1500609950, "timestamp_updated": 1500609950, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500175", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33687536": {"recommendationid": "33687536", "author": {"steamid": "76561197966447214", "num_games_owned": 170, "num_reviews": 2, "playtime_forever": 49, "playtime_last_two_weeks": 0, "last_played": 1500607929}, "language": "english", "review": "Just what I wanted for vr flight. I only played it for an hour but reminded me of playing pilotwings 64.. just in vr.", "timestamp_created": 1500608023, "timestamp_updated": 1500608023, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502661", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33687327": {"recommendationid": "33687327", "author": {"steamid": "76561198225920012", "num_games_owned": 27, "num_reviews": 2, "playtime_forever": 591, "playtime_last_two_weeks": 0, "last_played": 1514398846}, "language": "english", "review": "I've done several jobs flying the ultralight.  Lot's of fun.  As others have said, it's a good balance of fun and simulation.  I'm looking forward to more advanced aircraft.", "timestamp_created": 1500607085, "timestamp_updated": 1500607085, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.501742", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33686362": {"recommendationid": "33686362", "author": {"steamid": "76561197997857849", "num_games_owned": 117, "num_reviews": 5, "playtime_forever": 76, "playtime_last_two_weeks": 0, "last_played": 1501207499}, "language": "english", "review": "Edited the review, as a lot of the earlier issues I had were addressed.     The game is quite fun now that I have it working mostly right.  Missions are interseting and game looks nice. \n\nStill the game has some minor issues as far as I'm concerned:\n1) Sometimes the airplane rolls back on the runway prior to takeoff (especially if I have some throttle while hitting starter) and then it gets stuck and I have to reset the mission.\n2)  I find sometimes it's really hard to get the starter button pressed, you push too far, too fast, not enough..etc the game doesn't register you pressed it. \n3) The ipad/camera flickers in free flight (showing multiple textures at once, like gold medals etc) \n4) Have to stand up when resetting seated position, to make the stick high enough to be usable when seated.", "timestamp_created": 1500603179, "timestamp_updated": 1500702230, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500175", "comment_count": "8", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33684989": {"recommendationid": "33684989", "author": {"steamid": "76561197994687590", "num_games_owned": 303, "num_reviews": 9, "playtime_forever": 257, "playtime_last_two_weeks": 0, "last_played": 1505024331}, "language": "english", "review": "I can't stress enough how amazing this game is.  Right out of the box it is fun and intuitive to play. things that arent known like how to start the plane are explained well but not detracting from gameplay. the first lessons are easy to master and most of all fun. missions earn a good amount of money and does not feel grindy to earn the next thing. free flight is available and landing at an airfield allows you the option to refuel and keep flying or return to base. Even in the beginning there is some options on missions so I did not feel like I was forced to do anything I did not want to do. will be playing this one a lot as I love flying and the vive controls add to the experience of this one instead of feeling clumsy or unresponsive. If you are even remotely interested in flying get this one.", "timestamp_created": 1500596988, "timestamp_updated": 1500596988, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.525390", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33684467": {"recommendationid": "33684467", "author": {"steamid": "76561197997881626", "num_games_owned": 219, "num_reviews": 4, "playtime_forever": 533, "playtime_last_two_weeks": 17, "last_played": 1515723120}, "language": "english", "review": "I gave it a whirl and admittedly went in with really low expectations. Thought I'd hate using the Vive controller as a yolk but it worked out surprisingly well and so far it's been a pretty enjoyable experience. I played thought the training lessons and received my pilots license. The game seems to achieve a good balance of challenge vs fun. Not sure how deep the experience goes, but so far so good. If you enjoyed pilotwings back in the day, this will give you a similar feeling of an amature flight simulator that's both challenging and fun.", "timestamp_created": 1500594791, "timestamp_updated": 1500594791, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.529115", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33681330": {"recommendationid": "33681330", "author": {"steamid": "76561197968787403", "num_games_owned": 286, "num_reviews": 2, "playtime_forever": 184, "playtime_last_two_weeks": 0, "last_played": 1500624493}, "language": "english", "review": "I routinely play \"study\" sims and have flown many C172s -- this was enough to scratch that aviation itch. Great atmosphere, fairly intuitive controls, good visuals. One of the most rewarding and elements is the landing challenges. Coming up to the target and looking down to your wheels as you watch them contact with the ground is super satisfying. I feel like the landing challenge itself could be expanded with the use of a bush aircraft, like a Piper Cub with oversized wheels landing on tricky uneven terrain.\n\nPROS:\n-Flights dynamics feel realistic\n-Flipping switches on startup is fun\n-Progression with fun home-bases\n-Great sense of soaring\n-Easy to learn, challenging to master\n\nCONS:\n-Rocket glider controls are confusing. I push the rocket button to take off, but never know when or why it's going to fire again despite trying to cut fuel and glide. Rocket also wont start after a \"retry mission\" selection.\n-Need to hold down trigger to maintain control of flight-stick. Needs to be able to toggle or trim.\n\nIf you like flying you'll like this game, I promise.", "timestamp_created": 1500584388, "timestamp_updated": 1500584614, "voted_up": true, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.574728", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33678723": {"recommendationid": "33678723", "author": {"steamid": "76561198017125492", "num_games_owned": 196, "num_reviews": 29, "playtime_forever": 1228, "playtime_last_two_weeks": 154, "last_played": 1515571931}, "language": "english", "review": "Pretty fun game so far. Not too easy, not too hard. Lots of progression and missions to do. You earn money from doing the tasks and buy new planes and airports. If you get motion sickness there are comfort options. I turned all comfort options off and flew in simulation mode. I got a little disoriented flying like this, first time in a while this has happened to me in VR!! \n\nVery fun flight sim with unique controls, the Vive motion controls do everything from flipping switches in the cockpit to grabbing the stick and operating the aircraft. \n\nThere are different things to do, I haven't tried all of them yet. You fly through objectives to start, later on trying to land in tight spots and take pictures of different landmarks. Holding the iPad while flying can be a little disorienting but I'm sure I'll get used to it. \n\nThe flight mechanics seem realistic enough and it does take a little learning to get a hang of flying the first ultralite aircraft. The music and sound effects are fun, although sometimes its hard to push in the starter button long enough to start the engine.\n\nWould be nice to see a bit more life on the islands/ocean/air and some graphics options as well as a supersampling option in game. Not all audio prompts are for the Vive controller but controls are basic and can be found beside the laptop. If you want a flight sim/pilot wings style game this is it!\n\nOverall 8/10.", "timestamp_created": 1500577427, "timestamp_updated": 1500577427, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.674411", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33676132": {"recommendationid": "33676132", "author": {"steamid": "76561198147801858", "num_games_owned": 176, "num_reviews": 8, "playtime_forever": 55, "playtime_last_two_weeks": 0, "last_played": 1501295784}, "language": "english", "review": "The most absolutely beautiful VR flight simulator on steam there is. There are several more, but they both require all sorts of delirious input devices, but Ultrawings is the least expensive, and only needs the classic Vive controllers. 10/10 would recommend.", "timestamp_created": 1500569642, "timestamp_updated": 1500569642, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.600719", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33676122": {"recommendationid": "33676122", "author": {"steamid": "76561197995107123", "num_games_owned": 239, "num_reviews": 10, "playtime_forever": 63, "playtime_last_two_weeks": 0, "last_played": 1500824758}, "language": "english", "review": "So far this delivers.  How fun , the controls are easy and the physics do not punnish you too much. \n\nJust finished my first job ,, 20 min of flying and just a lil wonkey.  I usually get sick as soon as things start to move. I get sick when in the passenger seat in a car,, I dont fly in real planes well.  Forget boats on the ocean ,, blarp. So just a little  tilty after 20 min is amazing for me!! I Think it is because it  moves like you expect it to ,, omg i want peddle rudders  ... \n\nI recomend this very much  to anyone who likes to fly prop aircraft ( it IS slow moving ultralights) This is the game that is gunna make me push for my vr legs. \n\n(will update after finishing the jobs just so happy with this i thought i would rave a bit while i took a break)", "timestamp_created": 1500569594, "timestamp_updated": 1500569594, "voted_up": true, "votes_up": 16, "votes_funny": 2, "weighted_vote_score": "0.651909", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39538740": {"recommendationid": "39538740", "author": {"steamid": "76561198055744458", "num_games_owned": 965, "num_reviews": 79, "playtime_forever": 423, "playtime_last_two_weeks": 5, "last_played": 1515698519}, "language": "english", "review": "Do you remember Piolet Wings on the N64? and did you love playing it like me back in those days? Then you are going to enjoy Ultra Wings. While it doesn't have the diversity of things like rocket packs and parachutes. It still has penty to do. I have never played a game that really made me feel like i was behind the wheel of a plane before. When i first took off my stomach actually dropped like it does when i have flown in a real plane. The immersion level in that respect is amazing.\n\nThe graphics how ever are very bare bones. In fact if you were not playing this in VR it feels like a game you may have played back in the late 90s. If it only looked nicer it could have really sucked me in more.\n\nThat aside the controls on the planes are great and its one of the best examples to show some one of what it feels like to fly in a VR game. There is a good amount of content and things to do in the game . Picked it up on sale for $12 and was well worth it. Only bug i have run into is the achievements are glitched and wont unlock.", "timestamp_created": 1516639943, "timestamp_updated": 1516639943, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 139, "total_negative": 7, "total_reviews": 146}}
