{"query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 511, "total_negative": 28, "total_reviews": 539}, "reviews": {"38290890": {"recommendationid": "38290890", "author": {"steamid": "76561198042019309", "num_games_owned": 261, "num_reviews": 8, "playtime_forever": 971, "playtime_last_two_weeks": 851, "last_played": 1513780738}, "language": "english", "review": "If you've ever wondered what being a marine from starcraft 1 was like I guess this is the closest you're going to get.", "timestamp_created": 1513209884, "timestamp_updated": 1513209884, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.581749", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38201875": {"recommendationid": "38201875", "author": {"steamid": "76561197967081751", "num_games_owned": 1092, "num_reviews": 18, "playtime_forever": 223, "playtime_last_two_weeks": 0, "last_played": 1512970086}, "language": "english", "review": "TL;DR:  Strongly recommended! An intense and scary single/multiplayer horror/sci-fi FPS, with procedural levels. What people thought the Space Hulk/Colonial Marines games were going to be. Almost impossible singleplayer, but good with a group. Make sure you have at least one friend before buying.\n\n\nTHE LONG VERSION\n\nA deceptively slow-paced and extremely tense game that places you as a space marine in huge, powered armor and puts you on randomly generated ships to download cores for... some reason, or rescue very fragile civilians.\n\nThat may sound standard or identical to other Space Hulk-esque games, but I assure you the execution is unmatched by anything else.\n\nYou see, your suit has limited ammo, vision, and power, but you don't notice that before the game starts cranking the stress-o-meter to 15 out of 10. When your enemies actually bother to show up, it's horribly disorienting (in a good, atmospheric way), and is pretty much guaranteed to make you dookie a shooter straight out through your pants and chair. \n\nNote that \"disorienting\" does not mean \"incomprehensible\". You have a motion sensor, a flashlight, and even a rangefinder counting down the meters before your face eaten off - You'll always know what killed you, it's just a lot faster than you might be used to.\n\nAlso worth noting is that you are very vulnerable in this game. It is not a power fantasy, and a great example of how having weapons and the ability to defend yourself does not necessarily remove the horror element from a horror game. You don't move that fast and have limited room to maneuver. Friendly fire is always on and it doesn't take many rounds to kill a teammate. When guns fire, their muzzle flash can be blinding and disorienting, turning dark hallways into panicked strobe-lit dancefloors of death. In case you weren't stressed out enough, your character's heart rate increases as the enemies close in, represented by the screen pulsating in time with the heart rate. This game is not for epileptics. At all. The menu says it best: \"This game will melt your face off\".\n\nOn top of all that, your enemies - the titular \"Space beasts\" - are very fast and instantly lethal in melee range. They're as deadly as their name is stupid: instant death in melee, able to smash doors, they come out of the goddamned walls, they turn off the power as much as possible, and they do it all at blinding speed. Even with turrets, a full load of ammo, and experienced team members, you are in a race against time to do your job before they overwhelm and kill you.\n\nOn top of THAT, there's an equally stupidly named enemy type called the \"Astro-Creep\". they both scare the shit out of you by face hugging your helmet and obscuring your vision, and also help result in about 3000% more friendly fire incidents by setting off automated turrets, smartguns, and motion sensors that don't realize they're actually very small wall-crawlers. \n\nAll you need to do to get out of this hellhole is accomplish your objectives as quickly as possible and get back to the shuttle. Seemingly impossible at first, but if you use turrets, make good use of locked doors and laser walls, and get a good teammate or two, you have a chance. You also get random upgrades like aim assist or infravision when you accomplish objectives like downloading cores. The upgrades really stack up over time, so doing the job quickly is very helpful. Sentry turrets can be activated to help you out. Naturally, they will shoot and kill you if you stupidly block their line of fire between you and an alien. There are also ammo and repair bays scattered randomly on the map. Tough, but fair.\n\nNote that while you can play by yourself, you will almost certainly fail all but the smallest ships. You really need at least one other person to play with you to have a realistic chance to succeed. Strongly recommended, nevertheless.", "timestamp_created": 1512888206, "timestamp_updated": 1512888206, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.539474", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37996360": {"recommendationid": "37996360", "author": {"steamid": "76561198014350816", "num_games_owned": 360, "num_reviews": 14, "playtime_forever": 24, "playtime_last_two_weeks": 0, "last_played": 1512200648}, "language": "english", "review": "I know its early access, i get that, the problem is its not even good for early access. Graphics are terrible, gameplay is so bare bones i could play it on my phone. Muzzle flash is blinding at least they warn you of it. There is no tutorial of any kind. Nothing to help you navigate menus or even teach you how to play or what to look out for. At least Dark Souls gave you control information! This game doesn't! Do not waste your money on a 15.00 game that should barely be worth .50 cents!", "timestamp_created": 1512201014, "timestamp_updated": 1512201014, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.356102", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36318838": {"recommendationid": "36318838", "author": {"steamid": "76561198170979685", "num_games_owned": 361, "num_reviews": 2, "playtime_forever": 1152, "playtime_last_two_weeks": 0, "last_played": 1509997506}, "language": "russian", "review": "Хотите поиграть в хорошую игру по чужому - alien isolation к вашим услугам. Если же вам больше нравятся чужие  -  однозначно sbtf. В сторону colonial marines даже не смотрите. Она не раскрывает тему колониальной морской пехоты от слова совсем. Другое дело sbtf, правда это не совсем чистые чужие, с легкой примесью space hulk, но по духу все равно ближе к чужим. Толпы противников, медленно, но верно заканчивающиеся патроны, страх быть сожраным заживо на пустом и темном корабле где-то далеко в космосе, где ваш предсмертный крик никто не услышит (особенно если играете в одиночку). Все это sbtf вам обеспечит с достатком. Что касаемо генерации уровней, она очень даже хороша, правда довольно часто можно встретить очень похожие, а то и абсолютно одинаковые фрагменты карты. Так же игра может подкинуть вам довольно неожиданные сюрпризы, в роде терминала (которые надо взламывать, и при том обязательно все) между двух проломов, из которых спавнятся твари. Отдеьная история - это биомасса, или же заражение, как вам угодно. Эта дрянь не причинит никакого вреда, но она запросто скроет от ваших глаз то, что может вам очень даже пригодиться, например панель управления дверью, а то и цеый терминал или раздатчик патронов. К слову, поскольку игра является по сути своей рогаликом, в ней присутствует перманентная смерть, при которой игрок теряет весь прогресс. И вот представьте себе ситуацию: вы уже не плохо так прокачаны, отступаете по коридору, попутно отстреливаясь, и внезапно натыкаетесь спиной на дверь, а стены вокруг вас покрыты заражением, и что бы вы подумали? Поварачиваетесь к тому месту, где находится панель управления, а там сплошная биомасса, и вы начинаете хаотично тыкать в нее, надеясь открыть дверь (а по скольку персонажам здесь присущ страх, то экран ваш в этот момент дергается как эпилептик в припадке), но не успеваете, со спины подкрадывается ксенос и ваншотит вас (смерть здесь в любом случае с одного удара). Качайтесь заново. И такое вполне может случиться даже при ручной генерации уровня, а если выставлена полностью случайная, то каждая секунда может превратиться в ад. В общем, понесло меня, пора бы и закругляться. Игра хороша, хоть и находится в раннем доступе. Но в том, что она из него выберется, можно быть полностью уверенным. Автор хоть и редко, но выпускает обновления, которые очень сильно улучшают игру. Не побоюсь этих слов - лучший симулятор колониального морпеха. Всем однозначно рекомендую, а фанатам чужих так вообще маст хэв. С нетерпением жду релиза.", "timestamp_created": 1509964502, "timestamp_updated": 1509964502, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.557459", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38602047": {"recommendationid": "38602047", "author": {"steamid": "76561198024660768", "num_games_owned": 478, "num_reviews": 2, "playtime_forever": 16, "playtime_last_two_weeks": 16, "last_played": 1514077896}, "language": "english", "review": "Exited pod, found copy machine, felt everything would turn out OK.  Found Alien horrors.  Everything did not turn out ok.", "timestamp_created": 1514078036, "timestamp_updated": 1514078069, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35365332": {"recommendationid": "35365332", "author": {"steamid": "76561197977357413", "num_games_owned": 489, "num_reviews": 7, "playtime_forever": 1014, "playtime_last_two_weeks": 0, "last_played": 1508484710}, "language": "english", "review": "This game does co-op/horror/roguelike right. I sincerally hope the developer continues to update this hidden gem.\n\nP.S. The online play is fairly stable, but starting games can get a little wonky (usually taking a few seconds to remake the lobby fixes it)", "timestamp_created": 1506838033, "timestamp_updated": 1506838033, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39141795": {"recommendationid": "39141795", "author": {"steamid": "76561198044336427", "num_games_owned": 44, "num_reviews": 5, "playtime_forever": 238, "playtime_last_two_weeks": 238, "last_played": 1515468526}, "language": "english", "review": "BEST GAME EVER! the fun part is getting jumped scared", "timestamp_created": 1515304223, "timestamp_updated": 1515304223, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39138853": {"recommendationid": "39138853", "author": {"steamid": "76561198026338154", "num_games_owned": 117, "num_reviews": 2, "playtime_forever": 952, "playtime_last_two_weeks": 794, "last_played": 1515983725}, "language": "english", "review": "Amazing game, get four friends together and progress through, when the power dies get ready to watch in horror as all of your friends die one by one until you are the lone survivor, Running out of ammo as the horde closes in on your position.\n\n10/10 will shit myself again...", "timestamp_created": 1515294478, "timestamp_updated": 1515294478, "voted_up": true, "votes_up": 0, "votes_funny": 2, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39021099": {"recommendationid": "39021099", "author": {"steamid": "76561198070031508", "num_games_owned": 84, "num_reviews": 1, "playtime_forever": 662, "playtime_last_two_weeks": 0, "last_played": 1514789269}, "language": "english", "review": "Great game. My freinds and I have had more fun with SBTF than most AAA games released in recent memory. Highly reccomended. I hope the devs continue to add more objectives, missions, and weapons so we can keep coming back!", "timestamp_created": 1515005357, "timestamp_updated": 1515005357, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "38917271": {"recommendationid": "38917271", "author": {"steamid": "76561197987418739", "num_games_owned": 521, "num_reviews": 44, "playtime_forever": 514, "playtime_last_two_weeks": 0, "last_played": 1513577182}, "language": "english", "review": "Now us non-actors can be in an \"Aliens\" movie.", "timestamp_created": 1514760654, "timestamp_updated": 1514760654, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38886333": {"recommendationid": "38886333", "author": {"steamid": "76561197969379252", "num_games_owned": 203, "num_reviews": 2, "playtime_forever": 1282, "playtime_last_two_weeks": 227, "last_played": 1516067876}, "language": "english", "review": "OMG.  Best game ever.\n\nIts essentially a co-op, FPS, Roguelike, perma death game that blends Aliens  movies with Games Workshops Space Hulk game.  If you like any of the above, get the game now!\n\nOne caveat:  The game is WAY more enjoyable if you have buddies to play with.  This really shines as a co-op.  Who's covering the breach, who is getting the turret, who is cover this hall etc...if you like having those kind of conversations then this game is for you.  If you are a loner puke bucket head, that doesn't enjoy other people then you may want to pass.", "timestamp_created": 1514690029, "timestamp_updated": 1514690029, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38875893": {"recommendationid": "38875893", "author": {"steamid": "76561198089899211", "num_games_owned": 55, "num_reviews": 3, "playtime_forever": 207, "playtime_last_two_weeks": 77, "last_played": 1516128401}, "language": "english", "review": "Jeeez! That was intense...", "timestamp_created": 1514667398, "timestamp_updated": 1514668243, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38839051": {"recommendationid": "38839051", "author": {"steamid": "76561198238905870", "num_games_owned": 64, "num_reviews": 3, "playtime_forever": 106, "playtime_last_two_weeks": 0, "last_played": 1514148770}, "language": "german", "review": "Richtig nice auf ner LAN-Party und was nices für leute die diese retro grafik mögen.", "timestamp_created": 1514591244, "timestamp_updated": 1514591244, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38689254": {"recommendationid": "38689254", "author": {"steamid": "76561198039037011", "num_games_owned": 350, "num_reviews": 137, "playtime_forever": 61, "playtime_last_two_weeks": 0, "last_played": 1514353654}, "language": "english", "review": "This is the Aliens Colonial Marines game i wanted. Even though its a bit lacking content it is well worth the price.", "timestamp_created": 1514278404, "timestamp_updated": 1514278404, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.543568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38681161": {"recommendationid": "38681161", "author": {"steamid": "76561197961680226", "num_games_owned": 155, "num_reviews": 15, "playtime_forever": 284, "playtime_last_two_weeks": 0, "last_played": 1514432552}, "language": "english", "review": "Super fun action time deluxe\n\nI enjoy muchly", "timestamp_created": 1514256347, "timestamp_updated": 1514256347, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "38661991": {"recommendationid": "38661991", "author": {"steamid": "76561198062040803", "num_games_owned": 77, "num_reviews": 18, "playtime_forever": 80, "playtime_last_two_weeks": 0, "last_played": 1514216290}, "language": "english", "review": "pretty fun", "timestamp_created": 1514215851, "timestamp_updated": 1514215851, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "38602061": {"recommendationid": "38602061", "author": {"steamid": "76561198067028859", "num_games_owned": 1427, "num_reviews": 32, "playtime_forever": 58, "playtime_last_two_weeks": 41, "last_played": 1515119566}, "language": "english", "review": "Pissed myself on the first playthough. Second playthrough resulted in me shitting my pants. Third playthrough cut short by cat scaring the rest of my bodily fluids out of me due to heightened tension.", "timestamp_created": 1514078086, "timestamp_updated": 1514078086, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38555653": {"recommendationid": "38555653", "author": {"steamid": "76561198089522478", "num_games_owned": 42, "num_reviews": 3, "playtime_forever": 2352, "playtime_last_two_weeks": 0, "last_played": 1514598345}, "language": "english", "review": "Great game, very well done and a ton of fun with your friends!", "timestamp_created": 1513989895, "timestamp_updated": 1513989895, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38551708": {"recommendationid": "38551708", "author": {"steamid": "76561198048970217", "num_games_owned": 371, "num_reviews": 32, "playtime_forever": 146, "playtime_last_two_weeks": 57, "last_played": 1515866159}, "language": "english", "review": "This game definitly needs a lot of work honestly. Like. A lot! key mapping. Controls. Flashlights on and off because you're forced to USE battery power. You can't properly save your friends that are tagged by any aliens. Because the multiplayer models are just one or two animations. Resulting you in shooting your friends that are being pounched  due to their character model. And it excists since 2015! How are these things not fixed yet.\n\nApart from all the frustrating animations and the way you control your suit.\nThe game is fun. Its just really hard with the systematics that are now still in the game.\nBe ready to shoot your friends a lot when they need you. And find an power source 24/7.", "timestamp_created": 1513980305, "timestamp_updated": 1513980305, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38503352": {"recommendationid": "38503352", "author": {"steamid": "76561198025814812", "num_games_owned": 331, "num_reviews": 8, "playtime_forever": 6, "playtime_last_two_weeks": 0, "last_played": 1513888676}, "language": "english", "review": "scary af", "timestamp_created": 1513889005, "timestamp_updated": 1513889029, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38409692": {"recommendationid": "38409692", "author": {"steamid": "76561198145740816", "num_games_owned": 180, "num_reviews": 3, "playtime_forever": 96, "playtime_last_two_weeks": 0, "last_played": 1513638554}, "language": "english", "review": "FIrst mission: Goes well\nSecond mission: 40 objectives with shit tons of enemies flooding one corridor and procceded to shoot my ally to death\nThird mission: Touches breaker box. Gets drop kicked by alien spawned above me", "timestamp_created": 1513638774, "timestamp_updated": 1513638774, "voted_up": false, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.434783", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38409680": {"recommendationid": "38409680", "author": {"steamid": "76561198001337396", "num_games_owned": 180, "num_reviews": 2, "playtime_forever": 49, "playtime_last_two_weeks": 0, "last_played": 1513638556}, "language": "english", "review": ">Power turns off.\n>Go to breaker to turn the power back on.\n>After activating the breaker a mob spawns on me and proceeds to inst-kill me before I can physically react.\n\n10/10 would insta-die again.", "timestamp_created": 1513638720, "timestamp_updated": 1513639021, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "38402747": {"recommendationid": "38402747", "author": {"steamid": "76561198004692894", "num_games_owned": 94, "num_reviews": 2, "playtime_forever": 1209, "playtime_last_two_weeks": 0, "last_played": 1514678407}, "language": "english", "review": "This is a great game to play with friends. You will die a lot, but the games are quick and it's fun to watch each other, so no worries. You will need to play with the map settings and play on easy to start with to stand a chance. It's not very scary, though it can make you jump.", "timestamp_created": 1513615561, "timestamp_updated": 1513615561, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "38357354": {"recommendationid": "38357354", "author": {"steamid": "76561198337750743", "num_games_owned": 8, "num_reviews": 4, "playtime_forever": 10, "playtime_last_two_weeks": 0, "last_played": 1513449395}, "language": "spanish", "review": "Recomiendo el juego, tiene una buena difiultad con graficas respetables, la desesperación y el terror estan bien implementadas, pero para ser sincero con todo lo que tiene para ofrecer realmente no vale lo que cuesta. Si su precio fuera la mitad o menos de lo que cuesta con gusto lo compraria, y conservaria, pero repito si es recomendable solo por su precio no lo vale.", "timestamp_created": 1513449922, "timestamp_updated": 1513449922, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39382947": {"recommendationid": "39382947", "author": {"steamid": "76561198008104259", "num_games_owned": 152, "num_reviews": 3, "playtime_forever": 456, "playtime_last_two_weeks": 271, "last_played": 1516075714}, "language": "english", "review": "A [b]Solid[/b] 9 out of 10\nFor being in early access, among the sea of hodge podge forgettable, garbage that has come out recently, S.B.T.F stands above the rest. At least, in my humble opinion.\n\nThe game isn't hard to grasp, and the controls and optimization are solid.\nThe game modes are well thought out too, and there is no illusion of depth that tries to bring players in, for something this game is not.\n\nIt is a straight up a corridors/ dungeon/ arcade shooter, and it does so remarkably well.\nAddictive and Fun, I believe most of my play sessions are basically an endless stream of:\n\"! more, let's do 1 more! [i]Proceeds to Die[/i]\"\n\nI am looking forward to what this game ends up bringing towards it's full release, but i stand by my review giving it a solid [i]Thumbs HELL! UP![/i]", "timestamp_created": 1516082670, "timestamp_updated": 1516082670, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.540636", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "39381552": {"recommendationid": "39381552", "author": {"steamid": "76561198008062073", "num_games_owned": 169, "num_reviews": 6, "playtime_forever": 624, "playtime_last_two_weeks": 133, "last_played": 1516075713}, "language": "english", "review": ">Space Beast Hoarde\nEverything is fine\n\n>Accidental Stray shots\nEverything. Is. Fine.\n\n>Losing HUD\nEverything. Is. FINE!\n\n>Power goes out\nWHERE THE F*CK IS THAT BREAKER I SWEAR TO-\n*Death by space beast*\n\n\nIf Space Hulk was a more frantic, sfressful, and sp00ky FPS than Deathwing, it would be Space Beast Terror Fright", "timestamp_created": 1516076644, "timestamp_updated": 1516076644, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}}}
