{"reviews": {"39250270": {"recommendationid": "39250270", "author": {"steamid": "76561198025902156", "num_games_owned": 388, "num_reviews": 53, "playtime_forever": 255, "playtime_last_two_weeks": 0, "last_played": 1509958079}, "language": "english", "review": "Dujanah is a short game. It’s a weird game. It’s a game I don’t understand. I don’t honestly know how much I like it. But I came away knowing one thing: Dujanah is utterly singular and unlike any other game I’ve ever played. \n\nDujanah is a simple game with a simple premise. You play as a woman looking for her husband and daughter. The art is strange and jarring, and the music is bizarre and brilliant. You talk to NPCs who tell you long stories about their life, or maybe you get in a brief fight with a sand worm. It's a game about death, a subject Jack King-Spooner has dealt with intimately as well in Beeswing. But it's also a game about wanting, about vengeance, about grief, and about spiders.\n\nThe world and internal logic of Dujanah is so unique and surprising that I constantly felt on edge. Still, parts of Dujanah fall horribly flat; there are some mini-games that last far too long to be worth the process, and its attempts at humor can be truly awful, being needlessly obscene. Which is strange, because Dujanah excells at subtlety. There are sections of dialogue and little quips from characters that come off masterfully (a particular conversation in this game is one of my favorite moments in any game I've played). The game comes off as tone deaf at times. \n\nDujanah is like Trout Mask Replica or the art of Jean-Michel Basquiat; I don’t know how much I like it or understand it, but it needs to exist. They say things that are unique and subversive in ways I cannot expect other art to be. They are polychromatic, shocking, often beautiful and repulsive in the same breath. Dujanah confuses me and upsets me, but I cannot help but respect it and look at it with utter fascination and respect.", "timestamp_created": 1515656952, "timestamp_updated": 1515656952, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39079662": {"recommendationid": "39079662", "author": {"steamid": "76561198324609647", "num_games_owned": 25, "num_reviews": 1, "playtime_forever": 337, "playtime_last_two_weeks": 0, "last_played": 1515148524}, "language": "english", "review": "A wonderful game about the inevitabilty of death and how to deal with grief set in the backdrop of a western occupied middle eastern nation. It can feel like an overly pretentious Art Game(TM) at points, including one scene where a British man philosophises about consciousness for about 10 minutes but it resonated with me and I feel like it plays into Dujanah's central themes. Very cool art style and sound design.", "timestamp_created": 1515148847, "timestamp_updated": 1515148847, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38481963": {"recommendationid": "38481963", "author": {"steamid": "76561198007617428", "num_games_owned": 268, "num_reviews": 2, "playtime_forever": 126, "playtime_last_two_weeks": 0, "last_played": 1513841801}, "language": "english", "review": "Beautiful like nothing else. Absolutely worth your time.", "timestamp_created": 1513847499, "timestamp_updated": 1513847499, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38312074": {"recommendationid": "38312074", "author": {"steamid": "76561198045260368", "num_games_owned": 179, "num_reviews": 3, "playtime_forever": 185, "playtime_last_two_weeks": 0, "last_played": 1513292705}, "language": "english", "review": "Heartbreaking. Absolutely gorgeous. Scary. Hilarious. Pick it up. It's worth it.", "timestamp_created": 1513293948, "timestamp_updated": 1513293948, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.504505", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38226814": {"recommendationid": "38226814", "author": {"steamid": "76561198028314476", "num_games_owned": 177, "num_reviews": 3, "playtime_forever": 225, "playtime_last_two_weeks": 0, "last_played": 1511926899}, "language": "english", "review": "Definitely not for someone who doesn't like the whole art-house game thing, but this is absolutely beautiful. Just enough weird, touching, and funny moments/dialogues/vignettes set to some great music, all represented with some very imaginative claymation art. Jack King-Spooner is a goddamn genius. There's some politics in there, but it's not enough that I would warn against it really. Just good. Not perfect, granted (the arcade was a bit of a strange addition, though I didn't find their inclusion as offensive as some others on here, and the audio in some sections is a bit too jarring), but good.", "timestamp_created": 1512962153, "timestamp_updated": 1512962310, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38104828": {"recommendationid": "38104828", "author": {"steamid": "76561198395351334", "num_games_owned": 64, "num_reviews": 40, "playtime_forever": 765, "playtime_last_two_weeks": 521, "last_played": 1516092034}, "language": "english", "review": "I've played nearly 4 hours??? Wow, I didnt even notice the time pass! This is really weird and intriguing. The art style and sound in the game really makes this stand out and be memorable. I really like the music in the game and its very mellow and gets you thinking.", "timestamp_created": 1512571491, "timestamp_updated": 1512571491, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38093774": {"recommendationid": "38093774", "author": {"steamid": "76561198092449441", "num_games_owned": 1312, "num_reviews": 20, "playtime_forever": 11, "playtime_last_two_weeks": 0, "last_played": 1512439752}, "language": "english", "review": "The Sluggish Morrs creator made a new game?  And it's on Steam?  COUNT ME IN!  So far it's incredible and the source material is far from lacking.  Very intriguing, can't wait to finish this.  Already emotionally driven enough to give a thumbs up in just the first few minutes.  Going to have to check out some of this guy's other projects now.  One heck of an artist!", "timestamp_created": 1512528161, "timestamp_updated": 1512528161, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37117745": {"recommendationid": "37117745", "author": {"steamid": "76561198068910045", "num_games_owned": 100, "num_reviews": 2, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1505932643}, "language": "english", "review": "a moving, interactive beautiful arts", "timestamp_created": 1511453299, "timestamp_updated": 1511453299, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36093353": {"recommendationid": "36093353", "author": {"steamid": "76561198040884867", "num_games_owned": 1267, "num_reviews": 663, "playtime_forever": 150, "playtime_last_two_weeks": 0, "last_played": 1513658935}, "language": "english", "review": "[i]Where to begin with this one.[/i]\n\n[b]First off, I'm on the fence about this title but am upvoting because experimental games like this need to exist - and I certainly want to support developers that have metric tons of talent and vision - like this one.[/b] In fact, I'm sure to pick up the other two titles on Steam, now that I know what I'm in for.\n\n[b]The short explanation for being on the fence is that while it is undeniably beautiful and super well crafted - it's all a bit too abstract, difficult at times, and dare I say grindy for the sake of adding time.[/b] I also felt some subversive tones that I didn't care for, but maybe I'm reading too far into things - but that's what happens when you abstract a storyline, I suppose.\n\nNow, first and foremost when playing this, I would think to myself [i]'my gawd this must have taken forever to create'[/i]. Seriously, every little nook-and-cranny is beautiful. [b]The music is outstanding.[/b] But here is the weird thing - the highs for the sound/ambience/music are 10/10-best-I've-heard-in-a-damned-long-while BUT the lows for some of the screeching and babies crying (etc.) will induce ear bleeding. I had to manually mute it for some parts. [i]Sometimes[/i] this can be a good thing, but I think the envelope was pushed too far during certain moments here. The music is so good though, that I'm not sure why you have to go to Itch to get the soundtrack. Money left on the table.\n\nNow I'm not at the end of the story yet, because I'm not certain I will be able to finish the arcade games. Talk about hard-as-nails. I have the skill, but I'm not sure I have the patience. Why? Well, I mentioned that the story is abstract. I [i]want[/i] the story to compel me forward and suck me in. I wanted to fall in love with it. There are brief moments where I 'get it' and we start going that direction, but mostly it's like a mid-1960's Bob Dylan song - it sounds philosophical and awesome but doesn't really add up to much. In [i]Dujanah[/i] I get serious overtones of climate change, terrorists living in caves, the United States of America, to name a few. There is also a dab of potty humor, which kind of works. Kind of. \n\nI also mention the game is difficult at times. At one point an arcade opens up and you have to win 3 of the games. Let me tell you these are mostly full-blown games. The MetroidVania is better than some I've paid for, lol. [b]One of the games is called [i]Pie or Anus?[/i].[/b] You read that right. They slowly reveal a picture and you have to guess which it is. It's actually kind of traumatizing. Anyways I'm currently trying to win the two games, and they are decidedly difficult. I wish I had more story to drive me forward. I don't. These kinds of games work off of the mechanic of getting the player interested in trying to see the next weird thing around the next corner and NOT a difficult platforming section. Does that make sense?\n\nBut yeah, there is a lot of weird stuff around a lot of weird corners. Things like:\n[list]\n[*]A room full of pregnant naked ladies\n[*]A movie theatre with a movie of a dude putting something into a sex dolls mouth\n[*]You walk around on a crying face and listen to poetry\n[/list]\n\nAnd on and on. \n\nI also mention a grindy element to this game. Not grindy as you would find in an RPG when leveling up, but more things that take more time than they should. There are a lot of weak mazes that just have you wandering through to find people. It doesn't add anything other than time. Searching for stuff in the desert. In the [i]Mario Kart[/i]-esque minigame, why do I have to suffer 7 races? Why not 3? You achieve the same effect.\n\n[b]But even after all that complaining I just did - the game has some of the best music and artwork I've seen.[/b] There are tons of one-off philosophical quotes that really made me think, too. Some wonderfully written stories by NPCs that really made me think. \n\n[b]If you are interested in this type of game - you likely care less about sales and more about supporting artists that really propel video games forward [i]as an art[/i].[/b]", "timestamp_created": 1509233539, "timestamp_updated": 1509233572, "voted_up": true, "votes_up": 27, "votes_funny": 0, "weighted_vote_score": "0.735552", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36037819": {"recommendationid": "36037819", "author": {"steamid": "76561197994900280", "num_games_owned": 116, "num_reviews": 6, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1509049552}, "language": "english", "review": "WHAT THE ACTUAL - in a good waay\n\nI wasn't aware of Jack's earlier works and I bought the game after seeing a brief peek in a czech videogame YT show.\n\nCouldn't be more happy.\n\nDunajah combines so many things, funny, truly subversive, profound and emotional in an exquisitely unique assemblage of clay-punk-magical-glitch-realism package (let's adopt the term, haha) and most importantly - PULSS IT OFF. \n\nCombining reflection on videogame stereotypes, archaic interfaces, geopolitics, references to Trump, other games, Žižek (at least I think - the sniff sniff spider in the cave), philosophy (very thoughtful sequence discussing consciousness and death) seems like a recipe for disaster, but it comes out as coherent, and - importantly - emotional work of art. You're tasked with finding your loved ones inside a world where fantasy, dream and reality merge and mash, with originality that's miles beyond most of indie would-be art titles. Clay and physically made player and NPC figures, analog and digital alterations, and god - that great soundtrack.\n\nDujanah is somewhat simple in it's \"gaming\" part (just a reminder for those misguided who think that exploratory games are not games), but that DOES NOT MATTER for it's artistic vision is so strong it will surely stand a test of time.\n\nGet it. Just. Get. It..", "timestamp_created": 1509096277, "timestamp_updated": 1509096277, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.528659", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35810228": {"recommendationid": "35810228", "author": {"steamid": "76561198036407843", "num_games_owned": 616, "num_reviews": 3, "playtime_forever": 166, "playtime_last_two_weeks": 0, "last_played": 1507490234}, "language": "english", "review": "[I was a Kickstarter backer of this game]\n\nThe less you know about the game the better the experience.  \n\nIf you've looked over the store page, watched the videos, and are wondering if this will be one of those odd indie games that deliever a great experience for a few hours of play the answer is YES.  There is an interensting story, some moments of good humor and some moments that make you ponder things a bit deeper.\n\nBottom line, if the game has you at all curious, get it.", "timestamp_created": 1508299135, "timestamp_updated": 1508299135, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.559648", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35630333": {"recommendationid": "35630333", "author": {"steamid": "76561198002732294", "num_games_owned": 161, "num_reviews": 14, "playtime_forever": 228, "playtime_last_two_weeks": 0, "last_played": 1507773276}, "language": "english", "review": "My husband turned into a spider. Typical.", "timestamp_created": 1507690293, "timestamp_updated": 1507690293, "voted_up": true, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.509399", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35602059": {"recommendationid": "35602059", "author": {"steamid": "76561198007354983", "num_games_owned": 208, "num_reviews": 4, "playtime_forever": 268, "playtime_last_two_weeks": 0, "last_played": 1507556628}, "language": "english", "review": "There is no right way to describe Dujanah. It's an experience with amazing music, strange visual and violent thoughts - a game with mechas and puzzles and spiders and freedom and so, so many layers of interpretations and so many hidden things. You will love to hunt these secrets and their rewards will be as surprising as the hunt itself. \nIf most of the gameplay is classic 'walk and talk to people', you will be pleased to encounter several phases with varied gameplay: platformer, shooter, enigma and some absurd motorcycle driving.\n\nDujanah will make you trip. It will take you on a psychedelic journey and its moments of pure delirium will be smashed away by cold and hard pieces of reality. It's a story of life and death, and, ultimately, of acceptation. \n\nThis game overflows with love.", "timestamp_created": 1507574634, "timestamp_updated": 1507574891, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545783", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35495032": {"recommendationid": "35495032", "author": {"steamid": "76561198042032665", "num_games_owned": 86, "num_reviews": 6, "playtime_forever": 219, "playtime_last_two_weeks": 0, "last_played": 1508317474}, "language": "english", "review": "Dujanah is one of the most emotional games I have played. Not necessarily in the sense that it inspired strong emotions (though it did that too, with complete ease), but in the sense that it is not ashamed of itself, and never tries to cut itself down or shortchange itself in the name of irony. \n\nIt is a game about a family in a world that is cruel and sometimes kind. Everything in it is lovingly rendered out of clay or VHS artifacts, with one of the best soundtracks in recent memory backing the whole thing.\n\nDon't be put off by its aesthetic or its sensibilities. It is, in my opinion, accessible to anyone who cares to play it and experience an absolutely magical experience.", "timestamp_created": 1507209589, "timestamp_updated": 1507209589, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.507042", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35494189": {"recommendationid": "35494189", "author": {"steamid": "76561198116024835", "num_games_owned": 454, "num_reviews": 27, "playtime_forever": 307, "playtime_last_two_weeks": 0, "last_played": 1507748584}, "language": "english", "review": "Another winner from Jack King-Spooner. An audio-visual treat. I found myself completely lost in the game world, exploring every nook and cranny. Gritty, philosophical, and importantly, fun to play - this game is a work of art!", "timestamp_created": 1507207052, "timestamp_updated": 1507207052, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.577155", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35484821": {"recommendationid": "35484821", "author": {"steamid": "76561197970729467", "num_games_owned": 226, "num_reviews": 3, "playtime_forever": 504, "playtime_last_two_weeks": 0, "last_played": 1510560380}, "language": "english", "review": "Only about 30 min in and this game has moved me more than most. This might actually be my first steam review... this singular vision of art and sound is a work of art worth experiencing for the price!", "timestamp_created": 1507171132, "timestamp_updated": 1507171132, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.507042", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35261413": {"recommendationid": "35261413", "author": {"steamid": "76561198015203588", "num_games_owned": 6192, "num_reviews": 1, "playtime_forever": 458, "playtime_last_two_weeks": 0, "last_played": 1507707168}, "language": "japanese", "review": "私は非英語圏の人間であり、不勉強でもあるので、\"Dujanah\"のストーリーを100%理解できたとは思えない。\nしかしこれは私にとって特別な作品なので、レビューを書くことにした。\nこれは理解が浅い人間が書くレビューなので、あまり参考にはならない。犬の寝言だと思ってほしい。\n\n開発者(Jack King-Spooner)の前作、\"[url=http://store.steampowered.com/app/365580/Beeswing/]Beeswing[/url]\"は、彼にとってとても重要な作品のように思えた。\nそれ以前の実験的な作品と比べると、たしかに商業作品寄りで、より多くの人にリーチできるポテンシャルがあった。\n\nでは今作はというと、\"Beeswing\"以前の作品を含めた、彼の集大成のように思える。\n随所に過去作の断片があるし、技術面でもこれまでの試みが存分に活かされている。\n多くの場合、集大成(あるいは続編)となるゲームは、とても保守的だ。開発者にとっては、それはセルフパロディになりがちで、自分自身の亡霊と向き合わざるを得ないのだから当然だ。\nにも関わらず\"Dujanah\"は、あまりにも尖った、実験的かつ挑戦的な作品になった。\nアーティストにとって、これはとても健全なことだと思うし、今後の可能性も大いに感じられた。\n\nこの作品で表面的に感じ取れるものは、可愛さとグロテスクさ、心地良い音楽と不快なノイズ、画期的な工夫と荒削りで生々しいギミック、古い神々と、未知なるもの。まともに見える人々、まともに見えない人々。\nこれらの相反する要素が、1+1=2になるのではなく、1と1のままゴロっと存在している。クッキリとハイコントラスト。水と油だ。\nそれでも、支離滅裂でバラバラな印象は無い。それはきっと、非常に個人的な体験と思想に基づく、確固たる核があるからだろう。それは明確に感じ取れる。\n\n底抜けに馬鹿馬鹿しい状況が、唐突にシリアスになる。眠っていた子が突然泣き叫びだすような、先の見えない不確かさ・不安定さ、あるいは緊張感がある。\nそれらは弱点にもなりうるが、\"Dujanah\"の場合は異なる。危ういバランスだが、どうやらそれは完璧に成立しており、この不確実性に導かれて、2-3時間この奇妙な世界をさまようことになる。\n実際のところ、私はたくさんのスクリーンショットを撮ったが、これが1つのゲームの世界だとは信じられない。\n\n長々と書いたが、トレーラーと、スクリーンショットを見たほうが話が早い！\n不気味、グロテスク、美しい、よく分からんが気になる…私が発する戯言よりも、その直感を信じたほうがいい。きっとそれはどれも正しい。\n\nでは私は何を言うべきか？ただ一言。[b]おすすめ！[/b]\n\n[h1]【本題】[/h1]\nこのゲームを遊んだら、クレイアニメ(あるいは、このゲームに含まれる、その他いろいろ)を自分でも作りたくなるかもしれない。ぜひチャレンジしてみよう。きっと楽しい。\n\n---\n\nI'm a non-English-speaking person and I can't say that I'm very diligent, so I don't think I could understand the story of this game 100%.\nBut this is a special to me, so I decided to write a review.\nThis is a review written by a shallow understanding person, so it will not be very helpful. It's just dog's somniloquy.\n\nThe previous work by the developer(Jack King-Spooner), \"[url=http://store.steampowered.com/app/365580/Beeswing/]Beeswing[/url]\", seemed to be a very important work for him.\nCompared to the previous experimental work, there was a potential to surely reach more people on the commercial piece side.\nThen, this work, Dujanah seems to be a culmination of his, including works before \"Beeswing\". There are fragments of past works everywhere, and the previous attempts have been fully utilized in terms of technology.\nIn many cases, games that can be called culmination (or sequel) are very conservative.\nFor game developers, it is natural that they tend to be self-parody, forced to face their own phantom.\nNevertheless, \"Dujanah\" has a completely unknown experience, it has become an experimental and challenging work.\nFor the artist, I think this is a very good thing and I felt greatly the future possibilities.\n\nWhat can be felt superficially with this work is, cute and grotesque, pleasant music and unpleasant noise, revolutionary ingenuity and rough cutting gimmicks, old gods, and unknown ones. People who looks decent, people who do not look decent.\nThese conflicting elements do not become 1+1=2, exist as 1 and 1, as it is.\nHigh contrast. Water and oil.\nBut, there is no incoherent and disjointed impression.\nThat is probably because there is a unshakable core based on a very personal experience and thought. It is clearly felt.\n\nA ridiculous situation suddenly becomes serious. There is uncertainty / instability or a sense of tension that the child who was asleep suddenly screams.\nIt can be a weak point, but in the case of Dujanah, it is different.\nIt's a fragile balance, but apparently it works perfectly, this uncertainty leads us to wander this weird world for 2-3 hours.\nActually, I took a lot of screenshots but I can't believe that this is the world of one game.\n\nI wrote too much. That makes it much easier to just watch the trailer and look screenshots!\nEerie, grotesque, beautiful, don't know well...It is better to believe that intuition than the scream that I emit. It is surely all right.\n\nSo what should I say? Just a word. [b]Recommended![/b]\n\n[h1]【main topic】[/h1]\nIf you play this game, you may want to make clay animation (or anything else included in this game) yourself. Let's challenge. Surely fun.", "timestamp_created": 1506603752, "timestamp_updated": 1506642983, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.566667", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "35224732": {"recommendationid": "35224732", "author": {"steamid": "76561198001876420", "num_games_owned": 865, "num_reviews": 180, "playtime_forever": 302, "playtime_last_two_weeks": 0, "last_played": 1506432607}, "language": "english", "review": "I'm always searching for new experiences, new stories and settings -- and of course new directions I haven't seen games go.\n\nDujanah was an impulse buy. As someone who who is a huge fan of Michel Gandry and messed around with stop animation in the past, the aesthetic of the game blew my mind. \n\nArt, animation, sound -- this game is the whole package. \n\nAlong the main story, a grindhouse like revenge story you run into many memorable characters that each have little backstories that range from charming and uplifting to downright disturbing realizations that some characters are stuck in a living hell. \n\nThere's also 6 arcade games within Dujanah that I would gladly have paid for as a standalone package.\n\nI was unfamiliar with Jack King-Spooner before Dujanah but now I have Beesway, Morrs and the other ich.io games to play through.\n\nSTRONGLY RECOMMENDED\n\n(The first ~10 mins of gameplay in a no commentary Quick Look)\n\nhttps://youtu.be/hrXS-ENo6lA", "timestamp_created": 1506441789, "timestamp_updated": 1506441789, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.508584", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35211434": {"recommendationid": "35211434", "author": {"steamid": "76561198042594619", "num_games_owned": 197, "num_reviews": 19, "playtime_forever": 191, "playtime_last_two_weeks": 0, "last_played": 1506377068}, "language": "english", "review": "Dujanah is an unsettling, gritty, and very real tale, and an experience I won't forget. Everything has been masterfully hand crafted, from every graphic and background being an artistic piece, to the sounds which are on another level. Some of the songs in this are amazing pieces of work and I will be listening to them long after my first playthrough.\n\nJack has really outdone himself with this one. Don't treat this like a regular 'game', but instead treat it like a window into another life.", "timestamp_created": 1506377324, "timestamp_updated": 1506377324, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.569367", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35199052": {"recommendationid": "35199052", "author": {"steamid": "76561197984030647", "num_games_owned": 191, "num_reviews": 2, "playtime_forever": 181, "playtime_last_two_weeks": 0, "last_played": 1506150056}, "language": "english", "review": "Hit me real good, right in the catharsis.", "timestamp_created": 1506330194, "timestamp_updated": 1506330194, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.484425", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35186589": {"recommendationid": "35186589", "author": {"steamid": "76561198007500624", "num_games_owned": 292, "num_reviews": 9, "playtime_forever": 227, "playtime_last_two_weeks": 0, "last_played": 1506271890}, "language": "english", "review": "A strange and thoughtful experience that doesn't directly explain what it's about but allows the user to interpret meaning themselves. With truly unique music and visuals Dujanah presents something you won't find anywhere else.\n\nIf you enjoy contemplating themes and motivations, and would like to experience a game that does not conform to expectations then I highly recommend.", "timestamp_created": 1506274296, "timestamp_updated": 1506274296, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.516129", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35181783": {"recommendationid": "35181783", "author": {"steamid": "76561198025815376", "num_games_owned": 148, "num_reviews": 4, "playtime_forever": 134, "playtime_last_two_weeks": 0, "last_played": 1506376271}, "language": "english", "review": "An incredible experience through and through.\n\nA hazy fever dream of a game that subverts your expectations in every nook and cranny you explore.  Lucid scenes ranging from hilarious to incredibly dark come at you at rapid fire pace in each area and you will find yourself trying to find every secret that developer Jack King-Spooner has hidden.\n\nThe art direction and music compliment each other so well it is easy to find yourself lost in the world of Dujanah.  Stop-motion mechs, surreal people made of imperfect clay, sprites of soldiers that seem to be more like cut-outs than actual people-- The list goes on and on.  It's incredible taking the time to look at each area and NPC's unique designs and knowing each was hand-crafted by a single developer with a passionate desire to tell this story.  A true auteur of game development.\n\nIn my Top 5 of 2017.  \nPlease buy this game.  \nPlease follow Jack King-Spooner for future releases.  \nI know I will be waiting for whatever he has in store for us next time.\n\n9 / 10", "timestamp_created": 1506261932, "timestamp_updated": 1506261932, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.560878", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35145762": {"recommendationid": "35145762", "author": {"steamid": "76561198028054650", "num_games_owned": 135, "num_reviews": 5, "playtime_forever": 295, "playtime_last_two_weeks": 0, "last_played": 1506144265}, "language": "english", "review": "A perfect storm of art, philosophy, and game.", "timestamp_created": 1506148995, "timestamp_updated": 1506148995, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.507042", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35140879": {"recommendationid": "35140879", "author": {"steamid": "76561198006068964", "num_games_owned": 1401, "num_reviews": 53, "playtime_forever": 129, "playtime_last_two_weeks": 0, "last_played": 1506126703}, "language": "english", "review": "I can safely tell you that Dujanah is worth your time. It's a very, very strange game with a unique clay-mation artstyle and a great soundtrack. There's a whole world to explore, games to play and stories to listen to, or read. Aside from the rather dark undertones, there are some spontaneous bursts of humor throughout the dialogue, but mostly, the story itself is rather sad. One thing's for certain, this is the most original game I've played this year, as it's solely developed by one person (along with additional musical talent throughout), and as such, so much care and attention to detail went into it. It defines the weirder more obscure side of video games, and hopefully there will be more of these kind of games from other developers, and especially this guy.", "timestamp_created": 1506127623, "timestamp_updated": 1506127969, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.643230", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35127964": {"recommendationid": "35127964", "author": {"steamid": "76561197960619098", "num_games_owned": 781, "num_reviews": 3, "playtime_forever": 242, "playtime_last_two_weeks": 0, "last_played": 1506087365}, "language": "english", "review": "Shifting sands, shifting themes, shifting thoughts. If you gave even a minor damn about Beeswing, please check this. The boy's dream is my favorite, though I need to go back and listen to the music some more.", "timestamp_created": 1506087316, "timestamp_updated": 1506087316, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.527736", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35112942": {"recommendationid": "35112942", "author": {"steamid": "76561198019651249", "num_games_owned": 1061, "num_reviews": 74, "playtime_forever": 206, "playtime_last_two_weeks": 0, "last_played": 1505983780}, "language": "english", "review": "A compelling and thoughtful journey full of unexpected twists and turns. \n\nWait, that sounds cliche.\n\nBut really: You won't see any of it coming, and this is exactly the way it ought to be.\n\nAlso, the music kicks ass, and I often turn the music off in games. It would be unthinkable here.\n\nHighly, highly recommended.", "timestamp_created": 1506024597, "timestamp_updated": 1506024676, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.556770", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35102321": {"recommendationid": "35102321", "author": {"steamid": "76561198005988410", "num_games_owned": 609, "num_reviews": 170, "playtime_forever": 885, "playtime_last_two_weeks": 0, "last_played": 1505993332}, "language": "english", "review": "く__,.ヘヽ.　　　　/　,ー､ 〉\n　　　　　＼ ', !-─‐-i　/　/´\n　　　 　 ／｀ｰ'　　　 L/／｀ヽ､\n　　 　 /　 ／,　 /|　 ,　 ,　　　 ',\n　　　ｲ 　/ /-‐/　ｉ　L_ ﾊ ヽ!　 i\n　　　 ﾚ ﾍ 7ｲ｀ﾄ　 ﾚ'ｧ-ﾄ､!ハ|　 |\n　　　　 !,/7 '0'　　 ´0iソ| 　 |　　　\n　　　　 |.从\"　　_　　 ,,,, / |./ 　 |\n　　　　 ﾚ'| i＞.､,,__　_,.イ / 　.i 　|\n　　　　　 ﾚ'| | / k_７_/ﾚ'ヽ,　ﾊ.　|\n　　　　　　 | |/i 〈|/　 i　,.ﾍ |　i　|\n　　　　　　.|/ /　ｉ： 　 ﾍ!　　＼　|\n　　　 　 　 kヽ>､ﾊ 　 _,.ﾍ､ 　 /､!\n　　　　　　 !'〈//｀Ｔ´', ＼ ｀'7'ｰr'\n　　　　　　 ﾚ'ヽL__|___i,___,ンﾚ|ノ\n　　　　　 　　　ﾄ-,/　|___./\n　　　　　 　　　'ｰ'　　!_,.:", "timestamp_created": 1505993365, "timestamp_updated": 1505993365, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.269298", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35095462": {"recommendationid": "35095462", "author": {"steamid": "76561198084867137", "num_games_owned": 417, "num_reviews": 18, "playtime_forever": 72, "playtime_last_two_weeks": 0, "last_played": 1505926250}, "language": "english", "review": "This game is full of stories and questions, loved it. Dreamlike visuals and music, you never know what you're going to see through the next door.", "timestamp_created": 1505958888, "timestamp_updated": 1505958888, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.534945", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35087223": {"recommendationid": "35087223", "author": {"steamid": "76561198070798726", "num_games_owned": 118, "num_reviews": 3, "playtime_forever": 209, "playtime_last_two_weeks": 0, "last_played": 1505922420}, "language": "english", "review": "Dujanah is a game about the exploration of the mind of a woman who lost her loved ones. It is experimental and philosophical, funny and kind. The fantastic music is a soothing layer to the overall strange atmosphere. And the clay art style is original and fitting.\nI would really advise you to try this one out.", "timestamp_created": 1505923890, "timestamp_updated": 1505923890, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.527882", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35086556": {"recommendationid": "35086556", "author": {"steamid": "76561198092076955", "num_games_owned": 187, "num_reviews": 3, "playtime_forever": 49, "playtime_last_two_weeks": 0, "last_played": 1505924124}, "language": "english", "review": "I did not play too much, but my fisrt impression is JUST GREAT!\nMusic, design, storytelling and everything is wonderful!\nThe language barrier does not allow me to say something more specific, but i hope you got what i meant\nThank you very much for this game, Jack\n", "timestamp_created": 1505921746, "timestamp_updated": 1505921746, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.527882", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35080640": {"recommendationid": "35080640", "author": {"steamid": "76561198043456771", "num_games_owned": 1056, "num_reviews": 94, "playtime_forever": 105, "playtime_last_two_weeks": 0, "last_played": 1509800586}, "language": "english", "review": "I don't know how to describe this game, but it's really good so far. It's completely unique and full of love.", "timestamp_created": 1505899973, "timestamp_updated": 1505899973, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.567428", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35076298": {"recommendationid": "35076298", "author": {"steamid": "76561198045743398", "num_games_owned": 16, "num_reviews": 2, "playtime_forever": 279, "playtime_last_two_weeks": 0, "last_played": 1509446041}, "language": "english", "review": "Very strange, very stylish and oozes with irony and atmosphere of the Interzone from each seam. It's a dense author's schizo-arthouse from the world of games. From the very beginning Dujanah throws the fourth wall in the flickering-glitchy-pixel dust and starts deliberately clumsy \"belly dance\" on it. Aand, I think, Colonel Dajjal is now my favorite character from the video game.\nHighly recommend.", "timestamp_created": 1505875332, "timestamp_updated": 1505875332, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.576592", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35071129": {"recommendationid": "35071129", "author": {"steamid": "76561198012649770", "num_games_owned": 402, "num_reviews": 2, "playtime_forever": 10, "playtime_last_two_weeks": 0, "last_played": 1505849757}, "language": "english", "review": "everything jack king-spooner makes is wonderful. the visuals and soundtrack for dujanah are some of the best he's ever done.", "timestamp_created": 1505849982, "timestamp_updated": 1505849982, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.497299", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "35069791": {"recommendationid": "35069791", "author": {"steamid": "76561198364457274", "num_games_owned": 160, "num_reviews": 1, "playtime_forever": 1206, "playtime_last_two_weeks": 0, "last_played": 1512682597}, "language": "english", "review": "i think this is my first review of any game and want to say\ni only played a few minutes but love it already\n\n[spoiler] has anyone else got the video on the beginning of the game where the creator says it is about catharsis ?\t[/spoiler]", "timestamp_created": 1505845012, "timestamp_updated": 1505845012, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.495878", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 7, "review_score_desc": "Positive", "total_positive": 34, "total_negative": 0, "total_reviews": 34}}
