{"reviews": {"38269369": {"recommendationid": "38269369", "author": {"steamid": "76561198198814899", "num_games_owned": 213, "num_reviews": 8, "playtime_forever": 262, "playtime_last_two_weeks": 0, "last_played": 1512008584}, "language": "english", "review": "I love this game it has a very interesting art style and indepth story line that kept me interested for hours to come!", "timestamp_created": 1513126643, "timestamp_updated": 1513126643, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.478723", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37862524": {"recommendationid": "37862524", "author": {"steamid": "76561198365423651", "num_games_owned": 21, "num_reviews": 1, "playtime_forever": 242, "playtime_last_two_weeks": 0, "last_played": 1511901244}, "language": "english", "review": "Brilliant Shadows follows Ash after a ritual gives her an ambiguous result with far-reaching consequences. Her future, and eventually even her safety, are no longer guaranteed. Who, or what, is she bonded to? What does it mean for her and those around her?\n\nThe Good:\n* First things first. This game is absolutely gorgeous. It has some of the best art of any visual novel I've played, done in a unique and consistent style that really meshes with the story.\n* The worldbuilding happens naturally, over the course of the story, and is very solid.\n* Ash's story is easy to get invested in, and it's impossible not to care about her.\n* The soundtrack and sound effects are great, and pulled me in even more.\n* The game is fully voice-acted, and the casting was very well done. I loved Ash's voice.\n* The game gives feedback on choices that makes it easy to tell which ending you're moving toward.\n* The game has some good representation. For example, Ash is gay, and it's important to the story without being the primary source of conflict.\n* The game rewards multiple playthroughs by having things that are only meaningful with information from late in the game.\n\nThe Not-So-Good:\n* While some choices have far-reaching consequences, others only change a few lines of dialogue and are quickly forgotten as the story gets back to its mostly-linear path.\n* The good ending and the neutral ending are a little too similar.\n* There is no CG gallery, which is a shame because of how beautiful the CGs are.\n* There's a little bit at the end of the game that helps set up the series but feels very out-of-place in the story of this game.\n* The worldbuilding can occasionally be a little fuzzy, especially the paladin/necromancer binary when confronted with later information.\n\nI really loved this game. It wasn't without its issues, but they don't mean much next to all of the things the game did right. I really resonated with Ash, and I'm looking forward to getting more of her story in the sequel.", "timestamp_created": 1511858343, "timestamp_updated": 1511858343, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36985582": {"recommendationid": "36985582", "author": {"steamid": "76561198278245910", "num_games_owned": 153, "num_reviews": 5, "playtime_forever": 492, "playtime_last_two_weeks": 0, "last_played": 1506947829}, "language": "schinese", "review": "就个人感觉而言，这部视觉小说应该是披着西方玄幻外衣的主角以及身边小伙伴探索真爱和性向的青春小说，和预想中的内容不大相同，不过这也可能是因为是第一部的原因…毕竟一个系列的第一部故事一般会用来介绍主要人物，就免不了要有人物之间的感情纠纷【不。\n老实说，即使中间穿插很多表现百合主角孤独寂寞片段，故事的主线还是保持的不错，也一直有铺悬疑点，人物的性格也很鲜明，这也是为什不喜欢感情线描写的我最后还是玩完了……但是就是离好故事差了一些。我认为问题主要是出现在对世界观的描述比较泛善可陈。人物感情也不够细腻，有点浮于表面 [spoiler]尤其是Prudence！！自己最好的基友原来真的是姬友还喜欢自己！！！难道一般人不会被震惊好久不能恢复吗！！带着愧疚面对姬友觉得很尴尬之类的！！为什么一下子就恢复了！！我明白这是东西方文化的差别，但是还是觉得非常可惜的…白白放过了一个可以深挖的虐点。[/spoiler] \n总体来讲，无功无过的故事+很不错的配音+特点十足【虽然会时不时崩坏】的美术，还是对得起它的价格的。\nps. 靠近结局部分出现的蜥蜴让我眼前一亮……决定为了可爱的蜥蜴和已经埋下伏笔肯定会展开的世界观感受一下第二部！", "timestamp_created": 1511427011, "timestamp_updated": 1511427011, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36764593": {"recommendationid": "36764593", "author": {"steamid": "76561198067613082", "num_games_owned": 137, "num_reviews": 1, "playtime_forever": 468, "playtime_last_two_weeks": 0, "last_played": 1506813861}, "language": "german", "review": "Ein kleines und unerwartet feines Spiel. Zu Beginn schreckte mich der Grafikstil etwas ab - was sich jedoch im Laufe der Story schnell ins Gegenteil gekehrt hat.\n\nFür mich inzwischen ein Kleinod das ich nicht mehr missen möchte.", "timestamp_created": 1511379999, "timestamp_updated": 1511379999, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36520143": {"recommendationid": "36520143", "author": {"steamid": "76561198019363416", "num_games_owned": 225, "num_reviews": 6, "playtime_forever": 109, "playtime_last_two_weeks": 0, "last_played": 1510702469}, "language": "english", "review": "A very pleasant surprise!\n\nBrilliant Shadows is a stylishly presented visual novel, with its own art style that isn't \"just the usual anime\". Characters are distinct, sprites are large and detailed, and it all fits together nicely.  It has a diverse cast in terms of race, sexuality, etc, but it doesn't fall into the trap of letting these attributes define the characters either - instead they are simply aspects of the characters which are there.\n\nCharacters are voice acted throughout, even minor characters, the writing's extremely readable with some humour, and there're a goodly number of choices built in throughout too.\n\nAnd all this for a mere £5.  No, it's not perfect, there're the occasional minor typos here and there, or a line where the VA voiced it slightly differently to the written word, but the downsides are minor and there's so much good here that honestly, especially at this price point, it's an absolute steal.\n\nAnd the good news is that if you DO enjoy this, there's a sequel (and a third on the way) with the same characters that continues their story (but this one works perfectly well as a self contained tale).\n\nRecommended.\n\n(disregard the play time shown for me - I mostly read on a Surface tablet while I commute, which means it's offline, which means Steam doesn't always see all the hours I clock up)", "timestamp_created": 1510697749, "timestamp_updated": 1510697749, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.536517", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36386554": {"recommendationid": "36386554", "author": {"steamid": "76561198041612398", "num_games_owned": 301, "num_reviews": 5, "playtime_forever": 742, "playtime_last_two_weeks": 0, "last_played": 1511919179}, "language": "english", "review": "I have to say that when I bought this game it was on a whim and I didn't think I was going to get much out of it at the time. So I went in without much in the way of expectations. What I got was much better than I paid for. Full voice acting and while it wasn't the best quality (the mics popped a few times) overall I was quite impressed, But what really got me? The characters and the story telling.\n\nThese two together can make or break a VN and they were pulled off so well in this. I'm not saying you will like every character in this game. Not all are designed to BE liked. But they are all great. and the STORY! ugh, I ran through this game and all it's endings in a matter of hours simply due to how absorbed in it I was. and there's a part 2! So excited.", "timestamp_created": 1510189260, "timestamp_updated": 1510189260, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.521277", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35733197": {"recommendationid": "35733197", "author": {"steamid": "76561198055493522", "num_games_owned": 66, "num_reviews": 2, "playtime_forever": 324, "playtime_last_two_weeks": 0, "last_played": 1512336757}, "language": "english", "review": "I enjoyed the story very much. The characters were well written and developed. I am looking forward to the sequel and recommend this game to anyone who enjoys a good fantasy story, strong female lead character and some well written humour.\n\nThe only negative I can say about this is about 2/3's of the way through the story there was a little discontinuity. It was slight and didn't take away from the story and went away shortly after it came up.\n\nI'm looking forward to playing the sequel, and hopefuilly sequels.", "timestamp_created": 1508028316, "timestamp_updated": 1511833295, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.521277", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35644045": {"recommendationid": "35644045", "author": {"steamid": "76561198081245035", "num_games_owned": 117, "num_reviews": 5, "playtime_forever": 690, "playtime_last_two_weeks": 0, "last_played": 1506811843}, "language": "english", "review": "The art is beautiful, the story and characters intriguing and on top of it all, the protagonist is a lesbian! :D It's hard to come by lgbt+ games with good, solid stories, but this one is amazing. And the voices are nicely done. 10/10, will recommend to a lot of people.", "timestamp_created": 1507746223, "timestamp_updated": 1507746223, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35508178": {"recommendationid": "35508178", "author": {"steamid": "76561197982625233", "num_games_owned": 245, "num_reviews": 14, "playtime_forever": 428, "playtime_last_two_weeks": 0, "last_played": 1506086839}, "language": "english", "review": "My abosolute FAVORITE visual novel; and I have read more than a few.  There are choices aplenty, and while all of them may not be catastophically important, they FEEL that way when you are making them; and, to me at least, that is the important part.\n\nThe story arc is very well crafted and the character work is top notch imho.  I really does remind me of session I ran as a Game Master back in my pen and paper roleplaying days.  Meaning, the banter and relationships between all of the participants feels ALIVE like there are real people behind the chracter \"sketches\".\n\nThe fact that this visual novel is completely voice acted is just extra icing on the cake.\n\nIf you like original fantasy based visual novels, and are like or are at least open to LGBTQ romance, this is the novel for you!  Do yoursefl a favor, load it up, and enjoy several evenings of finely crafted entertainment!", "timestamp_created": 1507258103, "timestamp_updated": 1507258103, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35461582": {"recommendationid": "35461582", "author": {"steamid": "76561197998407221", "num_games_owned": 282, "num_reviews": 38, "playtime_forever": 283, "playtime_last_two_weeks": 0, "last_played": 1467936365}, "language": "english", "review": "While the writing and the lore remind me of teen fantasy novellas, with an occasional mild sexual reference and some SJW-style diversity sprinkled all around (nothing too bothersome or pace-breaking), it has a nice hook. It kept me reading until i finished it at 5am on a weekday.", "timestamp_created": 1507086127, "timestamp_updated": 1507086127, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.472985", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35199987": {"recommendationid": "35199987", "author": {"steamid": "76561198067189801", "num_games_owned": 284, "num_reviews": 96, "playtime_forever": 631, "playtime_last_two_weeks": 0, "last_played": 1506333947}, "language": "english", "review": "Excellent visual novel. \n\nPros:\n- Beautiful artwork\n- Decent writing\n- Interesting story and characters\n- LGBTQ inclusivity\n- Racial inclusivity\n- Good amount of choices and endings\n\nCons:\n- (Spoiler-ish) The good ending was kind of meh for me. Like, Ash (the protagonist) and Terra [spoiler]kiss at the end[/spoiler] and that seems a bit rushed. I know that there's reasons for them to feel connected in the story, but the ending felt empty because of lack of development between those two characters.\n\nI definitely recommend this to VN fans and those who enjoy fantasy/romance.", "timestamp_created": 1506335052, "timestamp_updated": 1506335052, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.697827", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33811235": {"recommendationid": "33811235", "author": {"steamid": "76561198251084562", "num_games_owned": 303, "num_reviews": 42, "playtime_forever": 252, "playtime_last_two_weeks": 0, "last_played": 1501083265}, "language": "english", "review": "I loved its story and I wasn't expecting the voice acting. It was good acting. I had so much fun with the story and the ideas it contains and the people were so lovey and I would totally recomend this to anyone who isn't homophobic. The art is beautiful as well and I love the side stories of lovers besides the main character's stuff. I can't wait for chapter two but I doubt it will actually come so I might have to write my own version of this story.", "timestamp_created": 1501083503, "timestamp_updated": 1501083503, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.478723", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33397255": {"recommendationid": "33397255", "author": {"steamid": "76561198124913490", "num_games_owned": 78, "num_reviews": 6, "playtime_forever": 381, "playtime_last_two_weeks": 0, "last_played": 1499586741}, "language": "english", "review": "After playing through for the first time in a while, and checking out the different endings I am not only overly pleased with the writing and humor of the creators themselves, but the talent of the artist and VA's that all contribted to this story. I'm ecceedingly glad I purchased this and will continue to follow the story!", "timestamp_created": 1499587119, "timestamp_updated": 1499587119, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33308351": {"recommendationid": "33308351", "author": {"steamid": "76561197970784893", "num_games_owned": 516, "num_reviews": 27, "playtime_forever": 268, "playtime_last_two_weeks": 0, "last_played": 1499292089}, "language": "english", "review": "Brilliant Shadows is a Visual Novel set in a medievalesque fantasy setting. Spurting an intellectual vacuum for drama to unfold. \n\nThe game employs beautiful artwork, both colorfully vibrant and more dark and ominous when the narrative dictates it, moreover this is also skillfully portrayed in the different emotional states the characters go through. The soundscape and voice acting also lends its own share of magic to produce an enthralling narrative. The main cast is well fleshed out and stroke me as adequately multidimensional. There are three different endings to the game depending on what choices you pick throughout the game, they seem to control the protagonists outlook on life, if she'll turn out good or \"evil\". \n  \nThere's a free prequel Embers of Magic on steam that gives a short but well presented idea of what to expect of this VN, even if it's tone is more lighthearted.\n    \nThis VN doesn't have an auto-play function, apparently due to engine limitation, which almost made me put the prequel aside, I am glad I didn't. In the long run it didn't annoy me too much as every character was voiced in both the prequel and in this VN.", "timestamp_created": 1499340081, "timestamp_updated": 1499340081, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.609268", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33211332": {"recommendationid": "33211332", "author": {"steamid": "76561198024691744", "num_games_owned": 23, "num_reviews": 1, "playtime_forever": 311, "playtime_last_two_weeks": 0, "last_played": 1499190706}, "language": "english", "review": "Maybe it was just me, but I was looking for some sinister duality to Ash or the idea that my actions somehow affected the storyline. This isn't immediately apparent though I've only done one playthrough of the game with the \"Blinded by the Light\" ending. The art is beautiful and the voice acting very well done, but the way characters and plot points line up the the end felt too easy or convinient at times. Not to mention the minor oversights every once in a while of characters changing their clothes with their expressions in between panels. Or voice overs not matching texts (like with Ashley/Swan). I fully intend to give it another try and choosing the \"I want to be a deliberately paranoid, jealous asshole\" options just to see if it balances out or trully makes a difference in the overall game play.\n\n\nEdit: So the Light and Dark endings are very different, and I appreciate that though I'm not sure the dialogue choices I made along the way actually justified the significant split. However the Balanced ending is very similar to the light ending, so that's somewhat disappointing.", "timestamp_created": 1499134868, "timestamp_updated": 1499190820, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.510574", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31728258": {"recommendationid": "31728258", "author": {"steamid": "76561198054815552", "num_games_owned": 103, "num_reviews": 4, "playtime_forever": 155, "playtime_last_two_weeks": 0, "last_played": 1482023476}, "language": "english", "review": "I can't wait to purchase the next part. At full price.", "timestamp_created": 1494693509, "timestamp_updated": 1494693509, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.468765", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31707043": {"recommendationid": "31707043", "author": {"steamid": "76561198128109892", "num_games_owned": 65, "num_reviews": 1, "playtime_forever": 1337, "playtime_last_two_weeks": 0, "last_played": 1494611978}, "language": "english", "review": "This game is great. It's actually the first visual novel I ever purchased, and I didn't know if I liked this style of game so it took me well over a year to actually play more than the first five minutes but I am so glad I came back to it. The characters are wonderful, the story is engaging and definitely builds tension and interest well. The art is gorgeous. I can't comment on the voice acting/music since I was secretly playing it at work and therefore had it muted, but I'm sure they're also good, given the quality of everything else in the game. \n\nI've only gotten one ending and am eagerly looking forward to the others. I've also purchased this as a gift for a friend and am hopeful that the sequel will be out soon. Highly recommended for anyone who loves fantasy, visual novels, and very well done queer protagonists.", "timestamp_created": 1494612379, "timestamp_updated": 1494612380, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.512012", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31054810": {"recommendationid": "31054810", "author": {"steamid": "76561198055475839", "num_games_owned": 53, "num_reviews": 5, "playtime_forever": 163, "playtime_last_two_weeks": 0, "last_played": 1491029630}, "language": "english", "review": "MAJOR SPOILER WARNING\n\nThis game is actually pretty well made overall, with good voices and an okay storyline. The characters are also pretty cute and memorable. \n\nI wanted to like it so badly! Sadly it has one huge and super irritating flaw - even if there are awesome LGBT characters, they all seem to take back seat to the hetero romance! I wouldn't be so irritated if the plot itself weren't based heavily on romantic entanglements in general. But [spoiler]the lead doesn't even get her girl[/spoiler] until the last handful of panels, after I had to sit through the entire game's worth of [spoiler]\"my first straight girl crush\"[/spoiler] angst and \"look at how good this straight couple is for each other aren't they cute\". Don't even get me started on the fact [spoiler]the villains are the only gay couple that actually gets any screen time[/spoiler]. Literally why??\n\nSeriously, if you're gonna [spoiler]make the protagonist gay[/spoiler] in a romance game, actually commit to them being center stage. Geeze.", "timestamp_created": 1491804322, "timestamp_updated": 1491804634, "voted_up": false, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.416718", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30994261": {"recommendationid": "30994261", "author": {"steamid": "76561198351028067", "num_games_owned": 10, "num_reviews": 3, "playtime_forever": 217, "playtime_last_two_weeks": 0, "last_played": 1499088698}, "language": "english", "review": "Bought this game as it looked gorgeous and the summary was very unique! I wasn't dissapointed one bit!! I didn't really look into into as I didn't want any spoilers for my first play through and so I was surprised that Ash was a lesbian (didn't see that coming). Even if I personally prefer guys the game was still 100% enjoyable and I would recommend it no matter your sexuality! In fact the story contains a cast of diverse characters in terms of both color and sexuality! The relationships between the characters are all portrayed very humanly and it is such a relatable and enjoyable story. All the characters are great and lovable, I am honestly so glad this game exists!!! Ash is such a strong female model with depth and character, honestly I am in love!!  On top of that the game deals with issues such as romantic rejection especially between people of different sexuality which is not a commonly explored topic in the genre. I am hooked and can't wait for the sequel, Pale Spectrum which is in the works. I have become such a big fan so quickly <3", "timestamp_created": 1491559717, "timestamp_updated": 1491559717, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30014694": {"recommendationid": "30014694", "author": {"steamid": "76561198044566427", "num_games_owned": 116, "num_reviews": 25, "playtime_forever": 200, "playtime_last_two_weeks": 0, "last_played": 1488258459}, "language": "english", "review": "Mostly an interesting visual novel. A bit rough around the edges, and some things happen too quickly or aren't explained very well, but it was a nice change from the bland cookie cutter stories most VNs seem to follow.", "timestamp_created": 1487440141, "timestamp_updated": 1487440141, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29636689": {"recommendationid": "29636689", "author": {"steamid": "76561198041845674", "num_games_owned": 256, "num_reviews": 6, "playtime_forever": 86, "playtime_last_two_weeks": 0, "last_played": 1510721474}, "language": "english", "review": "yes", "timestamp_created": 1485985071, "timestamp_updated": 1485985071, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.471014", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29414855": {"recommendationid": "29414855", "author": {"steamid": "76561197972209383", "num_games_owned": 311, "num_reviews": 5, "playtime_forever": 181, "playtime_last_two_weeks": 0, "last_played": 1485061368}, "language": "english", "review": "Really several tiers above the average Visual Novel. This was actually one of the first VNs where I cared more about what would happen next then what ending I wanted to get, which I was not expecting at all.\n\nI feel it's probably good to get all the cons out of the way first, because there aren't too many, and they are balanced out well.\nFirst off, the voice acting and diologue sometimes seem a little bit amateurish. It doesn't come up too often, but occasionally you get the idea that these people have not done this before, and aren't too settled in it.\nSecondly, there are some times when you really start to feel the exposition heavily. This is mostly when characters are talking about how sexuality is viewed in the world, and they are speaking more towards the reader than what someone would naturally say in the situation.\nAnd finally, there are one or two choices where it's not entirely clear what you are selecting. Nothing too drastic, or that would get you a suprise bad ending, but I did get surprised at what happened from a few choices.\n\nThose issues, however, are pretty few and far between. And never so drastic to break the narrative, which is really uite good.\nThe plot is first class. Period. This is a well realized world, with a lot of things left unexplained that make it feel more alive. You can tell a lot of thought went in to all of it, and it pays off. The story going on in this world, too, has a couple of good twists, but also the meat to keep you going between them. The twists are also payed off quickly enough that you don't feel like anyone is particularly stupid. And, despite being the first part, it has a fairly satisfying ending, without any cliffhangers stapled on to the end. \nThe characters are also quite good, and all the mains seem to have greater depth than I normally expect from this type of game. They also deal with some issues that are rarely addressed by any game, which I won't spoil, but really struck me as things that real people deal with more often than is represented.\nThe art is great. Pretty much perfect. Each character has many expressions that fit whatever is going on at the time and nothing is reapeated enough to seem lazy or anything. It also just looks gorgeous. \nAnd finally, the voice acting. Yes, I mentioned there are some less than great moments, but when it is good, it is really really good. The voice actors definately care about their characters and care about doing well, which is missing from some games with much bigger budgets. Nobody is bored and nobody is phoning it in, and everybody gives the emotional stakes they need to. Also, The mains have very nice voices to hear. \n\nAll in all, a great VN, not exactly the Dating sim I had expected, but it fulfilled that need and so much more. \n\nAlso, blooper reel at the end, very good!", "timestamp_created": 1485065852, "timestamp_updated": 1500709676, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.505114", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29402912": {"recommendationid": "29402912", "author": {"steamid": "76561198042228090", "num_games_owned": 831, "num_reviews": 191, "playtime_forever": 144, "playtime_last_two_weeks": 0, "last_played": 1467385554}, "language": "english", "review": "Brilliant Shadows is a fantastic VN with an intriguing plot, a superb cast of characters, great art, and solid voice acting. Definitely one of the best VNs currently on Steam.", "timestamp_created": 1485019504, "timestamp_updated": 1485019504, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29348629": {"recommendationid": "29348629", "author": {"steamid": "76561198014433027", "num_games_owned": 511, "num_reviews": 11, "playtime_forever": 236, "playtime_last_two_weeks": 0, "last_played": 1484996287}, "language": "english", "review": "Great little visual novel, good voice acting and interesting story.\n\nDon't get confused by title, it IS full story, not just part one and it has satisfying ending", "timestamp_created": 1484794181, "timestamp_updated": 1484794181, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28912962": {"recommendationid": "28912962", "author": {"steamid": "76561198161025311", "num_games_owned": 118, "num_reviews": 8, "playtime_forever": 492, "playtime_last_two_weeks": 0, "last_played": 1486467340}, "language": "english", "review": "Brilliant Shadows is a lovely, colorful visual novel, with its own unique fantasy setting and lore of paladins, necromancers, grey mages, and the like. If you're like me, a devoted fan of anything fantasy-related [i]and[/i] you're currently looking for a refreshing, non-anime visual novel, then Brilliant Shadows is an audiovisual treat you will surely enjoy.\n\n[h1]Pros:[/h1]\n[list][*] One of the few VNs I have played with voice acting, and it certainly did it right with an array of skilled VAs at that. They added more personality to the already well-developed characters.\n[*] The art is just so beautiful and amusing. Certain scenes make you just want to step back and stare. The vivid colors breathe life into the already compelling story.\n[*] The setting, the characters, as well as the fantasy world they have built and introduced is more than enough for you to take in in a single chapter visual novel.\n[*] I greatly welcomed the character diversity, with its mild LGBT themes. It made every character special, and even relatable, in their own way.\n[*] Provides you more than enough hours to complete all possible endings and read through all of the dialogues.\n[*] With all of the rich content (and more!) packaged into one visual novel, the full price is well worth it. Kind of makes me guilty that I got this on sale.[/list]\n\n[h1]Cons:[/h1]\n[list][*] The art in some of the scenes were too good, I kind of wished they would be 'unlocked' and easily viewed after reading them.\n[*] Related to my first con, I personally found the text size too big and awkward, as they covered some of the art.\n[*] Some of the choices feel too limited, and have little impact on the ending you will get.\n[*] Small typos and differences in text and voice acted lines.[/list]\n\n[h1]Overall Rating:[/h1]\n8.5/10 \n\n[i]Thank you, Ithaqa Labs, for creating such a wonderful visual novel! I shall be eagerly awaiting chapter two.[/i]", "timestamp_created": 1483297626, "timestamp_updated": 1483297626, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.661235", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28883256": {"recommendationid": "28883256", "author": {"steamid": "76561198028367011", "num_games_owned": 127, "num_reviews": 3, "playtime_forever": 213, "playtime_last_two_weeks": 0, "last_played": 1483219868}, "language": "english", "review": "Fun, intresting rpg.  The art was beautiful and the writing was ok though it definitely got much better as the game progressed.   I wish there was more interaction besides a few simple choices but the storyline was interesting enough to keep me engaged. Most important to note is the lesbian protagonist and pretty diverse set of main characters.\n\nI'm excited for the 2nd installation and hope there's more dependent on player choices.  \n\n", "timestamp_created": 1483221854, "timestamp_updated": 1483221854, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28474965": {"recommendationid": "28474965", "author": {"steamid": "76561198044926485", "num_games_owned": 386, "num_reviews": 16, "playtime_forever": 330, "playtime_last_two_weeks": 0, "last_played": 1482173935}, "language": "english", "review": "10/10. Kind of like an audio-book, and a really good one, at that. Fantastic endings, characters, music, and art. An excellet indie title; I have sent it to all of my coolest friends.", "timestamp_created": 1482181139, "timestamp_updated": 1482181640, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502262", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28226627": {"recommendationid": "28226627", "author": {"steamid": "76561197992329701", "num_games_owned": 830, "num_reviews": 45, "playtime_forever": 157, "playtime_last_two_weeks": 0, "last_played": 1477723827}, "language": "english", "review": "Pretty cool story with (mostly) good voice acting. Despite the \"Part One\" in the title it has proper (albeit very cheesy) endings, although they feel quite rushed.  The LGBT themes are a bit too much on the nose but not overly so.", "timestamp_created": 1481061692, "timestamp_updated": 1481061692, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28107234": {"recommendationid": "28107234", "author": {"steamid": "76561198025198450", "num_games_owned": 1052, "num_reviews": 7, "playtime_forever": 318, "playtime_last_two_weeks": 0, "last_played": 1480538068}, "language": "english", "review": "Brilliant Shadows has a compelling story, good world building and a great cast of characters.\nWhile I don't always feel that way about voice acting in games, it was done well here and contributes a lot to the immersive experience.\nReally enjoyable and I'm looking forward to the sequel.", "timestamp_created": 1480540886, "timestamp_updated": 1480541293, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28105763": {"recommendationid": "28105763", "author": {"steamid": "76561198026048725", "num_games_owned": 169, "num_reviews": 10, "playtime_forever": 246, "playtime_last_two_weeks": 0, "last_played": 1480050656}, "language": "english", "review": "It was about 1am. I figured I would just check out the beginning and go to bed. Next thing I know it's 5am and I'm still awake, grinning like a dork because I just blazed through the kind of story I've really wanted to see.\n\nAsh's personal struggles struck a lot of familiar chords and most of the characters were interesting enough to keep my attention throughout the story. Would recommend for people who want magic heavy fantasy with a side of gay romantic hazards + unsettling intrigue at times.", "timestamp_created": 1480536402, "timestamp_updated": 1480536402, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503106", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "27590467": {"recommendationid": "27590467", "author": {"steamid": "76561198005649229", "num_games_owned": 697, "num_reviews": 2, "playtime_forever": 121, "playtime_last_two_weeks": 0, "last_played": 1467794064}, "language": "english", "review": "I enjoyed this game. The characters were interesting and the story kept me wanting to see more.", "timestamp_created": 1480131320, "timestamp_updated": 1480131320, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26652458": {"recommendationid": "26652458", "author": {"steamid": "76561198001953963", "num_games_owned": 41, "num_reviews": 1, "playtime_forever": 389, "playtime_last_two_weeks": 0, "last_played": 1479421682}, "language": "english", "review": "I'm afraid I didn't really enjoy this game. As many dissapointing games do, it had a very promising beginning, with lots of fantasy, magic, school, friendship and so on, but from there it dragged, the writing let it down and the voice acting didn't help either.\n\nWhile there were plenty of good moments, excellent art and music and thought provoking player choices throughout, I felt I couldn't engage with standard fantasy characters talking like millenials, and the twist at the end not only came out of the Big Book of Cliches but felt wildly inconsistent with the tone the game had started in.\n\nI'm sure plenty of people will like this game, especially as the music and art are fantastic, but I didn't.", "timestamp_created": 1479422473, "timestamp_updated": 1479422473, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501402", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26458177": {"recommendationid": "26458177", "author": {"steamid": "76561198248105534", "num_games_owned": 175, "num_reviews": 37, "playtime_forever": 269, "playtime_last_two_weeks": 0, "last_played": 1478989175}, "language": "spanish", "review": "Cuando se trata de novelas visuales, mi primera prioridad son las buenas historias. Y vaya que Brilliant Shadows ha cumplido.\n\nPara empezar, la historia es intersante, y cuando terminas una ruta te queda picando la curiosidad, no sólo por la segunda parte (que logró casi cinco veces lo que pedía en su campaña), sino por las otras rutas posibles, por el mundo en donde se desarrolla. Me ha sorprendido, me ha hecho reír, me ha llenado de ternura y llevado al borde de las lágrimas. Y eso no es algo fácil de lograr.\n\nEl arte es agradable y bonito, con diseños distinguibles entre nigromantes y paladines. Algunas imágenes te dan la sensación de ser una ilustración en uno de esos libros de arte para coleccionistas. Se puede tener una imagen tétrica y colorida a la vez.\n\nEl diseño de personajes, tanto en aspecto como en sexualidad, trae algo muy bienvenido: diversidad. Y diversidad que demuestra cuánto puede mejorar una historia. No tienes X personaje como Y sólo para decir que no discriminas, sino que su Y es parte de la historia, y la enriquece.\n\nLa música acompaña, pero en el aespecto sonoro, lo que más me gustó fueron las voces. No sólo en el sentido literal, le dan nuevas dimensiones a la historia. A veces volvía atrás sólo para escuchar la voz de un personaje.\n\nEsta es una de las mejores novelas visuales que he jugado, y he jugado muchas. Recomendada, sin duda.", "timestamp_created": 1478445023, "timestamp_updated": 1478445023, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26316641": {"recommendationid": "26316641", "author": {"steamid": "76561198024955641", "num_games_owned": 60, "num_reviews": 6, "playtime_forever": 114, "playtime_last_two_weeks": 0, "last_played": 1477836596}, "language": "english", "review": "Pros:\n-Interesting story/world building\n- Queer representation!\n- Good music/art\n\nCons:\n- Hit-or-miss (but mostly miss) character development. I didn't care about either of the romances because there wasn't enough build up to them... they just sorta happened? [spoiler]\"Hey, I'm suddenly really in love with this guy I got paired with even though I knew next to nothing about him before this!\" \"Hey, girl I've only spoken to a few minutes in changling form, let's date!\" The latter felt like a really cheap solution to the protagonist's problems and IMO, doesn't send a great message?[/spoiler]\n- Inconsistent voice acting quality. The voice acting itself isn't bad, but some of it sounds professionally recorded while other characters sound like their lines were recorded with a really cheap microphone. This was particularly noticeable with Prude, which is unfortuate, considering she's one of the characters who talks the most.\n\nOverally, I just thought it was okay. I feel like a lot more could have been done with the story (even as just half of a two-part series)—more world building, more explanation about how magic/pairing works, a lot more build up with relationships, etc. Based on the reviews, a lot of people  seemed to really like this game, but it fell flat for me personally. I won't be playing the sequel.", "timestamp_created": 1477837361, "timestamp_updated": 1477837601, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504816", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25796031": {"recommendationid": "25796031", "author": {"steamid": "76561198043514908", "num_games_owned": 509, "num_reviews": 8, "playtime_forever": 206, "playtime_last_two_weeks": 0, "last_played": 1446520135}, "language": "english", "review": "This is a good game.  I do recommend it, but be warned--it ends suddenly.  The game world has two interlocking systems of magic.  Paladins develop a rosy glow, and their partners, the necromancers, have a pasty look.  (This does interesting things to the wide variety of skin colors on display.)  The main character is a necromancer who expects to be partnered with her lifelong friend and crush, now a paladin, in a graduation ceremony.  But she instead is partnered to a mysterious unknown who may or may not be horribly evil.  The friends, and Prudence the Paladin's new partner, try to discover the truth about Ash's partner, despite opposition from all corners.  You have the option to play as a good version of Ash, the main character, or to turn her evil.  There are also various smaller choices.  Unfortunately, the game does cut off rather quickly, with a lot of last-minute mythology being rapidly introduced.  It does have a complete arc, but it felt as though the game just...stopped.  There is a sequal coming out soon, though.\n\nThe art is good, although I'm usually not a fan of the \"what happened to my nose-bridge?\" style.  Here, though, the pudgier characters are missing their nose-bridges, and the more thin, angular characters have sharper lines, so I'll give it a pass.  The writing is better than average, though not spectacular.  The worldbuilding is interesting, and the magic systems are carefully internally consistent (good, because the plot relies on them), but I did wish for a little more concrete detail.  (The world is that standard fantasy world we all know with only some specified variations.)  Mechanics are par for visual novels.  Some of the voice acting is too high-pitched for my taste, but that is deliberate, and it is well-done.\n\nOverall, I would say give it a try unless you can't stand cliffhangers, in which case I would wait until the next part is released (currently set for April 2017; currently called Pale Spectrum, according to the Kickstarter page).\n\nNote:  I received a key through the Kickstarter backer campaign.  My key cost $3 (USD).", "timestamp_created": 1475311533, "timestamp_updated": 1475311533, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25282949": {"recommendationid": "25282949", "author": {"steamid": "76561197993680453", "num_games_owned": 1721, "num_reviews": 56, "playtime_forever": 242, "playtime_last_two_weeks": 0, "last_played": 1472767312}, "language": "english", "review": "Disclaimer: I am a Kickstarter backer for this game, so my opinion might be biased.\n\nThis VN is really fun. Great story that keeps you guessing of the next plot twist, great characters with well defined charisma and agenda. Interactions between them feel mostly natural. There's maybe a bit too much pushing of LGBTQ, that doesn't feel too believable in the world setting, but I guess that was one of the goals to fund this game.\n\nI really love the polish that went into the music, backgrounds, and character animations. There's a lot of variety in everything and visuals closely match the narrative, which I greatly appreciate.\n\nThe only downsides that I can think of are quite minor: clunky UI interaction (especially saving), and that the story abruptly stops at the most crucial part of the story. So, if you hate cliffhangers, wait for Book Two to come out.", "timestamp_created": 1472724144, "timestamp_updated": 1472724144, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24705257": {"recommendationid": "24705257", "author": {"steamid": "76561198031780569", "num_games_owned": 316, "num_reviews": 8, "playtime_forever": 241, "playtime_last_two_weeks": 0, "last_played": 1470286132}, "language": "english", "review": "Wow. This one was unexpectedly good.\n\nDecided to just test it out a bit before going to bed and ended up playing through the night. I especially liked the voice acting, and it's probably the best one I've come across in visual novels of this price range. A solid 4 hour trip for one of apparently three endings if you let the voice acting play out. And you should.", "timestamp_created": 1470305146, "timestamp_updated": 1470305146, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24490632": {"recommendationid": "24490632", "author": {"steamid": "76561198011333280", "num_games_owned": 263, "num_reviews": 17, "playtime_forever": 452, "playtime_last_two_weeks": 0, "last_played": 1469322803}, "language": "english", "review": "Bare in mind I'm not really much into visual novels. But if one catches my eye because the design and story I may give it a chance. And I wasn't wrong at all.\nI just finished it for the first time and got the first ending. Played it 7 hours straight and now my eyes are on fire, but the crying while playing helped to hidrate them. \n\nNow in a more serious manner. I loved the characters, really well done, some more likeable than others (maybe some people will like the ones I didn't like and hate the ones I did like), the story had me hooked, all the magic, balance, pairing stuff. It was like a methaphor about human relationships And the suspens made me wanting to know more.  \n\nThe twists got me good, I had some moments flipping stuff from my desk (I have a messy artsy desk don't judge).\nThe jokes were funny, the blooper reel was a really nice touch. \n\nSo... yeah, I REALLY DO recomment this game. And I'm waiting for the 2nd book!!\nI'm really happy to been able to get the good ending first since it leaved me with a great sensation.", "timestamp_created": 1469324905, "timestamp_updated": 1469324905, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24415035": {"recommendationid": "24415035", "author": {"steamid": "76561198258872121", "num_games_owned": 146, "num_reviews": 1, "playtime_forever": 278, "playtime_last_two_weeks": 0, "last_played": 1468962132}, "language": "english", "review": "The story felt a like it was a little bit weak. There was too much time spent pining and it got very annoying quickly. some characters were a bit hard to like and made parts of the game a chore to get through. The art style is beautiful the animation could use a bit of work. I would not play this game again.", "timestamp_created": 1468963180, "timestamp_updated": 1468963180, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.496493", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24111241": {"recommendationid": "24111241", "author": {"steamid": "76561198014420856", "num_games_owned": 66, "num_reviews": 82, "playtime_forever": 258, "playtime_last_two_weeks": 0, "last_played": 1467730992}, "language": "german", "review": "Interessante Story, Tolles Prinzip mit Licht- und Schwarzmagie. Das ganze Szenario wirkt irgendwie erfrischend, sowas gibt es selten im VN-Genre.\nAuch wenn es Part One im Namen hat, ist die Geschichte dennoch genug Abgeschlossen, das man ohne weiteres auf den 2. Teil warten kann. \n\nPro:\n- Für wenig Geld eine 4-6 Stunden lange Geschichte\n- Ausnahmsweise gutes Englisches Voice Acting\n- Eher \"westlich\" gehaltenes Szenario -> Wirkt erfrischend\n- Bloopers nach Abschluss. Will mehr davon\n\nContra:\n- Entscheidungen beeinflussen lediglich die Dialoge nur minimal bis auf die Enden\n- Keine CG-Gallerie nach Abschluss", "timestamp_created": 1467731373, "timestamp_updated": 1467731373, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24091354": {"recommendationid": "24091354", "author": {"steamid": "76561198120348301", "num_games_owned": 873, "num_reviews": 389, "playtime_forever": 700, "playtime_last_two_weeks": 0, "last_played": 1467661940}, "language": "english", "review": "I really enjoyed this first part! The story is quite interesting, the characters are likable (Hektor is my favorite), art style was really awesome, and the VA was great. I got the 3 endings [spoiler](and the third one was so creepy haha)[/spoiler] and enjoyed them. I’m looking forward to play the second part! Good luck to the developers.\n\n9/10.", "timestamp_created": 1467662367, "timestamp_updated": 1467662367, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.631692", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23962684": {"recommendationid": "23962684", "author": {"steamid": "76561198061107031", "num_games_owned": 142, "num_reviews": 6, "playtime_forever": 131, "playtime_last_two_weeks": 0, "last_played": 1467309849}, "language": "english", "review": "OKAY SO!  I completed the good path, don't care for the neutral, and my friend completed the evil path because she's a toot and I can tell you a LOT about this visual novel.\n\nFirst off, it's more like a book, less like a visual novel as visual novels tend to have 3-6 endings deciding whats your waifu, this is not one of those visual novels.  In fact, if you hate visual novels but love books, pick this up.  It's basically a book because the writing is REALLY well done.\n\nI'm going to stop rambling and make more readable explanation off the bat.  I hate, HATE visual novels.  They are disgusting anime waifu trash that pits a male protagonist in a room with ten half-naked cutsie girls of various personalities and animal ears... or tanks... or ships.  Whatever floats their boat I guess.  However, this is not one of those stories. Your character first off, is a woman, and though she has a heavy romantic interest with a character, it is just one specific character and not the waifu tray to choose from.\n\nIn fact, that's what makes this story so great.  The romance COMPLIMENTS the story, where as most visual novels, the story compliments the romance... or is just kinda shoveled on... looking at you Bird simulator dating... crap.\n\nSee, it sparks a tension in the pages you read through.  Deliciously juicy drama but no clear indication of 'will you get the girl or not', in fact, there is this dreadening atmosphere as you FEEL the character's hopes and dreams scatter multiple times but she picks herself up time and time again.  It's a really good heartening experience.\n\nNow let me explain the characters role.\nMain character: An interesting and dynamic character.  She FEELS so real, and her attitude can change from spiteful and depressed to straight up malicious depending on your choices.  I have felt her concerns myself in the dating gig so I know how it is.\nLove interest:  A character where drama revolves around but she isn't the driving force behind the plot (not directly anyways).  She brings the main character's tension along and is a point of interest, but isn't a mary sue princess that needs saving.\nThe 'will he betray us' guy:  Okay, sometimes you see a 'plot twist' coming from a mile away.  Sometimes you think 'no it's building up to reveal he was the good guy all along.  It isn't obvious in this one, it just isn't.  Sometimes I'm like OH YEAH HES SO GOOD, and other times I'm like HOLY SHIT STAB HIM HES SO EVIL!  But I didn't know, I never did until the end segment. I'm not going to spoil whether he is a good guy a bad guy.\nThe tag along characters: Well, these two people are basically extra spicing to flesh things out.  They fufill their role... they flesh things out, they add more dynamics but they are indeed, tag along.  Don't expect too much from them as they are a basic package.  NOthing too interesting but they add more perspective.  All in all well done characters if, a bit dissapointing.\n\nI'd describe more characters but I feel that it may be too spoilery so let's just say this.  Some characters will be completely meaningless and useless, while others will actually have a lot more involved with the plot than you would first think.  So just play it safe and pay attention to all characters :3\n\nNow, the story itself.  The plot is very interesting.  Once more, I won't describe in detail what it is but I will say the beginning is WAY Too slow and the ending is WAY too abrupt.  That's my only complaint, your first hour will be spent reading the beginning while the next will be speeding by the middle and the end as the plot snowballs down.  The story and even the world itself however, is very facinating and this DOES excuse the speed and pacing.  The beginning had to EXPLAIN the world, show you how it is.  And it doesn't do it in a stupid ass naruto way, no... it expects the reader to be actually intelligent and piece things together with solid information.  So that perhaps may be why the beginning is so slow and the ending feel so sudden and fast paced.\n\nTL;DR?\n\nStory 8/10\nPacing 7/10\nRomance 9/10\nCharacters 10/10\nWorld 10/10\n\nIGN 7.8/10.  Too much water", "timestamp_created": 1467311988, "timestamp_updated": 1467311988, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.537358", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23389513": {"recommendationid": "23389513", "author": {"steamid": "76561198087834803", "num_games_owned": 2966, "num_reviews": 154, "playtime_forever": 205, "playtime_last_two_weeks": 0, "last_played": 1490901998}, "language": "english", "review": "Made me realize how much I underappreciated voice acting in visual novels. It's very well done and really helps the characters come alive. The art is great, sort of Burtonesque instead of the typical anime style, and even the most minor side characters have unique sprites. The UI is a little awkward (I consistently had trouble finding the hotspot for save slots), but the text is large and easily readable.\n\nThe story feels very much like an introduction to a series. Most of the plot is focused on developing a small part of the setting, and then an epilogue abruptly shows a window into a larger world. It's also very linear; choices can give you evil points (too many and you get the bad end) and sometimes branch off into an extra scene, but the overall plot stays on the same path, and the good/neutral endings are very similar in both content and tone. Linearity isn't necessarily a weakness, especially since it leaves a clear starting point for the sequel, but saying there's three endings is kind of misleading.\n\nThat's a minor complaint, though. Overall, [i]Brilliant Shadows[/i] is one of the best English visual novels I've played, It has a unique setting and compelling characters, and the writing, art, music, and voice acting all come together in a harmonious, beautiful experience. Highly recommended.", "timestamp_created": 1465081599, "timestamp_updated": 1465081629, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.574048", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "23100012": {"recommendationid": "23100012", "author": {"steamid": "76561198053157929", "num_games_owned": 47, "num_reviews": 1, "playtime_forever": 285, "playtime_last_two_weeks": 0, "last_played": 1463761850}, "language": "english", "review": "This was my first ever visual novel game, and boy did it hook me. The characters were very well and realistically written, each with their own style. Did the game not have voices, I would likely have been able to tell who was saying what based on how things were written. The art was beautiful, the acting was great, the music was superb, and the story was captivating. \n\nThe only issue I had was the music level being much higher than the voice level. It made it impossible to hear what characters were saying when a score reached its crescendo. But, the subtitles alleviated any real issue! :) Can't wait for the next game!", "timestamp_created": 1463760866, "timestamp_updated": 1463999294, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "22462768": {"recommendationid": "22462768", "author": {"steamid": "76561198053853426", "num_games_owned": 19, "num_reviews": 1, "playtime_forever": 140, "playtime_last_two_weeks": 0, "last_played": 1460787631}, "language": "english", "review": "As a big fan of story based games and visual novels, I loved this game. \n - The artwork was rich and detailed\n - Fully and dramatically voice acted\n - The storyline was fascinating and full of drama, plot twists, suspense, and some moments that made me laugh out loud\n - Interesting, diverse cast of characters\nHope others enjoy it as much as I did!", "timestamp_created": 1460841619, "timestamp_updated": 1460841619, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22462522": {"recommendationid": "22462522", "author": {"steamid": "76561198157745778", "num_games_owned": 25, "num_reviews": 4, "playtime_forever": 391, "playtime_last_two_weeks": 0, "last_played": 1472086796}, "language": "english", "review": "This game is amazing, with awesome voice-acting and beutiful art. The story and world are interesing and the characters are strong and well paced.", "timestamp_created": 1460840814, "timestamp_updated": 1460840814, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22420931": {"recommendationid": "22420931", "author": {"steamid": "76561198157962473", "num_games_owned": 156, "num_reviews": 7, "playtime_forever": 19, "playtime_last_two_weeks": 0, "last_played": 1460677685}, "language": "english", "review": "I thoroughly enjoyed this game! I wish there were more choices/options, but even so, it was still fun and an interesting read . :)", "timestamp_created": 1460691031, "timestamp_updated": 1460691031, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22416161": {"recommendationid": "22416161", "author": {"steamid": "76561197994134708", "num_games_owned": 46, "num_reviews": 8, "playtime_forever": 717, "playtime_last_two_weeks": 0, "last_played": 1460665141}, "language": "english", "review": "The story was fine so I've read it to the end", "timestamp_created": 1460665238, "timestamp_updated": 1460665238, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22391758": {"recommendationid": "22391758", "author": {"steamid": "76561198045618461", "num_games_owned": 131, "num_reviews": 54, "playtime_forever": 343, "playtime_last_two_weeks": 0, "last_played": 1460542758}, "language": "english", "review": "A really good story!\nSome folks are not happy with the lack of choices and there are only a few to be made. Those lead to a possible three different endings. I personally didn't mind because the overall quality of everything the game does offer is so high. Great Art, excellent voice acting, and as mentioned a really good story all added up to a pretty great overall experience.\nI would highly recommend this to anyone who likes stories with fully realized characters and concepts.", "timestamp_created": 1460543084, "timestamp_updated": 1460543084, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.504892", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22246643": {"recommendationid": "22246643", "author": {"steamid": "76561197966679976", "num_games_owned": 131, "num_reviews": 2, "playtime_forever": 190, "playtime_last_two_weeks": 0, "last_played": 1459825907}, "language": "english", "review": "Touching, funny, and real for as fantastical as it seems. This is one of the best visual novels I've played in a long time,", "timestamp_created": 1459826229, "timestamp_updated": 1459826229, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22186821": {"recommendationid": "22186821", "author": {"steamid": "76561198065979638", "num_games_owned": 346, "num_reviews": 35, "playtime_forever": 168, "playtime_last_two_weeks": 0, "last_played": 1459547147}, "language": "english", "review": "So, the only thing that makes the ending(s) of this game at all acceptable is that there's a kickstarter running for the sequel (which I've totally backed). \n\nBrilliant Shadows has an interesting and visceral artwork style, engaging characters, and a great treatment of sexuality, especially in the sense that this game is about sexual identity but doesn't make that search the only/primary point of the game, not to mention the refreshing lack of bigotry. As a bi woman, I usually wince a little at most media in terms of sexual representation: mainstream bisexual representation trends toward the \"out of straight porn\" variety and \"lesbian oriented\" media tends to shame or delegitimize bisexuality and there was none of that in this game. Combine that with an interesting fantasy universe (something that seems like a bit of rarity in VNs that I've seen), a cool and unique idea for a magic system, decent voice acting, and an actually hilarious blooper reel, and this game is definitely a good buy (especially at 50% off).", "timestamp_created": 1459552331, "timestamp_updated": 1459552331, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22171200": {"recommendationid": "22171200", "author": {"steamid": "76561198150342974", "num_games_owned": 167, "num_reviews": 5, "playtime_forever": 634, "playtime_last_two_weeks": 0, "last_played": 1460176378}, "language": "english", "review": "I love visual novels, but I felt like this one fell short of what I'm used to. For one thing, I don't think there were enough choices. It's a very short game. At times it gets confusing with the dialogue and POV (although that may just me be.) However, I do have to applaud the artwork. It's very Tim Burtonesque.", "timestamp_created": 1459477756, "timestamp_updated": 1459477756, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22167908": {"recommendationid": "22167908", "author": {"steamid": "76561198041221849", "num_games_owned": 554, "num_reviews": 9, "playtime_forever": 324, "playtime_last_two_weeks": 0, "last_played": 1459293728}, "language": "english", "review": "Choices don't really matter in this game. Well... there are different endings: a bad one, a good one and a in-between one, which is actually better that the 100% good one. \n\nThe bottom line is that you should definetly buy this game, the voice acting and art are wonderfull. The plot, world setting quite original.", "timestamp_created": 1459459990, "timestamp_updated": 1459459990, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22150143": {"recommendationid": "22150143", "author": {"steamid": "76561198116934331", "num_games_owned": 19, "num_reviews": 11, "playtime_forever": 205, "playtime_last_two_weeks": 0, "last_played": 1459373791}, "language": "english", "review": "Fudge this game. That elf bitch is a transvestite but with mythical termonolgy and lore behind it. I don't have a problem with that shit, but, no.", "timestamp_created": 1459373923, "timestamp_updated": 1459373923, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.189378", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22138433": {"recommendationid": "22138433", "author": {"steamid": "76561198044634692", "num_games_owned": 243, "num_reviews": 10, "playtime_forever": 349, "playtime_last_two_weeks": 0, "last_played": 1462001409}, "language": "english", "review": "Not finished yet, but so far it's been quite good. Perhaps even great.\n\nAnd I hate everything.\n", "timestamp_created": 1459328365, "timestamp_updated": 1459328365, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21937718": {"recommendationid": "21937718", "author": {"steamid": "76561198116388622", "num_games_owned": 43, "num_reviews": 3, "playtime_forever": 250, "playtime_last_two_weeks": 0, "last_played": 1469467401}, "language": "english", "review": "Game was perfect. Cant wait for part two!", "timestamp_created": 1458447980, "timestamp_updated": 1458447980, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21923081": {"recommendationid": "21923081", "author": {"steamid": "76561198009104966", "num_games_owned": 228, "num_reviews": 1, "playtime_forever": 418, "playtime_last_two_weeks": 0, "last_played": 1453533831}, "language": "english", "review": "great story. \nOnly problem is having to wait for the next part.", "timestamp_created": 1458393408, "timestamp_updated": 1458393408, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21868651": {"recommendationid": "21868651", "author": {"steamid": "76561198116746721", "num_games_owned": 87, "num_reviews": 6, "playtime_forever": 239, "playtime_last_two_weeks": 0, "last_played": 1458132045}, "language": "english", "review": "Just get the game. Please. It's SO good.\nThe characters, the main character, the voice acting, the story, the diversity... just EVERYTHING.\n\n10/10\n\nHepter the Blass Blower", "timestamp_created": 1458133116, "timestamp_updated": 1458133116, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.530201", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21730305": {"recommendationid": "21730305", "author": {"steamid": "76561198007822217", "num_games_owned": 648, "num_reviews": 30, "playtime_forever": 220, "playtime_last_two_weeks": 0, "last_played": 1457450885}, "language": "english", "review": "Brilliant Shadows is a well written and drawn visual novel.  There are a few choices to make, but they seem mainly to give a bit more backstory than have a significant impact on the story itself.  The art is stylized and interesting to look at, which is good, because there isn't a whole lot of it.  Mainly you are looking at the same character models exchanging dialogue with some limited animation.  It is fully voice acted and clearly there has been effort made to have the characters emote when they speak.  The writing is solid, if a little stiff at times, and the voice acting is fine (though I was always aware that the actors were speaking into microphones). \n\nThe story is interesting, though it does drag a bit at times.  Apparently this is the first part, as the title suggests, so the ending is not particularly satisfying.  If you enjoy fantasy stories with a bit of romance and mystery this might be a good bet.", "timestamp_created": 1457538271, "timestamp_updated": 1457538271, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21473860": {"recommendationid": "21473860", "author": {"steamid": "76561198052254704", "num_games_owned": 406, "num_reviews": 28, "playtime_forever": 589, "playtime_last_two_weeks": 0, "last_played": 1512963049}, "language": "english", "review": "Art is gorgeous, music is great, voice acting is top-notch. I feel that there are a few hiccups in the story (pacing- and continuity-related), but it's gripping and interesting enough to ignore those altogether. So a definite thumbs up from me.", "timestamp_created": 1456491272, "timestamp_updated": 1456491272, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21131375": {"recommendationid": "21131375", "author": {"steamid": "76561198163080913", "num_games_owned": 74, "num_reviews": 1, "playtime_forever": 166, "playtime_last_two_weeks": 0, "last_played": 1455207567}, "language": "english", "review": "This VN made me ridiculously happy. The art is gorgeous, there was a good build-up for suspicion, and some of the situations Ash got into were relatable. I was also pleasantly surprised I ended up liking Belinda. Hoping to see the next part soon, especially if it adds more context to the plot point towards the end of the story.", "timestamp_created": 1455210303, "timestamp_updated": 1455210303, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21065555": {"recommendationid": "21065555", "author": {"steamid": "76561198101799498", "num_games_owned": 69, "num_reviews": 11, "playtime_forever": 131, "playtime_last_two_weeks": 0, "last_played": 1496787549}, "language": "english", "review": "A good story but really bummed out that there is no ending wioth prude and ash whether paired or romanticly", "timestamp_created": 1454980013, "timestamp_updated": 1454980013, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21060172": {"recommendationid": "21060172", "author": {"steamid": "76561197980896011", "num_games_owned": 630, "num_reviews": 3, "playtime_forever": 288, "playtime_last_two_weeks": 0, "last_played": 1506639692}, "language": "english", "review": "I want moar!", "timestamp_created": 1454961809, "timestamp_updated": 1454961809, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20908029": {"recommendationid": "20908029", "author": {"steamid": "76561198154796829", "num_games_owned": 66, "num_reviews": 1, "playtime_forever": 355, "playtime_last_two_weeks": 0, "last_played": 1454401111}, "language": "english", "review": "I really liked it. It was a visual book that i had a lot of fun with. If you want to set back and read a story with out the work of actually reading I recomend you try it out. I'm looking forward to the next one", "timestamp_created": 1454401688, "timestamp_updated": 1454401688, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20818365": {"recommendationid": "20818365", "author": {"steamid": "76561198056251899", "num_games_owned": 46, "num_reviews": 1, "playtime_forever": 312, "playtime_last_two_weeks": 0, "last_played": 1498702803}, "language": "english", "review": "I really, really enjoyed this game. The voice acting was quite good and the story was interesting. I also loved the bonus blooper reel. I still laugh when I think about Hepitor, the Blass Glower.", "timestamp_created": 1454037887, "timestamp_updated": 1454037887, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20776890": {"recommendationid": "20776890", "author": {"steamid": "76561198030561322", "num_games_owned": 148, "num_reviews": 1, "playtime_forever": 614, "playtime_last_two_weeks": 231, "last_played": 1516352682}, "language": "english", "review": "It's an enjoyable story. The characters are well rounded. The main character is very likeable, and it's easy to root for her. The artwork is pretty. If you're into VN, then I highly recommend it.", "timestamp_created": 1453854445, "timestamp_updated": 1453854445, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20741846": {"recommendationid": "20741846", "author": {"steamid": "76561198050814716", "num_games_owned": 517, "num_reviews": 2, "playtime_forever": 441, "playtime_last_two_weeks": 0, "last_played": 1454121473}, "language": "english", "review": "Overall a good VN with large amout of replayability, good art, great music and good voice acting.I normally turn off voice acting for a lot of these noves,but this one was well recorded really enjoyed it. The story is also solid with basically everything nicely rounded and no gaping plot holes; which is always nice. I will say this is deffinately a romance/relationship novel make no mistake. I was personally looking for more a fantasy adventure style maybe with a romantic subplot,not being a major romance fan myself,but it is much more romance with a dash of fantasy and adventure for spice. Still very solid for what it is, just personal prefrence there.\n", "timestamp_created": 1453703727, "timestamp_updated": 1453703727, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20577417": {"recommendationid": "20577417", "author": {"steamid": "76561198025563408", "num_games_owned": 111, "num_reviews": 6, "playtime_forever": 216, "playtime_last_two_weeks": 0, "last_played": 1459492173}, "language": "english", "review": "I find much to like about this visual novel: exploration in an adventure-friendly world, various forms of intrigue, and the hints of a wider world and story.\n\n[spoiler]\nOn the other hand, I felt that individual choices were not of particular consequence; the endings are based on what seems to be a karma system, without much attention to particular choices. This may simply be a consequence of this game's placement as the beginning of a larger story. While I prefer richer branching, I still recommend this game.\n[/spoiler]\n", "timestamp_created": 1453008656, "timestamp_updated": 1453008656, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20463593": {"recommendationid": "20463593", "author": {"steamid": "76561198018300658", "num_games_owned": 68, "num_reviews": 5, "playtime_forever": 670, "playtime_last_two_weeks": 0, "last_played": 1481094712}, "language": "english", "review": "Before playing this, I had decided that I was not a fan of the \"Visual/Interactive Story\" genre. But, after picking this up, my entire view has been thrown against the wall. While originally I was concerned that adding in visuals voices to character would take away enjoyment, I have discovered that instead being given a concrete step upon which to envision my characters was refereshing. And I haven't even got to the story itself. Going into this, I was unsure as to if this was going to be a rather generic fantasy story, but BS's (Yeah, great initals for a game right?) openess and more realistic approach to topics such as homosexuality and love had me much more inthrawled into the different characters relationships. And being able to control the main characters actions stripped that sense of when you read a book and you cant tell exactly what's going to happen because a character does something and then spending the next five minutes whining about their stupidity. But all in all, this game/book was an amazing experience, and I cannot wait for it's sequel!\nP.S: If the developers need any young, male australian voice actors I would be happy to oblige! \nSigned with a cocksure attitude,\nMr. New Foxy", "timestamp_created": 1452491099, "timestamp_updated": 1452491099, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.577687", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20439414": {"recommendationid": "20439414", "author": {"steamid": "76561198051317896", "num_games_owned": 194, "num_reviews": 11, "playtime_forever": 469, "playtime_last_two_weeks": 0, "last_played": 1452671124}, "language": "english", "review": "What can I say? Once I started, I couldn't stop till I finished. Fortunately, it only takes a few hours to finish... it may not sound like much, but they pack a lot into those few hours! And I wanted to immediately play again to see how different choices effect things, and reach the other endings.\n\nThe story and writing are very well done. The characters are varied and interesting. The voice acting is a little mixed, most are good but a couple are not. Brilliant Shadows also tackles issues of sexuality very well, presenting challenges many have to go through, without ever being insulting or condescending.\n\nI can hardly wait for Part Two!", "timestamp_created": 1452402721, "timestamp_updated": 1452402721, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20439132": {"recommendationid": "20439132", "author": {"steamid": "76561198077463094", "num_games_owned": 141, "num_reviews": 6, "playtime_forever": 240, "playtime_last_two_weeks": 0, "last_played": 1452399028}, "language": "english", "review": "Hands down one of my favorite VNs.\n\nI eagerly await the next parts and hope this story contines well into additional parts.\n\nThe characters were given great personalities and it was great seeing their individual stories blossom. \nYou'll go more places than you expect and there are nicely done transitions.\nYou get the feeling of being \"at home\" with the characters.\nThere are some points that seem to pass by too quickly (the few scenes with Malte in paticular I hope may be revisited.)\nThere are also very well developed points in the story for fun or unexpected foreshadowing.\nThe art was lovely as well and kept well with the themes given in the story (such as showing different clothing for people from different locations).\nTransitions in locations are well represented as well as the mood of previously visited scenes.\nWould have loved an \"Artbook\" additional option.", "timestamp_created": 1452401294, "timestamp_updated": 1452401294, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20391073": {"recommendationid": "20391073", "author": {"steamid": "76561197989572157", "num_games_owned": 540, "num_reviews": 5, "playtime_forever": 143, "playtime_last_two_weeks": 0, "last_played": 1452234459}, "language": "german", "review": "Very enjoyable and engaging story. I saw it in a stream of Dodger and YouTube and had to buy it just to finish it in one go afterwards.", "timestamp_created": 1452234610, "timestamp_updated": 1452234610, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20386351": {"recommendationid": "20386351", "author": {"steamid": "76561198157678276", "num_games_owned": 96, "num_reviews": 3, "playtime_forever": 186, "playtime_last_two_weeks": 0, "last_played": 1458230651}, "language": "english", "review": "I found this game to be so enjoyable to play. I felt more intrested with how there was voice to the character and all the voice actors were pretty amazing. I really do wish more games had voice acting. I feel much more closer to story when there a voice to each character.  I had maybe two problems one I can wish you could make more choices at certain events. I say this because there is a character you meet and to be honest some of the choice you could make with the character where choice I did not want to make, but I had to pick one the two choices presented two me. Also near the, I think the climax of the game, it felit like the story was going a little too fast. But after all of that I really did enjoy it and can not wait for the next part. I fully recommend that everyone should give this a shot and support the people who are making this.", "timestamp_created": 1452211539, "timestamp_updated": 1452222123, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20342202": {"recommendationid": "20342202", "author": {"steamid": "76561197979416503", "num_games_owned": 787, "num_reviews": 17, "playtime_forever": 456, "playtime_last_two_weeks": 0, "last_played": 1452056512}, "language": "english", "review": "All in all a very well made story in an interesting world. Excellent voice acting, good music, brilliant visuals. Any critique I have is for the engine they used to make this game in, and that is more a limitation of the canvas than the artist. I look forward to the next installment.", "timestamp_created": 1452056575, "timestamp_updated": 1452056575, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20302547": {"recommendationid": "20302547", "author": {"steamid": "76561198046886623", "num_games_owned": 112, "num_reviews": 8, "playtime_forever": 357, "playtime_last_two_weeks": 0, "last_played": 1451938512}, "language": "english", "review": "good stuff. lotta gays. I dig it.", "timestamp_created": 1451937500, "timestamp_updated": 1451937500, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20211008": {"recommendationid": "20211008", "author": {"steamid": "76561197983690518", "num_games_owned": 769, "num_reviews": 181, "playtime_forever": 183, "playtime_last_two_weeks": 0, "last_played": 1451730286}, "language": "english", "review": "So I watched Dodger play this and enjoyed it enough that I had to buy it just to support the Devs. I also wanted to see the other endings and I was not dissapointed. Ending 2: Finding a Balance was even better than the first ending. I hope they use that one going into part two.", "timestamp_created": 1451729343, "timestamp_updated": 1451729343, "voted_up": true, "votes_up": 14, "votes_funny": 2, "weighted_vote_score": "0.675133", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20188714": {"recommendationid": "20188714", "author": {"steamid": "76561198052525590", "num_games_owned": 177, "num_reviews": 4, "playtime_forever": 226, "playtime_last_two_weeks": 0, "last_played": 1451676992}, "language": "english", "review": "i had a few doubts, but hit ''add to cart'' button nevertheless and now, after finishing one route i'm really suprised. this game is so awesome in every way you can imagine \n\n- voice acting is really good, actors aren't just reading their speeches but actually playing their role.\n- graphic has something fresh in it, it isn't something you see in your generic vn (sprites are blinking! BLINKING), color palletes are pleasantly matched, balm on your eyes, really\n- characters! oh god, poor, awkward ash, i feel u darling, lemme hug you.\n\nall heroes have their quirks and shortcomings, but aren't shallow or dull and their backstories, even if ones aren't so tragic as the other, are quite reasonable and get the player to know characters better.\n\nalso ash, i wouldn't be exaggerating if i consider her one of the best written characters ever. her feelings about... everything - getting over unrequited love, getting to terms with situation she found herself in and working on solving it - feels so true. 11/10, also for her sassiness. she is the champ\n\n- plot plOT PLOT. it's a fantasy, it's a romance, it's a mystery, it's a slice of life, it's a bit of horror, it makes your hear beat in different patterns and they are all GOOD.\n\nonly flaw i see in this game is you have to wait for the next part to see the plot unravel, because only a few threads met their end and the biggest one is still in progress. can't wait!\n\nedit: [spoiler] ALSO THE THIRD ENDING? OH GOD THAT IS TWISTED I LIKED IT THE BEST I THINK [/spoiler]", "timestamp_created": 1451674470, "timestamp_updated": 1451691227, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20163432": {"recommendationid": "20163432", "author": {"steamid": "76561198053831519", "num_games_owned": 40, "num_reviews": 1, "playtime_forever": 196, "playtime_last_two_weeks": 0, "last_played": 1455155572}, "language": "english", "review": "I regret not buying this game sooner because it was absolutely amazing from begining to end. The voice acting and the art are really good and add a lot to the overall experience. I would recommend this to anybody who mght be interested in these types of games as this is one of the best.", "timestamp_created": 1451604477, "timestamp_updated": 1451604477, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20138814": {"recommendationid": "20138814", "author": {"steamid": "76561198048854800", "num_games_owned": 198, "num_reviews": 1, "playtime_forever": 356, "playtime_last_two_weeks": 0, "last_played": 1451538733}, "language": "english", "review": "Great characters, nicely written and adorable romance. Must buy.", "timestamp_created": 1451538815, "timestamp_updated": 1451538815, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20133202": {"recommendationid": "20133202", "author": {"steamid": "76561198069880050", "num_games_owned": 68, "num_reviews": 4, "playtime_forever": 441, "playtime_last_two_weeks": 0, "last_played": 1469744306}, "language": "english", "review": "Amazing art style, amazing music, amazing voice acting, amazing story. Its just awesome all around.\nI am not even a big fan of Visual Novels but i loved this game, its worth trying out!", "timestamp_created": 1451522197, "timestamp_updated": 1469069845, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20061825": {"recommendationid": "20061825", "author": {"steamid": "76561198148283306", "num_games_owned": 80, "num_reviews": 3, "playtime_forever": 257, "playtime_last_two_weeks": 0, "last_played": 1451376481}, "language": "english", "review": "No spoilers: even though at first it feels like your run of the mill \"emo mary sue original character donut steal\" kind of game, it's most certainly not. Every character seems fleshed out and completely 3D. Definitely one of my favorite games.", "timestamp_created": 1451380818, "timestamp_updated": 1451380818, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20045480": {"recommendationid": "20045480", "author": {"steamid": "76561198076714786", "num_games_owned": 590, "num_reviews": 9, "playtime_forever": 16, "playtime_last_two_weeks": 0, "last_played": 1448908283}, "language": "english", "review": "Nice VN with a few slightly differing endings. I would wish for more freedom in romance for example, but it's only part 1, so we'll see. Highly recommended.", "timestamp_created": 1451335586, "timestamp_updated": 1451335586, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19992030": {"recommendationid": "19992030", "author": {"steamid": "76561197961809232", "num_games_owned": 187, "num_reviews": 2, "playtime_forever": 157, "playtime_last_two_weeks": 0, "last_played": 1450896622}, "language": "english", "review": "Almost solid, but ...\n\nArt is OK, with exceptions (those horses...), voice acting is OK (but there's better), soundtrack is OK (but nothing spectacular), setting seems OK (but we barely get to explore it), plot seems OK (but it's at times pretty rushed), characters seem OK (but there isn't much time for them to do anything), writing - well, about what one would expect, but ...\n\n... it's just too short. Not because games should have an arbitrary length x, but because to tell a story with the amount of characters and subplots this one \"sort of\" has it simply needs more words than this one - otherwise everything is either resolved basically immediately or never (read: perhaps in a sequel that might one day appear).\n\nAs there's not much of a selection for English vns it still perhaps nice to have, but I wouldn't unconditionally recommend it. Maybe once all the sequels are out.", "timestamp_created": 1451213035, "timestamp_updated": 1451213035, "voted_up": false, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.490317", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19954125": {"recommendationid": "19954125", "author": {"steamid": "76561198142991517", "num_games_owned": 288, "num_reviews": 6, "playtime_forever": 281, "playtime_last_two_weeks": 0, "last_played": 1451124738}, "language": "english", "review": "This VN exceeded my expectations! From watching the trailer I wasn't sure whether the story would be entertaining, and I had some reservations about the voice acting. However the voice acting is actually very good, and the story was very satisfying. Additionally I normally find the music in VNs to be annoying and turn it off, but the music in this VN definitely added to the experience.\n\nIf you think this game might be good but aren't certain based on the trailer, I'd definitely recommend you take the chance!", "timestamp_created": 1451116522, "timestamp_updated": 1451116522, "voted_up": true, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.653866", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "19928685": {"recommendationid": "19928685", "author": {"steamid": "76561198044985351", "num_games_owned": 476, "num_reviews": 5, "playtime_forever": 285, "playtime_last_two_weeks": 0, "last_played": 1468123983}, "language": "english", "review": "Very neat little VN with some of the best English voice acting I've ever seen. The world is an original one and the characters are all very likeable and entertaining to watch. Manages to strike a good balance between humor and drama, and I'm /very/ excited to see where possible sequels may take us.", "timestamp_created": 1451025353, "timestamp_updated": 1451025353, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19900085": {"recommendationid": "19900085", "author": {"steamid": "76561198045859153", "num_games_owned": 507, "num_reviews": 45, "playtime_forever": 224, "playtime_last_two_weeks": 0, "last_played": 1450943192}, "language": "english", "review": "Bought the game because I'm a sucker for anything with necromancers.\n\nStayed with the game because everyone is ADORABLE.  The writing is adorable.  The characters are adorable.  The voice acting is adorable.  I love this game.  I need the sequel and I need it noooow.", "timestamp_created": 1450943354, "timestamp_updated": 1450943354, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.455528", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19857473": {"recommendationid": "19857473", "author": {"steamid": "76561198271121965", "num_games_owned": 1, "num_reviews": 1, "playtime_forever": 131, "playtime_last_two_weeks": 0, "last_played": 1450832294}, "language": "english", "review": "Great", "timestamp_created": 1450832339, "timestamp_updated": 1450832339, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19741872": {"recommendationid": "19741872", "author": {"steamid": "76561198074072128", "num_games_owned": 91, "num_reviews": 22, "playtime_forever": 7, "playtime_last_two_weeks": 0, "last_played": 1450329786}, "language": "english", "review": "To just to make clear, I actually completed the game and got at least 1 ending, regardless of going though twice and making some different choices.\n\nReally loved this game alot. The artwork is pretty good, the plot and learning bits about the world is VERY interesting, love the characters and the voice work is excellent, despice the game not costing that much to buy.\n\nI guess one thing I hoped for is an ending where Ash ends up with Prude. If there is one, I would love a guide to it. If not, then I'm OK with that.\n\nI highly recommend buying and playing this game, you will not regret it and I hope to see the next chapter to this story soon!", "timestamp_created": 1450330142, "timestamp_updated": 1450330142, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19705013": {"recommendationid": "19705013", "author": {"steamid": "76561198137759743", "num_games_owned": 84, "num_reviews": 3, "playtime_forever": 366, "playtime_last_two_weeks": 0, "last_played": 1472432428}, "language": "english", "review": "A beautiful and well written narrative set in a high fantasy world. Brilliant Shadows follows Veronica \"Ash\" Ashmar, a young necromancer, and her childhood friend Prudence as they look for truth behind the strange circumstances surrounding the pairing ritual and the voices in Ash's head. Along the way they meet a lovable cast of characters and learn that maybe what they thought they knew about magic was all a lie.\n\nBrilliant Shadows is a visual novel and purely story driven. The player gets to make choices that will affect the outcome the story. This is just part one of what will hopefully become a grand series filled with a flushed out lore, gorgeous art, and colorful characters. I can already sense this will become an emotional rolllercoaster ride for my heart.\n\nIncludes LGBTQIAAP representation. ~( ' . ' ~) ~( ' . ' )~ (~ ' . ' )~\n\nOnly quib I can think of, some typos nothing major though.", "timestamp_created": 1450147192, "timestamp_updated": 1450148492, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19682175": {"recommendationid": "19682175", "author": {"steamid": "76561198103031377", "num_games_owned": 169, "num_reviews": 5, "playtime_forever": 148, "playtime_last_two_weeks": 0, "last_played": 1477520424}, "language": "english", "review": "Damn good! Love the story and none of the characters feel flat. They're all interesting and I want to know more about everyone. I hope to see more of this.", "timestamp_created": 1450037062, "timestamp_updated": 1450037062, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19659115": {"recommendationid": "19659115", "author": {"steamid": "76561198050329764", "num_games_owned": 631, "num_reviews": 17, "playtime_forever": 297, "playtime_last_two_weeks": 0, "last_played": 1449949514}, "language": "english", "review": "Better than Everlasting Summer.", "timestamp_created": 1449949728, "timestamp_updated": 1451601745, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.391664", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19641899": {"recommendationid": "19641899", "author": {"steamid": "76561198131575980", "num_games_owned": 67, "num_reviews": 5, "playtime_forever": 325, "playtime_last_two_weeks": 0, "last_played": 1449881965}, "language": "english", "review": "I found and bought this game on a whim since I hadn't really tried a visual novel before. Turns out I had a lot of fun with it. The setting is interesting, and the whole necromacer/paladin pairs to balance eachother out is novel concept. I liked the writing as it made me laugh pretty frequently and I thought the art fit really well. \n\nIt's about the price of a kindle book and I feel I got my money's worth. Looking forward to the sequal.", "timestamp_created": 1449882434, "timestamp_updated": 1449882434, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19580268": {"recommendationid": "19580268", "author": {"steamid": "76561198097851644", "num_games_owned": 514, "num_reviews": 6, "playtime_forever": 397, "playtime_last_two_weeks": 0, "last_played": 1449656791}, "language": "english", "review": "This review comes from me who do not have a great deal of interest in Visual Novels, in fact I believe this is the first visual novel I have ever completed so if you're a big fan of this type of genre this review might not be relevant. \n\nThat being said, this one is friggin' amazing!\nWhat firstly attracted me to this game was the art style. Took me a while to buy it as I was put off by the visual novel tag but found myself coming back to check every now and then, eventually bought it and it was truly worth every penny. Brilliant Shadows is a beautiful game with art, voice acting and writing that outshines most games you pay 50 bucks for these days. There are multiple options to choose from, giving you semi control over the protagonist and I will at a later point play though it again to check out the different options and the effect they will have on the story. \nEvery story relevant character are very well written and are given a lot of personality. And lots of added humor to boost. \n\nPro's:\n- Art\n- Voice acting\n- Writing\n- Characters\n- Humor\n- Creativity\n- Multiple options/endings\n- Everything (honest)\n\nCon's:\n- Who the heck cares?! Go buy it!", "timestamp_created": 1449657686, "timestamp_updated": 1449657686, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19571042": {"recommendationid": "19571042", "author": {"steamid": "76561198052709775", "num_games_owned": 100, "num_reviews": 11, "playtime_forever": 286, "playtime_last_two_weeks": 0, "last_played": 1449602359}, "language": "english", "review": "I played through this for the first time in two sittings - the plot, characters, and world-building all fascinated me.  The art is gorgeous, and the voice acting really adds to the characterizations, as well.  \n\nMy only complaint is that the pacing seemed very rushed in a few key places, and in particular at the ending, which is odd given how leisurely spun-out most of the game is.  There were several things I wanted to hear more about, namely, [spoiler]what the Heads' motivation was at the end - it seemed linked to Zakaria's relationship to Prude and her mother, which seemed like an important plot point that just kind of got skimmed over.  What's the deal with their cult, and why was Terra following Ash for so long without revealing herself?  What's a changeling in this 'verse?  Is Terra linked to the lizard people we see attempting to treat with Celeste at the end?[/spoiler]\n\n...The more I think about it, the more questions I have.  I'll definitely play the sequel, and hope that some of them get answered there.", "timestamp_created": 1449603717, "timestamp_updated": 1449604693, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19545318": {"recommendationid": "19545318", "author": {"steamid": "76561198028146166", "num_games_owned": 202, "num_reviews": 3, "playtime_forever": 182, "playtime_last_two_weeks": 0, "last_played": 1449447882}, "language": "english", "review": "Even though the premise is pretty elaborate and possibly not as well-developed as it could be (but hey, there's at least two more volumes to come), this VN easily drops you into the world and story without it being confusing. The dialogue is snappy and the characters are fascinating, and people you think you understand are often something else entirely. The art has manga-ish tendencies, but is quite unique, and the non-dialogue art is incredible. \n\nI finished this game in two big chunks, and am really looking forward to trying to get the other two endings.", "timestamp_created": 1449487940, "timestamp_updated": 1449487940, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "19538180": {"recommendationid": "19538180", "author": {"steamid": "76561198041007422", "num_games_owned": 240, "num_reviews": 3, "playtime_forever": 219, "playtime_last_two_weeks": 0, "last_played": 1449437131}, "language": "english", "review": "This game was delightful. It took me just under four hours to get through the story, although I'll probably go through again and check out the other two endings. \n\nI like that the cast is diverse and interesting. The story was very satisfying and took some unexpected turns. The art is absolutely gorgeous; I really love the loose, stylized approach. Overall, it was a lot of fun, and I hope we get a part two.\n\nOne point of critizism about this game is the size and location of the menu button. I really wish it was less obstrusive. I also would have liked some resolution options for windowed mode.", "timestamp_created": 1449446358, "timestamp_updated": 1449446358, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19432115": {"recommendationid": "19432115", "author": {"steamid": "76561197981754658", "num_games_owned": 210, "num_reviews": 1, "playtime_forever": 630, "playtime_last_two_weeks": 0, "last_played": 1449045510}, "language": "english", "review": "I am not a man that has played much in the way of visual novels. I think I may have played a grand total of 1. That being said I have read many a book and have a craving for good solid story.\n\nFrom the very start of this one, we see a well done style that looks like a painter has just left the easel to dry and it catches the eye. I even praise the colors used that really draw the eyes and help make the characters simply LOOK unforgettable. \n\nThe story setting has enough of it's own lore that I want more, and not even just from the main characters. There were several smaller mentions of things that I would love to see explored in other ways, even as small as a short story or something of that nature.\n\nThe main character goes through a few points where it is difficult to like her, however, during these points her actions and mannerisms really sell what she is going through and seemed like very human responses. Being honest I think I only felt that way due to her being upset with a character I found very charming!\n\nThe relationships felt real and there were a few times I expected the story to focus on some of the negative emotions of a character for longer than needed and I was pleasantly surprised that the development felt organic.\n\nThe ending leaves alot of questions, but its very clear (the title..I mean..) that this is but one part and that we can expect to see more. It doesn't leave on a cliffhanger so much as a hope for the future of the characters.\n\nIf you like visual novels, I gotta say to give this one a try, worth your time and money. Looking forward to part two!", "timestamp_created": 1449042097, "timestamp_updated": 1449042097, "voted_up": true, "votes_up": 8, "votes_funny": 2, "weighted_vote_score": "0.510774", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "19422828": {"recommendationid": "19422828", "author": {"steamid": "76561198066077800", "num_games_owned": 114, "num_reviews": 3, "playtime_forever": 295, "playtime_last_two_weeks": 0, "last_played": 1448750560}, "language": "english", "review": "Amazing artwork, diverse and loveable characters, and a magical universe that is so detailed and new. I am totally in love with this game/story.", "timestamp_created": 1449004221, "timestamp_updated": 1449004221, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19373668": {"recommendationid": "19373668", "author": {"steamid": "76561198036326350", "num_games_owned": 41, "num_reviews": 1, "playtime_forever": 341, "playtime_last_two_weeks": 0, "last_played": 1449788563}, "language": "english", "review": "Discovered this game from the let's play on the YouTube channel Presshearttocontinue. At first i thought this was just some piece of weeb trash but as i got into the game i was intreged by a combination of the art-style, story and (some-what mixed but charming) voice-acting. If you are unsure about whether to get this game i would highly recommend checking out the first episode of the playthrough on the youtube channel Presshearttocontinue as this would give you a taster of the game. \n\nI'm waiting with bated breath for pt2!", "timestamp_created": 1448829102, "timestamp_updated": 1448829102, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19352914": {"recommendationid": "19352914", "author": {"steamid": "76561198047452208", "num_games_owned": 62, "num_reviews": 2, "playtime_forever": 239, "playtime_last_two_weeks": 0, "last_played": 1464477129}, "language": "english", "review": "PLEASE PLEASE PLEASE PLEAAASEEEE make part two soon! or at least a digital art collection!! \n\n\n", "timestamp_created": 1448768007, "timestamp_updated": 1448768007, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19335854": {"recommendationid": "19335854", "author": {"steamid": "76561198009324513", "num_games_owned": 226, "num_reviews": 3, "playtime_forever": 115, "playtime_last_two_weeks": 0, "last_played": 1448878102}, "language": "english", "review": "well.. this game made me laugh out loud more than once, and made me sad and emotional couple of times, some of the scene transitions seemed a bit abrupt, or the character mood changing seemed some what abrupt at some point.. but\nI never not regretted buying a game for a long time... wait thats a lie, i bought undertale recently... x0...\n....\nalso.. \ni have one last very important spoiler to discuss in a very intelligent and sophisticated matter. So Advace at your own discretion.\n\n\n\n\n-spoilers-\n\n\n\n\n\n\nHepitor the  Master Blass Glower..\nthat is all.", "timestamp_created": 1448720160, "timestamp_updated": 1448720160, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19270127": {"recommendationid": "19270127", "author": {"steamid": "76561198118208140", "num_games_owned": 11, "num_reviews": 1, "playtime_forever": 390, "playtime_last_two_weeks": 0, "last_played": 1448321713}, "language": "english", "review": "Absolutely fantastic game! The world it is set in breaks down typical stereotypes and provides a wide variety of characters to both love and hate. Definitely recommended for anyone who is into choice/consequence games!", "timestamp_created": 1448477224, "timestamp_updated": 1448477224, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.498282", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19253233": {"recommendationid": "19253233", "author": {"steamid": "76561198095978748", "num_games_owned": 59, "num_reviews": 1, "playtime_forever": 315, "playtime_last_two_weeks": 0, "last_played": 1510497169}, "language": "english", "review": "a brilliant story, I have already seen it on youtube but I bought it to support the makers.", "timestamp_created": 1448388114, "timestamp_updated": 1448388114, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502538", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19250664": {"recommendationid": "19250664", "author": {"steamid": "76561198042556071", "num_games_owned": 219, "num_reviews": 31, "playtime_forever": 323, "playtime_last_two_weeks": 0, "last_played": 1448068288}, "language": "english", "review": "Interesting story, nice animation, funny characters.... looking forward to the next part.", "timestamp_created": 1448378151, "timestamp_updated": 1448378151, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.455868", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19236889": {"recommendationid": "19236889", "author": {"steamid": "76561198026915586", "num_games_owned": 797, "num_reviews": 7, "playtime_forever": 227, "playtime_last_two_weeks": 0, "last_played": 1448288631}, "language": "english", "review": "very enjoyable blazed through the game in one sitting", "timestamp_created": 1448300858, "timestamp_updated": 1448300858, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19230321": {"recommendationid": "19230321", "author": {"steamid": "76561198065773548", "num_games_owned": 76, "num_reviews": 1, "playtime_forever": 263, "playtime_last_two_weeks": 0, "last_played": 1447492313}, "language": "german", "review": "A Visual Novel with a really intriguing story and amazing art. It builds an interesting world with a lot of potential and I hope that for future parts we get the opportunity to explore it more. The characters are diverse and compelling and I like the choices we get to make considering the protagonist's personality and reactions. However sometimes I would've liked to have more options, [spoiler] like when we had the choice to kiss or slap Hector I would have preferred one where we just talk or do nothing. [/spoiler] I also feel like the finale had a lot of missed opportunities for possible choices. But maybe I'm just too used to Telltale Game's sort of choice-system.\n\nI also had some trouble with the story from time to time. While I love that it tries to be progressive, it sometimes feels forced and takes away from the main plot because of that. It has trouble finding a balance between world-buliding and character-/romance-building. While it doesn't give a lot of exposition on the first, it just drops a lot of it on the latter. That bugging me  can of course only be my personal preference.\n\nAll in all I would definetly recommend Brilliant Shadow to anyone looking for an intiriguing Visual Novel set in a refreshing fantasy world. Personally, I couldn't stop playing until I finished the first ending of the story. Looking forward to more.", "timestamp_created": 1448265172, "timestamp_updated": 1448265172, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19224209": {"recommendationid": "19224209", "author": {"steamid": "76561198060320050", "num_games_owned": 120, "num_reviews": 7, "playtime_forever": 158, "playtime_last_two_weeks": 0, "last_played": 1448229072}, "language": "english", "review": "Hands down the best visual novel ive had the pleasure of playing. Rather than just being a cheap wish fulfillment fantasy, there are some truly interesting emotional disections at play, the characters are wonderfully multi faceted.\nNot to mention, I loved all feminist undertones, freaking awsome!", "timestamp_created": 1448229193, "timestamp_updated": 1448229193, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19221431": {"recommendationid": "19221431", "author": {"steamid": "76561198076633215", "num_games_owned": 126, "num_reviews": 1, "playtime_forever": 85, "playtime_last_two_weeks": 0, "last_played": 1448217552}, "language": "english", "review": "VN's aren't my usual forte. In fact, I'd probably not pay attention to this game were it not for a YT vid showcasing it in my feed. But it instantly caught my attention with really polished production values for that kind of game- the artwork is detailed, pleasant to eye with good mix of earthy and vibrant tones and manages to vary enough to make it look like it's not all taking place in one white hallroom. The character artwork is animate and expressive (again, within the limitations of the medium- the horseriding sequence really could've used a separate character model) and the style fits the setting of the story.\n\nThe other thing I have noticed is the voice acting. That is, to my knowledge, a rarity in VN's, and most characters seem to be cast well. A few minor issues with delivery here and there, but nothing glaring. My one real issue would be sound volume- I assume the reason is that the VA's were recording in different studios, but some of the lines sound clear and crisp, while some sound muted or muffled. Still..it's fully acted and the three main characters are very easy on the ear (Hector's performance in delivering the deadpan lines was perfect).\n\nMusic is very good, and I'd gladly use it as a background for pen and paper RPG session. \n\nNow, as to the story itself, it's decent. The writing isn't Hugo-winning, but it got me invested into what seemed at first to be a simple  coming of age story. The characters are all easy to like, the plot flows fairly fast and without major stuttering, and it even manages to build good suspense, and there wasn't a single moment where I cringed...a feat that not all mainstream dev studios manage. The writers were well aware of the trappings of the genre, and delivered a solid story (not without some plotholes) within it. Solid enough that I definetely want the next chapter.\nI would also love for the world to be more populated. The Mountain seems to be existing in a desolate void. We know there's the kingdom, and in the last few minutes of the story we get rushed attempt as establishing the world, but still, a rough sketch of the world as known by the characters would be great.\n\nOne minor thing that was slightly grating: Dear writer,we get it. People of all genders, sexes and walks of life have the right to love and should not be prejudiced against. Pretty sure no one who disagrees with that notion will be playing this game, so...spare us the heavy-handed \"only a primitive would\" lines next time, it's preaching to the choir.\n\nDespite minor flaws, I'd still recommend the game if you want to read something nice, romance-themed and in fantasy setting. The visuals and soundwork are high quality, and the story solid if not breaking any new grounds. I'd liken the experience to Old Kingdom trilogy in terms of tone, or one of Gaiman's earlier novels, like the Stardust.\n\nDo not play if girls kissing girls and not kissing you make you upset.", "timestamp_created": 1448219634, "timestamp_updated": 1448219858, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.543147", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19186451": {"recommendationid": "19186451", "author": {"steamid": "76561197994057162", "num_games_owned": 219, "num_reviews": 21, "playtime_forever": 355, "playtime_last_two_weeks": 0, "last_played": 1448238964}, "language": "english", "review": "A very entertaining and beautifully-illustrated story. The voice acting and music are fantastic as well. I can't wait to see the other two endings.\n\nUpdate after reading all three endings:\n\nThe two good endings are quite similar, and I would have preferred more differences between them. The third ending is obviously just for fun and non-canonical, and I enjoyed it. All three endings are somewhat abrupt and rushed, especially certain character interactions which I won't spoil. (Perhaps they ran out of funds?) That said, it was still very entertaining, and I'm quite attached to most of the cast. I'm especially fond of the method used to determine which ending the player receives; it fits in with the theme of the game very well.\n\nI don't usually read fanfics, but I'm so eager for part 2 that I find myself hoping some of the more talented writers over at fanfiction.net pick this game up during the wait. :)", "timestamp_created": 1448084318, "timestamp_updated": 1448252043, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19184787": {"recommendationid": "19184787", "author": {"steamid": "76561198011491790", "num_games_owned": 149, "num_reviews": 2, "playtime_forever": 216, "playtime_last_two_weeks": 0, "last_played": 1446945348}, "language": "english", "review": "The storyline in this game is the worst I've seen in a pretty long time, it starts out really well, but goes further and further downhill as the game goes on.   At the beginning the protagonist and her true love's relationship is set up very nicely, they're best friends since childhood and now that they're adults they're set to complete their magical bonding ritual which will be the beginning of their lives together.  It's great stuff, you're definitely invested in their relationship.  But something goes wrong, leaving your main character bonded to an alien (who you don't even really meet until near the end of the game) and your true love bonded to a super annoying dude.  Of course that's all OK, since, you would assume, True Love will overcome even the power of magic, and it'll lead to a great and happy ending, or so you would expect.  The problem is, at least in this game, True Love doesn't overcome the bonds of magic, you'll spend the entire game trying to overcome it, but you'll fail at every turn, all your choices essentially lead to the same depressing result.   Eventually your character is simply alone and miserable, and as a conclusion to this terrible story, the only two other lesbian characters in the game are revealed to be bad guys, and your character has to kill them.  But wait, after everything's been terrible and depressing the entire game, at the very end you meet the alien you're bonded to, and, since your character is going to be extremely attracted to it no matter what it looks like because of the power of the magic of the pairing ritual, it's a good thing that it at least appears to be female.  The end.  Of course, the Title suggests that it is 'Part One' so perhaps in the next game your character will be able to finally break the bonds of the 'pairing ritual', get away from the alien and get your true love away from the super annoying dude, and finally live Happily Ever After, but there's no happily ever anything in this Part One, so I'd suggest waiting to see if things get better in the next one before playing this one.", "timestamp_created": 1448074762, "timestamp_updated": 1448074762, "voted_up": false, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.239384", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19183955": {"recommendationid": "19183955", "author": {"steamid": "76561198042405542", "num_games_owned": 78, "num_reviews": 13, "playtime_forever": 407, "playtime_last_two_weeks": 0, "last_played": 1448062081}, "language": "english", "review": "It is an amazing game, I love the art and choices, the world and story is an amazing fantasy world, that I want to explore more with the possibility's the end presents, while also feeling satisfied with the endings at the same time, which is a task many games fail to accomplish. as with everything however, there is a downside, I felt as if the sudo animations where odd, the visual of a horse head moving up and down while the characters are moving out of sync with it, the characters are just in there usual pose making it strange when its obvious they aren't actually riding the horse, all while the background is also moving at an odd pace in the wrong direction, this does take away from the game, I still love it, but it is a complaint. However all in all I heartily recommend this game even if you don't play this style of game but love amazing story.", "timestamp_created": 1448070427, "timestamp_updated": 1448070427, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.498282", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19167967": {"recommendationid": "19167967", "author": {"steamid": "76561198007685720", "num_games_owned": 244, "num_reviews": 7, "playtime_forever": 96, "playtime_last_two_weeks": 0, "last_played": 1447986100}, "language": "english", "review": "Hepitor. Master Blass Glower. In other words, don't skip everything at the end.\n\nMy first visual novel. I didn't have so much fun in a looooong time. Only \"kinda annoying\" thing is that they want to push as many gay characters as they possible can. But hey, it has awesome story.\n\nOh and about time I played - I watched let's play before I couldn't wait longer for videos and just blazed through it myself.", "timestamp_created": 1447986301, "timestamp_updated": 1447986386, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19162662": {"recommendationid": "19162662", "author": {"steamid": "76561198058989000", "num_games_owned": 68, "num_reviews": 1, "playtime_forever": 650, "playtime_last_two_weeks": 0, "last_played": 1448188893}, "language": "english", "review": "I have played through Evil and Good route (took me 9h).\nThere are three things I value, story, world and characters.\nThis game had great story which could be easily followed. Evil route end was horrified and good route made me smile like they suppose to.\nI got to learn what small bits about the world I needed to but I wish I could learn more.\nCharacters were all charming in their own ways which was good. I like realistic romance which goes somewhere and I was satisfied with most of the romance both the sad and the happy parts but the end romance felt rushed and not realistic as if the developers ran out of time.\n\nTL;DR\nLoved it but could have been better! This is worth the price especially if in sale.\n\nWould like to thank the developers for answering to few of my questions!\nAccording to them second part is currently being written and they wish to release it in a year, no idea when exactly.\nI hope this review was useful.", "timestamp_created": 1447959220, "timestamp_updated": 1447959305, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19161863": {"recommendationid": "19161863", "author": {"steamid": "76561197986997067", "num_games_owned": 403, "num_reviews": 23, "playtime_forever": 292, "playtime_last_two_weeks": 0, "last_played": 1447628127}, "language": "english", "review": "A fun and engaging story with great character development. One 'hek' of a story.", "timestamp_created": 1447955532, "timestamp_updated": 1447955532, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.455528", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19161673": {"recommendationid": "19161673", "author": {"steamid": "76561198048336909", "num_games_owned": 474, "num_reviews": 13, "playtime_forever": 359, "playtime_last_two_weeks": 0, "last_played": 1447953926}, "language": "english", "review": "I'm not a big fan of visual novels. I think they seem to drag a lot of the time but this one kept my attention right up to the very end and a little longer to see the bloopers. The story is great and all the characters to and I can't wait to see the part 2 already. \n\nActually I'm dying for it to come out. I can't wait. >w<", "timestamp_created": 1447954658, "timestamp_updated": 1447954658, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19156344": {"recommendationid": "19156344", "author": {"steamid": "76561198030383324", "num_games_owned": 616, "num_reviews": 3, "playtime_forever": 288, "playtime_last_two_weeks": 0, "last_played": 1447923814}, "language": "english", "review": "I'm too lazy to review it thoroughly, so I'll just say, that I will definitely support this developer.", "timestamp_created": 1447924221, "timestamp_updated": 1447924221, "voted_up": true, "votes_up": 12, "votes_funny": 8, "weighted_vote_score": "0.528018", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19153460": {"recommendationid": "19153460", "author": {"steamid": "76561198078551273", "num_games_owned": 96, "num_reviews": 4, "playtime_forever": 226, "playtime_last_two_weeks": 0, "last_played": 1452999404}, "language": "english", "review": "I really enjoyed this. Queer relationships are quite uncommon in gaming it's really nice to see a queer relationship outside of open world freedom of choice games like Skyrim and Fallout. The diversity of the cast is refreshing, the art is great, the music is great, the romance is great, the voice acting is great, the character design is great. I can't wait to see more of this world and the main characters.\n\nDefinitely worth $7\n\nTL:DR\n+lots of queer relationships\n+soundtrack\n+art\n+voice acting\n+ethnic diversity\n+character design\n+world is quite intriguing \n\n-some people might find it a bit cheesy but I didn't personally\n\n\nCredit to Dodger for bringing this game to my attention.", "timestamp_created": 1447900569, "timestamp_updated": 1447901409, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.506666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19145411": {"recommendationid": "19145411", "author": {"steamid": "76561198088246383", "num_games_owned": 15, "num_reviews": 3, "playtime_forever": 197, "playtime_last_two_weeks": 0, "last_played": 1447823005}, "language": "english", "review": "Brilliant Shadows is interesting visual novel with great music and even a greater story. The voice acting is well done and it's really refreshing to come across a fantasy that is as diverse at this one. However, for as progressive as it is I am a bit thrown off how other characters seem to treat Hektor. [spoiler] I'm pretty sure he is suppose to be autistic and while I do think it is realistic that characters will be annoyed by him at times. It's a bit jarring to see people hit him and even describe him by using abelist slurs. [/spoiler]\n\nI'm also disappointed with writing at times. There are moments where there should dramatic tension yet seems to be brushed off or ignored. [spoiler] Two examples, I can think of this is when Prude finds out Hektor is a Gray Mage and is clearly upset about it, to the point of being brought to tears. Yet almost immediately in the next scene we see Prude seeming completely okay by it. Yes, time may have past but the audience still need to see how Prude came to terms with her lover being what she considers a monster. Also, the scene where Ash finds a dead gray mage in her room and the characters seem to talk about it as if they are discussing the weather??? The game tries to explain it away by saying 'they're use to it because it's been happening to them a long time' but this only has been happening to them for a few weeks at most. [/spoiler] \n\nAlso the ending felt rushed. I also think that certain revelation in the end could have been saved for the next part of the game.  [spoiler] Ash suddenly being in love with Terra, even with the whole 'pairs' concept, seems unrealistic to me.[/spoiler] That's something that could have possibly been developed better in the next part of the game\n\nHowever, despite my complaints the game does have an exciting plot that makes me interested in the next part of the game. And the characters are all interesting and unique which makes you truly care what happens to all of them, even the villians.\n\nSo, yeah. I think Brilliant Shadows is a cool game that needs just a bit more work with it's writing. \n\n3.5/5", "timestamp_created": 1447860123, "timestamp_updated": 1447860123, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.498502", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19141562": {"recommendationid": "19141562", "author": {"steamid": "76561198015041100", "num_games_owned": 879, "num_reviews": 12, "playtime_forever": 473, "playtime_last_two_weeks": 0, "last_played": 1447547258}, "language": "english", "review": "6/10.\n\nThe game starts out good, the voice acting is great and the art is sufficient.\nWhile the setting is unique the game has a lot of similarities to bad fanfiction, (the primary characters are significantly more powerful than any other character in the game doing things that seem 'impossible' to other characters in the setting, they fall prey to 'special snowflake' syndrome, (ash doesn't know who her pairing is for most the game, merely that they are mysterious and extremely powerful, she is capable of ressurecting plants something noone else can do, as well as inexplicably being capable of casting spells and magics that others can't, handily defeating foes that would have killed her otherwise. Prude is a princess, and is the object of half the primary casts affections. Hek is stronger than the Heads of the school, and has powers that essentially have 'mary sue' written all over it. SPOILERS, DO NOT READ PAST THIS POINT: Ash's pairing partner turns out to be a changeling/elf thing, and not only does it handily solve the final confrontation, but it also saves their lives thruoghout the entire game, demonstrating overwhelming power and skill for no reason, this character, (as we have seen it so far) is just a straight up mary sue, she has no real negative characteristics, being an extremely power magical creature, when she meets her ash seemingly just decides that she is over prude, dismissing what had up until that point been a major plotpoint) to further reinforce this similarity to fanfiction is the 'pairing' itself, which anyone with a passing familiarity with the Harry Potter fandom will probably recognize as a extremely cliche trope of that genre, it's essentially just soul-bounding or veela mates or whatever other flavor they choose to call it that week, with the pairing making both parties stronger, as well as somehow magically determining that they are 'destined for eachother' or some bullcrap like that. This makes the overall story feel weaker, at least for me, but since it is the central conceit of the story I will overlook it.\n\nYou may have noticed that the (horribly rambly) paragraph above is very critical, yet this is a positive review, and there is a reason for that: Hek. Hek single handedly makes this game, his characterization is amazing, and while the rest of the plot is a load of BS Hektor is interesting enough to keep you playing.\n\nOverall it's story is nothing special, it's plot being a collection of cliches that have been overused so often that there is no way to take them seriously anymore, but it's still interesting enuogh to pick up. (maybe wait for a sale though).", "timestamp_created": 1447835825, "timestamp_updated": 1447835825, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19141553": {"recommendationid": "19141553", "author": {"steamid": "76561198028000162", "num_games_owned": 185, "num_reviews": 2, "playtime_forever": 260, "playtime_last_two_weeks": 0, "last_played": 1447834850}, "language": "english", "review": "Only got the Second ending so far, will probably update with further playtime, but this game is phenomenal. I watched Dodger play this on Youtube and couldn't wait until she played more to see the story for myself. I was not disappointed in any way whatsoever by this purchase. This game took me on a four hour emotional ride, leaving me laughing, damn near crying, feeling anxious, and excited for more.\n\nAlso, there is a blooper reel at the end of the game which showed a character I never saw during game time. This leads me to think there are a few branching storylines or at least a few \"exclusive\" ways to get to one of the three endings. \n\nThis game left me wanting more, wanting to forgo a night's sleep to play it over again to experience the story I missed. I look forward to the continuation of this story, so please buy it. I highly doubt you will regret the Seven dollar purchase.\n\nIt's just wonderful. Fucking Wonderful.\n\n10/10 - Buy this. I want a sequel.", "timestamp_created": 1447835705, "timestamp_updated": 1447835705, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19136202": {"recommendationid": "19136202", "author": {"steamid": "76561198074269311", "num_games_owned": 20, "num_reviews": 1, "playtime_forever": 319, "playtime_last_two_weeks": 0, "last_played": 1448812107}, "language": "english", "review": "I saw Dodger's first episode of this and since the game is only 7€, I bought it and loved the shit out of it. No spoilers, I was really glad to see how the choices changed the story, and was happy with my ending (ending two). I can't wait for more! The voice acting and soundtrack are superb. Though a tad bit shorter than I expected and a couple of meh things, still worth every penny.", "timestamp_created": 1447798635, "timestamp_updated": 1447798635, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502712", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "19129721": {"recommendationid": "19129721", "author": {"steamid": "76561198045738157", "num_games_owned": 44, "num_reviews": 9, "playtime_forever": 432, "playtime_last_two_weeks": 0, "last_played": 1447732430}, "language": "english", "review": "This is a beautiful visual novel with a great story that constantly leaves you wondering what will happen next. The voice acting is actually very well done, and the visuals (while sometimes repeated for different scenes) are beautifully drawn. The story really pulls you in and the twist at the end is not something you are likely to see coming. \n\nI would say honestly the only thing that made me \"raise an eyebrow\" so to speak was the many ways relationships and families were portrayed in the story. It's not that they were non-traditional, it was more that it almost felt like the author tried to jam as many non-traditional families and parings into the story as possible. So it felt just a little forced, this did not take away from the overall story however.\n\nHonestly I can hardly wait for part two of this story, I want to know what happens to Ash and her pair and what becomes of the other protagonists and antagonists of the story. I really enjoyed streaming this story to the fans of my Youtube channel, CatNightTV. A big thanks to the developers and voice actors for thier hard work!", "timestamp_created": 1447771653, "timestamp_updated": 1447771653, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19129417": {"recommendationid": "19129417", "author": {"steamid": "76561198212764807", "num_games_owned": 72, "num_reviews": 1, "playtime_forever": 338, "playtime_last_two_weeks": 0, "last_played": 1447769750}, "language": "english", "review": "Good VN", "timestamp_created": 1447770076, "timestamp_updated": 1447770076, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19125988": {"recommendationid": "19125988", "author": {"steamid": "76561197983490335", "num_games_owned": 206, "num_reviews": 1, "playtime_forever": 389, "playtime_last_two_weeks": 0, "last_played": 1447745084}, "language": "english", "review": "Refreshing, unique, and captivating.\n\nA little background about myself - I'm not a big visual novel 'buff', the most experience I have in such games would be the Phoenix Wright games on handheld, but after watching a youtube video of the game, I was immediately drawn to the story presented, and after doing a little bit more research, promptly purchased the title and completed my own playthrough several times to get the different endings, and little changes in plot based on choices.\n\nGiven that I've just explained I'm not big into visual novels as a gamer, I still enjoy a good story, and this title definitely has a good story. Presenting a very different world from the norm in most media, with Necromancy not necessarily being evil but instead another school of magic that's balanced out by Light magic, the game does a good job presenting the basic principles of the world at a good pace, and the player also gets the opportunity to learn more about the world if the right choices are made.\n\nI learned that the voice acting in the game (FULLY voice acted) was actually a stretch goal of it's kickstarter, and I have to say it helped breath life to the characters, and it was quite refreshing to hear new and different talent in an industry that sometimes feels only a handful of voice actors are always given work. (I hear voice actors like Jennifer Hale and Steve Blum across a LOT of titles, across different mediums, and while definitely great voice actors, it's once again so refreshing hearing new talent).  While the writing can also stand on it's own, the acting definitely helps you understand what kind of personality each character exhibits, and makes them that much more memorable. From the character designs to the backgrounds, the artstyle is also beautiful to look at, and speaks of the artist's talent in presenting this world and the people who live in it.\n\nThere are some games, or even TV shows, that you can play or watch for a while, and then you need to take care of something else. Then there are others that grab your attention so much that you forget where the time went, or you're compelled to finish in one sitting. This is one of those games. I finished my first playthrough until the wee hours in the morning (totally worth it xD). I'm so glad this is part one, as I cannot wait to see what else this indie dev will bring out next in the story.", "timestamp_created": 1447748082, "timestamp_updated": 1447748082, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.511303", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19122776": {"recommendationid": "19122776", "author": {"steamid": "76561198038746009", "num_games_owned": 111, "num_reviews": 3, "playtime_forever": 432, "playtime_last_two_weeks": 0, "last_played": 1447731223}, "language": "english", "review": "That was pretty awesome. Definitely enjoyed the ending.", "timestamp_created": 1447724084, "timestamp_updated": 1447724084, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19122775": {"recommendationid": "19122775", "author": {"steamid": "76561197995752227", "num_games_owned": 74, "num_reviews": 6, "playtime_forever": 272, "playtime_last_two_weeks": 0, "last_played": 1447653578}, "language": "english", "review": "It took about 4 hours for me to proceed through this first chapter and I was entertained the entire time.  The voice acting is good, the animation is quite nice, and the story engaging enough to keep you entertained. However, it is not obvious how your decisions influence the end of the story, which is both irritating and complelling.   It is a good value for your dollar.", "timestamp_created": 1447724082, "timestamp_updated": 1447724082, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19121030": {"recommendationid": "19121030", "author": {"steamid": "76561197999864964", "num_games_owned": 1284, "num_reviews": 69, "playtime_forever": 287, "playtime_last_two_weeks": 0, "last_played": 1447308010}, "language": "english", "review": "There are three different endings, with several smaller branching paths, but I only managed to get one so far. And Brilliant Shadows is pretty lengthy, at least for a visual novel. After several hours of reading through the text I didn’t want it to end. This is something that only the most gripping stories have managed to invoke in me. Which obviously means that I’d love to see a sequel in the future should there be plans for one.\n\nhttp://cliqist.com/2015/11/16/feel-balance-light-dark-brilliant-shadows/", "timestamp_created": 1447714317, "timestamp_updated": 1447714317, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.503422", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "19107336": {"recommendationid": "19107336", "author": {"steamid": "76561198130402546", "num_games_owned": 158, "num_reviews": 19, "playtime_forever": 309, "playtime_last_two_weeks": 0, "last_played": 1468469767}, "language": "english", "review": "This game has a diverse set of characters all well written and interesting and with depth. It has an interesting story that while is a complete game in itself at least when it comes to Ash's story, it leaves you wanting to know more about the setting that Brilliant Shadows provides you. \n\nI definately recomend you to play this game, the game is roughly 3-4 hours in length to get all 3 endings and yet it's 3-4 hours worth of quality writting.", "timestamp_created": 1447643107, "timestamp_updated": 1447643138, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "19107186": {"recommendationid": "19107186", "author": {"steamid": "76561198104653470", "num_games_owned": 102, "num_reviews": 7, "playtime_forever": 332, "playtime_last_two_weeks": 0, "last_played": 1447642361}, "language": "english", "review": "Interesting story. Lots of diversity. My only issue is that taking certain options causes details to be left out making some conversations hard to follow.", "timestamp_created": 1447642228, "timestamp_updated": 1447642228, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19087121": {"recommendationid": "19087121", "author": {"steamid": "76561198035015556", "num_games_owned": 99, "num_reviews": 3, "playtime_forever": 204, "playtime_last_two_weeks": 0, "last_played": 1447564323}, "language": "english", "review": "I enjoyed this. Quick story, though it had several sub plots, and bits that honestly didn't make sense to be there (the scene with the cook especially). Voice acting was more than tolerable, though some of the accents felt a bit forced. Art was very descriptive and pleasent to look at if the \"animations\" were pretty laughable, but thats not unexpected for this genre.Ending was a mix of predicitable and suprising, I look foreward to the next installment as the end to this first bit was rather fast. Yay blooper reel. Solid 7/10", "timestamp_created": 1447564620, "timestamp_updated": 1447564620, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19084919": {"recommendationid": "19084919", "author": {"steamid": "76561198024249360", "num_games_owned": 229, "num_reviews": 4, "playtime_forever": 403, "playtime_last_two_weeks": 0, "last_played": 1447553714}, "language": "english", "review": "It was a truly Enjoyable experience. The Characters were rich and developed, VA was awsome, the world was introduced slowly with hinting at greater adventures and settings. Action and fights were well written", "timestamp_created": 1447553861, "timestamp_updated": 1447553861, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19084704": {"recommendationid": "19084704", "author": {"steamid": "76561198111176194", "num_games_owned": 13, "num_reviews": 1, "playtime_forever": 420, "playtime_last_two_weeks": 0, "last_played": 1447734652}, "language": "english", "review": "I'm gushing about this game. I just found it yesterday through Dodger on YT and had to rush to buy it. The diverse races and sexual orientations for its characters set this apart from a lot of other games. Ash, Prude, and the gang all feel very real and the voice acting cast is really good too. I'm finding myself craving another chapter and look forward to supporting this game in the future.", "timestamp_created": 1447552768, "timestamp_updated": 1447552768, "voted_up": true, "votes_up": 80, "votes_funny": 2, "weighted_vote_score": "0.832078", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19084488": {"recommendationid": "19084488", "author": {"steamid": "76561197996718124", "num_games_owned": 120, "num_reviews": 2, "playtime_forever": 1016, "playtime_last_two_weeks": 0, "last_played": 1493654445}, "language": "english", "review": "I bought this game after watching five minutes of it on PressHeartToContinue's youtube channel, the voice acting and art looked amazing and I wanted to check it out for myself instead of waiting to see it on youtube.  After playing through it, the only thing I regret is not know about it sooner so I could have backed it as a kickstarter.\n\nI normally don't buy visual novels, but the voice acting and hilarious dialogue made this game one of my favorites.", "timestamp_created": 1447551609, "timestamp_updated": 1447551664, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19083947": {"recommendationid": "19083947", "author": {"steamid": "76561198058899008", "num_games_owned": 39, "num_reviews": 2, "playtime_forever": 166, "playtime_last_two_weeks": 0, "last_played": 1447548525}, "language": "english", "review": "While it is part 1, it was a full story.\nengaging, interesting and reminds me of PC adventures from the 90s", "timestamp_created": 1447549061, "timestamp_updated": 1447549061, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19080745": {"recommendationid": "19080745", "author": {"steamid": "76561198062794060", "num_games_owned": 84, "num_reviews": 3, "playtime_forever": 241, "playtime_last_two_weeks": 0, "last_played": 1447536553}, "language": "english", "review": "THIS VISUAL NOVEL IS AMAZING!\nI love it.", "timestamp_created": 1447536719, "timestamp_updated": 1447536719, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19073467": {"recommendationid": "19073467", "author": {"steamid": "76561198066901757", "num_games_owned": 19, "num_reviews": 2, "playtime_forever": 630, "playtime_last_two_weeks": 0, "last_played": 1448807786}, "language": "norwegian", "review": "This visual novel is indeed brilliant. Once I started it, I had to force myself to stop to go to sleep, because I was so captured in it. When I woke ut I imediatly started playing it again until I finished part one. Ahhhh, I want more so badly.", "timestamp_created": 1447515193, "timestamp_updated": 1447515193, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "19073161": {"recommendationid": "19073161", "author": {"steamid": "76561198043677555", "num_games_owned": 83, "num_reviews": 2, "playtime_forever": 232, "playtime_last_two_weeks": 0, "last_played": 1447468578}, "language": "english", "review": "Beautiful art, lovely voice acting, an intriguing premise, a great sense of humour and to top it all off, an awesome story. Can't wait for the next part!!!", "timestamp_created": 1447514095, "timestamp_updated": 1447514095, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19000412": {"recommendationid": "19000412", "author": {"steamid": "76561198047825747", "num_games_owned": 129, "num_reviews": 3, "playtime_forever": 233, "playtime_last_two_weeks": 0, "last_played": 1447198796}, "language": "swedish", "review": "Easily one of the best visuals novels I've read/played. An interesting story, characters with real depth and personality and mostly beautiful visuals. Truly good :)", "timestamp_created": 1447197929, "timestamp_updated": 1447197929, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18982605": {"recommendationid": "18982605", "author": {"steamid": "76561197967093184", "num_games_owned": 1843, "num_reviews": 26, "playtime_forever": 139, "playtime_last_two_weeks": 0, "last_played": 1447131027}, "language": "english", "review": "Lesbian plant necromancer game delivers on premise. Kinda short and the writing feels a little... amateurish at times, but if the premise interests you at all and you enjoy visual novels, it's a treat.", "timestamp_created": 1447132102, "timestamp_updated": 1447132102, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.463320", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18977412": {"recommendationid": "18977412", "author": {"steamid": "76561198132543155", "num_games_owned": 209, "num_reviews": 6, "playtime_forever": 1054, "playtime_last_two_weeks": 0, "last_played": 1507436557}, "language": "english", "review": "Absolutely amazing and worth every penny (and then some) so happy I helped kickstart this\n\nThe story is full of twists and turns and interesting characters, the art is lovely, the music is ambient\n\nReally what more do you need", "timestamp_created": 1447105611, "timestamp_updated": 1447105611, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500907", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18963220": {"recommendationid": "18963220", "author": {"steamid": "76561197998913217", "num_games_owned": 269, "num_reviews": 7, "playtime_forever": 334, "playtime_last_two_weeks": 0, "last_played": 1507719097}, "language": "english", "review": "Well I bought this game on impulse because it looked interesting. I was hoping it would be good and I was pleased to find that I enjoyed it very much. I have finished the game, though my play time numbers may not reflect this as I read very fast and was able to get through the non-voiced part at quite a pace. A good thing to note is : While this is only part one of hopefully a lot more to come, the story is self is quite complete. There are questions that still needs answering, but the game ends on a satisfying note.", "timestamp_created": 1447027452, "timestamp_updated": 1447027452, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18943252": {"recommendationid": "18943252", "author": {"steamid": "76561198008771226", "num_games_owned": 192, "num_reviews": 7, "playtime_forever": 221, "playtime_last_two_weeks": 0, "last_played": 1509831938}, "language": "english", "review": "While i cannot do the game justic here. There are others that can, Please look for another reveiw of the game as i can not bring to words why you should or shouldnt buy this game.\n\nMy only regreat with the game. Was not kickstarting for more. I loved it to death as ive played through it multple times.\n\nIf you decide to pick it up aswell, i hope you enjoy it as much as i did.", "timestamp_created": 1446946635, "timestamp_updated": 1446951602, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18942318": {"recommendationid": "18942318", "author": {"steamid": "76561197995699592", "num_games_owned": 1234, "num_reviews": 6, "playtime_forever": 222, "playtime_last_two_weeks": 0, "last_played": 1446938249}, "language": "english", "review": "It's a good, well written game...  But kinda short. I loved both the characters and their voice actors. Looking forward for the rest of the story.", "timestamp_created": 1446941943, "timestamp_updated": 1446941943, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18939001": {"recommendationid": "18939001", "author": {"steamid": "76561198009986252", "num_games_owned": 982, "num_reviews": 65, "playtime_forever": 956, "playtime_last_two_weeks": 0, "last_played": 1507097249}, "language": "english", "review": "[h1]As Brilliant As The Name Suggests[/h1]\n\nAn excellent visual novel. As a backer from their kickstarter campaign, I had high hopes after sampling Ithaqua Labs' prior work, Jacob's Island, and after finishing my first playthrough of Brilliant Shadows, I am delighted with this game. Suffice to say my expectations were exceeded.\n\nIf you have never played a visual novel style game before, or even if you have and maybe didn't take to it very much, I think Brilliant Shadows is a great starting/re-entry point to visual novels in general.\n\nIt is very well presented and well written. Characters are believable and relatable. You start to feel for their predicaments with surprising ease, and the story sucks you right in.\n\nPlaytime for a single playthrough took upwards of 3 hours for me, which is fairly good for a visual novel game. As it is not a so-called \"kinetic\" novel (one with a single story and no branching paths) there are thankfully multiple paths that can be taken, and multiple endings to receive, so this will increase play time considerably. Even assuming you use the skip feature on subsequent playthroughs, getting all the endings is likely to take at least 5 hours or so I would guess. Playing through it normally, probably more like 8 or 9.\n\nI was graced with Ending #1 upon my first completion, and it was quite a satisfying one. Despite the \"Part One...\" in the game's subtitle, while it is clear there is more to come in future games, this first part doesn't exactly leave you hanging either. It felt like a satisfying place to end the first \"book\" if you will, and since there are multiple paths in the story to take, I look forward to seeing the significance of the other available routes and endings in subsequent replays of Brilliant Shadows.\n\nWithout spoiling anything, I'll just say the final moments of Ending 1 and the epilogue were quite touching, thanks to a very creative surprise twist.\n\nAll spoken dialog lines in the game have actual voicework, and it was well executed. The voices took me a bit to get used to at first, but that sensation quickly faded.\n\nUsually adding voices to visual novels is a bit of a gamble. The quality usually ends up polarized from what I have seen, but those fears are unfounded in this case. Everyone did a great job with their delivery of the lines, none of them seemed unnatural or like they were a poor fit to their characters. It all just worked out quite well, and I hope to hear more from this talented cast in future Ithaqua Labs games.\n\nArtwork was incredible. There's really no beating around the bush there. Characters, background scenery, UI flourishes, CG scenes, animations....all of it gorgeous and very fitting to bringing the world to life. Just excellent.\n\nThe music score was pleasing as well. It felt fitting to various scenes. While I didn't get the feeling that it stood out as incredibly memorable per se, it also didn't need to be. The important point for me to drive home is that it wasn't distracting. It didn't feel out of place. It's a good solid score for evoking and complementing the scene-appropriate emotions, and I really have nothing bad to say about it.\n\nI highly recommend Brilliant Shadows. It has all of the things a great visual novel should, and I'm eagerly (but patiently)  awaiting Part Two of the Book of Gray Magic (and part three? four? .... alright I'll stop being greedy.)\n\n", "timestamp_created": 1446929805, "timestamp_updated": 1446929805, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.551282", "comment_count": "4", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18934031": {"recommendationid": "18934031", "author": {"steamid": "76561198077907555", "num_games_owned": 484, "num_reviews": 63, "playtime_forever": 100, "playtime_last_two_weeks": 0, "last_played": 1446949402}, "language": "english", "review": "I'm still not very far into this game and honestly, I wasn't expecting to like it all that much. Visual novels have been very hit or miss with me, but this game is fantastic and all the characters are fun. I really like seeing them interact. I would highly recommend it.", "timestamp_created": 1446915001, "timestamp_updated": 1446915001, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.489774", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18928465": {"recommendationid": "18928465", "author": {"steamid": "76561198066501216", "num_games_owned": 403, "num_reviews": 22, "playtime_forever": 265, "playtime_last_two_weeks": 0, "last_played": 1446897572}, "language": "german", "review": "Eine der besten (für mich DIe Beste) VN dich ich bisher gespielt habe.\n\nGeniale Story, Super Syncro, rundum gelungen.\n\nEinziges Contra das Artwork ist nicht wirklich meins (ist aber eh geschmackssache).\n\nKann es kaum erwarten den nächsten Teil zu spielen (hoffe zumindest das noch ein weiterer kommt)", "timestamp_created": 1446897869, "timestamp_updated": 1446897869, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18919453": {"recommendationid": "18919453", "author": {"steamid": "76561198013965596", "num_games_owned": 663, "num_reviews": 6, "playtime_forever": 375, "playtime_last_two_weeks": 0, "last_played": 1448040225}, "language": "english", "review": "I backed this game on kickstarter and I am absolutely satisfied, the art is gorgeous, the writing is fun and feels genuine, and I am already looking forward to the sequel... Which I will also help kickstart if I were to get the opportunity!", "timestamp_created": 1446854983, "timestamp_updated": 1446854983, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.469799", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18900661": {"recommendationid": "18900661", "author": {"steamid": "76561198012042488", "num_games_owned": 534, "num_reviews": 6, "playtime_forever": 421, "playtime_last_two_weeks": 0, "last_played": 1459067433}, "language": "english", "review": "Not usually a fan of VNs but this was really good, quality voice acting and very authentic feeling characters.\nDefinitely worth replaying to get all 3 endings.", "timestamp_created": 1446775296, "timestamp_updated": 1446775296, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.478723", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18896518": {"recommendationid": "18896518", "author": {"steamid": "76561198022594559", "num_games_owned": 610, "num_reviews": 17, "playtime_forever": 992, "playtime_last_two_weeks": 0, "last_played": 1506854842}, "language": "russian", "review": "Хорошая стори, отличный мир, живые персонажи, все диалоги озвучены и даже хорошо. Из множества играных новелек эта особо понравилась. Жалко нет ачивок и просмотра открытых CG. Концовка полностью стоила нащелкивания всех тех значков безумия при выборах. Хотя есть один минус плохой концовки. Это плохая концовка (\n10 из 10", "timestamp_created": 1446755186, "timestamp_updated": 1446755186, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.609164", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18895998": {"recommendationid": "18895998", "author": {"steamid": "76561198032085683", "num_games_owned": 194, "num_reviews": 2, "playtime_forever": 296, "playtime_last_two_weeks": 0, "last_played": 1446699865}, "language": "english", "review": "Full disclosure: I backed this game on Kickstarter. Mostly on a whim. \n\nBut I am so glad I did. \n\nIf you like visual novels, you really can't go wrong with this title. The voice acting and art are great. The story is very immersive. It's one of the first VNs where immediately after finishing it I wanted to start over to explore other options. Normally I need to take a break, but I walked away needing to know more. I can't wait for the next installment.", "timestamp_created": 1446753242, "timestamp_updated": 1446942341, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.584027", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18886358": {"recommendationid": "18886358", "author": {"steamid": "76561198166502075", "num_games_owned": 130, "num_reviews": 1, "playtime_forever": 253, "playtime_last_two_weeks": 0, "last_played": 1449019910}, "language": "english", "review": "Wow, it was such an amazing visual novel!\n\nThe world building was insanely good. I love it--the pairing and everything else! Ash is such a sympathetic character. I really felt for her and her distress.\n\nI really, really like the music! It was awesome. It brought out the mood perfectly.\n\nThe backgrounds were beautiful as well. I like how there are new locations to look at throughout different scenes. The art was overall fantastic, and I like how we get to see the different actions play out with more lovely art.\n\nThe animation was fun to watch as well. I like how the characters aren't too static, and they have various expressions that fit the scene. And it's so cool to watch them blinking when I take a break from the computer. I thought the sledding animation was hilarious. I truly felt immersed in the world. And I really enjoyed the bloopers at the end of the game as well. There was such a nice blend of fantasy, drama, and humor. It was beautiful.", "timestamp_created": 1446702602, "timestamp_updated": 1446702602, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.521277", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18886315": {"recommendationid": "18886315", "author": {"steamid": "76561198045255782", "num_games_owned": 1044, "num_reviews": 22, "playtime_forever": 424, "playtime_last_two_weeks": 0, "last_played": 1446757584}, "language": "english", "review": "I really really enjoy the story of Brilliant Shadows. Great art work, very good story telling well worth the price there asking for it. Even has a blooper reel at the end after the credits. The only down side I can think of it's only part one. At the end they leave you wanting more. Seen 2 of the endings so far very different from one and another which is really great. Would highly reccomend it to give it a try!", "timestamp_created": 1446702253, "timestamp_updated": 1479965103, "voted_up": true, "votes_up": 36, "votes_funny": 3, "weighted_vote_score": "0.779839", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18885148": {"recommendationid": "18885148", "author": {"steamid": "76561198073244094", "num_games_owned": 1351, "num_reviews": 1, "playtime_forever": 650, "playtime_last_two_weeks": 0, "last_played": 1446691754}, "language": "english", "review": "I like visual novels, I like visual novels that have voice acting more. 9/10", "timestamp_created": 1446693897, "timestamp_updated": 1511482121, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.505394", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18885033": {"recommendationid": "18885033", "author": {"steamid": "76561198001002918", "num_games_owned": 167, "num_reviews": 4, "playtime_forever": 171, "playtime_last_two_weeks": 0, "last_played": 1447043875}, "language": "english", "review": "Full disclosure: I know the creators of Brilliant Shadows , but if I did not enjoy the game I would have just avoided posting a review. I played through the game in the beta stages which is why my time played is so low, but the game was complete for all intents and purposes.\n\nI have never really been into visual novels at all, but I really liked the premise of this one. The art is excellent and the writing is on point, all of the characters feel fully fleshed out and well developed. The novel has a combination of action, humor, and romance. I have never been much in the form of romance anything but it is well done. The real draw for me are: 1) The world is rich and clearly designed with a larger story arc in mind (which I am greatly looking forward to), 2) The fantastic art style with fully detailed sprites, varied backgrounds and wonderful CGs.Each character is fully voiced and there are multiple endings making the product feel really polished.  There are a ton of little elements that show the love and care that went into the game, one of my favorite is the blooper reel at the end. \n\n100% would recommend to fans of visual novels and would heavily suggest that people like me who have never played one consider starting with this one. Mox is also confirmed for best character.\n\nTL;DR Good starting point for people like me who have not read any VNs before and extremely well put together so fans of VNs will most certainly enjoy this.", "timestamp_created": 1446693074, "timestamp_updated": 1446693315, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500207", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18885000": {"recommendationid": "18885000", "author": {"steamid": "76561198010219021", "num_games_owned": 240, "num_reviews": 2, "playtime_forever": 467, "playtime_last_two_weeks": 0, "last_played": 1504841428}, "language": "english", "review": "Ok so full disclosure first. This is my first review and I was a kickstarter backer. Having said that...\n\nThis is one of the best VNs I have ever played.\n\nThe artwork is a joy and very rich with colour and detail, it never leaves you wanting.\n\nAn original soundtrack that does not repetitive and ties in very well with the mood of the story.\n\nRelatable characters with believable dialouge and reactions. At no point did any of the character interaction feel forced or stilted. I'd say it was exceptionally well done in fact and the voice acting really sells it.\n\nInteresting world-building and lore. The setting isn't terribly varied for the most part but it works rather well.\n\nThe only downside might be the somewhat short length.\n\nIf you are in the market, you'd be dreadfully challanged to do better than this.\n\n9/10", "timestamp_created": 1446692820, "timestamp_updated": 1446787221, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.571349", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18869536": {"recommendationid": "18869536", "author": {"steamid": "76561197993566757", "num_games_owned": 857, "num_reviews": 13, "playtime_forever": 311, "playtime_last_two_weeks": 0, "last_played": 1446617665}, "language": "english", "review": "Tl;dr: This game is fantastic.\n\nAuthentic dialogue, great voice acting, unique and diverse characters, wonderful music, engaging plot. The world draws from some classic tropes and mixes them together in a lovely blend. And yet, despite how unique the setting is, exposition never bogs down the dialogue. The writing explains things naturally, without feeling rushed or full of itself. With the exception of a few moments, every plot twist or character motivation makes sense. \n\nBrilliant Shadows is marked as book one. I worried this would mean a cliffhanger ending, but that’s not the case. The ending leaves you wanting more without feeling cheap, just like the first book in a great fantasy novel trilogy should.\n\nEven if you’re not a huge visual novel fan (I’m certainly not), pick this up.\n\nOh, and the blooper real at the end is amazing. Seriously. Stick around and watch it. You’re welcome.", "timestamp_created": 1446618196, "timestamp_updated": 1446618221, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.629030", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18867087": {"recommendationid": "18867087", "author": {"steamid": "76561198066093411", "num_games_owned": 219, "num_reviews": 14, "playtime_forever": 471, "playtime_last_two_weeks": 0, "last_played": 1446774566}, "language": "english", "review": "I've been a fan of Ithaqua Labs for a while now and this new release has certainly lived up to my expectations.\n\nBeautiful art, fully voice acted, outstanding world building.  Polished up to a much higher standard than your usual visual novel, in my experience.  All the characters are loveable, the story is robust, the soundtrack is epic.   I got very emotional over this game, it's very earnest and real.", "timestamp_created": 1446602633, "timestamp_updated": 1446602633, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.655968", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18850895": {"recommendationid": "18850895", "author": {"steamid": "76561197970587107", "num_games_owned": 592, "num_reviews": 2, "playtime_forever": 379, "playtime_last_two_weeks": 0, "last_played": 1464771406}, "language": "english", "review": "Very nice game, 10/10\n\neverything was done just right, and the story and art is something new thus very entertaining. You can easily empathize with the characters which are very diversified personalities.\n\nThe price and the tag \"part 1\" could confuse it with an episodic game, but it is a complete story arc. Think of it like book 1. It's length of 6 hourse is quiet entertaining and compared to other products the price could even be higher.\n\nOnly thing i hope for part 2 is that we can influence romance options and who you end with.", "timestamp_created": 1446523070, "timestamp_updated": 1446523070, "voted_up": true, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.695503", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 149, "total_negative": 9, "total_reviews": 158}}
