{"query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 210, "total_negative": 31, "total_reviews": 241}, "reviews": {"38938068": {"recommendationid": "38938068", "author": {"steamid": "76561198065073825", "num_games_owned": 1012, "num_reviews": 63, "playtime_forever": 512, "playtime_last_two_weeks": 7, "last_played": 1514816817}, "language": "spanish", "review": "Antes de nada, he de decir que yo catalogaría a este título como \"dificil de cojo.nes\". \n\nMaldita castilla es un juego para echarle horas. Al principio te castiga, pero, tras largo tiempo de \"ensayo y error\", consigues dominarlo, haciendosete divertido y jugable.\n\nLo mejor del este juego para mi es el códice. Cuenta la historia de la mitología española (antes de jugar, desconocía que tuviesemos mitología XD). Desde \"esqueletos danzantes, que bailan celebrando una nueva muerte\", hasta las \"armaduras encantadas, hechizadas con la sangre de jóvenes caidos en combate\". \n\nOs contaré una pequeña anéctoda personal, binculada a éste título. El creador de éste juego (locomalito) es Malagueño, tengo la suerte de ser también de málaga. Fui a una tapería, y nada mas entrar, encontré una recreativa del \"maldita castilla\". La sensación fue la ostia XD.\n\nQuiero ser ese pequeño porcentaje de personas que han conseguido todos los logros de éste juego, aunque el de conseguir pasarse el juego con la espada de la dama del lago... tocate los huevos XD.\n\nJuegazo. De clon de \"ghots and goblins\" nada, este juego tiene caracter propio. No lo dejeis escapar :).", "timestamp_created": 1514817355, "timestamp_updated": 1514817355, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38914754": {"recommendationid": "38914754", "author": {"steamid": "76561198134369077", "num_games_owned": 52, "num_reviews": 8, "playtime_forever": 1856, "playtime_last_two_weeks": 1856, "last_played": 1514823847}, "language": "schinese", "review": "非常棒的复古act。act爱好者绝对不要错过！\n（已打穿全关卡，不过死4次以内达成好结局貌似是有生之年了…）\n画面很出色，像素画面不但复古而且很精美，游戏中自带ntsc滤镜和街机背景更是别有风味。\n操作方面…手感类似魔界村和act恶魔城，跳跃不转向（能稍微转向)。\n武器和辅助道具设计各有特点，比如攻速高距离短的镰刀，范围大速度慢的钉锤，抛物线投斧和炸弹在某些地形有奇效，总体上算平衡。\n有些关卡和boss战敌人带有随机性，很考验act功底。比如最终关的盔甲死神和老恶魔，基本全程都要集中注意力，算是背版克星…", "timestamp_created": 1514754202, "timestamp_updated": 1514754202, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38630194": {"recommendationid": "38630194", "author": {"steamid": "76561197967588400", "num_games_owned": 295, "num_reviews": 18, "playtime_forever": 448, "playtime_last_two_weeks": 448, "last_played": 1514748375}, "language": "spanish", "review": "Si te gustan los arcades ya estás tardando.", "timestamp_created": 1514136628, "timestamp_updated": 1514136628, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38065790": {"recommendationid": "38065790", "author": {"steamid": "76561198067737556", "num_games_owned": 53, "num_reviews": 3, "playtime_forever": 185, "playtime_last_two_weeks": 166, "last_played": 1514740671}, "language": "english", "review": "Good game! Nice tribute to the Ghost n Goblins series", "timestamp_created": 1512423155, "timestamp_updated": 1512423155, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.522059", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37693505": {"recommendationid": "37693505", "author": {"steamid": "76561197970701643", "num_games_owned": 1155, "num_reviews": 218, "playtime_forever": 337, "playtime_last_two_weeks": 0, "last_played": 1511992534}, "language": "english", "review": "Perfect emulation of 8bit era title.\n\nThe good ones, not the cheap ones where you would be bum rushed or killed from something offscreen. \n\nThe game is fair, but requires skill on your end. \n\nBecome MLG.", "timestamp_created": 1511715783, "timestamp_updated": 1511715885, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.499369", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37687772": {"recommendationid": "37687772", "author": {"steamid": "76561198044004799", "num_games_owned": 668, "num_reviews": 11, "playtime_forever": 65, "playtime_last_two_weeks": 0, "last_played": 1511712336}, "language": "english", "review": "Cursed Castilla is a game with an old school flair from the enemies to the weapon pick ups the game doesnt disappoint. It controls really well and when you die you are not upset at the controls, you are upset at yourself.This Ghost and goblins game is a diamond in the rough and should be added to your library if you like an old school challenge from a game  that was made as a labor of love by the developer.", "timestamp_created": 1511712741, "timestamp_updated": 1511712741, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37412532": {"recommendationid": "37412532", "author": {"steamid": "76561198060877595", "num_games_owned": 213, "num_reviews": 10, "playtime_forever": 655, "playtime_last_two_weeks": 0, "last_played": 1511562991}, "language": "spanish", "review": "Pelearás contra el Nuberu asturiano, el Ojáncanu cántabro, el Moura gallego, el Gamusino y un Quijote loco, entre muchos otros... El Ghosts 'n Goblins español!", "timestamp_created": 1511555748, "timestamp_updated": 1511555748, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.565217", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36512348": {"recommendationid": "36512348", "author": {"steamid": "76561198156309337", "num_games_owned": 38, "num_reviews": 1, "playtime_forever": 1449, "playtime_last_two_weeks": 0, "last_played": 1506708768}, "language": "spanish", "review": "Locomalito y Gryzor87, esa especie de [i]two-men army[/i], nos ofrecen con Maldita Castilla un sentido y completo homenaje a la saga Ghosts 'n goblins (principal pero no únicamente) en el que encarnamos a Don Rodrigo, un caballero que tiene la nada desdeñable tarea de erradicar el mal que asola el reino utilizando diferentes armas y power-ups. Con estas premisas se desarrolla un run and gun de corte clásico que, como ya he señalado, se nutre principalmente de la jugabilidad [i]à la[/i] Ghosts 'n goblins.\n\nEn alguna review he leído/escuchado que este título carece de profundidad, dado que tan solo se controla con la cruceta+2 botones (disparo y salto), además de tener un único espacio para power ups. Creo que este tipo de opiniones descuidan un aspecto fundamental del juego: estamos frente a un arcade que, como tal, tiene jugabilidad \"retro\". Ahora bien, que los controles sean sencillos no implica que la gesta de Don Rodrigo sea un camino de rosas; el juego se va complicando progresivamente según avanzamos por el mismo, pero en ningún momento se hace tan abrumador como para desalentar al jugador, y es que el aspecto de la dificultad se ha exagerado en ciertos medios presentando a Maldita Castilla como un juego extremadamente difícil. ¿Desafiante? Sí. ¿Frustrante o imposible? Jamás. Esto me lleva a subrayar que la curva de dificultad es sencillamente excelente, empezando desde lo muy fácil para que el jugador se familiarice con los controles hasta llegar a lo desafiante. De esto modo, rara vez se tiene la impresión de que perder una vida sea por culpa del juego. Eso sí, si hay un aspecto de los controles que no me acaba de convencer es el de las secciones con cuerdas/lianas/cadenas; la maniobrabilidad al trepar no es fácil, haciendo que superar una sección específica del juego dependa un tanto del factor suerte. Por contra, ser capaces de redirigir el salto en el aire permite el plataformeo de precisión, algo que el bueno de Sir Arthur no podía hacer. Por último, y no menos importante, la variedad de armas, secretos y posibilidad de recoger unos ítems que sirven para acceder a la verdadera última fase del juego le dan un alto valor de rejugabilidad. Es de agradecer que el juego no repita la clásica fórmula de Capcom del doble loop y ninguna fase se repita.\n\nRespecto a los gráficos, son estilo 16 bit, detallados y agradables, con un cierto predominio de colores oscuros en los escenarios que casan con el estado decadente y lúgubre de las tierras de Tolomera. En general, aunque el diseño de los personajes no sea excepcionalmente complejo, está logrado y consigue darles su buena dosis de personalidad. El catálogo de enemigos es amplio y varía de fase en fase (con contadas excepciones de enemigos recurrentes como los zombies) lo cual, junto a la variedad de lugares que tenemos que visitar, variedad de armas y power ups disponibles, hace que el juego no se haga nunca repetitivo. Mención especial para los bosses, que brillan por sí mismos y dan verdadera significación al título del juego al consistir básicamente en seres de distintas mitologías peninsulares. Estos jefes finales no supondrán un desafío cuando comience la aventura, pero irán incrementando progresivamente su dificultad hasta el último de ellos, que a buen seguro nos arrebatará unas cuantas vidas antes de que memoricemos sus patrones de ataque.\n\nEn el apartado sonoro, Gryzor87 nunca decepciona, y Maldita Castilla no es excepción. Las melodías chiptune del juego son simplemente geniales, acompañando perfectamente a la acción. Asimismo, los efectos de sonido son variados y están claramente definidos, como por ejemplo cuando se trata de distinguir cuándo un impacto hiere a un enemigo/boss o no, etc.\n\n[b]Conclusión[/b]: Excelente jugabilidad, vistosos apartados sonoro y gráfico, varios finales disponibles y algo de exploración requerida para completar el juego al 100%. Maldita Castilla puede ser considerado, por derecho propio, un gran juego. Si te gustan los arcades en general o Ghosts 'n goblins en particular, no puedes dejar pasar este título.", "timestamp_created": 1510669465, "timestamp_updated": 1511509586, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36275329": {"recommendationid": "36275329", "author": {"steamid": "76561197995424564", "num_games_owned": 86, "num_reviews": 30, "playtime_forever": 922, "playtime_last_two_weeks": 0, "last_played": 1509125400}, "language": "french", "review": "Dans la vague des jeux rétro et indépendants ayant révolutionné le paysage vidéoludique aux alentours de l'année 2010, on peut distinguer deux tendances bien nettes: d'un côté, les jeux en apparence \"rétro\" mais qui reposent en fait sur des concepts inattendus, transgressifs et novateurs (Fez et sa logique 2D/3D, Super Meat Boy avec ses vies infinies et ses niveaux très courts, Spelunky qui mélange le jeu de plateformes et le jeu à la Rogue, etc.), et de l'autre côté, les jeux \"premier degré\" et rétro de bout en bout qui auraient pu sortir tels quels dans les années 1980 ou 1990 sans choquer absolument personne, comme par exemple Megaman 9 ou (donc) Cursed Castilla.\n\nDès le premier regard, Cursed Castilla paraît en effet familier, et pour cause: comme il a été dit un peu partout, le jeu puise clairement son inspiration dans Ghosts'n Goblins et Ghouls'n Ghosts - le thème est similaire (un preux chevalier doit sauver un royaume médiéval de hordes de revenants, de monstres et de démons, se taillant un chemin jusqu'aux Enfers où il devra terrasser une grande entité diabolique), le gameplay est très voisin (on projette des lances et autres armes blanches sur les ennemis et on effectue des sauts rigides permettant de sauter dans un sens tout en tirant dans l'autre), la structure reprend celle d'un jeu d'arcade globalement linéaire comptabilisant les vies et les [i]continues[/i] ainsi que le score amassé, et l'on retrouve même le concept de \"vraie\" fin obtenue selon certaines conditions (réussir à ouvrir la porte menant aux Enfers en dénichant en chemin cinq larmes magiques, gagner le jeu en moins de quatre [i]continues,[/i] etc.).\n\nTout cela est systématiquement évoqué lorsqu'on parle de Cursed Castilla (ou de sa version [i]freeware[/i] Maldita Castilla), mais ce qui est en revanche moins souvent dit, c'est que Cursed Castilla présente également de grosses différences d'avec les bornes d'arcade de Capcom, ces différences cumulées faisant de lui un bien meilleur jeu!\n\nTout d'abord, il y a la question de l'univers: celui des jeux de Capcom est assez kitsch (surtout Ghouls'n Ghosts), avec des couleurs parfois psychédéliques et des ennemis et des décors oscillant entre le cartoon et l'organique à la R-Type, alors que l'univers de Cursed Castilla est beaucoup plus proche de son inspiration médiévale tant sur le fond que sur la forme, avec un bestiaire tiré tout droit des légendes d'alors et un style graphique imitant les magnifiques enluminures de l'époque. Le résultat est original et cohérent, procurant un sentiment constant d'authenticité à côté duquel les productions de Capcom ressemblent à des jouets en plastique vendus pour Halloween.\n\nLe [i]game design[/i] de Cursed Castilla, malgré les similitudes, est également bien distinct de celui de Ghosts'n Goblins et Ghouls'n Ghosts: ces deux jeux sont très courts (de 10 à 20 minutes en [i]speedrun[/i] contre au moins 50 pour Cursed Castilla), et ont pour objectif de rendre le joueur accroc tout en le faisant perdre régulièrement afin qu'il mette le plus d'argent possible dans leur borne - leur gameplay est donc extrêmement agressif et repose beaucoup sur les réflexes du joueur, avec des hordes constantes d'ennemis générés aléatoirement, des comportements adverses parfois difficilement prédictibles, des [i]powerups[/i] tirés au hasard (dont certains se révèlent très handicapants), des séquences particulièrement périlleuses avec des pointes de difficulté brutales, etc.\n\nCursed Castilla est très différent, ne laissant absolument rien au hasard: ni le positionnement des ennemis, ni leur comportement, ni la localisation des bonus (trésors augmentant le score, vies supplémentaires, changement d'arme, temps supplémentaire) - chaque élément est planifié à l'avance avec une précision chirurgicale. Le jeu comporte par ailleurs peu de générateurs d'ennemis, et quand c'est le cas, ceux-ci peuvent être détruits ou s'épuisent au bout d'un moment, ne surchargeant donc jamais le joueur. De plus, les bonus qui permettent de changer d'arme consistent en un unique type de bonus proposant en boucle les six armes du jeu (chacune, bien sûr, avec ses avantages et ses inconvénients), laissant le joueur libre de choisir l'arme qu'il juge idéale pour aborder telle ou telle séquence de jeu, sans jamais être contraint de prendre une décision à la volée.\n\nOn le voit bien: au lieu de reposer sur les réflexes et susciter continuellement un sentiment d'urgence voire de panique comme les jeux de Capcom, Cursed Castilla repose plutôt sur la méthode, le sang-froid et la planification, ressemblant du coup davantage au jeu d'arcade Toki ou à un jeu d'action/plateformes sur console ou micro-ordinateur 16-bit. Le [i]level design[/i] de Cursed Castilla ne fait que renforcer cette orientation, avec de petits éléments d'exploration (chemins alternatifs, clefs à ramasser pour ouvrir des portes) ainsi que de nombreux bonus secrets dissimulés ça et là.\n\nTous ces choix adoptés par Locomalito, l'auteur du jeu, font de Cursed Castilla un jeu plus juste, plus intéressant, plus prenant et plus complet que ses sources d'inspiration, et ils le rendent aussi beaucoup plus abordable: Cursed Castilla a en effet une courbe d'apprentissage exceptionnelle, où l'on se casse les dents lors de ses premières parties (j'ai dépensé plus de 40 [i]continues[/i] pour atteindre sa mauvaise fin à mon premier essai) mais où l'on ne cesse de s'améliorer (après une quinzaine d'heures, j'ai réussi à battre tout le jeu sans jamais utiliser de continue)! Autant Ghosts'n Goblins et Ghouls'n Ghosts sont des jeux nous guidant vers l'échec (et donc vers la dépense d'une nouvelle pièce), autant Cursed Castilla, malgré son défi long, consistant et corsé, nous guide petit à petit vers la victoire. Le jeu se prête de plus très bien aux parties longues (pour le score) comme aux parties courtes, sauvegardant automatiquement notre progression entre chaque chapitre (reprendre sa sauvegarde remet par contre le score et les vies à leur valeur initiale). Les [i]achievements[/i] sont eux aussi très bien pensés et très stimulants.\n\nPour le reste, comme vous pouvez le juger sur les vidéos et les captures d'écran, Cursed Castilla bénéficie d'une excellente réalisation, tout à fait dans l'esprit des bornes d'arcade de la seconde moitié des années 1980. Cursed Castilla est un véritable classique du renouveau du rétro et de l'arcade, qu'il ne faut rater sous aucun prétexte. Bravo à Locomalito!", "timestamp_created": 1509815479, "timestamp_updated": 1512060253, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504600", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36085665": {"recommendationid": "36085665", "author": {"steamid": "76561198065613184", "num_games_owned": 264, "num_reviews": 34, "playtime_forever": 154, "playtime_last_two_weeks": 0, "last_played": 1509312268}, "language": "spanish", "review": "Gran juego... simplemente fenomenal.. lo recomiendo al 100%", "timestamp_created": 1509213784, "timestamp_updated": 1509213784, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35934072": {"recommendationid": "35934072", "author": {"steamid": "76561198021843785", "num_games_owned": 46, "num_reviews": 6, "playtime_forever": 1654, "playtime_last_two_weeks": 0, "last_played": 1512244670}, "language": "english", "review": "If you're a casual gamer who expects an easy mode out of everything then this is the wrong game for you. This game will test you but it isn't as ridiculous as the original ghosts n goblins was. I would reccommend it and it is definitely worth the money.", "timestamp_created": 1508716333, "timestamp_updated": 1508716333, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497512", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35627519": {"recommendationid": "35627519", "author": {"steamid": "76561198121017576", "num_games_owned": 2327, "num_reviews": 273, "playtime_forever": 279, "playtime_last_two_weeks": 0, "last_played": 1507674512}, "language": "english", "review": "Words were said, controllers were squeezed, I used enough continues to make anyone weak in the knees.\n\nWhat can I say about this game ?? hmm...\n\nFirst and foremost, if you are like me, an old retro person, you will truly feel like a kid again playing this.  I remember my experience with Ghosts n Goblins quite well and boy did this game bring back the memories.  \n\nI know some of you may look at the price and think, is it worth it?  Honestly, it is, but it would probably get more attention if the price dropped a couple dollars to $9.99.  \n\nNow for the gameplay.  The controls are solid overall, but felt slightly sluggish at times when turning and trying to fire a weapon quickly (I used a 360 controller).  This really wasn't too much of an issue, but its still worth noting...then again that NES game had somewhat sluggish controls at times as well...so it felt right.  One thing that I was hoping for was to have a double jump I could use at all times, but I guess getting 3 hits to your death instead of 2 was a decent trade-off.  The weapon choices are solid, but if you can keep ahold of the daggers, I recommend those.  They work much like the spread gun in contra.  \n\nThere are also a good amount of stages and boss fights, more than enough to keep you occupied for several hours as you try to \"get good\".  Once you think you have the levels/game figured out, there is even a built-in speedrun mode... good luck with that.\n\nThe continues in the game are infinite and mostly painless.  You are allowed to continue from whatever checkpoint you last hit, and even boss battles (unless you restart the game, then you restart the full stage).  However, there is a catch... if you die, you lose your weapon and get stuck with the basic knife.  That weapon isn't terrible, but it sure can make boss battles irritating.  Your only option to get a better weapon is to resart the area, so the choice is yours.  Oddly enough, the knife was THE weapon in Ghosts n Goblins on NES, but in this game it is one of the not so great weapons.\n\nLevel Design/Graphics.. BRILLIANT... nuff said.\n\nThe game played very smooth for me and I absolutely recommend it.  I look forward to playing more games from this developer, they truly have a good grip on how to make this style of game.\n\nClosing thought - If this game came out for the NES in the late 80s, or even the SNES in the 90s, it would be one that is beloved today", "timestamp_created": 1507675949, "timestamp_updated": 1507737550, "voted_up": true, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.593287", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35621690": {"recommendationid": "35621690", "author": {"steamid": "76561197960547486", "num_games_owned": 349, "num_reviews": 25, "playtime_forever": 352, "playtime_last_two_weeks": 0, "last_played": 1507654241}, "language": "spanish", "review": "Vuelta a la nostalgia de los salones recreativos con este juego con un estilo emulando al  Ghouls'n Ghosts y el Wonder Boy.... game play  100% 8 bitero y clasico de los plataformas 2D ..... y encima con un toque castellano que le queda genial al guion.\nNo hay mucho mas que decir de lo que ya se ve en los videos, para mi gusto le faltaba algo mas de dificultad o el que tendria que existir un maximo de continuaciones tras morir, ya que al no haber limite  el juego se convierte en un ensayo-error continuo.\n\nentretenido y recomendado 7/10", "timestamp_created": 1507654708, "timestamp_updated": 1507654708, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.505173", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35245606": {"recommendationid": "35245606", "author": {"steamid": "76561198137378577", "num_games_owned": 22, "num_reviews": 2, "playtime_forever": 269, "playtime_last_two_weeks": 0, "last_played": 1506531756}, "language": "spanish", "review": "Muy buen juego", "timestamp_created": 1506531840, "timestamp_updated": 1506531840, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34883820": {"recommendationid": "34883820", "author": {"steamid": "76561198067408654", "num_games_owned": 183, "num_reviews": 19, "playtime_forever": 367, "playtime_last_two_weeks": 0, "last_played": 1505228234}, "language": "schinese", "review": "魔界村仿版，道中比魔界村易，BOSS比魔界村难···不过好结局是要求死的少于4次并拿全莫拉之泪的\n所以还不能轻易说容易，好看的成绩需练\n价钱小贵，但鉴于这类游戏不算多·ACT爱好者还是买吧", "timestamp_created": 1505140238, "timestamp_updated": 1505140238, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34837893": {"recommendationid": "34837893", "author": {"steamid": "76561198058834043", "num_games_owned": 265, "num_reviews": 34, "playtime_forever": 16, "playtime_last_two_weeks": 0, "last_played": 1510372139}, "language": "english", "review": "So, this is a \"first impressions\" review, but it's pretty much exactly what I want it to be. To be honest, though, while it bills itself as old school difficulty, it's comparatively easy when you put it side by side with the games it is based on.", "timestamp_created": 1504965130, "timestamp_updated": 1504965130, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34529728": {"recommendationid": "34529728", "author": {"steamid": "76561197994883935", "num_games_owned": 1029, "num_reviews": 69, "playtime_forever": 8, "playtime_last_two_weeks": 0, "last_played": 1477002886}, "language": "english", "review": "I played the original free version of this a lot, and I was happy to give money to buy the enhanced version on Steam. A true work of love :)", "timestamp_created": 1503841093, "timestamp_updated": 1503841093, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.488941", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34444243": {"recommendationid": "34444243", "author": {"steamid": "76561198026208716", "num_games_owned": 124, "num_reviews": 15, "playtime_forever": 682, "playtime_last_two_weeks": 0, "last_played": 1504193035}, "language": "spanish", "review": "Puedes ver mi gameplay en mi canal de Youtube y veras como parece fácil jugar este título cuando tienes cierto dominio\nhttps://www.youtube.com/playlist?list=PL8jmG9ajuSGALSv05M-eMPsYg-_ZhTa0O\n\nMaldita Castilla tiene ese toque de dificultad de antaño que no le recomiendo asomarse a ningún milenial/niño rata (sé que no es así siempre XD no se enojen). Sin embargo es un gran juego que ha rescatado muy bien las mecánicas de movimiento que se necesitan para este tipo de aventuras, la dificultad esta para jalarse las greñas y rayarle el queso a los jefes, pero la verdad, luego de algunas decenas de intentos terminas por encontrarle la maña.\n\nEs un juego que puedes terminarlo relativamente rápido (me tomo 3 horas totales la primera vez y la segunda 2 horas totales) aunque sacando el desafío máximo puede que te tome más tiempo. No hay mucho que contar es un juego básico, saltas y disparas y listo. Yo en lo particular no le encontré gran gusto a la variedad de armas/ítems me fui con el arma inicial toda la partida. Tiene algunas cosas ocultas o secretos de hecho el final bueno necesita encontrarse algunos objetos algo ocultos. La música/efectos/gráficos están bastante bien para el tipo de juego que es.\nSi jugaste o viste “super ghouls n ghosts” es muy parecido.\n\nEs bastante difícil al principio pero con la práctica lo dominas, ya que te continúan muy cerca de donde mueres, los escenarios son cortos y rápidos de pasar. Además los jefes también si mueres apareces enseguida sin tanto papeleo.\nSe lo recomiendo más que nada a personas que disfrutan del juego de antaño en solitario y superar sus mejores marcas\n* Muy buen control (usa joystick del Xbox 360)\n", "timestamp_created": 1503513474, "timestamp_updated": 1503513474, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.525862", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34395327": {"recommendationid": "34395327", "author": {"steamid": "76561198080626510", "num_games_owned": 250, "num_reviews": 38, "playtime_forever": 1499, "playtime_last_two_weeks": 61, "last_played": 1513987554}, "language": "spanish", "review": "Maravilloso título que nos recuerda el porqué lo retro mola, esa dificultad gracias a limitación de movimiento es muy característica del Ghost and Goblins. Fantástico. Aunque por 8€ creo que hubiera estado mejor.", "timestamp_created": 1503322920, "timestamp_updated": 1503322920, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34381042": {"recommendationid": "34381042", "author": {"steamid": "76561198091699313", "num_games_owned": 121, "num_reviews": 17, "playtime_forever": 445, "playtime_last_two_weeks": 0, "last_played": 1503258077}, "language": "english", "review": "It took me 70 continues, but finally I've beaten it. Sort of. I have to do a little better for the real ending, but what I could manage was awesome. Best GnG style game I've ever played. \n\nLoads of people are complaining that it's too hard, I have to wonder what they expected. Ghosts n Goblins is not easy I don't know why you'd expect this game to be. You have unlimited continues, use them. Arcades made us start at the begining so even though the game is hard beating a proper GnG arcade is certainly harder. I never got to play the original Castilla but I'd imagine it too made you start from the begining.", "timestamp_created": 1503258713, "timestamp_updated": 1503258713, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.535086", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34115565": {"recommendationid": "34115565", "author": {"steamid": "76561198311789401", "num_games_owned": 40, "num_reviews": 5, "playtime_forever": 283, "playtime_last_two_weeks": 0, "last_played": 1506892967}, "language": "english", "review": "Please port curse of iilyos", "timestamp_created": 1502241424, "timestamp_updated": 1502241424, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.519587", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34061784": {"recommendationid": "34061784", "author": {"steamid": "76561198015392402", "num_games_owned": 98, "num_reviews": 19, "playtime_forever": 300, "playtime_last_two_weeks": 0, "last_played": 1503315934}, "language": "japanese", "review": "ストアページを見てピンと来た方。あなたは正しい。そう、魔界村です。\n見た目や操作体系は言わずもがな、やたらとシビアなところや、やればやるほど上達してくのがわかる感覚は、まさに魔界村そのものです。吹っ飛ばされて穴に落ちて即死するのはお約束。ネタ武器縛りで茨の道を進むことだって出来ます。\n勿論魔界村とは違う点もありまが（後述）、魔界村好きであれば買っておいて損はないでしょう。また、魔界村を知らなくても、シビアなアクションゲームが好きな人にもおすすめです。\n\n参考　魔界村との違い\n・3ライフ制。パンツと骨はない。\n・空中でもある程度の方向制御が可能。\n・敵は大体定点配置。無限湧きの敵は少ない。\n・武器は決まったポイントでのみ出現。好きな武器を選択可能。\n・上下打ちは可能だが、魔法はない。二段ジャンプも基本的にはできない。\n・メイン武器のほか、盾や二段ジャンプブーツ等のサブ装備もあり。\n・死ぬと武器は剣（標準装備）に戻される。サブ装備は消失する。\n・二周する必要はないが、道中でとある隠しアイテムを見つけないと、最終ステージには行けない。\n\n敵の種類は多く、またそれぞれにしっかりした個性付けがなされています。特に中後半はいやらしい動きをする敵が多く出現しますので、個々の敵に確実に対処していく必要があります。この点は、強武器や魔法の力押しで何とかなってしまう魔界村シリーズとは少し異なるように感じました。またこれを面白いと取るか、爽快感に欠と取るかは、意見が別れるところかもしれません。", "timestamp_created": 1502031100, "timestamp_updated": 1502031100, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.565217", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33923709": {"recommendationid": "33923709", "author": {"steamid": "76561198207702344", "num_games_owned": 19, "num_reviews": 2, "playtime_forever": 66, "playtime_last_two_weeks": 0, "last_played": 1512464154}, "language": "english", "review": "Beautifully crafted and fun. Recommended", "timestamp_created": 1501492912, "timestamp_updated": 1501492912, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.482751", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33896236": {"recommendationid": "33896236", "author": {"steamid": "76561198037368236", "num_games_owned": 68, "num_reviews": 2, "playtime_forever": 756, "playtime_last_two_weeks": 0, "last_played": 1501385160}, "language": "spanish", "review": "Un excelente juego que es, pues, exactamente como parece: un juego que intenta imitar (y en mucho respectos, mejorar) el viejo juego \"Ghosts and Goblins\", pero con un tema bastante mejor de la España medieval. Es un juego corto, se puede completar en 3 horas la primera vez que lo juegas, pero para lograr el mejor fin hay que aprender y adiestrar te bastante, lo que lo hace mas largo de lo que parece.\n\nDesafortunadamente, para consequir el mejor fin, y algunos capitulos extras (donde se encuentra el verdadero jefe final) hay que encontrar cinco \"lagrimas\" que estan tan jodidamente escondidas que dudo que se encuentrarian (al menos el primero y ultimo) sin guia.", "timestamp_created": 1501386828, "timestamp_updated": 1501386828, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33877383": {"recommendationid": "33877383", "author": {"steamid": "76561198092001993", "num_games_owned": 477, "num_reviews": 3, "playtime_forever": 166, "playtime_last_two_weeks": 0, "last_played": 1502329394}, "language": "spanish", "review": "Un muy buen juego de jugabilidad clasica, merece la pena. Divertido,  disfrutable cada segundo, en el estilo de los clasicos de los arcade de los 80.", "timestamp_created": 1501323317, "timestamp_updated": 1501323317, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33730343": {"recommendationid": "33730343", "author": {"steamid": "76561198035747099", "num_games_owned": 96, "num_reviews": 8, "playtime_forever": 162, "playtime_last_two_weeks": 0, "last_played": 1501004775}, "language": "spanish", "review": "great game, it plays really nice, controls are very well implemented", "timestamp_created": 1500759293, "timestamp_updated": 1512260038, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33477323": {"recommendationid": "33477323", "author": {"steamid": "76561198088750029", "num_games_owned": 77, "num_reviews": 9, "playtime_forever": 307, "playtime_last_two_weeks": 0, "last_played": 1499275589}, "language": "spanish", "review": "Maldito juego.\nMe ha hecho sentir tan cabreado y frustrado en algunos momentos que sentí la tentación de lanzar el mando por la ventana. Se me había olvidado lo que era la dificultad en un videojuego...\nDecir que este juego es un homenaje a Ghosts´n Goblins es decir realmente poco. Aunque su mecánica sea naturalmente heredera del mítico juego de Capcom, los niveles y jefes finales poseen una personalidad muy bien definida, tanto que te hace olvidar a quién está homenajeando.\nEs un juego muy recomendable no solo para nostálgicos, sino también para cualquier amante de los videojuegos arcade con dificultad endiablada o, mejor dicho, maldita.\n\nPD. El mejor jefe final, en mi opinión, es el \"Pangdemonium\".", "timestamp_created": 1499858924, "timestamp_updated": 1499858924, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33289112": {"recommendationid": "33289112", "author": {"steamid": "76561197962122314", "num_games_owned": 600, "num_reviews": 32, "playtime_forever": 541, "playtime_last_two_weeks": 0, "last_played": 1501588758}, "language": "italian", "review": "grande clone di ghost n goblins, sfida molto impegnativa, graficamente ricalca perfettamente il gusto delle arcade room con i loro monitor interlacciati (se così si dice), lo sviluppatore finalmente ha deciso di portare un titolo del suo catalogo (che a dire la verità offre da tempo freeware con donazione) su steam, lo seguo con interesse sia lui (locomalito) che il suo compare grigor87 (sonoro), un'ottimo duo che si è specializzato in questo tipo di prodotti.\nGioco da appassionati, voto 8/10....aspettando il porting degli altri suoi capolavori.", "timestamp_created": 1499284929, "timestamp_updated": 1499284929, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.506829", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33181085": {"recommendationid": "33181085", "author": {"steamid": "76561197984681066", "num_games_owned": 1069, "num_reviews": 38, "playtime_forever": 252, "playtime_last_two_weeks": 0, "last_played": 1499530379}, "language": "spanish", "review": "Es difícil, muy exigente.\n\nRecrea muy bien el espíritu recreativo de los años 80, tanto gráfica como sonoramente, un homenaje a Ghosts 'n Goblins.\n\nEs como el Dark Souls de hace 30 años.\n\n", "timestamp_created": 1499084318, "timestamp_updated": 1499084318, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497512", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33158350": {"recommendationid": "33158350", "author": {"steamid": "76561198127354668", "num_games_owned": 140, "num_reviews": 5, "playtime_forever": 189, "playtime_last_two_weeks": 0, "last_played": 1499106640}, "language": "english", "review": "Great game for hardcore gamer fan of ghost and goblin series.", "timestamp_created": 1499038181, "timestamp_updated": 1499038181, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.518798", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33118907": {"recommendationid": "33118907", "author": {"steamid": "76561198039863301", "num_games_owned": 2679, "num_reviews": 204, "playtime_forever": 309, "playtime_last_two_weeks": 0, "last_played": 1513503495}, "language": "spanish", "review": "Es la mejor experiencia retro que he tenido en mi vida.\nUn juego que te teletransporta al pasado, a la época de los salones recreativos.\nLa música, los gráficos, el control, los sonidos.\nEs una barbaridad, un gope en la mesa, un guiño auténtico.\nRecomendado 100 %.\n", "timestamp_created": 1498980164, "timestamp_updated": 1498980164, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.512079", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33058891": {"recommendationid": "33058891", "author": {"steamid": "76561198016501821", "num_games_owned": 70, "num_reviews": 3, "playtime_forever": 71, "playtime_last_two_weeks": 0, "last_played": 1506775081}, "language": "italian", "review": "Un gioco che è palesemente (in senso positivo) ispirato a Ghost & Golbins e ha qualche richiaom con altri arcade di quei tempi. Divertentissimo e difficile al punto giusto, anche molto in alcuni casi ma mai troppo da farti abbandonare, un chiaro tentativo di ricrerare \"oggi\" un gioco con abbia il feeling degli anni 80.\n", "timestamp_created": 1498862640, "timestamp_updated": 1498862640, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504384", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33011209": {"recommendationid": "33011209", "author": {"steamid": "76561198079530646", "num_games_owned": 266, "num_reviews": 51, "playtime_forever": 183, "playtime_last_two_weeks": 0, "last_played": 1498770091}, "language": "english", "review": "A solid tribute to Ghost 'n Goblins.", "timestamp_created": 1498772162, "timestamp_updated": 1498772162, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.658314", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32854862": {"recommendationid": "32854862", "author": {"steamid": "76561198147827922", "num_games_owned": 182, "num_reviews": 7, "playtime_forever": 569, "playtime_last_two_weeks": 0, "last_played": 1498965604}, "language": "japanese", "review": "とっても大魔界村っぽい、レトロ風横スクロールアクションゲーム。\nグラフィックからサウンド、プレイ感まで大魔界村を意識している感じ。\nかといって安易なパクリゲーではなく、きちんと独立した別作品として成立している。\n\n本家との違いはライフ制であることと、魔法が存在しないことくらい。\n難易度も難しすぎす、かといって簡単ではないという良好なバランス。\n魔界村やレトロ風のアクションゲームが好きな人におすすめ。", "timestamp_created": 1498569754, "timestamp_updated": 1498569754, "voted_up": true, "votes_up": 13, "votes_funny": 1, "weighted_vote_score": "0.699317", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32790578": {"recommendationid": "32790578", "author": {"steamid": "76561198041438339", "num_games_owned": 372, "num_reviews": 18, "playtime_forever": 364, "playtime_last_two_weeks": 0, "last_played": 1510431027}, "language": "spanish", "review": "Un juego 100% español, como la morcilla de burgos o el chorizo de cantimpalo \"20/10\".", "timestamp_created": 1498428172, "timestamp_updated": 1498428172, "voted_up": true, "votes_up": 0, "votes_funny": 3, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32779857": {"recommendationid": "32779857", "author": {"steamid": "76561198123630426", "num_games_owned": 47, "num_reviews": 8, "playtime_forever": 155, "playtime_last_two_weeks": 0, "last_played": 1506692339}, "language": "koreana", "review": "필자는 마계촌 프랜차이즈를 잘 하진 못하지만 상당히 좋아하고 psp 버전인 '극마계촌' 을 숨겨진엔딩까지 볼 정도로 열정적으로 플레이를 했었습니다.(물론 누구나 붇잡고 하면 다 하는겁니다만.. 전 사실 그렇게 붇잡고 게임하는 스타일이 아닌지라 저한테는 상당히 생소한 일이었죠.)\n\n그래서 이 게임을 처음 본순간 그냥봐도 딱 알정도로 마계촌의 오마주 게임이다 싶어서 흥미가 있었는데 여름할인이길레 덥석 구입을 했습니다. \n\n잠깐 플레이 해보고 스테이지 4까지 갔는데 이게임 정말 잘만들었습니다. 정확히 말하면 세련되게 패러디를 한 게임입니다. 우리에겐 다소생소한 스페인 바르셀로나에 위치한 게임 회사에서 제작한 이 게임은 무려 플스나 닌텐도 3ds로도 발매를 한 모양이더라구요. 무엇보다 놀라운건 마계촌과 거의 흡사한 분위기와 조작, 밸런싱입니다. \n\n아무리 게임을그냥 같다 배낀다고 해도 사실 밸런스나 조작은 원작의 맛을 내기가 어렵습니다. 마리오게임의아류가 많아도 전부 마리오 처럼 재밌는게 아닌것과 같죠. 그런데 이 게임은 정말 마계촌을 하는 느낌으로 절묘한 위치의 몹 스폰, 적절히 짜증나는 난이도, 애매한 점프판정등, 마계촌의 것을 정말 잘 가져와서 게임하는 내내 새로운 마계촌을 플레이 하는 기분이었습니다. 물론 마계촌과 동일한건 아니고 약간 더 조작도 다루기 편해지고 난이도도 원작의 그것보단 쉬워서 좀더 다듬어진 기분이었습니다.\n\n그러면서도 이 게임만의 특색있는 캐릭터 복식이나 몬스터들의 디자인은 꽤 훌륭합니다. 시작부터 마치 에뮬레이터를 돌리는것처럼 롬 체크를 하는 모습을 연출한것부터, 도트를 더욱 도드라지게 만드는 8가지 게임 뷰 모드는 이 게임이얼마나 8~90년대 게임을 공경하는지 잘 보여줍니다. \n\n그리고 완전하게 제공하진 않지만 게임을꺼도 했던 챕터부터 이어서 할 수 있게 한 점과, 아이템, 몬스터등의 설정을 볼수 있는 모드가 있어서 아주 마음에 들었습니다.\n\n버그인지 아닌지는 모르겠지만, 컨트롤러 세팅을 할때 디폴트로 넘어가지지 않아서 초반에 애를 먹은적이 있습니다. 옵션을 하나하나 건드리다가 컨트롤러를 건드리니 다짜고짜 키입력으로 넘어가서 다시 지우고 그랬는데, 그런 부분은 좀 더 매끄럽게 다듬어지면 좋을꺼 같습니다. \n\n간만에 별 생각없이 구매해서 꽤나 만족스럽게 플레이 하고 있네요. 스페인 게임 퀄이 이정도면 다른 게임들도 좀 눈여겨 봐야겠습니다~!", "timestamp_created": 1498409856, "timestamp_updated": 1498410703, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32772189": {"recommendationid": "32772189", "author": {"steamid": "76561198062813911", "num_games_owned": 586, "num_reviews": 575, "playtime_forever": 195, "playtime_last_two_weeks": 0, "last_played": 1498396494}, "language": "english", "review": "[h1] DISCLAIMER: This is a first impressions review, and NOT a full review \n\nPLEASE NOTE (2017): Due to recent false accusations of plagarism, I (the reviewer) would like to stress that all these reviews and upcoming reviews are original and are not blatantly copied. Other reviews are used to help stress my point across but are changed in such a way to make the review in my own wording [/h1]\n\nCursed Castilla or Maldita Castilla EX is a game developed by Locomalito and published by Abylight Studios\n\nOrginally a downloadable free game from Locomalito, it has now been faithfully ported with more stuff and features. It is definitely a hard game and challenging to play and you will die over and over again but it is a fun game to play in short bursts\n\nYou can't tell if this game was developed in the 80's or nowadays and it comes to show you that the developer really put much careful and attention to it to make it as retro as possible with modern controls and the music is wonderful to listen to and quite catchy also\n\nCursed Castilla (Maldita Castilla EX) is a fun game to play in short bursts and is a definite step up from the original downloadable version\n\n[h1] RECOMMENDED :) [/h1]", "timestamp_created": 1498397765, "timestamp_updated": 1498398297, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.312531", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32624270": {"recommendationid": "32624270", "author": {"steamid": "76561197987349747", "num_games_owned": 139, "num_reviews": 15, "playtime_forever": 407, "playtime_last_two_weeks": 0, "last_played": 1508934088}, "language": "spanish", "review": "Como el Ghouls'n Ghosts de Megadrive, pero mucho mejor y con aroma castellano.\n\n10/10", "timestamp_created": 1498069797, "timestamp_updated": 1498069797, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.692501", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32329074": {"recommendationid": "32329074", "author": {"steamid": "76561197964410439", "num_games_owned": 752, "num_reviews": 4, "playtime_forever": 291, "playtime_last_two_weeks": 0, "last_played": 1497133446}, "language": "english", "review": "I wanted to love it, but it's so hard and unfair that it's frustrating.\n\nThe developers are on crack if they think we can complete it using less than 3 continues and have a live at the same time.", "timestamp_created": 1497133605, "timestamp_updated": 1497133605, "voted_up": false, "votes_up": 9, "votes_funny": 7, "weighted_vote_score": "0.177032", "comment_count": "13", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32320346": {"recommendationid": "32320346", "author": {"steamid": "76561197999333734", "num_games_owned": 55, "num_reviews": 1, "playtime_forever": 439, "playtime_last_two_weeks": 0, "last_played": 1499082205}, "language": "spanish", "review": "Poco puedo decir o mucho dependiendo de como lo mire,pero siempre positivo. Impresionante y ahí lo dejo.", "timestamp_created": 1497108202, "timestamp_updated": 1497108202, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32307316": {"recommendationid": "32307316", "author": {"steamid": "76561198010207541", "num_games_owned": 258, "num_reviews": 11, "playtime_forever": 188, "playtime_last_two_weeks": 0, "last_played": 1482172916}, "language": "spanish", "review": "Excelente . Me recuerda a Ghost and Goblins y la cultura de las maquinas arcade, un homenaje a toda esa epoca.\nLo recomiendo.", "timestamp_created": 1497063682, "timestamp_updated": 1497063682, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32297406": {"recommendationid": "32297406", "author": {"steamid": "76561198263037962", "num_games_owned": 6, "num_reviews": 2, "playtime_forever": 886, "playtime_last_two_weeks": 0, "last_played": 1511376859}, "language": "english", "review": "It is a pleasure to play a new game that could have been realesed at the end of the 80s. This is new material today where you can see the effort and dedication of doing a master piece inspired on that periode's games. \nThe perfect second part for a project of this kind, it would be to realese Cursed Castilla 2 just on arcade cabinets: bars, pubs, arcade salons... I can see losts of people just visiting those cities to play the game, it would be like going to a museum. \nLocomalito and Gryzor87, THANK YOU!", "timestamp_created": 1497029876, "timestamp_updated": 1497029876, "voted_up": true, "votes_up": 27, "votes_funny": 0, "weighted_vote_score": "0.752210", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32160704": {"recommendationid": "32160704", "author": {"steamid": "76561198013888613", "num_games_owned": 240, "num_reviews": 81, "playtime_forever": 176, "playtime_last_two_weeks": 0, "last_played": 1497725036}, "language": "french", "review": "parce qu'il le merite <3", "timestamp_created": 1496521453, "timestamp_updated": 1496521453, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31677744": {"recommendationid": "31677744", "author": {"steamid": "76561197982446888", "num_games_owned": 1969, "num_reviews": 87, "playtime_forever": 445, "playtime_last_two_weeks": 0, "last_played": 1494479708}, "language": "english", "review": "It is a remake of [i]Ghost'n'Goblins[/i] clone.\nSo much attention to detail, stylish scanlines, such well drawn sprites, such good music score.\nIt really pains me to rate this title negative.\nBut since the Atari 2600 there has never been a more unfair and difficult game.\nWatching the walkthroughs on YouTube, I discover that the XBOX ONE etc. versions are way easier!\nI loved [i]Castlevania:SotN[/i] which was perfectly balanced and never unfair.\n\n[h1]Verdict: Only get it while on sale and if you are frustration-resistant.[/h1]", "timestamp_created": 1494480422, "timestamp_updated": 1494626023, "voted_up": false, "votes_up": 12, "votes_funny": 3, "weighted_vote_score": "0.277684", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31423758": {"recommendationid": "31423758", "author": {"steamid": "76561198023638462", "num_games_owned": 156, "num_reviews": 1, "playtime_forever": 189, "playtime_last_two_weeks": 0, "last_played": 1497130181}, "language": "swedish", "review": "You can feel right away that this is going to be a hell of a ride, and I like it! Superb music, tight controller and great level design!", "timestamp_created": 1493409128, "timestamp_updated": 1493409128, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31382805": {"recommendationid": "31382805", "author": {"steamid": "76561198161628677", "num_games_owned": 40, "num_reviews": 13, "playtime_forever": 2819, "playtime_last_two_weeks": 0, "last_played": 1494794733}, "language": "english", "review": "Cursed Castilla is an arcade action game which is based and inspired by the Ghosts and Goblins series and other retro titles. It brings an 16 bit graphics style, a quick action packed gameplay with tight controls and a high level of difficulty.\n\nThe story is set in the Middle Ages in the Spanish Kingdom. You play as a knight who is sent on a quest -together with other 3 fellow knights- by the King to cleanse the Kingdom from the evading demonic horde. The story basically is a Spanish mythos and there are several parts of the game where creatures from other European mythologies appear. Since the creators are Spanish the game overall in its music and its design has a Spanish vibe.\n\nThe game is colorful and has I think hand drawn graphics, which look awesome. Aesthetically it all fits so well together. It has a retro style but also looks fresh and cheerful since it displays an arcade style. The creatures are well designed and there is a huge variety of enemies to counter. What stands out however are the bosses. There is a huge diversity between them and there was a lot of creativity in their design. For me it was the most interesting part of the game. \n\nThe controls are almost identical to the Ghosts n Goblins games, tight as hell and you have to be very precise otherwise the game punishes you like it’s no tomorrow. And since you get the good ending only when you lose a certain amount of continues it will frustrate you a lot when you start losing repetitively. There is also a variety of weapons you can use but I found out that only 2-3 weapons are playable in the later stages so there is not much into it.\n\nThe music is decent, not memorable though like other recent platformers I played but most of tracks are kind of catchy and they fit the stages they are played to.\n\nThe game overall is very hard. A look at the achievement percentages displays how frustrating the game can be. Some achievements at the earlier stages of the game are only completed by 10-15% of the players, which is insane. In my opinion the game pays tribute to the classics also to that aspect, that of the reward that comes from mastering the controls and being very patient. \n\nSadly there isn’t much replay ability once you get the good endings, however that could take you forever like it took me 30 hours. Overall Cursed Castilla was a great retro experience despite the high difficulty and I would recommend playing it to anyone who has ever owned a 8-16 bit console and likes these types of games.", "timestamp_created": 1493240464, "timestamp_updated": 1493753534, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.535912", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31284486": {"recommendationid": "31284486", "author": {"steamid": "76561198064724196", "num_games_owned": 488, "num_reviews": 7, "playtime_forever": 28, "playtime_last_two_weeks": 0, "last_played": 1492813135}, "language": "spanish", "review": "Me habían hablado muy bien de este juego, diciendo que era un juego unico e independiente creado en España pero lo unico que veo es un copia de Ghost and Ghouls con ambientación medieval española, como curiosidad esta bien pero como juego, para eso me quedo con el clasico", "timestamp_created": 1492813426, "timestamp_updated": 1492813426, "voted_up": false, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.207076", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31250066": {"recommendationid": "31250066", "author": {"steamid": "76561197999243085", "num_games_owned": 1775, "num_reviews": 68, "playtime_forever": 525, "playtime_last_two_weeks": 0, "last_played": 1484754052}, "language": "english", "review": "In this game you assume the role of Don Ramiro, the heroic knight, travelling through various medieval locales, in his quest to find a way to cleanse the land of Tolomera from an evil curse. Great 2D action platformer from talented developer Locomalito, an excellent tribute to the old classic game Ghosts 'n' Goblins. Also, great music score, very close to the atmosphere of the game. For God and Castilla!", "timestamp_created": 1492666082, "timestamp_updated": 1492666283, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.591065", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31095434": {"recommendationid": "31095434", "author": {"steamid": "76561198012422944", "num_games_owned": 651, "num_reviews": 5, "playtime_forever": 320, "playtime_last_two_weeks": 0, "last_played": 1508031252}, "language": "spanish", "review": "Excelente juego, los creadores realmente pudieron captar la esencia de los viejos arcades, yo que crecí jugando en los salones de maquinitas me sentí conmovido al verlo, realmente es una perfecta mezcla entre Ghosts 'n Goblins y Ghouls 'n Ghosts, muy bien logrado, muy buena jugabilidad, escenarios perfectos, jefes al final de los niveles, buena música acorde a los arcades, buena historia, en si un excelente juego, totalmente recomendado, sigan así y espero Maldita Castilla 2.", "timestamp_created": 1491997741, "timestamp_updated": 1491997741, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.499395", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31076625": {"recommendationid": "31076625", "author": {"steamid": "76561198025403991", "num_games_owned": 1284, "num_reviews": 108, "playtime_forever": 122, "playtime_last_two_weeks": 0, "last_played": 1491900790}, "language": "german", "review": "https://youtu.be/0ZOmmFL9y9g\n\nGhost N Goblins Nostalgie Trip\nPro:\n50 Minuten Dauer\nEinfach zu Spielen - Schwer zu Meistern\nFair\nDie möglichkeit zum Speed Run..\n\nCon:\nMusik zu laut keine Möglichkeit es leiser zu stellen.\n\n8/10", "timestamp_created": 1491911190, "timestamp_updated": 1491911190, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.495771", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31053786": {"recommendationid": "31053786", "author": {"steamid": "76561198217121273", "num_games_owned": 288, "num_reviews": 59, "playtime_forever": 4391, "playtime_last_two_weeks": 0, "last_played": 1511830358}, "language": "spanish", "review": "Un juego épico, uno de mis favoritos.\n\nMaldita Castilla me gustó tanto que me ha viciado muchas horas, y hasta llegué a completar la colección de emoticonos que eso es muy dificil de conseguir para este mismo juego (algunos emoticonos ya se agotaron y no los están vendiendo, otros son muy caros).\n\nSi te gustan los juegos retro y tienes dinero de sobra, es muy recomendable!", "timestamp_created": 1491797712, "timestamp_updated": 1511419769, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.486435", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31050984": {"recommendationid": "31050984", "author": {"steamid": "76561198057946695", "num_games_owned": 291, "num_reviews": 25, "playtime_forever": 613, "playtime_last_two_weeks": 0, "last_played": 1491543404}, "language": "spanish", "review": "un excelente juego que rescata muchos aspectos del antiguo ghouls n goblins de king arthur en super nintendo y sega genesis solo que con otro protagonista , lo recomiendo , super entretenido , musica y sonidos geniales", "timestamp_created": 1491780901, "timestamp_updated": 1491780901, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.510476", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30969816": {"recommendationid": "30969816", "author": {"steamid": "76561198040030741", "num_games_owned": 919, "num_reviews": 111, "playtime_forever": 644, "playtime_last_two_weeks": 0, "last_played": 1491418399}, "language": "english", "review": "Writing a review to this game will be like reviewing ghouls and goblins.\nLook, it's a modern version of it, and in my opinion - a [b]very polished[/b] modern version of it.\n\nIn addition, the achievements are fun and challenging, so if you're a completionist then it will definitely keep you busy for a while.\n\nGrab it if you're into difficult platformers, and you won't be dissapointed.", "timestamp_created": 1491432516, "timestamp_updated": 1491432516, "voted_up": true, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.653404", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30912173": {"recommendationid": "30912173", "author": {"steamid": "76561198261837689", "num_games_owned": 329, "num_reviews": 28, "playtime_forever": 31, "playtime_last_two_weeks": 0, "last_played": 1491612303}, "language": "schinese", "review": "这游戏等于复古版的黑魂系列", "timestamp_created": 1491175282, "timestamp_updated": 1491175282, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497512", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30906590": {"recommendationid": "30906590", "author": {"steamid": "76561197992810672", "num_games_owned": 146, "num_reviews": 6, "playtime_forever": 224, "playtime_last_two_weeks": 0, "last_played": 1491245740}, "language": "english", "review": "This game is wonderful.\n\nWhile gameplay-wise it is more or less Ghouls 'n' Ghosts, it is clearly made with quite a lot of passion. So much attention was lovingly given to the details in this game - the graphics, sound, and controls all authentically capture the feel of a platforming game from the early 90s. The music and sound effects perfectly capture the aesthetic of the Sega Genesis sound chip, the sprites are all lovingly detailed and well animated, without any of the pixel size discrepancy that you might see in more modern games that attempt to be retro - I bet they even took into account the hardware limitations of 16 bit platformers of the era, and tried to design the sprites around the limited color palette provided by consoles of the early 90s.\n\nThe game is quite challenging, but fun in the way that it keeps you coming back. Even though you die, you keep wanting to try again. It truly captures the Capcom feel in that regard, and also rewards you for challenging yourself to complete the game with less credits, or collecting all the key items hidden in each stage. There is even a speedrun mode available for those who are interested. This game is an underrated gem and if you like platformers of the early 90s you owe it to yourself to get this game.", "timestamp_created": 1491154799, "timestamp_updated": 1491154799, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503817", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30898657": {"recommendationid": "30898657", "author": {"steamid": "76561198277504441", "num_games_owned": 466, "num_reviews": 142, "playtime_forever": 78, "playtime_last_two_weeks": 0, "last_played": 1491131400}, "language": "english", "review": "A fantastic hommage to the genre. Both graphics and contols stick to the feeling of the old days, but are slighly modernized for a better experience. There is a \"continue\" system but no game over you have endless credits. Do you exit the game before completing a chapter ! This is the only checkpoints that are actually saved by the game. The difficulty is very well balanced, this game is a challenge, but one that is doable for most.", "timestamp_created": 1491131612, "timestamp_updated": 1491131612, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.533158", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30856111": {"recommendationid": "30856111", "author": {"steamid": "76561198246924776", "num_games_owned": 197, "num_reviews": 99, "playtime_forever": 91, "playtime_last_two_weeks": 0, "last_played": 1501796712}, "language": "spanish", "review": "Besos y abrazos para \"Loco Malito\" y \"Gryzor87\"", "timestamp_created": 1490975713, "timestamp_updated": 1490975713, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.499395", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30826920": {"recommendationid": "30826920", "author": {"steamid": "76561198027739376", "num_games_owned": 166, "num_reviews": 3, "playtime_forever": 113, "playtime_last_two_weeks": 0, "last_played": 1509084165}, "language": "english", "review": "ive got ten minutes in this game and let me tell you, if youve played ghouls n ghosts you already know what to expect. this game is fun, challenging, and a major ass kicker. it will grab you by the balls and drag you for a 100 foot ride but oh.....magawd is it fun. the  controls are actually very fluid, the music fits every scene perfectly and this is so....video gamey. if you're into retro looking trope games that actually deliver something to the table, and this isn't it for you, i don't know what to tell you\ntl;dr play the game, it's actually good", "timestamp_created": 1490851320, "timestamp_updated": 1490851320, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.518055", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30821063": {"recommendationid": "30821063", "author": {"steamid": "76561198057103167", "num_games_owned": 1758, "num_reviews": 65, "playtime_forever": 147, "playtime_last_two_weeks": 0, "last_played": 1492969904}, "language": "french", "review": "si vous n aimez pas Ghost'n Goblins ou Ghost'n Ghouls , vous pouvez passer votre chemin , pour les autres ce ne sera que du bonheur ! 18/20", "timestamp_created": 1490820185, "timestamp_updated": 1490820185, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.543568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30790592": {"recommendationid": "30790592", "author": {"steamid": "76561197964697274", "num_games_owned": 293, "num_reviews": 19, "playtime_forever": 127, "playtime_last_two_weeks": 0, "last_played": 1490698833}, "language": "english", "review": "A lot of fun and a lot more content and polish than what you'd expect from a small title like this. Highly recommended for fans of Ghosts & Goblins! About 2 hours played to get the bad ending, but clearly a lot left to do for those who are into that stuff.", "timestamp_created": 1490698888, "timestamp_updated": 1490698925, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.572786", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30564134": {"recommendationid": "30564134", "author": {"steamid": "76561198039922227", "num_games_owned": 87, "num_reviews": 4, "playtime_forever": 339, "playtime_last_two_weeks": 0, "last_played": 1504279737}, "language": "spanish", "review": "He estado leyendo bastantes análisis de los usuarios, y no he encontrado ninguno que hable del juego desde la perspectiva de un novato en este género, así que como me encuentro en ese umbral, os voy a exponer mis breves horas de juego.\n\nComo ya he dicho, soy una persona que no ha crecido con este tipo de juegos, pues soy más joven, pero aún así no pude evitar sentirme atraída al ver su ficha aquí en Steam. Lo que más me llamó la atención fue que estuviera basado en Don Quijote y en la ambientación de esa historia, y al vivir actualmente en Castilla - La Mancha pues como que tiré un poco para casa, así que se fue derecho a la lista de deseados.\n\nCuando me puse por primera vez frente al juego sabía que iba a ser díficil, y no fallé. Tiene una dificultad acorde al tipo de juego del que bebe, siendo en mi caso particular hasta frustrante, ya que los plataformas no son lo mío.\n\n¿Recomiendo este juego para aquellos que se estén iniciando en este género? Sí, totalmente. Se nota que le han puesto muchísimo amor, los controles son buenos (y se puede jugar tanto con el teclado como con un mando), la banda sonora es buena y el diseño de niveles es exquisito.\n\nPara finalizar, daré unos consejos que espero que os ayuden a los que, como yo, es vuestra primera toma de contacto con este género:\n- Los enemigos y el escenario van a hacerte la vida imposible. Pero no te preocupes, hay una serie de patrones que acabarás por ver y aprovechar a tu favor.\n- Morirás MUCHÍSIMO. Que eso no te desanime a dejarlo, pues es normal. Mejor tómate un descanso y luego lo retomas.\n- Mucha paciencia. Al morir tantas veces y tener una alta dificultad para quien no esté acostumbrado, podrás llegar a sentir que el juego es injusto (que a veces lo es, para qué nos vamos a engañar); pero conforme juegues una y otra vez, verás cómo lo vas haciendo mejor y vas avanzando poco a poco. La satisfacción de terminar una fase completa es enorme.\n- Probad tanto con el teclado como con el mando, aunque recomendaría mejor el teclado, más que nada por la precisión. Pero encontrad vosotros mismos lo que se adapte mejor.\n\nPara finalizar diré que, si tras todo esto no te he convencido para jugarlo, te descargues la versión gratuita del juego en la página del autor y lo pruebes. Yo era de esas personas que se negaba a jugar este tipo de juegos por la dificultad que tienen y porque \"no iba a ser capaz de pasármelo\", y tras dos horas me he pasado las dos primeras fases y tengo muchas ganas de acabarlo, y sé que aunque me cueste, lo voy a conseguir.\n\nDadle una oportunidad a juegos que no soléis jugar, porque seguramente os llevéis una grata sorpresa.", "timestamp_created": 1489732577, "timestamp_updated": 1489732577, "voted_up": true, "votes_up": 42, "votes_funny": 2, "weighted_vote_score": "0.829825", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30480043": {"recommendationid": "30480043", "author": {"steamid": "76561198277332300", "num_games_owned": 138, "num_reviews": 41, "playtime_forever": 605, "playtime_last_two_weeks": 0, "last_played": 1488260097}, "language": "english", "review": "A \"Ghosts 'n' Goblins\" love letter that should be a hell of a lot more popular than it is, what with its phenomenal soundtrack and level design.", "timestamp_created": 1489354272, "timestamp_updated": 1513732640, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30088511": {"recommendationid": "30088511", "author": {"steamid": "76561198148084543", "num_games_owned": 163, "num_reviews": 126, "playtime_forever": 341, "playtime_last_two_weeks": 0, "last_played": 1487446402}, "language": "spanish", "review": "Es un buen homenage al clasico Ghost and goblin.", "timestamp_created": 1487716667, "timestamp_updated": 1491500921, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.498458", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29979194": {"recommendationid": "29979194", "author": {"steamid": "76561197971561879", "num_games_owned": 7793, "num_reviews": 106, "playtime_forever": 255, "playtime_last_two_weeks": 0, "last_played": 1498385124}, "language": "german", "review": "Bei Cursed Castilla (Maldita Castilla EX) handelt es sich um eine äußerst gelungene Hommage an 80er Jahre Titel wie Ghosts 'n Goblins & Ghouls ’n Ghosts vom talentierten, spanischen Indie-Entwickler Locomalito, der hier sein erstes kommerzielles Projekt veröffentlicht. Selbst der Spielcharakter ähnelt Ritter Arthur sehr und das vermutlich auch nicht rein zufällig. Der Entwickler hat hier mit absoluter Liebe zum Detail gecodet. Ihr schnetzelt euch mit eurem Protagonisten durch das mittelalterliche Kastilien (Spanien). Auf eurem Weg begegnen euch zahlreiche Gegner wie Zombies, Henker und Fabelwesen und am Ende jeden Levels warten Bosse wie kopflose Ritter, zweiköpfige Adler oder Riesenwürmer auf euch. Zum Glück findet man auf seinem Weg aber auch gelegetnlich Schatztruhen, die Münzen, mit denen ihr später euren Helden aufwerten könnt, aber auch neue Waffen oder sogar Gesundheitstränke beinhalten.\n\nDer Schwierigkeitsgrad ist ähnlich wie bei vielen 80er Jahre-Vorbildern recht hoch angesetzt und nur etwas für geübte Gamer. Selbst Genre-Könner werden viele Tode sterben. Pikant: Nach jedem Ableben muss man das jeweilige Level leider wieder von vorne starten. Frustresistenz ist also Voraussetzung bei diesem Spiel. Das Spiel bietet aber glücklicherweise eine Continue-Funktion, wie man sie auch aus den glorreichen 80ern kennt.\n\nDie Steuerung sowohl per Steam Controller als auch per Xbox One Controller ist absolut präzise und punktgenau. Die Pixelgrafik ist liebevoll animiert und als Clou kann in den Einstellungen aus 10 verschiedenen Grafikmodi ausgewählt werden (u.a. 4:3 mit CRT-Scanlinien) um das Retro-Feeling noch zu verbessern. Selbst der 8-Bit Sound weiß zu gefallen und untermalt die mittelalterliche Spielkulisse meisterhaft.\n\nDie schon fast obligatorischen Steam-Features wie Achievements und Trading Cards sind natürlich auch vorhanden und werten die Spielerfahrung zusätzlich auf.\n\n9/10 Punkte von meiner Seite für dieses knüppelharte aber nie unfaire Retro-Jump 'n' Run und auch zu diesem Preis eine klare Kaufempfehlung von meiner Seite!", "timestamp_created": 1487318144, "timestamp_updated": 1500390655, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.631902", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29967174": {"recommendationid": "29967174", "author": {"steamid": "76561198176182742", "num_games_owned": 257, "num_reviews": 10, "playtime_forever": 525, "playtime_last_two_weeks": 0, "last_played": 1505081244}, "language": "french", "review": "Je ne sais pas quoi penser de ce jeu \nIl est excellent c'est indéniable, mais je trouve la méthode pour arriver a la vrai fin du jeux plus de que moyenne, j'ai pas envie de spoiler les joueurs donc j'en dirai pas plus, a mes yeux sans utiliser une solution c'est a s'taper la tête contre le mur pour y arriver, ou alors faut une patience de moine tibétain, moi j'ai choisis la soluce, c'est rare \n\nAprés je change mon éval négative en positive car malgré tout si on enlève ça, le jeux est franchement génial bien que sa durée de vie soit tres tres courte si on enlève le rajout de durée de vie artificiel \n\nLe gameplay est un petit bijoux, je tiens a le signaler \n\nMais c'est a prendre à 5€ ou 7€, pas plus", "timestamp_created": 1487266463, "timestamp_updated": 1505106168, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502262", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29511632": {"recommendationid": "29511632", "author": {"steamid": "76561198044140048", "num_games_owned": 260, "num_reviews": 118, "playtime_forever": 372, "playtime_last_two_weeks": 0, "last_played": 1505261404}, "language": "english", "review": "I love it so far.", "timestamp_created": 1485475561, "timestamp_updated": 1485475561, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.459559", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29455083": {"recommendationid": "29455083", "author": {"steamid": "76561197969618603", "num_games_owned": 984, "num_reviews": 59, "playtime_forever": 194, "playtime_last_two_weeks": 0, "last_played": 1485232047}, "language": "english", "review": "So glad Locomalito has found a publisher willing to work on his time and terms. Ive wanted to support him for so long as his games are awesome, short, and brutally hard. I hope a Steam version of Hydorah is their next venture.", "timestamp_created": 1485232218, "timestamp_updated": 1485232218, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29298072": {"recommendationid": "29298072", "author": {"steamid": "76561198261991006", "num_games_owned": 83, "num_reviews": 22, "playtime_forever": 1528, "playtime_last_two_weeks": 0, "last_played": 1510370854}, "language": "spanish", "review": "[h1] ESTE ANALISIS ES UNA RE-EDICION DEL QUE HICE PARA EL LANZAMIENTO DE ESTE JUEGO, SIENTO QUE EN ESE NO ACLARE ALGUNAS COSAS IMPORTANTES, COSA QUE VOY A HACER EN ESTA OCACION [/H1]\n\nmaldita castilla, en cuanto a retro nostalgia se ha visto mucho ultimamente, revivir generos olvidados es una moda entre los programadores de hoy en dia y toman como base algun juego de antaño para hacer el suyo, aun no tiene una etiqueta propia pero se han estado apoderando tanto de el mercado indie como de los AAA, sonic mania, el regreso de cloud en final fantasi xv y hasta marvel vs capcom es una prueba de ello, pero nunca habia visto una re-edicion, o mejor dicho, un homenaje tan fiel como maldita castilla, en terminos simples es un ghosts and goblins pero tiene algo que lo hace un poco mas disfrutable, quizas nos enteremos en este analisis super detallado de thenrgdrink... VAMOS! (que?, algun problema con el vamos?)\n\n[h1] gameplay: [/h1] los controles son simples, asumo que estan jugando con mando que es lo que recomiendo, si no pues usen su imaginacion, utilizas \"A\" para saltar y \"X\" para atacar, con el D-pad te mueves y ya esta, en ningun momento hay nuevas mecanicas que te hagan usar botones nuevos, esta es la manera que tiene el juego de decirte que tu personaje es humano y se esta aferrando a su espada y su escudo para enfrentarse a un ejercito maligno venido del infierno el solo, resumido: TE VAS A CAG*R, de esta manera, en vez de mejorar un arbol de habilidades o memorizar combos, el juego te obliga a especializarte con lo poco que tienes y aprender a moverte en consecuencia a patrones y no a situaciones y ver que arma y sub arma va mejor con tu estilo de juego\n\n[h1] soundtrack: [/h1] a pesar de que el juego esta pensado para asemejarse a un arcade, tanto los graficos como la banda sonora se sienten mas como lo que uno se espera de una sega genesis, es 16 bits puro y duro a rabo suelto, eso si, la calidad es excelente, tetrica y cambia de acuerdo al ambiente con el cual se mimetiza de tal manera que se siente homogeneo y natural, muy buen trabajo en la banda sonora\n\n[h1] apartado visual: [/h1] no confundir con graficos, ya explique que el juego es de 16 bits, fin de la discusion, pero obviando los graficos y poniendo mas enfasis en los modelos, que tal queda todo en conjunto? pues muy bien, la verdad me ha paresido un gran apartado visual que como explique antes, se mimetiza perfectamente con la musica, sin embargo el juego va un poco mas alla y pone algunas cosas curiosas como un cuerpo degollado buscando su cabeza entre un monton bajo una guillotina o un monton de cadaveres apilados que bien podria ser un simple sprite estatico pero se pueden ver torsos sobresalientes que intentan liberarse, ademas (esto es un pequeño spoiler sobre los niveles finales ) [spoiler] en el infierno, hay gente crucificada en un rio de sangre cuya bahia s un enorme monticulo de cuerpos, esta nublado con nubes escarlatas y los interiores son decadentes y se escuchan lamentos y sollozos [/spoiler] en definitiva, un muy buen trabajo a nivel visual\n\n[h1] dificultad [/h1] sabes como los speed runners se pasan los juegos antiguos como super mario bros o metroid tan rapidoy sin fallos? porque el juego se mueve en base a patrones y movimientos predecibles, este juego es fiel hasta en eso ya que todo sigue un patron definido, los enemigos salen cuando toca y te disparan siempre en linea recta, si eres capaz de dibujar un mapa con todos los patrones de cada enemigo en tu rango de vision no sera tan dificil pasar este juego cuando lo hayas visto todo (aunque aun siendo la primera vez hay algunos patrones faciles pero que ya sea por la tension o por la cantidad de enemigos cercanos, el conjunto se hace complicado) claro, luego hay cosas como en le segundo nivel cuando las harpias se acumulan pero aunque cada harpia actue de manera independiente todas se acercan a ti de la misma manera, por lo que la dificultad se va en cuanto mantienes la calma y aprendes a enfrentarte a cada enemigo uno a uno aun en momentos de tension, no me malinterpreten, maldita castilla es muy dificil, pero a diferencia de su inspiracion: ghost and goblins, hay un patron a simple vista y todo va a su ritmo, algunas cosas mas rapidas que otras pero te acostumbras rapido y la mayor parte del tiempo no cuenta con muertes arbitrarias como GnG, y eso hace al juego un poco mas dificil, pero mil veces mas disfrutable\n\n[h1] conclucion: [/h1] no voy a decir que maldita castilla es perfecto, tiene sus fallos, el juego es algo corto y aunque te alienta a jugarlo varias veces para sacar el mejor final, estoy bastante lejos de pasarme el juego en menos de 5 continues y con todas las lagrimas de moura, cuenta con varias armas pero a penas use 3 de ellas, si los cofres con armas tubieran armas especificas me darian una razon para probarlas todas, pero si cada vez que encuentro uno me das a elejir entre el arma que quiero, voy a terminar jugando con la que me sienta mas comodo sin la necesidad de variar, finalmente, algunos power ups aparecen tan poco y son tan reemplazables que es como si ni existieran, pero estos son pequeños fallos comparado a las virtudes que este juego posee, si estas buscando un juego brutal que te haga llorar sangre, pues igual bloody trapland o una meta del 1001% en the binding of isaac tampoco son mala idea, pero si solo estas buscando un reto o quieres probar algo nuevo, pues lo recomiendo, eso si, si lo pillas en rebajas ni lo dudes\n\n[h1] nota final [/h1] le doy a maldita castilla un 9/10, un excelente homenaje de ghost and goblins aunque un poco mas justo y con una historia detras, ademas de algunos momentos y con un grado de calidad y frescura de niveles elegantes, recomendado para todos los amantes del retro y para los old-school, les reto a pasarselo sin guias en menos de 5 continues\n\n----------------------------------------------------------------------\n\nsi te ha parecido que hice un buen trabajo con este analisis, agradeceria un pulgar arriba de tu parte, si crees que me he saltado un punto, o que no detalle algo importante, puedes hacermelo saber en los comentarios evitando insultos o actitudes toxicas\n\npor mi parte eso ha sido todo, nos vemos en el proximo analisis, NRG fuera", "timestamp_created": 1484581782, "timestamp_updated": 1509511204, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.507389", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29280308": {"recommendationid": "29280308", "author": {"steamid": "76561198026650017", "num_games_owned": 30, "num_reviews": 1, "playtime_forever": 853, "playtime_last_two_weeks": 0, "last_played": 1507141783}, "language": "spanish", "review": "Un verdadero homenaje a los arcades clásicos. Cláramente inspirado en Ghouls and Ghost, pero influido por otras fuentes, este juego es un compendio de virtudes: Bien diseñado, niveles inteligentemente planeados, variado en armas, escenarios y enemigos, bosses finales, jugabilidad excelente, deliciosos gráficos y sonido retro, y una dificultad alta (como debe ser) pero bien ajustada.\nPor mi parte, uno de los mejores juegos retro que he disfrutado junto con Hydorah (que también es del mismo autor, Locomalito). Lo recomiendo 100% a los que buscan buenos desafíos.\n¡Por Dios y por Castilla! XDD", "timestamp_created": 1484505356, "timestamp_updated": 1484505356, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28962509": {"recommendationid": "28962509", "author": {"steamid": "76561198009287364", "num_games_owned": 167, "num_reviews": 18, "playtime_forever": 427, "playtime_last_two_weeks": 0, "last_played": 1483404845}, "language": "spanish", "review": "Gran juego de estilo ochentero y español. Bien documentado y entretenido. Recomendado si tienes más de 30 años.", "timestamp_created": 1483406984, "timestamp_updated": 1483406984, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28937062": {"recommendationid": "28937062", "author": {"steamid": "76561198005230618", "num_games_owned": 1515, "num_reviews": 111, "playtime_forever": 860, "playtime_last_two_weeks": 0, "last_played": 1487641652}, "language": "japanese", "review": "武器を投げつけながら進む2Dアクションゲーム。魔界村フォロワー。\n死なずに進めることで武器やアイテムを維持できるので、上手くなるほど気持ちよくプレイできるのが醍醐味。\n難易度の高いボス戦、雑魚敵の種類の多さ、様々なステージ構成で密度が濃く飽きさせない。\n\nグラフィックと音楽も非常に良い。おすすめ。", "timestamp_created": 1483356834, "timestamp_updated": 1511363424, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.615500", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28933019": {"recommendationid": "28933019", "author": {"steamid": "76561198034738102", "num_games_owned": 206, "num_reviews": 22, "playtime_forever": 80, "playtime_last_two_weeks": 0, "last_played": 1483388881}, "language": "english", "review": "Very good arcade platformer. Would reccomend.", "timestamp_created": 1483347227, "timestamp_updated": 1483347227, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.470297", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28928665": {"recommendationid": "28928665", "author": {"steamid": "76561198016640882", "num_games_owned": 420, "num_reviews": 4, "playtime_forever": 7, "playtime_last_two_weeks": 0, "last_played": 1479536070}, "language": "english", "review": "Every good Ouya game ends up on Steam.", "timestamp_created": 1483334654, "timestamp_updated": 1483334654, "voted_up": true, "votes_up": 7, "votes_funny": 4, "weighted_vote_score": "0.528782", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28830791": {"recommendationid": "28830791", "author": {"steamid": "76561197970235599", "num_games_owned": 336, "num_reviews": 7, "playtime_forever": 333, "playtime_last_two_weeks": 0, "last_played": 1487055489}, "language": "spanish", "review": "Está muy bien hecho. Consigue recordar al original. Eso sí: Encuentro a faltar un modo de juego más fácil aunque sea sin puntuación ni records que te permita reintentar sin tener que repetir nada. A mi esto me mata por completo.", "timestamp_created": 1483109462, "timestamp_updated": 1483109462, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28827934": {"recommendationid": "28827934", "author": {"steamid": "76561198120093307", "num_games_owned": 102, "num_reviews": 2, "playtime_forever": 81, "playtime_last_two_weeks": 0, "last_played": 1483103796}, "language": "japanese", "review": "脱ぐほどではないがそれなりの難易度", "timestamp_created": 1483103975, "timestamp_updated": 1483103975, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.404180", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28768313": {"recommendationid": "28768313", "author": {"steamid": "76561197988345519", "num_games_owned": 642, "num_reviews": 1, "playtime_forever": 362, "playtime_last_two_weeks": 0, "last_played": 1482152718}, "language": "spanish", "review": "La mejor manera de recordar esas tardes de vicio extremo a juegos cortos pero intensos", "timestamp_created": 1482962964, "timestamp_updated": 1482962964, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.504542", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28698407": {"recommendationid": "28698407", "author": {"steamid": "76561198043395559", "num_games_owned": 306, "num_reviews": 1, "playtime_forever": 82, "playtime_last_two_weeks": 14, "last_played": 1514071111}, "language": "english", "review": "Review of Cursed Castilla (With help from a 5 year old)\n\nGraphics:\nGood. The sword weapon I hate.\n\nMusic:\nThe music is pretty good. Thats it.\n\nGameplay:\nPlaying the game was bad. The people who made it take drugs. what do drugs taste like anyway?\n\n0/10", "timestamp_created": 1482812574, "timestamp_updated": 1482812617, "voted_up": true, "votes_up": 0, "votes_funny": 2, "weighted_vote_score": "0.314923", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28647419": {"recommendationid": "28647419", "author": {"steamid": "76561198059971262", "num_games_owned": 1218, "num_reviews": 294, "playtime_forever": 387, "playtime_last_two_weeks": 0, "last_played": 1501209489}, "language": "english", "review": "!!!!!WARNING!!!!!\n\nOn every new game, you have four continues, and if you want more, you have to pay. \n\nYeah, that's right: you have to pay to continue playing in the same file. The price is actually quite steep, especially for a game making hommage to old arcade games.\n\nYou're wondering how much, right? \n\nIt cost your soul.", "timestamp_created": 1482698968, "timestamp_updated": 1482698968, "voted_up": true, "votes_up": 9, "votes_funny": 20, "weighted_vote_score": "0.375934", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28381943": {"recommendationid": "28381943", "author": {"steamid": "76561198031530139", "num_games_owned": 1092, "num_reviews": 66, "playtime_forever": 60, "playtime_last_two_weeks": 0, "last_played": 1481346655}, "language": "english", "review": "A difficult but fair platform game that emulates the feel of the arcade. For a more in depth look, check out my vid on the game: https://www.youtube.com/watch?v=DpPDcuzkaQw", "timestamp_created": 1481777970, "timestamp_updated": 1481777970, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.473484", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "28368345": {"recommendationid": "28368345", "author": {"steamid": "76561198019292629", "num_games_owned": 216, "num_reviews": 6, "playtime_forever": 451, "playtime_last_two_weeks": 0, "last_played": 1503005026}, "language": "english", "review": "its really utterly fantastic game.  so very reminiscent of the classic arcade genre.  very challenging but great fun.  i really wish there were more games of this calibre on steam.  steam needs more goddamn good quality platformers seriously.  10/10", "timestamp_created": 1481756752, "timestamp_updated": 1481756752, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28195754": {"recommendationid": "28195754", "author": {"steamid": "76561198233936492", "num_games_owned": 299, "num_reviews": 14, "playtime_forever": 381, "playtime_last_two_weeks": 0, "last_played": 1482683431}, "language": "spanish", "review": "Juego muy recomendable si quieres una experiencia al estilo ghost and ghouls modernizada, tiene muy buen nivel de dificultad, es un poco menos frustrante y más divertido, igual o más dificil, cuenta con numerosos objetos muy bien ocultos, al al igual que el juego en el que se inspiró si no llegas con los items adecuados, te mandan a repetir todo.\n\nEl arte del juego basado en caballeros españoles quedó muy bien e interesante, los enemigos son muy variados, no te andan repitiendo el mismo mono pero con otro color, es muy poco el reciclaje, casi nada, cada escena tiene sus propios enemigos temáticos muy bien pensados y variados.", "timestamp_created": 1480899136, "timestamp_updated": 1480899136, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28139609": {"recommendationid": "28139609", "author": {"steamid": "76561198098519955", "num_games_owned": 192, "num_reviews": 36, "playtime_forever": 258, "playtime_last_two_weeks": 0, "last_played": 1480783024}, "language": "spanish", "review": "Un juegazo español que tiene la esencia pura de los clásicos. Me gustó todo, el diseño de niveles, los jefes y la música pega con el entorno. Todo fan de los videojuegos tiene que tenerlo. Jugué a la versión original y tenía muchas ganas de que llegara a Steam. Está clarísimo que es un homenaje al gran Ghost and Goblins y a Gargoyle's Quest, pues al final sale una gárgola similar a Firebrand.  Mis felicitaciones a los creadores, se nota que el juego está hecho con cariño y espero que hagan una continuación.", "timestamp_created": 1480689031, "timestamp_updated": 1480689031, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27998929": {"recommendationid": "27998929", "author": {"steamid": "76561198282929183", "num_games_owned": 94, "num_reviews": 2, "playtime_forever": 118, "playtime_last_two_weeks": 0, "last_played": 1480708804}, "language": "spanish", "review": "Un juego de estilo retro muy cuidado.\n\nComo \"old gamer\", veo en este juego el espiritu de las recreativas de los 80', y concretamente la saga Ghost'n goblins.\n\nJuego altamente recomendable, eso si, hay que hacerse con un buen pad, ya que el juego es duro y la respuesta del mando debe ser aun mas precisa de lo habitual ;)", "timestamp_created": 1480371097, "timestamp_updated": 1480371097, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27782889": {"recommendationid": "27782889", "author": {"steamid": "76561197982424297", "num_games_owned": 619, "num_reviews": 1, "playtime_forever": 9, "playtime_last_two_weeks": 0, "last_played": 1485449112}, "language": "spanish", "review": "Excelente juego, transmite mucha nostalgia al volver a los tipicos juegos de antes, donde una jugabilidad que unicamente incluia 2 botones podria resultar algo super desafiante y divertido. Muy recomendable para todo aquel admirador de los juegos de plataforma y aventura del estilo antiguo y para todo aquel novato del genero, que quiera sentir la experiencia de jugar en el año actual, un juego similar a los que dieron el empujon para que la industria hoy sea lo que es.", "timestamp_created": 1480229689, "timestamp_updated": 1480229689, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27635100": {"recommendationid": "27635100", "author": {"steamid": "76561198003086635", "num_games_owned": 1111, "num_reviews": 2, "playtime_forever": 55, "playtime_last_two_weeks": 0, "last_played": 1481581340}, "language": "spanish", "review": "Great and hard homage game", "timestamp_created": 1480156747, "timestamp_updated": 1480156747, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "27632523": {"recommendationid": "27632523", "author": {"steamid": "76561197994148936", "num_games_owned": 1471, "num_reviews": 3, "playtime_forever": 8, "playtime_last_two_weeks": 0, "last_played": 1477226778}, "language": "english", "review": "Did you like Ghost'n Goblins? Or Gouls'n Ghosts?\n\nYou will like this game.", "timestamp_created": 1480155698, "timestamp_updated": 1480155698, "voted_up": true, "votes_up": 19, "votes_funny": 1, "weighted_vote_score": "0.706095", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27475450": {"recommendationid": "27475450", "author": {"steamid": "76561198023162438", "num_games_owned": 714, "num_reviews": 44, "playtime_forever": 524, "playtime_last_two_weeks": 0, "last_played": 1481051693}, "language": "spanish", "review": "Hermoso homenaje español a Ghosts and Goblins. Tiene en total 4 finales, lo cual lo hace muy rejugable. Hay que ser muy habilidoso para sacar el mejor final de todos.", "timestamp_created": 1480086973, "timestamp_updated": 1480086973, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.505766", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27224568": {"recommendationid": "27224568", "author": {"steamid": "76561198005491135", "num_games_owned": 266, "num_reviews": 3, "playtime_forever": 198, "playtime_last_two_weeks": 0, "last_played": 1482773569}, "language": "spanish", "review": "Maldita Castilla es un juego que rinde culto a la época arcade de los 80 y sus juegos del tipo Ghost'n'Goblins, Tiger Road, Black Tiger, Shinobi, Rygar, etc; esto es, scroll lateral y acción intensa. En palabras de Locomalito \"Aunque a muchos nos gustan los juegos de acción y la caballería medieval, no son muchos los juegos que aúnan estas dos cosas (salvo el genial Ghost'n'Goblins claro), así que he pensado, que diablos, voy a hacer uno con todas las cosas que me gustan!\"\n\nY efectivamente, Maldita Castilla es un perfecto tributo de Ghost'n'Goblins, acción de scroll lateral, zombies, monstruos finales de fase y un caballero con armadura que lanza espadas (sospechosamente parecidas a las lanzas de Ghost'n'Goblins). Locomalito junto con Gryzor87 han clavado todo, el espíritu, la jugabilidad, el sonido; además el aspecto gráfico está excelentemente caracterizado por el medievo español y su mitología: \"A pesar de que los lugares y criaturas del juego son fantásticos, la mayoría de ellos están basados en detalles de lugares reales y en ilustraciones de libros de la edad media. Esto, en mi opinión, crea un interesante vínculo entre el juego y la realidad.\"\n\nEl sonido, como en todos los juegos de Locomalito, merece siempre una mención aparte: \"Gryzor87 ha emulando el sonido del chip Yamaha YM2203, con lo que el juego cuenta con sonido de arcade real\". La verdad es que es difícil de expresar el sentimiento de volver a oir ese sonido tan especial de nuestra niñez.\n\nComo experiencia \"extendida\" a partir de la versión original, el trabajo de Abylight en la adaptación más el contenido adicional realizado por Locomalito y Gryzor87 en exclusiva para esta versión hace que merezca la pena financiar este y futuros juegos.\n\nEso sí, los juegos de Locomalito son muy difíciles, sólo aptos para verdaderos jugadores (hombres o mujeres). Una experiencia muy alejada de los juegos triple AAA que están diseñados para no frustrar. Aquí cuando llegues al infierno lo sabrás por lo difícil, no por lo infiernal.\n\nLa percepción sobre la dificultad de sus juegos es algo equivocada, pues Abbaye des Morts es muy asequible. Eso sí, yo aún no me he pasado Hydorah (otro juego que sería alucinante ver dar el salto extendido a Steam y consolas). Pero en ese aspecto Cursed Castilla está más suavizado que sus predecesores, lo que no evitará que sudes sangre para poder pasártelo con \"5 duros\".", "timestamp_created": 1480004257, "timestamp_updated": 1480004257, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27052228": {"recommendationid": "27052228", "author": {"steamid": "76561198019369837", "num_games_owned": 685, "num_reviews": 15, "playtime_forever": 110, "playtime_last_two_weeks": 0, "last_played": 1479970249}, "language": "spanish", "review": "Genial juego homenaje a los clásicos de recreativa pero con su propia personalidad. Difícil como él solo pero muy divertido, compradlo sin dudar.", "timestamp_created": 1479970194, "timestamp_updated": 1479970194, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26961689": {"recommendationid": "26961689", "author": {"steamid": "76561198025226804", "num_games_owned": 688, "num_reviews": 2, "playtime_forever": 693, "playtime_last_two_weeks": 0, "last_played": 1479948904}, "language": "brazilian", "review": "Jogo incrível, extremamente difícil e saudosista, lembra bastante ghost'n'goblins e os tempos de arcade. Excelente trilha sonora e pixel art de deixar o queixo caído, uma mistura de terror e fantasia. Faz valer cada centavo gasto!", "timestamp_created": 1479947459, "timestamp_updated": 1479947459, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.652997", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26894683": {"recommendationid": "26894683", "author": {"steamid": "76561198025745213", "num_games_owned": 570, "num_reviews": 12, "playtime_forever": 116, "playtime_last_two_weeks": 0, "last_played": 1480185610}, "language": "spanish", "review": "Solo he comprado esta versión por el mero hecho de apoyar a Locomalito & Co para que sigan realizando maravillas como esta ya que el juego ya lo pude disfrutar en su día.\n\nEsta versión extendida es simplemente fabulosa. Control exquisito, gráficos y animaciones deliciosas... simplemente te transmite a las sensaciones de los clásicos arcade de toda la vida pero mejor. Maestría absoluta en el diseño de niveles.Dificultad elevada pero justa. Banda sonora y efectos de sonido impecables. Menús sencillos y directos. \n\nUn auténtico juegazo. 11 / 10\n\nComo ingeniero informático y sabiendo de primera mano lo dificil que resulta sacar adelante proyectos de este tipo (y más en solitario) siento un tremendo orgullo de tener a desarrolladores de este nivel en este país. \n\nQue viva Locomalito !\n\n", "timestamp_created": 1479936483, "timestamp_updated": 1479936483, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26732735": {"recommendationid": "26732735", "author": {"steamid": "76561198002595689", "num_games_owned": 134, "num_reviews": 16, "playtime_forever": 599, "playtime_last_two_weeks": 0, "last_played": 1507435794}, "language": "english", "review": "Essentially a Ghosts n Goblins clone. And it's fantastic all the same. ^_^", "timestamp_created": 1479743398, "timestamp_updated": 1479743398, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.582803", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26561166": {"recommendationid": "26561166", "author": {"steamid": "76561198012111055", "num_games_owned": 763, "num_reviews": 221, "playtime_forever": 599, "playtime_last_two_weeks": 0, "last_played": 1493837732}, "language": "spanish", "review": "Antes de nada os recuerdo que en la página de Locomalito (el autor) os podéis descargar el juego gratis. Lo que hay aquí es una versión extendida. No sé que tiene a mayores la extendida porque el gratuito lo jugué hace muchos años. Cuando lo vi en Steam decidí comprarlo para agradecerle al autor su trabajo en éste y otros juegos (si alguna vez tuvisteis un ordenador de 8 bits de su página os recomiendo el L'aabaye des Morts).\n\nA lo que vamos: ¿qué tal el juego? ¿estamos ante otro retroclon que tira de nostalgia para vendernos la moto? Pensad en una cosa: el autor del juego lleva años regalando sus proyectos, así que de primeras aquí no usan la nostalgia para vender nada. Dejado eso claro vemos que Maldita Castilla no oculta sus fuentes de inspiración. De primeras bebe mucho del Ghost'n'Goblins y del Ghost'n'Gouls. Pero no queda ahí la cosa. A medida que avanzas es fácil que recuerdes otros juegos como Castelvania, Gryzor, Némesis, Tiger Road, Goonies, King's Valley... Pero la virtud de este juego es que más que copiar toma la esencia de todos esos juegos, los remezcla y saca un arcade con fases bien diferenciadas que cada pocos pasos te trae la sensación de estar de nuevo en ese bar lleno de humo jugando lo que te quedaba de paga del fin de semana tras comprar chucherías.\n\nPero ojo: si quitas la parte de nostalgia tienes un arcade sólido, bien diseñado y muy bien calibrado. Las fases son difíciles pero tratables. Como en los viejos arcade el avance se mide por prueba/error/calibración y tu caballero responde perfectamente a los mandos, así que si te mueres siempre tienes la sensación de que es culpa tuya y que practicando un poco más llegarás más lejos. Los enemigos finales son también de este palo. Algunos resultan desquiciantes (como el Quijote Loco) pero con paciencia te los puedes pasar una vez aprendes sus patrones.\n\nOtra cosa que eleva su dificultad es que sólo graba la partida cuando terminas una fase completa, con todas sus subfases. Si te mueres en una subfase continúas desde allí pero sólo si no sales del juego. Si sales del juego debes empezar desde el comienzo de la fase. Es por eso que cuando voy a jugar a este juego me reservo como mínimo tres cuartos de hora para pasar la fase completa, de lo contrario estoy tirando el tiempo :D \n\nA nivel gráfico tira de estética de 8 bits con un estilo detallado de pixel-art que a mí me ha gustado mucho. La música, de estilo recreativa, es también un puntazo. Todas las fases tienen una ambientación y enemigos específicos, con lo que el avance se hace interesante pese a carecer de una historia concreta más allá de 'acaba con lo maligno y libera Castilla'. \n\nCreo que una de las cosas que han puesto en la versión extendida es la opción de ver la pantalla como si fuera una recreativa, con los dibujos de la máquina por los lados e incluso la moneda de cinco duros apoyada en el cenicero. Es una chorrada, lo reconozco, pero a mí me ha encantado.\n\nEn fin: que es un buen arcade que recomiendo a todo el que le gusten este tipo de juegos. Los viejales recordaremos nuestra época de padawans de máquina de bar y los jóvenes podrán disfrutar del estilo de varias recreativas clásicas perfectamente recreado en un sólo videojuego.", "timestamp_created": 1478965851, "timestamp_updated": 1478965851, "voted_up": true, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.650829", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26520485": {"recommendationid": "26520485", "author": {"steamid": "76561197979741653", "num_games_owned": 566, "num_reviews": 85, "playtime_forever": 376, "playtime_last_two_weeks": 0, "last_played": 1478126676}, "language": "english", "review": "Cursed Castilla is intended to be a retro action platformer very similar to Ghosts n Goblins, albeit a bit updated. The base weapon consists of two thrown swords, meaning that it is not possible to throw new swords as long as the previous two have not hit a target or left the screen. In consequence, every attack has to be deliberate otherwise an enemy can slip through and touch the player. Other weapons can be found in chests, and the game kindly leaves the choice of which to pick (just wait for the icon to change).\n\nThe quality of life improvements end here. For the rest, the game goes really deep in its retro roots. Jumps are stiff with too little air control. While this was often the case in the 80s, since then platformers are much more fluid in the way the character should handle. There are lives and continues, but thankfully they are infinite. However, after losing four continues the good ending seems disabled. Cursed Castilla is brutally hard, so not many people will be able to achieve that feat. To reach the last levels it is also mandatory to find a few items scattered through the game, a daunting task considering that it is impossible to revisit a previously visited level without starting over. Additionally, although there are frequent enough checkpoints, leaving the game and coming back to play forces to restart from the very beginning of a chapter. All these annoying issues are probably there because the game aimed too extremely for a retro feel. Retro can be good, but in healthy moderation.\n\nControls can be remapped for the keyboard and controllers, however only Xbox type of controllers are recognized by the game. A lovely CRT effect ban be turned ON or OFF. The screen aspect ratio is 4:3, it can be stretched (don’t!) or game art/black bands can be added to fill the sides. The graphics and animations are very good. Simple yet full of character. Monsters and bosses have a very inspired design and behavior, and there are so many of them, it is a joy just to see what the game comes up with next. Variety is a huge virtue of Cursed Castilla. The monsters seem like a mix between classic catacomb dwellers, Spanish and medieval folklore, and the manga Berserk with its demonic denizens. While there is little dialog, the overall feel of the story and the denizens of Castilla is evocatively dark.\n\nSome levels are infuriating. Having to jump atop turtles while being attacked by bees and having to avoid spikes hanging in the air. Climbing a tower using an elevator while being drowned in murderous cogs. Swinging from chain to chain over deadly spikes while being chased after by poisonous bubbles. Jumping on moving platforms while spiders crawl about anywhere on the screen. And every time the player dies, they lose their weapon! I found that sometimes the difficulty was way too high, stretching the border towards unfair. And yet when I replayed those levels, I almost went through them in a breeze. Practice makes perfect. \n\nDespite the flaws and brutal difficulty, I loved the game. It is very earnest in being a hardcore retro-platformer, so it is hard to blame the game for being exactly what it set itself to be. Taken as an old-school platformer that forgot the passing of time, it is brilliant. Released in the 80s or early 90s, it would have been a true classic, still beloved today.\nCursed Castilla is clearly a labor of love, from the game mechanics to the graphics and music. I would heartily recommend it to any speedrunner aficionado, any tough platformer enthusiast or someone hugely passionate about that era of gaming, but it is a harder sell for more mainstream audiences. Curious people that do not intend to go far could just play the freeware, although I am glad that there exists a paid version of the game to reward Locomalito for his excellent work. As to myself, I had a good time with the game; charmed by its graphics and the depth of its adventure, pumped by its precise action, left cold by some very difficult sections and repelled by two last levels that seem almost impossible to reach within a decent time frame. Hard mode separate from a new normal mode would have been nice!\n\nWant to see it in action? Here is my video review.\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=793897324\nMore reviews from me on Steam or here.\nhttp://saveorquit.com/author/8rgk/", "timestamp_created": 1478793237, "timestamp_updated": 1488134988, "voted_up": true, "votes_up": 22, "votes_funny": 1, "weighted_vote_score": "0.727336", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26478384": {"recommendationid": "26478384", "author": {"steamid": "76561198040069414", "num_games_owned": 213, "num_reviews": 9, "playtime_forever": 125, "playtime_last_two_weeks": 0, "last_played": 1478557846}, "language": "english", "review": "Hellish difficulty, lovely graphics and sound, robust gameplay, beautiful level design. This Locomalito is a genius.", "timestamp_created": 1478546826, "timestamp_updated": 1478546826, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.580197", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26462794": {"recommendationid": "26462794", "author": {"steamid": "76561197998363140", "num_games_owned": 505, "num_reviews": 40, "playtime_forever": 709, "playtime_last_two_weeks": 0, "last_played": 1510005303}, "language": "spanish", "review": "Es cierto que existe una saturación indie de títulos de marcada temática retro para atraer al consumidor, pero el título que nos ocupa no se limita a parecer retro, sino que se siente y se juega como tal, entrando en una categoría que muy pocos han conseguido entrar (como Shovel Knight o Megaman 9).\n\nUna delicia para todos los que crecimos echando moneditas en los salones recreativos, que no se limita a copiar a los mas grandes, sino que se atreve a incluso mejorarlos en ciertas mecánicas jugables.\n\n-Lee el análisis completo en: https://letistegaming.blogspot.com.es/2016/10/review-maldita-castilla-ex.html -", "timestamp_created": 1478460434, "timestamp_updated": 1478460434, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.579560", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26440160": {"recommendationid": "26440160", "author": {"steamid": "76561198271805833", "num_games_owned": 36, "num_reviews": 3, "playtime_forever": 271, "playtime_last_two_weeks": 0, "last_played": 1500561359}, "language": "spanish", "review": "Maldita Castilla.... maldito juego, va a hacer que tire el pc por la ventana. Cuando cierro el juego entre maldiciones y promesas de que no voy a jugar más.... en menos de 10 minutos ya lo tengo puesto otra vez.", "timestamp_created": 1478368281, "timestamp_updated": 1478368281, "voted_up": true, "votes_up": 1, "votes_funny": 3, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26408081": {"recommendationid": "26408081", "author": {"steamid": "76561198070252512", "num_games_owned": 117, "num_reviews": 9, "playtime_forever": 11, "playtime_last_two_weeks": 0, "last_played": 1493177830}, "language": "spanish", "review": "Merece mucho la pena. Si te gusta el estilo de ghost and ghost, este puede ser tu juego.", "timestamp_created": 1478217735, "timestamp_updated": 1478217735, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26392744": {"recommendationid": "26392744", "author": {"steamid": "76561197963852020", "num_games_owned": 2033, "num_reviews": 38, "playtime_forever": 460, "playtime_last_two_weeks": 0, "last_played": 1478121589}, "language": "spanish", "review": "Un claro homenaje a Ghost n’ Goblins y a los árcade de la época.\nYa tuve ocasión de jugar a su versión gratuita y me encandiló y en cuanto vi que iba a salir esta versión mejorada la compré al instante.\nEstilo retro 16bit \nOST deliciosa\nConfiguración de vídeo para jugarlo al gusto de cada uno\nAlmanaque con información sobre los personajes, enemigos, items y reproductor de música\nArmas e items de todo tipo \nSecretos y niveles ocultos\nAlta rejugabilidad\n\n\nRecomendadismo a todos los fans de las recreativas", "timestamp_created": 1478134107, "timestamp_updated": 1478134107, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.646097", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26365797": {"recommendationid": "26365797", "author": {"steamid": "76561198132453837", "num_games_owned": 1167, "num_reviews": 23, "playtime_forever": 1115, "playtime_last_two_weeks": 0, "last_played": 1478050295}, "language": "spanish", "review": "Es un videojuego muy bueno, aunque a mi parecer su gran contra es la dificultad, excesiva a mi parecer (no se si por mi ineptitud, pero me ha resultado bastante difícil).\n\nPor lo demás si que me ha gustado mucho, el aspecto ochentero de plataformas, la variedad de niveles y de enemigos, así como el hecho de los diferentes finales.", "timestamp_created": 1478050738, "timestamp_updated": 1478050738, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.576923", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26327374": {"recommendationid": "26327374", "author": {"steamid": "76561197995222377", "num_games_owned": 350, "num_reviews": 24, "playtime_forever": 113, "playtime_last_two_weeks": 0, "last_played": 1511627257}, "language": "english", "review": "It's a modern take on old school Ghouls n Ghosts with a medieval spanish flavor and it's as brutally difficult as that would imply.", "timestamp_created": 1477874897, "timestamp_updated": 1477874897, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.515620", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26306292": {"recommendationid": "26306292", "author": {"steamid": "76561198079106962", "num_games_owned": 343, "num_reviews": 11, "playtime_forever": 887, "playtime_last_two_weeks": 0, "last_played": 1501439581}, "language": "english", "review": "This game is so well designed and awesome. Its well worth the price of admission so give it a shot.", "timestamp_created": 1477798176, "timestamp_updated": 1477798176, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.515620", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26301370": {"recommendationid": "26301370", "author": {"steamid": "76561197969848389", "num_games_owned": 202, "num_reviews": 3, "playtime_forever": 25, "playtime_last_two_weeks": 0, "last_played": 1477732376}, "language": "english", "review": "I love this Game, it´s really hard!  Great Job to locomalito and Gryzor87. The Music is an \"earwig\" and the graphics and gameplay are awesome. I really love this 2D-Pixel-Art-Video-Game !!!!!!!!!!!\n", "timestamp_created": 1477776578, "timestamp_updated": 1477776578, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.515620", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26262576": {"recommendationid": "26262576", "author": {"steamid": "76561198040942566", "num_games_owned": 665, "num_reviews": 2, "playtime_forever": 169, "playtime_last_two_weeks": 0, "last_played": 1506420360}, "language": "spanish", "review": "Impresionante juego de Loco Malito. Todo un homenaje a los clásicos de recreativa.\n\nGráficos, sonido, jugabilidad, dificultad. Todo está cuidado al milímetro para que tengas la sensación de estar gastándote la paga en los recreativos!", "timestamp_created": 1477646293, "timestamp_updated": 1477646293, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26258261": {"recommendationid": "26258261", "author": {"steamid": "76561198041995956", "num_games_owned": 161, "num_reviews": 87, "playtime_forever": 115, "playtime_last_two_weeks": 0, "last_played": 1477626243}, "language": "english", "review": "There's a lot to love about this game.  I really don't but that's on me more than the game.  Be warned, Castilla is BRUTALLY old school difficult and that kinda is what turns me off.  Ghosts and Goblins I can at least argue will not saddle you with a bad ending for using the infinite continues and I'm burnt out from some of the frustrating platforming.\n\nThat said, the soundtrack is excellent, gameplay is old school Ghosts and Goblins with a few innovative tweaks, and the graphics are gorgeous as far as retro goes. Both really charming and really gory and macabre.  I would love to get further in this and see the deeper levels, but I know when something is going to cause me more frustration that joy.  This, like Volgarr the Viking, wear me out too much at this point in my life.\n\nSo, why the thumbs up?  Well...it's good.  It's not a bad game, it's a lot of fun when you're not in the frustrating moments leading to that ominous continue screen.  Those who can deal with difficult games and who are into speed running will love this, but it's just not for me, hence why I'm refunding it.  Nothing but respect for Locomalito, it's a great game and I hope it's a success and more of their games come to Steam.", "timestamp_created": 1477626674, "timestamp_updated": 1477626674, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26235696": {"recommendationid": "26235696", "author": {"steamid": "76561198016305201", "num_games_owned": 86, "num_reviews": 8, "playtime_forever": 253, "playtime_last_two_weeks": 0, "last_played": 1477605750}, "language": "english", "review": "[i]¡Por Dios y por Castilla![/i]\n\n[b]Maldita Castilla EX[/b] is a love letter to old 16-bit action platformers by Locomalito. He’s been known for making high quality old school arcade styled games using a donationware model, and Maldita Castilla EX is his first commercial breakthrough. Published by Abylight Studios, this version presents a few additions to the freeware classic including two new levels, new weapons, a codex, achievements, trading cards and all the good stuff to justify putting a price tag on it.\n\nThe game is clearly inspired by arcade classic [i]Ghosts ‘n Goblins[/i], however like any Locomalito game it doesn’t really stick to the formula of its inspiration, rather the game also sprinkles nods and elements of other similar games like [i]Black Tiger[/i] or [i]Castlevania[/i] among many other classics while also injecting a bit of unique personal touches.\n\nThe gameplay is simple enough, you must traverse through 8 stages killing enemies in the way and defeating a midboss and a boss in each stage. Not all levels are straightforward though as some will be more open ended in design and hide plenty of treasures, including the 5 gems that unlock the true ending which increases replayability. While the task itself sounds simple, carrying it out is not as the game is relentlessly difficult. Unlike arcades of old [b]Maldita Castilla EX[/b] doubles the length of your average stage and implements a strict difficulty level in every single one of them. The game gives you 3 lives with 3 health points per life and has unlimited continues but by the end of the game I’ve had used 54 continues through almost three hours of continuous play and the frustration could really be felt.\n\nThe game completely nails the 16-bit era of arcades with its graphics and sound, every sprite to every detail of the backgrounds is meticulously hand-drawn pixel by pixel in order to ensure the highest level of detail possible while respecting the limitations of the era. The music was composed by Gryzor87 in FM synthesis with specs similar to the Yamaha YM2203 chip that arcades of the time were using. The presentation follows the same pattern, with high-score tables, cutscenes, map screens, everything feels straight out of an arcade of the late 80s and really feels as though you are playing a really old arcade game you’ve never heard of instead of a PC game.\n\n[b]Maldita Castilla EX[/b] is an excellent game, though I find the incredibly high difficulty to be a tall barrier of entry for many. Even though the game can be forgiving enough by allowing you to continue from the same screen and from the beginning of a stage if you quit and leave for another day, the game can and will be really frustrating but entirely doable. In every other aspect it excels and is a worthy purchase to any old school fan who has been craving for some tight action platforming.", "timestamp_created": 1477511031, "timestamp_updated": 1477511031, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.560293", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26207332": {"recommendationid": "26207332", "author": {"steamid": "76561197970691655", "num_games_owned": 98, "num_reviews": 28, "playtime_forever": 109, "playtime_last_two_weeks": 0, "last_played": 1483903990}, "language": "spanish", "review": "GOOD RETRO", "timestamp_created": 1477356576, "timestamp_updated": 1477356576, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26205372": {"recommendationid": "26205372", "author": {"steamid": "76561198100910014", "num_games_owned": 970, "num_reviews": 220, "playtime_forever": 350, "playtime_last_two_weeks": 0, "last_played": 1499995056}, "language": "english", "review": "En primer lugar teniendo en cuenta que no lo he probado y\ndesconocía la existencia de este juego u otra versión un poco\nmás antigua,me he enterado que circulaban copias y habia\nnetworks desde donde podías descargarte una copia de este\njuego.Es decir es un juego gratuito también llamado freeware.\nPero con los inconvenientes que eso supone,por ejemplo no\ntener una plataforma que le otrogue un soporte,como en este\ncaso Steam,vamos que tal vez pudiera ser un autentico infierno\nconfigurar y sincronizar un controlador,en este caso un mando\ny mucho menos la presencia de logros.\n\nSólo saber que se trata de un juego creado por españoles me ha\nanimado para coger una copia,ademas tengo de aliciente de\nfamiliares de esa región en concreto,conservando gratos recuerdos,\nseguidamente he echado un vistazo a las imagenes y previsualizado\nel trailer para darme cuenta que se da un aire a los Ghost's,en\nprincipio fue un juego de recreativas llamado Ghosts and Ghouls y\npoco después salió el Ghost and Goblins para platafromas de\nentretenimiento a finales de los 80's y principios de los 90's.\n\nA nivel personal veo que merece la pena,es más no he tocado en mi\nvida esos títulos lo que atrae todavía mas si cabe,es cierto que tiene\nfama de ser complicado,pero se que no llegará a la frustación ni tan\nsiquiera a la extenuación,por lo visto tiene creditos infinitos lo que\nfacilita un poco a priori...esto ha sido todo,ni tan siquiera probarlo,\npronto haré una revision y explicare un poco a grosso modo las\nprimeras impresiones...esta a 10% de descuento al haberlo lanzado\nhace unos dias asi que si teneis líquido que os sobre invertirlo en\neste juego,una forma de apoyar a este grupo de desarrolladores,\ngracias por leer b_h89\n\nAqui van mis primeras en impresiones,pocos juegos de este género\nveras en Steam,es único,me temía que iba ser dificil y realmente lo\nes,pasarselo con un crédito es una locura pero no quiere decir que\nsea un logro imposible,yo desde luego no crei que lo consiga.\n\nEl juego original es realmente retro de los primeros en 8 bits y hay\nque considerar que se lo curraron allá a finales de la década de los\n80,esta versión cuenta con muchos tipos de pantalla,la que viene\npor defecto tiene scanlines,lo que rejuvenece un poco su esencia,\nquería probarlo desde que salio.\n\nEl juego esta dividido por capitulos a los que hace referencia cada\nnivel o fase,segmentada en tres escenarios con un subjefe y jefe\nfinal de nivel,algunos bastante fáciles en comparación con los que\naparecen en la segunda parte del juego.\n\nes una crítica a la región de Castilla la Mancha en la época medieval\ndonde aparecen guiños de la gran obra de Cervantes,El Quitote de\necho los han convertido en boss,el cual es complicado,muchas partes\nlo son,muchas de ella que conectan otras que son verdadero dolor de\nmuelas,extremadamente hardcore,madre mia\n\nSe puede activar el Speedrun,en el menu principal,habra una opción de\nsecretos,donde estará el bestiario y los objetos que dan puntuación y\nvidas extras...\n\nHoy en día no existen muchos juegos de este estilo,lo considero como\nuna rareza asi que en ese caso si lo recomendaría,si ya has jugado a la\notra versión lo veo un poco absurdo,pero eh siempre hay cosas nuevas\nque hacer y tiene mas de 10 logros.", "timestamp_created": 1477348387, "timestamp_updated": 1477348387, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.514178", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26197132": {"recommendationid": "26197132", "author": {"steamid": "76561197986541149", "num_games_owned": 501, "num_reviews": 5, "playtime_forever": 674, "playtime_last_two_weeks": 0, "last_played": 1511616387}, "language": "spanish", "review": "Un juego de corte clasico de la era de los 8 bits, recuerda poderosamente a Ghots and Goblins, pero tiene su propia personalidad. Entretenido, buena jugabilidad, grandes graficos, musica y ambientacion, y dificil, aunque no demasiado (no soltaba tantos tacos delante del ordenador desde hacia muuuuuucho tiempo). Por suerte, el juego guarda nuestros avances y nos suministra un numero infinito de creditos... si vendemos nuestra alma, claro.\n\nUn 8 sobre 10, y una compra recomendada (y no solo por orgullo patrio, ea!)", "timestamp_created": 1477310769, "timestamp_updated": 1477310769, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.544791", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26195439": {"recommendationid": "26195439", "author": {"steamid": "76561197999701087", "num_games_owned": 581, "num_reviews": 16, "playtime_forever": 229, "playtime_last_two_weeks": 0, "last_played": 1481472328}, "language": "spanish", "review": "Para mi, personalmente, Maldita Castilla EX es uno de mis juegos favoritos de los últimos años. Está diseñado con extraordinario mimo y se respira la esencia arcade en cada uno de sus niveles. El control es perfecto, los sprites preciosos y la banda sonora me parece sublime. Ya disfruté de la versión gratuita de este juego y estaba deseando probar Maldita Castilla EX. Los añadidos de esta versión son realmente interesantes, tenemos nuevos niveles, enemigos, dos armas nuevas (odio las bombas) y algunas rutinas de los enemigos han cambiado por lo que te llevarás varias sorpresas si disfrutaste de su anterior versión. Por favor, apoyen este juego y espero ver más juegos de Locomalito por aquí porque se lo merece.", "timestamp_created": 1477299099, "timestamp_updated": 1477299099, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.659797", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "26192581": {"recommendationid": "26192581", "author": {"steamid": "76561198100012617", "num_games_owned": 42, "num_reviews": 1, "playtime_forever": 469, "playtime_last_two_weeks": 0, "last_played": 1480205227}, "language": "english", "review": "Awesome game. Fan of ghosts and goblins? Buy this games!", "timestamp_created": 1477274448, "timestamp_updated": 1477274448, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.461027", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26187101": {"recommendationid": "26187101", "author": {"steamid": "76561197969721192", "num_games_owned": 262, "num_reviews": 19, "playtime_forever": 90, "playtime_last_two_weeks": 0, "last_played": 1482708550}, "language": "english", "review": "If you have a thing for classic 80's arcade games like Ghost N' Goblins, this is right up your alley.  A real love letter to the decade these games were common, the presentation makes the game feel like it would've been sitting in an arcade next to any other classic you remember.\n\nGreat controls and frustrating but not impossible gameplay make it a game you keep coming back to just to get past that next boss.  Highly recommended.", "timestamp_created": 1477246572, "timestamp_updated": 1477246572, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26185308": {"recommendationid": "26185308", "author": {"steamid": "76561198026208141", "num_games_owned": 169, "num_reviews": 2, "playtime_forever": 1759, "playtime_last_two_weeks": 0, "last_played": 1510275261}, "language": "spanish", "review": "Un juego enormemente divertido y sorprendente, que dejará un agradable regusto añejo a aquellos que pasaban las tardes jugando con el spectrum o el amstrad. Los graficos son bonitos y los movimientos suaves y fluidos. Los enemigos tienen un aspecto divertido y original al tiempo que nos las harán pasar canutas en algunos momentos, sin llegar la dificultad a ser un problema serio para no disfrutar de la aventura.\nLas referencias a criaturas y personajes legendarios de España lo harán aún mas interesante para aquellos a los que les interese la historia.\nAunque al igual que yo, no estés acostumbrado ya a los arcades de plataformas o no te llamen especialmente la atención, te encandilará, y si estos te gustan, no pienses un momento en hacerte con él.", "timestamp_created": 1477239992, "timestamp_updated": 1477239992, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.573446", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26182465": {"recommendationid": "26182465", "author": {"steamid": "76561198025346842", "num_games_owned": 387, "num_reviews": 40, "playtime_forever": 635, "playtime_last_two_weeks": 0, "last_played": 1493539499}, "language": "schinese", "review": "单纯看宣传视频就能知道这是一个类魔界村式的游戏，实际体验过后感觉比魔界村简单许多。故事大概是王国遭到恶魔的侵袭，国王派出了一支骑士小队前去剿灭恶魔的头目，很标准的剧情。游戏里国王虽然派出的是骑士小队，但是玩家使用的人物是固定的。与魔界村一样，是一位骑士大叔，但这个大叔比魔界村的大叔要抗打，而且不会爆衣...下面稍微介绍一下这游戏系统\n初始3条命，每条命3滴血，初始武器是投剑（类似魔界村的初始武器投枪），同屏最大发射数为2（其他武器会有变化）。\n游戏里除了得分道具外还有其他一些辅助道具，比如小精灵可以发射子弹攻击敌人，钥匙可以开门，水晶球可以看到隐藏物品，盾牌可以抵挡一次伤害以及飞鞋可以二段跳等等，需要注意的是辅助道具只能随身携带一种，取得新道具会替换掉旧道具，其中钥匙是关键道具一定要拿好，而且如果死亡的话道具会消失。\n武器方面除了初始投剑外，还有非常不好用的抛物线投雷和抛物线投斧，比投剑判定大的投钉锤，三方向投出的飞刀，以及中距离高射速的投镰。与辅助道具一样，死亡后武器会变回初始武器。\n与魔界村一样，游戏关卡里有很多隐藏要素和关键道具收集要素，要想打出真结局，需要收集大概5颗宝石（我只找到3个...看最后的那个魔法阵有5个孔，所以猜测应该是5颗）。而且看成就，似乎在某个关卡还有一个妖精女王会给主角什么东西（我没找到OTL）...\n难度上，像我上面说的，比魔界村简单许多，所以一般玩家打个bad end应该没什么困难。操作手感的话比魔界村好很多，这也是比魔界村简单的一个原因。\n这个游戏UI做的很像是一款街机游戏，然而我并没见过也没听过这款游戏的街机版，所以是否是街机移植不敢定论。总体体验下来感觉是个很有意思的游戏，值得玩一玩。价格上稍微有些小贵，但是因为我比较喜欢这类游戏所以我本人是可以接受的。打了两个档，第二个档打了大概2个小时左右的时间打出了bad end，耗费了8个币的样子，最后没能收集全宝石以至于魔法阵无法打开见不到真boss...\n最后总结一下，挺不错的一款横版动作闯关游戏，街机风格，难度中等偏上，系统很到位，手感也不差，喜欢这类游戏的，喜欢魔界村的朋友们可以尝试一下。我本人是玩的很开心的。", "timestamp_created": 1477229386, "timestamp_updated": 1477229386, "voted_up": true, "votes_up": 15, "votes_funny": 1, "weighted_vote_score": "0.686004", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26175402": {"recommendationid": "26175402", "author": {"steamid": "76561198155726313", "num_games_owned": 721, "num_reviews": 38, "playtime_forever": 230, "playtime_last_two_weeks": 0, "last_played": 1478920380}, "language": "english", "review": "Maldita Castilla is a fantastic freeware game from spanish indie developer locomalito, well known for his quality retro inspired games like Hydorah and l'Abbaye des Morts, all published for free, which if you're interested, can be found here at his website: https://www.locomalito.com/index.php. \n\nThis version of Maldita Castilla, now called Cursed Castilla, was released on next gen consoles and now ported over to steam. It includes a few new weapons and items, two new stages, the usual steam goodies (trading cards, achievements, backgrounds, etc.) and an overall presentation boost from the free version, which already was a highly polished game. In short, it's well worth the asking price for anyone who is a fan of these kinds of games, and if you're a fan of Ghost and Goblins, then you owe it to yourself to play this game. \n\nThe difficulty is hard but fair, the FM music by Gryzor87 is nothing short of fantastic. I could go on, but you can see for yourself with the free version and see if you like it or not. If you like retro games, indie developers with a lot of heart pouring their souls into their works, spanish mythology, and a fun time, I don't see how you would not like it. \n\nFOR GOD AND CASTILLE!  (My only gripe with this version of the game is that the preceding famous line is now changed to \"For God and Castilla\", which is more accurate I suppose, but doesn't roll off the tongue as well imo).", "timestamp_created": 1477194702, "timestamp_updated": 1477194781, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.617178", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26173568": {"recommendationid": "26173568", "author": {"steamid": "76561197977080684", "num_games_owned": 2072, "num_reviews": 66, "playtime_forever": 11, "playtime_last_two_weeks": 0, "last_played": 1477183470}, "language": "english", "review": "This is like old school goodness! It plays like those arcade games that you couldn't get enough quarters for. It's devilishly hard but in such a good way that's fair and rewarding when you progress. There's a lot of different weapons and items and the art is fantastic. Totally worth the purchase!\n\n", "timestamp_created": 1477183715, "timestamp_updated": 1477183715, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.474138", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26160158": {"recommendationid": "26160158", "author": {"steamid": "76561197970665890", "num_games_owned": 983, "num_reviews": 22, "playtime_forever": 241, "playtime_last_two_weeks": 0, "last_played": 1480013937}, "language": "english", "review": "If you liked the old Ghouls 'n' Ghosts games then this is a must play. Excellent gameplay mechanics, plus great pixel art and sound make it play just like an arcade game from the mid to late eighties. Play this, then check out the rest of the work by Locomalito.", "timestamp_created": 1477129309, "timestamp_updated": 1480013967, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.594341", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26156181": {"recommendationid": "26156181", "author": {"steamid": "76561198102907529", "num_games_owned": 312, "num_reviews": 3, "playtime_forever": 64, "playtime_last_two_weeks": 0, "last_played": 1511514243}, "language": "english", "review": "SUMMARY: \"Cursed Castilla\" is a superb and remarkably authentic retro scrolling action game inspired by classic arcade games like \"Ghosts n'Goblins.\" If you enjoy that sort of game, then this is an absolute BUY.\n\nIf you've never heard of Locomalito, then please google him right now. He's a Spanish indie dev who has been releasing incredibly fun games for years, absolutely FREE. All of his games ooze authenticity, and look, sound and play like games from the heyday of the 80's and 90's arcade era.  In fact, you owe it to yourself to go to his site and download a bunch of games -- Hydorah is especially great IMO if you enjoy Gradius style SHMUPs.\n\n\"Cursed Castilla\" AKA \"Maldita Castilla EX\" is basically a reimagining of Capcom's \"Ghosts n\"Goblins,\" albeit with its own flavor and twists. I wouldn't call it a clone per se, but clearly Locomalito played a lot of Capcom arcade games, and IMO this game is even better than its inspiration. This is Locomalito's first commercial game, and as a longtime fan of his games it makes me happy to see this enhanced version of one of his best games on STEAM.\n\nP.S. I am a paid customer and bought this game with my own money. It's worth it.", "timestamp_created": 1477106698, "timestamp_updated": 1477106698, "voted_up": true, "votes_up": 62, "votes_funny": 0, "weighted_vote_score": "0.838393", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26148765": {"recommendationid": "26148765", "author": {"steamid": "76561198026789044", "num_games_owned": 209, "num_reviews": 113, "playtime_forever": 249, "playtime_last_two_weeks": 0, "last_played": 1488283367}, "language": "russian", "review": "Того и гляди - Скрудж Макдак на тросточке откуда-нибудь выпрыгнет :)", "timestamp_created": 1477070604, "timestamp_updated": 1477070604, "voted_up": true, "votes_up": 8, "votes_funny": 6, "weighted_vote_score": "0.332988", "comment_count": "5", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26145942": {"recommendationid": "26145942", "author": {"steamid": "76561198137096686", "num_games_owned": 33, "num_reviews": 7, "playtime_forever": 358, "playtime_last_two_weeks": 30, "last_played": 1513703928}, "language": "english", "review": "Here in Kaleidogames we love arcade games. This is one of them.\nGet it now!", "timestamp_created": 1477059739, "timestamp_updated": 1477059739, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.381168", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26137194": {"recommendationid": "26137194", "author": {"steamid": "76561198011949473", "num_games_owned": 391, "num_reviews": 2, "playtime_forever": 449, "playtime_last_two_weeks": 0, "last_played": 1479080648}, "language": "english", "review": "An updated Locomalito game released on Steam? Yes, i'll gladly give you my monies. Locomalito has been making great little indie games for about 8+ years, all of them usually paying homage to 80s classic most of us grew up with. In the case of Cursed Castilla, we get a nice sort of take on Ghost and Goblins with influences from medieval Spanish and European mythologies. The pixel art is great as well as the FM infused music by Gryzor87. This new EX version adds 2 more levels for a total of 8 levels but also some new weapons, monsters and music. On top of all that, the controls are tight and responsive. So if you're looking to scatch that 16 bit arcadey itch, well here you go. I hope this won't be the last Locomalito game we see make its way to Steam.", "timestamp_created": 1477006566, "timestamp_updated": 1477006566, "voted_up": true, "votes_up": 22, "votes_funny": 0, "weighted_vote_score": "0.685406", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26136936": {"recommendationid": "26136936", "author": {"steamid": "76561197993421846", "num_games_owned": 304, "num_reviews": 13, "playtime_forever": 204, "playtime_last_two_weeks": 0, "last_played": 1476998576}, "language": "swedish", "review": "I played the old version when it first came out and loved it. This game's design is meticulous and layered. Maybe you'll struggle to get the first ending of the game, but infinite continues and fair checkpoints means you'll get there. And then, if you restart and try to get the next ending, you'll find your skills have organically improved and things that you previously struggled with are now a breeze, but now the game puts new challenges in front of you that you may not even have realized were there...\n\nThe gameplay is simple, but satisfying. The action has a great flow, and platforms and enemy placement is such that you can always be moving. There's very little dead air.\n\nThe only real complaint I have about the new version is that one of the new bosses ends up being a bit repetitive due to its high health.\n\n", "timestamp_created": 1477004991, "timestamp_updated": 1477004991, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26135807": {"recommendationid": "26135807", "author": {"steamid": "76561197994868319", "num_games_owned": 228, "num_reviews": 52, "playtime_forever": 190, "playtime_last_two_weeks": 0, "last_played": 1476995751}, "language": "english", "review": "Game is presented very well even offering different camera set ups if you prefer classic 4:3, with or without border, with or without scan lines, and can even stretch full-screen again with or without scan lines. The options continue well from here offering a codex on the monster, weapons, power ups, and even songs which adds well to the game and sometimes a forgotten touch in a game where learning patterns and behaviours is so important.\n\nThe game is a platform shooter, yes you are a knight but all weapons shoot projectiles.\nThe weapon selection in the game offers nice variety and by waiting by power ups you can pick which power up you have. Showing nice touch here as if you are speed running or competing  on points you can way up the use of the weapon you want versus the loss in time/points.\n\nThe decision made in this game is to give the player for little control after jumping and in my mind adds some artificial difficulty in parts and finds my blaming the game for deaths which can lead to a spiral of hating a games difficulty rather then enjoying it.\n\nEnemy variety offered gives a great selection and leaves new challenges in each area, this is followed in to the boss selection, but again I will not speed run this game and I didn't take the game to serious instead using mass of continues. If you did want a serious run game then this is NOT for you too much RNG and too many times it leads to undodgable attacks, with one boss coming down to me just spamming attack as fast as possible and just retrying until his pattern worked for me.\n\nGraphics are great for the style the game wanted and worked well with the sprites and backgrounds, the character is not over animated so starts quick and responsive,\n\n(video to come)", "timestamp_created": 1476998399, "timestamp_updated": 1476998399, "voted_up": true, "votes_up": 17, "votes_funny": 1, "weighted_vote_score": "0.582090", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26135296": {"recommendationid": "26135296", "author": {"steamid": "76561198019046187", "num_games_owned": 340, "num_reviews": 11, "playtime_forever": 678, "playtime_last_two_weeks": 0, "last_played": 1483933092}, "language": "spanish", "review": "Maldita castilla es un juego de apariencia simple, un plataformero de la época dorada de los árcades, pero a diferencia de otros juegos que solo apelan a nuestra nostalgia, Maldita Castilla brilla por si solo, es un juego redondo, difícil de encontrarle contras. Gráficamente es colorido, con un estilo pixelart muy cuidado. La banda sonora es digna de tenerla en un CD y escucharla por separado, un control robusto y una excelente jugabilidad que lo vuelven un clásico moderno. Se nota que es un juego creado con amor y cuidado, una joya que el único contra que le puedo encontrar, es que no existiera hace 20 años atrás.\n\nEDIT: (Para la gente que no conoce el juego, he decididod expandir un poco más la información)\nMaldita Castilla es un juego de plataforma 2D, de sidescroll. con un estilo de 16 bit o sea, similar a los juegos de super nintendo y no me refiero solo a la parte estética, si no, a la forma de jugar.\n\nSu control es una cruceta de 4 dirección y 2 botones, uno para saltar y otro para disparar, no hay inventario, ni experiencia ni componentes RPG. Es básicamente un juego de habilidad y memoria, mientras más lo juguemos, más dominaremos el juego. Terminarse por primera vez el juego, sin problema te tomará unas 4 horas y abusar de la opción de continuar, ya que moriremos un montón de veces. Pero acabarse el juego una vez no significa el final del mismo, ya que Maldita castilla es de esos juegos con multiples finales y un montón de secretos ocultos que multiplican las horas de juego considerablemente y no solo haciendo que rejugemos los mismos niveles, ya que el último nivel (y el que necesitamos pasar para obtener el final bueno) está oculto y necesitamos encontrar las lagrimas de Maura para poder desbloquearlo.\n\n\nPara ir terminando, Maldita Castilla es un juego gratuito, creado solo por amor al arte hace unos 4 años por Locomalito, el juego original sigue siendo gratuito y puede ser descargado de la página de su auto (buscar en google por Maldita Castilla ). Lo que tenemos en Steam es una versión extendida con más niveles, enemigos y jefes. Si alguien tiene duda sobre si le gustará el juego o no, puede buscar la versión original, descargarla gratis y probarlo y si le gusta lo que ve y quiere tener la versión extendida o simplemente darle gracias al autor por haber compartido su trabajo de forma gratuita, entonces pueden venir y comprar el juego.\n\nEdit: Nominado a \"I Thought This Game Was Cool Before It Won An Award\"", "timestamp_created": 1476995850, "timestamp_updated": 1479936464, "voted_up": true, "votes_up": 68, "votes_funny": 0, "weighted_vote_score": "0.821771", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26134812": {"recommendationid": "26134812", "author": {"steamid": "76561197973085265", "num_games_owned": 419, "num_reviews": 260, "playtime_forever": 312, "playtime_last_two_weeks": 0, "last_played": 1478578633}, "language": "english", "review": "great game worth the price...", "timestamp_created": 1476993580, "timestamp_updated": 1476993580, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.407691", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26134265": {"recommendationid": "26134265", "author": {"steamid": "76561198037361558", "num_games_owned": 244, "num_reviews": 1, "playtime_forever": 65, "playtime_last_two_weeks": 0, "last_played": 1479503957}, "language": "english", "review": "It plays like an old arcade , sounds like one, has the looks of one and most importantly is as fun as one. Higlhy recommended along with other  Locomalito's games! \nhttps://www.locomalito.com", "timestamp_created": 1476991369, "timestamp_updated": 1476991369, "voted_up": true, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.528540", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39383943": {"recommendationid": "39383943", "author": {"steamid": "76561198042792516", "num_games_owned": 251, "num_reviews": 3, "playtime_forever": 3810, "playtime_last_two_weeks": 137, "last_played": 1515931508}, "language": "english", "review": "By far one of my favorite titles.  I've been speedrunning this game on and off the past year and I have to say that this game has great atmosphere, challenge, and nostalgia factor to keep you drawn in for as long as your nerves will let you.  \n\n", "timestamp_created": 1516087016, "timestamp_updated": 1516087016, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39365399": {"recommendationid": "39365399", "author": {"steamid": "76561198279858646", "num_games_owned": 178, "num_reviews": 7, "playtime_forever": 36, "playtime_last_two_weeks": 36, "last_played": 1516025208}, "language": "spanish", "review": "Gran juego", "timestamp_created": 1516025284, "timestamp_updated": 1516025284, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39361947": {"recommendationid": "39361947", "author": {"steamid": "76561198006666440", "num_games_owned": 365, "num_reviews": 21, "playtime_forever": 403, "playtime_last_two_weeks": 403, "last_played": 1515529158}, "language": "english", "review": "My take on this excellent yet sometimes frustrating game:\n\nhttps://youtu.be/ObEKXezkuY8", "timestamp_created": 1516014198, "timestamp_updated": 1516014198, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39356691": {"recommendationid": "39356691", "author": {"steamid": "76561198108902649", "num_games_owned": 366, "num_reviews": 14, "playtime_forever": 37, "playtime_last_two_weeks": 37, "last_played": 1515979977}, "language": "english", "review": "It was nostalgic for me, and done very well, but hard. Really hard. So it's not for me, but I recommend it to fans of the genre.", "timestamp_created": 1515991691, "timestamp_updated": 1515991691, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39352796": {"recommendationid": "39352796", "author": {"steamid": "76561198117056824", "num_games_owned": 140, "num_reviews": 20, "playtime_forever": 49, "playtime_last_two_weeks": 49, "last_played": 1515975334}, "language": "english", "review": "i got it for free through humble bundle and ONLY played it because nobody i new would take it for free..... its a ghouls and ghosts/ghosts and goblins ripoff\nIT IS NOT NEARLY AS HARD... it is waaaayyyy more forgiving but its still boring and kinda a piece of shit ..\nwould i buy it ? NO\nwould i play it again? NO\nis it worth 10 dollars ? NO\nam i happy with it even though it was free? NO\n", "timestamp_created": 1515975664, "timestamp_updated": 1515975664, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.326214", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39344699": {"recommendationid": "39344699", "author": {"steamid": "76561197989888607", "num_games_owned": 937, "num_reviews": 5, "playtime_forever": 279, "playtime_last_two_weeks": 279, "last_played": 1516191664}, "language": "english", "review": "Great game, but some requirements to get the good ++ ending are demential.", "timestamp_created": 1515952470, "timestamp_updated": 1515952470, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39333623": {"recommendationid": "39333623", "author": {"steamid": "76561198423035617", "num_games_owned": 109, "num_reviews": 11, "playtime_forever": 270, "playtime_last_two_weeks": 270, "last_played": 1515922777}, "language": "schinese", "review": "略艰难的打了个坏结局\n果然和魔界村一样变态\n还有goodend设定\n集气5个菱形蓝宝石开启真结局？\n我可不会再打一遍了\n\n游戏有些贵了", "timestamp_created": 1515923191, "timestamp_updated": 1515923191, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39327966": {"recommendationid": "39327966", "author": {"steamid": "76561198014866888", "num_games_owned": 854, "num_reviews": 175, "playtime_forever": 256, "playtime_last_two_weeks": 256, "last_played": 1515901975}, "language": "turkish", "review": "Baya zor ama çok eğlenceli. True ending'i açmaya götüm yemedi cidden zor.", "timestamp_created": 1515902692, "timestamp_updated": 1515902692, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39309339": {"recommendationid": "39309339", "author": {"steamid": "76561198142511641", "num_games_owned": 315, "num_reviews": 14, "playtime_forever": 8, "playtime_last_two_weeks": 8, "last_played": 1515851269}, "language": "koreana", "review": "30년전 그래픽으로 마계촌을 오마주 한것은 크게 인정하나...\n\n어찌 조작감까지 30년전 그대로인가...", "timestamp_created": 1515851415, "timestamp_updated": 1515851415, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39294075": {"recommendationid": "39294075", "author": {"steamid": "76561198141484065", "num_games_owned": 148, "num_reviews": 18, "playtime_forever": 129, "playtime_last_two_weeks": 129, "last_played": 1515697734}, "language": "spanish", "review": "Plataformas con estilo clásico en el que morirás una y otra vez hasta hacer al milímetro cada nivel pero... Te encatará tener que hacerlo por su estilo visual que suscita nostalgia, por lo desafiante que es y porque quieres salvar Castilla de todos los monstruos y deprabadas criaturas que la pueblan.\n\n", "timestamp_created": 1515800940, "timestamp_updated": 1515800940, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39292862": {"recommendationid": "39292862", "author": {"steamid": "76561198007695129", "num_games_owned": 1938, "num_reviews": 8, "playtime_forever": 16, "playtime_last_two_weeks": 16, "last_played": 1515823911}, "language": "english", "review": "If you like everything that is ghosts and goblins, gouls and ghosts.....this is for you....i sunk so many 10p coins into ghosts and goblins an now this has to be the most faithul remake / call it what ou will, it updated, its now...its fekin good...go play!", "timestamp_created": 1515796810, "timestamp_updated": 1515796810, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39291224": {"recommendationid": "39291224", "author": {"steamid": "76561198098263579", "num_games_owned": 361, "num_reviews": 2, "playtime_forever": 62, "playtime_last_two_weeks": 62, "last_played": 1515791281}, "language": "spanish", "review": "Pierde mucho por no tener multiplayer, leñe", "timestamp_created": 1515791892, "timestamp_updated": 1515791892, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39286379": {"recommendationid": "39286379", "author": {"steamid": "76561198165059287", "num_games_owned": 39, "num_reviews": 3, "playtime_forever": 171, "playtime_last_two_weeks": 171, "last_played": 1515865240}, "language": "spanish", "review": "Este juego es exigente, muy exigente tan exigente que me han dado ganas de comerme bebes de 2 en 2 pero bueno, es un juego de mi tierra y lo recomiendo por su dificultuad.", "timestamp_created": 1515778850, "timestamp_updated": 1515778850, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39281957": {"recommendationid": "39281957", "author": {"steamid": "76561198287643277", "num_games_owned": 186, "num_reviews": 4, "playtime_forever": 70, "playtime_last_two_weeks": 70, "last_played": 1515767230}, "language": "koreana", "review": "스테이지 4까지 진행해봄.\n\n마계촌 리마스터 정도로 보면 딱 좋을 게임. 자기만의 개성이 없어 보여 그건 좀 아쉬움.\n조작감은 원더보이 몬스터랜드 신발 안 산 거랑 상당히 흡사한데,\n이 조작감으로 움직이는 거북이를 타고 움직이는 장애물을 피하자니 답답해서 꺼버림.", "timestamp_created": 1515767402, "timestamp_updated": 1515767458, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39265540": {"recommendationid": "39265540", "author": {"steamid": "76561198019136473", "num_games_owned": 386, "num_reviews": 12, "playtime_forever": 11, "playtime_last_two_weeks": 11, "last_played": 1515704491}, "language": "english", "review": "Nice game, great call backs to old games while still feeling its own, but no Audio setting? Can't mute sound and play in the background while watching my shows? Bah!", "timestamp_created": 1515704712, "timestamp_updated": 1515704712, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39253054": {"recommendationid": "39253054", "author": {"steamid": "76561198428433199", "num_games_owned": 43, "num_reviews": 4, "playtime_forever": 10, "playtime_last_two_weeks": 10, "last_played": 1515668614}, "language": "english", "review": "very simple but addicting game. joke. if you like retro platform games this is for you otherwise uninstall.", "timestamp_created": 1515668671, "timestamp_updated": 1515668671, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.391312", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39252619": {"recommendationid": "39252619", "author": {"steamid": "76561198012312412", "num_games_owned": 396, "num_reviews": 18, "playtime_forever": 14, "playtime_last_two_weeks": 14, "last_played": 1515666741}, "language": "english", "review": "More than a GHOST of the past,\nCursed Castilla will grab you by the GHOUL (ies)\n\n*I wish i was funny,but i'm not*", "timestamp_created": 1515666957, "timestamp_updated": 1515666957, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39243868": {"recommendationid": "39243868", "author": {"steamid": "76561198027863945", "num_games_owned": 677, "num_reviews": 59, "playtime_forever": 15, "playtime_last_two_weeks": 15, "last_played": 1515628979}, "language": "english", "review": "good game, only bad side is you get to the vulture level and then you die you gotta start over !", "timestamp_created": 1515629038, "timestamp_updated": 1515629038, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39240836": {"recommendationid": "39240836", "author": {"steamid": "76561198012693496", "num_games_owned": 217, "num_reviews": 53, "playtime_forever": 19, "playtime_last_two_weeks": 19, "last_played": 1515618143}, "language": "english", "review": "Too hardcore.. boring.. nothing special.. not worth the price..", "timestamp_created": 1515618235, "timestamp_updated": 1515618235, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.364167", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39238148": {"recommendationid": "39238148", "author": {"steamid": "76561198296307355", "num_games_owned": 79, "num_reviews": 2, "playtime_forever": 31, "playtime_last_two_weeks": 31, "last_played": 1515488529}, "language": "english", "review": "Very nice game,", "timestamp_created": 1515610451, "timestamp_updated": 1515610451, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "39196023": {"recommendationid": "39196023", "author": {"steamid": "76561197984050178", "num_games_owned": 996, "num_reviews": 37, "playtime_forever": 141, "playtime_last_two_weeks": 141, "last_played": 1515892478}, "language": "english", "review": "Like Ghosts n' Goblins, but without the masochist difficulty.", "timestamp_created": 1515460289, "timestamp_updated": 1515460289, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39192583": {"recommendationid": "39192583", "author": {"steamid": "76561197963392228", "num_games_owned": 772, "num_reviews": 8, "playtime_forever": 71, "playtime_last_two_weeks": 71, "last_played": 1515631830}, "language": "english", "review": "This game is more or less what it looks like: a homage/clone of Ghost 'N Goblins (or Ghouls 'N Ghosts, depending on your childhood platform).  How much you like it comes down to how much you liked the originals, as it's not everyone's cup of tea.  It's fairly difficult, though not unreasonably so, and has a few more level design twist than the source material - vertical levels, levels on a moving platform, etc.  Also nice is that you can change the retro style, so whether scanlines are a must have or strictly verboten, this game has you covered in the 10 variations of retro style.  The controls felt slightly mushy, though more of an occasional annoyance than deal breaker, and I think that might be more my aging 360 controller than the game itself (reading through other reviews, it seems other people thought the controls were very crisp).  I would put it more as a fun diversion to play for a bit rather than a deep game you keep coming back to, but again, if retro platformers are your jam, you might dive into a bit more than the average gamer.\n\nTL;DR: If you liked Ghost N Goblins, you'll like this.  If not, you'll enjoy it for a bit and then be satisfied to put it back on the shelf.\n\nEDIT: After playing a bit more, I like the game a bit less.  A lot of the weapons are pretty worthless, almost making it harder, and you often get stuck places where you don't receive any (ie, you start without anything each retry of a boss fight).  The game gets significantly more difficult around level 3, and the controls just aren't tight enough to handle it.  On top of that, it has a number of 'old school' platforming conventions that have been largely abandoned (for good reason), such as not being able to recover from being hit until you hit the ground (ie, if you're on one of the vertical levels, you're going to fall a looooong way before you can do anything).  You also can't shoot at diagonals or while climbing, even though the game makes you go up ramps and ropes while being swarmed by enemies.  If you love ghouls 'n ghost, give it a spin, but games like Cuphead and Shovel Knight really eclipse it in both gameplay and depth.", "timestamp_created": 1515448314, "timestamp_updated": 1515632170, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39179660": {"recommendationid": "39179660", "author": {"steamid": "76561198069854145", "num_games_owned": 878, "num_reviews": 14, "playtime_forever": 140, "playtime_last_two_weeks": 140, "last_played": 1515418222}, "language": "english", "review": "This game is notoriously hard, but not the good kind of hard. The controls are poor, jump are unreliable, flying enemies will appear to make you miss this platform... this is a game made by someone who remembers these classic games without understanding what made them great. I'll play something else for the same reason we stopped playing these games: there are just more fun ones now.", "timestamp_created": 1515413177, "timestamp_updated": 1515413177, "voted_up": false, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.476906", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39172206": {"recommendationid": "39172206", "author": {"steamid": "76561197964345647", "num_games_owned": 853, "num_reviews": 210, "playtime_forever": 183, "playtime_last_two_weeks": 183, "last_played": 1515389708}, "language": "english", "review": "Pixel Art: 3.5/5 (Perfectly retro)\nImmersion: 3.5/5 (Love/Hate desire to play on) \nGameplay: 3.5/5 (Classic platform, with twists)\nControls: 4/5 (Must get used to jump)  \nValue: 3.5/5 \nDifficulty: 4/5 (Tough as nails ;) but infinite continues :P \n--------------\nOverall 3.6 (Difficulty always excluded)\n\n[url=http://store.steampowered.com/curator/31208751/]Please follow my Pixel Art Curation to discover other great games...[/url]\n\n\nA pixelated platformer throw back to the hard old days of Ghost 'n Goblins, but with more tight & smooth controls!\n\nYou will hate yourself for playing this game, unless you really enjoy the challenge of playing the hardest of platformers.\n\nThat being said, I completely recommend this game for the HARDCORE or simply curious ;)\n\nGreat classic pixel art with more color and depth than its inspiration, deeper story, great level design and challenging bosses!\n\n\nACHIEVEMENTS: Ouch!  For 100% you have to...No continue...multiple endings...speedrun...etc.  GOOD LUCK! ;)\n\n", "timestamp_created": 1515384940, "timestamp_updated": 1515384940, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.560914", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39171428": {"recommendationid": "39171428", "author": {"steamid": "76561198048072422", "num_games_owned": 135, "num_reviews": 5, "playtime_forever": 14, "playtime_last_two_weeks": 14, "last_played": 1515381908}, "language": "spanish", "review": "Muy Buen juego tipico de la nes", "timestamp_created": 1515381955, "timestamp_updated": 1515381955, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39169994": {"recommendationid": "39169994", "author": {"steamid": "76561198040167944", "num_games_owned": 589, "num_reviews": 2, "playtime_forever": 5, "playtime_last_two_weeks": 5, "last_played": 1515376204}, "language": "english", "review": "Do you want a Ghouls and Ghosts clone? Cause this is how you get a Ghouls and Ghosts clone! \nGreat way to re-live the glory days of the 80's arcade. Nice difficulty, and graphics to match. Controlls seem just a tad on the slow side, but not so much as to damper playability. 8/10", "timestamp_created": 1515376541, "timestamp_updated": 1515376541, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39169123": {"recommendationid": "39169123", "author": {"steamid": "76561198006964890", "num_games_owned": 538, "num_reviews": 49, "playtime_forever": 183, "playtime_last_two_weeks": 183, "last_played": 1515377630}, "language": "english", "review": "Game is cool. Good boss fights, fairly short. Comes also with all the bullshit from the 90s. The forest level is infuriating with the paths and the fucking spikes that are a one hit kill. Also you need to collect 5 tears to access the true ending and at least one tear is super hidden and it´s pure luck to find it what the fuck. Still, I recommend the game in a deep sale!", "timestamp_created": 1515373430, "timestamp_updated": 1515373430, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.521210", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39152458": {"recommendationid": "39152458", "author": {"steamid": "76561198110795951", "num_games_owned": 377, "num_reviews": 6, "playtime_forever": 205, "playtime_last_two_weeks": 205, "last_played": 1515955293}, "language": "russian", "review": "10/10 горящих жоп из 90-х прямо с денди", "timestamp_created": 1515333344, "timestamp_updated": 1515333344, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39147757": {"recommendationid": "39147757", "author": {"steamid": "76561197970615671", "num_games_owned": 592, "num_reviews": 57, "playtime_forever": 5, "playtime_last_two_weeks": 5, "last_played": 1515322278}, "language": "english", "review": "Starts out as a slightly easier Ghosts 'n' Goblins clone, but then branches away from that and gets tougher and more interesting.  Not bad.", "timestamp_created": 1515322383, "timestamp_updated": 1515322383, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.483221", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39144737": {"recommendationid": "39144737", "author": {"steamid": "76561198044706472", "num_games_owned": 760, "num_reviews": 9, "playtime_forever": 8, "playtime_last_two_weeks": 8, "last_played": 1515313515}, "language": "english", "review": "An unapologetic love-piece dedicated to Ghosts'n'Goblins. Stylised music and sounds that put you back in that era at the fish and chip shop, spending the change whilst you waited for the family chips, a pineapple fritter and two pieces of butter fish. Complete with added rogue-lite elements and a coin-op screen filter, it was better than a Chiko roll then, and it still is now.", "timestamp_created": 1515313827, "timestamp_updated": 1515313827, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39144724": {"recommendationid": "39144724", "author": {"steamid": "76561198012833532", "num_games_owned": 430, "num_reviews": 293, "playtime_forever": 142, "playtime_last_two_weeks": 142, "last_played": 1515263885}, "language": "english", "review": "If you want to make an old-timey PC game, make one that can be controlled without gamepad. The controls are abomination.", "timestamp_created": 1515313785, "timestamp_updated": 1515313785, "voted_up": false, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.333385", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39138561": {"recommendationid": "39138561", "author": {"steamid": "76561197961448101", "num_games_owned": 322, "num_reviews": 30, "playtime_forever": 17, "playtime_last_two_weeks": 17, "last_played": 1515293510}, "language": "english", "review": "i say this as a good thing, its a ghost and goblins clone. if you like the old capcom games, youll love this game", "timestamp_created": 1515293578, "timestamp_updated": 1515293578, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39134084": {"recommendationid": "39134084", "author": {"steamid": "76561198109883351", "num_games_owned": 1542, "num_reviews": 151, "playtime_forever": 195, "playtime_last_two_weeks": 195, "last_played": 1515692539}, "language": "english", "review": "Superb retro styling to recapture the 80's magesty of Ghost n Goblins.. right down to the brutal toughness.. but with a slightly easier replay system than the original that was  created to eat your loose change.", "timestamp_created": 1515279966, "timestamp_updated": 1515279966, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39133107": {"recommendationid": "39133107", "author": {"steamid": "76561197972834969", "num_games_owned": 794, "num_reviews": 24, "playtime_forever": 29, "playtime_last_two_weeks": 29, "last_played": 1515277103}, "language": "english", "review": "Wow!  I was looking for a Super NES Classic so I can play Ghouls & Ghosts, but now I don't have to.  This game is amazing!  Thank you so much for making it!", "timestamp_created": 1515277294, "timestamp_updated": 1515277294, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39129482": {"recommendationid": "39129482", "author": {"steamid": "76561198004152178", "num_games_owned": 199, "num_reviews": 58, "playtime_forever": 190, "playtime_last_two_weeks": 190, "last_played": 1515539473}, "language": "brazilian", "review": "Um tributo bacana ao clássico Ghosts'n Goblins. Jogabilidade fluída, trilha sonora simples porém competente e bosses, muito bosses.\n\nPrepare-se para muitos rage quits. :D", "timestamp_created": 1515268897, "timestamp_updated": 1515268897, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39123171": {"recommendationid": "39123171", "author": {"steamid": "76561198359982952", "num_games_owned": 40, "num_reviews": 6, "playtime_forever": 165, "playtime_last_two_weeks": 165, "last_played": 1516040486}, "language": "english", "review": "This game raped my anus. Why did I got myself 2D Dark souls in retro edition ?", "timestamp_created": 1515255992, "timestamp_updated": 1515255992, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.454545", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39122028": {"recommendationid": "39122028", "author": {"steamid": "76561198115634971", "num_games_owned": 144, "num_reviews": 55, "playtime_forever": 5, "playtime_last_two_weeks": 5, "last_played": 1515253663}, "language": "english", "review": "This game is shit.", "timestamp_created": 1515253755, "timestamp_updated": 1515253755, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.272288", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39120331": {"recommendationid": "39120331", "author": {"steamid": "76561198263191879", "num_games_owned": 43, "num_reviews": 3, "playtime_forever": 16, "playtime_last_two_weeks": 16, "last_played": 1515250289}, "language": "koreana", "review": "마계촌", "timestamp_created": 1515250343, "timestamp_updated": 1515250343, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39118148": {"recommendationid": "39118148", "author": {"steamid": "76561198343667553", "num_games_owned": 61, "num_reviews": 2, "playtime_forever": 142, "playtime_last_two_weeks": 142, "last_played": 1516223061}, "language": "english", "review": "The Doom game of 2D platformers, i love it.", "timestamp_created": 1515245831, "timestamp_updated": 1515245831, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.474453", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39118077": {"recommendationid": "39118077", "author": {"steamid": "76561198007279403", "num_games_owned": 895, "num_reviews": 110, "playtime_forever": 121, "playtime_last_two_weeks": 121, "last_played": 1515354248}, "language": "english", "review": "A pefect homage to Ghost n Goblins to the point it almost feels like a romhack of it, if you are skeptical about it you can always get the freeware version or buy the easy mode version on consoles\n\nLink to the freeware version: https://www.locomalito.com/maldita_castilla.php", "timestamp_created": 1515245675, "timestamp_updated": 1515245675, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.559050", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39115987": {"recommendationid": "39115987", "author": {"steamid": "76561198048842929", "num_games_owned": 1116, "num_reviews": 219, "playtime_forever": 214, "playtime_last_two_weeks": 214, "last_played": 1515252294}, "language": "german", "review": "Review verfasst am 6.01.2018\n\nCursed Castilla erinnert stark an das snes Game Super Ghouls 'n Ghosts welches in Europa 1992 rauskam. Begünstigt duch die Grafik und den tollen Sound/track kommt sofort ein Retrofeeling auf. Es gibt verschiedene Gegner und Bosse, die allesamt ein passendes Design haben. Positiv fällt auch die Steuerung auf, denn man kann das Game sehr gut mit einem xbox360 Controller zocken. Außerdem läuft das Spiel auch auf schwachen Systemen und es gibt auch Errungenschaften und Sammelkarten.\n\nWer Spaß an schweren Retrogames hat, kann sich das Game mal genauer angucken und ggf kaufen.", "timestamp_created": 1515240932, "timestamp_updated": 1515240932, "voted_up": true, "votes_up": 35, "votes_funny": 1, "weighted_vote_score": "0.769231", "comment_count": "5", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39107400": {"recommendationid": "39107400", "author": {"steamid": "76561198271193556", "num_games_owned": 96, "num_reviews": 4, "playtime_forever": 16, "playtime_last_two_weeks": 16, "last_played": 1515215975}, "language": "english", "review": "ITs like ghost and goblins meets splatterhouse (original) diffacult in the extreme.may not go ack to it without help", "timestamp_created": 1515216146, "timestamp_updated": 1515216146, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39106489": {"recommendationid": "39106489", "author": {"steamid": "76561198082601768", "num_games_owned": 1419, "num_reviews": 28, "playtime_forever": 10, "playtime_last_two_weeks": 10, "last_played": 1515212903}, "language": "english", "review": "An *incredible* loving homage to 80's arcade games, like Ghosts'n'Goblins, Castlevania, etc\nComplete with FM synth sound, 16-bit pixelish graphics and scanlines, but fortunately *without* the stroke-inducing difficulty.  No, the difficult is, at most, merely *tumor* inducing.\n\nThankfully, I live in a country with socialized medicine, and can therefore afford to request  a sequel.", "timestamp_created": 1515213128, "timestamp_updated": 1515213128, "voted_up": true, "votes_up": 8, "votes_funny": 6, "weighted_vote_score": "0.612618", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39103553": {"recommendationid": "39103553", "author": {"steamid": "76561198027511532", "num_games_owned": 606, "num_reviews": 44, "playtime_forever": 32, "playtime_last_two_weeks": 32, "last_played": 1515619889}, "language": "english", "review": "Great retro game. Sound design is straight Genesis.", "timestamp_created": 1515204274, "timestamp_updated": 1515204274, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39103330": {"recommendationid": "39103330", "author": {"steamid": "76561198035460923", "num_games_owned": 239, "num_reviews": 102, "playtime_forever": 263, "playtime_last_two_weeks": 263, "last_played": 1515274017}, "language": "portuguese", "review": "9/10 Um jogo muito bom para uem se lebra de SNES ou gosta de desafios", "timestamp_created": 1515203648, "timestamp_updated": 1515203648, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39102530": {"recommendationid": "39102530", "author": {"steamid": "76561198013513985", "num_games_owned": 357, "num_reviews": 33, "playtime_forever": 7, "playtime_last_two_weeks": 7, "last_played": 1515201363}, "language": "english", "review": "no xbox controller no approve by me.... otherwise it would be ok if you like the old ghost and goblin/gouls games of our youth.  I alwasy sucked at em as a kid but was gunna give it a go but I haven't had to use z and x since the first duke nukems and such.... tooo much nostalgia", "timestamp_created": 1515201305, "timestamp_updated": 1515201305, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.269928", "comment_count": "7", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39098322": {"recommendationid": "39098322", "author": {"steamid": "76561198127299152", "num_games_owned": 198, "num_reviews": 44, "playtime_forever": 43, "playtime_last_two_weeks": 43, "last_played": 1515552059}, "language": "brazilian", "review": "Game incrível!!!\n\nTrilha sonora: 10/10\nGráficos: 10/10\nJogabilidade: 10/10...[strike]não tem muito o que avaliar[/strike]...\n\nGame Total: 10/10\n", "timestamp_created": 1515189771, "timestamp_updated": 1515189771, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.584644", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39097681": {"recommendationid": "39097681", "author": {"steamid": "76561197992229015", "num_games_owned": 537, "num_reviews": 275, "playtime_forever": 8, "playtime_last_two_weeks": 8, "last_played": 1515188144}, "language": "english", "review": "No, unless you're really struggling for some SNES nostalgia...there are better 8 bit hack and jump adventures out there. Get a new weapon? Yay, can't switch back? The axes are terrible. Just one of many small things I didn't enjoy in my admittedly very short playtime. Soundtrack is nice though...\n\nEdit: Got this as part of Humble Bundle. Not my kind of game, don't be put off, if a 20 year old retro game is exactly what you're looking for. There are no modern features here.", "timestamp_created": 1515188256, "timestamp_updated": 1515204489, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.270615", "comment_count": "7", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39093738": {"recommendationid": "39093738", "author": {"steamid": "76561198134298335", "num_games_owned": 229, "num_reviews": 56, "playtime_forever": 109, "playtime_last_two_weeks": 109, "last_played": 1515781129}, "language": "polish", "review": "Dobra platformówka, polecam.", "timestamp_created": 1515179903, "timestamp_updated": 1515179903, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.433665", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39504723": {"recommendationid": "39504723", "author": {"steamid": "76561198041990871", "num_games_owned": 212, "num_reviews": 36, "playtime_forever": 17, "playtime_last_two_weeks": 17, "last_played": 1516524015}, "language": "english", "review": "I get the whole old school vibe of the game, it just isn't for me.", "timestamp_created": 1516524055, "timestamp_updated": 1516524055, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39493881": {"recommendationid": "39493881", "author": {"steamid": "76561198054895690", "num_games_owned": 187, "num_reviews": 5, "playtime_forever": 39, "playtime_last_two_weeks": 39, "last_played": 1516543929}, "language": "english", "review": "Delightfully retro. Loved the dated 8 bit graphics. It felt like I was playing a game in an arcade in the 80's. It reminds me a lot of Ghost'n'goblins for the NES (the main character animation hints at this). The ingame sfx sound a lot like the old sound chips. The gameplay is fluid, the animation too, and integrates with your xbox pad. Ideal to play on the Steam Link. Really psyched about this game, after playing it for about a couple of hours.\n\nThe difficulty ramps up very fast, which was quite common in arcade games from back then.\n\nIf you are into retro games, and want to play something new, definitely recommend this one. But be warned is a very difficult game that goes from casual to \"wtf\" real quick.", "timestamp_created": 1516482935, "timestamp_updated": 1516482935, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39487289": {"recommendationid": "39487289", "author": {"steamid": "76561198115840410", "num_games_owned": 491, "num_reviews": 44, "playtime_forever": 67, "playtime_last_two_weeks": 67, "last_played": 1516465330}, "language": "english", "review": "This game is not retro, it's garbage.", "timestamp_created": 1516465402, "timestamp_updated": 1516465402, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.506410", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39474872": {"recommendationid": "39474872", "author": {"steamid": "76561198026009073", "num_games_owned": 156, "num_reviews": 24, "playtime_forever": 301, "playtime_last_two_weeks": 301, "last_played": 1516425415}, "language": "english", "review": "You ever play Ghosts and Goblins? How about Castlevania? This is an extremely well made yet extremely difficult game. First try took around 60 continues to get through, something only 4.7% people have even done. Would recommend if you like the old difficult arcade style platformer, but be warned.", "timestamp_created": 1516425760, "timestamp_updated": 1516425828, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "39460824": {"recommendationid": "39460824", "author": {"steamid": "76561197982745514", "num_games_owned": 157, "num_reviews": 4, "playtime_forever": 83, "playtime_last_two_weeks": 83, "last_played": 1516519805}, "language": "english", "review": "Game is fine, fun even. I'd say get a controller, playing on a keyboard is a bitch. Only real complaint I have about the game is it's 2018 and somehow they're still making games where you have zero aerial drift after you jump. It's mindblowing to me how terrible it is as a design choice, and they've decided to go with it on purpose. \n\nThe only other thing that blows is the endless hitstun when you get hit. Happen to get hit and drift backwards right into a hole off the map? Oh well! You lost a whole life, not just a heart. Well done. \n\nIf you don't mind making well timed defensive jumps, only to still hit the enemy because there's next to no horizontal drift, enjoy.  Game is still fun, a lot like Castlevania. Just the whole \"no jump mobility\" thing is a bit of a turn off for me personally. I still recommend, but I think a gamepad helps a hell of a lot here.", "timestamp_created": 1516375779, "timestamp_updated": 1516375779, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "39455420": {"recommendationid": "39455420", "author": {"steamid": "76561198126709019", "num_games_owned": 1564, "num_reviews": 3, "playtime_forever": 476, "playtime_last_two_weeks": 476, "last_played": 1516330241}, "language": "koreana", "review": "*****스토일러가 될 내용을 포함하고 있을 수 있습니다.****\n\n\n\n'유사 마계촌'이라고 하면 이 게임에 대해 짐작하기 쉬울 겁니다.\n스토리 및 배경, 진행 방식과 전투, 진엔딩의 여부 등이 대체로 마계촌과 비슷합니다.\n\n왕의 특명을 받은 주인공과 동료들이 악의 근원을 물리치기 위해 모험을 떠난다는 것이 이 게임의 주된 스토리입니다. \n주인공은 마물들을 물리치면서 목적을 달성하기 위해 긴 여정을 떠나게 됩니다. (마계촌은 공주 구출, 이 게임은 악의 근원 퇴치)\n물론 플레이 가능한 케릭터는 주인공 뿐이지만, 게임 속에서 동료들이 등장하기도 합니다. (기대한 것과 다른 형태로...)\n\n진행은 횡 스크롤 방식입니다. (마계촌의 진행과 똑같습니다.)\n주인공은 각종 무기를 상하좌우 4 방향으로 투척하며 적들을 물리쳐 나아가야 합니다.\n이동과 점프를 통해 각종 지형을 헤쳐 나아가야 하는데, 그 와중에 적절히 배치된 적들이 그 앞을 가로막습니다.\n플레이어는 제한된 조작 체계 속에서 필연적으로 '맵 지형과 적 배치를 학습'하게 되고, 그로 인해 케릭터가 아닌 플레이어 자신이 성장하게 됩니다. (마계촌의 그것과 같습니다.)\n\n맵 곳곳에 숨겨진 요소들도 다양합니다. \n이같은 숨겨진 요소들은 크게 3가지를 예로 들 수 있는데,  '고득점 및 라이프업 아이템'과 '특수한 용도(?)의 아이템' 그리고 '도전 과제용 상호작용' 등입니다.\n이는 게임을 기본적으로 클리어 하는데 필수 요소는 아니지만, 게임 속 모든 컨텐츠를 즐기겠다 마음 먹으셨다면 신경 써야 할 것들이긴 합니다. (특히 굿엔딩을 보기 위해서라면...)\n따라서 1회차에서는 크게 신경 쓰지 않기를 권해드립니다. \n\n게임이 워낙 그러하므로 마계촌을 언급했지만, 마계촌 못지 않게 재미있는 게임이며 어떤 점에서는 마계촌보다 발전된 게임이기도 합니다. \n스토리는 마계촌 시리즈보다 더욱 극적이며 맵 디자인은 마계촌보다 덜 어렵습니다.\n또한 어떤 보스는 마계촌의 보스보다 패턴이 어렵습니다.\n마계촌 시리즈에 익숙한 사람이라면 즐거운 향수를 느끼실 것이며, 마계촌을 접해보시지 않은 분이라면 매콤한 도전 욕구에 이끌리실 수 있을 것입니다.\n\n마지막으로 엔딩은 배드엔딩과 굿엔딩이 나뉘어져 있습니다.\n게임이 이끄는대로 1회차를 무난히 진행하셨다면 자연히 배드엔딩을 보게 되실 겁니다.\n그리고 배드 엔딩을 통해 다시 자연히 굿엔딩의 조건을 감지하실 겁니다. (이는 기존 마계촌 시리즈에 없던 안배라고 생각합니다.)\n따라서 1회차 플레이 시에는 공략이나 도전과제를 미리 살펴보지 않고 플레이 하시길 추천드립니다. (굿엔딩에 이르는 조건은 크게 2가지인데, 재미를 위해 여기선 적지 않겠습니다.)\n\n특정 구간에서 난이도가 급상승한다는 점, 특정 구간에선 특정 무기 사용이 강제된다는 점, 키보드보다 패드 플레이가 더 쉽다는 점, 아직 한글화가 안 되어 있다는 점, 특정 보스가 스트레스를 유발 시킨다는 점 등을 감내한다면 미소를 지으며 이 게임을 플레이 하실 수 있다고 봅니다.\n\n충분히 재미있는 게임입니다. 이 게임이 만약 세일을 한다면 꼭 지르십시오!", "timestamp_created": 1516356387, "timestamp_updated": 1516429144, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39450906": {"recommendationid": "39450906", "author": {"steamid": "76561198096114971", "num_games_owned": 123, "num_reviews": 26, "playtime_forever": 8, "playtime_last_two_weeks": 8, "last_played": 1516333938}, "language": "english", "review": "Its a little tough on mouse and keyboard but overall this was a pretty fun game. I am working through my game library and trying out all the games to review and sort. This one is going in the Maybe try later pile.\n\nThanks dev for including this in a charity bundle!", "timestamp_created": 1516334239, "timestamp_updated": 1516334239, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39445941": {"recommendationid": "39445941", "author": {"steamid": "76561197978810099", "num_games_owned": 566, "num_reviews": 63, "playtime_forever": 16, "playtime_last_two_weeks": 16, "last_played": 1516301330}, "language": "english", "review": "Positive Reviews = Decent gamers with Skill. It's difficulty resembles a cross between Ghost n Ghouls vs Cuphead.\nNegative Reviews = Whiney noobs who can't take games with a little difficulty ^^", "timestamp_created": 1516311853, "timestamp_updated": 1516311853, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.465686", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39438275": {"recommendationid": "39438275", "author": {"steamid": "76561198003481008", "num_games_owned": 208, "num_reviews": 58, "playtime_forever": 16, "playtime_last_two_weeks": 16, "last_played": 1516288643}, "language": "koreana", "review": "예상 외로 마계촌을 잘 오마쥬 한듯한 작품이네요\n지금 짧게 한판 해봤는데 계속 해도 재미있을듯합니다 ㅎㅎ", "timestamp_created": 1516288719, "timestamp_updated": 1516288719, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39438011": {"recommendationid": "39438011", "author": {"steamid": "76561197970520957", "num_games_owned": 111, "num_reviews": 2, "playtime_forever": 112, "playtime_last_two_weeks": 6, "last_played": 1516287534}, "language": "english", "review": "Hard and fun game. You will die in this action, arcade retro game. If you like Ghost and goblin, Castlevania, megaman etc..this is for you. Need a controller to play.", "timestamp_created": 1516287932, "timestamp_updated": 1516287932, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39617843": {"recommendationid": "39617843", "author": {"steamid": "76561198048086872", "num_games_owned": 359, "num_reviews": 44, "playtime_forever": 12, "playtime_last_two_weeks": 12, "last_played": 1516516472}, "language": "english", "review": "This game is way too hard holy shit. Ghost'n'Goblins flashbacks, this is the best way to relive that game.", "timestamp_created": 1516925243, "timestamp_updated": 1516925243, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39603827": {"recommendationid": "39603827", "author": {"steamid": "76561198089868356", "num_games_owned": 58, "num_reviews": 15, "playtime_forever": 502, "playtime_last_two_weeks": 0, "last_played": 1515339621}, "language": "english", "review": "For a rather unknown game, this game is pretty well designed. The bosses are fairly original, the difficult is tremendously high. I can already say this game isn't meant for the faint of heart because this game is just... well... it's difficult.\nFurthermore, my experience playing this game isn't very close to everything else I have played in my entire life (except for super mario bros, but that game's combat isn't anywere near this game's combat and Dead Cells). \nI recommend this game and give it a 7,1/10.", "timestamp_created": 1516882849, "timestamp_updated": 1516882849, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39595075": {"recommendationid": "39595075", "author": {"steamid": "76561198176675135", "num_games_owned": 1407, "num_reviews": 151, "playtime_forever": 215, "playtime_last_two_weeks": 215, "last_played": 1516847157}, "language": "schinese", "review": "类魔界村复古硬派动作游戏。\n尽管这款游戏的玩法和卡普空的魔界村很像，但是制作精良，操作手感非常流畅，打击判定严谨。游戏采用复古风格，从画面到音效还有打击感让人回忆满满，魔界村的老玩绝对值得一玩。没有玩过魔界村的玩家也可以来体验一把，看看在没有黑暗之魂的年代老玩家是如何受苦的。\n欢迎大家关注我们的鉴赏家：http://store.steampowered.com/curator/28763059", "timestamp_created": 1516847212, "timestamp_updated": 1516847212, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.666709", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39592074": {"recommendationid": "39592074", "author": {"steamid": "76561197998919486", "num_games_owned": 664, "num_reviews": 11, "playtime_forever": 106, "playtime_last_two_weeks": 106, "last_played": 1516834301}, "language": "english", "review": "I recommend to buy this game while on a discount.\n\nAs far as I know there's a free version, but I got this one through Humble Bundle, and to be honest, it's a pretty good game, controls perfectly, feels fair every time I die (Even if it was frustrating and times, I could crearly understand why I died and how to proceed).\n\nIt's a very short game, that's why I recommend it on sale, it adds replayability through collecting some items and speedrunning.", "timestamp_created": 1516834850, "timestamp_updated": 1516834965, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39577042": {"recommendationid": "39577042", "author": {"steamid": "76561198023666926", "num_games_owned": 1648, "num_reviews": 624, "playtime_forever": 271, "playtime_last_two_weeks": 271, "last_played": 1516787284}, "language": "english", "review": "Well I have mixed feelings and don't know how to vote on this one. It is what it is, old school action platformer and it do quite a good job and all in being that but in the end I feel like have enough all that pixel, retro and over simplified games, it is little to simplified for my taste, I was hoping for juts little more from this game. \nIt is not bad but also not great for me, now I probably should look at dead cells, hollow knight and ori for more modern and rich platformers :)", "timestamp_created": 1516786050, "timestamp_updated": 1516786050, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39551126": {"recommendationid": "39551126", "author": {"steamid": "76561198061042984", "num_games_owned": 776, "num_reviews": 84, "playtime_forever": 10, "playtime_last_two_weeks": 10, "last_played": 1516690907}, "language": "english", "review": "This game reminds me of Ghost and Gobins so much so that I get just a frustrated with the poor choice of weapon pickups hehe.  Definitely worth its salt.  This game will be a keep in my arcade games for evermore!", "timestamp_created": 1516691014, "timestamp_updated": 1516691014, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.543189", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39539907": {"recommendationid": "39539907", "author": {"steamid": "76561198032400607", "num_games_owned": 1823, "num_reviews": 35, "playtime_forever": 133, "playtime_last_two_weeks": 133, "last_played": 1516641715}, "language": "thai", "review": "รูปแบบเกมคล้ายๆ Castlevania แต่ระดับความยากนี่ระดับน้องๆ Makaimura\nที่จริงผมว่า Dev เค้าน่าจะได้แรงบัลดาลใจ สองเกมนี้มารวมกัน\nเพราะตัวเองก็เขวี้ยงดาบ เหมือนมาไคมุระที่เขวี้ยงหอก และระบอาวุธเหมือนนักฟาดแส้ในตำนาน\nมีขวาน ระเบิด บูมเบอแรง มีดแฉก อื่นๆ \n\nเกมมีปริศนาลับต้องเก็บไอเทมลับให้ครบถึงจะเจอฉากจบที่แท้ทรู\nส่วนตัวไม่รู้ เล่นรอบแรกจบแบบอ้าว มันไม่จบจริงๆนี่หว่า คือต้องเก็บไอเทมลับให้ครบเท่านั้น\nถึงจะเดินทางต่อไปยังด่านถัดๆไปได้ พอดีเก็บไม่ครบ มันเลยตัดจบเคลียร์ดื้อๆเลย\nถ้าใครซื้อมาเล่น แนะนำเล่นให้เล่นเก็บรายละเอียดจะได้ไม่ต้องมาเล่นรอบสอง\n\nส่วนตัวขี้เกียจเล่นรอบสองละ \nในเกมมี เซตติ้งสปรีดรันโชว์ on/off ไว้ดูว่าเราใช้เวลาไปเท่าไรไว้สำหรับพวกชอบทำสถิติ\nแต่ส่วนตัวโหมดนี้ไม่มีประโยชน์กับผม เพราะผมนูปคอนเป็นสิบรอบละ ตายแล้วตายอีกตายวน เวียนว่ายตายเกิด\nน่าหงุดหงิดสุด คือเวลากระโดดข้ามเหว หรือหนาม มันไม่เหมือนร็อคแมนนะคุณ เวลาโดนมอนยิงหรือชนมอนละตัวกระพริบๆ\nละโดนหนามไม่ตายอ่ะ เกมนี้โดนมอนชนพอตกโดนหนามตายเลย หัวร้อนสุดๆบอกเลย\nเกมนี้เหมาะสำหรับคนชอบความท้าทาย และชาว 80,90", "timestamp_created": 1516643424, "timestamp_updated": 1516643424, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39512732": {"recommendationid": "39512732", "author": {"steamid": "76561197993473791", "num_games_owned": 633, "num_reviews": 61, "playtime_forever": 147, "playtime_last_two_weeks": 0, "last_played": 1500721204}, "language": "japanese", "review": "XBOX Oneコントローラーを使用。\n\n[u]高難易度の魔界村系ステージクリア型横スク2Dアクション。魔界の扉が開き、魔物達が王国に解き放たれた。王は主人公の騎士「ドン・ラミロ」とその部下を魔王討伐に送り込むのであった。[/u]\n\n[h1][b]良い点[/b][/h1]\n\n◆ 操作は通常攻撃とジャンプのみという非常にシンプルな作りとなっている。通常攻撃は上下左右にすることができる（ジャンプ中のみ下方向に攻撃可）。ゲーム開始時の主人公は短剣を使用しているが、道中で威力、射程や攻撃速度等の異なる様々な武器を使用する事が出来る。ただし、武器は一つしか持ち歩くことができないので注意が必要だ。攻撃時の軌道も異なる為、ステージやボスによっては特定の武器を使用して攻略する方が楽になる場合もある。\n\n◆ サブウェポンというわけではないが、武器の他にアイテムを入手することができ、こちらは敵を時々攻撃してくれる「妖精」や敵の攻撃を一度だけ防いでくれる盾等が入手できる。地味に助かる。\n\n◆ 高難易度と書いたがアクションが苦手な方でも、コンティニュー回数に制限がないのでクリアするだけであれば気軽にプレイができる。死に覚え系のゲームでもあるので、敵の出現位置の確認やボスの行動パターンを覚えるために初周はチュートリアルだと思ってプレイするのがおすすめだ。\n\n◆ 魔界村の様に鎧が脱げて主人公が全裸になる事は無く、主人公はハート（ライフ）が三つあり、敵の攻撃がヒットすると減っていき、ゼロになると残機を消費してチェックポイントからやり直しになる。残機が無くなるとコンティニュー画面へ。即死トラップも勿論配置されているので注意。\n\n[h1][b]悪い点[/b][/h1]\n\n◆ Steam版は日本語が未収録なのが残念だ。\n\n◆ 悪い点というほどではないが、条件を知っていても初周でトゥルーエンド（隠しラストステージ）へ行くのは不可能に近い。\n\n◆ 魔界村でいう「魔法」のようなものが有ってもよかった。\n\n[h1][b]総評[/b][/h1]\n\n魔界村系の横スクが好きであれば間違いなくハマる。難易度も程よく、コンティニューも無限にできるので、このタイプのゲームが初めてでもとっつき易い仕様になっている。\n\nプレイ動画をアップしているので、気になった方は[u][url=https://youtu.be/T1Mbr3JpU7U]こちら[/url][/u]を参考までにどうぞ。", "timestamp_created": 1516547157, "timestamp_updated": 1516547157, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.712646", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "40860956": {"recommendationid": "40860956", "author": {"steamid": "76561198116216448", "num_games_owned": 75, "num_reviews": 3, "playtime_forever": 26, "playtime_last_two_weeks": 26, "last_played": 1521317797}, "language": "spanish", "review": "Me entretuvo un rato, me hizo recordar a juegos clasicos de antes que yo naciera, lo recomiendo si te gustan los juegos retro", "timestamp_created": 1521247850, "timestamp_updated": 1521247850, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "40839894": {"recommendationid": "40839894", "author": {"steamid": "76561198004656989", "num_games_owned": 319, "num_reviews": 23, "playtime_forever": 15, "playtime_last_two_weeks": 15, "last_played": 1521163877}, "language": "english", "review": "There's a reason they don't make games like this anymore", "timestamp_created": 1521163905, "timestamp_updated": 1521163905, "voted_up": false, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.471442", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40823448": {"recommendationid": "40823448", "author": {"steamid": "76561197991065592", "num_games_owned": 152, "num_reviews": 10, "playtime_forever": 61, "playtime_last_two_weeks": 15, "last_played": 1521095690}, "language": "koreana", "review": "어려운 컨셉은 알겠는데 아무리 그래도 아주어렵게라도 피할수있는게 만들어야하는데 그런게 없음.그냥 쳐맞아야됨.\n", "timestamp_created": 1521095797, "timestamp_updated": 1521095797, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40751756": {"recommendationid": "40751756", "author": {"steamid": "76561198237911336", "num_games_owned": 73, "num_reviews": 15, "playtime_forever": 53, "playtime_last_two_weeks": 13, "last_played": 1520802134}, "language": "russian", "review": "игра просто дерьмище", "timestamp_created": 1520802198, "timestamp_updated": 1520802198, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40688056": {"recommendationid": "40688056", "author": {"steamid": "76561197970799950", "num_games_owned": 650, "num_reviews": 32, "playtime_forever": 406, "playtime_last_two_weeks": 174, "last_played": 1521569729}, "language": "english", "review": "Everyone keeps comparing this to Ghouls and Ghosts, for obvious reasons, however there is far more to it than you might think. It is steeped in Spanish culture and dark-age mythologies. I really enjoyed the monster and character designs, which were more often than not very macabre. Also while the game is very forgiving with regard to advancing the story and finishing the game, there is real challenge in trying to earn a high score (as continuing will reset your score). Overall the game is very solid and fun to play. I've spent much more on games that weren't nearly as charming or fun as this one.", "timestamp_created": 1520615866, "timestamp_updated": 1520615866, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40596194": {"recommendationid": "40596194", "author": {"steamid": "76561197964482683", "num_games_owned": 474, "num_reviews": 44, "playtime_forever": 22, "playtime_last_two_weeks": 0, "last_played": 1520292340}, "language": "english", "review": "It's a lesser version of super ghouls n' ghosts.  I can't play this without thinking, \"I'd rather just play super ghouls n' ghosts.\"", "timestamp_created": 1520292827, "timestamp_updated": 1520292827, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.460053", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40580914": {"recommendationid": "40580914", "author": {"steamid": "76561198067839948", "num_games_owned": 246, "num_reviews": 37, "playtime_forever": 51, "playtime_last_two_weeks": 0, "last_played": 1520148019}, "language": "russian", "review": "Тёмное испанское средневековье. Жизнь простого человека тяжела, но рыцарю ещё сложнее, так как он стоит на защите граждан и обязан в первых рядах мчаться в бой. А в мир проникло множество зла. Из-под земли вылезают зомби, сверху пикируют гарпии, и другая разнообразная мифическая живность терроризирует страну.\n\nКороль собрал своих самых верных рыцарей и отправил их на сражения с демоном, чтобы прекратить разгул нечисти и вернуть мир на земли. И хотя вначале рядом с тобой плечом к плечу будут биться твои товарищи, большую часть пути придётся преодолевать в одиночку. Монстры — не единственные препятствия, с которыми придётся столкнуться в дороге. Даже ветряные мельницы будут стоять на пути к счастливому будущему. Которое, впрочем, тоже никто не гарантирует.\n\nМожно передать привет старым аркадным автоматам. Всё в игре сделано так, чтобы ты \"потратил больше денег на жетоны\". Поэтому враги постоянно вылезают из под ног, жизней мало и всё стремится тебя убить. При этом игре удаётся как-то выдержать нужный градус напряжения, поэтому процесс не раздражает, а просто бросает вызов способностям. В остальном всё точно как в уважающем себя старом платформере: прыжки, секреты и ограниченное время. Также в игре есть встроенный бестиарий, который позволит ближе познакомиться с созданиями, которых ты доблестно сразил.\n\nCursed Castilla представляет собой дополненную версию вышедшей в 2012 году игры Maltida Castilla, в которую до сих пор можно поиграть бесплатно.", "timestamp_created": 1520235865, "timestamp_updated": 1520235865, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40481839": {"recommendationid": "40481839", "author": {"steamid": "76561198060731110", "num_games_owned": 332, "num_reviews": 18, "playtime_forever": 841, "playtime_last_two_weeks": 0, "last_played": 1520168789}, "language": "english", "review": "Of all the games on Steam right now. This one deserves a sequel most urgently. \nIn case you guys are working on one make sure to add more spooky graveyard levels and some really badd ass weapons and armor sets :))\n\nIf anyone affiliated with Capcom is reading this please ask them to relase their Ghouls N Ghosts/ Maximo Series on Pc.", "timestamp_created": 1519894248, "timestamp_updated": 1519894248, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.504717", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40450371": {"recommendationid": "40450371", "author": {"steamid": "76561198067369022", "num_games_owned": 227, "num_reviews": 47, "playtime_forever": 156, "playtime_last_two_weeks": 0, "last_played": 1519826004}, "language": "koreana", "review": "RAM OK\nROM OK\n", "timestamp_created": 1519780104, "timestamp_updated": 1519780104, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40444973": {"recommendationid": "40444973", "author": {"steamid": "76561198010280803", "num_games_owned": 2398, "num_reviews": 64, "playtime_forever": 317, "playtime_last_two_weeks": 0, "last_played": 1519759242}, "language": "schinese", "review": "不错的横版游戏，又受了一次苦，打完才发现还有BAD  ending设定。打了个BD，想了下 还是放弃了重新打一次GD了。被小怪虐的不要不要的= =  游戏本身还不错，不过感觉这个价格略贵了点，建议慈善包入手", "timestamp_created": 1519759353, "timestamp_updated": 1519759353, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.561795", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40403986": {"recommendationid": "40403986", "author": {"steamid": "76561198004569928", "num_games_owned": 609, "num_reviews": 95, "playtime_forever": 966, "playtime_last_two_weeks": 0, "last_played": 1519606487}, "language": "english", "review": "Cursed Castilla is a very worthy successor to Ghosts & Goblins! It's much more fair difficulty-wise, much more interesting story-wise, and fits perfectly into that era of video games with its art style. If you're interested in a Ghosts & Goblines like game, look no further.", "timestamp_created": 1519607399, "timestamp_updated": 1519607399, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525862", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40361749": {"recommendationid": "40361749", "author": {"steamid": "76561198273104205", "num_games_owned": 177, "num_reviews": 8, "playtime_forever": 120, "playtime_last_two_weeks": 0, "last_played": 1519494475}, "language": "spanish", "review": "Maldita Castilla es un Ghosts 'n Goblins \"wannabe\", que al contrario que GnG resulta muy aburrido, los controles responden mal (con un poco de inputlag, ya uses mando o teclado) y el apartado sonoro se puede resumir en un ruido demasiado alto y molesto.\n\nPuntos positivos\n-Tiene cromos\n\nPuntos negativos\n-Los cromos están a 0.04€", "timestamp_created": 1519490101, "timestamp_updated": 1519490101, "voted_up": false, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.390351", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40315570": {"recommendationid": "40315570", "author": {"steamid": "76561198334880787", "num_games_owned": 98, "num_reviews": 3, "playtime_forever": 749, "playtime_last_two_weeks": 0, "last_played": 1520112775}, "language": "spanish", "review": "Me hicieron llorar :') es tremendo juego, lo disfruté demasiado incluso frustrandome y lo seguiré jugando hasta sacar el final verdadero (me hicieron falta las lagrimas de moura), son grandes chicos!", "timestamp_created": 1519348745, "timestamp_updated": 1519348745, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40310030": {"recommendationid": "40310030", "author": {"steamid": "76561198052329710", "num_games_owned": 124, "num_reviews": 18, "playtime_forever": 54, "playtime_last_two_weeks": 30, "last_played": 1521722789}, "language": "french", "review": "C'est une lettre d'amour aux jeux d'arcade de la fin des 80's.", "timestamp_created": 1519328738, "timestamp_updated": 1519328738, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "40272384": {"recommendationid": "40272384", "author": {"steamid": "76561197979897113", "num_games_owned": 606, "num_reviews": 92, "playtime_forever": 48, "playtime_last_two_weeks": 0, "last_played": 1519209736}, "language": "english", "review": "After changing the control can't play... Bad game with no option to put the control to default settings. Sound is too loud and no option to lower the volume. Bad translation. A copy paste with bad translation of Ghosts n' Goblins.", "timestamp_created": 1519206737, "timestamp_updated": 1519207293, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.462180", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40242099": {"recommendationid": "40242099", "author": {"steamid": "76561197970938346", "num_games_owned": 333, "num_reviews": 204, "playtime_forever": 251, "playtime_last_two_weeks": 15, "last_played": 1520810753}, "language": "english", "review": "Great old-school arcade fun and they took a lot of the tedious aspects out the old-school experience while retaining the spirit and soul if that makes sense.\n\nThe difficulty is just right and I look forward to running through a bunch of times.  It is not as hard as Volgarr by comparison. My plan is to eventually 1CC this because it seems attainable without ripping my hair out.\n\nA very solid game, but somebody said that it felt like a ROM hack of a Ghouls & Ghosts arcade cabinet and I swear they were not exaggerating (less the cheapness or tedious aspects I was alluding to above).", "timestamp_created": 1519098865, "timestamp_updated": 1519098865, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.504717", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40240090": {"recommendationid": "40240090", "author": {"steamid": "76561198062609598", "num_games_owned": 2105, "num_reviews": 73, "playtime_forever": 34, "playtime_last_two_weeks": 0, "last_played": 1519090562}, "language": "english", "review": "I honestly don't see much improvement over Super Ghost's and Goblins.  This has all of the tropes you would expect from a platforming game. Most of the weapon pick ups are a death sentence, as there is collision for projectiles like the arching axe throw. Any kind of ceiling makes the weapon, your only weapon, useless. Play Ghost's and Goblins.  If you see this for sale around $1, pick it up and try it out.", "timestamp_created": 1519090875, "timestamp_updated": 1519090875, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.482283", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40228128": {"recommendationid": "40228128", "author": {"steamid": "76561198271315584", "num_games_owned": 71, "num_reviews": 6, "playtime_forever": 595, "playtime_last_two_weeks": 7, "last_played": 1520639704}, "language": "spanish", "review": "Guud game.\nEasy to Beat.\nThe first Time Doesnt fit you, but keep trying! :3", "timestamp_created": 1519057477, "timestamp_updated": 1519057477, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40195098": {"recommendationid": "40195098", "author": {"steamid": "76561198119203627", "num_games_owned": 1132, "num_reviews": 120, "playtime_forever": 24, "playtime_last_two_weeks": 0, "last_played": 1518962449}, "language": "koreana", "review": "횡스크롤 아케이드입니다.\n\n누가봐도 마계촌을 떠올리게 하는 게임 디자인입니다. 제가 이런 종류의 게임은 컨트롤이 미숙해서 초반만 해보고, 유튜브에서 전체 플레이영상만 (엔딩까지) 챙겨봤습니다. 멀티엔딩에다가 게임 내적으로 소소한 도전과제들도 있더군요.\n\n게임 내에서 볼륨조절 옵션이 없는건 아쉽습니다. 기본 볼륨이 꽤 큰데 이 게임을 할때마다 윈도우볼륨을 1/3으로 낮춰야하네요.\n\n이런 장르의 게임을 좋아하시는 분들께는 괜찮을 것 같습니다.", "timestamp_created": 1518967213, "timestamp_updated": 1519052471, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40185166": {"recommendationid": "40185166", "author": {"steamid": "76561198801707473", "num_games_owned": 127, "num_reviews": 34, "playtime_forever": 305, "playtime_last_two_weeks": 0, "last_played": 1519208500}, "language": "schinese", "review": "画风很反感，挂卡都麻烦", "timestamp_created": 1518945301, "timestamp_updated": 1518945301, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40109013": {"recommendationid": "40109013", "author": {"steamid": "76561198163781115", "num_games_owned": 86, "num_reviews": 37, "playtime_forever": 170, "playtime_last_two_weeks": 0, "last_played": 1518286996}, "language": "spanish", "review": "ME CAGO EN TODA LA PUTA ESTE ES EL PUTO MEJOR PUTO JUEGO DEL PUTO MUNDO DE VERDAD ME ENCANTA VIVA ESPAÑA Y VIVA EL REY HOSTIA ES QUE ESTE JUEGO ME HA LLEGADO AL ALMA Y ES QUE ADEMAS SOY DE ARGAMASILLA DE ALBA DONDE SE ESCRIBIO EL QUIJOTE SI EL PUTO QUIJOTE SE ESCRIBIO EN MI PUTO PUEBLUCHO DE MIERDA PERO ES QUE ESTE JUEGO ME HA LLEGADO EL ALMA JODER ME LO FOLLABA", "timestamp_created": 1518727732, "timestamp_updated": 1518727785, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.448276", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40076034": {"recommendationid": "40076034", "author": {"steamid": "76561198010315744", "num_games_owned": 531, "num_reviews": 151, "playtime_forever": 180, "playtime_last_two_weeks": 0, "last_played": 1518637172}, "language": "english", "review": "Even though I got the bad ending this game is a really good Ghouls N Ghosts type game (jumping mechanics included) - although not nearly as difficult. But it is still a very challenging but fair game, with lots of cool bosses to fight as well. Unlike Volgar the Viking, if you die you get to start back at the stage you were on too which I like. I especially liked the Sega Genesis/Technosoft soundtrack too.\nThis game has the Ninja Gaiden kickback type thing when you get hit which can be annoying at times and will cause lots of deaths later on, (thankfully it's not nearly as hard as that game either), and the jumping is also similar too, (as in if you're jumping forward and try to go back you'll hardly move). \nI only wish that after beating the game you could go back to previous levels as needed or if you have to start a new game at least introduce an easy mode to encourage more playthroughs and to get the good ending. \n\n", "timestamp_created": 1518638112, "timestamp_updated": 1518638112, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.533074", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40074352": {"recommendationid": "40074352", "author": {"steamid": "76561198450910271", "num_games_owned": 83, "num_reviews": 19, "playtime_forever": 293, "playtime_last_two_weeks": 0, "last_played": 1518632883}, "language": "english", "review": "Garbage not fun.", "timestamp_created": 1518632894, "timestamp_updated": 1518632894, "voted_up": false, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.267599", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40071195": {"recommendationid": "40071195", "author": {"steamid": "76561198048998109", "num_games_owned": 944, "num_reviews": 7, "playtime_forever": 503, "playtime_last_two_weeks": 0, "last_played": 1519734144}, "language": "english", "review": "Excellent throwback to the Ghouls 'n ghosts franchise. While it starts out very forgiving, the game starts to veer into a good hard difficulty reminiscant of the game it echoes a few stages in. \nWhile you may (and probably will) die a lot, the continue system is leniant enough not to make this as utterly frustrating as it could have been. Of course unless you want the last few achievements, where you pretty much *have* to make it in one go. \n\nPersonally am a sucker for pixelart, which is on point in this game, though not overly complicated, and the retro sounding ost fits this perfectly.\n\n", "timestamp_created": 1518623498, "timestamp_updated": 1518623498, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "40067091": {"recommendationid": "40067091", "author": {"steamid": "76561198366866825", "num_games_owned": 1024, "num_reviews": 20, "playtime_forever": 401, "playtime_last_two_weeks": 0, "last_played": 1518593516}, "language": "schinese", "review": "游戏的手感让我很难适应，过高的难度意味着否定了精良的制作和丰富的游戏要素。游戏整体素质来说是要给好评的，肯定和外面那些喜加一不一样，估计想要再改变基本上不可能了吧，7/10分。", "timestamp_created": 1518611095, "timestamp_updated": 1518611095, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.614615", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40058117": {"recommendationid": "40058117", "author": {"steamid": "76561198026637457", "num_games_owned": 1021, "num_reviews": 78, "playtime_forever": 137, "playtime_last_two_weeks": 0, "last_played": 1518493233}, "language": "english", "review": "This game seeks out to do exactly what it looks like it's trying to do.\nIt's not even being subtle.\n\nPrice is a bit high, but that can be said about any arcade-style games with a focus on 1CCing it.", "timestamp_created": 1518570338, "timestamp_updated": 1518570338, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40013650": {"recommendationid": "40013650", "author": {"steamid": "76561197995737236", "num_games_owned": 1069, "num_reviews": 58, "playtime_forever": 665, "playtime_last_two_weeks": 0, "last_played": 1520021184}, "language": "french", "review": "Parmi tous les jeux que du genre ghoul'n'ghost que j'ai essayé (et ils sont nombreux), celui-ci est peut être le meilleur. Le developpeur a reussi à reprendre les qualités du jeu ancêtre tout en donnant une identité unique à son propre jeu pour ne pas qu'il en soit une vulgaire copie. Les graphismes sont de bonne qualité pour du pixel, le bestiaire est original, le jeu est punitif mais laisse grâce aux continus infinis une possibilité aux joueurs de s'améliorer pour obtenir la meilleure fin et des exploits. Je peux donc aussi bien le conseiller aux joueurs old school qu'aux nouveaux joueurs interessés par le challenge et par ce genre de jeu.", "timestamp_created": 1518390531, "timestamp_updated": 1518390531, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40009329": {"recommendationid": "40009329", "author": {"steamid": "76561198019252930", "num_games_owned": 64, "num_reviews": 16, "playtime_forever": 573, "playtime_last_two_weeks": 0, "last_played": 1479243775}, "language": "italian", "review": "Il passaggio a pagamento dell'ultimo lavoro di Locomalito non ha portato quel benefici che molti speravamo. Il gameplay di Cursed Castilla EX attrarrà maggiormente i nostalgici e la sua difficoltà che, alcune volte, sfiora il frustante non aiuterà quelli che hanno poca pazienza nel memorizzare i movimenti dei nemici e soprattutto i giocatori più giovani che non conoscono l'atmosfera dei classici arcade che si respirava quasi trent'anni fa.\n\nIn più la mancanza di carisma, ovvero di quel tocco di classe che può dare sorprese ad ogni partita nonostante una struttura di gioco solida, lo porta a non essere ricordato da qui nei mesi a venire, anche a causa di una monotonia di fondo generale dove gli oggetti e le armi sono sempre negli stessi punti.\n\nIl passaggio da freeware a pagamento può trasformare un gioco di buon livello ad uno appena discreto.\n\nhttp://www.gamesark.it/mostra_rece.asp?c=161120160011837517", "timestamp_created": 1518376190, "timestamp_updated": 1518376190, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "39999147": {"recommendationid": "39999147", "author": {"steamid": "76561198093023560", "num_games_owned": 1048, "num_reviews": 18, "playtime_forever": 716, "playtime_last_two_weeks": 0, "last_played": 1519998607}, "language": "english", "review": "Didn't expect I'd like this as much as I do", "timestamp_created": 1518346766, "timestamp_updated": 1518346766, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39992041": {"recommendationid": "39992041", "author": {"steamid": "76561198264945377", "num_games_owned": 167, "num_reviews": 7, "playtime_forever": 125, "playtime_last_two_weeks": 0, "last_played": 1518146996}, "language": "brazilian", "review": "Uma memoria a os classicos do super nintendo,mas com uma certa carisma propria e aquela dificuldade de certa forma frustante que torna o jogo um desafio otimo e recompensador.", "timestamp_created": 1518318058, "timestamp_updated": 1518318058, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39963346": {"recommendationid": "39963346", "author": {"steamid": "76561198002062454", "num_games_owned": 564, "num_reviews": 73, "playtime_forever": 181, "playtime_last_two_weeks": 0, "last_played": 1518213515}, "language": "english", "review": "A nice and short old school sidescrolling action game, with a great learning curve appealing to varyingly skilled players: it might seem hard at first but thanks to checkpoints at every screen you'll be soon speedrunning it.\n\n+ Retro feeling but tight controls\n+ Enjoyable learning curve\n+ Good pixel art\n+ A lot of graphical settings and 21:9 support\n\n- Non replayable levels make content skippable\n- A lot of powerups feel like power-downs :/\n- 4:3 layout but with black bars fillers\n\n4/5", "timestamp_created": 1518214724, "timestamp_updated": 1518214724, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39932849": {"recommendationid": "39932849", "author": {"steamid": "76561198139484676", "num_games_owned": 443, "num_reviews": 72, "playtime_forever": 24, "playtime_last_two_weeks": 0, "last_played": 1518052406}, "language": "english", "review": "A clear tribute to the old school \"ghost\" games....  And just as infuriatingly difficult.\n\nGo for it, if you like that sort of masochism.", "timestamp_created": 1518105740, "timestamp_updated": 1518105740, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39930891": {"recommendationid": "39930891", "author": {"steamid": "76561198081542839", "num_games_owned": 767, "num_reviews": 70, "playtime_forever": 345, "playtime_last_two_weeks": 0, "last_played": 1515427918}, "language": "spanish", "review": "Juegazo que nos recuerda al mítico Ghost & Goblins ambientado en Castilla! Si si, cómo lo habeís oído. Es muy divertido y a la vez dificil, lo cual lo hace más interesante. Ojalá algún día podamos jugarlo con un gamepad cómo antaño y disfrutar al 100%. Me ha encantado! Y oye, tampoco se me ha dado tan mal :P\n\nAquí teneis un video del juego: https://youtu.be/6kS-SXPdV8c", "timestamp_created": 1518099710, "timestamp_updated": 1518099710, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39872789": {"recommendationid": "39872789", "author": {"steamid": "76561198066496454", "num_games_owned": 71, "num_reviews": 12, "playtime_forever": 455, "playtime_last_two_weeks": 0, "last_played": 1516738241}, "language": "english", "review": "I like hard games, but not this one. Why? It doesn't feel rewarding, it has bad controls and it's just no fun at all. You'd better pick up Shovel Knight or Castle In The Darkness if you are into good old NES platforming.", "timestamp_created": 1517858586, "timestamp_updated": 1517858586, "voted_up": false, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.433071", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39868240": {"recommendationid": "39868240", "author": {"steamid": "76561198010565391", "num_games_owned": 347, "num_reviews": 6, "playtime_forever": 192, "playtime_last_two_weeks": 0, "last_played": 1517844893}, "language": "english", "review": "Old school game with a ghost n goblins feel ,pretty good if you like those kinds of games , offers a fair and tough challenge too", "timestamp_created": 1517844975, "timestamp_updated": 1517844975, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39859090": {"recommendationid": "39859090", "author": {"steamid": "76561198142399226", "num_games_owned": 53, "num_reviews": 11, "playtime_forever": 258, "playtime_last_two_weeks": 0, "last_played": 1517804565}, "language": "spanish", "review": "Excelente juego, que no abusa de la dificultad como es caracteristico en los de su tipo. Su duración es perfecta (4 horas me duró  a mi). \ny ese ambiente de Castilla lo hace mejor aún.", "timestamp_created": 1517805298, "timestamp_updated": 1517805298, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39852019": {"recommendationid": "39852019", "author": {"steamid": "76561197994448955", "num_games_owned": 1967, "num_reviews": 168, "playtime_forever": 247, "playtime_last_two_weeks": 0, "last_played": 1519520987}, "language": "italian", "review": "Un clone \"moderno\" del fù Ghosts n Goblins con tutti i pro ed i contro del caso. Anzi diciamo che l'unico contro è l'ardua difficoltà che caratterizzava il passato titolo. Per quanto riguarda il resto è di una cura e giocabilità ineccepibile. In conclusione: giocateci solamente se avete pazienza e passione del mondo retrogaming.", "timestamp_created": 1517775482, "timestamp_updated": 1517775482, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.582147", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39736151": {"recommendationid": "39736151", "author": {"steamid": "76561198113949823", "num_games_owned": 150, "num_reviews": 35, "playtime_forever": 13, "playtime_last_two_weeks": 0, "last_played": 1517349711}, "language": "koreana", "review": "시발 재밌는데 점프 구간에서 바로 삭제\n\n점프 조작감 진짜 그 옛날 AVGN양반이 뻐어어어억!! 하면서 발광하는 조작감 그대로 옮겨놓음.\n\n전투보다 자꾸 되도안한 조작감으로 떨어져서 죽으니까 좃같아서 삭제함.\n\n이걸 보는 당신이 점프의 신 OR 옛날부터 이런류겜 잘하면 해도됨.\n\n", "timestamp_created": 1517349913, "timestamp_updated": 1517349913, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39719114": {"recommendationid": "39719114", "author": {"steamid": "76561198018450069", "num_games_owned": 204, "num_reviews": 57, "playtime_forever": 131, "playtime_last_two_weeks": 0, "last_played": 1517281486}, "language": "english", "review": "This is a pretty good arcade action platformer game.  \nAnd the retro graphic aspect, similar to the old SNES games are really nice. \n\nCursed Castilla is a fun game to play and very challenging. \nNormally I am a keyboard player but in this case I must confess that it seems to me that it would be better with the use of a controller.", "timestamp_created": 1517282432, "timestamp_updated": 1517282432, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39708541": {"recommendationid": "39708541", "author": {"steamid": "76561198105978254", "num_games_owned": 88, "num_reviews": 22, "playtime_forever": 238, "playtime_last_two_weeks": 0, "last_played": 1517243185}, "language": "koreana", "review": "조작이 매우매우매우 불편함.  순전히 불편한 조작 때문에 죽는거라 스트레스만 쌓이고 게임에 흥미가 떨어짐.", "timestamp_created": 1517241502, "timestamp_updated": 1517241502, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39688793": {"recommendationid": "39688793", "author": {"steamid": "76561197965732999", "num_games_owned": 3044, "num_reviews": 72, "playtime_forever": 53, "playtime_last_two_weeks": 0, "last_played": 1517001615}, "language": "spanish", "review": "El Ghouls'n Ghosts Español , es muy parecido . Esta muy bien si como yo te has fundido muchas pagas jugando a la arcade en bares.", "timestamp_created": 1517163113, "timestamp_updated": 1517163113, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39678860": {"recommendationid": "39678860", "author": {"steamid": "76561198043815251", "num_games_owned": 1692, "num_reviews": 12, "playtime_forever": 250, "playtime_last_two_weeks": 0, "last_played": 1517135636}, "language": "spanish", "review": "Gran juego de desarrollo español, basado en el mitico Ghouls and Goblins. \nUna dificultad al nivel d elos juegos de antaño, que te hara repetir los niveles más de lo que crees,\nEn lo respecto a la jugabilidad hubiera preferido algo más parecido al Super Ghouls and ghost  (por el tema de armaduras, y ataques especiales), ya que este cursed castilla no hay.\n\nLuego hay algunas cosas que no me cuajan: si saltas y te golpean quedas inhabilitado para agarrate a nada (cuerdas, cadenas, lianas) hasta que caes y tocas el suelo, pero eso no evita que no te puedan golpear más veces en el aire.\nO cuando estas agarrado a las mismas cadenas, no tienes posidibilidad de atacar de ninguna manera. Y todo esto lo único que hace es incrementar más la dificultad o empeorar la jugabilidad (según se mire)\nCreao que han querido ajustarse tanto a la jugabilidad clásica que se han olvidado de incorporar algunas cosas basicas.\n\nEn general es un buen juego que de primeras,  y sin completarlo al 100% te dara para unas cuantas tardes.  A mi me ha llevado una semana echando 1 horita aprox cada vez (más se me hacia pesado), y he conseguido el final malo. El final bueno, te habilita un nivel más, que cabe decir que no son cortos, y casi siempre con mini jefes de entremedias (que tambien son chungos).\n\nY finalizando, si te gusta los juegos clasicos y con reto hazte con el sin duda, si no es tu caso, esperate a que este de rebajas o en algun bundle, son de esos juegos que no deberias perderte.\n", "timestamp_created": 1517137214, "timestamp_updated": 1517137214, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39627621": {"recommendationid": "39627621", "author": {"steamid": "76561197985585667", "num_games_owned": 244, "num_reviews": 15, "playtime_forever": 25, "playtime_last_two_weeks": 0, "last_played": 1516968156}, "language": "english", "review": "This game is okay.  I wanted to love it, but it is middle of the road.  I grew up playing the type of games that this is trying to emulate, and this doesn't quite hit the mark.  The controls (specifically jumping, especially double-jumping later on) aren't quite right, and when you air-jump you freeze for a couple frames, then jump.  There are power-ups that can put you in a situation where damage is unavoidable (like picking up daggers, which has spreadshot but significantly reduced rate of fire, then immediatly having an enemy running at you in a coridor with hazards behind you and not being able to shoot fast enough to keep him off of you.\n\nMost of the difficulty in this game stems from spamming you with enemies, which feels quite cheap and is not really true to the games that inspired it, because they had sprite limitations to deal with.  This has far more forgiving platforming, but the barrage of enemies very annoying.  There are lots of little mechanical niggles that belie the retro aesthetic.  Like I said, the jumping is a little off, the enemy behavior is not quite right, the bosses seem run on subroutines rather than being pattern based, etc.  The difficulty is not consistant, either.\n\nAll in all, if you want an old-school-style platformer, and you already beat all the classics, I would recommend you play Shovel Knight.  If you are a hardcore Ghosts 'n Goblins fan, and already played all of the various permutations of it, from the arcade up to the PSP, and still want more, then this may be the game for you.  Otherwise I can't recommend it.", "timestamp_created": 1516971114, "timestamp_updated": 1516971114, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.527491", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}}}
