{"reviews": {"39268333": {"recommendationid": "39268333", "author": {"steamid": "76561197970627349", "num_games_owned": 232, "num_reviews": 1, "playtime_forever": 453, "playtime_last_two_weeks": 453, "last_played": 1515816347}, "language": "english", "review": "This app is an awesome one for those who miss mixing on old vinyl, the feel isnt perfect but still great fun to bust out the mixing skills. Some other little bits this needs and this will be the perfect virtual dj setup.\n\n1. Instant start or speed control on the start/stop for the decks, this way it could be used as a que button as the current queing on the virtual vinyl is a great but a little finicky. Would be a good symbiosis between digital and analouge then.\n\n2. As said there is a tiny delay between the headphones and speakers, but I can still mix just fine one ear on one ear off with the headphone crossfade, queing and volume so its not too much of a problem for me, massive props for adding it.\n\nAnd a way to move the decks so your sound setup is how you like it as a dj (I like my speeaker monitors in front of the decks) at the moment the room setup is locked in, let me move the room or decks in virtual space please! The height adjustment and angle are great by the way, love that!\n\nNice to have, Some CDJ 1000s :p\n\nAll in all superb so far though.", "timestamp_created": 1515714031, "timestamp_updated": 1515858798, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39213156": {"recommendationid": "39213156", "author": {"steamid": "76561198174428386", "num_games_owned": 27, "num_reviews": 1, "playtime_forever": 1684, "playtime_last_two_weeks": 330, "last_played": 1516390997}, "language": "english", "review": "Loving this app!\n\nThe music in headphones is slightly out of sync with the speaker output so no 1 ear on/off mixing as another reviwer has said (really hope you fix this somehow?) but overall the feel of mixing on vinyl has been emulated seriously, seriously well.\n\nThe additional extras such as BPM counter, FX units, environments etc would be cool but not necessary at all to lay down a solid mix, just something fun to play with to add a bit of variation.\n\nI really hope this app keeps being updated as it is by far my favourite VR programme to date, big respect to the Developers!\n\n10/10 would mix again", "timestamp_created": 1515521327, "timestamp_updated": 1515521327, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38759993": {"recommendationid": "38759993", "author": {"steamid": "76561197962514811", "num_games_owned": 47, "num_reviews": 4, "playtime_forever": 91, "playtime_last_two_weeks": 6, "last_played": 1515975843}, "language": "english", "review": "I like this, it's pretty great, works really well and it's a lot of fun. There's a long way to go, which I'm pretty stoked for, and in this early state, it's like using 2x $1200 turntables and a $25 dollar Numark mixer you found at Goodwill. \n\nThe space feels good and legit on my Oculus Touch. The ability to raise and lower the table is the best. The decks feel good and strong with a nice wind-up. Not perfect, though. Doesn't feel like there's a lot of \"snap\". Seems as if I can't hold the record in place and let it slip. When I let go, I want an almost instant response, but it feels as if it always winds up a little bit. Still I was able to match, using the double-eared cue. If I started out of time, I was able to shove the turntable forward or back, with some practice. When attempting to touch-slow the turntable, I would sometimes grab the record, which was frustrating but probably just user inaccuracy. \n\nI really wish there was a crossfader slope knob. Right now it seems that it's set in a solid 50%, which is perfect for graceful mixing, but I always used my crossfader in a more sharp form, for scratching, and I would even go hamster style at times. I also wish the mixer had some effects on it. EQs are fun, but I also want a nice resonate lowpass filter, or a phaser. It was a little hard for me to differentiate between the cue track and the master track. It would be awesome if you could change the tone of the cue, so you could really hear the difference in the two, or maybe even mix the master channel out of the cue, so it's more audible. That being said, the current mixer is pretty awesome and is perfect for beginners, but I hope that in the future you can swap your gear to a more advanced mixer.\n\nI liked how you could see the record grooves. Helps you cue. I also like how I couldn't accidentally whack my tonearm during a backspin (no trainwrecks here, people). The record box worked perfectly for me, and by perfectly I mean that I was standing in a pool of records by the end of my 1 hour session. I did discover that you can just put the records away for less clutter, but dude. It's VR, throw it across the room :D\n\nI hope that in the future you can have more gear models, maybe even CDJs emulated, and a four channel mixer. Great freakin' job though, I'm excited to follow development of this and will by happy to continue playing around with it.\n\n", "timestamp_created": 1514420933, "timestamp_updated": 1514420933, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38646632": {"recommendationid": "38646632", "author": {"steamid": "76561198122351494", "num_games_owned": 34, "num_reviews": 4, "playtime_forever": 94, "playtime_last_two_weeks": 0, "last_played": 1515181758}, "language": "english", "review": "I'm very sorry to give the first negative feedback, but it's only becuase, as a DJ myself, there were a few things that ruined the experience for me, that if fixed, would change this review in an instant.  I started with vinyl decks, I now have Numark  NS7s with simulate vinyl decks for MP3s, but I suppose as the saying goes there's nothing like the real thing.\n\nMy personal issues with this on the Oculus Rift:\n\n*The cue system doesnt work properly, as a DJ I need to hear the track I'm mixing in on its own to find the point I want to start with.  As far as I can tell, I cannot listen to the track I am trying to mix in on it's own.  I have tried the cue buttons and no matter what I do, I always hear the main track playing at full volume.  The trim and master would effect what the audience hears, so the cue needs to be sorted to work as normal decks.\n\n*I found that with the Oculus controllers the sensitivity was too high, it took ages to get the specific pitch required in the tutorial.  I managed to beat match some old hard house that I have, but more technical tracks are a chore.\n\n*Maybe it's just me, but I couldn't figure out how to reset my position in game, a reset button would be great.\n\n*It would be great to be able to twist all the knobs from minus to max in one turn, any DJ will say that time is very important, you don't want to be having to let go and turn again when trying to mix. \n\n*One final less important point is, more scenes would be awesome.\n\nThese are my points I wanted to raise, please only take this as constructive, I really do like the app, but with these points sorted I could really have a lot of fun with this!\n\nThanks a lot!", "timestamp_created": 1514180212, "timestamp_updated": 1515784432, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.519126", "comment_count": "8", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38643505": {"recommendationid": "38643505", "author": {"steamid": "76561198009876564", "num_games_owned": 592, "num_reviews": 78, "playtime_forever": 828, "playtime_last_two_weeks": 673, "last_played": 1516243257}, "language": "english", "review": "WOAW! AMAZING! Seriously sold so many of those record players for food. THIS IS SO MUCH FUN! Think of the possibilities!!!!!\nupdated 1- STILL ONE OF THE BEST PROGRAMS AND EXPERIENCES ON A VR HEADSET - AMAZING", "timestamp_created": 1514170696, "timestamp_updated": 1515214018, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38550739": {"recommendationid": "38550739", "author": {"steamid": "76561197996886643", "num_games_owned": 359, "num_reviews": 14, "playtime_forever": 416, "playtime_last_two_weeks": 60, "last_played": 1516386091}, "language": "english", "review": "Best VR app for DJs out so far. The Wave VR comes close but isnt as solid. I only played vinyl once or twice before but after a few hours you start to get the hang of it. Been making mixes on this $15 app instead of my $800 mixer. To those who mention a lack of tutorial, there are plenty online, vinyl mixing has been around for ages. If you can learn the basics from those videos it is easy to apply to rthis very accurate sim. \n\nIt does help to have a background DJing, but this is good to learn on. Though I highly reccomend using normal dj software like traktor or virtual dj to learn the structure of tracks and learn the theory of mixing.", "timestamp_created": 1513978374, "timestamp_updated": 1513978531, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38308425": {"recommendationid": "38308425", "author": {"steamid": "76561198070551225", "num_games_owned": 236, "num_reviews": 4, "playtime_forever": 573, "playtime_last_two_weeks": 0, "last_played": 1514849622}, "language": "english", "review": "\n\n\n\nOver fifteen years ago a friend introduced me to spinning Drum & Bass tracks on Technics SL-1210 Mk2 turntables connected to an Ecler SMAC mixer. It took a while to learn but I had great fun doing it, even if I couldn't afford such a set myself. \n\nEventually I bought a MIDI controller and DJ software to mix my own music at home, but it was never quite the same. Other hobbies took over, I forgot all about the joy of DJ'ing and many years passed.\n\nUntil recently, when I was looking for interesting VR apps that I could try out with the Oculus Rift. When I started up Vinyl Reality, all those good memories came back to me. And the app is not just a toy, it really is practical enough for doing mixsets the good old fashioned way, back then when your gear wouldn't count BPM's for you and you had to prepare for your sets and spend minutes tweaking the perfect sync between two records. And I find myself forgetting that I'm in VR. The turntables feel the same way. The mixer feels the same way. All those old tricks still work. Sure, with a little less tactile precision, that comes with the virtual nature of the app, but seriously, I'm so excited to own turntables and mix tracks again, I don't care. :)\n\nWith the recent 1.0.3 update, the grooves on the records now show the actual track structure, just like you would expect in real life, and with that, the basic app (without bells and whistles) is complete. Nevertheless, the developer has a lot of future features in store, some of which will bring a bit more modernity into the affair, others will just add flair, like new virtual locations to mix at.\n\nAll in all, 10/10. In my opinion this is one of the must-have VR apps.", "timestamp_created": 1513281404, "timestamp_updated": 1513281404, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525862", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38195574": {"recommendationid": "38195574", "author": {"steamid": "76561198025181087", "num_games_owned": 229, "num_reviews": 2, "playtime_forever": 181, "playtime_last_two_weeks": 29, "last_played": 1515962446}, "language": "english", "review": "I sold my decks more than ten years ago, but I still feel the occasional urge to mix. The problem is that I can't justify having a dj booth in my living room at this point. Mainly because I need that floor space for VR. Along comes Vinyl Reality. It's only in early access as of this review, but it already feels pretty darn close to the real deal. After a few minutes, I was beatmatching just like I used to. The headphone cueing and master out recording work just like they should. I'm looking forward to some 'quality of life' improvements, but I'm very happy with it in it's current state. Thanks for making this.", "timestamp_created": 1512865403, "timestamp_updated": 1512865403, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38131674": {"recommendationid": "38131674", "author": {"steamid": "76561198131339053", "num_games_owned": 235, "num_reviews": 54, "playtime_forever": 142, "playtime_last_two_weeks": 0, "last_played": 1512770202}, "language": "english", "review": "Great start, have only played enough to confirm it's legit and it is what it is - Basic vinyl setup in VR. There's a bit of lag between the headphones and main output on my setup, so it means mixing in the cans rather than one ear off/one on, but YMMV. Totally worth the price of entry as it is with more enviorments (at least 1) on the way! Just need a crowd to play to now haha", "timestamp_created": 1512661406, "timestamp_updated": 1512661406, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38112634": {"recommendationid": "38112634", "author": {"steamid": "76561198033258278", "num_games_owned": 124, "num_reviews": 1, "playtime_forever": 538, "playtime_last_two_weeks": 0, "last_played": 1511740028}, "language": "english", "review": "A really great VR App! It's about as close as you can get to owning a classic dual turn table set up, all your music on single track vinyl, and the space to spin, without dropping a few thousand dollars to actually have the real thing.\n\nThe tutorial is fairly quick and strait forward and will have you beat matching and fading transitions in no time. Of course this also requires that you have an ear for music and can catch a beat. You can spin all your music, record your sets, and when you're finished spining for the day, you just take the headset off and \"POOF\" it all disapears in to the metaverse, no storage space required.\n\nIf you're interested in DJing or even just playing around with a couple of turn tables, have a VR headset and some music on your PC to spin, I highly recommend you check Vinyl Reality out.", "timestamp_created": 1512592184, "timestamp_updated": 1512592184, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38068562": {"recommendationid": "38068562", "author": {"steamid": "76561198278304099", "num_games_owned": 109, "num_reviews": 11, "playtime_forever": 142, "playtime_last_two_weeks": 31, "last_played": 1515802081}, "language": "english", "review": "Really Love it so far, even though its basic. im learning though! I LOVE IT. I cannot wait for more update and feature to come!! Pleasee dont let this die! <3", "timestamp_created": 1512434746, "timestamp_updated": 1512434746, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38003987": {"recommendationid": "38003987", "author": {"steamid": "76561197976449547", "num_games_owned": 47, "num_reviews": 1, "playtime_forever": 393, "playtime_last_two_weeks": 0, "last_played": 1514649592}, "language": "english", "review": "Excellent, Love it so much!!\n\n", "timestamp_created": 1512222208, "timestamp_updated": 1512222208, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37955444": {"recommendationid": "37955444", "author": {"steamid": "76561197974077998", "num_games_owned": 149, "num_reviews": 4, "playtime_forever": 81, "playtime_last_two_weeks": 0, "last_played": 1512056819}, "language": "english", "review": "Being a Vinyl DJ for 22 years  spinning on the 1200's ala the wheels of steal  this app was just out right FUN\n", "timestamp_created": 1512057239, "timestamp_updated": 1512057239, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37918651": {"recommendationid": "37918651", "author": {"steamid": "76561198335424314", "num_games_owned": 17, "num_reviews": 2, "playtime_forever": 976, "playtime_last_two_weeks": 0, "last_played": 1515033157}, "language": "spanish", "review": "gracias a todos los que trabajaron en este juego es el mejor simulador de dj para vr es genial", "timestamp_created": 1511927901, "timestamp_updated": 1511927901, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37913619": {"recommendationid": "37913619", "author": {"steamid": "76561198094287943", "num_games_owned": 240, "num_reviews": 37, "playtime_forever": 263, "playtime_last_two_weeks": 0, "last_played": 1512947459}, "language": "english", "review": "Amazing software, stunned by how accurate and smooth everything feels. If you have any interested in dj'ing get this, I guarantee you will not be disappointed", "timestamp_created": 1511908293, "timestamp_updated": 1511908293, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.571275", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37912331": {"recommendationid": "37912331", "author": {"steamid": "76561197971078822", "num_games_owned": 154, "num_reviews": 1, "playtime_forever": 197, "playtime_last_two_weeks": 0, "last_played": 1513408185}, "language": "english", "review": "Very accurately reproduces the experience of mixing on vinyl, including subtle things like that tiny bit of drag as a record gets up to speed when you release after holding it on the slipmat. Developers have done a nice job of providing tactile feedback using haptics on the controller, and it's obvious that they genuinely know how to DJ and care about simulating it accurately. Integration of your own music library is seamless and intuitive. This is a legitimate practice tool (and also a painful reminder to me of how much I'd come to rely on the crutches CDJ's and Traktor give us).\n\nA word of caution if you haven't previously mixed on vinyl - it's challenging to learn, and this software replicates it accurately without giving you any crutches or easy outs. If you really want to learn and you're willing to put in the practice, this is a good way to do it, but if you're looking for a simplified DJ Hero-style experience, this might not be what you're looking for. Personally, I'm in love with this software and thrilled that they've simulated the practice so well.", "timestamp_created": 1511904117, "timestamp_updated": 1511904117, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.527559", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37730550": {"recommendationid": "37730550", "author": {"steamid": "76561198062942721", "num_games_owned": 238, "num_reviews": 4, "playtime_forever": 59, "playtime_last_two_weeks": 0, "last_played": 1512800176}, "language": "english", "review": "i rate this sim highly, i had zero background in EDM or DJing and my only gripe with this is it doesn't teach me anything other than the basics of how to get the vinyl playing. I would love to see a tutorial in DJing introduced into this program so i can actually  know what is going on. i'll continue to plug away and learn via youtube and practising on Vinyl Reality but would recommend to anyone with other DJ experience. And for those like me who know nothing of DJing i'd still recommend this and use it as the pract side of my learning.", "timestamp_created": 1511739108, "timestamp_updated": 1511739108, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37631143": {"recommendationid": "37631143", "author": {"steamid": "76561197969586697", "num_games_owned": 300, "num_reviews": 21, "playtime_forever": 28, "playtime_last_two_weeks": 3, "last_played": 1516063877}, "language": "english", "review": "I can't dj but this app is legit.", "timestamp_created": 1511681469, "timestamp_updated": 1511681469, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37607547": {"recommendationid": "37607547", "author": {"steamid": "76561198040681476", "num_games_owned": 118, "num_reviews": 4, "playtime_forever": 127, "playtime_last_two_weeks": 0, "last_played": 1515135331}, "language": "english", "review": "I wasn't expecting much  but after a bit of tinkering I got it working with my oculus. Room scale is required but I got it working with standing mode as long as you setup the sensors right. It was impressive as were the 1200's. I have been djing for over 25 years and started out with vinyl so this was easy for me.My Beat matching skillz are silky smooth ;) It really was very realistic, just have to get used to the adjustments and controls. One thing that I did not like was the music selection recrod case. not sure if its a problem with the design or it simply is buggy with the Oculus but when trying to select music it is near impossible to get the correct record as it scrolls back to center after you move it up or down so it doesn\\t stay on the selection you made. Thats the only thing that I found not working properly but its significant as you need to be able to fly through your record collection when playing. Other then that it really is a great start. I started feeling like a I was back in the dj booth after a few minutes it was awesome. FYI wear a sweat band as once you get into it really is pretty cool experience. Learning curb is just like in real life more practise more fun. Mixing was easy and the cueing system was great. The only thing I would do to improve it would be to add selectable main and cue for different hardware.  I only heard the music in the ear phones and the cue, it can sometimes be hard to hear. I think by allowing to output to main speaker I can use the rift headphones for cueing and the main for output. Also stream function would be epic so you can invite people to listen in to your set. Very nice work. Would be great to be able to use my Audio4DJ for serious sound.", "timestamp_created": 1511661602, "timestamp_updated": 1511661812, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37572214": {"recommendationid": "37572214", "author": {"steamid": "76561198281328328", "num_games_owned": 33, "num_reviews": 1, "playtime_forever": 245, "playtime_last_two_weeks": 0, "last_played": 1512305290}, "language": "english", "review": "Vinyl Reality is Awesome, loved playing around trying to mix song old school not very succesfully i might add but loved it anyway, i will use this alot  and for £11.39 its a snip. Imagined myself in ibiza, now that would be a nice scenery to add stage crowds and lighting effects, a bottle of beer on the side wouldnt go a miss too lol and maybe bmp and echo, flanger reverb etc and maybe auto sync but i guess it is vinyl so old school, i better start practicing. well done to the developer the Oculus Rift seems to work fine with this too.", "timestamp_created": 1511637716, "timestamp_updated": 1511637716, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36994824": {"recommendationid": "36994824", "author": {"steamid": "76561198015528525", "num_games_owned": 134, "num_reviews": 34, "playtime_forever": 61, "playtime_last_two_weeks": 0, "last_played": 1511006970}, "language": "english", "review": "Gameplay Video: https://www.youtube.com/watch?v=xkS80sVDlc8&list=PLrpCFaqHnjdyiF-atoM9iZyYbUuDAvLr9&index=37&t=25s\n\nSo first of: I'm not a DJ. I don't make music or anything  i'm a complete noob when it comes to these things.\n\nVinyl Reality is a Simulator in which you can use DJ equippment to mix/create your own songs and even record them.\nFor me as a non-DJ the controls where intuitive and easy to understand. The tutorial gives you a good enough overview to get you started.\n\nThe game uses songs that are on your computer so you can mix your favorite titles or your own music aswell. There is a decent amount of sliders and buttons to fiddle with to customize your track.\n\nI personally don't know how accurate this simulator is, since i never stood behind a turntable myself, but i know that i had fun with this and even managed to do a little remix of song myself (probably not a good one but what can you do ;) )\n\nIf you're a DJ, i can't tell you if this is good or not, but from a noob's perspective i can say: It's a fun little piece of Software and i can imagin a pro could maybe do a Twitch livestream concert for example, mixing his own tracks and stuff. I'm looking forward to what the devs will add to this in the future.\n", "timestamp_created": 1511429409, "timestamp_updated": 1511429409, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36883415": {"recommendationid": "36883415", "author": {"steamid": "76561197971035123", "num_games_owned": 76, "num_reviews": 6, "playtime_forever": 1094, "playtime_last_two_weeks": 158, "last_played": 1516383735}, "language": "english", "review": "Holy crap, this is the real deal. I had everything from cheap belt driven Kam turntables right up to technics 1210 mk3's back in the day and this feels so good its unreal.\n\nI was able to go right in and mix tracks together at a pretty accurate level with only about 5 minutes of playing around and getting used to it. The fact you can output the master track seperate to what you are listening to with the cue mix is fantastic.\n\nCan't wait to see what the developer does next.\n\nNB: I'm on oculus and it works fine, the only issues are with selecting tracks from the record box but its not bad enough to make any real issues, just takes a bit of getting used to. Hopefully they will bring out true oculus support soon!", "timestamp_created": 1511399756, "timestamp_updated": 1511399756, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.581749", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36780959": {"recommendationid": "36780959", "author": {"steamid": "76561197972507661", "num_games_owned": 221, "num_reviews": 2, "playtime_forever": 72, "playtime_last_two_weeks": 0, "last_played": 1515014115}, "language": "english", "review": "I was hesitant when I saw the subject of the game, but it is so so sooo good. The decks, knobs, tables and all feel great to use and bringing in your own music library is good fun. Thast being said, the only downside so far for me (using an Oculus Rift) is the menu system in the record collection behaving as though the sticks were touchpads making scrolling unwieldly. That is literally the only problem I have with the game as it currently stands. Hopefully there will be more to come with effects, new venues and other features which the developer has on his roadmap. \n\nIf this became a multiplayer application, it could do great things for djs out there who want to try out new mixes for a crowd. Meanwhile all I'm hoping for is a sampler touchpad feature.\n\nIf you have an interest in DJ software or mixing music, this is what you want.", "timestamp_created": 1511381849, "timestamp_updated": 1511381849, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36683957": {"recommendationid": "36683957", "author": {"steamid": "76561198137223289", "num_games_owned": 75, "num_reviews": 1, "playtime_forever": 74, "playtime_last_two_weeks": 0, "last_played": 1511379098}, "language": "english", "review": "very very good for what it is, if u are a dj or are intrested in real djing this is very cool !!! \n\nwould like them to add a filter knob, a delay efect and and maybe a mod like thing for wave form and cue points and alot more rooms but i do understand its still in development BUT DONT ADD SYNC  PLZ  if u do add the more laptopy things\nanyways well worth the money very welll made :)", "timestamp_created": 1511300409, "timestamp_updated": 1511300409, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36674172": {"recommendationid": "36674172", "author": {"steamid": "76561198299667600", "num_games_owned": 186, "num_reviews": 1, "playtime_forever": 76, "playtime_last_two_weeks": 0, "last_played": 1513433937}, "language": "english", "review": "This is pretty good, and the cue system is cleverly integrated if you're only using headphones. I don't have speakers attached to my Vive setup, so don't know if i can route the audio out of there while keeping the virtual cue system. \n\nWhat would be nice, from a mixing POV is the ability to just gently slow down the deck with a tap, rather than a drag - similar to stopping the vinyl, but more subtle. \n\nAlso, again since I'm only using headphones, but the queue is too quiet if the mixer channels are cranked. \n\nAnother welcome addition might be the ability to raise overall height of the desk. Neck ache after only 30 minutes because you're constantly looking down. \n\nGood stuff, recommended if you're into vinyl deejaying and don't need a beat-match switch.", "timestamp_created": 1511265663, "timestamp_updated": 1511265838, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36673627": {"recommendationid": "36673627", "author": {"steamid": "76561198150574441", "num_games_owned": 59, "num_reviews": 3, "playtime_forever": 195, "playtime_last_two_weeks": 30, "last_played": 1515514268}, "language": "french", "review": "Vraiment excellent je le recommande fortement, j'ai vendu mes platine et je me retrouve avec ça pour 12 euro,  c'est très réaliste! Vivement une mise à jour on on ce retrouve devant 2 000 personne dans un club underground de Berlin ^^ ( faut bien rêver) \nEn tout cas felisitation au développeur c'est du très bon boulot !!", "timestamp_created": 1511263033, "timestamp_updated": 1511263033, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36669912": {"recommendationid": "36669912", "author": {"steamid": "76561197965380769", "num_games_owned": 235, "num_reviews": 17, "playtime_forever": 73, "playtime_last_two_weeks": 6, "last_played": 1515455791}, "language": "english", "review": " Seems to me like this Dev is trying to make a great product! Highly recommend to anyone who has DJ experience", "timestamp_created": 1511242558, "timestamp_updated": 1511242558, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36651849": {"recommendationid": "36651849", "author": {"steamid": "76561197977861474", "num_games_owned": 80, "num_reviews": 7, "playtime_forever": 109, "playtime_last_two_weeks": 0, "last_played": 1514424369}, "language": "english", "review": "I am REALLY impressed by this VR app!\nI've been a DJ for more than 10 years using mostly vinyls and I always hated the computer software as it was really far from \"real djing\" and ofen unresponsive. In 2 minutes I felt completely confortable with this...\nThis VR experience behave EXACTLY like a Tech1200 setup...\nIt feels so good to get that physical feeling of moving the record with my hand.\nLooking foward to the next features of Vinyl Reality!\n\n****Please add Mixed reality controlers, I see the PSVR and browsing my own library is awfull! I'll have to try with my other headsets...", "timestamp_created": 1511204808, "timestamp_updated": 1511205011, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36641153": {"recommendationid": "36641153", "author": {"steamid": "76561197965013469", "num_games_owned": 534, "num_reviews": 20, "playtime_forever": 8, "playtime_last_two_weeks": 0, "last_played": 1513978959}, "language": "english", "review": "This works really really well. No noticable lag. The controls have been thoughts about - like holding a controller to your ear to preview the cue'ing record\n\nLove this as a showcase of what VR is all about. Great work. Very excited to see where it goes although it's still a full product as it is\n\nHighly Recommended if you are interested in DJ'ing", "timestamp_created": 1511163793, "timestamp_updated": 1511163793, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36637750": {"recommendationid": "36637750", "author": {"steamid": "76561198066590240", "num_games_owned": 1217, "num_reviews": 436, "playtime_forever": 20, "playtime_last_two_weeks": 0, "last_played": 1511143679}, "language": "english", "review": "Played this on the Oculus Rift with Touch Controllers.  You can play this standing/seating room with only two sensors.  Some dials or knobs may be hard too reach, but as long as you have enough space to stretch your arms, you should be fine.\n\nThe only knock on this is that there's only 1 environment (a boring attic).  Other than that, it's magnificent and the best of it's kind.  I'm not sure what took a dev so long to perfect this idea that we've seen so poorly done in other titles.  But great job dev, this game delivers on what it promises.  Very polished for EA, although not a lot of extras currently.\n\nSo if you ever wanted to mess around with DJ equipment that is normally too expensive or would take up too much space.  And don't have time to accumulate a perfect vinyl collection, then fire up this gem.  Just make sure you have plenty mp3s to mess around with (game treats each song like it's own vinyl)\n\nRating 8/10 (hopefully dev adds more equipment and more environments, more tutorials in VR), would like to see an easy way to pick your favorite songs easily", "timestamp_created": 1511146372, "timestamp_updated": 1511146372, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.543568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36625428": {"recommendationid": "36625428", "author": {"steamid": "76561197970811805", "num_games_owned": 8, "num_reviews": 1, "playtime_forever": 880, "playtime_last_two_weeks": 150, "last_played": 1515954889}, "language": "german", "review": "Das hier ist eine richtig geniale Software, welche durchaus langlebiges Potenzial in vielen Richtungen hat.\nAbgesehen von der noch heutigen mangelhaften Headsets, welche z.b durch den Fliegengitter Effekt die Stimmung bei längeren Sitzungen trübt, macht es enormen Spaß darin zu \"Mixen\" Ich selbst bin DJ der alten Schule und habe seit 1993 Erfahrung als DJ. die Bedienung ist sehr intuitiv gestaltet. Man findet eigentlich alles da wo es auch sein sollte. Ich habe keine Ruckler beim Mixen entdecken können. Ich bin seither fasziniert von dieser Software. Es zeigt die Möglichkeiten einmal auf eine andere Sichtweise, welche VR in Zukunft bieten könnte. Es macht Spaß die virtuellen Fader zu bewegen, die Plattensammlung auf die Teller zu legen und für eine Lange Zeit in die Musik ganz einzutauchen. Man vergisst sehr schnell, dass man sich vor einem Virtuellen Dj- Pult befindet. Ich möchte nachfolgend noch auf gewisses Potenzial hinweisen und ebenfalls auf diverse mankos welche der Entwickler verändern / verbessern könnte.\n\nPontenzial:\n\nVirtuelle Clubs, mit tanzenden Menschen und dazu die passende Light show, die dann aber hoffentlich ebenfalls der realität sehr nahe kommen. Aus anderen Apps dieser Art, scheiterten die Entwickler an der Animierung diverser Moving Lights, Laser etc. Das sah alles sehr billig aus und man bemerkte, dass die Programmierung einfach keine Experten dieser Art waren. Bei dieser App hier, bemerkt man sehr stark, dass hier auch Musiker und Techniker bei der Entwicklung beteiligt sind. Die Detailtreue zu den Technics 1210er und dessen Bedienung ist einfach genial gelungen.\n\nDer Mixer ist zwar insofern funktional, jedoch vermisse ich persönlich etwas mehr Modernität mit mehr Funktionen wie. z.B Kill switches, Master Equalizer, Compressoren, Effekte, mehr Kanäle etc.\n\nFür mehr variablen müssten den Decks auch noch zwei CD Player intigriert werden, da nicht mehr alle DJs mit Vinyl auflegen, was ich persönlich zwar sehr bedauere, aber ich aufgeschlossen gegen alles bin. Dadurch könnte einfach eine größere Zielgruppe angesprochen werden.\n\nEs fehlt momentan auch noch eine Möglichkeit den Raum in dem man Mixt an seine Bedürfnisse anzupassen wie z.b wo das Pult steht Oder wie Hoch das Pult gebaut ist. Nicht jeder nutzer hat einen solch großen Spielbereich zur Verfügung. Vielleicht habe ich auch solch eine Funktion auch nur übersehen. \n\nDie Ganzen Sets aufzunehmen funktioniert ganz gut,aufgenommen wird als WAV, jedoch ist mir aufgefallen, dass zwischen CUE und MASTER ein gehöriges Delay existiert. Dies ist zwar im Club auch so, jedoch sind dafür ja Monitore am Pult. Es ist nervig das Delay im Vorraus mit einzuplanen. Das trübt das Erlebniss ein wenig. Ich denke das es evtl. an den Treibern liegt, die das Headset mit Ton befeuern.Ich werde dies aber nochmal mit meiner ASIO Karte testen.\nIch selbst nutze eine Oculus Rift.\n\nAuch vermisse ich es mehr als nur einen Plattenkoffer am Tisch stehen zu haben, da man ansonsten zu lange braucht um auch mal Tracks heraus zu suchen die nicht innerhalb einer Ordnerstruktur zur Verfügung stehen. Dies würde es dann nicht vorrauszusetzen, sich die entsprechenden Tracks vorher in einem Ordner zu organisieren. \n\nPotenzial Multiplayer\nDas ergebe die Möglichkeiten Back TO Back zu spielen mit etfernten Kollegen welche nicht im gleichen Raum/Platz/Ort sind. Vermutlich wäre das enstehende Delay über das Internet aber nicht zu händeln, daher wahrscheinlich eher nur ein Wunschtraum.\n\nIm Moment gibt es nur eine einzige Umgebung in einem Dachgeschosszimmer mit Couch, Parkettboden und DJ Pult. Diese Umgebung ist ansich gelungen, aber hier sollte schnell nachgereicht werden.\nUmgebungen wie z.B\n\nFestivals\nClubs\nBeach Partys\n\nsind denkbar und bieten genug Abwechslung. \n\nIch habe die Software im Early Access erworben und habe dafür knapp 13 € bezahlt.\nDas ist für den jetzigen Stand der Software in Ordnung. Wenn die Entwicklier hier schnell nachschieben, sollte der Preis angehoben werden, da meiner Meinung nach dies endlich mal eine von wenigen VR Erlebnissen bietet, welche man sich in Zukunft wirklich wünscht. Über den Stand einer Technikdemo ist diese Software aber glücklicherweise hinaus.", "timestamp_created": 1511103984, "timestamp_updated": 1511105023, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.629630", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36623791": {"recommendationid": "36623791", "author": {"steamid": "76561197999119601", "num_games_owned": 137, "num_reviews": 29, "playtime_forever": 207, "playtime_last_two_weeks": 0, "last_played": 1513458175}, "language": "english", "review": "Sayin the same.\n\nThere's nothing amiss here, aside the crowds you'd hope were there when your getting off on one during a fantastic mix session.\n\nThe scale of everything is clear and well defined, no problems twisting the dials. Motion controls have been well implimented, you''ll have no problem flicking disks over as intuitively as you would beyond the virtual space. The track box is fine once you figure out the sensor pad clicks forward and back through your file folders on left/right click, and the sensor scrolls up/down.\n\nOnly problem i found was droping records a few times, there's no way it seems to grab them from the floor, and at the same time they become blanked out in the box, requiring you to back out of the folder and return (an easy fix im sure)\n\nAside from the aesthetics, there's nothing wrong here, it does everything you'd hope two turn tables and mixer would with perfect interaction. \n\n", "timestamp_created": 1511099660, "timestamp_updated": 1511099660, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36608459": {"recommendationid": "36608459", "author": {"steamid": "76561197969380518", "num_games_owned": 153, "num_reviews": 1, "playtime_forever": 334, "playtime_last_two_weeks": 0, "last_played": 1511383030}, "language": "english", "review": "The ultimate virtual reality DJing experience, about the only thing missing is the crowds!\n\nI can honestly say if you love DJing and you love VR like me then this should be an immediate buy for you. \n\nI've been using it since the first Alpha and it's just got better and better with each update. I can't wait to see what other features come along in time :)\n\n", "timestamp_created": 1511044177, "timestamp_updated": 1511044177, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "36594013": {"recommendationid": "36594013", "author": {"steamid": "76561198025745559", "num_games_owned": 34, "num_reviews": 1, "playtime_forever": 149, "playtime_last_two_weeks": 0, "last_played": 1512921172}, "language": "french", "review": "Pas mal du tout et étant dj je peut faire la comparaison.\nTrès très réaliste, de plus on peut utiliser notre bibliothèque personnel donc parfait, maintenant espérons que les devs. Vont augmenter le contenu avec plusieurs modèles de platines comme des contrôleurs etc......\nEn tout cas je recommande pour ceux qui recherche ce type de jeux.", "timestamp_created": 1511003463, "timestamp_updated": 1511003463, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36591002": {"recommendationid": "36591002", "author": {"steamid": "76561198305263829", "num_games_owned": 34, "num_reviews": 7, "playtime_forever": 52, "playtime_last_two_weeks": 0, "last_played": 1513797879}, "language": "english", "review": "Just bought this for just under £10, had a play on my oculus, works flawlessly.\nGreat job, ive got a pair of Technics SL1210 MKIIs sat behind, ive now also got a pair of Technics SL1200 VRIIs.\nCant wait to have a go again tomorrow with some of my own music.", "timestamp_created": 1510993643, "timestamp_updated": 1510993643, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36576782": {"recommendationid": "36576782", "author": {"steamid": "76561198067754762", "num_games_owned": 141, "num_reviews": 2, "playtime_forever": 43, "playtime_last_two_weeks": 0, "last_played": 1510940208}, "language": "english", "review": "I have never been a DJ myself, but this is a really cool and well polished app that can be used to learn or create your own sessions (you can record the audio).\n\nVery good graphics/design and  intuitive ui. With the the proper enviroment (sound responsive lights/fx) this can be a blast.", "timestamp_created": 1510940091, "timestamp_updated": 1511093548, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "36563205": {"recommendationid": "36563205", "author": {"steamid": "76561198124516461", "num_games_owned": 178, "num_reviews": 55, "playtime_forever": 397, "playtime_last_two_weeks": 0, "last_played": 1513978501}, "language": "english", "review": "Love the whole dj thing but trying to play my own mp3s was a hassle the way you have to put the controller in the crate then use the trackpad to look  through my folder.Also the edition of bpm would be great.This app is revolutionary.", "timestamp_created": 1510887675, "timestamp_updated": 1511222314, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36560925": {"recommendationid": "36560925", "author": {"steamid": "76561198253034813", "num_games_owned": 115, "num_reviews": 7, "playtime_forever": 190, "playtime_last_two_weeks": 0, "last_played": 1512843435}, "language": "english", "review": "Works really (really) well - a must have if you owned Technics and had to give them up (like me, sob) but also a perfect way to learn to mix the real way\n\n", "timestamp_created": 1510875413, "timestamp_updated": 1510875413, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.617074", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36560522": {"recommendationid": "36560522", "author": {"steamid": "76561197975423500", "num_games_owned": 212, "num_reviews": 12, "playtime_forever": 206, "playtime_last_two_weeks": 0, "last_played": 1513453186}, "language": "english", "review": "This works suprisingly well. The 1200's feel pretty accurate (even locking in on 0 pitch a little bit)- and the mixer feels pretty good. If you have ever DJ'd before then you are going to figure this out pretty quickly. It feels pretty natural. Really would love to be able to customize my set up more. Maybe add a 3rd deck or use different types of mixers.\n\nI was using an Oculus not a vive and the controls worked pretty good except for some of the navigating your crate stuff. Its kind of hard picking your track as the anolog stick seems to be sticky or something.\n\nThe only thing this is missing is having the turntables skip because people are dancing too hard and close to the decks. So far this is a pretty fun bed room dj simulator. I'd love to see more in it!", "timestamp_created": 1510873349, "timestamp_updated": 1510873349, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36557225": {"recommendationid": "36557225", "author": {"steamid": "76561198015589746", "num_games_owned": 24, "num_reviews": 2, "playtime_forever": 125, "playtime_last_two_weeks": 0, "last_played": 1514410310}, "language": "german", "review": "Sehr geil umgesetzt. Ein paar Effektgeräte wären noch mega!", "timestamp_created": 1510860629, "timestamp_updated": 1510860629, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36552459": {"recommendationid": "36552459", "author": {"steamid": "76561198027106070", "num_games_owned": 94, "num_reviews": 77, "playtime_forever": 13, "playtime_last_two_weeks": 0, "last_played": 1500947649}, "language": "english", "review": "If you're into vynil, this is your app.", "timestamp_created": 1510844356, "timestamp_updated": 1510844356, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.453960", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "36551213": {"recommendationid": "36551213", "author": {"steamid": "76561198075402136", "num_games_owned": 84, "num_reviews": 12, "playtime_forever": 13, "playtime_last_two_weeks": 0, "last_played": 1510839845}, "language": "english", "review": ":) Cool idea! I'm curious about what's coming next.", "timestamp_created": 1510840050, "timestamp_updated": 1510840050, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.492130", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36549768": {"recommendationid": "36549768", "author": {"steamid": "76561198007341077", "num_games_owned": 217, "num_reviews": 38, "playtime_forever": 26, "playtime_last_two_weeks": 0, "last_played": 1510834285}, "language": "english", "review": "I don't have a clue how to DJ but this is a fun and polished game/app.  I'm sure I'm going to have a real blast in this once I figure out the fundementals of DJing.", "timestamp_created": 1510834582, "timestamp_updated": 1510834582, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.498958", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39506825": {"recommendationid": "39506825", "author": {"steamid": "76561198799175211", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 9, "playtime_last_two_weeks": 9, "last_played": 1516530813}, "language": "turkish", "review": "beklediğim gibi bir program değil o yüzden iadesini yapmak istiyorum teşekkürler şimdi", "timestamp_created": 1516530870, "timestamp_updated": 1516530870, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39502786": {"recommendationid": "39502786", "author": {"steamid": "76561197989432286", "num_games_owned": 149, "num_reviews": 40, "playtime_forever": 41, "playtime_last_two_weeks": 41, "last_played": 1516253775}, "language": "english", "review": "As a former DJ, whom only ever used vinyl - I can say this is pretty close to the real deal. The only issue I have with it, is I am used to slowing down a record by holding the nipple. When you do it in the game, it spins the record. I've done this WAY too many times. \n\nIt definitely gets you the fundamentals!", "timestamp_created": 1516516682, "timestamp_updated": 1516516682, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39490460": {"recommendationid": "39490460", "author": {"steamid": "76561198287780788", "num_games_owned": 25, "num_reviews": 2, "playtime_forever": 173, "playtime_last_two_weeks": 173, "last_played": 1516484160}, "language": "russian", "review": "Отличное приложение !!! Вспомнил былое , когда дома стояли вертушки с пультом )))) Очень прилично все реализовано , хотелось бы новых сцен и конечно же отдельный эффектор на каждый канал !!! в целом очень доволен  !!!", "timestamp_created": 1516473719, "timestamp_updated": 1516473719, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39468260": {"recommendationid": "39468260", "author": {"steamid": "76561198072018798", "num_games_owned": 77, "num_reviews": 2, "playtime_forever": 80, "playtime_last_two_weeks": 53, "last_played": 1516397355}, "language": "german", "review": "Top Programm!\nAls respekt schreibe ich den Review über meine virtuelle Tastatur meines Ocuulus Home 2.0.\nIch bin begeistert und schon sehr gespannt auf das Endprodukt.Ich habe vor 20 Jahren das Auflegen aufgehört.\nMeine Platten habe ich noch und werde Sie nun allr digitalsieren.  Icch wollte immer malwieder anfangen, aber es fehlt heute eunfach der Platz. Dann fand ich das  Programmm hier und mein Traum wird wahr. Tausend Dank für Diese VR App hier. Ich wünschte mir nur noch Efffektproz3ssoren wie b3im Pioneermischpult. Die Optik und Haotik sind 100%ig. Nutze die Touch-Controller der Oculus, Für alle  diedas Plattenauflegen in seiner ursprünglichen Art lieben eine definitive Kaufempfehlung!!!", "timestamp_created": 1516398427, "timestamp_updated": 1516398427, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}}, "query_summary": {"num_reviews": 20, "review_score": 7, "review_score_desc": "Positive", "total_positive": 46, "total_negative": 1, "total_reviews": 47}}
