{"reviews": {"39370905": {"recommendationid": "39370905", "author": {"steamid": "76561198065671461", "num_games_owned": 410, "num_reviews": 11, "playtime_forever": 378, "playtime_last_two_weeks": 378, "last_played": 1516038768}, "language": "english", "review": "Got a very interesting story and characters. As a visual novel, there are lot of dialogue choice to be made with good/evil aligment system provide compelling character roleplaying. This kind of good and bad moral choice is my favourite thing in video games. The MC being a female doesnt compel me into the romance part of the game but as I continue playing kinda like roleplaying as naive good girl. Play throught it until the end of chapter 4 in one sitting. Cannot wait for chapter 5. Maybe will do second playthrought as evil MC.", "timestamp_created": 1516039828, "timestamp_updated": 1516039828, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39321022": {"recommendationid": "39321022", "author": {"steamid": "76561198081587976", "num_games_owned": 46, "num_reviews": 4, "playtime_forever": 753, "playtime_last_two_weeks": 753, "last_played": 1515929030}, "language": "russian", "review": "Отличная игра.\nСюжет взрослый, что очень радует. Нет черного и белого, все характеры многогранные и ситуации сложные. \nПару раз для меня даже были вот это повороты с поведением некоторых персонажей. \nСовет почаще сохраняться, некоторые сцены я переигрывала раз по 5, настолько разные результаты выходили.\nИгр с хорошей любовной линией вообще очень мало, работы biowarу, ну в Divinity 2 была любовная линия, а так пустота на рынке. Поэтому игра очень порадовала.", "timestamp_created": 1515879176, "timestamp_updated": 1515879176, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39303484": {"recommendationid": "39303484", "author": {"steamid": "76561197970496390", "num_games_owned": 146, "num_reviews": 4, "playtime_forever": 701, "playtime_last_two_weeks": 185, "last_played": 1515489768}, "language": "english", "review": "(Note: This review was written after chapter 4's release. If the final fifth chapter impacts this review, I will update it accordingly. I am also a man.)\n\nFemale-driven visual novels have become increasingly common among western audiences. Unfortunately, these games are also peppered with groan-inducing young boys seeking to win the hearts of adolescent girls through affection. Where are the games with dark storytelling and evil men, and why is it taboo for women to fantasize about them? Demonheart wisely accommodates this void with a cast of evil love interests and a thought-provoking dark narrative.\n\nTo understand the nuances of Demonheart, we must trace its origins back to the PC game, Neverwinter Nights. Demonheart originated as a mod, given life as this visual novel. This visual novel is mostly a rehashed story from the mod; however, there are enough new surprises to satisfy returning players, especially since the original mod was never finished.\n\nThe major flaw in transitioning Demonheart from an action role-playing game to a visual novel is the difference in scope. When we subtract the combat and exploration, what's left is a condensed story barely enough to qualify as a short visual novel, clocking in at about ten hours. Regardless, the story expertly weaves a powerful narrative into these limited hours, and the universe the story provides leaves open the possibility for future sequels.\n\nThe protagonist is a beautiful young woman named Bright. She can be anything the player wants, from honest and affectionate to deceitful and cruel. One feature that faithfully makes its transition from Neverwinter Nights is that everything Bright says is produced through the player selecting decision prompts. Typical visual novels only provide these opportunities a few times a game; Demonheart provides hundreds. Admittedly, most of these decisions are an illusion of choice, but because the player won't always know what decisions impact the story, it's suspenseful nonetheless. Bright will be presented a number of evil (or good) opportunities to provide an outlet for a player's dark fantasies while the game monitors her progress with a built-in alignment system.\n\nThe alignment system, unfortunately, feels a bit superficial. In just 20 minutes, the player can max out their choice of alignment. Most games use alignment as a progression system to track the player over an entire narrative, but in Demonheart it feels tacked on to accommodate returning Neverwinter Nights players. Nonetheless, its inclusion is a feel-good ego boost for players to have the peace of mind knowing their good or evil decisions are having an impact.\n\nDemonheart is a dark story, and the weight is carried by its antiheroes, Brash and Raze. Both are potential love interests, imposing their sexual emotions upon Bright. Brash is a powerful and irritable knight, openly disdaining anyone he remotely disagrees with. He's also incredibly sexist and brutally honest about it. Meanwhile, Raze is a demon working from the shadows, whispering dark suggestions into Bright's head and isn't shy about conquering her. Most games driven by female protagonists exhibit bad-boys as basic delinquents; in Demonheart, these bad-boys are genuinely evil men, exhibiting  ruthlessness and sexual perversions uncharacteristic of most female protagonist games.\n\nThese perversions are given further clarity with voice acting. For a small-scale visual novel, I was nervous at its inclusion; voice acting when done poorly can ruin an otherwise great game. The developer wisely invested time into patiently selecting a commendable cast of performers. The voice acting ranges from below average to impressive. The worst is from Bright's mother, who lacks enthusiasm. The best performances, thankfully, are from the main supporting actors, Brash and Raze who perfectly capture their personalities. The two have a unique accent as Brash possesses a rough demanding voice while Raze presents himself as a suave sophisticated playboy. Sometimes, they can deliver a line that falls flat, or perhaps their microphone is too close or far from their face, but it's rare enough to ignore.\n\nThe artwork for the characters and the fictional world they inhabit is both distinct and beautiful. The characters possess a combination of striking eyes with normal human features, possibly inspired from Neverwinter Night's fantasy portrait art. The backgrounds share details from old oil paintings, which is a pleasant comparison to the story's dark fantasy setting. Some early critics shared animosity at early impressions of the game's artwork, but after seeing the totality of the artistic marriage, I am convinced the art is successful.\n\nOne major omission from the art in contrast to its Neverwinter Night's mod is the sex. The mod was not under sexual scrutiny from Steam, allowing for a different depiction of the characters, especially Brash. That version of Brash was a sex-craved addict who practiced what he preached, consequently making him more unpredictable and dangerous. By comparison, Brash in the visual novel is still violent, but stops short at having sex, as if he knows he's being monitored by the ratings board. Not even the protagonist calling him \"queer\" impacts Brash, for under the watchful eye of parents, Brash knows his hands are tied as he's met his match. Oh, but don't worry, it's totally fine if he kills people, right?\n\nDemonheart may lack in explicit sex, but it still provides an unforgettable unique story showcased by its powerful and sexually suggestive cast of antiheroes. It explores a dark female-driven narrative appealing to both male and female audiences, and succeeds better than some had originally thought at the transition from a Neverwinter Nights mod to full-fledged visual novel. Oh, and Lamb, if you're reading this, write a sex scene into the chapter 5 ending. Cut to black if you have to. \n\n[b]Final Score: 9/10.[/b]", "timestamp_created": 1515835585, "timestamp_updated": 1515842605, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39169254": {"recommendationid": "39169254", "author": {"steamid": "76561198179360631", "num_games_owned": 119, "num_reviews": 3, "playtime_forever": 265, "playtime_last_two_weeks": 265, "last_played": 1515373381}, "language": "english", "review": "I have played through chapters 1-4 (Chapter 5 not released at the time I am posting). The story is very immersive, the people are all very interesting. I love the MC and all of the options. The art is absolutely gorgeous, the voice acting is also supremely on point. It's tough to wait until the full release; I was so excited when I saw it in development, and managed to delay until this point but even though I wasn't able to complete it yet, I am still completely in love. Looking forward to Ch 5!!", "timestamp_created": 1515373834, "timestamp_updated": 1515373834, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.517045", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39134536": {"recommendationid": "39134536", "author": {"steamid": "76561198195175214", "num_games_owned": 223, "num_reviews": 2, "playtime_forever": 1169, "playtime_last_two_weeks": 735, "last_played": 1515688810}, "language": "english", "review": "Even this is my first review I just have to do it and thank the developer for this game.\n\nI am a fan of VN`s and was very interested in this one because of the different art style. (Women look like women - I really appreciate that.)  I wasn`t quite sure if I`d get into the story though. \nNow after finishing my first playthrough of the yet released 4 chapters I can say that i really love this VN. \nThe character graphics are 100% suitable for their personalities, the story is great and against all my fear got me from the beginning. There are many choice options to make which left me asking myself quite a few times if I have done the right one to trust a specific character. \n\nI`m really looking forward to the last chapter.", "timestamp_created": 1515281706, "timestamp_updated": 1515281706, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38998187": {"recommendationid": "38998187", "author": {"steamid": "76561198152150613", "num_games_owned": 8, "num_reviews": 1, "playtime_forever": 899, "playtime_last_two_weeks": 242, "last_played": 1516077157}, "language": "english", "review": "11/10, comes with your own lecherous barbarian who will happily beat people up for you. \n\nThat's true love right there.\n\n\nI am lazy about reviews, but this game deserves it. Seriously looking forward to Chapter 5 and any future works from this developer. One of the most engaging visual novel/otome/dark fantasy games I have played.", "timestamp_created": 1514951693, "timestamp_updated": 1514951693, "voted_up": true, "votes_up": 1, "votes_funny": 3, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38977129": {"recommendationid": "38977129", "author": {"steamid": "76561198092338939", "num_games_owned": 22, "num_reviews": 1, "playtime_forever": 365, "playtime_last_two_weeks": 0, "last_played": 1514668935}, "language": "english", "review": "For me: \n+ Riddles - unnecessary. \n+ Storyline - very interesting. \n+ Artwork - great. \n\n\n", "timestamp_created": 1514906966, "timestamp_updated": 1514906966, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.539295", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38887094": {"recommendationid": "38887094", "author": {"steamid": "76561198139800225", "num_games_owned": 47, "num_reviews": 4, "playtime_forever": 186, "playtime_last_two_weeks": 0, "last_played": 1514602991}, "language": "english", "review": "Wow! This game, so far, is amazing~\nUnlike other VNs where the main character is kind of a bystander, passive and silent, the MC here has the option to respond to just about everything. It's immersion is amazing, because it does feel as if you're in a conversation with the other characters, and not just someone who speaks once every 15 minutes.\nThe atmosphere that is set up by the vivid imagery is amazing as well, and the story is gripping. \n\nThe only bad thing I can say is that I want more! The story is so immersive that I just don't want it to end. \nI'm cautiously optimistic for the final chapter", "timestamp_created": 1514692128, "timestamp_updated": 1514692128, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.583333", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38884734": {"recommendationid": "38884734", "author": {"steamid": "76561198800742507", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 1027, "playtime_last_two_weeks": 256, "last_played": 1515978121}, "language": "english", "review": "Had been \"um-ing\" and \"ah-ing\" about this game for a bit after reading the reviews, but Winter Sale and Chapter 4 being released I thought \"ooh... go on then... and bought this and another game that had piqued my interest. \nThis is EXACTLY the VN i've been looking for! A dark fantasy adventure with a MC who can actually have a character! Thank you RollingCrown!\nI thought I'd try an hour of this, but that idea went straight out of the window and one chapter turned into the first three...\nI love the story, the characters and the lore of this game, can easily see me replaying as \"other\" Bright to pursue different angles and characters.\n I liked the Demon speech anagrams, though there was one that I spent a few minutes looking at before going \"GOT IT\" and earning a bemused look from the room.\nOther than the writing i really liked the artwork and the sound. It isn't a feature of many of the VN's that I have read, so I found the partial VOs a nice touch.\n\nReally looking forward to playing more of the game!", "timestamp_created": 1514686016, "timestamp_updated": 1514734549, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.525901", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38881305": {"recommendationid": "38881305", "author": {"steamid": "76561198261880221", "num_games_owned": 214, "num_reviews": 15, "playtime_forever": 1724, "playtime_last_two_weeks": 132, "last_played": 1515387523}, "language": "english", "review": "Demonheart is a well thought out VN with a gripping story and solid background. As far as the reviews of it being short because of modular releases, admittedly I had the same notion, but with a variety of choices based on personality the story turned out more impressive with each new run uncovering new subtle hints and teases of information.\n\nMost other VNs I have played are usually one love interest at a time, just an A or B option and no deviance from the main experience. But what I have discovered instead with Demonheart is that it is so fluid in presentation. You can build multiple relationships at once, which can bring some interesting reactions from others. A few times along the way, there are chances to unlock a portion of story, almost like a side quest, that seem to alter the game in a significant way. Conversations more at the pace you want them, with as little or as much interaction as you choose.\n\nThis is worth different playthroughs to try and uncover a rich and compelling story full of betrayal and magic. A labor of love that has proven unique and so thoughtful that it is so much more than just reading a romance novel between MC and love interest. \n\n[spoiler]And plenty of QTs[/spoiler]", "timestamp_created": 1514677694, "timestamp_updated": 1514822140, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38828854": {"recommendationid": "38828854", "author": {"steamid": "76561198176482611", "num_games_owned": 115, "num_reviews": 4, "playtime_forever": 1064, "playtime_last_two_weeks": 0, "last_played": 1514571753}, "language": "english", "review": "Kept me captivated for the entire playthough, I am now eagerly waiting for chapter 5.", "timestamp_created": 1514572165, "timestamp_updated": 1514572165, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38800640": {"recommendationid": "38800640", "author": {"steamid": "76561198061162115", "num_games_owned": 158, "num_reviews": 3, "playtime_forever": 889, "playtime_last_two_weeks": 0, "last_played": 1514922895}, "language": "hungarian", "review": "Whoo hoo! This game is amazing! I cant wait the next chapter!\nI enjoyed every moment of it. The conversations, and the voice acting are awesome.\nThank you! Please keep it going! :)", "timestamp_created": 1514508050, "timestamp_updated": 1514508050, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525862", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38762698": {"recommendationid": "38762698", "author": {"steamid": "76561198127013921", "num_games_owned": 34, "num_reviews": 1, "playtime_forever": 622, "playtime_last_two_weeks": 0, "last_played": 1514434695}, "language": "english", "review": "I love this game! I got in on sale because who doesn't love sales but dear lord I would pay so much more for it! It is absolutely worth every cent. The new chapter just came out and it is spectacular. I adore all the characters, and I love the way Bright thinks! 10/10 would recommend!", "timestamp_created": 1514427105, "timestamp_updated": 1514427105, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38753121": {"recommendationid": "38753121", "author": {"steamid": "76561198020978985", "num_games_owned": 122, "num_reviews": 2, "playtime_forever": 1552, "playtime_last_two_weeks": 0, "last_played": 1514705848}, "language": "english", "review": "Absolutely fantastic game", "timestamp_created": 1514407684, "timestamp_updated": 1514407684, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38682739": {"recommendationid": "38682739", "author": {"steamid": "76561198271303006", "num_games_owned": 35, "num_reviews": 4, "playtime_forever": 313, "playtime_last_two_weeks": 0, "last_played": 1514347084}, "language": "english", "review": "OMG, where's the next chapter!? I need it!! Very good game, loved the ambience and the style of the narrative!", "timestamp_created": 1514260646, "timestamp_updated": 1514260646, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38453002": {"recommendationid": "38453002", "author": {"steamid": "76561198797394474", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 270, "playtime_last_two_weeks": 0, "last_played": 1513769925}, "language": "english", "review": "I've just bought it today & completed the 1st playthrough in one sitting. This game is extremely captivating, and I can't wait until the updates for the last 2 chapters are out. \n\nSplendid art, animation and storyline! It's such a satisfying game that I would totally love to replaying for multiple more times in this Christmas season <3!\n\nI hope to recommend the developers to avoid making MC have inner thoughts based on her character only. There were scenes which I made Bright act & think very lustily towards Brash, but when her default thoughts appeared, they kinda contradicted the options I chose :(. \n\nBesides that, I love MC to the core & obviously Brash too for now :D", "timestamp_created": 1513770433, "timestamp_updated": 1513942104, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38451179": {"recommendationid": "38451179", "author": {"steamid": "76561198121510755", "num_games_owned": 68, "num_reviews": 13, "playtime_forever": 374, "playtime_last_two_weeks": 140, "last_played": 1516107050}, "language": "english", "review": "I loved this game, despite only one play through. Very excited for the rest of the game to be released, and then play through it differently.", "timestamp_created": 1513765304, "timestamp_updated": 1513765304, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38404461": {"recommendationid": "38404461", "author": {"steamid": "76561198069873983", "num_games_owned": 46, "num_reviews": 4, "playtime_forever": 1298, "playtime_last_two_weeks": 0, "last_played": 1514361650}, "language": "english", "review": "This is a great game. The artwork is beautiful, there are a ton of choice options and the story is dark and interesting. I've been enjoying the story and can't wait for the next two chapters. \n", "timestamp_created": 1513620926, "timestamp_updated": 1513620926, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38302768": {"recommendationid": "38302768", "author": {"steamid": "76561198014695405", "num_games_owned": 87, "num_reviews": 1, "playtime_forever": 1183, "playtime_last_two_weeks": 0, "last_played": 1514445996}, "language": "english", "review": "This game is a moral mind job.  I love it.  I just wish they updated on a more regular basis... (adding chapters regularly)", "timestamp_created": 1513263640, "timestamp_updated": 1513263640, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37948940": {"recommendationid": "37948940", "author": {"steamid": "76561198120696644", "num_games_owned": 14, "num_reviews": 3, "playtime_forever": 4731, "playtime_last_two_weeks": 839, "last_played": 1515841395}, "language": "english", "review": "I stayed up very late playing this game. It's got a good story, good art and it has such a gritty tone. And so far it's pretty cool because you have to figure out who to trust. I've noticed that the \"nicer\" ones often are the most shady in this game. I highly recommend purchasing and playing this game! Some of the voice acting is mediocre but there are some characters who REALLY have great voice actors. Seriously, this game is worth playing, get it!", "timestamp_created": 1512035546, "timestamp_updated": 1512035546, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37605207": {"recommendationid": "37605207", "author": {"steamid": "76561198094188712", "num_games_owned": 113, "num_reviews": 1, "playtime_forever": 266, "playtime_last_two_weeks": 63, "last_played": 1515633898}, "language": "english", "review": "This game was a hidden gem for me! It didn't think it would be that good as there's quite a lot of these on steam but after I started playing I really got sucked into the story!\n\nAs there's only three chapters out so far I'd give it like an 7/10 recommend.\n\nThe story is interesting and keeps you entertained. The artwork is nice and the characters are too. There are plenty of options when responding to events in the game and it actually feels like most of your choices matter. A lot of these games make it so obvious that you need to select specific answers in order to get very specific outcomes, but with this one I was able to play how I wanted to and have the story end up the way I wanted without having to follow any kind of guide and on my first play through; Maybe I was just lucky though. I like that not all answers affect your character's personality which adds a bit more depth to the story while giving more flexibility in how you choose your answers.\n\nA few wishes for the game though, would be:\n\n*A longer story. \nThis isn't to say I'm not happy with the length of the chapters because they are quite long and fleshed out but I don't think that five chapters is enough for what you pay compared to other games of this kind, I know some of those games are dirt cheap and the good ones can charge a LOT but they are pretty good quality and I see that kind of potential here. I bought the game with 20% off and feel like it was quite worth it at that price ($15). In saying that I would be happy to pay around $30 for ten chapters each with the same chapter length that is already there, realistically. But that's just my own opinion.\n\n*More characters that impact the story would definitely be a plus.\nHaving only two characters that it seems like you can romance doesn't seem like quite enough. Maybe another two would make it more interesting but you'd need to be careful not to let this take away from each character's story/personality.\n\n*More CG's in the story.\nYou really only get one or two good CG's in the three chapters that you can play. I'm not expecting to get much more because there is only supposed to be five chapters coming out and this is really disappointing. The artwork in this game is good and the creators would definatley benefit from putting more CG's into the game.\n\nSo far I recommend buying this only with the sale until all the chapters come out at least (:\n\n\n\n", "timestamp_created": 1511659619, "timestamp_updated": 1511659619, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37422533": {"recommendationid": "37422533", "author": {"steamid": "76561198082543313", "num_games_owned": 117, "num_reviews": 21, "playtime_forever": 2094, "playtime_last_two_weeks": 0, "last_played": 1514222649}, "language": "english", "review": "seduces people as much as possible.\n\nI am bad kitten.hehehe", "timestamp_created": 1511560079, "timestamp_updated": 1511560079, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.444444", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36748946": {"recommendationid": "36748946", "author": {"steamid": "76561198044436766", "num_games_owned": 229, "num_reviews": 6, "playtime_forever": 605, "playtime_last_two_weeks": 0, "last_played": 1514332849}, "language": "english", "review": "I was unsure of this game at 1st but found the story captivating and am eagerly awaiting 4 the rest of the chapters.", "timestamp_created": 1511378413, "timestamp_updated": 1511378413, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36411857": {"recommendationid": "36411857", "author": {"steamid": "76561198145638592", "num_games_owned": 30, "num_reviews": 6, "playtime_forever": 657, "playtime_last_two_weeks": 0, "last_played": 1514272780}, "language": "english", "review": "The storyline is what hooked me. I didn't really know what to expect out of this game. The writing and artwork is amazing and giving it a chance was a right move.", "timestamp_created": 1510291955, "timestamp_updated": 1510291955, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36326134": {"recommendationid": "36326134", "author": {"steamid": "76561198187190935", "num_games_owned": 18, "num_reviews": 1, "playtime_forever": 2131, "playtime_last_two_weeks": 2, "last_played": 1516221075}, "language": "russian", "review": "Хорошая игра, сделанная тщательно и с душой. Не думала, что так понравится. Характеры прописаны хорошо, сюжет не избит. Жаль не завершена и довольно короткая. Кое что еще в работе, как понимаю. В целом оцениваю крайне положительно, о покупке не жалею. Если кого беспокоит английский (что меня наоборот очень устраивает) - у вас всегда есть время на перевод, если нужно, в целом это не должно стать проблемой.", "timestamp_created": 1509988591, "timestamp_updated": 1509988591, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36252340": {"recommendationid": "36252340", "author": {"steamid": "76561198312141566", "num_games_owned": 18, "num_reviews": 1, "playtime_forever": 2925, "playtime_last_two_weeks": 0, "last_played": 1514924374}, "language": "english", "review": "I absolutely love this game, art work is fabulous. Voice overs are great, although it's a shame it is not all the way through. I know it's due to money.The story has me gripped from the start, i love the dark side of novels,But sad to see the adult content taken out. There are lots of choices to make, i think her mum as some weird dress sense lol. I just hope there is a good love ending for Sir Brash too. Over all i really love it well done. I would deffinately recomend this game .", "timestamp_created": 1509743811, "timestamp_updated": 1509927208, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.524166", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36225510": {"recommendationid": "36225510", "author": {"steamid": "76561198141331346", "num_games_owned": 87, "num_reviews": 3, "playtime_forever": 563, "playtime_last_two_weeks": 0, "last_played": 1514198406}, "language": "english", "review": "I love it, worth every penny and I need next chapter like yesterday", "timestamp_created": 1509652536, "timestamp_updated": 1509652536, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.581994", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36216051": {"recommendationid": "36216051", "author": {"steamid": "76561198134651579", "num_games_owned": 24, "num_reviews": 1, "playtime_forever": 199, "playtime_last_two_weeks": 30, "last_played": 1516020625}, "language": "english", "review": "The game is extremely fun so far! I am so sad that only three chapters are out and can honestly not wait for the next one. I adore Raze already and I love the challenges that the game provides through word scrambles for Demon Language.  I sorta had Brash kill the old man though :o. Ah well, I hope it doesn't come back in he future and bite me in the butt. I can honestly sit and replay this game again and again just because of how interesting the different responses get. Love it! <3", "timestamp_created": 1509626311, "timestamp_updated": 1509626311, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502306", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36096557": {"recommendationid": "36096557", "author": {"steamid": "76561198011810582", "num_games_owned": 394, "num_reviews": 39, "playtime_forever": 289, "playtime_last_two_weeks": 0, "last_played": 1514239406}, "language": "english", "review": "This clearly falls under the category guilty pleasures. I was not entirely sold on episode 1 as the pace was too fast for me and there was a lot of exposition, which could have been conveyed more nicely, but episode 2 and 3 actually really make up for it. The writing is pretty good as well as the music and most importantly the graphics (finally men look like men and women like women and not this anime teenager bullshit). \n\nReally looking forward to Episode 4 and 5 and the maybe sequel ;)", "timestamp_created": 1509244199, "timestamp_updated": 1509244199, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.516660", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36091761": {"recommendationid": "36091761", "author": {"steamid": "76561198040732698", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 176, "playtime_last_two_weeks": 0, "last_played": 1509040196}, "language": "english", "review": "I'm very sad to say I didn't enjoy this as much as I wanted to. Yes, the artwork is absolutely gorgeous, but I did not come for pretty pictures, I came for the story - and almost everything that once captivated me so much about the story is not there now. All of the darker adult scenes from the NWN modules upon which it is based have been removed, some plots have been completely changed, and many parts have been removed altogether, with basically nothing new added to replace them. As far as VNs go, this is also very short - the third part ends approximately at the middle point of Chapter One of the NWN modules, and with only two chapters remaining I'm not hopeful a lot more story will be added. It feels like the plot has barely started and yet is already nearing its conclusion. The gameplay itself had a lot of potential though, the word scramble puzzles were a neat idea and I did like those. Overall though it simply was not what I had hoped for, and I'm really crushed...", "timestamp_created": 1509228753, "timestamp_updated": 1509312441, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.504065", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36050385": {"recommendationid": "36050385", "author": {"steamid": "76561198086400790", "num_games_owned": 56, "num_reviews": 13, "playtime_forever": 764, "playtime_last_two_weeks": 0, "last_played": 1514233397}, "language": "german", "review": "Ich habe lange überlegt, ob ich das Spiel kaufen soll oder nicht. Kurz zusammengefasst: Es lohnt sich! Denn Demonheart ist wunderschön gezeichnet und die Entscheidungen, die man im Spiel trifft, nehmen Einfluss auf die Persönlichkeit des Charakters, den man spielt (eine Frau übrigens, was für mich ein weiterer Pluspunkt ist). Hinzu kommen ein toller Soundtrack und eine spannende Story. Gerade im Sale eine lohnenswerte Investition!", "timestamp_created": 1509123457, "timestamp_updated": 1509295608, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36014348": {"recommendationid": "36014348", "author": {"steamid": "76561198046327948", "num_games_owned": 105, "num_reviews": 4, "playtime_forever": 821, "playtime_last_two_weeks": 0, "last_played": 1514230112}, "language": "english", "review": "I highly recommand this game for any Visual Novel like fans.\nThe graphic are simply gorgeous, the story is interesting and can be shaped in many ways.\nYou'll only get yourself wainting to know more or what will happen.\n\nOnly downside is having to wait for the other chapters...but still feel it's worth it :)", "timestamp_created": 1509027650, "timestamp_updated": 1509027650, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.524166", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35875127": {"recommendationid": "35875127", "author": {"steamid": "76561198071522894", "num_games_owned": 31, "num_reviews": 1, "playtime_forever": 1968, "playtime_last_two_weeks": 0, "last_played": 1514518324}, "language": "german", "review": "Ich bin so froh, dass ich mir ein Herz gefasst und den Kauf getätigt habe. \n\nEs hätte zwar für meinen Geschmack ein bißchen günstiger sein können, aber ist wirklich ein klasse Spiel. \nLeider bis jetzt nur als englische Version zu spielen, aber war für mich persönlich kein Problem. Auch die Worträtzel waren gut im Englischen zu meistern. \n\nDie Story fand ich bis jetzt unheimlich spannend und ich bin schon so neugierig wie es wohl weiter geht. Am Anfang war ich etwas skeptisch, aber am Ende von Kapitel 1 dachte ich: \"....Was zum......Ähm.......WAAAAAAS, ist das euer Ernst?!?! Ok, ich muss jetzt unbedingt raus finden was da eigentlich abgeht!!! Wer ist Freund, wer Feind? Warum, wieso, weshalb usw. Wie soll ich da nur die richtige Entscheidung treffen?!\"\n\nJa, man darf selbst Entscheidungen treffen und anscheinend wirken die sich tatsächlich auf den eigenen Charakter und das Verhalten der anderen Charaktere aus, juhuuuu!\n\nIch persönlich würde dieses Spiel jedem empfehlen, dem es bei solchen Spielen um eine gute spannende Story geht. Ich hoffe auf jeden Fall, dass es mehr als 5 Kapitel werden :)", "timestamp_created": 1508538117, "timestamp_updated": 1508538117, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35655642": {"recommendationid": "35655642", "author": {"steamid": "76561198000349665", "num_games_owned": 57, "num_reviews": 3, "playtime_forever": 2910, "playtime_last_two_weeks": 2552, "last_played": 1516385457}, "language": "english", "review": "This is a really fun and entertaining story! The voice actors are awesome. So glad that I stumbled upon this one.", "timestamp_created": 1507800284, "timestamp_updated": 1507800284, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.518941", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35627254": {"recommendationid": "35627254", "author": {"steamid": "76561198103328664", "num_games_owned": 75, "num_reviews": 3, "playtime_forever": 1445, "playtime_last_two_weeks": 0, "last_played": 1514249276}, "language": "english", "review": "Love it !!! Can't wait for the next chapters.", "timestamp_created": 1507674753, "timestamp_updated": 1507674753, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.493026", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35516718": {"recommendationid": "35516718", "author": {"steamid": "76561197982625233", "num_games_owned": 245, "num_reviews": 14, "playtime_forever": 417, "playtime_last_two_weeks": 0, "last_played": 1507289921}, "language": "english", "review": "Overall I must recommend this title, but their are some minor negatives (one in particular) that do keep me from giving it  a 100% recommendation.  I would have to put my recommendation at more like 85%.  Many of the other fine reviews on here point out many of the game's strong points: world crafting, character crafting, beautiful set pieces, etc. etc.  All of this is true.\n\nHowever, as the game is only come out with 3 out of the 5 chapters at the time of this review, it does come off, at least to me, as being a little short for the $20 price tag.  This problem is made even more noticeable with the absence of any effective form of \"fast forward\" mechanic; which, effectively, limits re-playability.  You can get many more hours of entertainment out of some of the other fine VNs on Steam for a lot less money.  That being said, the last 2 chapters are coming, and hopefully they will bring a LOT more story and value to the table with them.\n\nBut, all of that being said, if you've got the extra cash, and like DARK VNs, this is a great way to spend an afternoon.\n", "timestamp_created": 1507291295, "timestamp_updated": 1507291295, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.597784", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35140914": {"recommendationid": "35140914", "author": {"steamid": "76561198049426667", "num_games_owned": 359, "num_reviews": 29, "playtime_forever": 476, "playtime_last_two_weeks": 0, "last_played": 1504490422}, "language": "english", "review": "Oh man, I am so glad I backed this game on IndieGoGo! I'm always a bit hesitant to back games like that, but this was definitely a winner. \n\nWhere to start? \n\nPros!\n- I love the fact that there are numerous choices and extremely frequent at that! Most VN games have you make a choice once every 20 min of real time continuous game play, which can get a bit boring after a while when it's all reading and less choosing. I like having more choices, but I find myself rewinding a lot just to see how they all play out!\n- Love that you can really truly build your own character with this game. You are not a cookie cutter docile doormat for everyone to tromp about, like in several other VN titles. \n- Sexy mansprites, mmm.\n- Just gorgeous art all around.\n- Music is nice and appropriate for each setting; same with the sound effects.\n- Enjoyable cryptographs to solve (I think that's what they are called? Or word jumbles?)\n- Characters are memorable and great personality-wise.\n- Lots of fun twists in this game, definitely expect the unexpected, and I am sure more to come!\n- Devs actually releasing chapters when they say they will and keep their promises unlike other devs... this makes me trust them and want to buy more games from them in the future (keep up the awesome work!)\n- If you backed this on IndieGogo, they sent out little padlocks with characters on them depending on the level of support... so now I have a padlock with a sexy demon man on it to bedazzle my...uh... anything that could use a demonman padlock! xDDD\n\nThe only \"cons\" right now...and I say that loosely because some of these aren't really cons, but just either room for improvement or it's such a different flavor that I am not used to it yet... :-x\n- Have to wait for each chapter to come out. (Can't wait! AHHH!)\n- I had no idea that I was supposed to be solving a puzzle to \"translate\" the demon language in this game. (Sorry if that is a spoiler... but yea, they did not really explain that at all, or maybe it was explained and I just missed it somehow? But I constantly kept clicking \"give up\" because I didn't understand what the heck was I supposed to do.)\n- Some of the outcomes of choices don't really make any sense... but at the same time, this could be considered a \"pro\" since oftentimes VNs are too predictable...\n- Voice acting can be a bit...uh, rough at times. But hey, I would rather have this than no voice acting so I guess I can't complain too much. The voice acting helps me keep my attention focused (I have really bad ADHD so it can be tricky to stay focused even with an amazing story!)\n- Knowing exactly what happens when you pick something in terms of stat alignment is causing me to rewind and skew my choosing a bit... (e.g. \"oh crap that made me +1 evil, I wanted +1 tact instead!\" *savescums* LOL) One might argue this is good in the sense that you can really tailor your character to your own liking but I wish there was an option to toggle it off just to have a total blind playthrough...\n\n\nI plan to update this review as they release the remaining chapters. Until then, I will probably go and replay the available sections just to get all the 'chievos. ;-3", "timestamp_created": 1506127815, "timestamp_updated": 1506128435, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.616835", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35029937": {"recommendationid": "35029937", "author": {"steamid": "76561198016997376", "num_games_owned": 107, "num_reviews": 4, "playtime_forever": 1303, "playtime_last_two_weeks": 0, "last_played": 1505608826}, "language": "english", "review": "And here I thought only Japan could do a good Otome type game... This is a rare gem to the VN Genre and I can't wait for the new chapters. For once, a female protagonist who doesnt feel like a weak useless babe in the woods.", "timestamp_created": 1505672210, "timestamp_updated": 1505672210, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.502306", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34942312": {"recommendationid": "34942312", "author": {"steamid": "76561198418624645", "num_games_owned": 6, "num_reviews": 1, "playtime_forever": 680, "playtime_last_two_weeks": 0, "last_played": 1514584506}, "language": "english", "review": "Lets just say I bought this game three and a half hours ago and i couldn't stop the game till i got to the to be continued point. There are three chapters for now there are supposed to be two more released soon. Demonheart is a story game based on your desissions and multiple out comes. I look forward to the upcoming chapters to see what happens to our heroine (or she could even be a villian based on your desissions) Bright. this game was worth the money paid to play it.\n\nreviewed a few months ago but i am still waiting for a new chapter.", "timestamp_created": 1505363800, "timestamp_updated": 1511476875, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.525901", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34917360": {"recommendationid": "34917360", "author": {"steamid": "76561198014646887", "num_games_owned": 408, "num_reviews": 4, "playtime_forever": 744, "playtime_last_two_weeks": 0, "last_played": 1514371336}, "language": "russian", "review": "Ненавижу писать обзоры, но уж очень понравилась игра. И уж очень хочется, чтобы у игры появился еще один положительный обзор.\n\nНе буду излишне растекаться мыслью по древу, поэтому кратко выделю для себя плюсы этой игры:\n\nНетривиальный, \"взрослый\" сюжет. Это вам не сказочка. Игра одновременно увлекающая, и гнетущая, и жестокая. Жестокая, прям до реализма! И этим и цепляет. Здесь нет надуманной жестокости - жестокость не добавлена ради жестокости. Тут она органично вписывается.  \n\nВариативность ответов. Действительно получается отыграть того, кого хочется. 10 из 10! И тебе не обязательно играть за глупую несчастную овечку.\n\nПерсонажи. Все яркие личности. Мнение об одних и тех же героях постоянно меняется. Потому что они не бездушные картонки. Мотивация, характер и история жизни продуманы очень хорошо.\n\nАнтураж. Мир не особо какой-то уж оригинальный, но прописан хорошо. \n\nДиалоги. О боги. Какие тут диалоги! Не вымученные! Ты читаешь и веришь... что это говорят реальные люди!\n\nАрты. Задники божественны.\n\nCG. Мало! Слишком мало! Хочу больше =( Но CG с Brash...ах…это было красиво, очень красиво! lolol\n\nАнимация. Очень качественно выполнена. Не могла оторвать взгляда.\n\nМузыка. Заворажиает. Я б купила.\n\n\nМинусы:\nОзвучены не все диалоги. А как было бы круто =(\n\nТак медленно выходит. Пожалуйста, выпускайте скорее.\n\nИтог. 9.5 из 10! Озвучьте все диалоги, и моя 10 ваша! Я б за озвучку даже бы доплатила!\n\nP.S. Не уверена, прочтет ли это разрабочтик, но хочу сказать... что игра меня безумно увлекла. Выпускайте поскорее другие главы! И создавайте еще игры! Для меня эта новелла на уровне японских. А они-то мастодонты!\n\nСказала, что не буду растекаться мыслью... УУППС. Кончаю, страшно перечесть!", "timestamp_created": 1505300823, "timestamp_updated": 1505313480, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.591216", "comment_count": "3", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34877640": {"recommendationid": "34877640", "author": {"steamid": "76561198250656498", "num_games_owned": 7, "num_reviews": 2, "playtime_forever": 724, "playtime_last_two_weeks": 0, "last_played": 1514208006}, "language": "english", "review": "Addicting game, with intriguing characters and plot! I just love how main character's development and path is up to the player's choices. Lots of replayability dependinf on MC's different reactions. Can't wait for the next chapters for more choices, character built and moments with the RO's!\nI just wish the chapters were longer, but apart from that I totally recommend it!", "timestamp_created": 1505111169, "timestamp_updated": 1505111169, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502306", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34645263": {"recommendationid": "34645263", "author": {"steamid": "76561198089295005", "num_games_owned": 47, "num_reviews": 1, "playtime_forever": 835, "playtime_last_two_weeks": 0, "last_played": 1514331983}, "language": "english", "review": "Honestly, I'm just upset this game isn't finish, specially because I am the kind of person who likes to end one single route at a time. \n\nThe game is really entertaining, and well, there isn't much to say that hasn't been already say in the rest of reviews. \n\n100% recommended.\n\nOk, so now I have finish chapter 4 as well, and again, I am AMAZED with this visual novel. The characters are all very engaging, and honestly? All the routes are very interesting. \n\nAfter finishing this chapter, I finally gave to temptation and started an evil route, and oh boy, is it not good. I wasn't sure at first, since I usually feel bad playing evil character, but god, here is really fun. Probably because most of the people in the game have done something to screw you over, so getting the chance to actually kill them feels damn good. \n\nSpoiler of Brash romance on chapter 4 ahead.\n\nAlso, note that if you are romancing Brash, when you are in Ravina's dungeon, what he says to you changes slightly depending on your actions. In my first route (good Bright), he says \"you are perfect for me, good and innocent\", which is cute, but if you are evil and you killed Mark, he says \"my beautiful little murderer, I would cover every one of your crimes\", and I honestly thought he was adorable? Like ???!!! I just love how he loves you as long you are good with him? And also, how he can't believe you care for him, and how if you say you love him he says \"you are killing me\". The angst is strong here, and I am an angst sucker, so I am all in in this train boys and girls. \n\nEND OF SPOILERS\n\nSo, anyway, now I CAN'T wait for chapter 5, I will need to find something to occupy myself for at least 3 months... The wait is going to be LONG, but for sure is going to be worthy as hell.", "timestamp_created": 1504217037, "timestamp_updated": 1514238410, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.583576", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34478796": {"recommendationid": "34478796", "author": {"steamid": "76561198063405125", "num_games_owned": 14, "num_reviews": 1, "playtime_forever": 1482, "playtime_last_two_weeks": 75, "last_played": 1515522874}, "language": "english", "review": "[b] The game [/b]\n\n-Great to roleplay as you desire. The characters will react to Bright based on how you shape the MC.  \t     \n                 \n  - World building is amazing, as someone else mentioned in the review here it does feel a bit like a Bioware universe.\t                                 \n\n  -The voice actors did a great job; made me wish that the whole vn was voiced :D    \n\n -I love the visuals, it's different than the generic otome art. But then again it's no wonder since the writing is also different than what otome games have to offer. \t\t\n\t\t\t\t\t\t\t\t                                                                       \n -The small in-game animations are very adorable and add to the overall immersion. \t\n\n  - Though I like the quality of each chapter, I wish they were longer.\n                 \n[b] The characters [/b] \n\n-Great cast of interesting characters. I don't think anyone had tried introducing surprisingly likeable yet outright evil characters in their visual novels. \t\n\t\t\t\t\t\t\t\t\t                                                                                    -Sir Brash is what I like to call the ''antipaladin'' archetype character. He does, however, show some knightly features if you play your cards right.\n \t\t\t\t\t\t\t\t\t\t                                                                               -Raze is the Mephisto to your Faust, with a dash of possessive affection, which you get to see if you play a bit with the dialogue options. \n\t\t\t\t\t\t\t\t\t\t\t                                                                                       - I like the chemistry between the Mc and the other characters. Bright is a great female protagonist, even if you play her as a 'good', naive girl. She manages to come out as not being annoying, like how most vn female protagonists kinda are to me.\n\n Needless to say I can't wait for the rest of the chapters.  <3", "timestamp_created": 1503658799, "timestamp_updated": 1503658981, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.525901", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34455653": {"recommendationid": "34455653", "author": {"steamid": "76561197996779420", "num_games_owned": 225, "num_reviews": 2, "playtime_forever": 1972, "playtime_last_two_weeks": 0, "last_played": 1514568530}, "language": "english", "review": "i am enjoying this game so far, whilst the chapters felt a little short, they were really good in my opinion, plenty of choices in each chapter, a few anagrams, interesting characters, the storyline is great, it was worth what i paid for it, now i wait for the last two chapters to come so i can find out where my character goes from here, also i love how i can be an obnoxious jerk in game if i want", "timestamp_created": 1503565341, "timestamp_updated": 1503565341, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.535052", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34436223": {"recommendationid": "34436223", "author": {"steamid": "76561198151932678", "num_games_owned": 38, "num_reviews": 5, "playtime_forever": 2671, "playtime_last_two_weeks": 0, "last_played": 1514803882}, "language": "english", "review": "This game is awesome! I can surely say that this game will appeal to all fans of dark fantasy novels. Previous games could not get me so carried away like this game. The plot is incredibly fascinating and unusual. I admire music and characters. The most beautiful thing for me is the voices of Mr. Brash and Raze. I really look forward to the next chapter!\nWith love from Russia :3\n", "timestamp_created": 1503489206, "timestamp_updated": 1503489206, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.549303", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34429018": {"recommendationid": "34429018", "author": {"steamid": "76561198073013057", "num_games_owned": 114, "num_reviews": 9, "playtime_forever": 1641, "playtime_last_two_weeks": 1, "last_played": 1515705373}, "language": "english", "review": "Are you searching for a game not only with an intrincate story, but also a well built universe with complex - AND ADORABLE - characters? \nThen, this is the game for you! \nI surely wasn't expecting to get so attached with this wonderful game and - especially - with the main character. Even more, wasn't expecting the versatily to built your own personality in a Visual Novel, and things [i]actually[/i] having a lot of consequences with it. It's just great, almost felt like I was back at Dragon Age Origins' Hero of Ferelden, being whoever I wanted (without all the 1xfighting/100xdying thing). \nThis game just stole my [strike]demon[/strike]heart (ha, pun inteded) for good. \nThank you, Rolling Crown, for bringing such a nice game for everyone! \nI'm on the loose waiting for the new chapters and - I hope so - new games! \nP.S¹.: Sir Brash is love, Sir Brash is life. \nP.S².: Raze should totally rule Inferno.", "timestamp_created": 1503459093, "timestamp_updated": 1503459093, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.600028", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34420997": {"recommendationid": "34420997", "author": {"steamid": "76561198236840386", "num_games_owned": 79, "num_reviews": 10, "playtime_forever": 646, "playtime_last_two_weeks": 0, "last_played": 1514505223}, "language": "english", "review": "I am having such a fun time playing this game! It certainly one of the better written visual novels/otome out there, and is well worth the price IMO. \n\nThe voice acting (though this is NOT a fully voiced VN) is quite good, as is the artwork, and the character progression - including the MC. What I really appreciate about this VN, is that you are able to shape the personality of the MC through the choices made in her dialogue, and the NPCs will respond accordingly. (Who knew it could be so delightfully fun to be evil?) Also, the music fits each scene nicely and is not too intrusive, or annoying.\n\nAnother plus, is that the writing is such that the storyline/plot holds your attention with each new chapter, and it is not filled with all those horrible typos and gramatical mistakes that often seem to plaugue most VNs these days.  It also deals with mature themes, which is great for we adults that get tired of reading VN/otome/romance sims geared more to those under 18. \n\nOn the con side, the chapters could be a little longer and there are minor glitches when the character spites do not show up correctly in some scenes. \n\nOverall, I would reccomend this to anyone that enjoys VN/otome/romance sims games.\n", "timestamp_created": 1503425004, "timestamp_updated": 1503425004, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502678", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34415636": {"recommendationid": "34415636", "author": {"steamid": "76561198084885410", "num_games_owned": 274, "num_reviews": 19, "playtime_forever": 693, "playtime_last_two_weeks": 0, "last_played": 1514345747}, "language": "english", "review": "Sexy , well written and dark. Can't recommend enough. Voice acting is on point.", "timestamp_created": 1503407818, "timestamp_updated": 1514879207, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.513723", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34247976": {"recommendationid": "34247976", "author": {"steamid": "76561198022607991", "num_games_owned": 343, "num_reviews": 5, "playtime_forever": 209, "playtime_last_two_weeks": 0, "last_played": 1502858292}, "language": "english", "review": "At the very end of Chapter One, my reaction: \n\nAwesome, bewitching game -- full of weird surprises!", "timestamp_created": 1502765638, "timestamp_updated": 1502765638, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.493026", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34202035": {"recommendationid": "34202035", "author": {"steamid": "76561198051392382", "num_games_owned": 97, "num_reviews": 13, "playtime_forever": 398, "playtime_last_two_weeks": 135, "last_played": 1516193299}, "language": "spanish", "review": "Novelas visuales, o te gustan o no te gustan. Si no te gustan, pues poco se le puede hacer, pero si disfrutas de una historia narrativa acompañada de imagenes y personajes, adelante.\n\nDemonheart empezó en Neverwinter Nights como un modulo donde la creadora ya reflejó una historia super interesante que iba cobrando forma modulo a modulo; como modder de este juego entiendo las HORAS que le metes al Toolset para reflejar una historia de este calibre. Imaginaos lo que es pinchar codigo para que un videojuego de 2003 muestre las ideas de una historia escrita en 201X, mantener la coherencia y llevar un proyecto que mezcla aspecto tecnico, visual, equilibrio de juego y narrativa. \n\nMi sorpresa fue mayuscula al encontrar que esta gran serie de modulos para NWN pasaria a una novela visual. No me lo tomé a bien, la verdad, pero entiendo que el proyecto pase a otro formato quizá mas comodo. Al final te olvidas de que estas jugando a ese videojuego y te centras en la narrativa y los personajes, y el formato de novela visual lo clava.\n\nPara aquellos que vais a seguir Demonheart, tengo que deciros que cuento con cierta ventaja jugandolo; van por el segundo capitulo...Yo gracias al trabajo previo de Lamb debo llevar como...el sexto capitulo de esta aventura ya. Estos dos primeros capitulos son introductorios. Vais a flipar mas tarde.\n\nBaja fantasia, un sistema de alineamiento heredado del proyecto inicial al igual que el diario del personaje y los personajes turbios y poco encasillados que te destrozaran la mente mas de una vez, creo que va a ser toda una aventura seguir los proximos capitulos.\n\n¿Lo recomiendo?, sí. Racionaros esta aventura si la adquiris mas tarde, si todo progresa como el proyecto original lo vais a necesitar.\n\n", "timestamp_created": 1502580206, "timestamp_updated": 1502580206, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.505173", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34050169": {"recommendationid": "34050169", "author": {"steamid": "76561198093666838", "num_games_owned": 460, "num_reviews": 18, "playtime_forever": 299, "playtime_last_two_weeks": 0, "last_played": 1504981184}, "language": "english", "review": "[h1]An episodic dark fantasy VN where your character is shaped entirely by your choices be they good or bad.[/h1]\n\n[i]Note: Episodes 3-5 will be released as free updates if you already have the game[/i]\n\nYou are Bright, a young woman living in the slums with her parents in a peaceful little town. Everything changed, however, when the Fire Nati--wait, I mean until a witch named Orchid requests your presence. What could this possibly mean? Dark times of course.\n\n[h1]Gameplay/Controls[/h1]\nThe game’s choices are entirely up to you. The story is an interesting one full of betrayal, death, resurrection, and a whole lot of debauchery. The voice acting is pretty good too. There aren’t spoken lines all the time, but when there is, it accentuates the story’s plot points, giving depth and personality to the characters. The voice work is quite nice and aren’t grating or out of place. The Demon in your head is especially witty.\n\nSo, you arrive to talk to Orchid after the summons, but soon find there are others who are meeting with her as well; a boy, a mean wench, and a rather suspicious looking hooded girl by the name of Ari. Orchid holds a contest to see who will work for her. You can select whichever choices you want when the moment comes, but if you’re curious about how the responses will be, you can always save in the pause menu and reload.\n\nYou can also see how your responses are shaping your character overall. The character alignment shows various personalities Bright will take on depending on which answer you choose. There is Good/Evil and Tactful/Defiant. I’m on the Tactful/Defiant alignment because I found myself immediately disliking Mark, Bright’s betrothed. So I never responded nicely to him. You get the option later to [spoiler]kill Mark using a potion you can choose to keep when you’re released from the dungeon[/spoiler]. And I so did it, no remorse. :) \n\nYou’ll have instances where you decipher Demon Speak which is sort of like Scrabble, unscrambling words. You will also be identifying key objects of interest with your mouse in some scenes that will reveal more about the location you’re in or more about the plot.\n\nThe one thing that often pulled me out of the story were the expletives. Some of them were alright and fit with the story and lore. Other times, they felt a little out of place with certain situations and dialogues because it caught me off guard or came out of nowhere. \n\nControls use a mouse to either click or select things on screen, so there’s not much to it.\n\n[h1]Graphics/Music[/h1]\nThe art is gorgeous. The attention to each character and detail brings out their personality. Even more so when you hear their voices. The one thing that also stood out to me was that the world feels alive. The characters breathe and blink, smirk or squint. They feel more 3-dimensional for a VN where most of the time, the characters are images that don’t move at all. Very nice touch.\n\nThe music is also fitting for the story and works well to build suspense and add to the drama overall. \n\n[h1]Overall[/h1]\nI highly recommend Demonheart. It’s a very different VN that does some things others have, but better. I enjoyed the voice work, the depth of the different characters, and the strange and mysterious story unfolding.\n\nEpisode 3 is slated to release August 21st, 2017 and I will definitely be all over that. So, if you enjoy VNs with some dark humor, gorgeous artwork, interesting cast of characters, and the ability to fully flesh out your protagonist and align them how you want, Demonheart is definitely one to pick up.\n\n[code]If this review/EAR helped you, please give it a thumbs-up. For more reviews like this one follow the [url=http://steamcommunity.com/groups/gamingwithNtK/curation]NeedtoKnow Gaming Curator[/url] page <3[/code]", "timestamp_created": 1501982775, "timestamp_updated": 1501982775, "voted_up": true, "votes_up": 16, "votes_funny": 1, "weighted_vote_score": "0.705040", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34004668": {"recommendationid": "34004668", "author": {"steamid": "76561198009754538", "num_games_owned": 253, "num_reviews": 8, "playtime_forever": 2383, "playtime_last_two_weeks": 0, "last_played": 1514388299}, "language": "english", "review": "I've never had so much fun being evil.", "timestamp_created": 1501805218, "timestamp_updated": 1501805218, "voted_up": true, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.495332", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33754649": {"recommendationid": "33754649", "author": {"steamid": "76561198274747200", "num_games_owned": 30, "num_reviews": 4, "playtime_forever": 1990, "playtime_last_two_weeks": 0, "last_played": 1514943141}, "language": "english", "review": "A full choice story game with romance and violence that doesn't control your every move? You better believe it. \n\nFor the first time, I was actually shocked and delighted such a well designed visual novel existed. I really wish I could draw more attention to this game.\n\nWith their ambiently animated cast, it really added that tiny bit of realism into them so you didn't feel like you were just talking to a portrait like a low budget otome. You can feel as if you have more to look at than just words.\n\nThe characters were all fleshed out and ANY questions that arose were excellent for story progression and (HIDDEN) answers. \n\nReally well thought out in the fact that normally, whatever you feel as your own personal reaction to a situation will be a choice you can make. These heavy choices may be taken lightly, but they can alter your 'alignment' throughout your story; which actually DOES affect how characters react to you, or how things happen to you in the story; especially with your 'Infernal Patron'.\n\nThe story holds strong and may seem a bit fast paced if you're really rushing through to devour the story, or if you're a fast reader. Sometimes even I felt that it moved a bit fast, even for no reason. Honestly, I don't suggest blazing through this like some cheaply made Visual Novel or Otome. There is a lot of underlying story you need to pay attention to.\n\nHowever, it holds a very \"colorful\"(dangerous) world and somewhat predictable backgrounds. Sometimes, it feels like your choices don't really matter- and there are no threats to speaking your mind (Or simply opting to be a bitch) other than a character becoming annoyed with you for 2 seconds. There are times when a character may say or do something that won't make any sense, either- especially if you didn't gather everything storywise along the way. There was one time in which even that wasn't an excuse, and a character may become very... odd.\n\nThe backstory for each character (pointing fingers to the patron) gives you the insight to the bigger picture, which is very important to not be blindsided later on; and is in general, worth replaying to test all the choices to find them. It took me personally 3 playthroughs to realize my 'patron' didn't know what a goat was, and he seemed to have a great distaste for things the player could know or have read during the game. Either way, he might not take kindly to every choice you make. This 2nd main character is made up of your choices (Somewhat?? but is mostly an infernal ball of sass). All in all- he's very worth the play to 'meet' in the new chapter.\n\nVoice acting was the only SLIGHT negative as it was picked only for some lines. While sometimes you might expect something important spoken, it likely won't be, even if the comedic effect would worked better that way. \n\nI personally really loved what was available for this game, and truly and honestly recommend it for people who want to really feel inclusive in a story or play as a woman capable of being a badass 'don't need no man' type. \n\nI'll also say to buy it BEFORE it is complete, as the creators might raise the price.", "timestamp_created": 1500850347, "timestamp_updated": 1514947810, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.547361", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33319465": {"recommendationid": "33319465", "author": {"steamid": "76561198324865986", "num_games_owned": 35, "num_reviews": 2, "playtime_forever": 839, "playtime_last_two_weeks": 0, "last_played": 1514748754}, "language": "english", "review": "LOVE IT!\nPlease do keep the chapters coming!!! I NEED MORE!!!!!", "timestamp_created": 1499364530, "timestamp_updated": 1499364530, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.432768", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32907591": {"recommendationid": "32907591", "author": {"steamid": "76561198164956210", "num_games_owned": 27, "num_reviews": 2, "playtime_forever": 1194, "playtime_last_two_weeks": 0, "last_played": 1514359634}, "language": "english", "review": "A visual Novel that have some of my favorite dialouge choices, art and characters to like and hate. \nDemonheart is has great quailty in its writing, voice acting and art. Especially  for someone like myself who love occult and demon things(honestly there is not enough of them out there). And most of the dialouge choices can actually change the perspective on how the other characters view Bright(The Main Character you will be playing) People an view you as A sweet angel to blood thisty monster, etc. \n\nThough if there were issues i would have with the game: while playing some of the  character protraits won't show up(usually happen when i'm doing the \"Good\" route of the game), so it can at times ruin the suspense or leave some people confused. \n\nAnother thing is the saving system, there is no quick save, there so skip dialounge button for those who are trying other paths. You can make seperate save files for the type of route you're doing but you have to make sure to lable it so you know which one to start from once news chapters are updated to the game. \n\nAnd with only two chapters out so far you can pretty much finish them within 2 hours or less if you just playing through one emotion spector.(Good/Evil/Defiant/Tactful) \n\nBut if the schedule they tell us is right we should have the other three chapters of this story by the end of 2017. (Here to hoping).  And a cool thing about this game, where others who are releasing chapters as they go may/will charge you an extra fee, this game is a pay once play for all. So you DO NOT have to pay for the other chapters, just let it update the game to get the next one. \n\nBut i do highly recommend checking this out overall, hopfully they can fix some of the issues i have with the character Protraits.\n", "timestamp_created": 1498619590, "timestamp_updated": 1498619590, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.566929", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32644111": {"recommendationid": "32644111", "author": {"steamid": "76561198190544497", "num_games_owned": 34, "num_reviews": 4, "playtime_forever": 778, "playtime_last_two_weeks": 0, "last_played": 1514568041}, "language": "english", "review": "I'd recommend this game to anybody who's a little tired of the usual visual novel/ otome game protagonist. The MC has the potential to be so refreshingly witty, wicked, and rebellious. She isn't someone who's put through the shredder only to come out the other end without even a 'fuck this', like the manaically docile protagonists you find everywhere. I live for revenge.\n\nPlayer choice is something that's often advertised but rarely followed through satisfyingly, and although I have yet to see how important all my choices are, it's extremely fun having some agency, even if it is just choosing a great come-back. Not to mention the dialogue can be very well thought out and the characterisation so far stays true to itself without resorting to archetypes - it makes it feel like the characters are well thought out and have a lot more going on below the surface. I'm also surprised that I had the best time[spoiler]exchanging jabs with Sir Brash; instead of feeling irritated or outraged on behalf of a little angelic MC, I realised their dynamic was actually really funny and they were on more equal footing than I thought[/spoiler]- I can't wait to see what kind of person he really is and watch as their relationship evolves. \n\nThe episodes so far have beenvery intriguing, and I even like the mini games - they made me feel smart! The story has a lot more momentum, relative to other visual novels/ dating games, and it was really atmospheric at times as you move through[spoiler]dungeons and camps sites and woods[/spoiler]etc. I think a lot of that can also be attributed to well placed background music and sounds. It really feels like an adventure. \n\nI only wish there was more content at the moment, as so far it's a little like reading the first two chapters of a good book and then putting it down - I must binge! I also hope there is enough opportunity further on down the line to really delve into the story as much as it deserves to be delved into - will just a few chapters be enough?", "timestamp_created": 1498143090, "timestamp_updated": 1500571146, "voted_up": true, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.713310", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32575890": {"recommendationid": "32575890", "author": {"steamid": "76561198018195791", "num_games_owned": 125, "num_reviews": 6, "playtime_forever": 324, "playtime_last_two_weeks": 92, "last_played": 1516089212}, "language": "english", "review": "liked the NWN module, like this one too!", "timestamp_created": 1497905735, "timestamp_updated": 1497905735, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.463637", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32522110": {"recommendationid": "32522110", "author": {"steamid": "76561198152395187", "num_games_owned": 50, "num_reviews": 10, "playtime_forever": 2307, "playtime_last_two_weeks": 0, "last_played": 1514258807}, "language": "english", "review": "Intriguing story with very unique characters.  Different kind of art style is pretty cool.", "timestamp_created": 1497745401, "timestamp_updated": 1497745401, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.465931", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32302952": {"recommendationid": "32302952", "author": {"steamid": "76561198080268954", "num_games_owned": 42, "num_reviews": 22, "playtime_forever": 477, "playtime_last_two_weeks": 0, "last_played": 1514255448}, "language": "english", "review": "I'm only 2 chapters in and I think this is the best dating sim/visual novel-ish game I've ever played. The character design is gorgeous and the backgrounds are beautiful. I am genuinley interested in my character and the plot. My favourite thing is the amount of options you can make. Instead of just giving you a bare bones 2-4 answer response every once in a while, this game lets you have almost full control of how your character acts. Everything from being a goody-two shoes to a pervert who tries to bed Sir Brash at every chan... I'm getting off topic. \n\nThe game is a pay once deal and you get all the available chapters and to-be-released chapters. Nothing I've seen is restricted behind mini-transactions or \"sign up on facebook\" type crap which is refreshing.\n\nThe plot itself is very creative and unique. I won't spoil anything but I really want to know more about Sir Brash (for research purposes ;D) and why his character almost seems to have two personalities. God, I can't wait for the next chapter. The withdrawl may kill me :P", "timestamp_created": 1497045806, "timestamp_updated": 1497045806, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.527936", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32166834": {"recommendationid": "32166834", "author": {"steamid": "76561198174389601", "num_games_owned": 19, "num_reviews": 1, "playtime_forever": 951, "playtime_last_two_weeks": 0, "last_played": 1514530200}, "language": "english", "review": "Its a really good visual novel, I recommend it. Beautiful art, awesome story-line, worth the money.", "timestamp_created": 1496546619, "timestamp_updated": 1496546619, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.495332", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32040057": {"recommendationid": "32040057", "author": {"steamid": "76561198032574237", "num_games_owned": 225, "num_reviews": 33, "playtime_forever": 526, "playtime_last_two_weeks": 0, "last_played": 1514495858}, "language": "spanish", "review": "Se hace demasiado corto es lo unico malo que le veo. Por lo demas muy entretenido.", "timestamp_created": 1496058797, "timestamp_updated": 1496058797, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32033226": {"recommendationid": "32033226", "author": {"steamid": "76561198019964935", "num_games_owned": 165, "num_reviews": 7, "playtime_forever": 977, "playtime_last_two_weeks": 0, "last_played": 1515043900}, "language": "english", "review": "I enjoyed this. It has lot of things I love. Namely:\n\n- A female protagonist\n\n- Tons of choices all the time (that's what 'interactivity' is about right?)\n\n- Moral choices can shape the main protagonist (good/evil/defiant/tactful)\n\n- It is possible to 'pretend' without fearing the game will assign you an incorrect personality since you 'fool it' as well. The story makes it quite clear when there is no point to 'pretend' and what you do now is indeed what you are/think and not something you just want others to believe about you.\n\n- Beautiful graphics\n\n- Interesting story\n\n- Protagonist has/gets special 'power'(s)\n\n****\n\nThere _are_ some cons though:\n\n- If you play it for the second time you'll find out the impact of your choices is rather small. Of course that is/must be valid for almost any VN but still the branching could be better. However, at least the now released 2nd chapter seems to promise it _will_ improve (I don't want to go to spoilers here).\n\n- So far it is still rather short. But alright, it is still kind-of early access right? If all five chapters will be finished and have more or less the same size the total length of the story will be more than appropriate.\n\n---\n\nOveraly: Definitely worth it if you like moral-based fantasy VN with lot of choices. I just hope it will be indeed finished (on time).", "timestamp_created": 1496023790, "timestamp_updated": 1496024670, "voted_up": true, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.685420", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32027142": {"recommendationid": "32027142", "author": {"steamid": "76561198137612259", "num_games_owned": 28, "num_reviews": 2, "playtime_forever": 489, "playtime_last_two_weeks": 0, "last_played": 1514302715}, "language": "english", "review": "I loved the NWN modules back then, and I'm happy to have it as VN,\nthe only thing I don't like is the shortness of the chapters, but I can wait for the next one :)", "timestamp_created": 1495999203, "timestamp_updated": 1495999203, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.516847", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32026236": {"recommendationid": "32026236", "author": {"steamid": "76561198064761587", "num_games_owned": 18, "num_reviews": 1, "playtime_forever": 789, "playtime_last_two_weeks": 0, "last_played": 1514457432}, "language": "danish", "review": "This is a very interesting story which is also very funny at times. I can't wait for the next chapter!!", "timestamp_created": 1495996418, "timestamp_updated": 1495996418, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502306", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31998011": {"recommendationid": "31998011", "author": {"steamid": "76561197997221285", "num_games_owned": 171, "num_reviews": 4, "playtime_forever": 564, "playtime_last_two_weeks": 0, "last_played": 1514464371}, "language": "english", "review": "I had a blast playing this with my girlfriend - great writing, fun, dark story. It's a visual novel without too much interactivity, but gripping nonetheless. Fingers crossed that the next chapter isn't too long in the making.", "timestamp_created": 1495895300, "timestamp_updated": 1495895300, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.507651", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31985336": {"recommendationid": "31985336", "author": {"steamid": "76561198045708403", "num_games_owned": 109, "num_reviews": 1, "playtime_forever": 70, "playtime_last_two_weeks": 0, "last_played": 1495846184}, "language": "english", "review": "Dissapointing. \n\nCompared to the NWN module this novel is neither interesting or unique.\n\nWith the parts that made the module mature and stand out isn't in the novel so i can't see a reason to play it anymore.", "timestamp_created": 1495846329, "timestamp_updated": 1495846329, "voted_up": false, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.331277", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31983998": {"recommendationid": "31983998", "author": {"steamid": "76561198269420709", "num_games_owned": 52, "num_reviews": 8, "playtime_forever": 497, "playtime_last_two_weeks": 0, "last_played": 1514207435}, "language": "swedish", "review": "cant wait for ch3 i freaking love this!!!!", "timestamp_created": 1495839954, "timestamp_updated": 1495839954, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502306", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31749378": {"recommendationid": "31749378", "author": {"steamid": "76561198212036775", "num_games_owned": 24, "num_reviews": 4, "playtime_forever": 1527, "playtime_last_two_weeks": 0, "last_played": 1514253216}, "language": "spanish", "review": "Recomendadísimo. Es todo lo que podía pedir sinceramente: los personajes son misteriosos y complejos (incluida la protagonista que nosotros mismos modelamos), los diálogos tienen vida y son dignos de una novela de fantasía y el mundo que nos rodea es intrigante, oscuro y maravilloso. El arte es muy bueno, 10/10 y la música se adapta perfectamente a la atmósfera del juego, sobre todo cuando da mal rollo. \n\nQuizá lo mejor del juego sea el poder elegir la personalidad de la protagonista y que otros personajes reaccionen diferente dependiendo de cómo sea. Eso me encanta. Y bueno, no voy a mentir, ya empecé a shippear bastante fuerte a Sir Brash con Bright, esa escena en la mazmorra tenía mucha química no sé por qué. No puedo esperar a conocer mejor a todos los personajes en el resto de capítulos :)\n\nEl precio es más que razonable, sobre todo teniendo en cuenta que con el lanzamiento de cada capítulo lo rebajan. Yo lo pagué sin rebajas (20€) y no me arrepiento. La calidad concuerda con el precio. \n\n¿Cosas negativas? La verdad ninguna. Me ha encantado :)", "timestamp_created": 1494771836, "timestamp_updated": 1494771836, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502306", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31264680": {"recommendationid": "31264680", "author": {"steamid": "76561197995195501", "num_games_owned": 146, "num_reviews": 3, "playtime_forever": 166, "playtime_last_two_weeks": 0, "last_played": 1503793082}, "language": "english", "review": "As an avid writer and devourer of all things fantasy, I was intrigued by the premise of this game. I'd heard of the NWN module, but never had the opportunity to try it myself - so I was pleased when the VN pulled me into it fairly quickly. The artwork is beautifully done and the story - particularly it's ending - is an intriguing tease of what's to come. Excited for chapter two!", "timestamp_created": 1492728011, "timestamp_updated": 1492728011, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.502306", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30929786": {"recommendationid": "30929786", "author": {"steamid": "76561198014892584", "num_games_owned": 716, "num_reviews": 2, "playtime_forever": 523, "playtime_last_two_weeks": 0, "last_played": 1504124882}, "language": "english", "review": "I was a fan of the NWN module version. Sadly, we won't get to play the remaining story with more dark and mature terms, non-linearity and a decent combat design. Oh well, thanks to a friend I at least have this VN. VN version is way more family-friendly, less dark and more linear then the original Prologue module. It somewhat expanded the Orchid's role, and switched Brash's sister with another character. \n\nThe music was OK, if generic, the art, given that Lamb and co aren't professional game disigners was decent-to-good. VA weren't bad, although I would've preferred to play the game without them. The only element I disliked were the word puzzles, they were too easy. \n\nAll in all, it looks promising enough, I hope that Lamb will add more non-linear elements and routes though.", "timestamp_created": 1491249116, "timestamp_updated": 1491249116, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.650303", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30862718": {"recommendationid": "30862718", "author": {"steamid": "76561198024096210", "num_games_owned": 462, "num_reviews": 20, "playtime_forever": 182, "playtime_last_two_weeks": 0, "last_played": 1491016584}, "language": "german", "review": "Spannende Geschichte, schöne Grafik, tolle Atmosphäre - und dann der Cliffhanger bis zum nächste Kapitel.\nAber den halte ich (wenn auch mit den Zähnen knirschend) aus, weil mir dieses Spiel einfach ausnehmend gut gefällt.\nZuerst hatte ich Bedenken weil es keine deutsche Version gibt, und ich nicht sicher war, ob mein englisch gut genug ist.\nDie Bedenken waren völlig unnötig.\n\nDie (hoffentlich kurze) Wartezeit bis zum nächsten Kapitel vertreibe ich mir einfach damit, das ich nochmals von Anfang an beginne, und jetzt andere Antworten wähle. Mal sehen zu welchem Ergebnis ich dann komme.\nVon mir gibt es eine klare Kaufempfehlung und einen Daumen nach oben.", "timestamp_created": 1490997761, "timestamp_updated": 1490997761, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30776974": {"recommendationid": "30776974", "author": {"steamid": "76561198136271833", "num_games_owned": 14, "num_reviews": 5, "playtime_forever": 590, "playtime_last_two_weeks": 190, "last_played": 1515347644}, "language": "english", "review": "I won't lie, I'm a big fan of NWN module and was really excited about the game, even as a visual novel with less mature content. The whole plot was nicely done, with lovely backgrounds and fluid sprite animations, and esp. the music. I really enjoyed the word-riddles, even though I'm not a native english speaker, they were easy and fun to figure out. My only possible complaint would be the chapter length. Even the first chapter in the module was longer than one of the visual novel. Will each chapter be this short? Because I really don't think enough character development will happen in 5 chapters with 1 hour length each. And my favourite thing in the module was definitely the characters and their dynamics. I really hope I'm wrong about this, though.", "timestamp_created": 1490638106, "timestamp_updated": 1490803129, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.516847", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30773803": {"recommendationid": "30773803", "author": {"steamid": "76561198001263587", "num_games_owned": 1152, "num_reviews": 73, "playtime_forever": 517, "playtime_last_two_weeks": 0, "last_played": 1514218596}, "language": "russian", "review": "Hmm... I can't say anything in particular about it to be honest. Graphic style very good and it has a voice over of some text lines. Start of the story is good but actions are move too fast. Characters blink before eyes, so you can't tell anything about them. It's normal for prologue, and I hope that another chapters will have more length. So I can't tell more about it, it's so short that it's difficult to say it's good or bad. I'll hope it'll be more content for judging in future chapters. But I'll give it a good mark at least because of drawing, and I like beginning of story, so thumbs up.", "timestamp_created": 1490627097, "timestamp_updated": 1490627097, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.522862", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30762944": {"recommendationid": "30762944", "author": {"steamid": "76561198374895402", "num_games_owned": 3, "num_reviews": 1, "playtime_forever": 321, "playtime_last_two_weeks": 0, "last_played": 1491075755}, "language": "english", "review": "Love the art style and general asthetic of the game. \n\nAs you make decisions in conversation you will be informed of how your character is changing/growing. You will get points alloted into certain traits like \"Tactile\" and \"Defiant\" so you get to see how you're progressing in real time which i really enjoyed for a game like this! \n\nI hope later chapters have more interactive things to do to break up the game. There is a section in chapter one that requires you to solve a few anagram puzzles which made a very welcome change of pace. \n\nWould highly recomend to fans of text adventure games, roleplaying or chose your own adventure fans.", "timestamp_created": 1490573105, "timestamp_updated": 1490573105, "voted_up": true, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.556942", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30761247": {"recommendationid": "30761247", "author": {"steamid": "76561198148348488", "num_games_owned": 187, "num_reviews": 8, "playtime_forever": 346, "playtime_last_two_weeks": 0, "last_played": 1514334474}, "language": "english", "review": "I will admit, I wasn't going to give this visual novel a chance at first because the art style was something I wasn't use to and it had voice acting, but once I bought it and played it... I fell in love. \n\nDepite me saying that the art style and the voice acting was what was pushing me away from the game, I found both of them enjoyable. It, in fact, added to the visual novel itself. The music was fantastic, the characters kept my interest, and it really didn't have a boring moment (or at least through chapter one)\n\nMy only complaint is the price. Might not be a big deal to others, but $20 for five chapters doesn't sound too bad, but if each chapter is an hour and ten minutes like chapter one was... I feel the full price wouldn't be worth it, yet I didn't follow this game on greenlight or such. I hear it has replayablity factors, but we shall see. Eitherway, I would recommend it on sale, and if you have the money to spare, get it full price. So far, it is a 10/10", "timestamp_created": 1490565398, "timestamp_updated": 1490565398, "voted_up": true, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.571625", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30742421": {"recommendationid": "30742421", "author": {"steamid": "76561198023729112", "num_games_owned": 216, "num_reviews": 1, "playtime_forever": 323, "playtime_last_two_weeks": 0, "last_played": 1490500938}, "language": "english", "review": "Bought the game on a whim, wanting to try my first visual novel. So far so good! I feel it left off at a good point as well, on the first chapter. Didn't leave you at a complete cliffhanger, but gave you a tease of what's going to happen next in the story.\n\nWell-paced with interesting characters that leave you wanting to know more about them. Does a good job of letting you build your knowledge of the world by updating you with journal entries you can read to gain a deeper insight into the things the story teaches you.\n\nI think this was a good game to have as my first visual novel purchase, as now I'm interested in trying out others!", "timestamp_created": 1490501264, "timestamp_updated": 1490501264, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.533936", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30738470": {"recommendationid": "30738470", "author": {"steamid": "76561198249018814", "num_games_owned": 6, "num_reviews": 1, "playtime_forever": 426, "playtime_last_two_weeks": 0, "last_played": 1505072393}, "language": "english", "review": "I really enjoyed this game! Story line keeps you intrested, the word puzzle game is good and not too tricky. I liked that each character had different voice and didn't sound similar to one another. Can't wait for the next chapters to come out!", "timestamp_created": 1490483819, "timestamp_updated": 1490484060, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.493026", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30736795": {"recommendationid": "30736795", "author": {"steamid": "76561198151338292", "num_games_owned": 100, "num_reviews": 1, "playtime_forever": 1846, "playtime_last_two_weeks": 0, "last_played": 1514369973}, "language": "english", "review": "I'd been following the development of this project for a very long time and backed it on indiegogo and greenlight, and am/was a huge fan of the Neverwinter Nights modules that gave birth to this terrific little gem. The game is already fantastic even with only one chapter currently released, especially if you're a fan of visual novels and/or dark fantasy. Beautifully designed with intriguing storytelling and surprisingly well done voice acting. I wholeheartedly look forward to the rest of the game as it's released and can't recommend it enough.", "timestamp_created": 1490477331, "timestamp_updated": 1490477476, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.540441", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30731651": {"recommendationid": "30731651", "author": {"steamid": "76561198027015618", "num_games_owned": 24, "num_reviews": 1, "playtime_forever": 674, "playtime_last_two_weeks": 9, "last_played": 1515953071}, "language": "english", "review": "Like many, I'm familiar with Demonheart from its original platform as an NWN module, but let me just say -- whether you've already been introduced to Demonheart or if you're a brand-new player coming into this visual novel, you're going to love it. The visuals are absolutely gorgeous and have been lovingly rendered, the game-play is smooth and I personally experienced nothing in the way of bugs, and the story-telling is absolutely superb -- wonderfully immersive, totally engaging. I was a little leery about the prospect of voice-acting in this visual novel, but was happily surprised -- the characters are so well-voiced that I ended up disappointed that there wasn't MORE voice-acting.\n\nTrust me, if you DO happen to be a newcomer to Demonheart, the creator of this story will definitely hook you with her storytelling. The plot is fantastically unique, the characters will suck you in, whether you end up loving or hating them. And Bright, the protagonist you play, feels like such a fleshed-out character, given how many options you're allowed in how you play her and how she reacts to the world around her. It also promises plenty of replay potential.\n\nHonestly, the only complaint I have is that I want more! I can't wait for the future chapters! A big \"thank you\" to its creator(s) -- the platform might have changed but this game remains a masterpiece. \n\nAll in all, Demonheart is delightful and definitely worth the cost. Highly recommended!", "timestamp_created": 1490461530, "timestamp_updated": 1490462013, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.515733", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30720739": {"recommendationid": "30720739", "author": {"steamid": "76561198024858977", "num_games_owned": 80, "num_reviews": 8, "playtime_forever": 597, "playtime_last_two_weeks": 0, "last_played": 1514456261}, "language": "english", "review": "I like it! The plot is very intriguing. Art is outstanding! Lots of choice. I hope there will be some sexy scenes later in the game...", "timestamp_created": 1490426491, "timestamp_updated": 1490426491, "voted_up": true, "votes_up": 5, "votes_funny": 3, "weighted_vote_score": "0.429303", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30714599": {"recommendationid": "30714599", "author": {"steamid": "76561198160519296", "num_games_owned": 45, "num_reviews": 1, "playtime_forever": 240, "playtime_last_two_weeks": 0, "last_played": 1512741818}, "language": "english", "review": "I played the NWN module, and loved it, I hope this gets fully completed asap! It was a great romance, and a good dark story, very open. Keep up the good work! 11 demon hearts out of 10!", "timestamp_created": 1490397087, "timestamp_updated": 1490397087, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.451511", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30714116": {"recommendationid": "30714116", "author": {"steamid": "76561198375557501", "num_games_owned": 1, "num_reviews": 1, "playtime_forever": 656, "playtime_last_two_weeks": 0, "last_played": 1514241352}, "language": "english", "review": "Well, this was an absolute pleasure.\nI suspect many of us were waiting for this game after playing the nwn modules. And although VN really isn't my first choice in gaming, it delivers what it promised and I was thoroughly entertained and tickled for continuation. Although the core material was familiar to me, the story was fresh as if playing without previous knowledge. The response choices were good and in decent amount, small observations of the area a nice bonus. Characters and background are not static and are very well done. It is a bit short ( 77 min. for first playthrough ), but when all the chapters are out it will be a very complete game very much worth the price. Sincere thanks to the team who made this game possible, and I am eagerly waiting for more.", "timestamp_created": 1490394988, "timestamp_updated": 1490394988, "voted_up": true, "votes_up": 19, "votes_funny": 1, "weighted_vote_score": "0.625056", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39549559": {"recommendationid": "39549559", "author": {"steamid": "76561198429652938", "num_games_owned": 107, "num_reviews": 2, "playtime_forever": 921, "playtime_last_two_weeks": 0, "last_played": 1515634222}, "language": "english", "review": "I've finished Chapter 4 and still have no idea who are the romance options, lol. Hopefully the last episode would be out soon so I can finally finish the game.", "timestamp_created": 1516682731, "timestamp_updated": 1516682731, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 80, "total_negative": 2, "total_reviews": 82}}
