{"reviews": {"40974166": {"recommendationid": "40974166", "author": {"steamid": "76561198287816162", "num_games_owned": 3, "num_reviews": 1, "playtime_forever": 3767, "playtime_last_two_weeks": 1622, "last_played": 1521609853}, "language": "english", "review": "10/10", "timestamp_created": 1521725061, "timestamp_updated": 1521725061, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40970969": {"recommendationid": "40970969", "author": {"steamid": "76561198030331828", "num_games_owned": 79, "num_reviews": 2, "playtime_forever": 455, "playtime_last_two_weeks": 455, "last_played": 1521695871}, "language": "english", "review": "A genre-blending turn-based strategy game with no direct equals.  Strategically deep and tightly balanced multiplayer matches always keep you thinking on your feet.  Ethical monetization (with microtransactions being only for cosmetics and single-player content) sealed the deal for me. The current $25 price tag includes a bunch of single-player content, the completely unlocked multiplayer game will be available for FREE later this year.\n\nCombines elements from many games: \n-Like Fischer Chess, you have randomized, symmetrical starting positions but no randomness from that point forward.  With the large number of possible starting positions, the focus isn't on deeply studying a specific line, but instead on being able to compose a strategy on the fly.  But there is no advantage to going first.\n-Like StarCraft, you have the ideas of unit production, tech paths, economy growth, build orders, rushes/pokes/timings, defender's advantage, and countering compositions.  But everything is turn-based with no fog of war.\n-Like Magic the Gathering, you have a color pie for unit themes and abilities, you can choose between getting few \"lands\" for efficient mono-color units or more for flexible multi-color units, units can be tapped for resources/attack instead of blocking, and defender gets to optimize blocker assignment each turn.  But there are no random draws, both players have access to the same units, and you don't bring any sort of constructed deck into the game.", "timestamp_created": 1521709831, "timestamp_updated": 1521709831, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40967644": {"recommendationid": "40967644", "author": {"steamid": "76561197988039425", "num_games_owned": 552, "num_reviews": 34, "playtime_forever": 2307, "playtime_last_two_weeks": 2307, "last_played": 1521643689}, "language": "english", "review": "Prismata is a turn-based abstract Starcraft-esque game whereby both players have access to the same (randomized per match) set of units.\n\nPros\n- No Collecting Legendary e-peen/cards: both players in a match always have access to the exact same tools (randomized sets of units).\n- 100+ Randomized units means that every match provides a fresh experience and keeps you on your toes.\n- No Pay 2 Win: only a generous Pay 2 Cosmetics Quicker system.\n- No BS RNG: when you lose it's because you were outplayed by your opponent.\n- Prismata allows for replaying and analyzing previous matches which encourages study, learning and eventual mastery of the game.\n\nCons\n- Relatively small but healthy player base (100-200 concurrent players) but it will grow when the game goes F2P.\n\nIf you've always wanted to play Starcraft but never had the APM to be a pro or if you've always wanted to play competitive card games but without any Pay2Win mechanics then you'll most likely fall in love with Prismata.", "timestamp_created": 1521688917, "timestamp_updated": 1521688917, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40960015": {"recommendationid": "40960015", "author": {"steamid": "76561198036462079", "num_games_owned": 410, "num_reviews": 21, "playtime_forever": 709, "playtime_last_two_weeks": 709, "last_played": 1521650922}, "language": "french", "review": "\"ton cerveau va buger et se retourner lors des parties\" qu'on m'a dites!\n alors oui, ce n'est pas un jeu de hasard, il faut tout calculer, chaque piece d'or ou énergie est un investissement qui sur le long terme pourrait être fatal ou vital. mais. mais quel plaisir!\nsi vous aimez les jeux de cartes: ici pas de random ou de rng pour foutre le chaos. ni de pay-to-win, et avec son système de jeu chaque duel force à changer de strat. chaque matche est different, une partie focalisé sur la ressource bleue (forge) et la suivante sur les ressources rouges et vert, ou bleu vert... etc. foncez ce jeu est énorme!", "timestamp_created": 1521652323, "timestamp_updated": 1521652323, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.527559", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40956136": {"recommendationid": "40956136", "author": {"steamid": "76561198284731206", "num_games_owned": 20, "num_reviews": 12, "playtime_forever": 1333, "playtime_last_two_weeks": 1333, "last_played": 1521747049}, "language": "english", "review": "An intricate balance of resources (energy, crystals, gold) is required to balance your economic, offensive and defensive power... go too far into economy, and you'll get crushed a few turns later by your opponent's offenses... go too far into offense/defense, and your opponent will most assuredly win the late game. It's a very complex 'card game' mixed with a turn-based game, even though it's not really a card game because you can build what you want, when you want and don't draw any cards ever. Be warned though, the game's design is extremely 'minimalist', and the game's art/look will probably not appeal to many of the younger generation, simply because there's none of the 'flashy' stuff or 'eye candy' that appeals to SO many of the younger gamers of today, but I found it completely passable as far as game aesthetic goes. According to the devs, once the game releases, it'll be free, but to play the 5 singleplayer campaigns, you have to pay $25, which is absolutely fine as far as microtransactions go imo... there's also other microtransactions in the game, but it's all purely cosmetic, trust me, I've checked.", "timestamp_created": 1521638118, "timestamp_updated": 1521731180, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.498542", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "40937306": {"recommendationid": "40937306", "author": {"steamid": "76561198008053710", "num_games_owned": 1049, "num_reviews": 20, "playtime_forever": 2072, "playtime_last_two_weeks": 2072, "last_played": 1521584989}, "language": "german", "review": "Ich liebe seit jeher Sammelkartenspiele und habe lange MTG (Online) und zuletzt Faeria und Nova Blitz relativ ausgiebig gespielt. RTS und Aufbaustrategie macht mir ebenfalls Spaß.\n\nJedoch haben all diese Spiele schon immer Attribute, die mir nicht so liegen: \n\nMit dem Alter verliere ich den Spass an Spielen die Reaktionszeit über \"Denken\" setzen. Also bevorzuge ich eher Runden basierte Spiele.\n\nBeim Erwerb von Sammelkarten Packs oder Erweiterungen, wird irgendwann die Lust durch die Vernunft ersetzt. Daher spiele ich lieber Spiele wie Dominion, Dream Quest, Pathfinder Adventures oder Sentinels of the Universe. \n\nBei Spielen wie Civilisation, Endless Legend/Space und Stellaris fehlt mir grundsätzlich die Zeit zu langen Sitzungen. \n\nEs gibt mittlerweile sehr viele Spiele, die meinen Geschmack treffen, jedoch haben sie alle etwas gemeinsam: \n\nSie beruhen fast immer auf dem Element des Zufalls. Ob es Würfel sind oder Karten gemischt werden, ganz wenige Spiele kommen ohne den Zufall aus. Puzzle Spiele sind eine alternative (z.B. Drod), jedoch sind diese entweder \"Endlich\" oder werden mir irgendwann zu \"Frickelig\" und/oder langweilig. \n\nDas ist alles anders für mich bei Prismata und zusammen mit den wirklich guten Bots der Hauptgrund, dass ich mich damit beschäftige. Endlich ein Spiel ohne Play2Win, ohne Sammelkarten käufe, mit übersichlicher Spieldauer, mit Puzzle und Taktik Elementen, ohne Zufallsgewin oder Verlust und ständig verfügbaren Spielpartnern in einer Stärke die ich wählen kann. \n\nAußerdem und nicht zuletzt: Mit Entwicklern, die sich Gedanken machen und die Fähigkeiten und Möglichkeiten haben so ein Projekt auch wirklich umzusetzen!\n\nNun bleibt nur noch das Spiel voll ausschöpfen und vor allem immer besser werden!", "timestamp_created": 1521548868, "timestamp_updated": 1521548986, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40932830": {"recommendationid": "40932830", "author": {"steamid": "76561198347809501", "num_games_owned": 835, "num_reviews": 64, "playtime_forever": 2559, "playtime_last_two_weeks": 2559, "last_played": 1521744820}, "language": "schinese", "review": "担心不差评开发者看不到=。=\n因为我不讨厌数学，你们的游戏很好玩~\n不过，很多次啦，总是进度条卡在96%、99%的样子，希望在尽快修复bug~\n-----------------\n开发者真的就在当天发布更新啦！\n虽然加速了联网（其实不是速度的问题而是卡的问题），但是有时在打bot（对就是那些爸爸们），会出现掉线，，，虽然可能是我自己网络的问题，但还是想先告知一下。\n确定的bug，还是有的，比如进入关卡有时会黑掉（？虽然极少出现啦），有时结束也没办法很好撤回来）\n------------\n估计明天就会变好评啦！开发者加油~", "timestamp_created": 1521522768, "timestamp_updated": 1521630593, "voted_up": false, "votes_up": 2, "votes_funny": 3, "weighted_vote_score": "0.527778", "comment_count": "5", "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40928599": {"recommendationid": "40928599", "author": {"steamid": "76561198057627247", "num_games_owned": 34, "num_reviews": 8, "playtime_forever": 256, "playtime_last_two_weeks": 256, "last_played": 1521421342}, "language": "english", "review": "Wonderful blend of card game with deck building mechanics, and real-time strategy. Honestly, probably the best depiction of the blending of two genres that would otherwise seem too difficult to combine.\n\nThe game is very simple to pickup, and for a game in early access, I've been amazed with the amount of content available - both singleplayer (campaign story, challenging AI when you're new, combat challenges, etc) and items like cosmetics,etc. It has a surprising amount of depth to it (in some cases, maybe even too much which is actually nice for a change in the world of overly simplified games).\n\nThe only negative I personally have with the game is I'm not a big fan of the graphics/art in it.", "timestamp_created": 1521499294, "timestamp_updated": 1521499294, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40926665": {"recommendationid": "40926665", "author": {"steamid": "76561198089872734", "num_games_owned": 42, "num_reviews": 3, "playtime_forever": 4358, "playtime_last_two_weeks": 4358, "last_played": 1521741609}, "language": "english", "review": "Dont let the visual presentation put you off! Its one of the deepest strategy games on the market. A real gem. A real masterpiece!", "timestamp_created": 1521491201, "timestamp_updated": 1521491201, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501458", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40925531": {"recommendationid": "40925531", "author": {"steamid": "76561198306393034", "num_games_owned": 23, "num_reviews": 1, "playtime_forever": 1133, "playtime_last_two_weeks": 1133, "last_played": 1521643601}, "language": "english", "review": "I purchased this game this week after seeing it in my reccomended during my birtday-money-infused spending frenzy and immediately was hooked. I enjoy card video games but previously I had been annoyed by the prevalence of luck in them as I enjoy skill based games. This game takes the card game format and makes in entirely skill based, while still being a turn based game. This merge of these two comcepts works extremely well and im surprised that I havent seen much like it out there. Overall, my first impressions are of a great game", "timestamp_created": 1521487077, "timestamp_updated": 1521487077, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501458", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40903308": {"recommendationid": "40903308", "author": {"steamid": "76561197970174297", "num_games_owned": 47, "num_reviews": 1, "playtime_forever": 354, "playtime_last_two_weeks": 354, "last_played": 1521397188}, "language": "english", "review": "I played Prismata a fair amount after backing the Kickstarter so most of my playtime isn't tracked in Steam.  But I love this game and hope it succeeds.  I love how it takes aspects of Dominion (my favorite card game) and Starcraft (my favorite RTS) and combines them with with a multitude of original, creative design decisions.  The variety and depth of the units is truly profound and I can't wait to see what they come up with next.  Prismata is one of the most cohesive, deep, and fun turn-based strategy games I've ever seen.  Highly recommended.", "timestamp_created": 1521393316, "timestamp_updated": 1521393316, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40893104": {"recommendationid": "40893104", "author": {"steamid": "76561198031797928", "num_games_owned": 218, "num_reviews": 2, "playtime_forever": 2833, "playtime_last_two_weeks": 2833, "last_played": 1521643586}, "language": "english", "review": "Starcraft without APM, and card game without random. Absolutely amazing expirience.\nP.S. In-game AI is pretty hard.", "timestamp_created": 1521363773, "timestamp_updated": 1521364129, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.527173", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40886308": {"recommendationid": "40886308", "author": {"steamid": "76561198086404285", "num_games_owned": 138, "num_reviews": 14, "playtime_forever": 1208, "playtime_last_two_weeks": 1208, "last_played": 1521525368}, "language": "english", "review": "This game is an RTS Card Game with so much depth it's insane. As someone who has been slothing through all the popular card games (HS, Gwent, Shadowverse.) I finally saw this release on Steam and WOW. I recognized it because I bought into the Kickstarter campaign years ago and forgot about it since.\n\nSeeing it now, I can't wait to try it since it's much more developed and refined. Boy am I glad it showed up on Steam because this game is what I've been searching for. A card game that takes out the RNG and challenges you to think and read what is on the board. \n\nIf this is the type of game you might be interested in buy it immediately! Don't let the art style put you off. Although, I like the art style myself many seem to be put off by it. This game really is a labor of love from the developers with great matchmaking, design, and community feedback. This game is an easy buy for fans of the card game genre who want  something more skill based.", "timestamp_created": 1521333669, "timestamp_updated": 1521333669, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.547325", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40879819": {"recommendationid": "40879819", "author": {"steamid": "76561198089554340", "num_games_owned": 276, "num_reviews": 4, "playtime_forever": 664, "playtime_last_two_weeks": 664, "last_played": 1521736956}, "language": "english", "review": "This game is really fun. It is very well designed--you can tell the devs have thought a lot about how to streamline gameplay so that most of your time is spent thinking. There is no busy work. It blows me away how this game distills many of the concepts of an rts into a turn-based game. It is intense and thoroughly engaging.", "timestamp_created": 1521311388, "timestamp_updated": 1521311388, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40877570": {"recommendationid": "40877570", "author": {"steamid": "76561198314657309", "num_games_owned": 9, "num_reviews": 1, "playtime_forever": 2290, "playtime_last_two_weeks": 2290, "last_played": 1521662271}, "language": "english", "review": "Hi,\n\nWhat an amazing game! After I played almost 9 hours - I did most of the tutorial parts - I just want to play more and more. \nA real strategy cardgame, so unique. Fantastic community! I still can not belive that a game can be so complex but in the other hand easy to understand, and so much fun to explore and play. \nEasy to play, but hard to be a master!\n\nKosztirita \n", "timestamp_created": 1521305445, "timestamp_updated": 1521305445, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40876517": {"recommendationid": "40876517", "author": {"steamid": "76561198059780569", "num_games_owned": 159, "num_reviews": 2, "playtime_forever": 541, "playtime_last_two_weeks": 541, "last_played": 1521672495}, "language": "brazilian", "review": "Excelente comunidade e desenvolvedores. \nJogabilidade única.\nSe você gosta de jogos de estratégia/cartas e está cansado de jogos baseados em RNG, esse jogo é pra você!", "timestamp_created": 1521302670, "timestamp_updated": 1521302670, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40872203": {"recommendationid": "40872203", "author": {"steamid": "76561198176770989", "num_games_owned": 172, "num_reviews": 1, "playtime_forever": 48, "playtime_last_two_weeks": 48, "last_played": 1521292439}, "language": "schinese", "review": "成功卡在进度条94% ，无法登录游戏，看见没有给差评的，我也就不妄给差评了。\n\ncannot load into the game，really want to play this game , please fix it.", "timestamp_created": 1521291422, "timestamp_updated": 1521291422, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40865596": {"recommendationid": "40865596", "author": {"steamid": "76561198073983462", "num_games_owned": 109, "num_reviews": 8, "playtime_forever": 690, "playtime_last_two_weeks": 690, "last_played": 1521512598}, "language": "english", "review": "Much like a prism itself, Prismata has many sides to it and cannot be explained by science. It takes elements of first-person shooters, rogue-likes, and beat-em-ups, combines them with the UI of a platformer, and adds just a sprinkle of survival horror. Then it throws that in the goddamn garbage and makes a robo-monkey fight simulator.\n\nMy only complaint is that Prismata is severly limited in some dimensions of its stategy. When up against another player there is no text chat, which prevents me from calling them a poophead and sending them into a distracting rage. This forces me to instead spam the 'Ahoy Matey' emote hundreds of times to attempt to get in their head but it is much less effective.\n\nUltimately, Prismata is every kind of game existing in a single superposition, ineffable and nightmarish. To some people, its a strategy game. To others, a puzzle game. To me, its a dating sim; all possibilities are equally probable and legitimate within the prism's scintillating sides.", "timestamp_created": 1521268840, "timestamp_updated": 1521268926, "voted_up": true, "votes_up": 1, "votes_funny": 3, "weighted_vote_score": "0.475592", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "40865093": {"recommendationid": "40865093", "author": {"steamid": "76561198018408493", "num_games_owned": 238, "num_reviews": 4, "playtime_forever": 248, "playtime_last_two_weeks": 248, "last_played": 1521447302}, "language": "schinese", "review": "难得的联网对战DBG，很容易让人沉迷。\n\n妈个蛋第一章最后一关就卡关了。。。", "timestamp_created": 1521266969, "timestamp_updated": 1521266969, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40863970": {"recommendationid": "40863970", "author": {"steamid": "76561198016536036", "num_games_owned": 8, "num_reviews": 2, "playtime_forever": 6, "playtime_last_two_weeks": 6, "last_played": 1521261531}, "language": "polish", "review": "Niestety grę aktywowałem na koncie steam, gdzie nie wydałem nawet złotówki, wiec nie mogłem stamtąd dodać recenzji, bo ograniczenia :/ Recenzję tą dodaję mając Prismate od tygodnia i po przegraniu ponad 40h przez ten czas...\n\nNaprawdę unikatowa gra, dlatego też nie sposób przypisać jej do jakiegoś konkretnego gatunku gier komputerowych. Połączenie takich klasyków jak szachy, go... jak i gier karcianych i RTS. Gra, w której nie ma miejsca na element szczęścia, wszystko zależy od umiejętności graczy. Prismata jest mega skomplikowana, wręcz stworzona pod konkurencyjne granie, e-sport. Świetny balans około 100 dostępnych kart/jednostek w grze, nie ma tak zwanych \"zapychaczy\". \n\nŻadnego p2w ani chciwości ze strony tworców gry. Po kupieniu gry mamy dostęp do całej zawartości, jedyną dodatkowo opcją zakupu są wizualne pierdoły typu emotki, skiny itd. Takie opcje wsparcia i docenienia firmy tworzącej tą unikalną grę.\n\nObecnie w early access i trzeba kupić grę, żeby mieć możliwość natychmiastowego grania. Można też zapisać się do kolejki o klucz na stronie gry (takie rozwiązanie z powodu dużej liczby osób chętnych na tą gre, serwery muszą żyć). Niedługo nie będzie takich problemów, bo gra docelowo została stworzona pod f2p. \n\nFirma tworząca tą grę została ufundowna, założona przez małą grupę osób w przeszłości \"zawodowo\" zajmującymi się grą w pokera. Nieprzeciętne osoby z sukcesami na obszarze turniejów pokerowych, jak i konkursów informatycznych na dużą skalę. Być może rownież dlatego ta gra jest dobra. Czasem mam wrażenie, że twórcy co niektórych gier nie mają pojęcia co robią i sami nie graja w swoje twory. Nie w tym wypadku. \n\nJedynym minusem, chociaż też nie dla wszystkich, może okazać się szata graficzna. Generalnie zupełnie to nie przeszkadza w cieszeniu sie rozgrywką, no chyba, że dla kogoś grafika to coś najważniejszego w grze... ale w takim wypadku, to po prostu tego typu gry nie są dla takiej osoby.\n\nGeneralnie polecam każdemu, kto chce czasem pogimnastykować mózg. Ręce też przy okazji trochę odpoczną od grania w lola, fortnite itd. :P\n", "timestamp_created": 1521261566, "timestamp_updated": 1521261566, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "40850801": {"recommendationid": "40850801", "author": {"steamid": "76561197998733409", "num_games_owned": 18, "num_reviews": 4, "playtime_forever": 5044, "playtime_last_two_weeks": 5044, "last_played": 1521747199}, "language": "english", "review": "The easiest way to describe Prismata is to call it a RTS-themed (think Starcraft) chess. Chess comparison comes from the fact it has 0 RNG of any kind and no hidden info so the game is deterministic i.e. one of the players has a guaranteed win based on the starting positions. But just like Chess, Prismata is incredibly complex where solving it is impossible.\n\nPlayers start with 6 or 7 Drones that harvest gold (2nd player starts with 1 extra drone to compensate), gold buys you technology structures that produce blue/red/green resources (not official names, but that's the accepted naming convention in the community). Subsequently gold and tech resources buy attackers/defenders and your goal is to kill opponent's units while protecting your fragile drones and attackers. Sounds simple at its core.\n\nThe biggest draw to Prismata IMO is the fact that even though it is deterministic, games play out completely differently each time and you aren't required to memorize openings like in a game like Chess. This is achieved by giving players random units each game (There's about 100 units in the random unit pool right now and each game you get 5-11 random ones, 8 being the number for standard 'tournament' mode). \"Wait, didn't you say there is no RNG?\". Yes and I wasn't lying - even though the units change, they are mirrored for both players! Once the game starts, nothing will depend upon RNG determining the outcome, it's up to your and your ability to come up and execute a superior strategy. A unit may be super good in a particular set of units, but get completely countered in another - figuring out which strategy to choose is a challenging but fun task. \n\nAnother cool part is that players don't own the \"cards\" (units), all the units are available to everyone in competitive PvP mode so there's absolutely 0 gameplay advantage to paying players (they can get some sweet cosmetics though!). This also means that devs have no qualms about balancing units - no one can complain that their cards got nerfed so devs can act swiftly and keep the balance at the top notch state.\n\nIf talking about the cons of the game graphics definitely stand out - the art may seem a bit \"cheap\" and the play screen may seem bland and generic. It obviously has a lot to do with the fact that developing team is small (3-5 people) and don't have a huge budget, but it's also because devs favour functionality and clarity over flashiness. The gamestate in Prismata can get rather complex with nearly 100 units on each side in some cases so unnecessary animations/flashy effects would slow down the game and clutter the screen.\n\nAnother downside to a lot of players may be that the game has no comeback mechanics, if you fall behind and your opponent overwhelmed you, you dont have a path to counter him most of the time - the game snowballs. So an early mistake or inefficiency in your build may easily get punished down the line by good players. The upside of this though is that if you see you are clearly behind, there's no need to wait until you \"bleed out\", you can concede and move on to the next game, trying not to repeat the same mistake again in the future. In some games with uncertainity/hidden info sometimes you know you have only 5% chance to win, but you sort of have to stick around for another 15-20 minutes just in case opponent makes a mistake which can be incredibly frustrating.\n\nThe game also has a lot of great features. Replays seems like no brainer in a competitive game, but there's also a super easy way to share replays with other players through a replay code. This coupled with the fact that the game has 0 hidden info means there's no secret strategies to hide, you can very easily find replays of top players and see how they played a certain set. You can also spectate games very easily, like the top players playing on the ladder live. Another amazing feature is the ability to analyze a game - if you think you made a mistake at some point, you can go to that part of the replay and open it in analysis mode to play out the game from both players sides and see whether a different line of play might have changed the outcome.\n\nOverall Prismata is a unique strategy game with very deep and challenging gameplay if you decide to see past the bland exterior and decide to actually try it.", "timestamp_created": 1521213851, "timestamp_updated": 1521213851, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40842665": {"recommendationid": "40842665", "author": {"steamid": "76561198005395829", "num_games_owned": 126, "num_reviews": 2, "playtime_forever": 1143, "playtime_last_two_weeks": 1143, "last_played": 1521243670}, "language": "english", "review": "I remember playing this game 4 years ago.\nIt still messes with my head.", "timestamp_created": 1521179848, "timestamp_updated": 1521179848, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40840147": {"recommendationid": "40840147", "author": {"steamid": "76561198030783548", "num_games_owned": 94, "num_reviews": 5, "playtime_forever": 1613, "playtime_last_two_weeks": 1613, "last_played": 1521745853}, "language": "english", "review": "Very unique and fun game.  Love the challenging aspect that really makes me think.  Learning curve is steep, but that's part of the enjoyment.", "timestamp_created": 1521165240, "timestamp_updated": 1521165240, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.501458", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40839382": {"recommendationid": "40839382", "author": {"steamid": "76561197971323591", "num_games_owned": 535, "num_reviews": 9, "playtime_forever": 91, "playtime_last_two_weeks": 91, "last_played": 1521161514}, "language": "english", "review": "[h1]IMPORTANT UPDATE:[/h1]\n\nThe developers of this game reached out to me and explained that, when Prismata launches, it's intended to be a free-to-play game supported by cosmetic microtransactions. That completely changes my opinion of their monetization model.\n\nI still think their advertising/store page could stand to make it a [i]little[/i] clearer that the $25 cost is more of a 'thanks for supporting us, have some cool bonuses' thing than the actual [i]price[/i] of the game... but that's not enough of a gripe to warrant giving this game a negative review. As such, I have flipped my review to Positive.\n\nI'm including the original text of the review here, for posterity's sake:\n\n\n\n\nFun strategy game with interesting mechanics.\n\nUnfortunately, the game contains an abusive f2p lootbox/\"premium currency\" monetization scheme, which I am not willing to accept in a $25 indie game, much less an Early Access indie game.\n\nThis is a dealbreaker for me, so I'll be refunding it. I hope they remove this tripe so I can re-purchase the game, because it seems like exactly the kind of thing I'd love.\n\nApparently you can only unlock cosmetics via this system, but I don't really care. These business practices are abusive and gross and have no place in a game like this.", "timestamp_created": 1521161768, "timestamp_updated": 1521173253, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.522952", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40838026": {"recommendationid": "40838026", "author": {"steamid": "76561198027604680", "num_games_owned": 269, "num_reviews": 4, "playtime_forever": 1311, "playtime_last_two_weeks": 1311, "last_played": 1521673852}, "language": "english", "review": "This game is fantastic and like nothing I have ever played.  I am not good at the game, but I enjoy every moment of the puzzle.  The new campaign and the combat excercises do wonders to teach how to actually think about and play the game.", "timestamp_created": 1521154520, "timestamp_updated": 1521154520, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501458", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40834271": {"recommendationid": "40834271", "author": {"steamid": "76561198069562319", "num_games_owned": 52, "num_reviews": 1, "playtime_forever": 980, "playtime_last_two_weeks": 980, "last_played": 1521482212}, "language": "english", "review": "Very enjoyable game to sit down and relax. I'm usually a heavy fps gamer like cs and it's nice to have a game to chill while playing.", "timestamp_created": 1521139648, "timestamp_updated": 1521139648, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501458", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40826228": {"recommendationid": "40826228", "author": {"steamid": "76561198040981918", "num_games_owned": 6, "num_reviews": 1, "playtime_forever": 618, "playtime_last_two_weeks": 1, "last_played": 1521062774}, "language": "english", "review": "Great game, more competetive, balanced and deep than other turn based stratetgy game I've ever played.", "timestamp_created": 1521111079, "timestamp_updated": 1521111079, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.501458", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40823270": {"recommendationid": "40823270", "author": {"steamid": "76561198124446810", "num_games_owned": 17, "num_reviews": 1, "playtime_forever": 474, "playtime_last_two_weeks": 226, "last_played": 1521337436}, "language": "english", "review": "This is a deceptively hard game but it is so satisfying to beat the challanges and win. Prismata should be on any strategy game enthusiast's radar.", "timestamp_created": 1521094685, "timestamp_updated": 1521094685, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40817897": {"recommendationid": "40817897", "author": {"steamid": "76561198021915159", "num_games_owned": 106, "num_reviews": 1, "playtime_forever": 567, "playtime_last_two_weeks": 567, "last_played": 1521480299}, "language": "danish", "review": "I really enjoy this game allready palyed 2 hours. if u like Hearthstone u will really fast like this too.\nI played Hearthstone since beta. And i really Enjoyed PrisMata. U will Leran this game fast.", "timestamp_created": 1521064450, "timestamp_updated": 1521064450, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40815183": {"recommendationid": "40815183", "author": {"steamid": "76561198395551856", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 2113, "playtime_last_two_weeks": 2113, "last_played": 1521659150}, "language": "english", "review": "This is my first Steam review, but this game truly embodies the turn-based strategy genre and I really hope both the game and genre succeed. I've played both Heartstone and Gwent, but slowly grew bored due to the lack of strategic depth and RNG. Prismata is the exact opposite and is truly not P2W as there's no deck building or cards necessary to be competitive. \n\nI would describe it is a cross between Dominion and Starcraft. Like Dominion, players are given a random set of cards each game to formulate their game plan. And like Starcraft, players must harvest resources to produce units while advancing their tech. The game is easy to pick up but staggeringly difficult to master and I'm really enjoying being terrible at it. If you enjoy RTS games but without the distractions of APM, robot-like timing, and micro, then this is the game for you. \n\nLastly, If you're holding out because of the graphics, don't. I almost passed myself, but am so glad I didn't. I quickly became immersed in the game play and strategy, and stopped thinking about it altogether.", "timestamp_created": 1521054287, "timestamp_updated": 1521054440, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40812560": {"recommendationid": "40812560", "author": {"steamid": "76561198050491271", "num_games_owned": 212, "num_reviews": 6, "playtime_forever": 2225, "playtime_last_two_weeks": 2225, "last_played": 1521697413}, "language": "english", "review": "New game unlike any others I've played. Very strategical and interesting", "timestamp_created": 1521046209, "timestamp_updated": 1521046209, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40812466": {"recommendationid": "40812466", "author": {"steamid": "76561198055603777", "num_games_owned": 49, "num_reviews": 2, "playtime_forever": 5688, "playtime_last_two_weeks": 5731, "last_played": 1521649529}, "language": "english", "review": "I love everything about this game...", "timestamp_created": 1521045948, "timestamp_updated": 1521045948, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501458", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40812458": {"recommendationid": "40812458", "author": {"steamid": "76561198042936879", "num_games_owned": 531, "num_reviews": 2, "playtime_forever": 2038, "playtime_last_two_weeks": 2038, "last_played": 1521595503}, "language": "english", "review": "Insanely fun and deep. Definitely gonna keep playing.", "timestamp_created": 1521045920, "timestamp_updated": 1521045920, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501458", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40807933": {"recommendationid": "40807933", "author": {"steamid": "76561198079724968", "num_games_owned": 98, "num_reviews": 2, "playtime_forever": 4269, "playtime_last_two_weeks": 4269, "last_played": 1521684462}, "language": "english", "review": "Pretty great game with minor flaws (but they are working on the game).\n\nso how to describe it:\n\n-highly strategic\n-there is no influence of rng besides who starts the game which can be an advantage or a disadvantage - depends on the set (comparable to chess)\n-easy to understand hard to master (there is a lot of training available in the game)\n-no p2w (u cant gat an advantage ingame with paying for it - u can only pay for \"skins\", compareable to dota2)\n-great replay and analysis options\n-great AI (at the start u will loose to it pretty hard if its on higher levels)\n\n-right now not to many people playing it so u often play the same people\n-although the time limit seems way then enough, it can be stressfull\n\nSo basicly the game is hard and there are a lot of players, who play it for a while - so they will beat u probably when u start. But the game offers u all the help to get better (dont skip the practice part). There was a patch which should help with matchmaking. The steam launch wasnt to long ago, so i guess over the time there will be more people playing the game resulting in a better expierince.", "timestamp_created": 1521031827, "timestamp_updated": 1521031827, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40804510": {"recommendationid": "40804510", "author": {"steamid": "76561197972478432", "num_games_owned": 319, "num_reviews": 15, "playtime_forever": 345, "playtime_last_two_weeks": 345, "last_played": 1521017036}, "language": "english", "review": "This game deserves your attention. It is a CCG with no netdecking, no pay2win, no RNG for when you lose.  You have all the same tools as your opponent to succeed. It is very reminecence of Chess mixed with Starcraft2.  An absolute joy to play and one that deserves everyone to check it out.  :D   Buy this game, support these incredible devs and enjoy!", "timestamp_created": 1521016793, "timestamp_updated": 1521016793, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501458", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40804031": {"recommendationid": "40804031", "author": {"steamid": "76561198013817844", "num_games_owned": 85, "num_reviews": 1, "playtime_forever": 756, "playtime_last_two_weeks": 756, "last_played": 1521655262}, "language": "english", "review": "Get it.\n\nYou're welcome.", "timestamp_created": 1521014160, "timestamp_updated": 1521014160, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40799821": {"recommendationid": "40799821", "author": {"steamid": "76561198049892643", "num_games_owned": 83, "num_reviews": 1, "playtime_forever": 2775, "playtime_last_two_weeks": 2775, "last_played": 1521297733}, "language": "schinese", "review": "被游戏折服，被游戏开发团队吓尿，随便看个创始人介绍吧：\n\n[h1]创始人-Elyot Grant[/h1]：智商超过9000的前神童，Elyot获得数学国际荣誉（[b]2005 IMO铜牌[/b][spoiler]即奥数，每个国家最多6个名额[/spoiler]），但拒绝享受除视频游戏之外的任何东西。 Elyot在获得Reddit Starcraft锦标赛方面比在获得北美计算机研究协会最负盛名的研究奖（Outstanding Male Undergraduate Researcher Award 2010——wtf?）方面获得更多的自豪感。 为了[spoiler]浪费自己的才能[/spoiler]，Elyot创立了Lunarch工作室来追求他的真情。\n\n其他成员也是大都[b]奥数、MIT[/b]出身，有兴趣了解的可以看[url=http://lunarchstudios.com/]他们官网[/url]...", "timestamp_created": 1520991561, "timestamp_updated": 1521278720, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40799564": {"recommendationid": "40799564", "author": {"steamid": "76561198059948329", "num_games_owned": 1258, "num_reviews": 16, "playtime_forever": 2266, "playtime_last_two_weeks": 2266, "last_played": 1521718182}, "language": "schinese", "review": "先说明：游戏可能需要加速器\n1.游戏流程就是获取资源 -> 造建筑/造兵或者别的（也可以看成DBG中用钱买卡） -> 进攻/防守布置和结算（这个环节稍微有点像MTG） -> 获取资源的循环，胜利条件就是把对面所有建筑（或者说卡牌）都打爆\n所以游戏玩起来有点像回合制版的RTS，又有点像DBG，又好像什么都不像。\n2.你可以造的东西（或者说可以买的卡）就像DBG那样可以随机也可以自己设置，双方都一样\n3.资源有5种，比一般的DBG复杂很多\n4.SET UP后不存在随机性，所以策略性很强\n5.卡牌使用次数用限（也意味着资源是有限的），进一步提高了策略性，同时一局游戏也可以控制在10-20分钟之间\n综上，这款快节奏的对抗游戏堪称为策略玩家量身打造。至少我玩过之后感觉可以把所有DBG都扔了。\n\n入门指南：\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=1333205860", "timestamp_created": 1520990180, "timestamp_updated": 1521387752, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.525132", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40798978": {"recommendationid": "40798978", "author": {"steamid": "76561198086719252", "num_games_owned": 71, "num_reviews": 2, "playtime_forever": 6027, "playtime_last_two_weeks": 6027, "last_played": 1521726189}, "language": "english", "review": "This is the game I was waiting for! I think it is the best game I have ever played. Too bad I only found out about it two days ago.", "timestamp_created": 1520987298, "timestamp_updated": 1520987298, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40797704": {"recommendationid": "40797704", "author": {"steamid": "76561198279574548", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 32, "playtime_last_two_weeks": 32, "last_played": 1520981793}, "language": "english", "review": "Really fantastic competitive strategy game and the single player content especially the first part of the campaign and puzzles are very well done as well.", "timestamp_created": 1520980953, "timestamp_updated": 1520980953, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40788723": {"recommendationid": "40788723", "author": {"steamid": "76561198093771580", "num_games_owned": 32, "num_reviews": 1, "playtime_forever": 3125, "playtime_last_two_weeks": 3125, "last_played": 1521623225}, "language": "english", "review": "This game is absolutly amazing. Deep, strategic, divers and really (really) well balanced. \n25$ and you get 100% great content. [b] 11/10 [/b] would buy again.", "timestamp_created": 1520952068, "timestamp_updated": 1520952068, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.501458", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40787112": {"recommendationid": "40787112", "author": {"steamid": "76561198336595765", "num_games_owned": 14, "num_reviews": 3, "playtime_forever": 767, "playtime_last_two_weeks": 767, "last_played": 1521656299}, "language": "english", "review": "The game is really great. But there should be at least distant plans to update the visuals. It can be done without ruining the particularity of current design, and even improve on it. It's definitely not bad as it is now, but of course not ideal. This game has a lot potential and currently a bright future.", "timestamp_created": 1520947503, "timestamp_updated": 1520947503, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40786213": {"recommendationid": "40786213", "author": {"steamid": "76561198145801216", "num_games_owned": 66, "num_reviews": 1, "playtime_forever": 1404, "playtime_last_two_weeks": 1404, "last_played": 1521585112}, "language": "english", "review": "Great game. Great Developers. Absolutely worth it!", "timestamp_created": 1520944843, "timestamp_updated": 1520944843, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "40771701": {"recommendationid": "40771701", "author": {"steamid": "76561198188406535", "num_games_owned": 58, "num_reviews": 11, "playtime_forever": 893, "playtime_last_two_weeks": 893, "last_played": 1521252214}, "language": "english", "review": "next gen chess\n\nfirst day 8 hrs\n\nannoyed by random outcomes at slay of the spire? try this game.\n\n2 GB RAM is enough, also did install on win 10 tablet with atom Z3735F.", "timestamp_created": 1520882610, "timestamp_updated": 1521367161, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.527173", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40767546": {"recommendationid": "40767546", "author": {"steamid": "76561197960605937", "num_games_owned": 229, "num_reviews": 1, "playtime_forever": 147, "playtime_last_two_weeks": 0, "last_played": 1518707854}, "language": "english", "review": "I'm a Kickstarter backer of this game. I was able to play this game for quite some time and followed the development closey.\n\nThe unique game idea and the eloborate execution is what makes this game so great.\n\nIt's very difficult to compare to any existing game. Imagine you play chess, but every match  with different \"units\".\n\nGive it a try.", "timestamp_created": 1520870261, "timestamp_updated": 1520870261, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.528861", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40764883": {"recommendationid": "40764883", "author": {"steamid": "76561197998541661", "num_games_owned": 182, "num_reviews": 1, "playtime_forever": 1315, "playtime_last_two_weeks": 1315, "last_played": 1521246469}, "language": "english", "review": "Amazing chess-like card game. The result of the game is only decided by the skill of both player. You'll lose a lot in the beginning but the community is really friendly and if you ask them they'll surely help you get better.\n\nDon't stop at \"early access\", there's more than enough content already as the game has been in developpment for several years.", "timestamp_created": 1520862502, "timestamp_updated": 1520862502, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40763732": {"recommendationid": "40763732", "author": {"steamid": "76561198072621642", "num_games_owned": 315, "num_reviews": 8, "playtime_forever": 1124, "playtime_last_two_weeks": 0, "last_played": 1520217353}, "language": "english", "review": "Prismata is a combination of turn-based and collectible card games mechanics with real-time strategy elements.\nIf you're looking for unique turn-based sci-fi card game, you should definitely try it out.\n\nThe game is super easy to lean. You build up an economy and spend resources to acquire new techologies and units.\nEach game is also unique thanks to the randomly-generated extra unit pool, so your matches will be different every time. \n\nAlso even if the game is played with cards, it doesn't contain pre-built decks, or random advantages. The outcome of your match is determined by your skills alone. And when you're feeling up for it, you can choose to play the Ranked Play mode to play against other players of similar skills as yours and compete into the leaderboards.\n\nNo pay-to-win elements, no card packs to open, etc.; all units are free for all players.\nA great game with lots of depth. Definitely worth looking into.", "timestamp_created": 1520858551, "timestamp_updated": 1520858551, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.543208", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40753944": {"recommendationid": "40753944", "author": {"steamid": "76561197991854700", "num_games_owned": 139, "num_reviews": 1, "playtime_forever": 4687, "playtime_last_two_weeks": 1518, "last_played": 1521675558}, "language": "english", "review": "Prismata is the best 1v1 turn based competitive strategy puzzle card game currently in existence and might well be hold a spot at the top of all those categories on their own as well. Think of playing Starcraft on a Chess board with a shared set of units from a current pool ~100 (to be expanded upon post launch) instead of an actual board.\n\nAfter dabbling with the public demo client towards the end of the Kickstarter campaign over 3 years ago and eventually getting my hands on an alpha key this game quickly proceeded to erase an entire week from my life until I couldn't resist the urge to support the development on the $80 Centurion Tier. Thinking back I certainly underpaid.", "timestamp_created": 1520809539, "timestamp_updated": 1520809539, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "40753360": {"recommendationid": "40753360", "author": {"steamid": "76561198078381307", "num_games_owned": 354, "num_reviews": 6, "playtime_forever": 2255, "playtime_last_two_weeks": 2255, "last_played": 1521746306}, "language": "english", "review": "This is one of those games where i can get destroyed almost every time but still enjoy it. The layers of strategy are what make this it for me.", "timestamp_created": 1520807164, "timestamp_updated": 1520807164, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40732404": {"recommendationid": "40732404", "author": {"steamid": "76561198114512220", "num_games_owned": 187, "num_reviews": 1, "playtime_forever": 482, "playtime_last_two_weeks": 482, "last_played": 1520950883}, "language": "russian", "review": "Отличная игра. Похоже на шахматы или настольную игру во вселенной Starcraft. Рандом отсутствует, только ваши мозги решают исход партии.", "timestamp_created": 1520748539, "timestamp_updated": 1520748539, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40731581": {"recommendationid": "40731581", "author": {"steamid": "76561198077983851", "num_games_owned": 70, "num_reviews": 2, "playtime_forever": 5149, "playtime_last_two_weeks": 5149, "last_played": 1521726244}, "language": "english", "review": "I haven't felt this good improving at and winning Ranked games in a game since Starcraft 2. It only took me about an hour to get all the basics of the game, and I've been learning and improving every match since. The game is meticulously designed, from the balance of the over-100 units to the onboarding through the Campaign mode. Don't let the seemingly-complex UI fool you, it's very simple and made to be easy to reason-about even in complex game states. It's extremely fun, and virtually every feature I've wanted that was lacking in other similar games is in here:\n - Time bank for turns so you can take more time on complex turns and there's a reason to play quickly on simple turns.\n - Once you are in, there's no $$ commitment to stay competitive. The only thing you can pay for is cosmetics and single-player content (puzzles, campaign missions)\n - Options to change the UI for streaming purposes\n - Fantastic replay system\n - Spectator mode built in from day one\n - In-game automated tournaments with interesting rulesets\n - Well thought-out hotkeys\n\nFrom the gameplay to everything surrounding it, Prismata is amazingly well-designed. I recommend it without hesitation to any fan of strategy games.", "timestamp_created": 1520745690, "timestamp_updated": 1520745690, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.540070", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40728065": {"recommendationid": "40728065", "author": {"steamid": "76561198100413809", "num_games_owned": 87, "num_reviews": 4, "playtime_forever": 19, "playtime_last_two_weeks": 19, "last_played": 1520869015}, "language": "schinese", "review": "期待这款游戏很久了。兴高采烈的买了以后，发现卡在界面进不去。不是一个人这样了。一个群里一共就十几个人，就有5 6个人进不去。希望尽快修复吧。先给好评了。", "timestamp_created": 1520732949, "timestamp_updated": 1520732949, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40727670": {"recommendationid": "40727670", "author": {"steamid": "76561198087356923", "num_games_owned": 141, "num_reviews": 15, "playtime_forever": 2225, "playtime_last_two_weeks": 2225, "last_played": 1521226141}, "language": "english", "review": "So far gameplay is 10/10. If you dont mind graphics value strategic rts like turnbased gameplay 20$ is well worth", "timestamp_created": 1520731594, "timestamp_updated": 1520731594, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.501458", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40719874": {"recommendationid": "40719874", "author": {"steamid": "76561197990641841", "num_games_owned": 14, "num_reviews": 4, "playtime_forever": 4389, "playtime_last_two_weeks": 4389, "last_played": 1521663968}, "language": "english", "review": "I always loved starcraft but was intimidated by the high mechanical skill required to do well. Prismata is a chance for me to play a game in the same vein without feeling held back by my execution speed.\n\nHad to play over 350 matches against the AI to finally beat it more than 50% of the time on the highest difficulty but it was worth it.\n\nI definitely recommend the game to anyone who likes card games, strategy games, or both!", "timestamp_created": 1520707379, "timestamp_updated": 1520707461, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.521888", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40719136": {"recommendationid": "40719136", "author": {"steamid": "76561197996726659", "num_games_owned": 306, "num_reviews": 9, "playtime_forever": 1772, "playtime_last_two_weeks": 1772, "last_played": 1521715599}, "language": "english", "review": "Great card game, with no RNG. Manage an economy like in a RTS, play cards, and make strategical move like in chess :)", "timestamp_created": 1520705523, "timestamp_updated": 1520705523, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.525132", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40717654": {"recommendationid": "40717654", "author": {"steamid": "76561197969248047", "num_games_owned": 466, "num_reviews": 2, "playtime_forever": 867, "playtime_last_two_weeks": 466, "last_played": 1521587255}, "language": "english", "review": "Played this game endlessly before it came to steam. Estimated 500+ hours, maybe more. Incredible depth, replayability and fair monetization. No strength can be bought, only cosmetics. \n\nExpect a deep, competitive, strategic experience - on a similar level to Chess. The game never grows stale because of how the units available change with each match.", "timestamp_created": 1520702203, "timestamp_updated": 1520702203, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.501458", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40712251": {"recommendationid": "40712251", "author": {"steamid": "76561198149453999", "num_games_owned": 23, "num_reviews": 4, "playtime_forever": 412, "playtime_last_two_weeks": 412, "last_played": 1520871944}, "language": "polish", "review": "This game is really good", "timestamp_created": 1520690481, "timestamp_updated": 1520690481, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.481752", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40711837": {"recommendationid": "40711837", "author": {"steamid": "76561198045706022", "num_games_owned": 1071, "num_reviews": 12, "playtime_forever": 866, "playtime_last_two_weeks": 866, "last_played": 1520961157}, "language": "english", "review": "This is currently my favorite game that i am terrible at playing!  There are no excuses, like rng, to make you believe that you are good.  The \"tutorials\" will even destroy you, if you are as bad as I am.  I played 8 hours of Prismata yesterday and did not even realize it!  If it weren't for the Sea Thieves Beta I would have played 12!  Highly recommended even in its early access state.", "timestamp_created": 1520689447, "timestamp_updated": 1520689447, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.525022", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40707213": {"recommendationid": "40707213", "author": {"steamid": "76561198222413424", "num_games_owned": 39, "num_reviews": 12, "playtime_forever": 233, "playtime_last_two_weeks": 233, "last_played": 1520861184}, "language": "english", "review": "Great community, amazing developers and most importantly -  unique gameplay. I fell in love with this game, its like starcraft but as a card game. If you like strategies and are tired of rng based card games, just get it", "timestamp_created": 1520677851, "timestamp_updated": 1520677851, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.563956", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40706762": {"recommendationid": "40706762", "author": {"steamid": "76561198032364608", "num_games_owned": 41, "num_reviews": 1, "playtime_forever": 2569, "playtime_last_two_weeks": 2327, "last_played": 1521659080}, "language": "german", "review": "Zusammen mit Schach für mich das genialste Spiel auf diesem Planet!", "timestamp_created": 1520676595, "timestamp_updated": 1520676595, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40703957": {"recommendationid": "40703957", "author": {"steamid": "76561197988386590", "num_games_owned": 82, "num_reviews": 1, "playtime_forever": 1984, "playtime_last_two_weeks": 1910, "last_played": 1521701455}, "language": "english", "review": "The ultimate strategy game. Every match is a new challenge.", "timestamp_created": 1520668584, "timestamp_updated": 1520668584, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.483076", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40700032": {"recommendationid": "40700032", "author": {"steamid": "76561198158149244", "num_games_owned": 440, "num_reviews": 117, "playtime_forever": 435, "playtime_last_two_weeks": 435, "last_played": 1521350168}, "language": "english", "review": "Solid Game. In fact in might actually be brilliant. It's resource managment done correctly and it's a lot more fun than I would have thought.\n\nI'll grade after I've played it more than a few hours but I'm already ready to say it's winner for me.", "timestamp_created": 1520654408, "timestamp_updated": 1520654408, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40699030": {"recommendationid": "40699030", "author": {"steamid": "76561198040100269", "num_games_owned": 201, "num_reviews": 2, "playtime_forever": 2017, "playtime_last_two_weeks": 1729, "last_played": 1521726677}, "language": "english", "review": "Prismata is commonly compared to primarily three games: Hearthstone, Starcraft, and Chess.  At the end of the day, Prismata is nothing like any of those.....not really anyway.  Chess is one of the oldest, most universal strategy games on the planet.  Hearthstone and Starcraft are two of the biggest games from one of the largest gaming companies.  By contrast, Prismata is a new game by a small, unknown development team: Lunarch studios.\n\nSo why do so many people compare Prismata to these gaming juggernauts?  Because Lunarch Studios has managed to create a game which distills all of the primary components of an RTS into a turn-based game of pure strategy.  There is economy, attack, and defense; all in a raw, unadulterated form.  Once you look past it's average UI, you'll find a game that's not quite like anything that's come before.\n\nThe game is very complex, with a fairly steep learning curve, and an incredibly high skill ceiling.  There are debates whether it will ever be reached, or if it's even possible to code an AI that will beat the best human players consistently.  There's no RNG in matches, beyond the coin flip on who goes first.  Whoever makes the better decisions will win the match….period.", "timestamp_created": 1520650695, "timestamp_updated": 1520650695, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.584346", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40697763": {"recommendationid": "40697763", "author": {"steamid": "76561198012272873", "num_games_owned": 99, "num_reviews": 2, "playtime_forever": 7422, "playtime_last_two_weeks": 3348, "last_played": 1521701275}, "language": "english", "review": "Probably the most unique and well-balanced strategy game I've played.", "timestamp_created": 1520645863, "timestamp_updated": 1520645863, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40695732": {"recommendationid": "40695732", "author": {"steamid": "76561198067815771", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 3635, "playtime_last_two_weeks": 3635, "last_played": 1521696117}, "language": "english", "review": "Addicted. Like many others, I stayed up until 2am by mistake playing this game.\n\nI've been playing for years with the hundreds of others that got keys early on and I have to say, the learning curve is steep, but now that newer players are laddering, it is nice to see that I have gotten better! Still playing years later. Excited that this game is FINALLY getting a bigger player base :D IT IS SO GOOD.", "timestamp_created": 1520637776, "timestamp_updated": 1520888610, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40692025": {"recommendationid": "40692025", "author": {"steamid": "76561198079569147", "num_games_owned": 427, "num_reviews": 34, "playtime_forever": 828, "playtime_last_two_weeks": 828, "last_played": 1521578806}, "language": "english", "review": "original, deep and fun experience\n\nit's like these guys brought popular game from the future in order to get filthy rich\n\nbut is the world ready for Prismata? will their master plan work?\nlet's see (and play)", "timestamp_created": 1520626328, "timestamp_updated": 1520626328, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.521531", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40690693": {"recommendationid": "40690693", "author": {"steamid": "76561197994007759", "num_games_owned": 354, "num_reviews": 24, "playtime_forever": 170, "playtime_last_two_weeks": 170, "last_played": 1520809324}, "language": "english", "review": "Exceptionally brilliant card game that is completely different from anything else.\n\nMy play-time on steam is misleading, as it was playable for a long time outside of Steam.", "timestamp_created": 1520622579, "timestamp_updated": 1520622641, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "40689581": {"recommendationid": "40689581", "author": {"steamid": "76561197960388978", "num_games_owned": 64, "num_reviews": 1, "playtime_forever": 2484, "playtime_last_two_weeks": 1261, "last_played": 1521634236}, "language": "english", "review": "Been a player for a few years, very fun game to dip in and out of but careful of addiction, many dip in can cost a full evening!", "timestamp_created": 1520619586, "timestamp_updated": 1520619586, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40689047": {"recommendationid": "40689047", "author": {"steamid": "76561198127006602", "num_games_owned": 2395, "num_reviews": 28, "playtime_forever": 509, "playtime_last_two_weeks": 509, "last_played": 1521415942}, "language": "spanish", "review": "Interesante juego , por ahora le doy positivo para que llegue a las 10 reseñas y este calificado. Ya veremos que onda mas adelante", "timestamp_created": 1520618239, "timestamp_updated": 1520618239, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40688939": {"recommendationid": "40688939", "author": {"steamid": "76561198010140999", "num_games_owned": 121, "num_reviews": 1, "playtime_forever": 12289, "playtime_last_two_weeks": 4170, "last_played": 1521604646}, "language": "english", "review": "Prismata is an excellent and genuinely unique strategy game. If you're someone who loves games like Magic or Hearthstone, but have ever been frustrated with their high variance/'luck' or lack of depth, this game is for you. The multiplayer is solid, having been developed for several years, and it really shows. The single player features aren't fully fleshed out yet but the puzzles are really fun. I can't recommend the game highly enough.", "timestamp_created": 1520617963, "timestamp_updated": 1520617963, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.544595", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40684761": {"recommendationid": "40684761", "author": {"steamid": "76561198102066579", "num_games_owned": 12, "num_reviews": 4, "playtime_forever": 93, "playtime_last_two_weeks": 93, "last_played": 1520705420}, "language": "schinese", "review": "卡在界面进不去，开加速也不行，希望官方能提供一个解决办法，不止我一个人遇到了。游戏先好评支持了。", "timestamp_created": 1520608120, "timestamp_updated": 1520608120, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.597315", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40682650": {"recommendationid": "40682650", "author": {"steamid": "76561198079927040", "num_games_owned": 3, "num_reviews": 1, "playtime_forever": 76194, "playtime_last_two_weeks": 9228, "last_played": 1521730425}, "language": "english", "review": "This game is incredibly fun to play! I have over 20 thousand games played so far since the early Kickstarter days, and still I find every game unique on its own. I still feel like learning new things every day too, like opening an endless toybox! The game rewards skill insanely and you can play it very reactively and interactively at any skill level. Even with the lack of RNG, there are some big moments in the game that can arise from interesting, asymmetric strategies (the game encourages those). Nothing feels as satisfying as executing your plan perfectly and outplaying someone, knowing you earned your win and can't call it luck. No comeback mechanics, only if your opponent makes a mistake\n\nThe development team, and the community in general, is the best one I have seen in any esports title. And I believe Prismata has the potential to be one day considered among the big esports titles, it only needs more recognition. It is seriously underrated right now. Prismata is genuinely free to play, no grinding, you can buy cosmetics but you also get points for them if you just play.\n\nIf you like strategy and card/board games, you should not miss out on Prismata. It is a pure essence of strategy which creates its own genre. Everything in the game is a resource, yet it is approachable casually if you like puzzles or playing against challenging bots. It is a true gem, possibly the most innovative one in the last 2 decades at least. I won't play any other game for a long, long time.", "timestamp_created": 1520603101, "timestamp_updated": 1520604832, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40678146": {"recommendationid": "40678146", "author": {"steamid": "76561197973596909", "num_games_owned": 47, "num_reviews": 1, "playtime_forever": 25096, "playtime_last_two_weeks": 7249, "last_played": 1521497563}, "language": "english", "review": "Awesome strategy game! No RNG, no pay to win.", "timestamp_created": 1520590782, "timestamp_updated": 1520590782, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40677320": {"recommendationid": "40677320", "author": {"steamid": "76561198002789900", "num_games_owned": 153, "num_reviews": 2, "playtime_forever": 45419, "playtime_last_two_weeks": 1941, "last_played": 1521456816}, "language": "english", "review": "Remarkable game, probably one of the best abstract strategy games of the past 50 years; on par with the very best modern physical board and card games. Takes the fundamental game-theoretic idea of RTS and 4x games -- choosing whether to reinvest your resources, or to apply them to disrupt your opponent -- down to a tight, minimal core, turning it into a sharp contest to calculate the most efficient variations and exploit commitments made by your adversary.\n\nDegree of elegance and strategic depth is very similar to Dominion -- numerous \"general principles\" to learn about with an incredible number of subtleties, plus a wealth of individual unit and unit combinations to build an specialized understanding of. Hundreds of hours worth of insights await.\n\nSuggestion to new players: the campaign is a very gentle introduction to the rules that might seem tedious and isn't very similar to the experience of the proper game. It's sort of as if Dominion started you out playing solitaire with no cards except money, Smithy, and VP. If you want to jump into the deep end, just go watch a video or read the rules and start playing the real game against bots or other humans. It's not too complicated.", "timestamp_created": 1520588154, "timestamp_updated": 1520594310, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40676641": {"recommendationid": "40676641", "author": {"steamid": "76561198114577159", "num_games_owned": 57, "num_reviews": 1, "playtime_forever": 66856, "playtime_last_two_weeks": 7570, "last_played": 1521705347}, "language": "english", "review": "RIP my college education", "timestamp_created": 1520585747, "timestamp_updated": 1520585880, "voted_up": true, "votes_up": 3, "votes_funny": 4, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "40675988": {"recommendationid": "40675988", "author": {"steamid": "76561198090255624", "num_games_owned": 23, "num_reviews": 1, "playtime_forever": 1752, "playtime_last_two_weeks": 1752, "last_played": 1521603412}, "language": "english", "review": "Really fun strategy game. Creating and executing your own plan from a pool of unique units is such a satisfying feeling. No RNG is a huge plus. Comes with a bunch of puzzles and a pretty decent campaign so far. The gameplay has an absurb amount of depth but isn't too difficult to figure out at a basic level. Artwork can sometimes be lacking but there's a bunch of cool skins so I'd say it makes up for it. The devs are very active in the community and there's lots of events.", "timestamp_created": 1520583431, "timestamp_updated": 1520583431, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.525862", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40675903": {"recommendationid": "40675903", "author": {"steamid": "76561198056571790", "num_games_owned": 4633, "num_reviews": 35, "playtime_forever": 648, "playtime_last_two_weeks": 648, "last_played": 1521381804}, "language": "english", "review": "Just a preliminary review. I've been playing this strategy game since I backed it on Kickstarter, and it has come a long way since its inception, graphically and mechanically, and even though it's in early access the game experience already feels complete. \n\nThe game is great especially if you are into turned based strategy. As others have mentioned, there is no RNG and no deckbuilding in this game, so if you are into a raw strategy experience then you can't go wrong with it; not forgetting to mention that if you need to scratch that competitive itch this game does so perfectly. \n\nAll in all, I have enjoyed playing and will continue to enjoy playing Prismata, and as such I fully recommend it.", "timestamp_created": 1520583118, "timestamp_updated": 1520583118, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.540636", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40675185": {"recommendationid": "40675185", "author": {"steamid": "76561198049362470", "num_games_owned": 256, "num_reviews": 5, "playtime_forever": 2649, "playtime_last_two_weeks": 2649, "last_played": 1521613786}, "language": "english", "review": "It's as good as they say.", "timestamp_created": 1520580361, "timestamp_updated": 1520580361, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40674496": {"recommendationid": "40674496", "author": {"steamid": "76561197960377828", "num_games_owned": 592, "num_reviews": 4, "playtime_forever": 483, "playtime_last_two_weeks": 481, "last_played": 1521605573}, "language": "english", "review": "Owned this since Kickstarter in 2014. Such a great game, basically Red Alert 2 as a card game. No randomness in deck building or the cards you get given. Both players have the exact same units to build, you start with the same money and its turn based.", "timestamp_created": 1520577679, "timestamp_updated": 1520577679, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40673975": {"recommendationid": "40673975", "author": {"steamid": "76561197983083158", "num_games_owned": 125, "num_reviews": 1, "playtime_forever": 110146, "playtime_last_two_weeks": 0, "last_played": 1520009825}, "language": "english", "review": "I love Prismata. It's been 99% of the gaming I've done in the last 3 years since the kickstarter, because it has all the elements of a near-perfect game for me. I like competitive games, and played Starcraft for countless hours, and was also briefly interested in Hearthstone as well. I liked that hearthstone was turn-based, and didn't rely as much on quick fingers, but the RNG gameplay and P2W business model really ruined it for me. \n\nThat's where Prismata comes in, and fills a niche that I didn't know I wanted or even existed. It's all about skill and out-thinking your opponent, and at the top level, thinking several layers deep and up to 5 turns ahead.", "timestamp_created": 1520575787, "timestamp_updated": 1520575787, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.564603", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40671263": {"recommendationid": "40671263", "author": {"steamid": "76561198039284285", "num_games_owned": 41, "num_reviews": 2, "playtime_forever": 1023, "playtime_last_two_weeks": 1023, "last_played": 1521165525}, "language": "english", "review": "This game has the sneakiest and most satisfying puzzles I've ever solved, and has incredibly rich competitive play. It's kept me coming back for years.", "timestamp_created": 1520565220, "timestamp_updated": 1520565220, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.501458", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40671044": {"recommendationid": "40671044", "author": {"steamid": "76561198073461597", "num_games_owned": 21, "num_reviews": 1, "playtime_forever": 2316, "playtime_last_two_weeks": 2316, "last_played": 1521208078}, "language": "english", "review": "FWIW, I've been an alpha tester since 2014. I'm also a top50 player of Dominion (the card game), so I'm going to be reviewing Prismata mostly from my very competitive point of view.\n\nPrismata is a combination of all of the strategy games I love without any of the aspects I hate. It has the variety and replayability of Dominion without the noticeable first player advantage or deck tracking/memorization requirements, it has the build orders and resource management of Warcraft without the dexterity requirements, it has the card interactions and combat management of Hearthstone or Magic without the grinding or pay-to-win. \n\nOn the surface, that sounds incredible, and Prismata really turns out to be almost as incredible as it sounds when it comes to gameplay. The strategic and tactical elements of Prismata (i.e. the entire game) are very fascinating and refreshing, and there's enough depth in the game that it's practically impossible to solve. Despite the unusual combination of mechanics, it all comes together really well and the gameplay flows very smoothly.\n\nDue to the lack of RNG, it lacks the really memorable RNG moments when something super unlikely happens against all odds, as well as the skill element of managing the RNG in your favor. This is seriously the only reason why I'm not immediately dropping all other strategy games in favor of Prismata, because I can appreciate those elements in moderation, but obviously you also get rid of all the frustrating RNG losses that I'm sure we're all too familiar with. There is the \"Events\" game mode though, which is kind of like tournaments with all sorts of crazy variant rules, and I've really been enjoying the ones that introduce some kind of an RNG element into the game.\n\nAs far as the client is concerned, it may not look amazing, but don't let that fool you because it FEELS amazing. You have a hotkey for everything, you don't have to wait for any animations to finish, you can undo if you misclick, in general it just works super fast and smoothly for actually playing the game. When you get experienced enough with the game that you can really start to utilize the full potential of all the hotkeys and stuff, it feels great. I'm sure new players will be able to find their way round the interface just fine, but the pro player experience is in a league of its own. There are a couple of settings that you should turn on (they're disabled by default and I don't have any idea why), namely the \"Show Gold Estimate for Next Turn\" and \"Show Opponent's Unit Supply\" ones. \n\nFor anything else in the game, be it music, graphics, or the story in the campaign, I have to say that it's good enough, but not particularly exciting. Sometimes I keep the Prismata music enabled, sometimes I disable it to listen to whatever music I want, that kind of thing.\n\nThe bottom line is that I think the game is really good, especially for competitive strategy gamers, and I definitely recommend you try it out.", "timestamp_created": 1520564286, "timestamp_updated": 1520564286, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40670543": {"recommendationid": "40670543", "author": {"steamid": "76561198040847386", "num_games_owned": 36, "num_reviews": 1, "playtime_forever": 260992, "playtime_last_two_weeks": 10672, "last_played": 1521700347}, "language": "english", "review": "When I first saw an ad for this game I wasn't hooked. It looked simple and dull and I wasn't able to play right away because it was in closed alpha. I definitely didn't want to put forth the effort needed to get in. Some time later I see a video with gameplay so I decided to take a look at what playing the game actually looked like. At that moment I knew I needed to play the game.\n\nNovember 26th 2014 was the date of my first game. I am more than three years into it and more excited about Prismata than I was when I first got my hands on the game. The game has very simple rules but very complex gameplay. There is no end in sight to how good at Prismata people can get.\n\nIn a standard pvp game, 8-11 units are randomly chosen from a pool of 97 units to make the set that the two competitors will play. More units will be released soon after Steam early access launches and throughout the future. As the game countdown starts your job is to assess the different strategies available that game, how these strategies will interact with each other, and form a concrete plan to achieve your goals. As the game progresses you will have to react to what your opponent decides to do, manage how you spend your resources, and plan out future turns.\n\nIf pvp action isn't what you are into Prismata is still the game for you! Prismata's simple rules and complex interactions makes for a great puzzle medium. With great puzzles already in the game and more to come in the near future, you would be doing great if you just looking for a puzzle game. There are also bots that are a good challenge level for people who don't quite want to get on the ladder but still want to experience the pvp game.\n\nEverything about this game is of the highest quality. Playing the game is made extremely easy. Your turn is made up of several actions. You can undo those actions in any order with a single click of your mouse. Hotkeys are customizable but the units were named so that the first letter in their name can be with the perfect hotkey already. Every game you play is saved as a sharable replay. That replay can be played in real time or can be scrolled through to find the spot you want. The analysis mode lets you change a turn and see how the game would have played out. Spectating live games is as easy as a click of the mouse.\n\nI strongly recommend both the two player game and the single player puzzles. Even if only one of those two things interest you, Prismata definitely worth it.", "timestamp_created": 1520562393, "timestamp_updated": 1520562393, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.627804", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40670458": {"recommendationid": "40670458", "author": {"steamid": "76561197994018082", "num_games_owned": 302, "num_reviews": 2, "playtime_forever": 2158, "playtime_last_two_weeks": 2134, "last_played": 1521714609}, "language": "english", "review": "I've been waiting for this game ever since seeing it on Kickstarter years ago, and it was well worth the wait. Very highly recommended.", "timestamp_created": 1520562122, "timestamp_updated": 1520562122, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40670279": {"recommendationid": "40670279", "author": {"steamid": "76561198025149857", "num_games_owned": 317, "num_reviews": 4, "playtime_forever": 1240, "playtime_last_two_weeks": 499, "last_played": 1521496203}, "language": "english", "review": "This game is everything I ever wanted in a card game. It's basically dominion but without the RNG. When you lose, you know you fucked up somewhere.", "timestamp_created": 1520561414, "timestamp_updated": 1520561414, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40668854": {"recommendationid": "40668854", "author": {"steamid": "76561198086203196", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 183, "playtime_last_two_weeks": 183, "last_played": 1521442267}, "language": "english", "review": "Amazing game. I've been playing for almost three years now, and it never gets old.", "timestamp_created": 1520555444, "timestamp_updated": 1520555444, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40668703": {"recommendationid": "40668703", "author": {"steamid": "76561198042050727", "num_games_owned": 121, "num_reviews": 3, "playtime_forever": 3180, "playtime_last_two_weeks": 3180, "last_played": 1521712344}, "language": "english", "review": "Prismata is in my opinion one of the Crown Jewels in terms of game design. It takes influences from card games, board games and RTS to seamlessly integrate the best aspects of those genres into a monster of a turn based Hybrid which stands head and shoulders above its forebearers with an infinite skill cap and near infinite depth and complexity.\n\nIf you’re even passively a fan of strategy games, card games, chess, or any game that needs even a single neuron to play, this game will hook you and never let you go! (Just ask the streamers, kickstarter backers and other new players who've been hopelesslt trapped)\n\nI’ve been watching Lifecoach stream this for nearly a week. he’s been doing over 8 hour long streams with barely any sleep. So naturally I ended up buying the game out of curiosity and PLS SEND HELP, I’VE BEEN KIDNAPPED BY THIS MONSTER. \n\nGameplay: The game has a very simple formula\n\n1. You build resource gathering units (the resources are gold, blue, green and red)\n2. You build an army using those resources\n3. You deal damage to the enemy’s units to destroy his fleet\n4. You defend against enemy’s damage.\n\nThat’s it!\n\nAll the depth and complexity comes from your decision making according to circumstances, and how you think the game will play out. Another factor is the HUGE variety of units (there are around 100). 11 of them will appear every game, and an additional 5 to 10 are randomly selected out of the pool. Both you and your opponent must play the same pool, so there’s no deck-building involved. Rather, you’re tested on your ability to adapt to the firepower you’ve both been provided. More importantly for card game players, there is no net-decking! Every game is decided on player knowledge and skill! \n\nZERO RNG!  PURE STRATEGY! The only RNG that exists purely adds to the strategy and makes for a much more interesting and exciting experience.\n\nFeatures: This game has nearly everything:\n\n1. Casual and ranked online (match making is poor due to low player numbers, but that will improve as player count increases)\n2. Excellent Tutorials!\n3. regular events\n4. Custom matches vs players\n5. Strong Bots\n6. Spectator mode\n7. Replay analysis\n8. Single player campaign (1st chapter is free, rest is paid)\n9. MOST IMPORTANT : HATS!\n\nPrismata is going to be Free on release. NOT F2P-P2W, but FREE like DotA2. Only things you pay for are cosmetics and single player campaign! Paying money does not provide any gameplay advantage, nor does it unlock units faster. It’s just for looks. So, if you’re willing to wait for the end of Early Access, you can play this masterpiece for free, for the rest of your life. Or, you can buy it now for a very reasonable price of US$ 25 (for the mileage you get out of the game, this price is a bargain) and play it sooner!\n\nConsidering the highly skill based nature of Prismata, I wouldn't be surprised if the E-sports scene blossomed. This is just begging to happen, and I personally think it would be a crime if this game doesn't make it to a big stage.\n\nP.S: If you cant afford the game, but want to desperately get in on the action, consider asking the devs for a key on discord or the subreddit!\n\nNow, I must get back to playing.. this review wasted too much of my time", "timestamp_created": 1520554777, "timestamp_updated": 1521101535, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40667867": {"recommendationid": "40667867", "author": {"steamid": "76561198060775063", "num_games_owned": 48, "num_reviews": 1, "playtime_forever": 1474, "playtime_last_two_weeks": 1474, "last_played": 1521512005}, "language": "english", "review": "This is my first review ever.\n\nPrismata is the ultimate skill based game. \n\nNo luck. No bullshit. Only you and your opponent trying to outplay each other. \n\nI couldn't recommend it more.", "timestamp_created": 1520551439, "timestamp_updated": 1520551439, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.501458", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40667650": {"recommendationid": "40667650", "author": {"steamid": "76561198000774936", "num_games_owned": 205, "num_reviews": 8, "playtime_forever": 70, "playtime_last_two_weeks": 0, "last_played": 1517346425}, "language": "english", "review": "Another Kickstarter backer here. I have followed the development and played the Alpha on and off for the past three years. Don't let the cute graphics fool you, underneath is a very, very deep strategy game more akin to Chess. The only RNG is who goes first and the 8 or so units, from a large balanced set, that constitute the supply during a match. Both players purchase units from this supply during a game by using resources obtained in a manner similar to an RTS. Some resources carry over from turn to turn, while others only exist for the current turn. Using these resources while understanding how the set of units synergize is a major factor of the game. Unit mechanics have such things as 'time to build', 'attack', 'defence', 'hit points', 'lifespan', 'consuming other units to produce new units' and more, which makes calculating future turns quite involved if you want it to be. Being able to use all this information, as nothing is hidden, and map out future turns can be complex but satisfying when you pull off a win.\n \nIf you're not into deep thinking, this may not be the game for you.", "timestamp_created": 1520550634, "timestamp_updated": 1520550634, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40667388": {"recommendationid": "40667388", "author": {"steamid": "76561198068102822", "num_games_owned": 267, "num_reviews": 2, "playtime_forever": 341, "playtime_last_two_weeks": 341, "last_played": 1521491769}, "language": "english", "review": "Thank you Lunarch for making the best game ever !", "timestamp_created": 1520549763, "timestamp_updated": 1520549763, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.546660", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40666378": {"recommendationid": "40666378", "author": {"steamid": "76561198043606306", "num_games_owned": 407, "num_reviews": 10, "playtime_forever": 784, "playtime_last_two_weeks": 137, "last_played": 1520685848}, "language": "english", "review": "If you like the idea of Starcraft but can't be bothered with mashing the keyboard 200 times a minute this is for you. Note that there is some single player content like the start of a surprisingly engaging story mode, a reasonably strong ai and a bunch of single player riddles but the core of the game is in the multiplayer.", "timestamp_created": 1520546201, "timestamp_updated": 1520546201, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40666171": {"recommendationid": "40666171", "author": {"steamid": "76561198085133514", "num_games_owned": 38, "num_reviews": 2, "playtime_forever": 2601, "playtime_last_two_weeks": 2571, "last_played": 1521398516}, "language": "english", "review": "Best stratagy game I played:   \n[list]\n[*] Easy to get into and hard to master.\n[*] More featue compleate in early acess then most games on full launch. \n[*] Gameplay balance is polished to a level most triple AAA games can't even dream of. \n[*] No pay to win or RNG bullish. \n[*] Great comunity.\n[*] Animated skins!  \n[/list]\n\nIf you enjoy multiplayer stratagy games Prismata will defenitly deliver good value per $ .  \n\n10/10", "timestamp_created": 1520545542, "timestamp_updated": 1520545542, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40665602": {"recommendationid": "40665602", "author": {"steamid": "76561198018995000", "num_games_owned": 127, "num_reviews": 2, "playtime_forever": 3204, "playtime_last_two_weeks": 3201, "last_played": 1521740805}, "language": "english", "review": "Have you played an RTS ever? Something like Starcraft, or Red Alert, or Age of empires? Remember how it was impossible to play it \"optimally\" because you'd need to do 500 things every minute (and that's not even an exageration)? Well, then you have to try prismata. In the process of taking the 'R' out of 'RTS' prismata has created the ultimate competitive turn based strategy game.\n\nDon't be put off by the mediocre graphics - this game doesn't need flashy visual to pull you in. And ignore all the things calling it a card game - there's no deck, scarcely any randomness, and calling things \"cards\" is practically a misnomer.\n\nWhat this game gives you is this: The opportunity to beat your opponent by thinking cleverer than them. Not playing faster, having more accurate clicks, or even thinking faster. You need to understand how tiny differences between similar plays might swing the game one way or another, or which strategy will have greater benefits far down the line, and which plays can disrupt your opponent the best.\n\nOn top of that, the single player campaign and puzzles are quite fun, and become challenging for even the most experienced players at max difficulty.\n\nI've put hundreds of hours into the alpha before thi was availiable on steam. This is one of my favorite games of all time.\n\nHowever, if you would say about yourself \"I don't enjoy thinking hard,\" then you should probably pass on this. There's not much enjoyable here that doesn't involve learning and exploring new strategies, unless you want a pretty short 6/10 sci-fi visual novel with no interaction.", "timestamp_created": 1520544061, "timestamp_updated": 1520544061, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40665532": {"recommendationid": "40665532", "author": {"steamid": "76561198047618804", "num_games_owned": 57, "num_reviews": 2, "playtime_forever": 10883, "playtime_last_two_weeks": 4583, "last_played": 1521736216}, "language": "english", "review": "One of the best games I've played in my life. I've played over 10000 matches (most of them off steam) and the game still feels fresh.", "timestamp_created": 1520543877, "timestamp_updated": 1520543877, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.525132", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40665414": {"recommendationid": "40665414", "author": {"steamid": "76561198082836844", "num_games_owned": 73, "num_reviews": 1, "playtime_forever": 3639, "playtime_last_two_weeks": 3639, "last_played": 1521694518}, "language": "english", "review": "Most thought provoking gameplay in any game I've ever played.", "timestamp_created": 1520543630, "timestamp_updated": 1520543630, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40663944": {"recommendationid": "40663944", "author": {"steamid": "76561197985158814", "num_games_owned": 529, "num_reviews": 2, "playtime_forever": 1719, "playtime_last_two_weeks": 1719, "last_played": 1521601707}, "language": "english", "review": "This is a fantastic turn-based strategy online board game... thing. \n\nI purchased this game during alpha for $120 and it has been well worth the purchase. Compared to most $60 games, it has given me more hours of entertainment. It has also given me more total Fun than the same cost in movies or some other form of entertainment. Totally worth $25 to have access to it now rather than several months from now, IMO.\n\nI especially like how due to the lack of RNG once the match begins, you can only lose to superior play - not luck - because both players have the same tools with which to play each match. \n\nWhen I win, I feel I've accomplished something by outsmarting my opponent.\nWhen I lose, I don't feel tilted because my opponent won using a strategy I didn't think of, rather than something I could never have taken into account in my strategy.\n\nIf you are X but feel Y, this game might be for you:\nIf you enjoy real-time strategy games, but find yourself frustrated in the competitive scene because no matter how well you've thought your strategy out, your opponent is simply faster than you, this is the strategy game you've always wanted.\n\nIf you enjoy card games, but hate losing to random effects, this game plays a lot like a card game in some ways, and there's no RNG.\n\nMonetization:\nThere're no pay to win effects in this game, either - which is absolutely fantastic. \nYou CAN purchase plays in a cosmetic reward minigame though.", "timestamp_created": 1520539981, "timestamp_updated": 1520633168, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.500000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40663892": {"recommendationid": "40663892", "author": {"steamid": "76561197994390485", "num_games_owned": 466, "num_reviews": 6, "playtime_forever": 3550, "playtime_last_two_weeks": 2087, "last_played": 1521608598}, "language": "english", "review": "I backed this game on Kickstarter years ago, and it ended up being a great purchase.\n\nIt's a turn by turn strategy game with no RNG, no bullshit, no pay to win.\n\nTough to get into, but once you understand the concepts of the game, winning a game purely from superior strategy and tactics is a feeling that I've only found in Starcraft before.", "timestamp_created": 1520539896, "timestamp_updated": 1520539896, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.525132", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40663472": {"recommendationid": "40663472", "author": {"steamid": "76561198067909276", "num_games_owned": 154, "num_reviews": 6, "playtime_forever": 516, "playtime_last_two_weeks": 516, "last_played": 1521286127}, "language": "french", "review": "Comment expliquer ?\nJe ne pense pas que les mots puissent décr.... bon ok j'arrête d'être si dramatique!\n\nSi vous êtes fan de stratégie, foncez.\nJe dirais que c'est un tout nouveau genre de jeux de stratégie, avec des similarités aux STRs, aux jdc, et aux jeux abstrait (échecs, go,...).\n\nOu alors un grand compétiteur dans l'âme ? Foncez aussi.\nPas de RNG, des parties rapides mais profondes, un système de classement au top, des tournois, tout ça dans un jeu super équilibré avec des nouvelles unités à venir régulièrement.\n\nVous preferez jouer solo et apprécier un bon scénario de S-F ? Vous savez quoi faire!\nUne campagne très sympa (que le chapitre 1 pour le moment) dans un univers original, des puzzles et challenges et des bots qui savent un minimum réfléchire.\n\nCe jeu a beaucoup à offrir, alors si vous pensez qu'il pourrais vous plaire, plongez dans l'aventure.\n\n(Je n'ai pas beaucoup d'heure sur steam mais j'ai joué pendant plusieurs années sur l'alpha en dehors de steam)", "timestamp_created": 1520539021, "timestamp_updated": 1520539077, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40663267": {"recommendationid": "40663267", "author": {"steamid": "76561198176902571", "num_games_owned": 25, "num_reviews": 3, "playtime_forever": 1025, "playtime_last_two_weeks": 736, "last_played": 1521558721}, "language": "english", "review": "TL;DR: Great new kind of resource based strategy game with even better developers who care for it. Not everyone will like the game as it is pure strategy and it takes a long time to get good at, but the ones that enjoy this type of game will love it. \n\n     This game is absolutely fantastic. I have been playing on browser since the Kickstarter days, and this game never ceases to amaze me. Every match is different and unique because of the random unit set that is determined at the beginning of it, and this allows for infinite (well not really but close) possibilities in games. That scope of strategy and planning based on the unit set is really what makes it fun and unique for me. Another key part that really pulls me in is the puzzles. The puzzles and challenges are extremely addicting and rewarding to me. If you tend to like strategy games, give this one a go. \n\tGameplay is refined and polished. Prismata is a turn strategy game based on creating economy and gathering resources, as well as attacking and defending from attacks. The skillcap of this game is through the roof high, and I would say that it is impossible to reach it. It is not completely fair though, as there are unit sets that favor either going first or second, but that only affects very high level play where both players are making almost optimal plays. 99.9% of the time the better player wins, with that 0.1% being favored sets. This game is highly competitive, so if you want to get good you will have to put in the time. I would say that it is most comparable to the game Dominion, but they really aren't that close. I've also heard it is similar to Gwent, which I have not played. There is nothing wrong with gameplay so far except for when the bots crash. There are no ways to pay to win, all winning comes from personal skill. You can buy \"shards\" which are the games in-game currency, which allow you to buy skins. You can also aquire skins through daily rewards, playing games, winning the raffles on events. If you want skins but can't buy them, there are plenty of ways to get them, but the rare ones would take a long time. \n     The community is amazing, at least right now (launch). There weren't too many people playing in the alpha, but they were absolutely amazing. The reddit page got posts almost every day, there are twitch streams every day, the discord is extremely active, and there are already many strategy guides. The people who have been playing the game are absolutely amazing, and I thank them for keeping the game alive. Next, moving on to the devs. Lunarch studios has some of the best game developers I've ever seen. The game has great art and skins, fabulous gameplay, a fantastic AI, all thanks to the devs. Elyot, Lunarch's founder, is amazing. He is constantly taking in feedback from reddit and discord and trying to make the game better. If I wanted to know anything about game making, I would call up the Prismata devs.  \nI could go on about other things, but this is getting long so I'll finish up. I do have a few negative things to say. (these are my opinion and others may disagree). I don't really like the story of the campaign. The concepts doesn't really appeal to me, and I don't particularly like the visual-novel-esque type of campaign. The missions in the campaign are fabulous and necessary, especially the early ones. The single player content is amazing too, I just don't like the flavor that comes in the middle. I'm really here for the gameplay and that is all, but others might really enjoy the story and the characters. Also a note to take, I don't think that the campaign has any problems, I just don't enjoy the style of it. Also, the game is very difficult and it takes a long time to understand and get good at. They do a good job of introducing units and strategical concepts slowly as you level up, but it is still difficult. If you don't like a decently steep learning curve, you may not like Prismata very much. On the other hand, If you are a veteran of this type of difficulty in games, you won't even notice it. I personally already knew that I liked this kind of game, and the difficulty that came with it was what I expected.", "timestamp_created": 1520538580, "timestamp_updated": 1520538580, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40663219": {"recommendationid": "40663219", "author": {"steamid": "76561197984883519", "num_games_owned": 433, "num_reviews": 10, "playtime_forever": 3979, "playtime_last_two_weeks": 1452, "last_played": 1521695446}, "language": "english", "review": "This is one of the best games I have ever played.  It is a strategy game that has endless potential in expansion and player improvement.  The game is essentially Starcraft if you remove the technical barrier (APM requirement) and give both players perfect information.  \n\n[u][b]Description[/b][/u]\nIn Prismata, you build units each turn and manage a pool of resources to build an army.  Each turn, players are trying to maximize the efficiency of their resources and attacking their opponent to get an edge.  There is a set of base units in every game, including some basic attacking units and economy boosting units, such as drones and conduits to gather resources.  The meat of the game is in the extra units that are randomized each game and shared between both players.  These units dictate what is important in each game.\n\nThere are several mechanics that make the game stand out and make it so engaging to play.  Each game, the shared unit pool that both players use is randomized to make each game feel different.  There are enough different units that you do not see the same combinations come up very often, so each game is a new experience.  In addition, there is no random element in the game outside of who plays first on turn 1.  You can see everything your opponent is doing and plan accordingly.  \n\nThe attacking and defending mechanics are also unique to the game, although they are surprisingly simple.  At the end of your turn, you sum the total attack of all of your units, and the opponent totals the sum of their defense.  If the defense total is higher, the opponent chooses where the damage is assigned, and is able to absorb some amount of the damage on one unit.  If the attack total is higher, the attacker decides where the damage goes.\n\n[u][b]Game Modes[/b][/u]\nPrismata offers multiple different ways to play.  There is a single player campaign and challenges which are essentially puzzles.  These teach you the basics of the game step by step so you aren't overwhelmed when you are ready for a real game.  You can also play offline against bots of multiple difficulty levels.  The AI is surprisingly challenging; it will be a while until you can beat a master bot.  Lastly, the meat of the game lies in the online multiplayer mode.  There is a ranked ladder as well as private custom games available to play.  In addition, you can set your game play preferences.  You can play games with 5 or 8 random units in a game to manage complexity, or more!  You can also set player turn length from 90 seconds per turn to 6 seconds.  This functions like a chess clock in game.\n\n[u][b]Learning the Game[/b][/u]\nThe game is very addicting and engaging to play.  The games play out pretty quickly, usually taking anywhere from 5 minutes to 20 minutes to play a game.  Prismata has a very gradual learning curve.  You can learn the basics of the game while playing, and you don’t need to know everything to play a full game.\n\nEach game offers something new to learn about unit interactions or build timings.  Prismata has a robust replay system so you can analyze your games and determine where you went wrong.  You can even enter analysis mode in your replays to take control at any turn in the game and try out an alternative strategy.  \n\n[u][b]Summary[/b][/u]\nPrismata is a strategy player's dream.  I can't say enough good things about this game.  I've been playing strategy games my whole life, and this is one of the absolute best.  You have so many choices to make every turn.  There is so much variety from game to game that it never gets old.  Most strategy games use either get stale with predetermined moves like Chess or Puerto Rico, or they have a large element of luck to increase variability in their game.  Prismata manages to avoid both of these crutches to deliver a game that is different every time you play without introducing an element of luck.  To summarize, I'll list some of the key features that set the game apart:\n\n- Randomized shared unit pool each game\n- Large expandable unit pool ensures new interactions continually show up in games\n- No element of luck\n- No pay to win, you don't have a collection outside of cosmetic skins\n- No grinding, you have an ELO for ladder that does not reset\n- Prismata has been tested and rebalanced for several years already\n- Passionate, supportive, and helpful community and dev team\n\n", "timestamp_created": 1520538488, "timestamp_updated": 1520538488, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40663048": {"recommendationid": "40663048", "author": {"steamid": "76561198134938177", "num_games_owned": 651, "num_reviews": 3, "playtime_forever": 3323, "playtime_last_two_weeks": 3323, "last_played": 1521717217}, "language": "schinese", "review": "“电子卡牌游戏中的围棋。”\n我会努力争取早日汉化的。前3位打通教程和战役的玩家，各送72RMB，欢迎加QQ群：172781323。\n\n恭喜GUA2017、折棒大狼、織水信夫先后全通战役9+4和训练56关，领取72RMB。\n游戏素质不错，大家不要太肝，伤身体，很多关切都有隐藏成就，特殊解法，有空可以尝试。\n\nSteam上的Prismata黑屏BUG，尝试在Steam里卸载游戏，在steam文件夹删除所有Prismata的文件，然后重新安装试试，有人这么一弄就好了，似乎是Steam存的文件损坏了。\n\n你也可以用独立版本，或者网页版本，找我索要激活码。", "timestamp_created": 1520538071, "timestamp_updated": 1521718749, "voted_up": true, "votes_up": 24, "votes_funny": 5, "weighted_vote_score": "0.770992", "comment_count": "4", "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40663041": {"recommendationid": "40663041", "author": {"steamid": "76561198030515801", "num_games_owned": 134, "num_reviews": 6, "playtime_forever": 9685, "playtime_last_two_weeks": 5968, "last_played": 1521728453}, "language": "german", "review": "Hallo zusammen, \nendlich ist es soweit. Nach einigen Jahren, insgesamt acht in der Entwicklung und vier Jahren seit Kickstarter, ist Prismata nun im Steam EarlyAccess erhältlich! Ich kann kaum in Worte fassen wie gespannt ich auf die kommenden Tage, Wochen und hoffentlich Jahre bin. Ich habe in den letzten vier Jahren sicherlich mehr als tausend Stunden in das Spiel investiert 😊\nZunächst möchte ich euch möglichst kurz erzählen worum es in dem Spiel geht, welches Genre etc…\nZum Thema Genre gibt es sehr sehr viele unterschiedliche Meinungen zu welchem Prismata zu zählen sei, am häufigsten fallen wohl die Begriffe Echtzeitstrategie, Rundenbasiert, Kartenspiel, Deckbilder und Strategie. Jeder hat hierzu natürlich seine ganz eigene Meinung aber eines sei von meiner Seite aus gesagt: Ein Kartenspiel wie Hearthstone, Gwent ist es nicht, es fehlen dazu grundlegende Elemente wie ein Deck, Kartenziehen und Karten sammeln. Wie hier raus ersichtlich handelt es sich auch um keinen Deckbilder da wir kein Deck bauen, Strategie ist in Prismata gänzlich anders zu verstehen. Weiterhin fällt der Punkt Echtzeit unter den Tisch da es, tatsächlich, rundenbasierend gespielt wird. Übrig bleiben also „Rundenbasierend, Strategie“ – meine Sicht auf dieses Thema. Ihr werdet sicherlich andere Meinungen finden welche auch gute Gründe haben.\nUm eine klarere Vorstellung von dem zu bekommen was auf euch in Prismata zukommt versuche ich jetzt, in eigenen Worten, eine Übersicht zu geben. \nPrismata spielt sich wie ein Starcraft Brettspiel, wir bauen eine Wirtschaft auf kaufen Technologien und bauen Einheiten um schlussendlich unseren Gegner zu besiegen. Aus dem SC Repertoire fallen Echtzeit und Schatten des Krieges weg. Dies bringt mich zu einem weiteren wichtigen Punkt welcher Prismata besonders macht. Es handelt sich um ein Spiel in welchem wir jederzeit alle Informationen haben und alle Optionen berechnen können. Dies erinnert an Spiele wie Schach oder GO. Nun mögt ihr denken, „dann gibt es immer eine perfekte Lösung und das Spiel ist „solved““. Diesem Trugschluss viel schon so mancher zum Opfer. Eine Eigenschaft des Spiels greift hier was selbst nach vielen tausenden Spielen immer noch für Spannung in jeder Partie sorgt: Jedes Spiel besteht aus 11 Basis Set-Einheiten welche jedes Spiel gleichbleiben und einem Zufallsset welches zufällig bestimmt wird ABER für beide Spieler dasselbe ist. Es gibt derzeit über 100 Zufallsset-Einheiten, bei 5-11 pro Partie sind dies einige mögliche Kombinationen 😉. Nun komme ich zum letzten, in meinen Augen wichtigen Punkt: Kein (kaum) Zufall! In Prismata gibt es keine Würfelwürfe, zufälligen Zugreihenfolgen usw. Letzten Endes bleibt es nur die Frage, wer ist Spieler 1 und welche Einheiten sind im Zufallsset.\nNun kurz zu den Spielarten. Bis heute gab es quasi nur eine Art Prismata zu spielen und zwar Mehrspieler. Meiner Meinung nach das Herzstück des Spiels. Zwei Spieler spielen 1v1 in diversen Zeiteinstellungen gegeneinander. Prismata wird im Mehrspieler nie langweilig und je weiter man in der Ladder kommt desto mehr Tiefe im Spiel entdeckt man. Mehrere Alphaspieler haben schon über 10000 Spiele gemacht und lernen immer noch stetig dazu. Weiterhin gibt es im Mehrspieler auch „Casual Matchmaking“ für diejenigen die keine Lust auf Wettkampf haben und zahlreiche sehr kompetente Bots zum Spielen. In der Alpha gab es auch schon ein Puzzlepack welches, auch für Veteranen, eine große Herausforderung darstellte. Im EA Release kommt jetzt noch die Kampagne hinzu welche tendenziell eine Mischung aus normalen 1v1 Szenarien und Puzzeln darstellt und mit einer spannenden Science-Fiction Geschichte unterlegt ist. Die Kampagne kommt in einem normalen Schwierigkeitsgrad welcher sehr moderat ist und einem richtig hartem welche einem Kopfzerbrechen bereitet und jedes Puzzlerherz höherschlagen lässt. Die Szenarien werden Einheiten beinhalten welche nicht im Grundspiel zum Spielen zur Verfügung stehen.\nNun zum wichtigstem, dem Geld. Leider ist auf der Steam Seite nicht wirklich ersichtlich das es sich bei Prismata um ein weitestgehend kostenlosen Titel handelt. Die erste Episode der Kampagne sowie das erste (derzeit einzige) Puzzlepack und der komplette Mehrspieler Teil inklusive aller Einheiten wird kostenlos sein und bleiben. Kampagne 2 - ???? werde allerding bezahl Inhalt werden. Für später geplante Puzzlepacks wird auch eine Bezahlung erforderlich sein. Die EA-Kaufoption von 25€ beinhaltet nun einige der Kaufelemente, später könnt ihr die oben genannten Dinge aber auch kostenlos spielen. Wer jetzt schon kauft wird Lunarch Studios unterstützen und bekommt Kampagne 2-4 dazu sowie Zugang zum Spiel. Weiterhin gibt es einige Dinge, die das Ergattern von kosmetischen Erweiterungen für Einheiten (KEINE EINHEIT WIRD DADURCH BESSER) erleichtert/beschleunigt. Wer Geduld hat kann aber auch warten bis es den Multiplayer für Umme gibt.\nEin weiterer wichtiger Punkt mit welchem ich schließen möchte: Lunarch Studios ist ein vor einigen Jahren gegründetes Unternehmen. Die Jungs haben ihr Studium geschmissen um Vollzeit am Projekt zu arbeiten. Dadurch begründet sich auch die lange Entwicklung. Die Entwickler waren STETS bereit auf die Community zu hören, nötige Updates wurden immer so schnell wie möglich umgesetzt. Viele Dank an euch!!\nParanoijaa\n", "timestamp_created": 1520538055, "timestamp_updated": 1520538055, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40662823": {"recommendationid": "40662823", "author": {"steamid": "76561198213366504", "num_games_owned": 21, "num_reviews": 2, "playtime_forever": 85410, "playtime_last_two_weeks": 7361, "last_played": 1521706041}, "language": "english", "review": "I´ve played this game during alpha for 3 years and over 15000 games and I still love it more than any other game. I played both hearthstone and gwent but got bored of them because of the amounts of RNG these had, this one I´ll never quit.\n\nIf you like turn based strategy games then you´ll LOVE this game! There is no RNG, no deckbuilding, no fog of war. As a game of full information it is more comparable to chess. However, it´s not as repetitive, since in every game there is a random set with 8-11 out of 100 units that is available to purchase.\n\nAlso, once you got into this game it is completely free to play, all units are unlocked right away! The only thing you can buy with money are the single player campaign and skins, which don´t change gameplay.\n\nThis indie game was made by a team of three people, so if you want a game that has amazing graphics then this is obviously not the right game for you. But if you are sick of RNG card games and are searching for a turn based strategy game with amazing gameplay then you have to try this! You won´t regret it.", "timestamp_created": 1520537552, "timestamp_updated": 1520537552, "voted_up": true, "votes_up": 52, "votes_funny": 2, "weighted_vote_score": "0.819309", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40662497": {"recommendationid": "40662497", "author": {"steamid": "76561198025256781", "num_games_owned": 200, "num_reviews": 2, "playtime_forever": 7323, "playtime_last_two_weeks": 1594, "last_played": 1521684868}, "language": "english", "review": "I've played this game for over 3 years, and it's still as fresh as ever. With an awesome and dedicated development team and player base. I can safely say that this is by far the best strategy game I've ever played. And if you have any interest in any RTS, Board Games, Card Games, or Chess, do yourself a favor and check this game out.", "timestamp_created": 1520536747, "timestamp_updated": 1520536747, "voted_up": true, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.615178", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40662420": {"recommendationid": "40662420", "author": {"steamid": "76561198042198830", "num_games_owned": 644, "num_reviews": 17, "playtime_forever": 48, "playtime_last_two_weeks": 0, "last_played": 1520356019}, "language": "english", "review": "Prismata is such a huge breath of fresh air in the midst of so many games in this genre already. There is absoultely 100% no RNG involved as you create your perfect strategy to battle AI through the campaign, quick battles, events, and of course PVP in casual and ranked play! I deinitely recommend anyone check this game out if you're looking for something to really challenge your mind!\n\nIf you're interested in seeing some Gameplay here is my Prismata First Impressions/Thoughts/Review video for even more information regarding how the game works: https://www.youtube.com/watch?v=gwYcUhvpe20", "timestamp_created": 1520536541, "timestamp_updated": 1520536541, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.583333", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "40662174": {"recommendationid": "40662174", "author": {"steamid": "76561198046377214", "num_games_owned": 354, "num_reviews": 2, "playtime_forever": 1391, "playtime_last_two_weeks": 811, "last_played": 1521500704}, "language": "english", "review": "I spent $250 on Prismata's Kickstarter and consider every dollar well-spent.\n\nPrismata is a hybrid of several different genres: imagine the strategy of an RTS like StarCraft combined with a turn-based perfect information structure like chess; now add the look and feel of a collectible card game like Magic the Gathering; finally add some mechanics inspired by tabletop strategy games like Dominion. You get to experience the fun of all the different genres...\n\n...without any of their classic drawbacks: you *don't* have to be capable of 300 APM like in an RTS (because it's turn-based); you *don't* have to grind or pay to win to beat your opponents like in a collectible card game (because there are no pvp advantages of any kind in the game); you *don't* have to deal with RNG like in most games (because the devs have deliberately created a game of pure skill); you *don't* have to spend hours memorizing openings or dealing with the game getting stale like chess (because the pool of available units to purchase changes every single game, and every single game is different).\n\nIt has pretty much everything you could want in a strategy game: an extremely high skill ceiling; a competitive ladder; regular events and tournaments; single-player campaigns and puzzle packs; wide-ranging time controls; fully-integrated live spectating/replay/analysis features; devs that are extremely active and responsive to players; units that are actually balanced; a good AI; etc...\n\n...honestly, if I was reading my own review I would think it had to be bs. I would think \"this is too good to be true, there has to be some kind of catch\", etc. But there isn't, which is the entire reason I put so much money into the Kickstarter. This is *the* game that is worth your time.", "timestamp_created": 1520535939, "timestamp_updated": 1520538526, "voted_up": true, "votes_up": 18, "votes_funny": 2, "weighted_vote_score": "0.614055", "comment_count": "6", "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 108, "total_negative": 1, "total_reviews": 109}}
