{"reviews": {"39211585": {"recommendationid": "39211585", "author": {"steamid": "76561198079444699", "num_games_owned": 84, "num_reviews": 1, "playtime_forever": 1001, "playtime_last_two_weeks": 1001, "last_played": 1515515552}, "language": "english", "review": "I started this game optimistically because I enjoy deckbuilders.  I have been enjoying Monster slayers which is also a rougelike deckbuilder.  The problem with this game is twofold.  The main one is that the rules are opaque; starting in the tutorial and continuing throughout.  It is not clear that resources placed into regions to travel through are reshuffled back into your deck. You should be able to track the state of your deck, because this is a computer game.  This adds complexity to your game without increasing depth.  But the worst thing is apparently when you gain random resources, they are not random, they are drawn from another opaque deck, which I only found out by being so frustrated with the game I spent an hour looking through the forums and finding out that this is a \"good thing\" about this game.  I can buy supplies for two food and open 4 fatigues after sending three survivors out and gaining 2 fatigues and a death card. \n\n\nI have started turns with a full hand of resources, drawn extra cards with fire and ended the turn with more fatigue cards then the cards I started with.  Which I assumed was poor luck so I keep playing only for it to happen again and again.\n\nI should expect when I send out survivors for resources to have a positive EV.  With my current knowledge of the game I would not play it for free.  This is sad because the games aesthetics and general bones seem good, but that just made me stick around longer, making me more upset.", "timestamp_created": 1515516896, "timestamp_updated": 1515552346, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.528302", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38987095": {"recommendationid": "38987095", "author": {"steamid": "76561197998568769", "num_games_owned": 281, "num_reviews": 219, "playtime_forever": 776, "playtime_last_two_weeks": 0, "last_played": 1514860501}, "language": "english", "review": "6.5/10\n\nI really liked a lot of what Frost was doing. The aesthetic is stylish, and I liked the minimalist sound design with snowy footsteps and tribal chants. The cards are well-designed, and perfectly fit thematically with the narrative. Although I feel that I never won more than 1/3 of the time, I always wanted to set out again for the refuge. I wanted to escape the Frost!\n\nThe refuge is found after travelling a certain number of times, perhaps 25 in a basic game. In order to travel, you need to pay the requirements of a location card. Each location card will require either food, wood, survivors, or some combination of the three. Each time you travel, you create distance between yourself and the Frost. Each turn you dawdle, the Frost grows ever closer. At each location, there is an event happening. Sometimes you can draw extra cards by spending food. Other times, you might run into a group of savages that want to kill your survivors. Attackers can be killed with weapons, but can kill one of your survivors or damage your health (you begin with 4 health) if not dealt with.\n\nInstead of paying the cost of the location card, you can also use resources to buy special cards for your deck or send your survivors out to scavenge. These extra cards can help you do things such as get food more efficiently, heal your wounds, or fight adversaries. Survivors can find other people, pets, food, or wood, although sometimes they find nothing or die in the scavenging attempt. Scavenging failures, as well as certain events, can cause your group to become more fatigued. Fatigue cards clog your deck, and must be managed with purchased special cards or periodic rests (in which you skip a turn to remove all fatigue cards from your hand).\n\nThis all sounds quite complicated, and this is without even mentioning how temperature can affect hand size or how different playable characters have innate abilities. However, the game introduces you to these new concepts at a carefully measured rate. After each game, you unlock a new card or cards, and new events. Periodically, you'll also unlock new scenarios which you can conquer for extra playable characters. I never felt overwhelmed by the mechanics of the game, although they can be complicated. It can be very satisfying to think your way out of a bad situation by utilizing character abilities or special cards.\n\nMy first 8 hours with the game were fantastic. I continued playing until I unlocked all of the cards, and then beat the first four scenarios. However, things became a rough slog afterwards. The remaining scenarios are brutally difficult, and often seem to require a lot of luck. I would often feel that I was in a good position, but would be unable to seal the deal. On one occasion, I only needed one food card to proceed. I sent out six survivors to scavenge, and they all brought back wood. On four occasions, I lost \"The Recruiter\" scenario after travelling 19 times (out of 25). I felt that the difficulty of the events was out of sync with the strength of the cards I could purchase. After unlocking all of the cards, basic games also became much more difficult. One advanced event card in particular, traverse, kept popping up at the beginning of my games. This event causes the location card to remove all resources spent to travel from your deck. At the beginning of the game when you only possess perhaps 2 wood, 2 food, and 2 survivors, this is absolutely debilitating. During my last three hours with Frost, I didn't win a single game!\n\nBarring the possibility that I suddenly lost all the proficiency I had gained during the first 8 hours of play, I think that there is an enormous RNG difficulty curve at the tail end of the game. I absolutely recommend the title, but think that after unlocking all of the cards and seeing all the mechanics, you've seen the best that the title has to offer.", "timestamp_created": 1514924913, "timestamp_updated": 1514924991, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.536517", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38960695": {"recommendationid": "38960695", "author": {"steamid": "76561197992783558", "num_games_owned": 1217, "num_reviews": 47, "playtime_forever": 1052, "playtime_last_two_weeks": 0, "last_played": 1514168308}, "language": "english", "review": "Very well-crafted deck building game that can sometimes be a little frustrating.\n\nCards are well balanced and fit the survival theme nicely. Unlocking more decks and the various play modes provide a nice amount of replayability. Building your deck rewards strategy and planning ahead.\n\nSome game mechanics have RNG thrown in (take this action, have a chance of various outcomes) which adds some unpredictability and further variety, but this can also be a bit frustrating, watching your carefully crafted deck fall to an improbable unlucky streak. \n\nStill I think the game struck a nice balance of how often such mechanics are used, it didn't get to the point where it felt like the randomness overwhelmed my card selection.\n\nHighly recommended to fans of deck building games.", "timestamp_created": 1514866129, "timestamp_updated": 1514866129, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36867246": {"recommendationid": "36867246", "author": {"steamid": "76561197975929928", "num_games_owned": 725, "num_reviews": 2, "playtime_forever": 9363, "playtime_last_two_weeks": 0, "last_played": 1509224556}, "language": "english", "review": "A fun deck building card game made with craft and love  that gets very difficult, very quickly.", "timestamp_created": 1511395938, "timestamp_updated": 1511395938, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36479604": {"recommendationid": "36479604", "author": {"steamid": "76561198029904609", "num_games_owned": 375, "num_reviews": 83, "playtime_forever": 349, "playtime_last_two_weeks": 0, "last_played": 1510519268}, "language": "english", "review": "Stark, soft, and beautiful, Frost is almost a great game. Its visuals, low-key world-building, atmospheric winter soundtrack, and general design aesthetic are fantastic. Its core gameplay is fun...but only until you scratch beneath the surface and realize that this is Gods Must Be Watching with a nicer face and prettier clothes.\n\nThe problem with Frost is that it's heavily, heavily randomized around its most basic mechanic. You have a hand of survivors, you use them to get resources and new survivors, and you spend your resources to keep ahead of the terrible everstorm at your back. Unfortunately, every time you send a survivor out to scavenge, there's a chance they come back with a featureless trash card and there's a chance they outright die. The game's pacing is relentless and requires highly skilled play...but even then, everything you do devolves back into luck.\n\nDo you draw Fatigue cards or resources? Do your survivors die while scavenging? Do you get the right ideas, regions, or card combinations in your hand to be able to pass an obstacle in time? Are there the right cards available in your region?\n\nPlaying well helps you hedge your risks, but you can have starting turns where every one of your three survivors dies or draws Fatigue. Deck clog is a nightmare, and the game has a deck resource tracker that you are only allowed to use on easy mode: i.e. not during real play. On top of that, it has a number of mechanics that it doesn't actually show you. The temperature of a region determines how many cards you draw for each hand, but that temperature isn't clearly marked anywhere...except outside of easy mode. New cards and scenarios can be unlocked through play, but how the game decides when it's ready to give you one is utterly incomprehensible.\n\nOn top of that, the limited story of the game unfolds through those scenarios--specific challenges with unique deck mechanics and abilities designed to create a slightly different gamefeel--and unfortunately that gamefeel consists of constantly hammering on the restart button.\n\nLet's take the first unlock, The Leader. You start with three survivors, one wood, two food, and four Fatigue. If one of those starting survivors dies, it's game over. You have an ability that lets you spend one food from your hand for a 50% shot at a new survivor. 50% it does nothing and consume the food. And depending on your start location, you'll need to pay a mix of food, wood, and survivors to get to the next location. Wait too long, and the everstorm murders you.\n\nSo, to get enough resources to even have a hope of getting ahead of the storm, you need to send those plot-critical survivors scavenging right out of the gate.\n\nWhich means in this particular scenario you'll get game-overed at random on the very first card you play about one time out of ten.\n\nAnd that's only the most blatant way Frost screws you. As you get deeper into your runs and the everstorm gets closer, you'll end up in situations where you need a survivor to draw a single food to pass on to the next region and every survivor you send comes back with a tree. Two turns later, the storm eats you, all your trees are for naught.\n\nFrost *is* fun, despite the fact that you will play perfectly and lose a lot of the time, but it's not quite what it could be.\n\nIf you want a Dominions-y CCG with rich story, deep gameplay, and minimal input from the RNG, I highly recommend War of the Omens as a free alternative.\n\nIf you're not as particular about that, if you like good art and atmosphere, or if you just want a decent timekill, Frost's developer is definitely still worth supporting. 10$ as an investment in a decent game and the hope of better games to come would not be a bad thing, and maybe they'll lean less on randomization and more on player choice.", "timestamp_created": 1510521474, "timestamp_updated": 1510521474, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.529703", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36386727": {"recommendationid": "36386727", "author": {"steamid": "76561197973899044", "num_games_owned": 111, "num_reviews": 33, "playtime_forever": 100, "playtime_last_two_weeks": 0, "last_played": 1510232128}, "language": "german", "review": "Ein Super Spiel! \nGanz wichtig: man muss sich in die Atmosphäre rein versetzen! Für so nebenbei ist das nichts.\n\nSehr erwähnenswert ist, das man sein Schwierigkeitsgrad selber einstellen kann (wie viele Regionen man durchwandern muss, um ans Ziel zu gelangen, wie viele Tiere man hat, die euch helfen usw.).", "timestamp_created": 1510190167, "timestamp_updated": 1510190167, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35344413": {"recommendationid": "35344413", "author": {"steamid": "76561198338871773", "num_games_owned": 348, "num_reviews": 36, "playtime_forever": 1425, "playtime_last_two_weeks": 0, "last_played": 1514848622}, "language": "english", "review": "Frost is great. It's wonderful to play a round when I turn on Steam and don't know what to play. It's quick, clever, and challenging. I like the art, and the soundtrack is really unique and cool. It's definitely worth the price, especially on a sale.", "timestamp_created": 1506787863, "timestamp_updated": 1506787863, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.536517", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35051679": {"recommendationid": "35051679", "author": {"steamid": "76561198066090870", "num_games_owned": 98, "num_reviews": 11, "playtime_forever": 156, "playtime_last_two_weeks": 1, "last_played": 1516230217}, "language": "english", "review": "Downloaded the Demo, played, had a lot of fun. \nInstant buyed the game. \nI recomend it for all deckbuiling-game-fans and thos who like Cardgames.\nThe artstyle looks much better in the game than at the screens, in my opinion!\n\nKeep on the great work :)", "timestamp_created": 1505763161, "timestamp_updated": 1505763161, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.536517", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34607706": {"recommendationid": "34607706", "author": {"steamid": "76561198113183220", "num_games_owned": 243, "num_reviews": 3, "playtime_forever": 898, "playtime_last_two_weeks": 0, "last_played": 1468077654}, "language": "english", "review": "8/8", "timestamp_created": 1504099711, "timestamp_updated": 1504099711, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.471014", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34526256": {"recommendationid": "34526256", "author": {"steamid": "76561198035874665", "num_games_owned": 166, "num_reviews": 28, "playtime_forever": 978, "playtime_last_two_weeks": 0, "last_played": 1503944779}, "language": "english", "review": "[h1]Certainly not a game for everyone, but if you're intrigued by the theme or the thought of pushing your luck in a hostile card-driven affair, then Frost is a pretty cool pick.[/h1]\n\nAside from being chromatically challenged, Frost is notable for being a solitaire experience inspired by real world deck-building card games such as Dominion and its subsequent imitators including World of Tanks: Rush and Resident Evil.\n\nThe action, such as it is, takes place in the sort of post-apocalyptic setting that author Kurt Vonnegut made popular in his seminal novel Cat's Cradle; a freezing world where tribes must now band together for their very survival. In the game's 'Classic' mode you become a leader who must collect the resources needed to traverse the land in search of a mythical place called the \"Refuge\" whilst also trying your best to outrun the titular snow storm that threatens to consume all.\n\nEvery concept is rendered in card form with your own personal deck consisting of resources like Food, Materials, Survivors, and other gubbins such as weapons or even Ideas. Other cards stand in for the Regions that you must cross as well as the special events or obstacles that your tribe will run into along the way.\n\nAlso rearing its ugly head here is the time-worn mechanic by where a useless card (in this case representing Fatigue) is routinely dumped into your deck as play progresses. As with The Big Book of Madness, the inclusion of bogus cards makes thematic sense here because it's important for the player to feel pressured.\n\nNevertheless, I'm generally not a fan of mechanics like these and whilst Frost does offer you the default option of Resting in order to remove Fatigue, I really dislike how it's included in your starting deck. There are times when my first turn is skipped in order to remove Fatigue and that just feels wrong. Fatigue can also be incurred when activating certain cards that grant a random reward. Specialist cards like Supplies, the Gatherer or the Frigomancer are made very unattractive due to this foible and the same applies for when it's time to scavenge.\n\nScavenging is a necessary evil early on when your tribe lacks the resources required to physically pass into the next Region. By discarding a Survivor card, players run the risk of gaining Fatigue or killing the Survivor (!) for a chance at discovering Food, Materials, or other Survivors. These random draws can be of critical importance and yet Fatigue or fatalities can quickly pile up before you have a chance to really get going. When you consider that Regions and Ideas are also randomly generated, it only makes sense to continue harder games when the first round conditions are beneficial. In short: you can expect to be pressing the 'Restart' button a lot.\n\nMany things are governed by random elements in fact, even down to certain card abilities that have a percentage chance of activating. You can spend time building a Trap, but that doesn't necessarily mean anything tasty is going to fall into it. To a degree this actually makes good thematic sense, but again it's the element of chance here that can make formulating reliable combo chains and other tactics next to impossible. It's this facet of Frost's design that's going to be the most taxing on your patience.\n\nYou lose the game when the Frost timer ticks down from eight to zero, and whilst the timer ticks up every time you travel onwards, it's extremely unlikely that your deck will contain the goods needed to do this consistently. One one hand this makes the game remarkably tense and the designer's unsubtle use of creepy music and jarring screen effects only enhance that tension further. Because of the reliance on randomization, however, Frost is a supremely difficult game to gets to grip with and that hard time only continues to get harder as new cards and scenarios are unlocked.\n\nScenario play is more interesting than the Classic mode as in addition to collecting items or seeking out the Refuge, your scenario character will have goals of their own. The Hunter and The Meditator for example have simple objectives, but some like The Shadow and The Skeptic have quite involved missions with fresh patterns of play. Mixing this up further is the addition of character abilities that give each leader their own unique advantages and play styles.\n\nThe other thing about Scenarios is that they're hard. Really hard. And it's likely that most players' luck and patience will simply run out before they can achieve victory in each one. Part of the problem here once again revolves around the game's inherent randomness.\n\nThe developer has taken care not to label Frost as an actual deck-building game because of the false implication that you're in any way building an engine out of the cards that you collect. Getting the cards you desperately need to make your deck work is a process governed by chance and smoothed over via careful play. You're not so much building a deck as you are managing an ever-changing pool of resources, so there are times when defeat is going to be an inevitable outcome of drawing poorly and falling behind.\n\nWhat's nice though is that Frost's intense difficulty is built up gradually as the player continues to finish games. By the time your card album is complete, you'll have discovered all sorts of new tools including stacked resources, Charisma checks, and as the result of several free updates; cards for Pets and Weather effects. With this breadth of content comes a sharper learning curve, but the on-screen tooltips and instructional blurbs are usually on point in explaining exactly what you need to know about each of the game's symbols.\n\nWhich brings us to Frost's rather wonderful presentation. It's certainly not one for photophobics, mind, but the all-white menus and eerie music do a near perfect job of transporting you into the setting. Also notable is the game's artwork whose roughshod charm resembles the works of Quentin Blake quite nicely. Story threads are limited to whatever awkwardly translated text you see during splash screens, which is a shame, but the overall theme of the \"Frost\" meaning different things to different people is an intriguing one nonetheless.\n\nDespite its light and addictively simple gameplay then, Frost is not really a game for casual players. The real meat is found in the Scenarios and yet the sheer difficulty and trial and error nature of that mode is likely to frustrate those who go in unprepared.\n\nNevertheless, I'm currently finding this to be an equally difficult game to put down. Whether it's my intense fondness of card games or a hidden masochism that's responsible, I've taken great pleasure in exploring the bleak and uncompromising world that Frost represents.\n\n[url=http://www.celjaded.com/review-frost-digital-card-game/]Read the full review at my blog »[/url]", "timestamp_created": 1503829709, "timestamp_updated": 1503829709, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34409793": {"recommendationid": "34409793", "author": {"steamid": "76561198111157752", "num_games_owned": 7777, "num_reviews": 35, "playtime_forever": 23, "playtime_last_two_weeks": 0, "last_played": 1503384668}, "language": "french", "review": "Un excellent jeu de cartes solo aux règles claires et efficaces. Poursuivi par une tempête mortelle, faites traverser la montagne aux survivants en utilisant au mieux les cartes ressources. Addictif !", "timestamp_created": 1503384297, "timestamp_updated": 1503384297, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34345470": {"recommendationid": "34345470", "author": {"steamid": "76561198325087090", "num_games_owned": 7, "num_reviews": 1, "playtime_forever": 322, "playtime_last_two_weeks": 0, "last_played": 1512746782}, "language": "italian", "review": "Bellissimo gioco: meccanica interessante, atmosfera suggestiva e varie modalità che ne garantiscono la longevità!", "timestamp_created": 1503130787, "timestamp_updated": 1503130787, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34278199": {"recommendationid": "34278199", "author": {"steamid": "76561198002560836", "num_games_owned": 491, "num_reviews": 34, "playtime_forever": 176, "playtime_last_two_weeks": 0, "last_played": 1468035131}, "language": "english", "review": "Dude this game came out of the blue a year ago and im really glad i dove in, you have been a loving dev and even though the base game was great, you continuted to pour more and more love into it. I am a greatful fan and look forward to all of your future work ! Great job dude!\n\n\n\nReally fun and stylized deck building game, with a lot of unique mechanics and a cheap price, the Dev has also poured ton of content updates into a already full game, i have nothing but love baby!", "timestamp_created": 1502896808, "timestamp_updated": 1502896808, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.455528", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34214231": {"recommendationid": "34214231", "author": {"steamid": "76561198024977470", "num_games_owned": 837, "num_reviews": 22, "playtime_forever": 821, "playtime_last_two_weeks": 0, "last_played": 1502680326}, "language": "english", "review": "Do you find yourself pulling out a deck of cards and solitaire when you've got a deck of cards and just need to pass some time?   At the board game store do you peruse the shelves that are marked \"solo games\"?  Can you accept a game where most of the time you will not win?\n\nIf the answers to these questions are yes, then Frost is an excellent game.\n\nIf you require interaction or want a win ratio of 90% when playing a game, this might be one to pass by.\n\nFrost is a solo card game where you take a role (starting cards and possible special abilities) to take your ice age band of hunter gatherers to try to survive.  You manage a deck of resources (food, wood, people), ideas/tools (cannibalism, pick axe, bandages, campsite, etc...) and sometimes pets along with the dreaded fatigue to meet the challenge of the region (you need 2 food and 3 people to travel) and handle events (wolf attack, traders, spirit stone).  You need to race ahead of the frost meter as each turn you don't move, it creeps closer to death.\n\nIts a good game - I've enjoyed it.", "timestamp_created": 1502631760, "timestamp_updated": 1502631760, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33936689": {"recommendationid": "33936689", "author": {"steamid": "76561197999259031", "num_games_owned": 317, "num_reviews": 14, "playtime_forever": 355, "playtime_last_two_weeks": 0, "last_played": 1510449102}, "language": "english", "review": "Brutal singleplayer deckbuilder with a unique and beautiful art style. It's really its own beast- it doesn't play like your typical deckbuilder, but has its own ebb and flow that I find very satisfying.\n\nHere's the basic game flow- you start with a handful of food and wood, and a couple survivors. You use your survivors to gain more resources, which you'll need to gain idea cards and to pass the area. Ideas are extremely useful and give you better access to resources, thin your deck, or remove negative cards. On the other hand, you only have a limited amount of time total to bypass a certain number of areas, so you can't usually dawdle around and just build a lot of ideas. But if you don't build enough ideas, then you'll be doomed when a particularly difficult area arises. \n\nEach area also has an encounter- sometimes friendly, sometimes not. Not all encounters are difficult, but they always throw a wrinkle in your plan.\n\nYou're always pushed forwards, but additional ideas are unlocked for each turn you stay in an area. It's often a difficult decision- do I stall for a turn or two to gain an excellent card, or do I forge onwards and hope it doesn't matter? The right choice isn't always obvious for a couple of areas, so learning what sorts of threats are likely to be ahead of you matters.\n\nAdditionally, more interesting cards and obstacles and areas are unlocked as you play. It's really a fascinating game, and there's nothing quite like it.", "timestamp_created": 1501537652, "timestamp_updated": 1501537652, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.558803", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33777844": {"recommendationid": "33777844", "author": {"steamid": "76561197972462277", "num_games_owned": 133, "num_reviews": 39, "playtime_forever": 837, "playtime_last_two_weeks": 0, "last_played": 1501036806}, "language": "english", "review": "It's a really nice deck building game. The unlocking occurs at a steady pace and there are multiple scenarios to complete, some hard, some easy. The mechanics are simple, but resource management is quite critical. You can't just gather everything you can get your hands on, you need to craft your deck, keeping just the right balance of combat cards and resources.\n\nThe artwork looks simple, but it's quite beautiful. The entire atmosphere of the game is oddly relaxing, like a quiet day in the woods (or, given the theme, a snowy woods).", "timestamp_created": 1500949885, "timestamp_updated": 1500949885, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33662533": {"recommendationid": "33662533", "author": {"steamid": "76561198202851810", "num_games_owned": 46, "num_reviews": 9, "playtime_forever": 375, "playtime_last_two_weeks": 0, "last_played": 1509314634}, "language": "english", "review": "This is a fun little card game. The art style is just haunting enough to keep you on your toes and really think about your choices. It really gives the game a sense of urgency, especially when the frost counter gets really low. That said, I think it could definitely get stale after a while. There are dozens of cards to unlock, but they unlock in random order. My first few games were pretty frustrating as I didn't have a lot of idea cards unlocked that could help me, and I was struggling with the learning curve. Once you figure it out though, it's a lot more fun. I just started so I am still playing on easy difficulty, but it's still not as simple as you might think. I bought it on sale, but I would argue it's worth the full price if card games are your thing.", "timestamp_created": 1500511914, "timestamp_updated": 1500511914, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.505173", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33620586": {"recommendationid": "33620586", "author": {"steamid": "76561198135550917", "num_games_owned": 300, "num_reviews": 2, "playtime_forever": 599, "playtime_last_two_weeks": 0, "last_played": 1500499108}, "language": "english", "review": "Picked this up from Chrono.gg for around 5 bucks after having fun with the demo. It's fun and easy to learn. \nSimple enough that it could be played in meat space with a physical copy but still compelling enought that I'm happy to have it here or on mobile. \n'm kind of bummed that the difficultys beyond easy and more than the first senario are not imidiatly available but, I'm enjoying the game enough that I don't mind slowing gaining more as I play.", "timestamp_created": 1500343622, "timestamp_updated": 1500343622, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33565719": {"recommendationid": "33565719", "author": {"steamid": "76561198009690028", "num_games_owned": 2736, "num_reviews": 28, "playtime_forever": 621, "playtime_last_two_weeks": 0, "last_played": 1500225693}, "language": "english", "review": "Frost is a rogue-lite deck management (NOT building) game where you have to juggle your hand and deck, which contain a number of resources, against the environment, which you need a number of resources to do. There are wrenches thrown in, like idea cards where you can sacrifice resources to now for various benefits later, and fatigue, which decreases your maximum hand size until you find ways to deal with it.\n\nThe game has various win and lose objectives, and a \"death wall\" turn timer that constantly pushes you forward so you don't farm a nice region for too long. It works really well. There are a variety of options you can select to customize your custom game, like how far you have to travel and how many epic regions (more difficult) are in the deck. Plus there then are specially-defined scenarios to challenge you with once you have mastered the base game.\n\nThe main downside of the game for me is that you can't customize the deck, thus why this is a \"deck management\" game and not a \"deck builder\" game. This camouflages another downside - that there aren't that many different cards of each type. There are 54 idea cards, 28 event cards, and some unknown number of region cards, probably around 20-30 or so. You unlock more cards by completing games, win or lose. \n\nThey are selected randomly each game and the issue with that is that there are some cards that are almost entirely superceded by a stronger version of the card (like Story Stone vs Shelter), Therefore when the weaker version comes up in a draw it is usually a waste, because I know the stronger version exists, and have so many other things to buy with my resources.\n\nStill, overall, the game is fun. If you enjoy card games, what is currently in the game should be good for 10-20 hours of gameplay if you are attempting to complete all the scenarios. Each successfully completed game should take you around 20-40 minutes, with failed games depending on how long you survive. Also as other reviews have pointed out, there is a demo available on Steam, and trying that is ultimately what influenced my decision to buy it.", "timestamp_created": 1500143165, "timestamp_updated": 1500143231, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.584042", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33284563": {"recommendationid": "33284563", "author": {"steamid": "76561198250784110", "num_games_owned": 65, "num_reviews": 14, "playtime_forever": 997, "playtime_last_two_weeks": 0, "last_played": 1498960148}, "language": "english", "review": "Fascinating and creative card game. I know this style of game and genre can be a tough sell on Steam, but it's still great to see devs trying out new ideas. Well worth checking out if you dig unique and unusual card games!", "timestamp_created": 1499276021, "timestamp_updated": 1499276021, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33075018": {"recommendationid": "33075018", "author": {"steamid": "76561198059554724", "num_games_owned": 455, "num_reviews": 5, "playtime_forever": 326, "playtime_last_two_weeks": 0, "last_played": 1506453535}, "language": "english", "review": "This is a really great game.\nReally good mix between a rogue-like and a deck building game.", "timestamp_created": 1498900103, "timestamp_updated": 1498900103, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33055023": {"recommendationid": "33055023", "author": {"steamid": "76561197991992183", "num_games_owned": 486, "num_reviews": 3, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1503031231}, "language": "english", "review": "Do you like deckbuilding games like Dominions or Star Realm? If so, you should get this game- even as a solo game, it's well designed and the theme works great with the cardset.\n\nIf you don't know whether you would like this game- try the demo! It's a solid example of the game and well worth the time it takes to play it.", "timestamp_created": 1498855351, "timestamp_updated": 1498855351, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31770330": {"recommendationid": "31770330", "author": {"steamid": "76561198014731458", "num_games_owned": 522, "num_reviews": 41, "playtime_forever": 949, "playtime_last_two_weeks": 0, "last_played": 1498255877}, "language": "english", "review": "It is a cool deckbuilding game", "timestamp_created": 1494860494, "timestamp_updated": 1494860494, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.481928", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31587612": {"recommendationid": "31587612", "author": {"steamid": "76561198040963496", "num_games_owned": 177, "num_reviews": 45, "playtime_forever": 127, "playtime_last_two_weeks": 0, "last_played": 1478996620}, "language": "koreana", "review": "신박한 컨셉의 TCG 생존 게임은 순간 재미있었지만 내 머리론 그 난이도를 극복할 수 없었다", "timestamp_created": 1494096867, "timestamp_updated": 1494096867, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31384831": {"recommendationid": "31384831", "author": {"steamid": "76561198045401832", "num_games_owned": 88, "num_reviews": 104, "playtime_forever": 499, "playtime_last_two_weeks": 0, "last_played": 1501084929}, "language": "english", "review": "Very unique card game. Feels like a real tabletop card game. Pretty tough but you unlock cards and scenarios if your losses are good. Random hands and challenges, so some games may be impossible but the grind is suspenseful as The Frost is chasing you. I am a card game freak and recommend this one highly. PLAY THE DEMO instead of reading all of the reviews.", "timestamp_created": 1493251107, "timestamp_updated": 1493251107, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31240289": {"recommendationid": "31240289", "author": {"steamid": "76561198017568860", "num_games_owned": 518, "num_reviews": 25, "playtime_forever": 1620, "playtime_last_two_weeks": 0, "last_played": 1498076184}, "language": "french", "review": "Depuis la sortie du jeu sur table Dominion, différents jeux vidéo ont vu le jour mettant en scène un deck (pour les non initiés, un paquet de cartes) qui va contenir différentes ressources et actions que vous allez modifier au gré de l'aventure. A contrario des classiques où l'on affronte un adversaire, dans ce type de jeux, c'est l'environnement que l'on doit vaincre.\n\nDans Frost, votre objectif principal est de devancer le froid glacial synonyme de mort s'il vous rattrape. Pour ce faire, votre deck va contenir des provisions, du bois, des survivants et des idées que vous achèterez probablement au cours de la partie. Les icônes sont assez parlantes mais il est vivement conseillé de passer par le tutorial avant de lancer votre première partie.\n\nLes cartes sont assez bien équilibrées et les différents scénarios ainsi que les nouvelles cartes qui se rajoutent viennent renouveler le gameplay et ajouter de la durée de vie.\n\nNiveau graphisme on a quelque chose de simple dans des tons de blanc et bleu pour refletter le froid omniprésent dans l'aventure. De même au niveau audio on a quelque chose de très léger mais qui colle parfaitement à l'ambiance du jeu à savoir une tribu qui se bat dans une immensité glacée.\n\nPersonnellement, j'apprécie énormément ce type de jeu et de fait Frost a été une excellente surprise. Si vous êtes curieux ou que vous hésitez à l'acheter, je vous invite à essayer la démo et à vous faire votre propre opinion.", "timestamp_created": 1492619062, "timestamp_updated": 1492619062, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31202100": {"recommendationid": "31202100", "author": {"steamid": "76561198044613800", "num_games_owned": 47, "num_reviews": 2, "playtime_forever": 858, "playtime_last_two_weeks": 0, "last_played": 1513615698}, "language": "french", "review": "Dispite I think this game is excellent, and I find it very nice, I have to write a bad evaluation for it, because there is a very anoying point making I stopped to play it :\nIt's not possible to see cards in the deck (and not possible to see discarded card if there are too much, you see only 2 first rows). So it's impossible to planify something and know how many card of each type you have.\nAlso, the game need a way to remove some cards from the deck like animals or unwanted cards.", "timestamp_created": 1492444674, "timestamp_updated": 1492622951, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29485513": {"recommendationid": "29485513", "author": {"steamid": "76561198032774591", "num_games_owned": 76, "num_reviews": 15, "playtime_forever": 125, "playtime_last_two_weeks": 0, "last_played": 1485289648}, "language": "french", "review": "Découvrez avec moi ce superbe jeu de deckbuilding, oeuvre d'un seul homme pétri d'amour pour sa création et ça se sent. Frost offre une rejouabilité exemplaire mais surtout une immersion étonnante : vous vivez très en profondeur et viscéralement les aventures de votre personnage, que ce soit pour arriver à son refuge ou bien pour sauver sa famille des dangers de la tempête ultime : le Frost ! Très recommandé ! Bravo au développeur ! \n\nhttps://www.youtube.com/playlist?list=PLsT8pLBx0kPN4QieHeJW7c40i2oTJBP-I\n", "timestamp_created": 1485362103, "timestamp_updated": 1485362103, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.588378", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "27663915": {"recommendationid": "27663915", "author": {"steamid": "76561198063908853", "num_games_owned": 129, "num_reviews": 5, "playtime_forever": 1778, "playtime_last_two_weeks": 0, "last_played": 1506269588}, "language": "russian", "review": "Игра на первыйй взгляд очень проста и тосклива. Пройдя туториал, я думал, что не зайду в основную игру. Но уже на среднем уровне ложности игра открывает все свои возможности и увлекает как \"пятиминутная\" времярезалка, которая на деле может вылиться васовые чертыхания от трекляторого рендома карт. Впрочем, несмотря на рендом, от игрока зависит очень многое, так как многие карты можно применить двумя разными способами, и иногда пройти игру становится весьма проблематично.\nМеханика по сути элементарна - нужно заполнить карту локации нужными ей ресурсами (то есть картами), при этом разбавляя колоду картами, которые по сути помогают эти самые ресурсы искать быстрее. После каждого хода мороз крепчает (\"Зима близко!\"). Вслед за очередным прохождением открываются дополнительные карты, сценарии и локации, т.е. - мотивация :) \nВ качестве минусов могу отметить лишь почти полное отсутствие саундтрека и слишком однообразное оформление (но, возможно, это, напротив, плюс игры - стиль и атмосфера суровой зимы.", "timestamp_created": 1480167893, "timestamp_updated": 1480167893, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26652480": {"recommendationid": "26652480", "author": {"steamid": "76561197970766232", "num_games_owned": 399, "num_reviews": 6, "playtime_forever": 509, "playtime_last_two_weeks": 0, "last_played": 1514331086}, "language": "english", "review": "First, if you’d like to see gameplay footage and a bit of review, check out my video here:\n\nhttps://youtu.be/9FTlUMEBadE\n\nIf you’d rather do that whole reading thing, well, keep reading.\n\n[h1]THE SHORT VERSION[/h1]\n\nFrost is a deck building-ish game that board gamers will feel right at home with; it provides an interesting take on the genre, at a great price, with many interesting decisions to make as you play. It’s mechanically solid and definitely entertaining though I’m not sure how much longevity it will have in the long run. That being said, I’ve enjoyed my time with it and will certainly boot it up from time to time.\n\n[h1]THE LONGER VERSION[/h1]\n\nIf you’ve seen any of my videos before this, you know I’m a huge nerd and lover of board games. I was initially drawn to Frost exactly because of that; a deckbuilding game that only exists in digital form. As much as I love board games (especially cool solo games) it can be a hassle to actually get the damn things out and play them (not to mention time consuming). So this seemed right up my alley, a cool card game to pick up and play easily on my laptop.\n\nLet’s just get the production value/graphics/sound out of the way; if you’re someone who likes super-slick graphic design and sound, you’re going to have a hard time getting into it. I find the art and (very minimal) sound kind of charming and enjoyed it. In no way did it detract from my experience, but I’m also the kind of guy that still periodically boots up the original X-Com and has no problem diving into that game. So yes, the art and minimal soundtrack/effects are functional but remember, this is an indie game and it shows. Functionally though, it’s great; there are very few things that are unclear how to interact with so UI wise, pretty rock solid.\n\nThat leaves us with the gameplay and experience. Every game has you basically trying to get to the refuge (or completing other objectives depending on difficulty) with very limited resources while a wall of cold chases you; think Day After Tomorrow but, you know, actually entertaining.\n\nI call it a “deck building-ish” game because it does break considerably from the genre. Most deck building games have you purchasing more powerful cards and adding them to your deck. Although there ARE cards you “purchase” by permanently discarding resources, the majority of cards you add to your deck come instead from searching for resources using your people (also a resource).\n\nAnd boy do you need every last resource. Besides balancing your deck “construction” (and trying to remember what the hell you have in there) every region you move through has different resource requirements. They’re not permanently discarded, just used for the region and reshuffled into your deck afterward; but gain too much of any one resource and you might find yourself out of luck trying to draw the right cards. But hey, you’ve got plenty of time to get it right, right?\n\nNoooope. There is the constant threat of the frost wall. You’re always under pressure to keep moving towards your goal but there is always so much to accomplish. You have to carefully weigh whether it’s worth sticking around to try and acquire some sweet cards that come up, or take a turn to rest and get rid of your fatigue (cards that do literally nothing…a lot like me in real life). Several cards also have multiple uses, so there’s another layer of choice to how you want to use what you’ve already got. But at least all you have to do is get through the regions, right? RIGHT?\n\nDouble noooope. On top of all that, there are event cards that come up for every region (and sometimes the weather is so cold that you draw less cards). Granted, not all of these cards are bad, in fact, several are very beneficial and either allow you to heal or give you a chance to acquire more resources. But there are plenty that can damage you or your people or are just generally scary.\n\nSo what does this all add up to? A pretty damn entertaining game. There are plenty of decisions, it’s well paced and the UI is fantastic; it’s easy to play and know what you’re doing. Besides, cool theme bro.\n\nIts simplicity may ultimately be its downfall though; after you’ve played the game several times, you know exactly what you’re getting. It does help that as you play you unlock new cards and new scenarios (which I haven’t touched yet, just been playing the base game). As a frequent board game player, honestly this doesn’t bother me; I’m used to learning a game, figuring out all it has to offer and then using the knowledge to play it better and better. \n\nWhich is also part of the beauty of it all; you learn. This game isn’t insanely hard but it is difficult, and as you play you learn how to better manipulate your deck and improve your gameplay. You learn what’s important and how to survive in the long run.\n\nAs a fun board game like diversion, I’d definitely recommend this game. You get a lot for your money and much like any other solo board game, it’s something you can pick up from time to time and just enjoy without having to commit to hours and hours of gameplay. Also, if you’ve never played a deck building-ish game, it’s not a bad place to start.", "timestamp_created": 1479422553, "timestamp_updated": 1479422553, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.506062", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26527593": {"recommendationid": "26527593", "author": {"steamid": "76561197983657064", "num_games_owned": 18, "num_reviews": 1, "playtime_forever": 459, "playtime_last_two_weeks": 0, "last_played": 1497450556}, "language": "portuguese", "review": "Cativante!", "timestamp_created": 1478821637, "timestamp_updated": 1478821637, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26419394": {"recommendationid": "26419394", "author": {"steamid": "76561197978579802", "num_games_owned": 536, "num_reviews": 7, "playtime_forever": 184, "playtime_last_two_weeks": 0, "last_played": 1479829305}, "language": "english", "review": "As a big fan of deck builders, roguelikes, and survival games, this scratches an itch I didn't even know I had. Really nice fusion of genres with unlocks through progression. Great coffee break game!", "timestamp_created": 1478278930, "timestamp_updated": 1478278930, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.466102", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25942246": {"recommendationid": "25942246", "author": {"steamid": "76561198049828878", "num_games_owned": 90, "num_reviews": 3, "playtime_forever": 496, "playtime_last_two_weeks": 0, "last_played": 1476042073}, "language": "english", "review": "Really nice single player deckbuilding game for times were you want something different than Hearthstone or Duelyst! \nAwesome that you had a demo, after that it was a insta-buy!", "timestamp_created": 1476000974, "timestamp_updated": 1476000974, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25680004": {"recommendationid": "25680004", "author": {"steamid": "76561198025267880", "num_games_owned": 162, "num_reviews": 116, "playtime_forever": 5072, "playtime_last_two_weeks": 0, "last_played": 1492492295}, "language": "english", "review": "If you love deck-building games like Dominion and Ascension, then this game is for you! Try the demo, you'll probably be hooked like me! There is a lot going on during the tutorial, but once you get the mechanics down this game is loads of fun! You are playing a traveler through the white wastes of the north, with a storm known as the Frost always at your back. Each time you achieve your objective in a region (by collecting a certain number as determined by the region), you progress, and the Frost gets one step further behind. Each time you dawdle in a region, the Frost gets one step closer. If the Frost catches you, you die! There are three kinds of resource cards: Survivors (people, who can gather more supplies), wood, and food, which are used to progress through the regions. There are also \"Idea\" cards that you can buy with resources, making more powerful versions of the resources with added benefits. As you play more games, you unlock variations of these resources (like a card that sets the Frost counter back by one, giving you another turn, or a trader who can trade food into wood, etc.). You build your hand, make a strategy, and try to stay alive. \n\nThat's just the basic game! A \"temperature\" gage dictated by the region's weather, alters the number of cards you draw in each turn, and there are fights with wolves and scavengers that can cause health damage if you don't fend them off. There are also trade opportunities that come up at random, giving you a chance to get rid of a surplus of one resource in favor of that one you really need. There are also scenarios where you play as a special character with unique powers. (Ex. the hunter can give up heath for attack, or create food by hunting; the tracker walks a lonely path and therefore doesn't have any survivor resources). You have a specific goal for each character that you must achieve under their limitations (Ex: The hunter must fight the tough-to-beat Bear God; the tracker must defeat the enemy that killed her father then travel to a certain area to deliver her father's talisman). Once you beat (some of) these scenarios, you can play the regular game with the unlocked characters. There's also an endless mode, where you just try to survive as long as possible. \n\nI've unlocked all the characters, beaten all the scenarios, unlocked all the cards, and spent something like 36 hours playing and I'm not even sick of it! For $6.99 at full price, you can't say no!", "timestamp_created": 1474755488, "timestamp_updated": 1474755488, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.507573", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25576450": {"recommendationid": "25576450", "author": {"steamid": "76561198025762466", "num_games_owned": 186, "num_reviews": 4, "playtime_forever": 639, "playtime_last_two_weeks": 0, "last_played": 1502906079}, "language": "english", "review": "The atmosphere and the art style are quite original.\nI also love how the game releases more cards by playing more sessions. Makes you want to come back for more.\n", "timestamp_created": 1474227334, "timestamp_updated": 1474227334, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25476580": {"recommendationid": "25476580", "author": {"steamid": "76561197962879222", "num_games_owned": 395, "num_reviews": 15, "playtime_forever": 577, "playtime_last_two_weeks": 0, "last_played": 1504464627}, "language": "english", "review": "A fantastic Survival-Cardgame you can play in a short time.\nIts pretty challenging at the beginning and gets more and more interesting with every game you play because of the unlocks.\nThe artwork and the design was my point of buying but i was also surprised by the gameplay mechanics.\nPlay the demo and you pretty much get what you see.", "timestamp_created": 1473673240, "timestamp_updated": 1473673240, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25106489": {"recommendationid": "25106489", "author": {"steamid": "76561198068680632", "num_games_owned": 333, "num_reviews": 9, "playtime_forever": 281, "playtime_last_two_weeks": 0, "last_played": 1484624562}, "language": "english", "review": "The Long Dark meets Hearthstone. Love it", "timestamp_created": 1472016977, "timestamp_updated": 1472016977, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.530909", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24978034": {"recommendationid": "24978034", "author": {"steamid": "76561198045320944", "num_games_owned": 50, "num_reviews": 26, "playtime_forever": 289, "playtime_last_two_weeks": 0, "last_played": 1471987866}, "language": "english", "review": "Really good and atmospheric game for passing time. I like its meditative feel and unique art style. And the price really makes it a nobrainer if you're into minimalism and survival resource management.", "timestamp_created": 1471457574, "timestamp_updated": 1471457574, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.543568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24720222": {"recommendationid": "24720222", "author": {"steamid": "76561198007774256", "num_games_owned": 155, "num_reviews": 2, "playtime_forever": 551, "playtime_last_two_weeks": 0, "last_played": 1470870355}, "language": "english", "review": "Really fun, keeps me coming back for more.  Surprisingly challenging.", "timestamp_created": 1470377790, "timestamp_updated": 1470377790, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.481928", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24573649": {"recommendationid": "24573649", "author": {"steamid": "76561198115557263", "num_games_owned": 132, "num_reviews": 5, "playtime_forever": 19, "playtime_last_two_weeks": 0, "last_played": 1492072247}, "language": "italian", "review": "IGN 10/10 Il titolo e' uguale al mio nickname.", "timestamp_created": 1469707645, "timestamp_updated": 1469707645, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.501850", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24487340": {"recommendationid": "24487340", "author": {"steamid": "76561198037222425", "num_games_owned": 292, "num_reviews": 28, "playtime_forever": 3552, "playtime_last_two_weeks": 13, "last_played": 1515965797}, "language": "english", "review": "My latest all consuming obsession!  I love how it takes the best of games like Dominion, Ascension, and some classic co-operative games like Forbidden Desert, and mixes them all up to create something new and fresh in a solo card game.", "timestamp_created": 1469310050, "timestamp_updated": 1469310050, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.649867", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24302521": {"recommendationid": "24302521", "author": {"steamid": "76561198120826835", "num_games_owned": 293, "num_reviews": 6, "playtime_forever": 926, "playtime_last_two_weeks": 0, "last_played": 1509342165}, "language": "english", "review": "I really enjoy it.\nIt is beautiful, easy to learn, quick and a large ammount of cards and variations will definitely make me play it again.\nIf you search for a big challenge it might be not the right game for you, but if you search something well made to play occasionally it is just right.", "timestamp_created": 1468441306, "timestamp_updated": 1468441306, "voted_up": true, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.502958", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24270450": {"recommendationid": "24270450", "author": {"steamid": "76561198048529349", "num_games_owned": 22, "num_reviews": 2, "playtime_forever": 219, "playtime_last_two_weeks": 0, "last_played": 1509712875}, "language": "english", "review": "Great game, well done Devs.", "timestamp_created": 1468313834, "timestamp_updated": 1468313834, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.496866", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24233391": {"recommendationid": "24233391", "author": {"steamid": "76561198041343796", "num_games_owned": 447, "num_reviews": 71, "playtime_forever": 553, "playtime_last_two_weeks": 0, "last_played": 1471376136}, "language": "english", "review": "A really coold single player deck building game. The goal is to get your tribe to the refuge without freezing to death. The mechanics are quite unique and lead to interesting decisions.\nEverytime you play a match you unlock new cards which will change up future playthroughs and scenario.\nScenarios are special kind of rule sets with different win conditions and additional mechanics.\n\nMore indepth discussion + gameplay:\nhttps://www.youtube.com/watch?v=jS5Fe6K11PE", "timestamp_created": 1468163554, "timestamp_updated": 1468163554, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.402366", "comment_count": 0, "steam_purchase": true, "received_for_free": true, "written_during_early_access": false}, "24223743": {"recommendationid": "24223743", "author": {"steamid": "76561198141178443", "num_games_owned": 2990, "num_reviews": 82, "playtime_forever": 755, "playtime_last_two_weeks": 0, "last_played": 1468145348}, "language": "schinese", "review": "平时并没有接触什么卡牌游戏，这算是第一个吧。\n画面让我忍不住一试。\n对于我这样的卡牌游戏新手来说，难度是有的。\n但是也不至于难得抓狂，只要一次次尝试基本上是能通关的。\n目前正在努力Hard难度  = =\n\nP.S 那个objective 的达成还真是有点……少部分目标能理解是什么意思，可是很多目标根本没看明白是什么意思……\n就算指引说鼠标右键可以打开说明……但是……有的真是看了也完成不了 = = 有点懵逼……", "timestamp_created": 1468127536, "timestamp_updated": 1468127536, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.560669", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24209152": {"recommendationid": "24209152", "author": {"steamid": "76561198076317666", "num_games_owned": 200, "num_reviews": 12, "playtime_forever": 1081, "playtime_last_two_weeks": 0, "last_played": 1489462514}, "language": "brazilian", "review": "Para quem é fã de Card game com a temática DeckBuilding como Ascension, Star realms, Dominion entre outros, vai adorar esse jogo, além dele trazer a diversidade do DB game, ele é altamente estratégico com uma pitada de sorte. Valeu muito a pena", "timestamp_created": 1468076854, "timestamp_updated": 1468076854, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24195758": {"recommendationid": "24195758", "author": {"steamid": "76561197967166290", "num_games_owned": 628, "num_reviews": 4, "playtime_forever": 466, "playtime_last_two_weeks": 112, "last_played": 1516254250}, "language": "english", "review": "Great little solo deck builder. \nCheck out the demo and see if its for you!", "timestamp_created": 1468027324, "timestamp_updated": 1468027324, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.525577", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24189591": {"recommendationid": "24189591", "author": {"steamid": "76561198027759986", "num_games_owned": 263, "num_reviews": 34, "playtime_forever": 64, "playtime_last_two_weeks": 0, "last_played": 1473795705}, "language": "french", "review": "Simple, éfficace et pourtant difficile...addictif !", "timestamp_created": 1468006189, "timestamp_updated": 1468006189, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24182539": {"recommendationid": "24182539", "author": {"steamid": "76561198004354940", "num_games_owned": 64, "num_reviews": 1, "playtime_forever": 38, "playtime_last_two_weeks": 0, "last_played": 1468325503}, "language": "french", "review": "-Jeu testé depuis ses premières versions- \n\nCe jeu de cartes vous met au défi d'échapper au \"Frost\" en accomplissant les objectifs de chaque zones parcourues à l'aide de survivants, de nourriture et de bois. Au programme: de la récolte, de la fatigue, des loups, des feux de camp, des armes et technologies à débloquer qui vous permettront de parcourir la \"distance restante\", ou non.\n\nLe graphisme est plaisant, la musique est immersive, les mécaniques sont expliquées à travers un didacticiel qui vous permettra d'apprendre aisément les règles du jeu. Derrière son coté casual et une certaine simplicité se cachent de la réflexion, des choix, de la chance, des échecs... Toutes les saveurs qui vous feront comprendre que Frost n'est pas le jeu auquel on ne rejouera pas. \n\nJe le recommande vivement.\n", "timestamp_created": 1467986248, "timestamp_updated": 1467986248, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.572120", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24171658": {"recommendationid": "24171658", "author": {"steamid": "76561198145946910", "num_games_owned": 165, "num_reviews": 6, "playtime_forever": 132, "playtime_last_two_weeks": 0, "last_played": 1468076445}, "language": "english", "review": "it are good game i enjoy", "timestamp_created": 1467942383, "timestamp_updated": 1467942383, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.469443", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24165646": {"recommendationid": "24165646", "author": {"steamid": "76561198071723451", "num_games_owned": 305, "num_reviews": 22, "playtime_forever": 77, "playtime_last_two_weeks": 0, "last_played": 1467920065}, "language": "english", "review": "I love Card Games, so I decided to try this one.\nI need to say this game is not [b]bad[/b]. It has a good mood, actually. Artworks and sounds are nice, and everything is well made and fit together wonderfully. Everything around the gameplay is excellent, gameplay isn't.\nAgain...\nI need to say gameplay is not [b]bad[/b], it works! It's not stupid, it's just... extremely simple. This could be a good thing for someone, maybe, but not for me. If you played a lot of card games, especially board game ones, you'll play this game thinking all the time \"I already did all these things [b]a lot[/b] of times.\", you won't even need a tutorial for the mechanics, you will understand everything, and you'll complete without any effort every task the game will give you. It's simple, easy, and get repetitive fast, if this game offered something new, you could play it once with sparkles in your eyes, then get bored, but it doesn't even offer something new, so if you already know the genre, you'll just get bored. I'm not surprised by the amount of positive reviews, this game possess charisma, but if you look at the playtime of these reviewers you will notice they didn't play the game much time, well, I think a lot of them won't play this game much more time. What it offers are classic german board game mechanics: you need this and that but you have these which you can somehow trade with those, and if you create a good deck balance you'll just keep succeding. Stop. [b]BORING[/b]. Full stop.\n\n[h1]Conclusions:[/h1]\nThis is basically a basic german board game that you play [b]alone[/b] and playing together is eventually the only good thing about a basic german board game. If you really want a german board game to play alone, buy this! It's good! While if you are not insane, I wouldn't recommend this game.", "timestamp_created": 1467922340, "timestamp_updated": 1467922467, "voted_up": false, "votes_up": 21, "votes_funny": 3, "weighted_vote_score": "0.588970", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24163922": {"recommendationid": "24163922", "author": {"steamid": "76561197986955769", "num_games_owned": 471, "num_reviews": 16, "playtime_forever": 133, "playtime_last_two_weeks": 0, "last_played": 1467993361}, "language": "english", "review": "[h1] Survival, Strategy, And RNG Hybridised Nicely Into A Digital Card Game. [/h1]\n\n(Long Review - TL,DR: pros and cons at the bottom)\n\n\nWe’ve had more than our fair share of survival games in recent years; similarly, there’s been more than an ample outpouring of card games into the gaming market too. However, the survival card game ‘Frost’ takes the two and puts them together into something unique and special that we haven’t quite been witness to before.\nIn Frost, instead of running around a landscape and grinding away at rocks and trees for resources, the player plays a card to send one of his party members out to scavenge for desperately-needed supplies on his behalf. Instead of playing cards from his hand to inflict damage upon the enemy, or its minions, the player judiciously lays out cards against mother nature herself where the only true nemesis is the ever-approaching frost.\n\n\n[b] The Game [/b]\n\nThe goal of Frost is to make the treacherous journey through the ever-dangerous and frigid wastelands to the sanctuary beyond – a place where the deadly cold cannot touch you. At each stage during this journey the party, which you lead, will have to stop in a region and fulfil the area’s requirements before being allowed to proceed again. Such requisites include having enough food, fuel, and personnel to be able to survive, regroup, and voyage forth again by pressing the ‘travel’ button and thus ending the turn.\n\nThe main mechanic of the game is the eponymous frost, which pursues you relentlessly from start to finish. At the beginning of the game your tribe starts 8 turns away from the frost, and you can end each turn either by resting, travelling, or merely just ending the turn if you have no other available option. Each turn that ends without you setting forth again results in a decrement of the frost counter. When the counter reaches zero, you succumb to the devouring blizzard and lose the game. On the other hand, every time you travel onwards you put that extra bit of distance between the freezing menace and yourself, leading to an increment in the frost counter – up to the maximum starting value of 8 turns. Your choice of the three end-turning actions (rest, end turn, and travel) will depend on the cards you have in your hand, whether you meet that area’s criteria for passing onwards, and what actions you have or haven’t performed that turn. Depending on the hands you’re dealt it’s quite possible to spend several turns stuck in the same region. So when planning your strategy you always need to be mindful of the approaching danger, and to keep travelling forwards quickly to keep it as far at bay as is possible.\n\nExtra challenges will come your way in the form of hungry animals, and hostile natives. These can either be placated with food, or can be fought off with crudely formed spears and axes – at the potential expense of removing these from your deck. Another alternative is simply to run away from them by pressing the ‘travel’ button at the end of your turn. This has the advantage of not consuming any precious food or weapons, but does inflict damage on your party. Now this is where one of Frost’s very neat mechanics comes into play – you can choose where to impose this damage on your party. Picking yourself means that you’ll lose one of your four hit points, but victimising one of your party members means that they’ll die immediately and will be removed from your deck straight away.\n\nFatigue is another very intriguing mechanic that Frost has to offer and has a particularly interesting and relevant role in the game. Each time you send a party member out scouting for resources they have the chance to come back with food, fire wood, or even another survivor. However, there is always the risk that they’ll return empty-handed and exhausted from their exertion – this ‘exhaustion’ adds a fatigue card to your deck. Consequently, every turn when you draw your cards there’s a chance that you’ll end up drawing fatigue cards, which are essentially useless, in place of other (useful) cards such as a party members or food. \nRemoving fatigue cards from your deck requires that you and your party rest for the entire duration of the turn. The difference between a mere ‘end turn’ and ‘rest’ is that to rest you must not have played any cards at all during the turn prior to resting. This consumes valuable time so you have to be very strategic about when offering respite to your weary group. Spend too many turns in one area scavenging for the needed requirements or resting the fatigue cards out of your hands, and you’ll find the ever-approaching frost gaining ground with alarming speed.\n\nThe game presents you with additional planning and management challenges in the form of events. These are random cards played at the top of the screen, which give you the opportunity to perform specific tasks, providing you with extra strategic options. They basically equate to trading one thing for another, making you try to decide what will be most useful to you many turns later into your journey. As with everything else in Frost, choosing poorly or just plain falling foul to the RNG could spell doom for your survivors later down the line. With these stakes hinging on such decisions you will be left debating whether you’d want to spend scarce resources to craft a potentially life-saving weapon such as a spear or trading them for alternative bare necessities. It truly is surprising how much choice and planning there is available every turn with randomly drawn cards.\n\n\n[b] The Downside [/b]\n\nOn a negative note, some of the special effects are very basic, to the extent that they distract the player and break the immersion of the atmosphere. These are built up of a series of diagonal, zig-zag lines that flutter about on screen either when you remove a card from the deck or on the turn when the frost is about to catch up with your party. The latter is far more egregious, as it involves these distracting lines criss-crossing pretty much the entire screen in a rather intense cyan hue. The former is red zig-zagging of lines covering just the area of the cards in question.\n\nOne thing I truly believe that Frost could benefit from is some sort of campaign. It’s nice to have a game that can be picked up, played, and even completed in about 10-20 minutes (depending how you play). But then it would be great to have some longer-term strategy involved that spanned the equivalent of multiple play-throughs - forcing the player to focus on very acute needs and even more chronic ones.\n\n\n[b] Summary [/b]\n\n[b] PROS [/b]\n+ An excellent hybrid of survival and card game genres.\n+ A very nice mix of (surprisingly deep) strategy and RNG.\n+ New cards are unlocked as you play through the game, thereby enhancing subsequent sessions.\n+ You get to indulge in cannibalism...if you want to.\n+ Some good sound effects, and cold and bleak music adds a sense of scarcity and vulnerability to the atmosphere.\n+ A good challenge – even on easy mode.\n+ Nicely animated cards.\n\n\n[b] CONS [/b]\n- No strategic deck building over an extended period as in other digital card games, sadly. When you start a fresh game, you start anew with the standard basic deck.\n- Some of the visual effects are too basic and detract from the atmosphere.\n- No window mode or resolutions available in the options menu.\n- Music can end rather abruptly without a smooth transition from one piece to another.\n- Whereas most sound effects are appropriately atmospheric, others feel below par.\n- Unsure about Frost’s longevity at this time.\n\n\n[h1] In conclusion, Frost is a very interesting game that combines the survival genre with the RNG of cards, while retaining well thought out strategy. This provides a fun and thought-provoking experience with the aid of its delightfully intriguing mechanics. [/h1]", "timestamp_created": 1467917662, "timestamp_updated": 1467991408, "voted_up": true, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.505282", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24159055": {"recommendationid": "24159055", "author": {"steamid": "76561198004420417", "num_games_owned": 140, "num_reviews": 1, "playtime_forever": 90, "playtime_last_two_weeks": 0, "last_played": 1483802489}, "language": "french", "review": "A really good shot at deck building and survival games. I like it !", "timestamp_created": 1467904230, "timestamp_updated": 1467904230, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24151589": {"recommendationid": "24151589", "author": {"steamid": "76561198007757844", "num_games_owned": 438, "num_reviews": 63, "playtime_forever": 57, "playtime_last_two_weeks": 0, "last_played": 1467805476}, "language": "italian", "review": "Un gioco particolare e molto interessante, un survival game in solitaria con le carte! Il gioco non è tra i più semplici che ho giocato e questo aspetto lo reputo come una cosa positiva; disegni di ottima fattura e molte cose da sbloccare giocando come i livelli di difficoltà maggiori e gli scenari. Sinceramente non trovo un aspetto negativo in questo gioco, anche il prezzo è abbordabile; per aiutarvi nel capire meglio di cosa sto parlando vi lascio a questo video:\nhttps://www.youtube.com/watch?v=E6Jo73XoHfk", "timestamp_created": 1467875874, "timestamp_updated": 1467875874, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.507168", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24145797": {"recommendationid": "24145797", "author": {"steamid": "76561198169311898", "num_games_owned": 1952, "num_reviews": 115, "playtime_forever": 246, "playtime_last_two_weeks": 0, "last_played": 1506758087}, "language": "english", "review": "Somewhere in an eternal winter, your band of chill-bitten survivors pushes on towards safety with a deadly storm clawing at your backs. As starving wolves and lurking feral cannibals lurch from the mountainside, your meagre resources succumb to the cruel hunger of the cold. Your numbers dwindle, many lost to fruitless scavenging expeditions. Fatigue sets in. You must rest for just a while... but the frost never sleeps and the frost marches for you.\n\nSpeaking as somebody that's never touched a deck-building game in their life, I may or may not be rating [b]Frost[/b] higher than it deserves but I can tell you that it has served as a perfect introduction to the genre for me. The excellent tutorial lays out the simple framework of the game: use your food, materials and survivors to successfully pass through each location on your journey before the frost counter rolls down to zero and you are consumed by the storm. Move to a new area and the counter rolls back one. Spend any longer than a single turn there and it advances.\n\nComplicating matters are the area events that can range from benevolent farmers willing to trade wood for food to vicious wolf attacks that must be dealt with before moving, lest you face a blow to your health meter. A range of helpful optional 'Idea cards' populate the top of your screen with various effects but come at a cost to your resources, forcing you to make tough decisions on what is likely to benefit you long-term.\n\n[b]Frost[/b] is an incredibly unforgiving game, even on the so-called easy difficulty. A good run can be torn to shreds in a matter of two or three bad rounds but a lot of the blame will fall squarely on the player's shoulders rather than those of the game itself. Inescapably, there is a degree of RNG to be considered that will test even the most well prepared survivalist but [b]Frost[/b] scorns those who relax in the opening half of their campaigns with brutality, punishing frivolous resource management with a swift death as the run grinds on.\n\nAlthough it could do with more deck variety and some degree of player customisation, [b]Frost[/b] is solid for the asking price. The game does a fine job of incentivising extended play by unlocking new cards and unique scenarios with every run you complete and the combination of the minimalist interface and eerie soundtrack do wonders for immersing players in the wintry theme. Well worth a try for newcomers to the genre but the easily frustrated will be quickly turned off.\n\nFull review below:\nhttps://www.youtube.com/watch?v=pjZzAMJU0t8", "timestamp_created": 1467847842, "timestamp_updated": 1467848006, "voted_up": true, "votes_up": 9, "votes_funny": 3, "weighted_vote_score": "0.615071", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24133481": {"recommendationid": "24133481", "author": {"steamid": "76561198113782779", "num_games_owned": 105, "num_reviews": 6, "playtime_forever": 1645, "playtime_last_two_weeks": 0, "last_played": 1511289150}, "language": "french", "review": "Solid mechanics, I wish a board game IRL with this concept.\n\nSurvie, Rogue-lite, Snow, Great music, Simple but cool graphics, Difficult and cheap for the hours of gameplay it offers;\nGET IT", "timestamp_created": 1467809990, "timestamp_updated": 1467809990, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.499429", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24131732": {"recommendationid": "24131732", "author": {"steamid": "76561198018483984", "num_games_owned": 1390, "num_reviews": 90, "playtime_forever": 294, "playtime_last_two_weeks": 0, "last_played": 1502275896}, "language": "english", "review": "[h1]Stop reading reviews - just try the Demo![/h1]\n\nI'm a bit of a card game addict, and this game looked interesting / unique enough to make it a day one purchase. There is a demo available, which gives it a massive +1 in my opinion since so few developers these days are willing to give you a chance to try the game. This is probably going to appeal to a fairly niche set of gamers, so it's definitely worth checking out before you purchase. You get a good sense of gameplay and art style from the demo. But hey, if you still care what I think about it...\n\n[h1]Frost is a card based resource management / strategy survival game.[/h1]\n\nIt has a very simplistic art style, UI and a very minimal soundtrack made up of odd winter noises, but a surprising amount of depth to gameplay and strategy. The aim is to get your group of survivors through the blizzard and into safety, with resource management dictated by a set of RNG cards from a pre-built deck. You manage food, wood and survivors to travel to each new area, whilst the frost follows quickly behind, putting a lot of pressure on you not to make a mistake each turn and to use your resources in the best way possible.  You draw cards and with those cards you can manage random events, defeat obstacles/fights, complete \"ideas\" (special effect cards) and complete a region to move onward. You don't get to customize your own deck; but different difficulties and scenarios give you different decks and abilities/challenges. There are three main difficulties (easy, medium, hard), an endless mode (survive as long as you can), and then specific scenarios, such as keep a target family alive.\n\n[h1]Here we go with the RNG again...[/h1]\n\nThere is a frustrating amount of RNG that really ups the difficulty level of the game. It is already quite a challenging game in my opinion; even at the easier difficulties, but sometimes it feels nigh on impossible and my eye twitched once or twice in rage even on the easiest setting. Grrrrrrr. Overall I felt like the difficulty threshold was set too high; the word \"easy\" on the first mode is really not true at all (unless I'm just being super-dumb) and some balance tweaks could be useful here. Even just increasing the frost timer would make the easy mode a little more forgiving in the start.\n\n[h1]Progression is somewhat lacking.[/h1]\n\nThere's no campaign to give you a sense of progression or story, but there are levels of difficulty that are unlocked, as well as specific challenge scenarios that unlock as you play. I do feel like there was a missed opportunity to throw a bit of writing in here and to add a campaign. The open-play with limited cards makes it feel a little lacking in content to me,  unless you're a fan of farming achievements and then there'd be a goal in mind. The game is low priced, so it still feels like there is a good sense of value to me for what it is, but I would have been happy to pay a bit more for a proper campaign and a storyline with a real sense of progression rather than getting brutalized in random encounters from the start.\n\n[h1]Limited options.[/h1]\n\nThe options are a little too limited for my taste. No windowed mode is a very big deal for me, especially in a slow paced card / strategy game where it's really not that unexpected that people are going to want to alt tab and reply to messages or play in a smaller screen. The entire UI is extremely white - white background, white cards, even a white mouse cursor, which can sometimes be hard to see. Blanket white games when played for a long period can give me headaches and be pretty harsh on the eyes, and I can't even make the game smaller to deal with that. There's no resolution or graphics options - full screen as it is or nothing at all and the only thing you can change is the sound which I set to off, since I found the weird groans and clanks a little annoying. This, above all else will stop me playing the game for more than a brief period. That being said, a single game can take place in 5-10 minutes so perhaps on the whole it is more suited to quick bursts of play.\n\n[h1]But it's fun! Yes really![/h1]\n\nStill, despite the annoyance of fullscreen, despite the RNG and the constant failure as my group of survivors died over and over and over, I kept playing it. I enjoy the challenge, and it gave me a real feeling of achievement when I finally triumphed. My playstyle rapidly improved as I figured things out and learned the cards, and the way I was playing a few hours into the game was very different to the start, so expect to die a bit in the beginning as you work out the best strategies. Whilst there may not be a campaign, I definitely felt the warm tingle of personal progression. Ultimately, it definitely brings something new to the genre and that's what I like to see.\n\nIt'd be tough to give this game a rating out of 10, as it definitely has a lot of areas that can be improved - but I'm happy to give it a thumbs up with a strong recommendation of playing the demo first to see if you enjoy the style. Hopefully some of the frustrations can be alleviated, such as a look at the balance of \"Easy mode\" and a windowed mode being added in the future.\n\n[h1]Overall it's a cool (get it?) and quirky little survival game that'll appeal to those who enjoy resource management and strategy.[/h1]", "timestamp_created": 1467803897, "timestamp_updated": 1467804014, "voted_up": true, "votes_up": 52, "votes_funny": 2, "weighted_vote_score": "0.824361", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24127194": {"recommendationid": "24127194", "author": {"steamid": "76561198009426585", "num_games_owned": 218, "num_reviews": 2, "playtime_forever": 386, "playtime_last_two_weeks": 0, "last_played": 1467864763}, "language": "schinese", "review": "This is a DBG!!!!!!!!!!!!!!!!!!!!!!\n\n利益相关：我是DBG一生黑……\n一般来说我感觉DBG都是业界毒瘤，披着不同背景的皮但是玩法核心都是一样的：以一副相同的初始套牌开始，在游戏过程中得到新的牌丢掉不想要的牌，让自己的卡组刷分力/战斗力越来越强最后取得胜利；\n一辈子只玩一次就够了的游戏类型！\n\n但是比较意外的是玩起来这个游戏的感受还不错。\n可能是生存（活下来）这种游戏形式比刷分给我的感受要更直观，代入感也做的很好；\n“不这样就会死！”相比“这样好像可以多拿5分……”显然更有驱动力。\n\n目前为止过了 easy middle leader 不同的难度和模式下玩法也有所不同，游戏内容还是很丰富的。\n可以说是一个比较新颖的DBG吧。\n\n推荐给DBG爱好者。\n新手教程完成就可以愉快的玩耍了，但是如果以前没有接触过这个类型，可能游戏的运作方式理解起来会有点困难。\n可能虽然知道怎么玩，但是并不知道为什么要这么做……\n", "timestamp_created": 1467784587, "timestamp_updated": 1467784587, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.687040", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24119896": {"recommendationid": "24119896", "author": {"steamid": "76561198043917368", "num_games_owned": 431, "num_reviews": 3, "playtime_forever": 288, "playtime_last_two_weeks": 0, "last_played": 1484797570}, "language": "english", "review": "Frost is a fun deck building game that has a lot of potential to suck away hours of your life without you even noticing.  Here are some of the quick Pros and Cons about Frost.\n\nPros:\n- Simple but appealing art style\n- Very clear tutorial\n- Fun gameplay, even when you are doomed\n- The game found a good balance of having the game be hard but not hard enough to stop you from playing\n- The unlock system is well done and will add reason to keep playing\n- Quick games, meaning you can play through in about 20 minutes if time is an issue\n- Chance cards add a feeling of desperation in some cases, which fits the theme\n- The game is mostly resource management but does a good job of keeping tension and creeping doom even when you feel safe resource wise.\n- The theme is very interesting and many of the choices you make, like cannibalism, fit the theme perfectly.\n\nCons:\n- The game is very white and at times I lost track of the mouse on the screen.  Wish the mouse icon was a different color.\n- Fatigue seems a little too strong, it is hard to manage it properly without falling way behind.\n- The frost countdown seems a bit too hard.  You are always, at best, keeping even with it and it feels like you can't regain time you have lost.\n- The sounds of the game can be kind of weird, especially with headphones on. The heavy breathing in particular is weird.\n- There are times when the idea cards at the top repeat the same card multiple turns in a row which can ruin a good run instantly, would love more variance or just less likely chance to be a copy.\n- Not necessarily a con but the randomness can be brutal so for those who do not like randomness, this may not be the game for you.  \n\nFrost is easy to recommend for anyone who is into deck building games and like a challenge.  This is a great game that has already become my new time killer game thanks to its short but fun gameplay.  My only hope is that it eventually makes its way to the iPad because I feel like this game would fit perfectly as an app as well.  \n\nHere is a little first impression/first look at the game i did:\n[url=https://www.youtube.com/watch?v=eY2ubZHBP-o] Nick is Now Trying - Frost [/url] \n\nhttps://www.youtube.com/watch?v=eY2ubZHBP-o", "timestamp_created": 1467755977, "timestamp_updated": 1467756023, "voted_up": true, "votes_up": 22, "votes_funny": 2, "weighted_vote_score": "0.705974", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 57, "total_negative": 2, "total_reviews": 59}}
