{"reviews": {"39031496": {"recommendationid": "39031496", "author": {"steamid": "76561197960434414", "num_games_owned": 1907, "num_reviews": 14, "playtime_forever": 70, "playtime_last_two_weeks": 0, "last_played": 1513561255}, "language": "english", "review": "A fun hacking game, that is also fully accessible to blind and low vision computer users.  This successful Kickstarter game combines the best of classic text adventures and modern presentation and gameplay conveniences.", "timestamp_created": 1515026807, "timestamp_updated": 1515026807, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38949572": {"recommendationid": "38949572", "author": {"steamid": "76561198075823363", "num_games_owned": 125, "num_reviews": 11, "playtime_forever": 857, "playtime_last_two_weeks": 0, "last_played": 1514217003}, "language": "german", "review": "Habe das Spiel zum ersten mal auf der Gamescom 2016 gespielt, habe es mir dann kurz vor der Gamescom 2017 geholt und gleich alles gespielt, außerdem habe ich es mehreren Freunden gezeigt und alle hat es auch Spaß gemacht. \nDie Story ist wirklich fesselnd und es macht Spaß auch alle Dateien, die nicht nötig sind zu lesen. \nViele Mechaniken im Spiel sind innovativ und es fühlte sich nicht einfach nur nach Wiederholungen an, klar sind Grundmechaniken immer gleich aber die Rätsel sind immer anders und niemals langweilend.\nDie Charaktere sind super geschrieben und alle unterschiedlich, keiner fühlt sich wirklich nach einem generischen Spiel-Helden an.\nIch habe jetzt bestimmt Episode 0&1 5 mal durchgespielt um alles mögliche bei den wichtigen Entscheidungen herrauszufinden.\nDie Musik ist einfach wundervoll (Höre sie auch gerne außerhalb des Spiels) und passt immer gut zur Situation.\nIch freue mich echt schon auf die nächsten Episoden.", "timestamp_created": 1514838896, "timestamp_updated": 1514838896, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38890633": {"recommendationid": "38890633", "author": {"steamid": "76561198055276814", "num_games_owned": 716, "num_reviews": 25, "playtime_forever": 71, "playtime_last_two_weeks": 0, "last_played": 1514491849}, "language": "french", "review": "Code 7 is an inventive, original and well written indie game that deserves every penny spent on it and every moment spent playing it. \n\nThe voice acting is very convincing and helps convey a story that never disappoints and often tooks the players off guard. The diversity of the cast of characters is a nice touch and a very appreciated effort that brings a lot to the general atmosphere of the game. \n\nThe pseudo-code interface and the fact that it serves as the only way for the players to interact with the environment and NPCs reenforces the feeling of helplessness and horror that are the main attraction of this game, on top of a SF story that doesn't shy away from social and philosophical subjects.  \n\nThe only thing that could beneficiate from some improvement is the general naviguation in the map interface. Having to move back and forth from nodes to nodes without being able to use the naviguation arrows was sometimes tidious. Not a major issue, thought. \n\nOverall, a great experience that I can only recommand.", "timestamp_created": 1514701596, "timestamp_updated": 1514702235, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37509804": {"recommendationid": "37509804", "author": {"steamid": "76561198120292055", "num_games_owned": 93, "num_reviews": 3, "playtime_forever": 116, "playtime_last_two_weeks": 0, "last_played": 1512329341}, "language": "french", "review": "Au moment de cette évaluation j'ai joué qu'au 2 premier épisodes.\n\nCode 7 est un surprenant ou l'on dirige une personne depuis un interface en \"ligne de commande\" (un peu dans l'idée de hacknet) une personne en \"hackant\" les différentes interactions du personnage mais ne requière aucune connaissance. Le jeu est assez intuitif, le scénario sympa\nJe recommande fortement\n", "timestamp_created": 1511610969, "timestamp_updated": 1511610969, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36555572": {"recommendationid": "36555572", "author": {"steamid": "76561197975484185", "num_games_owned": 834, "num_reviews": 9, "playtime_forever": 593, "playtime_last_two_weeks": 0, "last_played": 1510602186}, "language": "english", "review": "One of the best interactive sience fiction stories this year.\nPro's:\n-Amazing voice acting. All the voice actors extremely talented. Only gripe I had with voice acting was some \"shouts\" were not convincing.\n-The story kept me intrigued all the way.\n-Puzzles were fun.\n-Both Episode 0 & Episode 1 had similar but different set of tools to tackle the obstacles with.\n\nCon's:\n-If you guessed the plot of Episode 1 from the Episode 0's ending. You could not do anything about it. (Felt robbed of choise)\n-There is only Episodes 0&1 out. I want more! :D\n-Could not change screen colour from blue before she decided on my nickname. :(", "timestamp_created": 1510855207, "timestamp_updated": 1510855207, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35918187": {"recommendationid": "35918187", "author": {"steamid": "76561198049706349", "num_games_owned": 34, "num_reviews": 1, "playtime_forever": 327, "playtime_last_two_weeks": 0, "last_played": 1508890873}, "language": "english", "review": "(Writing this after playing Episode 0 and 1 and waiting for the rest)\nFantastic piece of interactive fiction.\n\nI love interactive fiction like \"Spider and Web\" and this game brings the genre to a whole new level with amazing voice acting.\nAs a hacker, you control your environment with text commands and computer interfaces while constantly talking with your partner.\nIt is hard to believe how frightened you can get when hearing your partner screaming for help while not being actually able to see what is going on. This is Stephen King level of scary. No jump-scares involved, just claustrophobic atmosphere and amazing voice acting.\nThe story has nice slow pacing. With couple of conversations, voice recordings and tons of emails we start to explore the vision of future where people are just starting to colonize other planets. You even have small pieces of data on politics.\nCracking passwords based on personal information, man in the middle attacks and hopping through network are very nice mechanics that fit very well with hacker-vibe. Other puzzles are also quite rewarding to solve.\n\nIt is not a perfect game and definitely not for everyone. It is easy to get lost with all new characters, especially given that you don't even have a picture for them while they are talking. With holo lenses and all that advanced tech, we could at least snap a photo to show it to player :)\nSome puzzles require just typing stuff fast enough which can be frustrating even with all the game help like \"autocomplete\", but they are not too bad and make you actually feel the rush.\nI feel that this game could be perceived similarly to \"Life is Strange\". If player likes to get into characters, both games can be very emotional and can be easily 9/10. Other people just can't stand them. I am definitely in the first group :)\n\nI just hope that all the strange mysteries will have a nice conclusion, unlike for example in the \"Lost\" series.\n\n9/10, keep up the good work!", "timestamp_created": 1508672544, "timestamp_updated": 1508672544, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35622005": {"recommendationid": "35622005", "author": {"steamid": "76561198051325657", "num_games_owned": 1025, "num_reviews": 120, "playtime_forever": 222, "playtime_last_two_weeks": 0, "last_played": 1507655351}, "language": "french", "review": "- Au moment de la Review, seul le prologue et l'épisode 1 sont disponibles -\n\nCode 7 est une expérience narrative mélangée avec une \"simulation\" de hacking (pensez Hacknet, en plus light). Je ne dévoilerais rien du scénario, parce que c'est franchement là que le jeu brille avec ses nombreux rebondissements malgré une base assez classique, mais sachez simplement qu'il s'agit de Hard SF.\n\nAu niveau du Gameplay, vous devez progresser en \"hackant\" divers réseaux et prendre des décisions qui modifieront le déroulement de l'histoire. Les épisodes sont assez courts pour que le gimmick de hacking ne soit pas trop ennuyant (TOUT, j'ai bien dit TOUT, doit être effectué au clavier, parfois, c'est un peu contre intuitif, mais ce n'est pas grave : c'est aussi ça le but du jeu).\n\nAprès 2 épisodes, je suis dans le scénario et j'ai hâte de mettre mes mains sur la suite, ce qui est bon signe. Si vous avez aimé Hacknet, foncez. Si vous n'avez jamais essayé de jeux du genre, rassurez-vous : code 7 est super light et n'attends pas de vous que vous soyez un vrai programmeur. C'est simple !", "timestamp_created": 1507655698, "timestamp_updated": 1507655698, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35438058": {"recommendationid": "35438058", "author": {"steamid": "76561197971146922", "num_games_owned": 611, "num_reviews": 1, "playtime_forever": 400, "playtime_last_two_weeks": 0, "last_played": 1512204941}, "language": "english", "review": "[h1]This gem is absolutely breathtaking.[/h1] \n\nClassic textadventure enhanced with some simple but nethertheless nice graphics and amazing voice actors.\n\nThe storyline is brilliant and the ambient is way better than some other high-end graphic game.\nIf you enjoyed playing games like S.O.M.A, Stasis etc you have to give it a try. You'll love it. \n\nCan't wait for episode 3 (yes, the cliffhangers might be the only negative thingy about Code 7) ;)", "timestamp_created": 1507014904, "timestamp_updated": 1507014904, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35220147": {"recommendationid": "35220147", "author": {"steamid": "76561198021716569", "num_games_owned": 371, "num_reviews": 1, "playtime_forever": 315, "playtime_last_two_weeks": 0, "last_played": 1506425370}, "language": "english", "review": "Very nice game.\nThe story is intriguing.\nGameplay is very fun to play! \n5h playtime after episode 1. A promising duration for the next episodes!", "timestamp_created": 1506425438, "timestamp_updated": 1506425438, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35161451": {"recommendationid": "35161451", "author": {"steamid": "76561198116388315", "num_games_owned": 58, "num_reviews": 2, "playtime_forever": 311, "playtime_last_two_weeks": 0, "last_played": 1506191211}, "language": "english", "review": "Oh my, what an experience! What shines the brightest in this game is the story and the atmosphere. I found slow exploration of the game world through little tidbits of text and short recordings to be very rewarding. There is a sense of helplessness you get from having to rely on others (or rather on one specific person you're teamed with) to discover your surroundings, but it only adds to the overall atmosphere. The voice acting is spot on, which is very important in a game like this. The graphics are quite limited, but still impactful – I never supposed that some dots moving on the screen can send a shiver down my spine. Can't wait for the next episode.", "timestamp_created": 1506193286, "timestamp_updated": 1506193286, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35136384": {"recommendationid": "35136384", "author": {"steamid": "76561198011515841", "num_games_owned": 227, "num_reviews": 24, "playtime_forever": 562, "playtime_last_two_weeks": 0, "last_played": 1513430022}, "language": "english", "review": "I backed this on Kickstarter and am glad I did and am happy to see the final product.  Just wish I could have finished it.  The timed sequences just killed me.  Near the end of Episode 1 is a chase scene that I made it through the first part and then epic fail.  I just can't pass it fast enough and after a dozen times I need to call it a day or my computer equipment will start flying across the room.   When I backed it and when I look at the store page description I was thinking something more along the lines of Mainlining (with a different plot of course).  I got more action than hacking.\n\nI highly recommend this game for gamers with fast reflexes that like sci-fi, hacking games.  For them I think they will enjoy it immensely.  Very well done game.", "timestamp_created": 1506110469, "timestamp_updated": 1506110469, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34815247": {"recommendationid": "34815247", "author": {"steamid": "76561197970403249", "num_games_owned": 460, "num_reviews": 9, "playtime_forever": 577, "playtime_last_two_weeks": 0, "last_played": 1505498860}, "language": "english", "review": "It's a glorified text adventure, but fully voiced (adequatly enough) and with nice visualization. Not everything is perfect, like moving from place to place is rather cumbersome and the puzzles are pretty easy so far.\n\nAll in all an interesting approach and the story is interesting, putting the game in future space stations including high tech concepts such as [spoiler]AI's, quasi-hacking and digital brains[/spoiler].\n\nIt is a little buggy though, I encountered two bugs so far that block further progress until restarting the game resetting it to the last savepoint. This is annoying, but I'm sure these issues will be ironed out quickly as the devs seem to actively monitor issue reports and are fixing them quickly.", "timestamp_created": 1504879606, "timestamp_updated": 1505048871, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500312", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34730605": {"recommendationid": "34730605", "author": {"steamid": "76561198110426086", "num_games_owned": 1193, "num_reviews": 27, "playtime_forever": 647, "playtime_last_two_weeks": 0, "last_played": 1504712311}, "language": "english", "review": "[h1]This is a breathtaking masterpiece with a brilliant story! Highly enjoyable and literally captivating![/h1]\n\nI'm a Kickstarter backer who found the project to be a cool idea and backed it, and I was positively shocked by how good it turned out to be! Started up the game to try it out, and couldn't stop playing.\n\nWhat gives it its glory is the [u][b]amazing and captivating story and events[/b][/u], and the [u][b]great voice acting.[/b][/u]\nThis makes the game an [u][b]emotional adventure[/b][/u]... you'll feel your heart racing at some points, and the creators of this game did a great job of making me (someone who doesn't feel much) actually feel what the characters I'm interacting with are feeling. (horror, fear, relief, joy, sadness, remorse, security and danger, anger... and most probably hunger)\n\n\n[u][b]It's really easy to get playing.[/b][/u] The gameplay mechanics are good, easy to learn, and allow you to easily do what you intend to do without frustration, and typing the commands is easy for anyone. You don't need to be a hacker to play this game.\n\n[u][b]The puzzle-solving element is also great[/b][/u], and requires you to get creative and to scratch your head at some points. It's not difficult so this won't get in the way of the story, but you'll need to think and be attentive to proceed, to not miss anything, and to get the nice achievements/side-quests/hidden surprises.\nMusic and the sounds are also great.\n\nI can't wait for the remaining episodes to come out.", "timestamp_created": 1504515616, "timestamp_updated": 1504515808, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.504041", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34541681": {"recommendationid": "34541681", "author": {"steamid": "76561197977311684", "num_games_owned": 371, "num_reviews": 17, "playtime_forever": 94, "playtime_last_two_weeks": 0, "last_played": 1503880289}, "language": "english", "review": "***Clarification - I won a key for this game through a giveaway, it wasn't sent to me for review or anything***\n\nSkynet + SOLI = BFF\n\nCode7 is pretty terrifying, in both the EXCELLENT story telling way and in the \"what if\" way where this kind of thing could ACTUALLY happen.\n\nIf you're not great with commandline thinking and executing commands quickly you may have a tough time as this game doesn't seem to have a difficulty change option. BUT if you're quick with typing or can utilize the tab function to autocomplete (very helpful by the way) you'll be just fine. Ep0 is FANTASTIC and I'm working my way through Ep1 now. \n\nBuckle up, and don't lose your head ;-) S.O.L.I is watching.", "timestamp_created": 1503878008, "timestamp_updated": 1503878008, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34513639": {"recommendationid": "34513639", "author": {"steamid": "76561197980303197", "num_games_owned": 87, "num_reviews": 1, "playtime_forever": 50, "playtime_last_two_weeks": 0, "last_played": 1503696791}, "language": "english", "review": "Met the guys at gamescom. They were really nice. I even got a poster by solving one of the challenges at the booth.\n\nBut now the game: I actually did not play at the booth. I just talked to the devs and found their ideas really cool and I like how passionate they are about the development of Code 7. I went home and bought it right away. Played Episode 0 in less than an hour. And I was hooked into the story from the get-go.\n\nThe Pros:\n- really intuitive UI and game design\n- good voice acting\n- good mix of old text adventure games and modern game design\n- good and interesting story\n\nCons (so far):\n- some minor bugs which I will report to the trello board.\n\nAll in all I recommend getting this one if you are interested in a text based adventure/hacking game. 17 bucks (as of 08/28/17) devided into 5 episodes is around 3.50€ for each episode. Give these guys a chance. They deserve it.", "timestamp_created": 1503779358, "timestamp_updated": 1503779358, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.572154", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34507893": {"recommendationid": "34507893", "author": {"steamid": "76561197971480117", "num_games_owned": 871, "num_reviews": 10, "playtime_forever": 266, "playtime_last_two_weeks": 0, "last_played": 1503761943}, "language": "english", "review": "Well what to say about Code 7.. It is amazing!\nThe story is well written and drains you into it.\nThe console input is some 'soft of shell' with \"own\" features. i would prefer a unix shell over this approach.\nBackground atmosphere is nice and subtle.\n\nCan't wait until EP2 is out. (Timestamp for ref: 2017-08-26)", "timestamp_created": 1503762197, "timestamp_updated": 1503769541, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.508197", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34466493": {"recommendationid": "34466493", "author": {"steamid": "76561197990614034", "num_games_owned": 235, "num_reviews": 5, "playtime_forever": 286, "playtime_last_two_weeks": 0, "last_played": 1503602270}, "language": "english", "review": "So I was at Gamescom yesterday (August the 23rd 2017) and found this little neat thing at the indie arena. Someone left a test station and I just took over where that guy left. I had no idea about the story or on what to do.\nFor a text-based adventure it was super intuitive to figure out what the controls are and how certain things work. So let's mark that as a [i]pro[/i], shall we?\n\nAt some point I basically had \"too much\" in a positive way. The game captured my full interest and I was super excited about the little bit of story I played so far and I didn't wanted to ruin the fun of exploring more. Within like 10 minutes of test playing at a games fair I got hooked. Note: At this point I didn't even know I was playing the demo (aka Episode 0).\nI ended up buying my steam key directly from the Devs - at least I assume it's been the Devs showcasing their product.\n\nToday I played through Episode 1 and boy, what a lucky find I made at Gamescom!\n\nI'm not gonna give any hints or spoilers regarding the story but I myself find it awesome and I can't wait for more to come.\n\nSo, let's do this list thingy showing you Pro and Con:\n\n[b]Pro[/b]\n[list]\n[*]Very intuitive controls\n[*]Ingame tutorial explaining things to you while you play (it doesn't feel forced onto you)\n[*]Characters speak to you - so your input isn't text only\n[*]Neat puzzles that make you think\n[*]Amazing story with twists and some surprises\n[/list]\n\n[b]Con[/b]\n[list]\n[*]One timed puzzle that might be a bit too harsh on you\n[*]You have to wait for the other episodes to be released (Ok, maybe this is just a minor con)\n[/list]\n\nÍ may be just a random guy on the internet and my opinion might not matter to you. But if you're into adventure games and you don't fear playing a game [u]only[/u] with your keyboard than I suggest you buy this title right away and enjoy a very good adventure game and support some - I'd say - upcoming developers.", "timestamp_created": 1503603529, "timestamp_updated": 1503603572, "voted_up": true, "votes_up": 8, "votes_funny": 2, "weighted_vote_score": "0.606246", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34448996": {"recommendationid": "34448996", "author": {"steamid": "76561198034669264", "num_games_owned": 211, "num_reviews": 4, "playtime_forever": 160, "playtime_last_two_weeks": 0, "last_played": 1503532450}, "language": "german", "review": "EInfach nur TOP !", "timestamp_created": 1503532176, "timestamp_updated": 1503532176, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34420806": {"recommendationid": "34420806", "author": {"steamid": "76561197994918452", "num_games_owned": 939, "num_reviews": 35, "playtime_forever": 161, "playtime_last_two_weeks": 0, "last_played": 1503264711}, "language": "french", "review": "Difficile de ne pas tomber sous le charme de ce jeu qui pour moi est vraiment marquant comme Orwell, Stories Untold....\nJe dois dire deux choses avant de laisser mon évaluation pour être honnête avec vous : \n- Un j’ai kickstarté ce jeu donc je ne suis pas un investisseur mais plutôt un philanthrope\n- Deux ce jeu n'a sorti que 2 épisodes sur 5 et il faudra attendre 6 mois entre chaque épisode sans doute mais je pense qu’il faut soutenir des créateurs quand ils sont bons d'où cette évaluation très précoce ( je précise que j'évalue en général les saisons complètes et/ ou les jeux finis ;) \n\nC'est un jeu découpé en 5 épisodes, l’épisode 0 est gratuit (vous pouvez le télécharger via le magasin) après il faut payer. Le jeu est en Anglais (je doute qu’il soit traduit :/) mais ne demande un niveau de compréhension très élevé. C'est un jeu textuel avec une interface qui facilite la prise des mots (pas comme stories untold ^^ ) mais aussi de hacking de système (porte, ordinateur...) dans un contexte de Science-Fiction. \n\nJe précise que je ne spoil rien d'important dans l’histoire : \" Vous jouez le rôle d’Alex (hacker) qui enquête avec Sam (qui sera sur le Terrain) à propos d'une station Schrodinger qui n'envoie plus de rapport. Le scénario est à faire tomber une mâchoire, entre puzzle, hacking, la découverte de la part d'ombre de chacun, mais aussi [b][u]Des twists à tomber à la renverse [/u][/b] ^^ (Digne et c'est une référence à la fin de l'épisode 2 de walking dead saison 1  (la ferme) c'est dire).\nIl y aura des choix qui selon les créateurs des conséquences sur les prochains épisodes.\nVous serez en jouant à ce jeu ce qu'est Code 7.\nL'épisode 0 dure 1h / 1 h 30\nL'épisode 1 dure 3 à 4 h (durée rallongée par l'exploration du Network) dans cet épisode, vous ferez la connaissance de  Zoya qui une journaliste avec ses petits secrets ;).\nDernière chose la plus importante, [b][u] on poursuit l'épisode 1 juste à la suite de l’épisode 0 (un peu comme dans la saga Aliens où tout est lié) [/u][/b] \nQuel secret garde cette station ? Vous le découvrirez en jouant à ce jeu ! \nPour vous aider j'ajoute ma vidéo de présentation qui ne spoil rien ;) d’important !  :\nhttps://www.youtube.com/watch?v=xQt3jKRNy5E", "timestamp_created": 1503424356, "timestamp_updated": 1503425037, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34407213": {"recommendationid": "34407213", "author": {"steamid": "76561198014795706", "num_games_owned": 194, "num_reviews": 6, "playtime_forever": 547, "playtime_last_two_weeks": 0, "last_played": 1503355755}, "language": "english", "review": "This game is exactly what I was looking for, and I can't wait for the next episodes!\n\nText-based, hacking, story-rich, sci-fi. What more could you ask for really? \nHours after finishing Episode One, I can't stop thinking about my decisions. I can't decide whether to playthrough again or wait for the next episodes first. Either way, great job Goodwolf Studio. Not only have you made a fantastic game but inspired me to keep pushing forward in my programming and game dev adventures.\n\nSo excited for what's next!\n", "timestamp_created": 1503370409, "timestamp_updated": 1503370409, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.565217", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34401643": {"recommendationid": "34401643", "author": {"steamid": "76561197978987521", "num_games_owned": 67, "num_reviews": 3, "playtime_forever": 177, "playtime_last_two_weeks": 0, "last_played": 1504113957}, "language": "english", "review": "This Game makes a lot of fun. The story is impressive and from time to time you have action scenes so you have enough variety from reading mails and listening audio-logs or spoken dialogs. Can't wait to get the following episodes :-)", "timestamp_created": 1503345220, "timestamp_updated": 1503345220, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34391881": {"recommendationid": "34391881", "author": {"steamid": "76561198143113937", "num_games_owned": 109, "num_reviews": 12, "playtime_forever": 800, "playtime_last_two_weeks": 0, "last_played": 1503249424}, "language": "english", "review": "A game that will suck you in, Code 7 is hypnotic in it's story-telling.\nEpisode 0 simply throws you into a situation that you need to get out of and by Episode 1 you slowly start to realize just how much your choices really matter.\nA big, FAT recommendation from me!\n\nStory:\nCode 7's strongest point by far. What starts as two people stuck on a abandoned space station quickly turns into a horror scenario in Episode 0 and once Episode 1 starts, you already come to realize how desperate the situation is, both in space and on earth. And the only thing that motivates you are two questions: What is Code 7? And will you be able to stop it?\n\nGraphics:\nAs expected from a text adventure, the graphics are simple and mostly text based, but in opposition to other games, Code 7 has graphics, mini-games and a smart interface to always keep the player up to date without forcing them through annoying \"Look at Shelf\" shenanigans.\n\nAudio:\nFully voiced characters, plenty of audio logs and amazing electro music always keep the game a pleasure to listen to. Turn off the lights, put on your headphones and you might just forget that you're not really a hacker trying to save the world from S.O.L.I.\n\nGameplay:\nWhile being text-based, you never have to fight with the game not knowing what you want by trying out sixteen variations of \"pick up\". The entire language of the game works via computer-based code to navigate yourself through the network, interact with computers and servers, hack into accounts and activate doors, lights and more.\nWhile it might need a bit of time at the beginning to get into it and really understand the logic behind it, once you're used it, it feels very natural to quickly move across the building, use a Brute Force attack to get into a computer and read through all the private mails you might want.\nAdditionally, you hold control over a human companion who you can ask to move or interact with the parts of the rooms that you don't have access to, allowing you full access over both digital and manual data.\nWhat sounds incredibly complicated right now is unbelievably simple and intuitive in-game and even the very few tutorials never seem annoying or out of place.\n\nOther:\nEpisode 0 and 1 hold a amazing universe full of characters and lore. Reading through the notes and mails reveals real people with wishes, dreams and relationships. Some are married, some have children, some have a really bad case of compulsive hoarding. You can spend hours simply reading and listening through everything the characters have to tell about themselves. \nThe main storyline meanwhile is incredibly intense, rarely allowing a break before throwing the next reveal or horrific fact at you about all the things that are going wrong. It's impossible not to care especially for the main characters Sam, Alex and Zoya as they try their best to survive and reach for help in a world that is slowly going mad.\nBe prepared to be violently tossed around and left speechless at the end of EVERY episode. If you thought the end of Episode 0 is cruel, then wait for the end of Episode 1.\nAnd considering the amazing quality so far, I am very positive that all future episodes will be no different.", "timestamp_created": 1503309924, "timestamp_updated": 1503309924, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.567100", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34283413": {"recommendationid": "34283413", "author": {"steamid": "76561198171203194", "num_games_owned": 73, "num_reviews": 2, "playtime_forever": 158, "playtime_last_two_weeks": 0, "last_played": 1503077556}, "language": "german", "review": "it's ok", "timestamp_created": 1502914616, "timestamp_updated": 1502914616, "voted_up": true, "votes_up": 0, "votes_funny": 2, "weighted_vote_score": "0.498691", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34265031": {"recommendationid": "34265031", "author": {"steamid": "76561197962556048", "num_games_owned": 597, "num_reviews": 6, "playtime_forever": 404, "playtime_last_two_weeks": 0, "last_played": 1503238564}, "language": "english", "review": "Really nice hacker game. You indirectly control the sifi story, which is really fine and good voices. Take over systems, communicate with others, control robots, reroute energy and much more. Try the demo, when you like hackers games you will have fun.", "timestamp_created": 1502835283, "timestamp_updated": 1502835283, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.507246", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34260694": {"recommendationid": "34260694", "author": {"steamid": "76561198075964929", "num_games_owned": 308, "num_reviews": 9, "playtime_forever": 216, "playtime_last_two_weeks": 0, "last_played": 1502891430}, "language": "english", "review": "Can't recommend this more. It's simply an amazing game. You really get attached to the characters in the game and the story goes deeper and deeper. The ending of Chapter 1 was amazing. Can't wait for the rest of the chapters. The gameplay was pretty cool though I wish to see some new gameplay mechanics in the other chapters, as it can get a bit repetetive doing the same thing. Introducing a new game mechanic each chapter can make things harder and less repetetive.\n\nMaybe make some more visuals, like accessing a few cameras so you can see what is going on in some places? Accessing the microphone is a cool feature but maybe the ability to access the webcam aswell?\n\n\n(Small spoiler)\nWhen doing the mission to get the ID card I found myself going back to the Intelligence app to look up the information I needed. Maybe once you discover the things you need make a note on the side revealing the info once gathered it?", "timestamp_created": 1502819805, "timestamp_updated": 1502819840, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.549072", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34251437": {"recommendationid": "34251437", "author": {"steamid": "76561198063802651", "num_games_owned": 56, "num_reviews": 2, "playtime_forever": 58, "playtime_last_two_weeks": 0, "last_played": 1502537062}, "language": "english", "review": "Really immersive text-based sci-fi hacking game. Incredible voice acting, awesome soundtrack and really cool gameplay! Love it!!", "timestamp_created": 1502784640, "timestamp_updated": 1502784640, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.507246", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34244080": {"recommendationid": "34244080", "author": {"steamid": "76561198145701324", "num_games_owned": 144, "num_reviews": 28, "playtime_forever": 726, "playtime_last_two_weeks": 0, "last_played": 1513808173}, "language": "english", "review": "Very good text adventure game. The gameplay is very appealing, the music is awesome and the story will be badass af (only episode 1 played)", "timestamp_created": 1502746995, "timestamp_updated": 1502746995, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.504373", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34243104": {"recommendationid": "34243104", "author": {"steamid": "76561198038814984", "num_games_owned": 123, "num_reviews": 1, "playtime_forever": 265, "playtime_last_two_weeks": 0, "last_played": 1502915344}, "language": "english", "review": "Although I've had trouble playing through (mostly) text-based games, [b]Code 7[/b] got me hooked and sucked me in in an instant. The amount of lore found on almost each computer you hack, together with the interesting character writing, add a feeling of great depth to the world. The story itself is top-notch.\nWhile you experience the eery atmosphere of [b]Code 7[/b] almost entirely through the splendidly voiced descriptions of your partner, the interface only consists of a console and a map, with which you need to lead her through corridors and shafts, deactivating obstacles or luring enemies away - all through inline commands.\nThe minigame sequences, in which you are hacking other computers, are quite fun and get progressively harder.\nAfter a couple of hours with this game, I can very much recommend it to anyone who is interested in a great next gen text adventure that doesn't come along as dry as other games of this genre I've played in the past - on the contrary!\nAnd by the way - the music is [b]awesome![/b]", "timestamp_created": 1502743203, "timestamp_updated": 1502743203, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.507246", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34241673": {"recommendationid": "34241673", "author": {"steamid": "76561198015825079", "num_games_owned": 795, "num_reviews": 11, "playtime_forever": 382, "playtime_last_two_weeks": 0, "last_played": 1503227818}, "language": "english", "review": "Even though the idea is nothing too new, the realisation is really good. For not haven played a text adventure for a long time, I really enjoy this hybrid between a classic text adventure and, well I don't know, hacknet with puzzles. \nI don't even know if it counts as text adventure when you don't really type commands in a ways like, for example ZORG.\n\nAnyhow, I really like the Sci-Fi setting and the overall look, music and style of the game. I think it is a gem, overlooked by most, but I quite enjoy it and I strongly believe more people would if they gave it a chance.", "timestamp_created": 1502738025, "timestamp_updated": 1502738025, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504373", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34240698": {"recommendationid": "34240698", "author": {"steamid": "76561198000500103", "num_games_owned": 202, "num_reviews": 2, "playtime_forever": 254, "playtime_last_two_weeks": 0, "last_played": 1503762872}, "language": "german", "review": "Just Awesome :)", "timestamp_created": 1502734577, "timestamp_updated": 1502734577, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34237338": {"recommendationid": "34237338", "author": {"steamid": "76561198029268686", "num_games_owned": 171, "num_reviews": 1, "playtime_forever": 70, "playtime_last_two_weeks": 0, "last_played": 1502722905}, "language": "english", "review": "Did you ever want to be able to type like a hacker in the movies? Code 7 combines a hacker console text adventure with photographs, video and glitch effects to create a great surreal athmosphere. Everything in the game works via your text console commands - even the game options are part of the game. As you go on your adventure a creeping sensation sets in that you might as well be in a Philipp K. Dick novel like Ubique. Are you even human? Are you alive? Is any of this even real? Sam seems real. At least she gets annoyed when I turn the light in her room on and off on her. I guess the only way to find out is to press on..", "timestamp_created": 1502723210, "timestamp_updated": 1502723210, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.507246", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34235795": {"recommendationid": "34235795", "author": {"steamid": "76561198022209629", "num_games_owned": 109, "num_reviews": 9, "playtime_forever": 236, "playtime_last_two_weeks": 0, "last_played": 1502116293}, "language": "english", "review": "Episode 1 is a huge improvement over Episode 0 (the demo). There are way more options and a bigger space to explore. Puzzles are challenging enough to be entertaining. Most of the fun comes from poking around and trying different approaches to solve a problem — just as you do in real life hacking (I was told).\nStory steps up too. There are some cliché parts, but it is overall pretty tense and atmospheric.\nI also want to point out: story and gameplay a intertwined very well. The things you do make sense in the games context (please don't hack in real life).", "timestamp_created": 1502717842, "timestamp_updated": 1502717842, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.498216", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34235109": {"recommendationid": "34235109", "author": {"steamid": "76561198047612188", "num_games_owned": 166, "num_reviews": 1, "playtime_forever": 363, "playtime_last_two_weeks": 0, "last_played": 1502731316}, "language": "english", "review": "I enjoy the game a lot. I had the opportunity to play the free first episode beforehand, so I knew what I was getting into.\n\nThe game has a great vibe, and being a sci-fi fan I like the story too. I didn't think you could convey such a cool atmosphere with text-adventure game.\n\nThe voice acting is great, and the music fits really well to.\n\nOverall I can really recommend this game.", "timestamp_created": 1502715337, "timestamp_updated": 1502715337, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.475059", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34234674": {"recommendationid": "34234674", "author": {"steamid": "76561198057687855", "num_games_owned": 160, "num_reviews": 14, "playtime_forever": 5, "playtime_last_two_weeks": 0, "last_played": 1502713644}, "language": "english", "review": "Played the demo of this game and can't wait to spend the weekend with this gem ^^", "timestamp_created": 1502713717, "timestamp_updated": 1502713717, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.544888", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34233137": {"recommendationid": "34233137", "author": {"steamid": "76561198134366680", "num_games_owned": 499, "num_reviews": 20, "playtime_forever": 663, "playtime_last_two_weeks": 0, "last_played": 1502704952}, "language": "english", "review": "*Disclaimer* This product was received free for reviewing purposes.\n\nGoodwolf Studio love what they do and that can be seen in Episode 1 : Threading. They pay attention to the world building, expanding their universe slowly but steadily, using talented actors to perform their lines beautifully and give life to their creation. This is a quality release that will surprise lovers of interactive stories and adventurers alike. I hope these guys finish the next episode sooner than expected\n\nYou can read the full review at [url=http://www.hyperlightup.com/code-7-episode-1-threading-review/] Hyper Light Up website.[/url]", "timestamp_created": 1502707649, "timestamp_updated": 1502707649, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.490994", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34221938": {"recommendationid": "34221938", "author": {"steamid": "76561198025173408", "num_games_owned": 256, "num_reviews": 1, "playtime_forever": 779, "playtime_last_two_weeks": 0, "last_played": 1502964971}, "language": "english", "review": "Text adventures have never looked better! \n\nCode 7 is a sci-fi hacking based game with a very mysterious atmosphere. You play as a hacker in a desolated space station trying to solve the mystery surrounding you. The story is so captivating that you will lose track of time, trying to always find more about the places and characters you meet as hours go by.\n\nThe mechanics are cleverly integrated into the story, so the connection with your character is real. Writing commands in your keyboard is the same as hacking a futuristic console in space.\n\nThe voice acting is marvelous, the music is awesome, and everything is wrapped up in a very elegant cinematic experience.\n\nYou can also try episode 0 for free! so go ahead an play this now!", "timestamp_created": 1502655479, "timestamp_updated": 1502655479, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.602029", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34221784": {"recommendationid": "34221784", "author": {"steamid": "76561198072705058", "num_games_owned": 73, "num_reviews": 2, "playtime_forever": 462, "playtime_last_two_weeks": 0, "last_played": 1503009441}, "language": "english", "review": "It's refreshing to see a new approach to text adventures. This game hooks players through its use of suspense, interesting hacking puzzles and great music. The voice acting helps a lot to inmerse you in a story that's full of thrilling events and surprises. I'm totally looking forward to see what other awesome characters and plot-twists the next episodes will bring to the table.", "timestamp_created": 1502655002, "timestamp_updated": 1502655002, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.559014", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34218575": {"recommendationid": "34218575", "author": {"steamid": "76561198010224166", "num_games_owned": 174, "num_reviews": 6, "playtime_forever": 635, "playtime_last_two_weeks": 0, "last_played": 1502644559}, "language": "russian", "review": "Удивительно, но время за игрой пролетело очень незаметно и теперь жду не дождусь следующих эпизодов.\n\n\nИгра, которая держат вас в напряжении, иногда не по себе и почти всегда вы будете себя ощущать крутым хакером. Умение думать, находить решения и быстро печатать спасает в разных ситуациях.\n\nЭто полноценная текстовая-игра с небольшими графическими головоломками. Я как-будто бы читал книгу, где мне озвучивали текст. \n\n\n10 искусственных интеллектов из 10", "timestamp_created": 1502645001, "timestamp_updated": 1502645001, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.584777", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34205850": {"recommendationid": "34205850", "author": {"steamid": "76561198081322398", "num_games_owned": 350, "num_reviews": 17, "playtime_forever": 231, "playtime_last_two_weeks": 0, "last_played": 1502597670}, "language": "english", "review": "It's really good. But you don't need my opinion, the first episode is free! Check it out and do what you gotta do.", "timestamp_created": 1502597778, "timestamp_updated": 1502597778, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.486899", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34199794": {"recommendationid": "34199794", "author": {"steamid": "76561197986850839", "num_games_owned": 639, "num_reviews": 15, "playtime_forever": 162, "playtime_last_two_weeks": 0, "last_played": 1502793089}, "language": "english", "review": "----\nInitial Disclaimer for those that may have missed the mention by the developers!\n\nThe developers are planning to have the episode releases be spaced apart by a period of around 6 months between each episode. On release the game contains the (free) Prologue and Episode 1 out of the planned 4 episodes.\n\nThis means if the developers keep to their planned schedule then it will be close to another 2 years before the final episode is released and the arc is concluded.... so PLEASE be aware of the development span associated with this game (And the potential risks of it never finishing due to fact that anything can happen across 2 years, regardless to the developers best intentions today).\n----\n\n\nDevelopment schedule concerns aside this is a really engaging game with a novel approach to the typical 'hacker command prompt' design, that ends up creating something that feels somewhat like a text adventure game (with all dialogue voice acted) yet having enough UI elements in place to resolve the usual issues text adventure games suffer from.\n\nSo when 'moving' around from one point to another in the prologue for example there's actually a 'map app' that is used that has reference IDs for each area and you simply enter that reference ID into your command prompt to navigate there immediately.\n\nIt just all integrates so well into the command prompt interface aesthetic that it simply 'feels right'.... my only criticisms would be that there are different 'interaction modes' for switching between things like the command prompt and interacting with individuals, and the default bindings and the way the game attempts to relay which one you're in feels somewhat clunky moving between the two during some more time sensitive situations. \n\nIt would have been nice to have had the option to remap such behaviours to another key of my choice. Such as Tab for switching between states, rather than the enforced binding of Spacebar, which triggers even when you're typing into the command prompt and forget for a second that the game doesn't support multiple string input and as such everything has to be typed as a single string (word).\n\nAlso some of the behaviour rules with the UI change for seemingly little reason. In one area pressing Enter may act as a 'go back' option in a menu. Another time it may act as a 'Select Option to change setting'.... the changing rules for what the same button does depending on the specific menu given this is supposedly a singular command prompt interface can be a bit jarring sometimes.", "timestamp_created": 1502571525, "timestamp_updated": 1502572361, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504373", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34199038": {"recommendationid": "34199038", "author": {"steamid": "76561198332939615", "num_games_owned": 11, "num_reviews": 1, "playtime_forever": 1650, "playtime_last_two_weeks": 0, "last_played": 1513532755}, "language": "english", "review": "I recommend this game to everyone who can afford it", "timestamp_created": 1502568933, "timestamp_updated": 1502568933, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.417968", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34193695": {"recommendationid": "34193695", "author": {"steamid": "76561198260740018", "num_games_owned": 11, "num_reviews": 2, "playtime_forever": 56, "playtime_last_two_weeks": 0, "last_played": 1502857242}, "language": "english", "review": "(Edit: I was mistaken in thinking it comes with all episodes, developer confirmed, I'm just blind) It's fun, slightly challenging, and makes you feel badass about solving puzzles. Voice acting is great most times, and the visual style and controls are cool. The story shines most, as it captivated me and really drove me to keep playing. Great game!", "timestamp_created": 1502551562, "timestamp_updated": 1502578670, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.516358", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34186265": {"recommendationid": "34186265", "author": {"steamid": "76561198021200350", "num_games_owned": 179, "num_reviews": 5, "playtime_forever": 307, "playtime_last_two_weeks": 0, "last_played": 1513164445}, "language": "english", "review": "Bardzo dobra gra, dawno czekałem na coś w starym, tekstowym stylu. Pomimo tego, że bazuje na tekście do czynienia mamy również z klimatyczną muzyką i grą aktorską.\n\nTak więc jeżeli spodobał Ci się Epizod 0 ta gra jest dla Ciebie!\n8.5/10", "timestamp_created": 1502526015, "timestamp_updated": 1502526015, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.449024", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34183302": {"recommendationid": "34183302", "author": {"steamid": "76561198200161774", "num_games_owned": 74, "num_reviews": 36, "playtime_forever": 503, "playtime_last_two_weeks": 0, "last_played": 1502814113}, "language": "english", "review": "Code 7 proves that you don't need high tech graphics and 3D for a great game... just a white-knuckle story, solid acting, original music, and the most unique interface/concept I've seen in years.  This is way more than a text adventure.  For anyone who has a technical bone in their body, this is a game that you should not miss!  Read my full review at [url=http://justadventure.com/index.php?option=com_content&view=article&id=3992] JustAdventure [/url].  I gave the game an 'A'!", "timestamp_created": 1502512343, "timestamp_updated": 1503076245, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.589741", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34180544": {"recommendationid": "34180544", "author": {"steamid": "76561198168549825", "num_games_owned": 70, "num_reviews": 1, "playtime_forever": 322, "playtime_last_two_weeks": 0, "last_played": 1502498259}, "language": "german", "review": "Hatte das Spiel bei Kickstarter unterstützt & daher der Steam-Key (Keine Ahnung, ob das als kostenlos erhalten zählt)\n\nIch versuche mich kurz zu halten.\n\nEpisode 0 gibt einen guten einblick in das Game und in die wirklich gute erzählte Story\n\nEpisode 1 .... gerade beendet und ich bin einfach baff.\nEin tot geglaubtes Genre, mit neuen Elementen, mMn mehr als erflogreich, wiederbelebt.\nWenn ich das Geschehen bis Ende Episode 1, mit wenigen Worten, beschreiben sollte, dann wären das:\n- Gämsehaut (Mehrfach)\n - Plottwist\n - WTF\n - Sprachlos (immer noch)\n\nZu beachten sei folgendes:\nMan bekommt die Basics erklärt, die feinheiten muss man sich aber selbst erarbeiten.\n\nStorytelling kann Goodwolf\nKlare Empfehlung meinerseits", "timestamp_created": 1502499740, "timestamp_updated": 1502644827, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.514163", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34177889": {"recommendationid": "34177889", "author": {"steamid": "76561198007727427", "num_games_owned": 59, "num_reviews": 8, "playtime_forever": 329, "playtime_last_two_weeks": 0, "last_played": 1502490326}, "language": "english", "review": "I never knew a text-based game could be so much fun. This game will get inside of you, Terrific!!\n\nhttps://youtu.be/xNy39BPWZJI", "timestamp_created": 1502488532, "timestamp_updated": 1511462508, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.412223", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 7, "review_score_desc": "Positive", "total_positive": 46, "total_negative": 0, "total_reviews": 46}}
