{"query_summary": {"num_reviews": 20, "review_score": 7, "review_score_desc": "Positive", "total_positive": 48, "total_negative": 0, "total_reviews": 48}, "reviews": {"37914692": {"recommendationid": "37914692", "author": {"steamid": "76561198008550743", "num_games_owned": 423, "num_reviews": 11, "playtime_forever": 739, "playtime_last_two_weeks": 0, "last_played": 1512514070}, "language": "english", "review": "Holy Balls! Its Amazing, im leaving this review purly for the devs creating this Incredible piece of software, i tryed this about 7 or 8 months ago when it was fairly new, at first i was blown away being able to make fairly minecraftesc scenarios, low detail no biggy, it took me a few hours to relise i could zoom in to add more detail.... then holy doog poo, it opened up SOOO MANY OPTIONS. created an entire city using large blocks of cubes then zoomed in slightly to decrese the size of my brush, hollowed out all your buildings then shrunk myself down to an ant then walked into this massive humungus skyscrapper that i was just observing from above. as a writer and creator of imagineering this tools is amazing for quickly being able to scetch out an idea, then spend the next 3-4 hours zooming in and out to add in tiny amounts of detail that really makes a world of difference making the idea perfect. just when i thought this couldnt get any better you add smooth meshes... it does need more work ill admit but being a vet of VR i dont get motion sickness and other such problems that some begininer VR users have, but im so incredibly stoked you decideced to add that feature. i only wish you dont get to washed away in the money side of things and keep pasionate about makeing what i really hope becomes an essential tool for the future of virtual reality. i do have suggestions to further make this awesome but my review is not the place for that. id even go as far to say this is the best 3d creation software ive used in VR", "timestamp_created": 1511912277, "timestamp_updated": 1511912277, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34672764": {"recommendationid": "34672764", "author": {"steamid": "76561197972159575", "num_games_owned": 202, "num_reviews": 1, "playtime_forever": 339, "playtime_last_two_weeks": 0, "last_played": 1504827565}, "language": "english", "review": "I've looked at this off and on for a while now, but only recently pulled the trigger after buying the daydream version on sale. After playing around with that I discovered that it supports cross-platform multiplayer, which meant that my daughter and I could play at the same time in the same world (one of us wearing daydream and the other the Vive). We've had a ton of fun throwing rockets at one another, playing ball, destroying everything in sight around one another, and changing scale so that one of us becomes a giant and another a mouse.\n\nWhen I play by myself I've found this to be a more powerful and easy to use creation tool than I expected. Right now I'm working on a house for my daughter. I love how I can change scale on the fly to make tiny details (like a bee on the rose bush under the window, or a birds nest inside the trunk of a tree). I really love creating things in VR, there's something incredibly satisfying about it and this game scratches that itch perfectly.", "timestamp_created": 1504312600, "timestamp_updated": 1504312600, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33385265": {"recommendationid": "33385265", "author": {"steamid": "76561198101377714", "num_games_owned": 103, "num_reviews": 6, "playtime_forever": 3939, "playtime_last_two_weeks": 363, "last_played": 1514783821}, "language": "english", "review": "If you like voxel based creative software and enjoy VR then this is a must have. I have used a few other voxel based games/software over the years just for being creative in and this is by far my favorite so far. Makes quick work for alot of stuff being able to scale up and down which is where it excells over others. In others you can spend ages trying to make some big if you are stuck at same size but in this you just scale up create it in next to no time roughly and scale down to add details. This is a fantastic feature as you can scale down extremely small to add those hard to get to details. For alot of art and creative stuff, its the details that count so how this gives you the option to add as much detail as you want ....i can see some awesome creative screenshots and installations getting posted on the community page once people really start using it to its potential.  I've only had this for 2 days and already put nearly 17 hours in. So far i have'nt even tried importing any objects which i see others have. So huge options available.\nPros: Almost too many to list.  \n        VR \n       Being able to scale up and down\n       Editable Avatars is fun\n\nCons:  Ummm be prepared to live in VR and lose days of your life.... altho its quite worth it.\n          \nIdeas:   Maybe a palette of textures like wood, stone, grass, gravel, etc to add to give an even more real look to objects you create. \n       Top marks to the developers of this. Its great fun and loads of potential. Worth every cent. Stop reading this and go get it if you dont have it and are a creative person. :)", "timestamp_created": 1499546710, "timestamp_updated": 1499546710, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33298778": {"recommendationid": "33298778", "author": {"steamid": "76561198018552256", "num_games_owned": 1288, "num_reviews": 14, "playtime_forever": 25, "playtime_last_two_weeks": 0, "last_played": 1498971938}, "language": "english", "review": "For what is there, it's very enjoyable. A couple of things I'd love to see: Easier scaling, in real time if possible, possibly using the grip buttons, and I'd like a Jetpack. The glider is cool, but if you fall it becomes a great pain the ass to get back to where you were high up without making yourself huge. A grappling hook would be nice too. And maybe Climbey-esque controls? I hate comparing everything to Climbey regarding locomotion, but they really do it well, and being able to climb the 400 foot tall phallus I just sculpted sounds hilariously fun. :D", "timestamp_created": 1499310322, "timestamp_updated": 1499310322, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33290408": {"recommendationid": "33290408", "author": {"steamid": "76561198026069277", "num_games_owned": 159, "num_reviews": 16, "playtime_forever": 1379, "playtime_last_two_weeks": 0, "last_played": 1512834053}, "language": "english", "review": "It's crazy fun to sculpt in this program. I like it quite a bit, but.... the controls are awkward and the tools  are lacking.  I still recommend it because it's really fun.\n\nPROS:\n- very fun to voxel sculpt with it.\n- fantastic that you can scale yourself up to the size of a giant, or down to an ant.\n- performs very well (no lag or anything).\n- can make good looking stuff without a lot of skill.\n\nCONS:\n- the controls are awkward to use.\n- tool options are lacking.\n- can't scale the world while you stand still (must teleport and scale yourself)\n- can't get rid of the basket ball if you click it by accident.", "timestamp_created": 1499287714, "timestamp_updated": 1499287750, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32923937": {"recommendationid": "32923937", "author": {"steamid": "76561197998336636", "num_games_owned": 720, "num_reviews": 37, "playtime_forever": 68, "playtime_last_two_weeks": 0, "last_played": 1498921473}, "language": "english", "review": "Most intuitive sculpting app so far for me, interface is a bit fiddly at first, but is generally well thought out. Allows for both additive and subtractive sculpting and scales to just about any size, symmetry features have also recently been added. The aesthetic is a block style similar to Minecraft or it's many clones, so no easy angled blocks (yet). \n\nThere are multiple locomotion modes, so if you don't feel like port-port-porting around you can test your motion sickness tolerance with the (rather neat) Cubeworld style hang glider...\n\nPerformance wise I haven't hit any issues on the demos or with my own crude structures, so even using something like the GTX970 you should be able to pump up the supersampling a little. More CPU and RAM bound than GPU.\n\nEssentially (early) minecraft creative mode in VR and with an interface designed for touch controllers. Excellent for playing around and building as well as breaking the ice for new VR users. Gameplay is nonexistent outside of creating, but it is called SculptrVR after all.\n\nOne minor request would be the ability to load up a reference image of some kind, a scalable floating window with a one button file browser would be nice. Switching to Desktop mode to look at these things does break the flow a bit.", "timestamp_created": 1498643262, "timestamp_updated": 1498643262, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29687462": {"recommendationid": "29687462", "author": {"steamid": "76561198062265829", "num_games_owned": 82, "num_reviews": 5, "playtime_forever": 76, "playtime_last_two_weeks": 0, "last_played": 1490946015}, "language": "english", "review": "[strike]Super cool, but desperately needs an in-game tutorial. You have to figure out all the controls by yourself, which is not the easiest.[/strike] New update completely fixes my issues with that.\n\nSuper cools, controls are now fairly intuitive, and performance is improved significantly from previous versions.", "timestamp_created": 1486196735, "timestamp_updated": 1490949129, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.541667", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29682284": {"recommendationid": "29682284", "author": {"steamid": "76561198352297012", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 136, "playtime_last_two_weeks": 0, "last_played": 1500333614}, "language": "english", "review": "Amazing game.  Imagine Minecraft but in virtual reality with a few added tricks.  The hang gliding feature is definitely my favorite and being able to scale yourself to different sizes comes in handy and adds to the VR experience.  Id recommend this game to anyone with a VR set up.", "timestamp_created": 1486172954, "timestamp_updated": 1486172954, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "29290750": {"recommendationid": "29290750", "author": {"steamid": "76561198079642602", "num_games_owned": 217, "num_reviews": 13, "playtime_forever": 1105, "playtime_last_two_weeks": 12, "last_played": 1514682774}, "language": "english", "review": "I actually like this better than TiltBrush. In SculptrVR you can build a castle the size of yourself and then shrink down and explore it and build the details. I spent an hour making a little fort on the side of a cliff with trenches and underground passageways, chiseling out tunnels and building walls Minecraft-style with the block tool. \n\nAnd yes, the hang glider is as fun as it looks. The game comes pre-packaged with tons of huge destructible maps, and one of them is a massive tree structure. You can shrink down to ant-size and and hang glide between the leaves, each of which is as big as a church. \n\nPlaying 3D Pictionary is a lot of fun, too.\n\nEDIT: I just realized you can export builds as a .obj file, which means [b]you can 3D print the sculptures you make.[/b] That's freaking incredible.", "timestamp_created": 1484549535, "timestamp_updated": 1485908802, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.703808", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28546045": {"recommendationid": "28546045", "author": {"steamid": "76561198039727034", "num_games_owned": 337, "num_reviews": 4, "playtime_forever": 26, "playtime_last_two_weeks": 0, "last_played": 1482448169}, "language": "english", "review": "Wow. Just wow.\n\nThis software is fantastic. I received a key from the developer in order to test the hang glider locomotion, but I plan to buy a couple copies to give to friends. \n\nThis game's controls and tools are incredibly intuitive, other than the water spawner, though I'm told by the dev that that is something in the works.\n\nIn addition, the hang glider is probably my favorite form of locomotion in any game I've played in VR so far. It works exactly as you expect it would, and it's fantastic to fly around like Mario with the wing cap in Super Mario 64.\n\nIf you want a fun game where you build worlds and explore them with friends in VR, this one is highly suggested.", "timestamp_created": 1482461116, "timestamp_updated": 1482461116, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "28333920": {"recommendationid": "28333920", "author": {"steamid": "76561197992536733", "num_games_owned": 142, "num_reviews": 50, "playtime_forever": 461, "playtime_last_two_weeks": 0, "last_played": 1500848132}, "language": "english", "review": "+ Huge potentials\n+ Multiplayer\n+ Fun to use!\n+ Devs listening on the customers (Option to disable the output for my 4K screen!)\n\n- Voxels voxels voxels, what are the use cases for this? Look at Oculus Medium?\n- User interface could be improved\n- Unfortunately, not on par with Oculus Medium\n\nOverall: A very recommended VR experience!\n", "timestamp_created": 1481579975, "timestamp_updated": 1481579975, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28168118": {"recommendationid": "28168118", "author": {"steamid": "76561197985099219", "num_games_owned": 546, "num_reviews": 3, "playtime_forever": 41, "playtime_last_two_weeks": 0, "last_played": 1491696756}, "language": "english", "review": "Played this before I got my vive and was one of my first games when I got my own. A really cool game. It's amazing just to walk around the demo designs, but walking around your own is ever better. Being able to quickly sculpt a landscape and then take a walk around it is amazing. If you enjoy creating things this is a must get.", "timestamp_created": 1480793035, "timestamp_updated": 1480793035, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26325558": {"recommendationid": "26325558", "author": {"steamid": "76561197972307555", "num_games_owned": 559, "num_reviews": 17, "playtime_forever": 340, "playtime_last_two_weeks": 0, "last_played": 1481492185}, "language": "english", "review": "First off, this is beautifully fast to get stuck into. The single player experience gives you a lot of space to play with, and it's fun to scale yourself up, built some mega-structure, then scale back down and add rooms to it, external detail, inner mazes or whatever!\n\nThe copy-paste tool is great if you made something the wrong size, too, because you can make a copy, then scale the copy (and/or yourself) before pasting it back larger/smaller.\n\nThe multiplayer seems to work okay in that it functions well, but there is a crying lack of proper communication between players (we need voice chat like in RecRoom!) and so the main method of communication degrades into destructive \"griefing\" activities (overwriting work, flinging rockets everywhere, etc).\n\nThe game isn't \"early access\" but is in active development as best I can tell, so the game has my recommendation for a great singleplayer and hopes for the future RE multiplayer.", "timestamp_created": 1477867260, "timestamp_updated": 1477867260, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26107720": {"recommendationid": "26107720", "author": {"steamid": "76561198331692369", "num_games_owned": 19, "num_reviews": 2, "playtime_forever": 58, "playtime_last_two_weeks": 0, "last_played": 1513424174}, "language": "english", "review": "The game has great potential but like a lot of games in VR I spent way too much time trying to work out what to do and how to do it.\nAn easily accessible tutorial or help file would be so useful.", "timestamp_created": 1476828837, "timestamp_updated": 1476828837, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26013214": {"recommendationid": "26013214", "author": {"steamid": "76561198256275728", "num_games_owned": 38, "num_reviews": 2, "playtime_forever": 133, "playtime_last_two_weeks": 0, "last_played": 1483675390}, "language": "english", "review": "I love making objcts in SculptrVR and exporting them to the Blender modeling program.", "timestamp_created": 1476369200, "timestamp_updated": 1476369200, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25977553": {"recommendationid": "25977553", "author": {"steamid": "76561198322012186", "num_games_owned": 18, "num_reviews": 1, "playtime_forever": 8938, "playtime_last_two_weeks": 0, "last_played": 1493781637}, "language": "english", "review": "This game is totally awesome! I highly recommend this game to anyone that enjoys building worlds. The ability to resize the user up and down is unique to SculptrVR and a must-have VR experience. The new block model import feature  allowed me to get some real world structures and topographic features loaded in. The developers keep on adding new features and I can't wait to see what is coming in future releases. Anything you can imagine is possible with SculptrVR!", "timestamp_created": 1476162819, "timestamp_updated": 1476162819, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25825420": {"recommendationid": "25825420", "author": {"steamid": "76561198024939347", "num_games_owned": 221, "num_reviews": 16, "playtime_forever": 149, "playtime_last_two_weeks": 0, "last_played": 1483039637}, "language": "english", "review": "This is the best vr experience yet for me.\nbeing able to make massive things then look at them from a tiny perspective is insane.\nworth a buy for sure.", "timestamp_created": 1475430376, "timestamp_updated": 1475430376, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25722114": {"recommendationid": "25722114", "author": {"steamid": "76561198009344643", "num_games_owned": 289, "num_reviews": 5, "playtime_forever": 243, "playtime_last_two_weeks": 0, "last_played": 1476747735}, "language": "english", "review": "Best $20 I have spent on the Vive yet by FAR. I love Tilt Brush very much but this program scratches an itch that I don't think Tilt Brush ever will.\n\nSeriously, if you're into raw, zany, unbridled creation, give this game a shot. Can't wait to try it with friends in multiplayer.\n\nHonestly you guys. I'd heard good things about this game but I am blown away. I am SO HAPPY that I got this and I can't wait to see what you do next with it.\n\nEDIT:\nI had originally requested features for a brush-like eraser and the ability to grab and scale models - turned out they both actually already exist in the game! These guys are on top form.", "timestamp_created": 1474968199, "timestamp_updated": 1475212256, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.495298", "comment_count": "7", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25605448": {"recommendationid": "25605448", "author": {"steamid": "76561197992523182", "num_games_owned": 306, "num_reviews": 32, "playtime_forever": 229, "playtime_last_two_weeks": 0, "last_played": 1512751702}, "language": "english", "review": "This game is really cool and development is coming out well... the description for the game is accurate and i suggest you get this.", "timestamp_created": 1474389491, "timestamp_updated": 1474389491, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25576123": {"recommendationid": "25576123", "author": {"steamid": "76561198160784240", "num_games_owned": 42, "num_reviews": 2, "playtime_forever": 545, "playtime_last_two_weeks": 0, "last_played": 1499036075}, "language": "english", "review": "How do I scale myself???!!!!", "timestamp_created": 1474226131, "timestamp_updated": 1474226131, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.452675", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25175827": {"recommendationid": "25175827", "author": {"steamid": "76561198027185451", "num_games_owned": 86, "num_reviews": 8, "playtime_forever": 3071, "playtime_last_two_weeks": 0, "last_played": 1512714650}, "language": "english", "review": "There are people already over 100 hours on this, because it's that great.\n\nIt's not tilt brush, it's more of a real thing builder than a wire frame sketcher.\n\nYou can be very organized and make really cool things, and make them with your friends.\n\nIt lets you create entire worlds and play around. It's also continually updated by a responsive developer. We're getting more power tools, and it's a lot improved over the first releases.\n\nI recommend this to anybody who's got a vive. Give it a try, make something with your friends! \n\nYou've probably never tried anything like this.", "timestamp_created": 1472279351, "timestamp_updated": 1472279351, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "25153547": {"recommendationid": "25153547", "author": {"steamid": "76561198123581839", "num_games_owned": 248, "num_reviews": 21, "playtime_forever": 2070, "playtime_last_two_weeks": 0, "last_played": 1510095549}, "language": "english", "review": "This is an amazing application. Nothing else in VR lets you scale yourself down to the size of a bug all the way to a size of a mountain, with just the swiping of the thumb. Creating huge worlds is incredibly easy, intuitive, and satisfying. Very hard to describe, but even a non-artist like myself can space out in this insanely awesome app. Can't recommend it enough. I bought this when the vive first came out, and thought it was cool, but I had so many other things I wanted to try in vr. Four months later and I'm playing this more than nearly all my other 80+ apps. And with multiplayer, the awesomeness of this only multiplies...    imagine doing insane creations with your friends.  This is just incredible.", "timestamp_created": 1472175894, "timestamp_updated": 1472175894, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.578947", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25103255": {"recommendationid": "25103255", "author": {"steamid": "76561197960783544", "num_games_owned": 147, "num_reviews": 6, "playtime_forever": 15546, "playtime_last_two_weeks": 0, "last_played": 1511789253}, "language": "english", "review": "Great game for expressing creativity, and the ability to scale yourself down to smaller than an ant is amazing.  House within a house within a house.  Multiplayer is great and definitely needs more people!", "timestamp_created": 1471999782, "timestamp_updated": 1471999782, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25028257": {"recommendationid": "25028257", "author": {"steamid": "76561198002882333", "num_games_owned": 93, "num_reviews": 3, "playtime_forever": 455, "playtime_last_two_weeks": 0, "last_played": 1478349998}, "language": "english", "review": "Only Played for few minutes and this is awesome. It reminds me of TiltBrush but with blocks. I really want to try some Multiplayer. Judging from so few reviews i dont think may people are on. I guess it still early days. Excited for the new tools coming and copy / paste will be neat. I notice the grip buttons dont seem to be used yet.\nI did notice some rendering issues, blue / pink over lays with different sampling modes, shadows However they go away depending on setting.", "timestamp_created": 1471682011, "timestamp_updated": 1471682011, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24482157": {"recommendationid": "24482157", "author": {"steamid": "76561198046336375", "num_games_owned": 64, "num_reviews": 1, "playtime_forever": 18166, "playtime_last_two_weeks": 0, "last_played": 1494553183}, "language": "english", "review": "This is a pretty great world-making program. Tilt-brush's painting style mostly only works to draw 2d stuff in a 3d world, while this one is definitely 3d-driven. It still has several features that I would like to have (more than 16 colors is a huge one for me right now), but it is definitely really nice already. Would definitely recommend.", "timestamp_created": 1469290990, "timestamp_updated": 1469290990, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24241506": {"recommendationid": "24241506", "author": {"steamid": "76561198025196868", "num_games_owned": 137, "num_reviews": 14, "playtime_forever": 547, "playtime_last_two_weeks": 0, "last_played": 1479590794}, "language": "english", "review": "Excellent and relaxing fun making goofy pixelated worlds with friends. Grow into a giant to sculpt the big picture, shrink down to work on the fine details, then become a giant again to admire your work.\n\nMultiplayer is a bit confusing to get started, but worth persisting with.", "timestamp_created": 1468189092, "timestamp_updated": 1468189092, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.527559", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24211570": {"recommendationid": "24211570", "author": {"steamid": "76561198140797744", "num_games_owned": 591, "num_reviews": 7, "playtime_forever": 62, "playtime_last_two_weeks": 0, "last_played": 1473464960}, "language": "english", "review": "I would highly recommend this as a VR experience for anyone with some spare change lying around. The price is a bit steep for how basic it is (that seems to plague 90% of VR games) but the feeling of becoming a giant, making a structure, going down to normal scale, and walking on the thing you just made is amazing. This game gives you such an excellent sense of scale.\n\n\nIf you've got money and are looking for fun VR experiences, go for this.\n\nIf you're on a tight budget and looking for the most bang for your buck, I would hold out until a sale, especially since you probably already own Tilt Brush.", "timestamp_created": 1468083729, "timestamp_updated": 1505897995, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23716150": {"recommendationid": "23716150", "author": {"steamid": "76561198071986064", "num_games_owned": 102, "num_reviews": 8, "playtime_forever": 1296, "playtime_last_two_weeks": 0, "last_played": 1502787329}, "language": "english", "review": "Totally fantastic experience. Amazing feeling to change scale from minimal to gigantic and back at will. Super cool to make 3D environments in seconds and walk around it. Frequently updated. Not related to developer. :)", "timestamp_created": 1466638103, "timestamp_updated": 1466638103, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.557522", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23480210": {"recommendationid": "23480210", "author": {"steamid": "76561198304997871", "num_games_owned": 12, "num_reviews": 1, "playtime_forever": 489, "playtime_last_two_weeks": 0, "last_played": 1493081550}, "language": "english", "review": "So far this has the best combination of Modbox and Google Tilt design software I've used. As an artist, architect and UX designer, this one has the best blend of pure art design and standard architectural blocks akin to building in a VR LegoWorld. While the tools are extremely simple at the moment, the author's logic structure is the best so far I've seen, making it super fast to create whatever project I'm working on. I'm guessing with time this tool is only going to get better, but for the first iteration, if you're looking for something like a fast 3D conceptual tool, this is the one. Enjoy.", "timestamp_created": 1465541429, "timestamp_updated": 1465541429, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23279949": {"recommendationid": "23279949", "author": {"steamid": "76561197994598627", "num_games_owned": 309, "num_reviews": 2, "playtime_forever": 1010, "playtime_last_two_weeks": 0, "last_played": 1477256465}, "language": "english", "review": "Incredible Experience!\n\nComparing this to Tilt Brush is apples to oranges. It has a completely different feel.\n\nAs others have already pointed out, there are a number of things that could be improved.\n\n-more variation in color palette\n-undo/redo\n-ability to clone a segment and replicate it anywhere\n-ability to position avatar anywhere in space ( a temporary ramp could be created underneath to make it feel less strange)\n-a way to smooth an edge\n-additional brushes (or create custom brushes)\n-I could go on (this only speaks to the fact that this is so good)\n\nHonestly though, this is already amazing as it is. It is amongst the top VR experiences at the moment.", "timestamp_created": 1464553928, "timestamp_updated": 1464553928, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.561404", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23263168": {"recommendationid": "23263168", "author": {"steamid": "76561198018692251", "num_games_owned": 269, "num_reviews": 19, "playtime_forever": 5, "playtime_last_two_weeks": 0, "last_played": 1464437293}, "language": "english", "review": "Wouldn't be fair to judge this too much but palette needs expanding, there needs to be more tools and we need different background scenes.\n\nI wouldn't buy if I were you, yet.\n\nI would definitely buy in the future, though - as some of the things they have done suggest to me that they are well on the way to a killer VR creativity application.", "timestamp_created": 1464481800, "timestamp_updated": 1464481800, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.519231", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23247257": {"recommendationid": "23247257", "author": {"steamid": "76561197980046807", "num_games_owned": 147, "num_reviews": 1, "playtime_forever": 3362, "playtime_last_two_weeks": 0, "last_played": 1509601908}, "language": "english", "review": "I really enjoy building in this fun art creator. Being able to export to an OBJ file is pretty slick, too. \nMake sure you turn the brush to High quality mode so you can sculpt with tiny blocks to get in there for detail work.\n\nIt's well worth the money and they're adding features and enhancements quite often, which makes for an even better experience.", "timestamp_created": 1464417022, "timestamp_updated": 1464417022, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23134387": {"recommendationid": "23134387", "author": {"steamid": "76561198293637810", "num_games_owned": 31, "num_reviews": 5, "playtime_forever": 799, "playtime_last_two_weeks": 0, "last_played": 1511696825}, "language": "french", "review": "Great Tool, thank you so much. The scale capability is amazing. Any chance to have copy/paste tool ? And perhaps more colors?", "timestamp_created": 1463911511, "timestamp_updated": 1463911511, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22919653": {"recommendationid": "22919653", "author": {"steamid": "76561197972337358", "num_games_owned": 100, "num_reviews": 3, "playtime_forever": 147, "playtime_last_two_weeks": 0, "last_played": 1507322703}, "language": "english", "review": "Sitting here watching my wife try SculptrVR for her fourth VR experience with the Vive, and I quote: \"this is better than Tiltbrush, it makes more sense to create 3d shapes in 3d. I'm surprised I'm willing to be in here so long\" as she proceeds to shape a complete giraffe and then rocket out his spots.", "timestamp_created": 1463013142, "timestamp_updated": 1463013142, "voted_up": true, "votes_up": 1, "votes_funny": 2, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22781798": {"recommendationid": "22781798", "author": {"steamid": "76561198128804359", "num_games_owned": 88, "num_reviews": 2, "playtime_forever": 60, "playtime_last_two_weeks": 0, "last_played": 1464446385}, "language": "english", "review": "I like the game so far. Being able to build at multiple sizes and scale yourself is amazing.\n\n A few suggestions to improve it:\n- Expanded color palette \n- Undo / redo shortcuts (tiltbrush does this with a left click on the trackpad\n- Visual indicator of scale (sometimes it's hard to know what size I was at when making something)\n- Block snap, at certain block size / scale combos the snapping is more of a hinderance than a help when it doesn't line up.\n\nLooking forward to seeing future improvements", "timestamp_created": 1462299146, "timestamp_updated": 1462299146, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22657283": {"recommendationid": "22657283", "author": {"steamid": "76561198088299364", "num_games_owned": 143, "num_reviews": 32, "playtime_forever": 1297, "playtime_last_two_weeks": 0, "last_played": 1488079830}, "language": "english", "review": "SculptrVR is amazing.  It really let's you just spit out whatever you can think of.  I've been using it for fun and also to brainstorm new ideas for VR with 3d sketches of ideas.\n\nI recommend this program to anyone with a Vive and any artistic inclination at all\n\nThis application has gotten so much better and the developer has poured so much love and detail into it.  The recent tool updates really open it up for more serious use cases, and there is NOTHING THAT COMES CLOSE TO LETTING YOU DO WHAT THIS APP DOES.\n\nHere is a creation I uploaded to Sketchfab (obj exporting made it easy!)\nhttps://sketchfab.com/models/e0720ea7d4cc4cb887b8f1843ae9a6e4\n\nHere is some gameplay\nhttps://www.youtube.com/watch?v=KbI1UKXGaT8&feature=youtu.be", "timestamp_created": 1461733150, "timestamp_updated": 1472179111, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22605353": {"recommendationid": "22605353", "author": {"steamid": "76561197970799774", "num_games_owned": 199, "num_reviews": 3, "playtime_forever": 227, "playtime_last_two_weeks": 0, "last_played": 1462133159}, "language": "english", "review": "Amazing concept. Anyone who enjoys Minecraft creative or Tilt Brush needs to get this!", "timestamp_created": 1461487912, "timestamp_updated": 1461783284, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22584952": {"recommendationid": "22584952", "author": {"steamid": "76561198013641140", "num_games_owned": 125, "num_reviews": 13, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1463575564}, "language": "english", "review": "Very interresting concept, had a lot of fun exploring and creating. Hope obj export is coming!?", "timestamp_created": 1461408206, "timestamp_updated": 1461408206, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22580091": {"recommendationid": "22580091", "author": {"steamid": "76561197976557676", "num_games_owned": 234, "num_reviews": 2, "playtime_forever": 246, "playtime_last_two_weeks": 0, "last_played": 1493194024}, "language": "english", "review": "This is a lot of fun to play around with. It's really easy to build things, and it's a lot of fun to see your drawings at different scales. Like, for example, you can sit on the ground and draw the frame of a cube at a tiny scale, then change the scale so it looks bigger than a house, and you're sitting on top of it. With this, you can create an environment very quickly by doing it on a small scale, and then see it around you at full size.\n\nDefinitely worth giving a try!", "timestamp_created": 1461385118, "timestamp_updated": 1461385118, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22413016": {"recommendationid": "22413016", "author": {"steamid": "76561198296729924", "num_games_owned": 270, "num_reviews": 2, "playtime_forever": 4577, "playtime_last_two_weeks": 0, "last_played": 1503521534}, "language": "english", "review": "SculptrVR is uniquely great. It is a much more powerful experience than Tilt Brush which seems comparable at first glance. \n\nIn SculptrVR you get a sense of volume in the space right away with even the default ball of voxels. The ability to scale and teleport gives you the ability to change your perspective in a big way. \n\nThe most telling thing is that my daughter made an entire island in SculptrVR as the first thing she ever did in the Vive. She made a hut with a bed, a pool, a boat and waves. Then she'd walk around in them and acted as if they were completely real. \n\nIn Tilt Brush she made flat drawings vertically in space and labeled them with names. That was despite having seen people use Tilt Brush on youtube and being very excited about building a house. \n\nTilt Brush just isn't quite set up for her to be immersed in the environment like she wants (and SculptrVR is). I had to lift her up to let her finish the head and hair on one person. She did draw herself a portal and stepped through it when it was time to quit though, so that was cool.", "timestamp_created": 1460652886, "timestamp_updated": 1460747803, "voted_up": true, "votes_up": 16, "votes_funny": 5, "weighted_vote_score": "0.677509", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22394193": {"recommendationid": "22394193", "author": {"steamid": "76561198054892652", "num_games_owned": 136, "num_reviews": 12, "playtime_forever": 97, "playtime_last_two_weeks": 0, "last_played": 1461147512}, "language": "english", "review": "Very easy to use, lots of fun! Congrats to the dev for this experience!", "timestamp_created": 1460554616, "timestamp_updated": 1460554616, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22367736": {"recommendationid": "22367736", "author": {"steamid": "76561198020764073", "num_games_owned": 39, "num_reviews": 2, "playtime_forever": 5856, "playtime_last_two_weeks": 81, "last_played": 1513724425}, "language": "english", "review": "As far as I can tell, SculptrVR is the first of its kind in that people can use it to build at vastly differing scales. I've dreamed of an app like this for a while now, so it's not surprising that it kept me busy for several hours. However, in case the developer is open for suggestions, there are a couple of things that can be addressed:\n\nThere aren't very many options for tools; just sphere, cube, rocket, spraycan, and this one projectile-orb thing that I can't get to work (plus their eraser equivalents). I could think of a few tool ideas right off the bat that would certainly make building things faster (straight-line box fill, rectangular-prismic box fill, resolution of boxes in drawing spheres, cut/copy/paste, recolor, sunlight direction, bezier curve box fill, etc).\n\nAlso, there are only 16 possible colors for boxes, all of which appear to have the same color scheme as wool blocks in Minecraft. This is really one of my lesser complaints; I can understand if 16 colors is for memory-saving purposes, because I can tell the program was made with space-saving in mind. (I'm going to take a wild guess and say that every heterogeneous block is defined by eight smaller blocks, some of which might recursively consist of eight even-smaller blocks and so on.) Despite this, a color palette that allows users to decide which 16 colors are used would be nice.\n\nBecause this program is so new, I'll excuse these minor issues and say that I recommend this game, because let's be honest: creating worlds of vastly differing scales is an awesome and undervisited idea. I see so much potential as to what SculptrVR could become; in particular, I'm excited to see what you mean when you say \"Game inside the scupted worlds\" on the list of things that are coming soon.\n\nEdit: I'm not very good at actually writing reviews, so my bad if this was a little unfair-sounding.", "timestamp_created": 1460429529, "timestamp_updated": 1460511948, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.644013", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22324532": {"recommendationid": "22324532", "author": {"steamid": "76561198025003435", "num_games_owned": 163, "num_reviews": 43, "playtime_forever": 27, "playtime_last_two_weeks": 0, "last_played": 1487116124}, "language": "english", "review": "Very cool sandbox voxel painting app. You can kind of build you own minecraft style voxel worlds and then the coolest part is to scale yourself down and teleport around the world you build. It would be great to be able to then use these worlds in a game of some sort, so I can definitely see that coming one day either to ScultVR or another game like this. I would say that the price is way too high for the current state of the app, so maybe wait until a bigger sale to pick this up one unless you really love creating voxel art or environments.", "timestamp_created": 1460227521, "timestamp_updated": 1460227521, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22302965": {"recommendationid": "22302965", "author": {"steamid": "76561197967014351", "num_games_owned": 347, "num_reviews": 25, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1457087320}, "language": "english", "review": "Easy and intuitive to use sculture app which you can make some surprisingly complex art with", "timestamp_created": 1460133413, "timestamp_updated": 1460133413, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22276525": {"recommendationid": "22276525", "author": {"steamid": "76561197970373344", "num_games_owned": 107, "num_reviews": 3, "playtime_forever": 104, "playtime_last_two_weeks": 0, "last_played": 1465864943}, "language": "english", "review": "You love pixel art ? I'm sure you do. You love 3D ? VR ? Minecraft ? Build giant and small scale stuff, full of details ? \n\nIt's all that and more. You can scale yourself as a giant to build mountains within minutes. Then scale down to carve tunnels and mines in it with missiles. And finally scale down some more to decorate your own personnal Moria with fine sculptures, so small that only you know they're there.\n\nAlso, multiplayer is coming. it's a no-brainer.", "timestamp_created": 1459982971, "timestamp_updated": 1459982971, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.550562", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22263029": {"recommendationid": "22263029", "author": {"steamid": "76561198062349354", "num_games_owned": 57, "num_reviews": 3, "playtime_forever": 3086, "playtime_last_two_weeks": 0, "last_played": 1501375601}, "language": "english", "review": "As an artist, I find this really really fun to play with, to be able to really easily create a world I can then have someone explore in VR.. amazing fun.\n", "timestamp_created": 1459912816, "timestamp_updated": 1459912816, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.609195", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22244982": {"recommendationid": "22244982", "author": {"steamid": "76561198027323077", "num_games_owned": 583, "num_reviews": 7, "playtime_forever": 802, "playtime_last_two_weeks": 0, "last_played": 1510423910}, "language": "english", "review": "One of the must have for HTC Vive!\nThis is one of the coolest apps/games I have played in VR. You can build worlds, you can walk on it, build in multiplayer, and destroy everything with rockets! GO GET IT NOW!", "timestamp_created": 1459815736, "timestamp_updated": 1459815736, "voted_up": true, "votes_up": 7, "votes_funny": 2, "weighted_vote_score": "0.518696", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22242296": {"recommendationid": "22242296", "author": {"steamid": "76561198208255387", "num_games_owned": 21, "num_reviews": 1, "playtime_forever": 8695, "playtime_last_two_weeks": 0, "last_played": 1504235515}, "language": "english", "review": "The ability to scale in and out to play with everything in a macro and micro level is awesome! Just like the videos show, you can create rooms, trees, mountains, and everything your mind can conceptualize and then zoom in and out to add unreal levels of detail. The demo videos showing a tree-within-a-tree-within-a-tree isn't exaggerating slightly: it really has about 6-7 levels of \"trees\" in their demo scene.\n\nThe most fun I had with this was in multiplayer. Fire up a team Skype call with your buddies (or coworkers or mortal enemies, or what have you), launch multiplayer, and build a project together. You can often find random people hosting their own public Multiplayer world, and go check out what they, and other visitors, have created together.\n\nWe used multiplayer SculptrVR at work FOR work, actually. Everyone was \"drawing\" all over every surface like they were 3D whiteboards. I watched my teammates as they drew Godzilla-sized in the air over my head, while I marched around the front of my sculpture like an ant, adding detail to my schematics. We could see, in real-time, every stroke of everyone around us, and designing levels where you actually DRAW the levels together was a blast. When we were done, everyone saved a copy of the world to their offline folders, so we could review them later at our leisure.\n\nWhere a picture paints a thousand words, this tool explodes that by an order of several magnitudes. The concept was simple, but incredibly well-executed. Updates have been frequent, with features like a color picker that expands the types of materials and colors from 16 predefined \"flat\" textures to a palette of \"any\" color with some reflective and emissive textures thrown in. A \"standing platform\" was added to help those of us with height/falling issues be able to not get queazy when standing in the air (or on the edge of something). Adding support for multiple VR systems (Oculus Rift, I'm looking at you) even makes it so MORE people can pick up this (game? tool? app?) and collaborate in multiplayer.", "timestamp_created": 1459801638, "timestamp_updated": 1472068492, "voted_up": true, "votes_up": 31, "votes_funny": 3, "weighted_vote_score": "0.764119", "comment_count": "5", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}}}
