{"reviews": {"39489470": {"recommendationid": "39489470", "author": {"steamid": "76561198051078858", "num_games_owned": 301, "num_reviews": 8, "playtime_forever": 3911, "playtime_last_two_weeks": 1147, "last_played": 1516546933}, "language": "english", "review": "Yono is a game about a baby space elephant that just wants to make the world a better place.\n\nWhile that should be enough reason for most people to buy it, some more thoughts might be in order. The game has a high puzzle element to it, while also offering town areas to explore and discover bits and pieces about the lore. Each of the groups within the game (humans, elephants, zombies, robots, etc.) are common tropes of games (well, besides elephants) but they've put their own twists onto the backstories and reasonings behind each that makes it unique and interesting to investigate.\n\nBut even if exploration isn't something you find exciting, the main story and puzzling elements are still very strong. A few of the rooms feel like there's an overwhelmingly large amount of options of things to interact with, but it has a good mix of small, medium, and large puzzle rooms. The combat is pretty basic, but it isn't particularly the focus and doesn't need to be intricate.\n\nThe few things I would say negatively would be that some of the sound effects are fairly low-quality, which probably is only more noticable because the music is so much better in contrast. You're restricted to a single save which can be bad if you have multiple people playing or want to do so for other reasons. Unless you wanted to go back and collect all the health token or explore buildings you might have ignored, I wouldn't say the game has a ton of replayability, but length-wise compared to the price, I would say it's a fair bargain.\n\nMost people won't have an interest in this, but speedrun-wise it's a lovely lovely game with a ton of cool strats and not too hefty of a learning curve at all. Definitely a good way to artificially extend the life of this game is you enjoy it and still want to play it more but have done basically everything.\n\nI think after watching a minute or two of gameplay, your gut reaction will be a fairly honest indicator of if this game will suit you properly. I'm awful with puzzles but still enjoyed the experience.", "timestamp_created": 1516471070, "timestamp_updated": 1516471070, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39066464": {"recommendationid": "39066464", "author": {"steamid": "76561198092526732", "num_games_owned": 187, "num_reviews": 1, "playtime_forever": 11, "playtime_last_two_weeks": 0, "last_played": 1515108099}, "language": "english", "review": "Is everyone high in this game because all the reviews are positive (including mine)\n\nI feel like I'm on LSD:\n\nRando elephant falls from space, with the purpose of helping people so impoverished that they do not know what an elephant is, and I could abuse a chicken with the headbutt ability.\n\n\n\ni still liked it and i will finish it", "timestamp_created": 1515108634, "timestamp_updated": 1515108634, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38820417": {"recommendationid": "38820417", "author": {"steamid": "76561198014719953", "num_games_owned": 486, "num_reviews": 9, "playtime_forever": 152, "playtime_last_two_weeks": 0, "last_played": 1514044425}, "language": "english", "review": "An adorable and funny zelda-alike. The occasional rough edge betrays the fact that this game was actually made by one guy - Niklas Hallin. However there is more than enough charm here to make this an underrated gem well worth your time.", "timestamp_created": 1514557564, "timestamp_updated": 1514557564, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38046245": {"recommendationid": "38046245", "author": {"steamid": "76561198113155570", "num_games_owned": 63, "num_reviews": 5, "playtime_forever": 5406, "playtime_last_two_weeks": 79, "last_played": 1516072462}, "language": "english", "review": "i am probably the only person in the world with over 10 hours in this game uhh buy it lol", "timestamp_created": 1512345828, "timestamp_updated": 1512345828, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37562505": {"recommendationid": "37562505", "author": {"steamid": "76561198113727289", "num_games_owned": 50, "num_reviews": 2, "playtime_forever": 232, "playtime_last_two_weeks": 0, "last_played": 1512139476}, "language": "english", "review": "...You too can put a chicken on your head and solve puzzles!", "timestamp_created": 1511633003, "timestamp_updated": 1511633003, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36755733": {"recommendationid": "36755733", "author": {"steamid": "76561197974018130", "num_games_owned": 186, "num_reviews": 7, "playtime_forever": 399, "playtime_last_two_weeks": 0, "last_played": 1510517924}, "language": "english", "review": "Yono!", "timestamp_created": 1511379053, "timestamp_updated": 1511379053, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.432126", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36288280": {"recommendationid": "36288280", "author": {"steamid": "76561198169299825", "num_games_owned": 8075, "num_reviews": 59, "playtime_forever": 621, "playtime_last_two_weeks": 0, "last_played": 1508585640}, "language": "schinese", "review": "[h1]童话书中的“象尔达”\n\n——简评《Yono and the Celestial Elephants》[/h1]\n\n此游戏的key自奶牛关社区的野蔷薇计划获得，感谢开发者与相关社区工作人员的努力。\n\n\n\n太长不看的简评：\n\n+ 可爱的童话风格\n\n+ 简单又不显单调的塞尔达式交互解谜\n\n+ 完整的故事背景与世界观 \n\n- 画面视角固定，操作不够人性化\n\n- 战斗系统略显鸡肋\n\n- 支线任务单调无趣\n\n- 偶尔出现的穿模bug\n\n总评：6.2/10，对任系老玩家来说，这个“象尔达”很好地模仿了塞尔达，但不够精致。不过等我有了孩子，我会允许他玩这个游戏。\n\n之前在NS上看到了这个游戏，有朋友称之为“象尔达”，便有了尝试的兴趣，实际上手之后，果不其然，《Yono》同之前发售的《神巫女》一样，都是核心玩法完全模仿塞尔达的“大胆”游戏。\n\n为什么说他们大胆？因为塞尔达系列的谜题与关卡设计不是那么好模仿的，一个环节弄不好，便会画虎不成反类犬，被眼光刁钻的玩家们批评抵制。\n\n《神巫女》选择了缩短流程、减少谜题设计量的方式来避免这一问题，而《Yono》在此之上更进一步，用童话风格的美术掩盖其他部分的不足，从实际的游戏体验来看，他们做的还不错 。\n\n（题外话，这要是国人开发的游戏，大概会被这样喷：“核心玩法抄袭塞尔达，真不要脸”、“画面一股手游味，看着腻歪”、“谜题这么简单，糊弄小孩的吧”、“操作困难，国产页游的键位设置”）\n\n大部分对这个游戏感兴趣的玩家，都是被《Yono》可爱的画面风格所吸引，玩《Yono》就像看完了一本单薄却有趣的童话书，合上书本，心中却仍想着那只小象的冒险经历。\n\n在游戏中，玩家操纵的小象从天而降，有些笨拙地甩动着鼻子，穿行在简单而精致的城市与山野之间，与人类、机器人、亡灵三大种族交流，顺着剧情的发展，收集金币，解锁皮肤与历史记录，深入地牢，解开一个个谜题，最终成为守护世界的神象。\n\n在解谜方面，《Yono》将重心放在与小象与地图上不同元素的交互上，从一开始的吹风车、撞柱子、砸罐子，到后面的谜题中出现的吸水喷水，吃辣椒吐火、吃花生打炮（不），与各个迷宫中多样的机关布置相合，给玩家带来了一系列小有难度又不显单调的谜题，平滑的难度曲线与恰当的教学指引也让玩家有着足够的动力与兴趣推动剧情，与其他的模仿者相比，《Yono》在这方面对塞尔达的模仿与还原是相对成功的。\n\n《Yono》中，没有故弄玄虚的碎片化叙事，没有烧脑难懂的倒叙式场景，只要氪金就能变...就能解锁背景故事，结合与NPC的交流，三个种族间的复杂关系、世界的历史与危机，都明明白白地展现在玩家面前，线性的剧情虽然无法满足玩家的探索欲，但也保证了剧情的连贯明确，对于小制作独立游戏来说，可以说是不错的选择。\n\n不过，开发者可能是将大部分精力投入到谜题设计中，没精力顾及其他，这就导致游戏的战斗部分与支线剧情方面做得非常敷衍。单调的敌人、毫无难度的Boss站让人觉得游戏的战斗系统可能是充话费送的，大量毫无深度的跑腿支线让玩家看出开发者在任务设计方面经验的欠缺，这也导致本该是游戏重点的收集物系统颇为儿戏，大大降低了游戏体验。塞尔达系列的游戏，会让玩家“永远不会感觉无聊”，《Yono》在谜题部分达到了这个标准，但在战斗与支线方面，却还相去甚远。\n\n另外，操纵视角的问题与偶尔出现的穿模也让玩家产生了一些小小的困扰，但这些都是可以更新解决的问题，希望开发者能在未来的更新中进一步完善游戏，给玩家带来更好的体验。\n\n整体而言，《Yono》——“象尔达”是一部在美术与解谜方面表现不错，但在其他方面仍有欠缺的Zelda-Like游戏，有趣，但还不够有趣，适合享受轻松氛围的玩家与儿童。", "timestamp_created": 1509856698, "timestamp_updated": 1511416958, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.631218", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36003642": {"recommendationid": "36003642", "author": {"steamid": "76561198024940868", "num_games_owned": 294, "num_reviews": 3, "playtime_forever": 5, "playtime_last_two_weeks": 0, "last_played": 1510111280}, "language": "english", "review": "(I finished this game on the Switch, but bought the PC version to support the dev because I liked it -- so, low play time here)\n\nWhat a neat game! For its genre, I think it was just about perfect -- well-done and snappy in the main story and side quests, with a little bit of challenge in places but not so much that a kid couldn't manage, and with very few draggy parts. It took me about 4 hours to fully complete. It doesn't hurt that the art and sound design (so many trumpetings) are ridiculously cute, too. Just a really all-around nice game.\n\nMinor issues:\n- I had a couple bugs relating to item placement -- odd clipping and so on. Nothing too bad.\n- The PC version appears to have somewhat limited resolution options, and tops out at 1080P on my 1440P monitor.", "timestamp_created": 1508991942, "timestamp_updated": 1508992104, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.526627", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35930373": {"recommendationid": "35930373", "author": {"steamid": "76561197992123547", "num_games_owned": 917, "num_reviews": 62, "playtime_forever": 319, "playtime_last_two_weeks": 0, "last_played": 1508625544}, "language": "english", "review": "Hello everybody, End World Gaming here to share an excerpt from my review for Yono and the Celestial Elephants by Neckbolt and Plug In Digital.\n\nYono is an indie action adventure game that puts you in the role of a young elephant god named Yono. Yono is new to the world and he was sent from the heavens for a purpose he isn’t quite sure of. To find answers, he sets out on a journey across the world to visit the races of the world and to help solve their problems.\n\nThere are 3 major races in Yono’s world, the Humans, Zombies and Robots. During his travels he meets many unique and often charming characters. Two of which join him in his journey across the world. The world also has a couple enemies that you’ll encounter as well including snakes, skeletons and goblins. There are also a few boss fights along the way as well.\n\nThe game’s main focus is on it’s many different puzzles that you solve across the world. The puzzles are largely logic based and often revolve around pushing blocks around and activating switches. They also incorporate Yono’s special abilities such as spitting water, air, peanuts, or fire out of his trunk.\n\nThere is also a bit of combat along the way but I’ll admit that it’s a bit basic since Yono is an elephant that can’t wield swords or weapons. So he simply slams into them with his face.\n\nThere are 2 stores which you can visit in major towns as well. The first allows you to turn in heart containers which grant you an extra heart on your health bar. You need to collect 4 of them before you can turn them in. The second is a tailor which allows you to change how Yono looks. There are a lot of choices and they change based on which town you’re in as well. There’s even a nod to The Legend of Zelda in one of the fashions as well.\n\nIn towns there are also some NPC’s that will have side quests for you to complete for them. The quests all take place in their town of origin and if you don’t complete them before leaving, you can always return later.\n\nOverall, Yono and the Celestial Elephants is quite the cute little game. Yono is an interesting, if naive elephant and his journey is an entertaining one. It’s on the easy end of the difficulty threshold but this makes it a great game for older children to get into. It’s pretty entertaining for adults as well but I wouldn’t go in expecting something overly challenging. The game is also pretty short and can be beaten in 3-5 hours total.\n\nIf you'd like to see my final score for the game, you can find my full review here: http://www.endworldgaming.com/action-adventure/yono-and-the-celestial-elephants-review\n\nHappy gaming folks!\n", "timestamp_created": 1508702643, "timestamp_updated": 1508702643, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.399946", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "35904693": {"recommendationid": "35904693", "author": {"steamid": "76561198202098269", "num_games_owned": 289, "num_reviews": 23, "playtime_forever": 139, "playtime_last_two_weeks": 0, "last_played": 1508381395}, "language": "schinese", "review": "首先感谢开发者和奶牛关野蔷薇的key， 让我试玩到这么萌的作品。\n\n原配图评测地址：https://cowlevel.net/game/Yono_and_the_Celestial_Elephants/review/2779589\n\n先上结论，这款作品对软妹子或者小朋友来说，算的上是五星作品，但对于热衷包含激烈的战斗、劲爆的剧情等等元素的RPG玩家来说，可能最多就四星或三星半吧。\n\n简介\n\n背景简要概述一下，游戏讲述的是第七只神象降临世间帮助人们解决困难重归美好生活的故事。这期间小象Yono从啥也不懂的小屁象满满成长为一代大象。。。\n\n游戏主要操作是撞击、交互和吸气。通过这三种操作的组合来进行解谜及战斗，战斗完全没有难度，解谜稍微动一下脑子即可。\n\n其次游戏还有三种物品，血量token、钱、字母，分别用于提升最大血量、购买皮肤和解锁新的故事篇章以供了解历史。\n\n整体来说游戏玩起来非常的简单，但是整个游戏看似简单内柔却依然很丰富。无论是世界观的设定、地牢的设定还是各种支线小任务、剧情的跌宕起伏都体现了该作是一款非常完整的作品，即使开发者只有一个人（膜拜）。\n\n缺点\n\n那么为什么我说这部作品只适合软妹子和小盆友呢？其实主要是以下几点让我个人觉得不太能玩下去：\n\n- 节奏慢。主角的移动速度很慢，而且对话往往很长，且由于我之前说的内容比较丰富，可能往往会花不少时间在一些很普通的解谜环节上。\n\n- 剧情简单。 剧情确实有跌宕起伏，但是还是过于简单，感觉整体人设都有些低龄化，不过由于刻画了一个童话世界，所以这也是很正常滴。\n\n- 整体气氛平淡。 其实这一点也包含了前面两点，也就是玩这个游戏的时候会感觉内心毫无波动，我在哪我是谁我从开头已经猜到结局了我为什么要解这些没有难度的puzzle，为什么要打这些没有威胁的怪。。。\n\n以上这些仅仅是个人观点，我是只科研申请狗，所以平常玩的时间不多，希望能从游戏中获得一些快感或者是刺激或者是放松等等，这部作品可能对我来说太放松了点以致于玩久了会有点点无聊。\n\n优点\n\n毋庸置疑本作也是有很多优点的，否则我也不会给出四星的评分。\n\n+ 完整。这部作品无论从世界观还是游戏玩法还是内容，都称得上完整，steam上一个人评价 ‘The most wholesome game’。所以如果你对这类题材感兴趣，这部作品无疑不会让你失望。\n\n+ 童话世界。 从开始界面起，就仿佛进入了一个童话世界，这个世界几乎没有硝烟和战火，只有满屏的大写的萌。游戏把这个童话世界做的非常好，从视觉到听觉都很赏心悦目，点个赞。\n\n+ 友好。正因为简单，这部作品无疑是非常友好的，你不会die很多次，类似那些souls-like的游戏。所以这也是为什么适合手残党或者小朋友的原因之一（我小学一年级的时候死活通不了仙剑1。。。。长大才发现有些游戏的难度根本不适合小孩）\n\n总结\n\n正如我开头所讲，我可能会送这款游戏给我儿子如果我有的话，或者女票， 但是不会推荐给整天吃鸡的好友。。。不过令人在意的是这款游戏目前只有英文，且很多词汇小孩也看不懂。。。所以我会推荐这款游戏给我外国的有小孩的朋友，但是目前也并没有。。。不过如果作者需要汉化帮助的话，我会很愿意参与~", "timestamp_created": 1508626371, "timestamp_updated": 1508626371, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.499775", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "35904171": {"recommendationid": "35904171", "author": {"steamid": "76561198042614616", "num_games_owned": 1271, "num_reviews": 35, "playtime_forever": 32, "playtime_last_two_weeks": 0, "last_played": 1508624454}, "language": "english", "review": "The adventure of the worlds most polite and well spoken elephant. In short this is basically a Zelda-lite adventure game, plays like an NES classic but with a N64ish aesthetic and style. Great fun for adventure game fans and younger gamers. Gameplay is simplistic so far but also has tight controls, a decent soundtrack and charming characters.", "timestamp_created": 1508624600, "timestamp_updated": 1508624600, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35897310": {"recommendationid": "35897310", "author": {"steamid": "76561197993394564", "num_games_owned": 712, "num_reviews": 11, "playtime_forever": 263, "playtime_last_two_weeks": 0, "last_played": 1508605513}, "language": "english", "review": "A nice little puzzle game, that feels as if it's intended for younger players.  The music and graphics are well made, resulting in a rather cute world to play in.  It's always quite clear what the next step is and, if you forget, there are robot announcers that can remind you.  The puzzles are fairly simple and won't take experienced players too much time to work through.  Combat is simple too, mostly involving headbutting the bad guys until they die or faint.  \n\nSo a game I'd recommend, with the rider that it probably won't take too long to play through if you're not new to puzzle games (or, y'know, young).\n\nPlus the doggie is adorable.", "timestamp_created": 1508606122, "timestamp_updated": 1508606122, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35832725": {"recommendationid": "35832725", "author": {"steamid": "76561198383753898", "num_games_owned": 2, "num_reviews": 5, "playtime_forever": 9, "playtime_last_two_weeks": 0, "last_played": 1508388190}, "language": "schinese", "review": "游戏很可爱，音乐也很棒，就是操作不太方便，转动的角度有点 别扭", "timestamp_created": 1508389494, "timestamp_updated": 1508389494, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35829445": {"recommendationid": "35829445", "author": {"steamid": "76561198011765628", "num_games_owned": 506, "num_reviews": 11, "playtime_forever": 158, "playtime_last_two_weeks": 0, "last_played": 1510518681}, "language": "english", "review": "\"What if Zelda whas an elephant?\"\n\nCould be better if it had a dedicated trumpet button, for no gameplay reason at all.  Other than that, a VERY cute, laid back, not annoying Zelda clone.", "timestamp_created": 1508372636, "timestamp_updated": 1508372636, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.497942", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35814805": {"recommendationid": "35814805", "author": {"steamid": "76561198204564985", "num_games_owned": 58, "num_reviews": 2, "playtime_forever": 74, "playtime_last_two_weeks": 0, "last_played": 1508516105}, "language": "french", "review": "Yono c'est vraiment de la balle et je parle pas d'une balle de pistolet. j'ai pas 3ans mais nsm je vous péta", "timestamp_created": 1508321603, "timestamp_updated": 1508321603, "voted_up": true, "votes_up": 0, "votes_funny": 2, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35805907": {"recommendationid": "35805907", "author": {"steamid": "76561198026506133", "num_games_owned": 1433, "num_reviews": 25, "playtime_forever": 135, "playtime_last_two_weeks": 0, "last_played": 1507988447}, "language": "english", "review": "A lovable, adorable game that takes you on a trip down Zelda Lane.\n\nBit short, but I do not regret the full price purchase!", "timestamp_created": 1508279061, "timestamp_updated": 1508279061, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35789004": {"recommendationid": "35789004", "author": {"steamid": "76561198061592267", "num_games_owned": 188, "num_reviews": 2, "playtime_forever": 842, "playtime_last_two_weeks": 0, "last_played": 1508215405}, "language": "english", "review": "Yono's adorable visual really overshadowed its linearity and fetch quests. Albeit some might say that the game is boring, the same can't be said to my experience playing this game.\n\nThe story seems sporadic at times, but it does have some deep meaning into it while still trying to make it simple enough for kids to understand or serving as a medium to incite curiosity in them. \n\nIf you have children aged 7+, please do let them play this game under parents guidance. The puzzles, the artworks, clean language, everything is fits for the age bracket. It's a very meaningful bonus that it can also served as a part of your child's brain exercise. \n\nThank you for making this game that really put kids on the forefront.", "timestamp_created": 1508225414, "timestamp_updated": 1508225414, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35778932": {"recommendationid": "35778932", "author": {"steamid": "76561198049746634", "num_games_owned": 110, "num_reviews": 12, "playtime_forever": 5, "playtime_last_two_weeks": 0, "last_played": 1508180432}, "language": "english", "review": "I loved this game so much on my Nintendo Switch, I decided to buy it just so I could review it and give it some love.\n\nI'm not a big fan of 'old Legend of Zelda-like' games, as those types of games don't usually do for me, as that genre was huge back in the 80s and 90s, and have aged for someone my age. The thing that made me get this game was you play as a cute baby elephant that \"Wants to spread peace and joy around the Kingdom.\" Cute animals are my only weakness.\n\nI finished it in over 5 hours, so I paid ~$3 an hour, which is a great deal; I would have even paid $20 for this game. The only complaint I had about this game is some of the puzzles (for a kids game) are pretty tough and there was a huge difficulty spike at the end. Luckily, I only needed to use a walkthrough once for the end and even after watching it, that puzzle solution was bu**s***. I'm sort of glad the game was tough sometimes though as I would have finished this game in a day.\n\nAny PC complaints? The only complaint I was is Yono can be tough controlling on a keyboard. I can see why this game is recommended to play with a gamepad. \n\nEven though the ending was frustrated, I absolutely recommend this game for Switch and PC owners. It's a cute little game that seems to have had lots of time and effort put in.", "timestamp_created": 1508180492, "timestamp_updated": 1508180492, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35751540": {"recommendationid": "35751540", "author": {"steamid": "76561198018051990", "num_games_owned": 1181, "num_reviews": 11, "playtime_forever": 351, "playtime_last_two_weeks": 0, "last_played": 1508081564}, "language": "english", "review": "Yono the Celestial Elephant is a great adventure game for kids and adults alike. It has lots of charm and was a pleasure to play through. It took me roughly five hours to complete and I enjoyed every minute of it.\nPros: \n-This game is crazy cute. \n-The soundtrack is catchy and never got annoying.\n-The puzzles were, for the most part, easy to solve and is at the right level for children.\n-The game was a little short but did not outstay its welcome.\n-Simple enough for Young kids to be able to get into\n\nCons:\n-I had a strange issue where the game would randomly minimize. (Could just be an issue with my set up)\n-Yono’s hitbox seemed a little too big. \n-I had a strange stutter every once in a while (Could just be an issue with my set up)\n-The sound clips that would play when people would speak seemed low quality. It sounded like something from the early N64 days. \n\nOver all I loved my time with Yono the Celestial Elephant. I can’t say I would go back and replay it again but it was definitely worth the afternoon it took to complete. Do yourself a favor and pick this one up.", "timestamp_created": 1508083299, "timestamp_updated": 1508083465, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35749661": {"recommendationid": "35749661", "author": {"steamid": "76561198002512132", "num_games_owned": 452, "num_reviews": 12, "playtime_forever": 277, "playtime_last_two_weeks": 0, "last_played": 1508076693}, "language": "english", "review": "There's two major things to judge this game on, gameplay and atmosphere.  Both of them are for babies, but like, mentally advanced babies.\n\nGameplay consists of moving from screen to screen, each screen consisting of a self-contained puzzle of sorts.  Puzzles consist of box-pushing and \"use metaphorical key X in metaphorical lock Y so that you can access literal key A to open literal lock B\".  Puzzles kinda sorta get more complex as the game goes on, but solving them always follows this game general line of thought, and usually there's only one functional action you can take in any given puzzle at any given time, so even if you can't logic it out ahead of time, you can generally stumble your way through it with enough time investment.\n\nTo put it another way, puzzles require the same general type of deductive thinking as puzzles in something like The Talos Principle, except you wouldn't give the Talos Principle to a six-year-old, you would give them Yono so that they're ready to play Talos Principle when they're a little older.\n\nRegarding the game's atmosphere, you can probably tell from the video that everything in the game is adorable, and that generally follows along with the story where nothing particularly dire ever happens.  I mean, threats to world peace or whatever, but not anything more extreme than you would see on a Nickelodeon cartoon.\n\nBut what's weird about this game is that a lot of the characters you talk to will ponder on life philosophy.  Like, you have cartoon skeletons questioning the meaning of a life based on material goods, and you have cartoon robots wondering if life is more or less \"free\" whether you are born with a given purpose or without one.  It's nothing revolutionary or anything, but it goes pretty deep for a game that's clearly written for a younger audience.  So once again, I have to come back around to saying \"It's like The Talos Principle, but for babies.\"\n\nWill adults like it?  Well... Personally, I thought the gameplay was tedious after a while.  There was never any question to what direction the story was going, either, though I was generally wondering what weird thing the next random NPC was going to talk about.  I guess it comes down to how cute you think that elephant is.  It's a REALLY cute elephant.", "timestamp_created": 1508078982, "timestamp_updated": 1508078982, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.588593", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35722765": {"recommendationid": "35722765", "author": {"steamid": "76561198025072099", "num_games_owned": 192, "num_reviews": 43, "playtime_forever": 366, "playtime_last_two_weeks": 0, "last_played": 1507996656}, "language": "english", "review": "The game's charming. Starts off with easy puzzles and then introduces new elements every now and then to gradually increase the difficulty and keep things fresh - late-game puzzles are pretty challenging.\n\nThe only remarks I have are:\n* If running in full-screen mode, the game uses the monitor where the taskbar is rather than the primary one. This is slightly unusual so I've been playing it in windowed mode instead.\n* Trading card settings could use a look - I was able to complete the game with all heart containers and all lore unlocks while still having 2 card drops remaining.\n* The elephant's bounding box might be a tiny bit too big - you can't rotate towards a barrell while standing between two of these - the elephant \"squeezes out\". I think it's for the same reason that lining up between a barrell and a movable block and then head-butting the block sends the elephant into the air. Similarly, you can't walk between a block and away-facing fence - the elephant just doesn't fit in there.\n* Related to above (physics!) it is possible to solve a number of puzzles in an unintended way (e.g. push a vase next to a block and carefully climb on top of it instead of doing what you're meant to), although I've find this mildly entertaining to be honest.", "timestamp_created": 1507998005, "timestamp_updated": 1507998005, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.570552", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35710054": {"recommendationid": "35710054", "author": {"steamid": "76561198003292839", "num_games_owned": 491, "num_reviews": 35, "playtime_forever": 290, "playtime_last_two_weeks": 0, "last_played": 1507962408}, "language": "english", "review": "\"Yono\" is very much on the easy side, which might be boring to some people.\nThat said, it's also very charming and stylish.\nMusic is well done, story and (some) sidequests offer more depth then is readily apparent by looking at the game and, well, Yono is ridiculously cute.\n\nTook me about 3,5 hours to fully complete (max health upgrades, all lore pages filled),\nand I enjoyed it the whole way.\n\nSpecs are kind of a moot point. It will run on a toaster.\nThere are some bugs here and there. I clipped through objects a few times, and even had a boss run off through a wall and disappear, forcing a reload. Serious glitches like that are relatively few and far between though, so it should be mostly fine.", "timestamp_created": 1507963047, "timestamp_updated": 1507963047, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.633235", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35683650": {"recommendationid": "35683650", "author": {"steamid": "76561198039701827", "num_games_owned": 79, "num_reviews": 2, "playtime_forever": 326, "playtime_last_two_weeks": 0, "last_played": 1507867204}, "language": "english", "review": "The most wholesome game ever made. TREAT YO SELF", "timestamp_created": 1507867347, "timestamp_updated": 1507867347, "voted_up": true, "votes_up": 8, "votes_funny": 2, "weighted_vote_score": "0.482249", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35682874": {"recommendationid": "35682874", "author": {"steamid": "76561198300330852", "num_games_owned": 56, "num_reviews": 6, "playtime_forever": 403, "playtime_last_two_weeks": 0, "last_played": 1507989021}, "language": "schinese", "review": "超级可爱的一款冒险解谜休闲游戏！\n这么可爱的小象和让世界更美好的童话剧情。简直不能更赞啦~\n小象从天而降，为了世界的美好与和平开始了冒险旅程\n谜题比较简单，主要通剧情。\n在现在没有角色语音又没有中文的情况下，玩这个游戏还是有点累。英语大佬请随意。\n小象的操作很多，按键有点容易弄混。有些技能使用起来能有很多效果。比如用鼻子可以吹风、吸水、喷水、喷火等等功能。冲刺技能也是攻击技能，可以用作撞击、瞬移、攻击等\n总的来说是一款很休闲的剧情游戏。手残友好向。\n推荐手残休闲玩家购买。解谜烧脑类玩家可以去看看别的了。毕竟关卡简单的不行。。\n对我来说，那些算什么！好看就行了！可爱就行了！\n", "timestamp_created": 1507863571, "timestamp_updated": 1507863571, "voted_up": true, "votes_up": 13, "votes_funny": 1, "weighted_vote_score": "0.701954", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35681712": {"recommendationid": "35681712", "author": {"steamid": "76561197977518060", "num_games_owned": 203, "num_reviews": 2, "playtime_forever": 64, "playtime_last_two_weeks": 0, "last_played": 1508998937}, "language": "english", "review": "IMPORTANT ANNOUNCEMENT:\n\nYONO: The most hype you should have about a game that came out today.\n\nAight, check this out. You've got a kawaii m-fing elephant. His name is Yono. He is the most precious thing you will ever have the privilege of seeing in your life. smol. blu. kute. \n\nThis elephant never forgets.\n\nHis hecking manners.\n\nThis upstanding gentlelephant adventures about towns politely asking fellow townsfolk if they would care for any assistance. Be it cleaning, clearing a basement of ne'er-do-wells, or other odd jobs! But he also dungeon crawls into the depths of crypts and caverns in order to bring life and color to bleak and dim areas in the world. He protec.\n\nNow this brings me to an important point. There is combat.\nThat's right. He attac. But know: THERE ARE CREATURES THAT WANT TO HARM THIS ADORABLE AND PERFECT CREATURE AND IF THEY EVER TOUCH THE AVATAR THAT IS YONO I WILL ENSURE THEY ROT IN EA GAMES' IN-HOUSE QA TESTING LIMBO FOREVER. \n\nAll in all, I am just letting you know that this game is probably the cutest thing I've seen in my life. I cried because of it.\n\nIt was also made by one dude. Some tall thirty-something long haired blonde german dude. He's a hero. PS It's on switch.\n\nProminent Cool Person I Know Review:\n\n\"I JUST WANT HIM TO BE SUCCESSFUL.\" -Liz Finnegan", "timestamp_created": 1507858735, "timestamp_updated": 1507858735, "voted_up": true, "votes_up": 14, "votes_funny": 23, "weighted_vote_score": "0.528364", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35681463": {"recommendationid": "35681463", "author": {"steamid": "76561198046561478", "num_games_owned": 865, "num_reviews": 3, "playtime_forever": 266, "playtime_last_two_weeks": 0, "last_played": 1508026120}, "language": "english", "review": "Seeing only one review for Yono, and considering it wasn't from a purchased-through-Steam copy, I figured I'd leave my thoughts as a normal buyer. I am just about an hour into the game and I'll update my review if I have any major reason as I go.\n\nYono oozes charm from the moment you launch the game. The menu is colorful and the short intro sequence is well done. There aren't many settings to adjust, but it all worked right out of the gate with my DS4 controller. The game does a good job walking you through the mechanics, and right as I thought it was at risk of annoying me with help I was set off on my own to find my way.\n\nThis would be a great game for kids. It's colorful, it's friendly and at no point has it been frustrating or unfair. I'm playing it at a relaxed pace and am enjoying exploring and interacting with whatever I notice in the moment. At an hour of gameplay I've just reached the second city, and if I'm paying attention I'd guess I'm about 20 percent through what I know about. If you plan on rushing through the game I don't think there's going to be enough to justify the full price, but if you're like me you'll get more than your money's worth.\n\nAs far as challenge goes, I figured the puzzles would be a breeze but I managed to get caught in a loop early on because I didn't realize there were two paths through a section. Now I'm already wondering if I missed earlier optional routes. There is a definite potential for depth.\n\nIn summary, if you're looking for a relaxing and fun game that will cheer you up, but isn't difficult, this is a solid purchase for the price.", "timestamp_created": 1507857609, "timestamp_updated": 1507857609, "voted_up": true, "votes_up": 28, "votes_funny": 0, "weighted_vote_score": "0.776647", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35661994": {"recommendationid": "35661994", "author": {"steamid": "76561198401086560", "num_games_owned": 176, "num_reviews": 11, "playtime_forever": 6, "playtime_last_two_weeks": 0, "last_played": 1507823969}, "language": "english", "review": "We reviewed this. Our review was primarily based on the Nintendo Switch version, but the writer also spent some time in the Steam version.\n\nHere's a select quote from the review:\n\n\"Despite my criticisms, I did enjoy my time with Yono and the Celestial Elephants. It is a relaxing adventure through a colorful world that provides little challenge, but also demands little of the player. It suffers a bit from a seemingly random story, a lack of character development, and a complete lack of any sort of progression, but the core puzzling experience is largely enjoyable. If you’re looking for a charming game to relax and play for a few hours, this one might be worth checking out. However, if you’re looking for a deep, challenging experience that will last more than five or six hours, you may want to look elsewhere.\"\n\nYou can find the full review and some cool screenshots from our time playing here: http://twocredits.co/our-two-credits/two-credits-yono-celestial-elephants/", "timestamp_created": 1507824169, "timestamp_updated": 1507824169, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.387214", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 7, "review_score_desc": "Positive", "total_positive": 27, "total_negative": 0, "total_reviews": 27}}
