{"reviews": {"39470455": {"recommendationid": "39470455", "author": {"steamid": "76561198001241220", "num_games_owned": 310, "num_reviews": 12, "playtime_forever": 337, "playtime_last_two_weeks": 0, "last_played": 1504203144}, "language": "english", "review": "A great little multiplayer game. Lots of hectic fun when you play with 3+ players. Can even play it free with someone else if they own it by using the demo. Highly recommend giving it a try.", "timestamp_created": 1516406410, "timestamp_updated": 1516406410, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39223037": {"recommendationid": "39223037", "author": {"steamid": "76561198009684647", "num_games_owned": 82, "num_reviews": 6, "playtime_forever": 276, "playtime_last_two_weeks": 77, "last_played": 1515910847}, "language": "english", "review": "I am known among many of my friends to enjoy games that often go under the radar. This is easily one of my favorite of my hidden gems. An amazing soundtrack, a simple learn and easy to master gameplay as well as an excellent demo test test the full game out. There's no reason why everyone should at least try this fantastic game.", "timestamp_created": 1515556895, "timestamp_updated": 1515556895, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39173627": {"recommendationid": "39173627", "author": {"steamid": "76561198099229757", "num_games_owned": 65, "num_reviews": 2, "playtime_forever": 413, "playtime_last_two_weeks": 413, "last_played": 1515829871}, "language": "english", "review": "This game deserves so much more recognition than this. Yes it is intended as a 'couch' game, but has every tool you could need to play with remote friends or find others to play with. The menu/options feel like a proper pc game with match making, lan, and direct ip.\nThe worst thing you can do here is consider the invisibility a gimmick. It absolutely makes this game a unique experience. The game play is frantic and a pure blast with moments of trying to survive vs trying to kill the other first. Character have differing abilities and item drops add plenty of variety and allow some playing to your taste.\n\nI would also point out that I first saw this game at PAX a year ago and they are still active and supporting it. You can't go wrong with this one.\n\nJust as Overcooked is at the top of co-op insanity, this game is at the top of PvP insanity and is finally the one to dethrone my previous go to friends game after 2 years.", "timestamp_created": 1515391073, "timestamp_updated": 1515391212, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.568965", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39104210": {"recommendationid": "39104210", "author": {"steamid": "76561198339867589", "num_games_owned": 75, "num_reviews": 18, "playtime_forever": 4665, "playtime_last_two_weeks": 0, "last_played": 1514600291}, "language": "english", "review": "Amazing great with an interesting concept. Not the easiest thing in the world to get used to but it feels great when you get the hang of it.", "timestamp_created": 1515206194, "timestamp_updated": 1515206194, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38961227": {"recommendationid": "38961227", "author": {"steamid": "76561198088226140", "num_games_owned": 137, "num_reviews": 21, "playtime_forever": 90, "playtime_last_two_weeks": 0, "last_played": 1509776915}, "language": "schinese", "review": "特别出色的四人撕逼友尽小游戏，玩法非常新颖……【\n\n然而就在昨天被两个WOT老玩家基友吊打\n\n【暗骂一声老阴逼", "timestamp_created": 1514867608, "timestamp_updated": 1514867608, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38936361": {"recommendationid": "38936361", "author": {"steamid": "76561198014104500", "num_games_owned": 44, "num_reviews": 1, "playtime_forever": 436, "playtime_last_two_weeks": 46, "last_played": 1515622980}, "language": "english", "review": "Amazing game! Intelligent concept, very well designed characters and worlds.\nGreat soundtrack and great community, do not get disapointed if you can't find a game online, join the discord server, there are always people around and willing to play.", "timestamp_created": 1514814198, "timestamp_updated": 1514814198, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38923407": {"recommendationid": "38923407", "author": {"steamid": "76561198037565180", "num_games_owned": 331, "num_reviews": 9, "playtime_forever": 9, "playtime_last_two_weeks": 0, "last_played": 1514778868}, "language": "english", "review": "Screencheat but you have to figure out where YOU are along with everyone else, which is as infuriating as it sounds. This may be the first game I've ever just straight up uninstalled after completing the tutorial.", "timestamp_created": 1514778975, "timestamp_updated": 1514778975, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.216918", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38871219": {"recommendationid": "38871219", "author": {"steamid": "76561197966365246", "num_games_owned": 250, "num_reviews": 3, "playtime_forever": 367, "playtime_last_two_weeks": 0, "last_played": 1514947970}, "language": "english", "review": "If you're reading this review, I can tell you right now that Invisigun Heroes is destined to become one of the all-time great couch co-op games.\n\nThe pixel graphics & animation are excellent, the controls are tight, and the music & sound are definitely above decent. But that's not what makes Invisigun Heroes a great game.\n\nWhat makes Invisigun great is the core gameplay. Until you fire (or bump into something), you're entirely invisible to everyone including yourself. This makes for some stunning emergent play choices. Most matches will see you wildly swinging between methodical, stealthy positioning, and frenetic button mashing as your ambush goes horribly awry and everything goes sideways.\n\nThroughout all of it, you have to keep your eye on the telltale signs of enemy passage and the sound of their footsteps as they cross different terrain, trying to determine their location so you can make them stumble into your killshot and snag the victory. The strategic choices are deep enough to create a high skill ceiling, but easy enough to grasp that they will eventually become intuitive. And this is a game that rewards intuition.\n\nThe character design choices are solid as well, offering a hero for any playtype you might prefer: mobility, recon, decoys, teleports, counters, even air strikes. All heroes have foils who are appropriate counters to them, and the base invisibility mechanic manages to level the playing field and give players a fighting chance even against heroes who would seem to be more powerful in a given matchup.\n\nJust to keep things interesting, the game air-drops power ups onto the field every 20 seconds or so (configurable), providing advantages like invisible/inaudible footsteps, shots that drop secondary bombs in adjacent tiles, reducing delay between shots, and a lot more. Not only do the powerups add to the gameplay but they create 'hot zones' on the map where you can be sure your enemy is heading, and try to intercept them.\n\nI also just want to add that there are many small, brilliant tweaks to prevent stale gameplay. For example, if two shots meet in midair, they cancel each other out - but also leave a small explosion that lasts a second, blocking further shots, giving you a moment to move and regain your invisibility if you want to and keeping the match from devolving into a straight slugfest.\n\nAll this is not to say that the game has no flaws Some maps will heavily favor one hero over another - for example, Iris (with dash ability) will excel on maps that are wide open. And some maps are just ridiculously assembled - there's a map in the kickstarter group that contains no possible jumps, crippling Celene who relies on jumps for mobility. And of course, at the time of this writing, the game is as-yet-unknown and it can be tough to find an online quickmatch. But with further tweaking, more maps, more heroes, and more visibility, I can see these nitpicks fading into the background, much as the heroes do after zapping an opponent. And you can always hop into the Invisigun Discord and find friendly players to challenge.\n\nAll in all, Invisigun Heroes is an ecstatic co-op experience that had me howling with joy while playing it. I cannot recommend it strongly enough for players who have a taste for fast-paced, intuitive strategy and frantic couch co-op action. Considering the high level of quality, it's hard to believe the studio is a one-person name. I did receive a copy of this game for free from a friend of the creator, but I easily would have purchased it on the strength of the demo -  especially at 35% off for the Christmas sale - and have already bought several copies for friends.\n\nPick it up today. You won't regret it.\n\nEDIT - I've used the words \"couch co-op\" a couple of times, and upon consideration, it's more appropriate to call it \"couch competitive.\"", "timestamp_created": 1514659252, "timestamp_updated": 1514662302, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.518790", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "38774078": {"recommendationid": "38774078", "author": {"steamid": "76561197990585422", "num_games_owned": 272, "num_reviews": 17, "playtime_forever": 116, "playtime_last_two_weeks": 0, "last_played": 1488715055}, "language": "english", "review": "Buy this game for some of the BEST couch multiplayer action ever! Check out the Discord channel if you want to find some nice people online to play with too, it's well worth it!", "timestamp_created": 1514455647, "timestamp_updated": 1514455647, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.518790", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38403347": {"recommendationid": "38403347", "author": {"steamid": "76561197990349979", "num_games_owned": 198, "num_reviews": 1, "playtime_forever": 501, "playtime_last_two_weeks": 0, "last_played": 1514073819}, "language": "english", "review": "I really like this game! A group of friends and I play it regularily at University. It's a good party game.\nThe only issue we have had is the latency when playing online. The game does support LAN, so this is only an issue to us because our University seems to block us from playing over LAN.", "timestamp_created": 1513617495, "timestamp_updated": 1513617495, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.494972", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38166585": {"recommendationid": "38166585", "author": {"steamid": "76561198189095062", "num_games_owned": 44, "num_reviews": 28, "playtime_forever": 99, "playtime_last_two_weeks": 0, "last_played": 1511287077}, "language": "english", "review": "Fun game to play with friends!  The controls are good and the game play is fun", "timestamp_created": 1512781532, "timestamp_updated": 1512781532, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.494972", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37936750": {"recommendationid": "37936750", "author": {"steamid": "76561198016240372", "num_games_owned": 61, "num_reviews": 1, "playtime_forever": 25, "playtime_last_two_weeks": 0, "last_played": 1511902390}, "language": "english", "review": "I wanted to try this game with my friends. We didn't manage to make the multiplayer work, and the single player is extremely dull.\nI recommend to stay away from this game, no matter how cheap it might be.", "timestamp_created": 1511985207, "timestamp_updated": 1511985207, "voted_up": false, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.279630", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "timestamp_dev_responded": 1512108186, "developer_response": "Hi Legion - thanks for taking the time to leave a review. I just wanted to say that there were some relay server issues for the past few days that basically made connections not work at all. This hasn't happened since launch, so unfortunately I think your attempts at connecting with your friends fell in this window and wouldn't work.\n\nIt would be awesome if you gave it another go, and just wanted to point out that you can mix and match the full version and the free Guest Edition online, so you can play against any of your friends even if they don't own the full version (but you'll have access to more heroes and content)."}, "37917490": {"recommendationid": "37917490", "author": {"steamid": "76561198305925379", "num_games_owned": 101, "num_reviews": 31, "playtime_forever": 357, "playtime_last_two_weeks": 0, "last_played": 1514939494}, "language": "english", "review": "Great party game, super fun to play with friends. Everyone is invisible, and you have to watch for little cues that show signs of movement to pick up on where everybody else is. To the casual observer, it looks like nothing is happening. But to those playing, it's a furious battle", "timestamp_created": 1511923086, "timestamp_updated": 1511923086, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.496690", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37760879": {"recommendationid": "37760879", "author": {"steamid": "76561198019434872", "num_games_owned": 642, "num_reviews": 30, "playtime_forever": 1350, "playtime_last_two_weeks": 0, "last_played": 1511812506}, "language": "english", "review": "This game is downright incredible. Its mechanics of having all the characters be invisible is incredibly clever and, when communicating with others you're playing against, is incredibly fun. Especially, those panicked moments when you're the last two standing and you run into each other. Furthermore, the game has a massive number of maps available, numerous game-modes, each class is creative and varried enough to feel interesting to play on its own...the whole thing is a fantastic experience. Not to mention, the developers have been pushing out updates quite regularly...including even a new (well... Ish. It's been out for a bit) observation mode for people that are streaming so that the game is far more exciting to watch. \n\nUnfortunately, the game isn't exactly widespread in terms of online play. The sad portion is that this game, despite having proper online support, befalls to the same traps as games like TowerFall Ascention or Nidhogg fall into, where if you aren't able to organize a group of people to get on and play, the chan ces of you doing much of anything aren't particularly high. I mean, there are single player challenges, but they aren't nearly exciting as the online matches (as a parallel example, think of playing Loves in a Dangerous Spacetime solo versus in co-op). \n\nSo, while I would absolutely love to recommend the game to everyone for being fantastic (and, hopefully, to buff the number of online players), but... That is unfortunately its downfall. Not a lot of people playing means that people are going to be reluctant to grab it....which means that there aren't going to be a lot of people playing. That said, if you can organize some mates, whether in person or over the internet with VoIP, definitely check it out. It's truly incredible.", "timestamp_created": 1511772661, "timestamp_updated": 1511772829, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.496690", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37254405": {"recommendationid": "37254405", "author": {"steamid": "76561198049877584", "num_games_owned": 139, "num_reviews": 8, "playtime_forever": 449, "playtime_last_two_weeks": 0, "last_played": 1512509505}, "language": "english", "review": "A new take in multiplayer game.\n\nThe graphics provide a certain nostalgia of older games with a new and exciting take.You are invisible.\n\n\nFun to play by yourself to pass some time and try to clear all available stages and a lot more fun when you are playing competitively against friends or strangers\n\n\n\n", "timestamp_created": 1511493278, "timestamp_updated": 1511493278, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.494972", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37241596": {"recommendationid": "37241596", "author": {"steamid": "76561198061337804", "num_games_owned": 26, "num_reviews": 3, "playtime_forever": 10, "playtime_last_two_weeks": 0, "last_played": 1511486187}, "language": "english", "review": "Been a backer since Kickstarter age and now really impressed with what Sombr has done. Engaging multiplayer with upscaling tense in every single level. Would recommend this game to fellow gamers 10/10", "timestamp_created": 1511486426, "timestamp_updated": 1511486426, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.471628", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37106066": {"recommendationid": "37106066", "author": {"steamid": "76561198214439641", "num_games_owned": 128, "num_reviews": 2, "playtime_forever": 3249, "playtime_last_two_weeks": 0, "last_played": 1514788386}, "language": "english", "review": "This game surprise me how awkward its gameplay at first. Not being able to see your character & enemy on screen makes frustating feeling initially. As time goes on, the game shines its deep mechanic & design step by step through every move & mistake I made. I realize now that this is very solid game and a must play for couch-competitive gamer.", "timestamp_created": 1511451222, "timestamp_updated": 1511451222, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.518790", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36939358": {"recommendationid": "36939358", "author": {"steamid": "76561197964902878", "num_games_owned": 603, "num_reviews": 6, "playtime_forever": 243, "playtime_last_two_weeks": 0, "last_played": 1499588664}, "language": "english", "review": "Tense multiplayer deathmatch action. Easy for everyone at a party to pick up and play. The pixel art on the characters, maps, and menus is damn good.", "timestamp_created": 1511413740, "timestamp_updated": 1511413740, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36895942": {"recommendationid": "36895942", "author": {"steamid": "76561198075608819", "num_games_owned": 207, "num_reviews": 28, "playtime_forever": 229, "playtime_last_two_weeks": 113, "last_played": 1515467749}, "language": "english", "review": "its a great indie game 10/10", "timestamp_created": 1511402795, "timestamp_updated": 1511402795, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36805033": {"recommendationid": "36805033", "author": {"steamid": "76561197976303237", "num_games_owned": 659, "num_reviews": 2, "playtime_forever": 361, "playtime_last_two_weeks": 0, "last_played": 1511384787}, "language": "english", "review": "bueno", "timestamp_created": 1511384725, "timestamp_updated": 1511384725, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36801561": {"recommendationid": "36801561", "author": {"steamid": "76561198064138713", "num_games_owned": 197, "num_reviews": 7, "playtime_forever": 782, "playtime_last_two_weeks": 0, "last_played": 1513773170}, "language": "spanish", "review": "Al principio risas con los amigos hasta que te adaptas, pero después, maxima tensión para ver quien gana. \n\nJuego recomendadisimo para jugar en local, se nota que se ha hecho con mucho mimo. Eso si, lo mejor es jugar 4 personas, que no sabes ni por donde te caen los disparos hehe.\n\nLo bueno, es que por ahora el dev lo esta cuidando bastante y acaba de anunciar un nuevo personaje.\n\nLo mejor, es que tiene una demo que incluye todo lo necesario para hacerte una idea de como va el juego, asi que no se a que esperas, pruebalo! \n", "timestamp_created": 1511384313, "timestamp_updated": 1511384313, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.520845", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36334494": {"recommendationid": "36334494", "author": {"steamid": "76561197980916854", "num_games_owned": 62, "num_reviews": 9, "playtime_forever": 293, "playtime_last_two_weeks": 48, "last_played": 1516405208}, "language": "english", "review": "Awesome gameplay, mechanically reminds me of the 2D Zelda games in terms of your mobility & tools, but with tight grid-based movement, in a free-for-all shooting arena, with orgasmic sound design featuring thumping electronic music.\n\nIt'll run on a potato and support some of the crappiest generic controllers, or even four people on different parts of a keyboard.\nOn top of that, the devs have made this game super-easy to try out for free. What's not to like?\n\nIt's innovative, tons of fun, the whole thing oozes character and enough artistic polish to be a Game of the Year nominee, and yet it's hardly seen the light of day presumably from lack of marketing. What a tragedy.", "timestamp_created": 1510022896, "timestamp_updated": 1510023544, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36279098": {"recommendationid": "36279098", "author": {"steamid": "76561198068981865", "num_games_owned": 233, "num_reviews": 25, "playtime_forever": 254, "playtime_last_two_weeks": 0, "last_played": 1510381620}, "language": "english", "review": "Amazing!\n\nNot only brings back nostalgia of playing games like Bomberman on N64, but is just an excellent fast-paced strategy arena game.  Playing this with friends is fun and hilarious.  When you get down to the last two players there is the perfect amount of tension until the final draw is made.\n\nThis year has been a cluster of incredible games coming out one after another.  This one fits right in with such a good year.  I just wish it had gotten more exposure\n\nI could recommend this to just about anybody\n", "timestamp_created": 1509824810, "timestamp_updated": 1509824810, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.531987", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36208316": {"recommendationid": "36208316", "author": {"steamid": "76561197993222875", "num_games_owned": 322, "num_reviews": 4, "playtime_forever": 338, "playtime_last_two_weeks": 0, "last_played": 1514548775}, "language": "english", "review": "Best couch arena since Towerfall", "timestamp_created": 1509594853, "timestamp_updated": 1509594853, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.527901", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35932186": {"recommendationid": "35932186", "author": {"steamid": "76561197962418643", "num_games_owned": 263, "num_reviews": 17, "playtime_forever": 80, "playtime_last_two_weeks": 0, "last_played": 1514788887}, "language": "english", "review": "Great party game for local couch play if you have 4 controllers!", "timestamp_created": 1508708525, "timestamp_updated": 1508708525, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35924748": {"recommendationid": "35924748", "author": {"steamid": "76561198017604243", "num_games_owned": 94, "num_reviews": 4, "playtime_forever": 698, "playtime_last_two_weeks": 0, "last_played": 1514326503}, "language": "english", "review": "Loads of fun with friends!", "timestamp_created": 1508688173, "timestamp_updated": 1508688173, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35922398": {"recommendationid": "35922398", "author": {"steamid": "76561198096611966", "num_games_owned": 55, "num_reviews": 1, "playtime_forever": 102, "playtime_last_two_weeks": 0, "last_played": 1508682711}, "language": "schinese", "review": "游戏性来讲还是很好玩的，八种不同的人物，各自有各自的技能，如果说缺点就是只有上下左右的方向让用手柄的我在一开始的游玩上造成了一定困扰。", "timestamp_created": 1508682896, "timestamp_updated": 1508682896, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35869051": {"recommendationid": "35869051", "author": {"steamid": "76561198197339286", "num_games_owned": 328, "num_reviews": 21, "playtime_forever": 14, "playtime_last_two_weeks": 0, "last_played": 1508519529}, "language": "schinese", "review": "特色是隐身，除去上下左右移动，空格射击，C键技能。\n移动不显示，没错，你自己都看不见自己，除非你幢墙了，但也看不见你自己，只有墙上有反应。\n射击和技能都会显出身形，所有人都看得到的哦。\n\n四个好友联机的话我能想象那个场景。\n一定会充满了各种欢（哔）声（哔）笑（哔）语（哔）的。", "timestamp_created": 1508520034, "timestamp_updated": 1508520034, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35825248": {"recommendationid": "35825248", "author": {"steamid": "76561198025651149", "num_games_owned": 908, "num_reviews": 28, "playtime_forever": 41, "playtime_last_two_weeks": 0, "last_played": 1508348404}, "language": "german", "review": "4-Spieler \"Riskier deine Freundschaft\" Partyspiel (diese Kategorie kennt man aus: Worms, Mario Kart, Move or Die...)\n\nFirst Impression: https://youtu.be/JPWVGNRrGdQ\n\nPro:\n- bekannte Spielmodi in Unsichtbar\n- Sounddesign und Arena-Animationen geben genug Hilfestellung zur Orientierung im Raum\n- Local-Multiplayer\n\nContra:\n- kaum Online-Spieler\n- Bots nicht fordernd genug für Singleplayer\n- den meisten Spaß hat man nur mit 3 Freunden", "timestamp_created": 1508355242, "timestamp_updated": 1508355242, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35592001": {"recommendationid": "35592001", "author": {"steamid": "76561197993449670", "num_games_owned": 88, "num_reviews": 1, "playtime_forever": 994, "playtime_last_two_weeks": 0, "last_played": 1513691806}, "language": "english", "review": "I play this through my steam link in the TV with preferably 3 friends. It's always a riot.", "timestamp_created": 1507538819, "timestamp_updated": 1507538819, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.563088", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35517597": {"recommendationid": "35517597", "author": {"steamid": "76561198122360803", "num_games_owned": 84, "num_reviews": 6, "playtime_forever": 140, "playtime_last_two_weeks": 0, "last_played": 1507290111}, "language": "english", "review": "10/10\n", "timestamp_created": 1507294248, "timestamp_updated": 1507294248, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.496602", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35173163": {"recommendationid": "35173163", "author": {"steamid": "76561198077964931", "num_games_owned": 169, "num_reviews": 49, "playtime_forever": 703, "playtime_last_two_weeks": 1, "last_played": 1516247899}, "language": "english", "review": "More people need to play this game.", "timestamp_created": 1506237273, "timestamp_updated": 1506237273, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35131663": {"recommendationid": "35131663", "author": {"steamid": "76561198008511394", "num_games_owned": 189, "num_reviews": 15, "playtime_forever": 231, "playtime_last_two_weeks": 0, "last_played": 1510520467}, "language": "english", "review": "It takes a little time to check out how to play Invisigun: The difficulty is, that you can not see yourself while you move, except, when you bump into something or shoot. The same applies to your opponents. It's like a sneak and shoot game. The key to the game is to count the tiles on the ground or the steps while moving, and remember where you are. I highly advise to play with a D-Pad not the analog sticks of your controller.\nAfter you master the movement it's a really entertaining and fast game, best played with friends on your couch in front of the tv. It has nearly the same addiction like the battle mode in the first Mario Kart on the SNES.\nReally great competitive gameplay and a lot of fun!\n\nThe graphics and the sound is great and fits too. If you like such multiplayer games, get it!", "timestamp_created": 1506096873, "timestamp_updated": 1506096948, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.527273", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35102648": {"recommendationid": "35102648", "author": {"steamid": "76561198089419680", "num_games_owned": 155, "num_reviews": 53, "playtime_forever": 61, "playtime_last_two_weeks": 0, "last_played": 1505994780}, "language": "bulgarian", "review": "Зверски забавна и тарикатска игрица , тука се попиляхме :) Поддържа игра на един компютър с клавиатура и няколко контролера. Приятна игра!", "timestamp_created": 1505994659, "timestamp_updated": 1505994659, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35063434": {"recommendationid": "35063434", "author": {"steamid": "76561198032669433", "num_games_owned": 191, "num_reviews": 1, "playtime_forever": 583, "playtime_last_two_weeks": 0, "last_played": 1514478732}, "language": "english", "review": "A very fun game with tight gameplay, allowing for hours of fun either locally or online with friends or playing the solo campaign. The soundtrack is really good and this game even has an official discord to find people to play with instead of just joining random games!", "timestamp_created": 1505824318, "timestamp_updated": 1505824318, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501718", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35052547": {"recommendationid": "35052547", "author": {"steamid": "76561197972443975", "num_games_owned": 305, "num_reviews": 35, "playtime_forever": 72, "playtime_last_two_weeks": 0, "last_played": 1506302447}, "language": "english", "review": "THIS GAME IS SO AWESOME... \n\nAnd it works even better than we realized. Instant games with PS4 controllers. Thanks for the help.", "timestamp_created": 1505766545, "timestamp_updated": 1506370087, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35046663": {"recommendationid": "35046663", "author": {"steamid": "76561198324121676", "num_games_owned": 133, "num_reviews": 9, "playtime_forever": 448, "playtime_last_two_weeks": 190, "last_played": 1516200727}, "language": "japanese", "review": "ドット絵とBGMに魅かれて買いました。\n正直、PVをみて「ゲームになるのか？」と不安に思ってましたが十分なほどに楽しめるゲームでした。\n\nメタルギアシリーズをリアフレとわちゃわちゃしてた頃に、全員がステルス迷彩を持ってくるという事案が有り懐かしさを覚えましたｗ\n敵が見えないなんてことは今までのゲームでもよくあること・・・しかし、このゲームはPVにもあるようにplayerも見えないのが特徴。いつもなら画面の中心に立っているキャラクターもどこに行ったのやら把握しなければなりません！\nheroと呼ばれるキャラクター達にはそれぞれ個性があり、前方一マスを飛び越えたり・突然爆発して気絶させたりと戦略を生み出せるものばかりで、これと言ってチート級の強さだ！なんてものはありません。なんせ、見えなければ当てることすらできないのですから。\n\nステージも各惑星をイメージして作られた個性豊かな地形があります。\n足跡がついたり、当たると気絶する隕石が降ってきたりと様々・・・。自分の位置が把握できるようになったら地形も生かして勝利に近づけることでしょう。\n\n英語と日本語対応しているのですが、勝利時のコメントが煽り全快なのでそれもキャラクターの個性だと割り切って楽しめるとなおgoodです！\n\n海外では賑わっているのですが、日本ではひっそりと見かける程度なので購入している方・購入したいけどやる人がいないなどなど理由はなんであれ一緒に遊んでくれる人フレンド申請ください（切実\n本来、販促動画でも作るべきなのでしょうが、そんな力がないのでどなたかお願いしました。", "timestamp_created": 1505745925, "timestamp_updated": 1505745925, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35009319": {"recommendationid": "35009319", "author": {"steamid": "76561197969389630", "num_games_owned": 1248, "num_reviews": 50, "playtime_forever": 130, "playtime_last_two_weeks": 0, "last_played": 1505607491}, "language": "english", "review": "This game is awesome, how is this not more well-known?", "timestamp_created": 1505603323, "timestamp_updated": 1505603323, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.548734", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35002417": {"recommendationid": "35002417", "author": {"steamid": "76561198011397508", "num_games_owned": 57, "num_reviews": 2, "playtime_forever": 301, "playtime_last_two_weeks": 0, "last_played": 1506200051}, "language": "english", "review": "Really fun game. The developers have made some strong updates recently and its much easier to make/create a game for other players to join.\n", "timestamp_created": 1505582104, "timestamp_updated": 1505582104, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501718", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34987082": {"recommendationid": "34987082", "author": {"steamid": "76561198021591298", "num_games_owned": 45, "num_reviews": 6, "playtime_forever": 650, "playtime_last_two_weeks": 59, "last_played": 1515198415}, "language": "english", "review": "Easy. Try the demo. It made me love it. I bought as soon as possible.\n\nIt simply is the greatest party game I've played.\n\nNo fights or arguments, just healthy fun, win or lose.\n\nI hope it keeps getting better =)", "timestamp_created": 1505534306, "timestamp_updated": 1505534306, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.501718", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34962256": {"recommendationid": "34962256", "author": {"steamid": "76561198065303206", "num_games_owned": 239, "num_reviews": 16, "playtime_forever": 95, "playtime_last_two_weeks": 2, "last_played": 1515945295}, "language": "english", "review": "Truly great game. Easy to learn, difficult to master. Let's get this straight, there's only one reason this is a negative review and it's because the issues I describe here are still not fixed. Totalbiscuit is a bit of a chode and he's wrong about the playerbase issue, \"visibility\" for youtube's vast audience of vapid children is not Invisigun's biggest problem. I'll just nod in the direction of the ocean of diarrhea-content on yonder Twitch.\n\nGood news is this game is fun AF and all that's required to have a great time is literally three other players with a reasonable ping. That leaves absolutely no good reason for quickmatch not to immediately resolve a game. The playerbase can and will resurge when selecting quickmatch results in a game.\n\nRecommendations for options / features / fixes:\n\n    1. Kill the broken automated quick-match matchmaker. Allow players to filter by ping, region, language, gametype, etc. Players select tags, throw 'em on a filter stack, client allows players to select one from a shortlist.\n    2.  Retain players in the quick match-making queue by dropping them into universal, \"holding rooms\" where they can chat with other match-seekers. Games remain in the matchmaking queue, adding and removing bots as more players join or leave.\n    3. Enable match-browser whereby players can browse active games.  \n    4. Figure out a rework for match rooms to include more players, VOIP, chat, and spectate. If >4 players host selects the active players or rotation-mode, allow host to set banners, rules, passwords, etc. \n    5. Add friend-widget based on Steam's widget API; quick-join, chat, message, add friend, etc.\n    6. Add player stat-tracking system for tournament/ranked/ELO/ etc.\n\nShit, I'm a developer and I'd much rather work on games than business software. Pay me a decent wage and I'll program the backend.", "timestamp_created": 1505442392, "timestamp_updated": 1515989953, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.565217", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34938878": {"recommendationid": "34938878", "author": {"steamid": "76561198183952338", "num_games_owned": 52, "num_reviews": 8, "playtime_forever": 97, "playtime_last_two_weeks": 0, "last_played": 1505015136}, "language": "english", "review": "Playerbase is dead. No one to play with even with discord. No one ever gets on and its boring alone. i regret purchesing this game", "timestamp_created": 1505345137, "timestamp_updated": 1505345137, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.422610", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34916199": {"recommendationid": "34916199", "author": {"steamid": "76561198141214828", "num_games_owned": 53, "num_reviews": 1, "playtime_forever": 1451, "playtime_last_two_weeks": 0, "last_played": 1514589415}, "language": "brazilian", "review": "Simplesmente INOVADOR\n\nDIVERTIDO a ponto de êxtase nostálgico (parece fazer confluir diversos clássicos em um só game)\n\nNÃO FICA MONÓTONO, pois parece haver sempre a possibilidade contínua de ascender em termos de habilidades mecânicas e a VARIEDADE de mapas, modos e personagens é realmente absurda\n\nA CAMPANHA cumpre o papel de se ensinar o jogo em sua totalidade e é um DESAFIO e tanto para aqueles que se aventuram no mundo das conquistas da Steam\n\nO MULTIPLAYER é sensacional. Jogar com amigos no multiplayer-local então: cósmico\n\nA FACILIDADE de se aprender a jogar é surpreendente, você pode jogar com sua tia, por exemplo, ou não\n\nO desenvolvedor, eventualmente, disponibiliza a COMPRA de 4 jogos pelo preço de um. Reúna os amigos e felicidade geral da nação concretizada\n\nAs ATUALIZAÇÕES são constantes e sempre há participação ativa da comunidade na implementação do game\n\nA COMUNIDADE é apaixonada por esse game, creio que mais de 90% dos usuários entram no Discord (programa/app/site da internet onde se reúnem os jogadores) e se mantêm ativos em jogos que sempre surgem. Quero jogar com alguém?\nApenas publique que deseja isso, simples\n\nHá apenas um CONTRA que quero compartilhar: Há poucos brasileiros/Sul-americanos. E esse é um dos motivos de eu ter feito um post tão fanboy. Não gostou do jogo? Sugiro tratamento psiquiátrico!", "timestamp_created": 1505295117, "timestamp_updated": 1505295939, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34908384": {"recommendationid": "34908384", "author": {"steamid": "76561197966697412", "num_games_owned": 482, "num_reviews": 8, "playtime_forever": 77, "playtime_last_two_weeks": 0, "last_played": 1507675041}, "language": "english", "review": "Plays great. $15 is pretty cheap. If it goes on a sale it will get cheaper. Key is you can get friends to play with you online even if they don't have a copy. So put out the money and it's free for your friends!\n\nThe game is fairly stable ping wise and plays great. You concentrate a lot more when playing then when watching. Very different experience.", "timestamp_created": 1505249642, "timestamp_updated": 1505249642, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34901665": {"recommendationid": "34901665", "author": {"steamid": "76561198342796537", "num_games_owned": 17, "num_reviews": 4, "playtime_forever": 299, "playtime_last_two_weeks": 0, "last_played": 1506178455}, "language": "schinese", "review": "游戏本身是很不错的 ，我也有小伙伴，但是但是但是这个延迟也太大了吧。全都在瞬移怎么玩！！！弄一下服务器哟！！\nOnline delay is too large！！！！Online delay is too large！！！", "timestamp_created": 1505224552, "timestamp_updated": 1505224552, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34882208": {"recommendationid": "34882208", "author": {"steamid": "76561198125140101", "num_games_owned": 143, "num_reviews": 3, "playtime_forever": 130, "playtime_last_two_weeks": 0, "last_played": 1507335869}, "language": "schinese", "review": "是谁杀了我，而我又杀了谁？\n在所有人都是隐身的情况下进行同屏对战，相当有创意\n-------------------------------\n说下优点：\n+精美的像素画风\n++相当有趣的游戏创意\n+可以在一台电脑上和基友开黑打匹配（嗯让那一个路人感受我们宿舍3人的猛烈攻势！！！啊啊啊下铺你怎么打到我了！路人：？？？）\n-------------------------------\n一点期望：\n·希望加入创意工坊自定义地图，地图元素可以多一些\n·同样，希望出更多人物和模式\n·站着不动似乎没有惩罚？在生存模式下一直躲猫猫的人也许会拉低其他人的游戏体验\n-------------------------------\n还有那么一点点不太好的地方：\n-并不知道单人挑战模式有什么有趣的地方。。。\n-服务器看起来包括了几乎所有地区但是匹配很难匹到人，所以上面基友开黑打路人的情景是我YY的（看看隔壁move or die）（不过玩家太少也不能怪服务器不是么。。。）\n-------------------------------\n总之，打折入的话很值，到现在折扣还剩下还有4个小时，如果你看到了就赶紧买吧~", "timestamp_created": 1505134341, "timestamp_updated": 1505134501, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34863573": {"recommendationid": "34863573", "author": {"steamid": "76561198040264284", "num_games_owned": 136, "num_reviews": 8, "playtime_forever": 326, "playtime_last_two_weeks": 0, "last_played": 1506006193}, "language": "japanese", "review": "ボンバーマンチックに移動して自分含めお互いの姿が見えない状態でガンを撃ちあう\n勝利コメントが結構煽ってくる\n\nローカル・オンラインの対戦に対応しているので４つ買って友達に配ろう！\n\n\n", "timestamp_created": 1505054518, "timestamp_updated": 1505054518, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34859354": {"recommendationid": "34859354", "author": {"steamid": "76561197984130436", "num_games_owned": 471, "num_reviews": 5, "playtime_forever": 676, "playtime_last_two_weeks": 0, "last_played": 1514325288}, "language": "english", "review": "played once, allready my new favorite couch pvp game!", "timestamp_created": 1505042250, "timestamp_updated": 1505042250, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.499268", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34846554": {"recommendationid": "34846554", "author": {"steamid": "76561198204503317", "num_games_owned": 16, "num_reviews": 4, "playtime_forever": 36, "playtime_last_two_weeks": 0, "last_played": 1508788817}, "language": "russian", "review": "Одно слово- АФИГИТЕЛЬНА!", "timestamp_created": 1504990422, "timestamp_updated": 1504990422, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34845227": {"recommendationid": "34845227", "author": {"steamid": "76561198212416721", "num_games_owned": 19, "num_reviews": 6, "playtime_forever": 549, "playtime_last_two_weeks": 0, "last_played": 1514764710}, "language": "russian", "review": "Афигенная игра!Я долго искал игру(ы) подобного типа чтоб и весело было и геймплей прикольный ну вобщем я нашёл себе такую, да ещё и по скидке в 75 процентов купил!Убил 2 зайцев сразу!В общем начнём с плюсов!Уникальный геймплэй который я ещё ни в одной игре не видел(могу ошибатся), прикольная графика,много различных карт, интересные персонажи у которых разные способности и каждый играется по своему, возможность играть с другом на одном компьюторе 4 разных режима которые по своему интересные, отличный сингплэйер. Минус по моему мнению в этой игре только 1 это сложно подобрать онлайн игру толи из за того что онлайн маленький толи ещё из за чего то. В общем итог имеем отличную игру с афигенным гемплеем,в основном играть ты будешь либо с ботами либо с другом(друзьями)ну крч не буду всё расписывать игру стоит купить она стоит того но... лучше покупать либо по скидке либо на сайтах. \n10 ДА МЕНЯ ЖЕ ТАМ НЕБЫЛО Я СТОЯЛ В ДРУГОМ МЕСТЕ из 10", "timestamp_created": 1504986238, "timestamp_updated": 1505037773, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.518519", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34843438": {"recommendationid": "34843438", "author": {"steamid": "76561198053635401", "num_games_owned": 90, "num_reviews": 3, "playtime_forever": 153, "playtime_last_two_weeks": 0, "last_played": 1505062565}, "language": "japanese", "review": "面白い。対戦がくせになる。\n体験版があるので、それをやってみて少しでも気に入ったらなら買うべきです。\nプレイヤー求ム。", "timestamp_created": 1504980928, "timestamp_updated": 1504980928, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34831739": {"recommendationid": "34831739", "author": {"steamid": "76561197992085439", "num_games_owned": 369, "num_reviews": 42, "playtime_forever": 342, "playtime_last_two_weeks": 0, "last_played": 1507440035}, "language": "english", "review": "It's painfully frustrating at first, but if you've got at least one good friend to play with and has patience to learn along side you, you'll quickly find yourself having an intense amount of fun.\n\nThere's a wide array of gameplay modes which make it incredibly replayable, the visuals are sharp and create a lot of interesting visual cues to help you keep track of yourself and enemies. The various heroes are unique and feel balanced.\n\nOn the topic of heroes though, some of the mechanics feel a little off, either intentional or not, which lead to some confusing moments. It would be nice if we had a test area where you could experiment with heroes without the invisibility so you could get a feel for them before you go into a live match.\n\nOnly major issue I have with the game is the way games are set up. While I totally get and appreciate the ability to create custom maps using codes you can share on the Discord channel, I feel like the lack of proper Steam integration makes creating and entering private games with friends is harder than it should be. This is possibly the first and only online game worth playing, that doesn't have the ability to \"Invite\" or \"Join\" friends via Steam.", "timestamp_created": 1504944395, "timestamp_updated": 1504944712, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34819453": {"recommendationid": "34819453", "author": {"steamid": "76561198166752006", "num_games_owned": 167, "num_reviews": 5, "playtime_forever": 2537, "playtime_last_two_weeks": 346, "last_played": 1516208528}, "language": "japanese", "review": "[h1] 概要 [/h1]\nこのゲームを簡単に説明すると「爆弾を銃に持ち替えたボンバーマン」ですが、ある大きな特徴があります。\nそれは[b] プレイヤーキャラすべてが透明 [/b]ということです。\n\nキャラの姿が画面上に現れるのはショットを撃つか、キャラそれぞれが持つスキルを使った一瞬のみであり、\nそれ以外では、歩数や足音、壁に当たった時の反応などで、自分や敵の位置を把握しなければいけません。\n\n[h1] ゲームモード [/h1]\nゲームモードは2つで、BOTを相手にする1人用のチャレンジモードと、2～4人対戦のオンラインマッチがあります。\nチャレンジモードは3体のBOTを相手に一度も死なずに勝つことを目指す1人用のモード。\nオンラインマッチは7つのルールに60以上のマップで、フレンドから知らない人まで入り乱れて遊べます。\nまた、ローカルの場合は人数分のパッドさえあれば1つのソフトで4人まで遊ぶことができます。\n\nそれぞれのモードで使えるプレイヤーキャラは9人おり、それぞれ「一マス分の地形を飛び越える」「本体そっくりのデコイを動かす」など独自のスキルを持っています。\nスキル以外の能力に差はないので、スキルか見た目で選びましょう。\n\nオンラインマッチでは一戦が終わるごとに、その試合終了間際のリプレイを見ることができます。\nキャラがどう動いたかが可視化される他、gifで出力できるので名シーンや迷シーンを見返すことが出来ます。\n\n[h1] デモ版 [/h1]\n[b] 無料 [/b]でダウンロードできるデモ版がありますが、チャレンジモードが出来ない、選べるキャラとステージに制限がある、自分では部屋が建てられない、以外は製品版と変わらないため、[b] 製品版とオンラインマッチができます [/b]\n気になる方はぜひぜひデモ版をダウンロードしてオンラインマッチに参加してみてください。\n実際にやってみればどういうゲームかすぐに分かると思います。\n\n\nとてもオススメなゲームですが、現状プレイヤーの人数が少ないという欠点があります。\n少しでも気になった方はデモ版からでいいのでやってみましょう！\n\nーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー\n追記　プレイヤーを探すためにグループ作りました \nhttp://steamcommunity.com/groups/invisigun_jp", "timestamp_created": 1504892372, "timestamp_updated": 1516127586, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.629630", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34804564": {"recommendationid": "34804564", "author": {"steamid": "76561198028360350", "num_games_owned": 443, "num_reviews": 5, "playtime_forever": 250, "playtime_last_two_weeks": 0, "last_played": 1510260239}, "language": "english", "review": "Totally worth, feels great", "timestamp_created": 1504826976, "timestamp_updated": 1504826976, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34794808": {"recommendationid": "34794808", "author": {"steamid": "76561198083041172", "num_games_owned": 150, "num_reviews": 1, "playtime_forever": 755, "playtime_last_two_weeks": 38, "last_played": 1515855998}, "language": "english", "review": "Pros:\n[list]\n[*]Great fun, especially with friends\n[*]The game is easy to learn but hard to master\n[*]Easy controls\n[*]Loads of maps\n[*]The challenge of keeping track of both you and your enemies movements just adds to the fun\n[*]Local and online multiplayer + singleplayer survival against bots\n[*]There's a guest version that allows multiplayer with full game players\n[*]You can save gifs of the end of match replays\n[/list]\n\nCons:\n[list]\n[*][strike] You can't invite friends through steam. It's an invite code they have to type in [/strike] (You can now invite friends through steam too)\n[*]There aren't a lot of people in matchmaking but there is an official discord server for people looking to play\n[/list]\n\nIf you enjoy the game, spread the word. This game needs more players.", "timestamp_created": 1504792399, "timestamp_updated": 1506697071, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34793689": {"recommendationid": "34793689", "author": {"steamid": "76561198071982259", "num_games_owned": 76, "num_reviews": 13, "playtime_forever": 277, "playtime_last_two_weeks": 0, "last_played": 1510806198}, "language": "english", "review": "Pretty amazing game. Obviously this is great party game but what surprised me is that the AI is pretty good. I saw a move from the AI last night that was so crafty, I had to watch the replay just to see how that it happened.\n\nReplays make this game great. You can study exactly what happened and what you can do to get better. But what I really like about replays is that you can easily save them in game as animated gifs to share with friends. A simple nice touch that makes this game all the better.\n\nThe variety of characters to choose from also give this game a great added layer of depth. While this game reminds me of the old bomberman games (which were great), all the characters were the same. Here each hero has uniquely different play styles. Some more aggressive for close quarters play. Some more sneaky and subtle. It's fantastic as there's a play-style for everyone.\n\nI cannot recommend this game enough. It's clever, unique, easy to play when you're short on time to get a few games in. One of the better games I've played in some time.", "timestamp_created": 1504788439, "timestamp_updated": 1504788613, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34788565": {"recommendationid": "34788565", "author": {"steamid": "76561198195229343", "num_games_owned": 483, "num_reviews": 10, "playtime_forever": 2618, "playtime_last_two_weeks": 389, "last_played": 1515467719}, "language": "english", "review": "Fun and fucking mayhem. Good job my boy.", "timestamp_created": 1504761766, "timestamp_updated": 1504761766, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500000", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34776469": {"recommendationid": "34776469", "author": {"steamid": "76561198163923743", "num_games_owned": 279, "num_reviews": 80, "playtime_forever": 249, "playtime_last_two_weeks": 0, "last_played": 1505529915}, "language": "koreana", "review": "캐릭터 안보이는 외국판 크레이지 아케이드\n\n\n심지어 내 캐릭터 까지도 안보이는데 그래서인지 더 긴장감있고 아이템빨 넥슨 크아하고 비교할 정도도 아닌 게임이였다.\n\n친구들하고 하면 언제나 꿀잼.", "timestamp_created": 1504707955, "timestamp_updated": 1504707955, "voted_up": true, "votes_up": 5, "votes_funny": 2, "weighted_vote_score": "0.512195", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34768978": {"recommendationid": "34768978", "author": {"steamid": "76561198194095886", "num_games_owned": 93, "num_reviews": 44, "playtime_forever": 225, "playtime_last_two_weeks": 0, "last_played": 1506229998}, "language": "english", "review": "Very nice game with an interesting concept. But there are not enough characters to play and I feel like this game should have unlockables of some sort, some progression.", "timestamp_created": 1504669237, "timestamp_updated": 1509044198, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497018", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34766950": {"recommendationid": "34766950", "author": {"steamid": "76561198063592473", "num_games_owned": 392, "num_reviews": 34, "playtime_forever": 51, "playtime_last_two_weeks": 0, "last_played": 1504656120}, "language": "english", "review": "Amazing design! This game makes me remember the old fun from bomberman multiplayer, but with so much more content, the pixel art is gorgeous, the soundtrack is great, the gameplay is really interesting.\n\nThe only flaw i can think is not having a dedicated server, with a \"quick play\", standard rule setting. You need to create your own, or find a game server from others, this kinda makes the online experience not so great.\n\nBut you can play it local with friends, so its already a win (unless you are a forever alone person / :( so sad), lol. Approved guys.", "timestamp_created": 1504657641, "timestamp_updated": 1504657641, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.504132", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34765008": {"recommendationid": "34765008", "author": {"steamid": "76561198116196024", "num_games_owned": 55, "num_reviews": 2, "playtime_forever": 9, "playtime_last_two_weeks": 0, "last_played": 1504643830}, "language": "english", "review": "PLAY THIS GAME! It's awesome :D", "timestamp_created": 1504647207, "timestamp_updated": 1504647207, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.455397", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34754693": {"recommendationid": "34754693", "author": {"steamid": "76561198023065495", "num_games_owned": 446, "num_reviews": 14, "playtime_forever": 470, "playtime_last_two_weeks": 0, "last_played": 1508436812}, "language": "english", "review": "I need friends...", "timestamp_created": 1504611876, "timestamp_updated": 1504611876, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.478893", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34752176": {"recommendationid": "34752176", "author": {"steamid": "76561198125142284", "num_games_owned": 476, "num_reviews": 27, "playtime_forever": 57, "playtime_last_two_weeks": 0, "last_played": 1504600615}, "language": "schinese", "review": "一个被动隐身弄出的号作品\n比想象中好玩很多\n然而对健忘很不友好\n\n模式包括本地、网络、挑战三种模式\n\n技能\nselene：【飞跃者】跳跃或二段跳\niris：【冲撞者】冲刺\naether：【重击者】破坏周围障碍或使人眩晕\nproteus：【扫描仪】部署一架能在射程内标记敌人的无人机。激活显示标记的目标。\ncarmen：【建造者】制作能挡一枪的墙\nphoebe：【传送者】放下一个传送门，传送自己或一发子弹\nepi：【幽灵】激活非致命替身\nronin：【收割者】砍下敌人或子弹来囤积两倍伤害子弹", "timestamp_created": 1504600251, "timestamp_updated": 1504600251, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.644444", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34749125": {"recommendationid": "34749125", "author": {"steamid": "76561198042106737", "num_games_owned": 336, "num_reviews": 48, "playtime_forever": 865, "playtime_last_two_weeks": 10, "last_played": 1516118735}, "language": "english", "review": "Really fun gameplay, lots of modes and good variety. \nIf you have friends to play with, this game is a dream come true. If not you can always go to the discord server to meet players and organize matches. \nAs the time of writing this review, getting the game solely for online matches, is not recomended. The player base is still very small, so having a quick and easy session is hard. But if you put in the effort to organize matches through discord or have a few friends that you can play with, it's a god-damn blast!", "timestamp_created": 1504583059, "timestamp_updated": 1504583059, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34748383": {"recommendationid": "34748383", "author": {"steamid": "76561198085599018", "num_games_owned": 89, "num_reviews": 3, "playtime_forever": 43, "playtime_last_two_weeks": 0, "last_played": 1505692830}, "language": "english", "review": "A great game for fans of the Bomberman series and the like.", "timestamp_created": 1504579327, "timestamp_updated": 1504579327, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34748078": {"recommendationid": "34748078", "author": {"steamid": "76561197960334445", "num_games_owned": 466, "num_reviews": 17, "playtime_forever": 575, "playtime_last_two_weeks": 0, "last_played": 1505284332}, "language": "english", "review": "With over 50 maps and 7 modes for all of them, lots of power ups and several different characters Invisigun Heroes brings a lot of variety to the table. The game's mix of invisible movement, abilities, timing and sound based guessing forces players to make fast decisions and react immediately. Every prediction shot is a gamble that pushes the risk/reward balance between killing your enemies and revealing your position, this can be quite thrilling when you have to make these calls while simultaneously having an eye on what is happening on the map and keep track of your own invisible character.\nContrary to my expectations the game is a lot of fun when played online with random people, I originally thought of it as a pure couch co-op title. If you still want to be in voice with people to have some laughs about botched shots or marvel at impressive moves, there is an active community server on discord. Finding a public game also hasn't been an issue for me and playing from Europe on other servers like US East also provides you with a stable connection. [i](Update: Apparently I had some luck in the beginning, consistently finding public games isn't so easy after all. Still I was always able to find game through discord.me/invisigun[/i]). In addition to the multiplayer modes there is an extensive single player challenge mode with 3 difficulties, that can get you through an online drought.\n\nIn short: Invisigun Heroes is a highly entertaining and fast multiplayer game you can enjoy online or with friends, it really nails its concept and gives you single player content as a bonus. Definitely worth its sale price, just grab it and have fun. \nIf you miss the sale but have any interest whatsoever in the concept or have enjoyed indie multiplayer titles like Duck Game or Towerfall, you're almost certain to still get your moneys worth at full price.", "timestamp_created": 1504577808, "timestamp_updated": 1509091225, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.564972", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34745461": {"recommendationid": "34745461", "author": {"steamid": "76561198062896968", "num_games_owned": 503, "num_reviews": 10, "playtime_forever": 127, "playtime_last_two_weeks": 0, "last_played": 1507481105}, "language": "english", "review": "This game is a lot of fun to play with friends/family.\n\nThere are a few different modes that range from kill the other players, to collect points in other ways such as capture the zone, hold the item, etc. There are also a few different characters to choose from with different active abilities that make them unique such as a dash, jump, stomp, etc. And maps, there are tons of them and each arch-type brings in different effects such as lightning that reveals players, snow that creates foot-prints, raising blocks, etc.\n\nThe gameplay can be stealthy, or frantic. However you want to play.\n\nIf you're looking for another game that is on the level of Towerfall to play with your friends/family locally, this is a game for you. I can't speak on the online functionality, because I haven't tried it.", "timestamp_created": 1504565201, "timestamp_updated": 1504565201, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.470588", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34745183": {"recommendationid": "34745183", "author": {"steamid": "76561198017379286", "num_games_owned": 682, "num_reviews": 3, "playtime_forever": 29, "playtime_last_two_weeks": 0, "last_played": 1504563845}, "language": "english", "review": "TotalBiscuit kept rambling about this game and all of a sudden this title popped into sale for 4,50€. I had to grab it and boy, do I regret nothing. Actually I think it would've been worth the 15€, now as an afterthought. The mechanics of this game are extremely interesting and already for the first 30 minutes of gametime I couldn't keep from smiling and laughing, no matter how the game went. This is definitely a must have party game.", "timestamp_created": 1504563986, "timestamp_updated": 1504563986, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34737896": {"recommendationid": "34737896", "author": {"steamid": "76561198011017452", "num_games_owned": 106, "num_reviews": 1, "playtime_forever": 402, "playtime_last_two_weeks": 0, "last_played": 1506028188}, "language": "english", "review": "Most fun in local multiplayer since 2D Worms.", "timestamp_created": 1504540685, "timestamp_updated": 1504540685, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.669904", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34669658": {"recommendationid": "34669658", "author": {"steamid": "76561197965025528", "num_games_owned": 75, "num_reviews": 2, "playtime_forever": 143, "playtime_last_two_weeks": 0, "last_played": 1493485018}, "language": "english", "review": "This game is a great multi-player co-op game that hasn't had the exposure it deserves.", "timestamp_created": 1504301075, "timestamp_updated": 1504301075, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34557602": {"recommendationid": "34557602", "author": {"steamid": "76561198363221240", "num_games_owned": 103, "num_reviews": 23, "playtime_forever": 91, "playtime_last_two_weeks": 0, "last_played": 1504370445}, "language": "english", "review": "This game is solid.", "timestamp_created": 1503939929, "timestamp_updated": 1503939929, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.423885", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34540980": {"recommendationid": "34540980", "author": {"steamid": "76561198050616266", "num_games_owned": 260, "num_reviews": 4, "playtime_forever": 147, "playtime_last_two_weeks": 0, "last_played": 1506231527}, "language": "spanish", "review": "Juego de arena de batalla dónde  todos los jugadores son invisibles. Tenso, tàctico, y sólo requiere 6 botones. 50 mapas y 8 modos de juegos muy diversos que se pueden jugar hasta de a 4 jugadores, local u online.\n\nAltamente recomendable, aunque es importante señalar que al momento de este comentario, la comunidad online en sudamérica no es la mejor. Como Party Game, es de los mejores que hay.", "timestamp_created": 1503874916, "timestamp_updated": 1503874916, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34518859": {"recommendationid": "34518859", "author": {"steamid": "76561198118782156", "num_games_owned": 618, "num_reviews": 10, "playtime_forever": 51, "playtime_last_two_weeks": 0, "last_played": 1499047960}, "language": "english", "review": "Very fun! Get this game out there more.", "timestamp_created": 1503799829, "timestamp_updated": 1503799829, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.495159", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34491672": {"recommendationid": "34491672", "author": {"steamid": "76561198001537765", "num_games_owned": 190, "num_reviews": 11, "playtime_forever": 222, "playtime_last_two_weeks": 0, "last_played": 1503782100}, "language": "english", "review": "You don't need friends to play this game. Just join the awesome official discord channel (advertised in-game) and you will find matches in no time and have lots of fun with your new friends!", "timestamp_created": 1503701154, "timestamp_updated": 1503701154, "voted_up": true, "votes_up": 39, "votes_funny": 1, "weighted_vote_score": "0.790067", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34486562": {"recommendationid": "34486562", "author": {"steamid": "76561198053237029", "num_games_owned": 261, "num_reviews": 16, "playtime_forever": 396, "playtime_last_two_weeks": 0, "last_played": 1506230982}, "language": "english", "review": "Worth every penny for the multiplayer fun.", "timestamp_created": 1503683603, "timestamp_updated": 1503683603, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.544074", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34485382": {"recommendationid": "34485382", "author": {"steamid": "76561197969366600", "num_games_owned": 179, "num_reviews": 9, "playtime_forever": 17, "playtime_last_two_weeks": 0, "last_played": 1493592537}, "language": "english", "review": "I haven't really played this online but I have played it a lot as a party game.  Whenever a few friends come over we usually sit down and spend a couple of hours playing this game against each other.  The diverse heroes and powers combined with the brilliantly simple premise guarantees a good night of screaming, laughing, and trash talking among us.  This is an amazingly fun game and for $15 it should definitely be owned by everyone.", "timestamp_created": 1503679855, "timestamp_updated": 1503680015, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34375569": {"recommendationid": "34375569", "author": {"steamid": "76561198026984623", "num_games_owned": 69, "num_reviews": 34, "playtime_forever": 250, "playtime_last_two_weeks": 0, "last_played": 1512924166}, "language": "english", "review": "BUY if\n\n- you have friends to play with\n- like play games while you take shots\n- like to be invisible", "timestamp_created": 1503241333, "timestamp_updated": 1511709389, "voted_up": true, "votes_up": 17, "votes_funny": 3, "weighted_vote_score": "0.557189", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34374206": {"recommendationid": "34374206", "author": {"steamid": "76561198072448144", "num_games_owned": 83, "num_reviews": 20, "playtime_forever": 285, "playtime_last_two_weeks": 0, "last_played": 1503559806}, "language": "english", "review": "Friend bought for me.\n\nFirst 5 minutes : super frustrating. What evil have they brought to bomberman.\nNext 30 minutes : invisibility makes this an ultra fun game. \"just\" this element.\n\nAt first, you're tiptoeing around, then, you're COD-ing, 2D style.\n\nOther than that :\n\nBug free ( so far )\nSuperb 90s edms\nSimple controls - left, right, up, down, ability and shoot. 6 buttons to master the game.\nFull Steam controller support, intuitive kb controls.\n\nHope this game doesnt stay invisible.", "timestamp_created": 1503237459, "timestamp_updated": 1503237541, "voted_up": true, "votes_up": 18, "votes_funny": 3, "weighted_vote_score": "0.706413", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34226842": {"recommendationid": "34226842", "author": {"steamid": "76561197965930009", "num_games_owned": 566, "num_reviews": 4, "playtime_forever": 52, "playtime_last_two_weeks": 0, "last_played": 1502673540}, "language": "english", "review": "very fun game", "timestamp_created": 1502675732, "timestamp_updated": 1502675732, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34220496": {"recommendationid": "34220496", "author": {"steamid": "76561198060211054", "num_games_owned": 184, "num_reviews": 7, "playtime_forever": 233, "playtime_last_two_weeks": 0, "last_played": 1509881414}, "language": "english", "review": "Perfect game for parties! A lot of fun for sure!", "timestamp_created": 1502651164, "timestamp_updated": 1502651164, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34166362": {"recommendationid": "34166362", "author": {"steamid": "76561198098088630", "num_games_owned": 158, "num_reviews": 48, "playtime_forever": 590, "playtime_last_two_weeks": 0, "last_played": 1514989674}, "language": "english", "review": "great gem if you have people to play with.", "timestamp_created": 1502450387, "timestamp_updated": 1502450387, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33892932": {"recommendationid": "33892932", "author": {"steamid": "76561198065252584", "num_games_owned": 142, "num_reviews": 3, "playtime_forever": 148, "playtime_last_two_weeks": 0, "last_played": 1500967932}, "language": "english", "review": "Grab a few friends and clear your schedule for the night becuase much like pringles, with Invisigun Heroes, once you pop, you can't stop. The art and music for this game are top notch and you can tell that a lot of love has gone into it.", "timestamp_created": 1501372432, "timestamp_updated": 1501372432, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "33685084": {"recommendationid": "33685084", "author": {"steamid": "76561198097530808", "num_games_owned": 548, "num_reviews": 14, "playtime_forever": 294, "playtime_last_two_weeks": 0, "last_played": 1515157863}, "language": "english", "review": "great game to play with friends\n  \n\n\nif you have some....", "timestamp_created": 1500597427, "timestamp_updated": 1500597427, "voted_up": true, "votes_up": 7, "votes_funny": 9, "weighted_vote_score": "0.568546", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33627378": {"recommendationid": "33627378", "author": {"steamid": "76561197995301751", "num_games_owned": 349, "num_reviews": 18, "playtime_forever": 13, "playtime_last_two_weeks": 0, "last_played": 1505444369}, "language": "russian", "review": "This game is amazing.", "timestamp_created": 1500375165, "timestamp_updated": 1500375165, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33473329": {"recommendationid": "33473329", "author": {"steamid": "76561197997704232", "num_games_owned": 225, "num_reviews": 22, "playtime_forever": 197, "playtime_last_two_weeks": 8, "last_played": 1516233527}, "language": "english", "review": "Great game for some local multiplayer sessions,\nI love how you can spice it up with your own victory phrases for that small bit of extra bantz.\nGet some friends together and try the demo, it even comes with online multiplayer.", "timestamp_created": 1499842978, "timestamp_updated": 1499843185, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.496464", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33424695": {"recommendationid": "33424695", "author": {"steamid": "76561198036461907", "num_games_owned": 332, "num_reviews": 34, "playtime_forever": 129, "playtime_last_two_weeks": 0, "last_played": 1495858418}, "language": "english", "review": "Backed it on Kickstarter. Fun game, interesting mechanic, gets dull over time but holds up well enouch. Online multiplayer is a bit dead though. Grab 3 friends and you're good to go. Great for parties.", "timestamp_created": 1499672412, "timestamp_updated": 1499672585, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33113671": {"recommendationid": "33113671", "author": {"steamid": "76561198140330102", "num_games_owned": 127, "num_reviews": 22, "playtime_forever": 682, "playtime_last_two_weeks": 3, "last_played": 1516384880}, "language": "koreana", "review": "[h1]맵만 보이는 상태에서 벌어지는 깽판[/h1]\nQ. 이 게임을 할 때 가장 긴장감을 느꼈던 때는 언제입니까? 적의 총알이 날아올 때?\nA. 아뇨 서로 부딪혔을때요\n\n인비지건 히어로즈는 너도 나도 캐릭터인식장애에 걸린 상태로 적을 찾아 없애는 게임입니다.\n기본적으로 자신의 캐릭터를 포함한 적 캐릭터가 보이지 않습니다.\n처음에는 이 시스템에 대해 많이 의문을 품었습니다.\n' 캐릭터가 안보이면 자신이 총알에 맞아죽는지 안죽는지 모를 거 아니야? 그럼 긴장감이 있기는 한건가? '\n실제로도 게임을 시작해보니, 캐릭터가 보이지 않아 긴장감이 없었습니다.\n초반에는 말이에요.\n\n그런데 적응하니까 나름 괜찮아지더라고요. \n' 어 이게 맞으려나? 맞으려나? '\n라는 생각이 들어 긴장감있게 즐겼던 것 같습니다. 특히 적응할수록 자신의 캐릭터의 위치를 가늠하기 쉬워져서....\n\n일단 서로의 캐릭터가 안보인다는 이유때문에 진입장벽이 좀 높습니다. 만약 구매하실 생각이라면 데모부터 해보시는 것이 좋다고 생각되네요.\n게임에 적응하고 싶으신 분들을 위한 팁.\n\n1. 위치가늠하기 힘들어하시는 뉴비분들은 총 자주 쏘며 다니세요.\n    자신의 위치를 알리는 것은 안좋지만 자신의 위치를 모르는 것이 더 안좋습니다.\n    동시에 적 캐릭터와 지형지물의 상호작용을 유심히 살펴보시고 적의 위치도 가늠하세요.\n    적이 가까이 왔다 싶으시면 총 쏘는 걸 잠시 멈추시고 기회를 노리세요.\n\n2. 캐릭터는 프로테우스를 추천합니다. 일단 특수기술(c키)이 적의 위치를 가늠하는 데 도움이 되고, 상대방의 행동에 제약을 줄 수도 있어요.\n\n3.  초보분들은 되도록이면 수풀, 물등. 서로의 위치를 가늠하기 쉬운 오브젝트들이 많은 맵을 고르세요. \n\n진입장벽만 넘기면 나름대로 즐길만한 작품이라고 생각합니다.\n스팀평가중 부정적 평가를 보면 [strike]짱깨들의 중국어안됨, 중국어 서버없음(한국은 있음)투정과[/strike] 멀티플레이 매칭잡기 힘들다가 주를 이루고 있습니다. 게임성자체는 크게 문제 없다고 보셔도 좋아요.\n\n정말 중요한 참고사항 하나 말씀드리자면\n데모버젼에서 온라인이 가능합니다!\n이 게임 없는 친구분께 데모 설치하라고 하고 같이 멀티를 즐길 수 있습니다.\n다만, 친구분은 제한이 약간 걸린다는게 흠.\n\n장점\n+참신함.\n+다양하고 독특한 맵들과 기믹들\n+데모로도 멀티 가능.\n단점\n- 매...칭...이...안...잡...혀 (인디게임이다보니 인지도의 차이가..)\n- 죽은 뒤에 관전할 때 할 게 없음. 최소한 캐릭터들의 위치라도 표시해줬으면 좋겠는데...\n- AI가 좀 멍청함. 그리고 서바이벌 모드이외의 AI가 전혀 만들어져 있지 않음.\n\n평점은 7/10", "timestamp_created": 1498968198, "timestamp_updated": 1509264681, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.583333", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33001472": {"recommendationid": "33001472", "author": {"steamid": "76561198002540828", "num_games_owned": 251, "num_reviews": 34, "playtime_forever": 443, "playtime_last_two_weeks": 0, "last_played": 1508723593}, "language": "english", "review": "This innovative little gem has been polished to perfection! Packed with cleverly designed content that's as charming as it is remarkable. Every game mode, character and planet is truly unique. \n\nThe core game play of invisible gunslingers is brilliantly entertaining. It allows you to play fast and furious, or slowly and carefully, all the while keeping an eye out for clues. You'll find yourself alternating between, stalking prey like some kind of alien or predator, and blindly firing like a panicked colonial marine. Good times!\n\nThey even offer a free demo. This allows anyone who owns the game to host their friends for free. I'm really looking forward to playing this with all my friends. And if you only fly solo, the very capable bots ensure you can still experience all the game has to offer.\n\nEdit: We've had a lot of fun with online multiplayer, but unfortunately, we've also had a lot of trouble with it. Same screen and single player work great, so I still recommend this game.", "timestamp_created": 1498757773, "timestamp_updated": 1499304070, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.571429", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32839391": {"recommendationid": "32839391", "author": {"steamid": "76561198298894078", "num_games_owned": 41, "num_reviews": 3, "playtime_forever": 82, "playtime_last_two_weeks": 0, "last_played": 1498583509}, "language": "english", "review": "i like it", "timestamp_created": 1498531189, "timestamp_updated": 1498531189, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.375121", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32819848": {"recommendationid": "32819848", "author": {"steamid": "76561198206242073", "num_games_owned": 40, "num_reviews": 5, "playtime_forever": 20, "playtime_last_two_weeks": 0, "last_played": 1498561931}, "language": "schinese", "review": "等待一个可以联机的玩……", "timestamp_created": 1498492271, "timestamp_updated": 1498492271, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502841", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32741894": {"recommendationid": "32741894", "author": {"steamid": "76561198256936634", "num_games_owned": 109, "num_reviews": 2, "playtime_forever": 7746, "playtime_last_two_weeks": 0, "last_played": 1510110598}, "language": "english", "review": "it's fucking fun", "timestamp_created": 1498335263, "timestamp_updated": 1498335263, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.379444", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32703992": {"recommendationid": "32703992", "author": {"steamid": "76561198131222869", "num_games_owned": 87, "num_reviews": 3, "playtime_forever": 190, "playtime_last_two_weeks": 0, "last_played": 1490929600}, "language": "english", "review": "More people need to get this game because it's pretty fun to play with friends", "timestamp_created": 1498263883, "timestamp_updated": 1498263883, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.576462", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32700282": {"recommendationid": "32700282", "author": {"steamid": "76561198044045532", "num_games_owned": 107, "num_reviews": 3, "playtime_forever": 299, "playtime_last_two_weeks": 1, "last_played": 1516419356}, "language": "english", "review": "Good luck finding a match online, if you have friends however, it's choatic as all hell and a blast to play. But if you don't have friends, don't fret, there's a Invisigun Heroes Discord server.", "timestamp_created": 1498255925, "timestamp_updated": 1498255925, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.494166", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32422338": {"recommendationid": "32422338", "author": {"steamid": "76561198150020976", "num_games_owned": 176, "num_reviews": 4, "playtime_forever": 233, "playtime_last_two_weeks": 0, "last_played": 1498702213}, "language": "english", "review": "Visuals: Prettier and more polished than 99% of games on the marketplace, In-game and GUI.\n\nSound: Music is 10/10, Sound effects are 10/10.\n\nGameplay: Tight controls, bomberman mind games, low skill floor + infinite ceiling.\n\nCons: Low playerbase at the moment.. I'm guessing none of the budget went into marketing. Matchmaking doesn't work very well. Either you have to participate on the Discord server or play locally.", "timestamp_created": 1497493766, "timestamp_updated": 1497493766, "voted_up": true, "votes_up": 49, "votes_funny": 1, "weighted_vote_score": "0.780044", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32209656": {"recommendationid": "32209656", "author": {"steamid": "76561198342040403", "num_games_owned": 53, "num_reviews": 7, "playtime_forever": 107, "playtime_last_two_weeks": 0, "last_played": 1506645084}, "language": "schinese", "review": "我是谁？我在哪里？诶？他怎么死了？诶？我怎么死了？", "timestamp_created": 1496703521, "timestamp_updated": 1496703521, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.553520", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32055701": {"recommendationid": "32055701", "author": {"steamid": "76561198103560092", "num_games_owned": 19, "num_reviews": 4, "playtime_forever": 851, "playtime_last_two_weeks": 0, "last_played": 1513146576}, "language": "schinese", "review": "一款非常不错的友尽游戏！\n像素的风格，不同的技能，各具特色的地图，还有好听的BGM。\n最多支持四人对战，可以同屏，也可以联机。\n这个游戏最大的乐趣就是和朋友们一起玩，还能说骚话×。我个人是比较喜欢同屏对战的，隐身起来都不知道自己杀了谁（经常出现WTF的场面。对于模式上，我更喜欢站点模式，因为这个模式简直打得眼花缭乱，而这样才更刺激！\n但是！但是！但是！\n如果你是单机玩家，请不要购买这个游戏！\n因为这个游戏的单机模式十分无聊。特别无聊。\n所以这游戏仅适合友尽使用。\n\n要是五星评测的话，我只能给三星半吧。", "timestamp_created": 1496119221, "timestamp_updated": 1496119221, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31732208": {"recommendationid": "31732208", "author": {"steamid": "76561198048947685", "num_games_owned": 87, "num_reviews": 1, "playtime_forever": 51, "playtime_last_two_weeks": 0, "last_played": 1499773740}, "language": "english", "review": "great fun game, it just needs more player, i really hope more people will join in, the game really deserves it", "timestamp_created": 1494705412, "timestamp_updated": 1494705412, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31503151": {"recommendationid": "31503151", "author": {"steamid": "76561198014860305", "num_games_owned": 140, "num_reviews": 3, "playtime_forever": 833, "playtime_last_two_weeks": 0, "last_played": 1506379043}, "language": "english", "review": "*Classic \"I rarely write reviews intro\" playing*\n\nWhile game concept and mechanics might look simple, it creates a lot of room for tactics and action. Depending on players this game can be played differently. Sometimes you sneak and crawl trying to hunt down your enemy, sometimes it's a frenzy where everyone randomly shoots and person who decided to sneak up on behind rekts all other players. All characters have different abillities ranging from simple ones (jump, dash) to more complex ones. Depending on  your playstyle you would find character which fits you best. \n\nMe and my friends often try different party games, but this one was the biggest hit for us so far. It creates a lot of fun and excitement. Reminds me of Bomberman games a lot. \n\nPros:\n\n- Great visuals\n\n- Great sound and music\n\n- Great gameplay\n\n- Lots of content (55 maps as I post this review, 8 characters, 8 game modes)\n\n- Great replay value solo and with friends.\n\n- Easy-to-learn-hard-to-master makes it a good choice for a party game\n\nCons:\n\n- Hard to find online match, however game was never ment to be an online experience, i guess. It can change later, as devs introduced \"guest edition\" of the game i.e. demo with online multiplayer.\n\nNonetheless, there's discord chat for game, where you can find people playing. \n\nOverall the game is great and probably my best purchase in years. Trully a gem of local multiplayer. \n\nWish devs luck with the project and looking forward to new stuff!", "timestamp_created": 1493718717, "timestamp_updated": 1493718717, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.555393", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31212365": {"recommendationid": "31212365", "author": {"steamid": "76561198118711994", "num_games_owned": 36, "num_reviews": 3, "playtime_forever": 103, "playtime_last_two_weeks": 0, "last_played": 1506741108}, "language": "english", "review": "This game is very similar to bomberman with a nice twist to the invisibility. I honestly think this is the next level of bomberman whereas the switch version of bomberman left a lot of room for improvement. \n\nI do wish this game picks up 8 players one day.", "timestamp_created": 1492490846, "timestamp_updated": 1492490846, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.543568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31163276": {"recommendationid": "31163276", "author": {"steamid": "76561198220223668", "num_games_owned": 97, "num_reviews": 49, "playtime_forever": 350, "playtime_last_two_weeks": 0, "last_played": 1498240200}, "language": "english", "review": "Hmm, I'm a bit torn on this one. I actually backed it on Kickstarter last year, because it's a fun idea...Bomberman meets the indie trend in  one-hit multiplayer battle games (Samurai Gunn, TowerFall, etc.), plus its own unique set of mechanics. That sounded cool, so I was glad to support the game. In execution, however, Invisigun Heroes isn't quite as polished as I would have liked. The battle arenas are a little too cluttered and claustrophobic, so you can't really \"hunt\" your opponents in the way that I was hoping for. The arenas are really meant for just two players, I feel, and didn't have the room to skulk around and plot your attack against three other players. The character portraits are so awesome and stylish, but the actual sprites are kind of generic and don't have much personality to them. The unique character powers are pretty good, but the basic ones are way too simple, in my opinion...everybody should really have had the ability to jump and dash. That's just a personal observation, though. What's much more significant is the fact that online multiplayer is basically dead. I can't find a public match to save my life. The search client just sits there forever, trying to track down public games that probably don't exist.\n\nI'm still going to give this a recommended review, strangely enough. The game is certainly fun for what it is. There are some cool game modes and local multiplayer is nice in small doses. If your gaming group enjoys co-op battle games, this is worth picking up on sale. It's not as great as a lot of other games in the genre and it's not going to replace Samurai Gunn for me and my group, but that doesn't mean it's a terrible game by any means. If you've put those other, better games through their paces and you want something new, this game's invisibility mechanic and unique design decisions will be worth a few laughs. I know this isn't the most compelling recommendation in the world, but I think that sometimes it's okay to say, \"this is a decent game that has some fun moments even if it isn't flawless or uniformally spectacular.\" I don't regret backing the game at all, but I do think it could have been a bit richer than it is.\n\nHowever, do NOT get this game if A) you're looking for a single player experience, or B) you want to get in on some online multiplayer action, because there's just nothing happening on that front. You should think of this as *purely* a local co-op game.", "timestamp_created": 1492284619, "timestamp_updated": 1493155421, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.541341", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31112819": {"recommendationid": "31112819", "author": {"steamid": "76561198016876102", "num_games_owned": 663, "num_reviews": 44, "playtime_forever": 37, "playtime_last_two_weeks": 0, "last_played": 1492072744}, "language": "english", "review": "1.The game does not support chinese server. understandable but also a reasonable excuse for refund.\n2.Apparently this game currently has no online player. I set the region and gametype to all and searched for a long time, no host found. As a multiplayer game it's quite critical to have a active player base, while i can not blame the devs for nobody playing their game, as a player I had to refund it since it's multiplayer mode is unplayable.\n\nThe game it self is quite a piece of work and I can see the hardwork devs put in, very well polished, but the core game mechanism just dont work. Making the player character invisible is a underwheming desigh choice, it led to more frustration than fun.\n\ninb4 gitgud--a casual game is always better than a deadgame.", "timestamp_created": 1492075218, "timestamp_updated": 1492075218, "voted_up": false, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.313460", "comment_count": "10", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31105522": {"recommendationid": "31105522", "author": {"steamid": "76561198072354087", "num_games_owned": 64, "num_reviews": 3, "playtime_forever": 67, "playtime_last_two_weeks": 0, "last_played": 1488066864}, "language": "english", "review": "Wonderful inventive couch co-op game. A friend and I had loads of fun playing. I will say, yes I do recommend this game but please know that though it has online infrastructure, there is almost no-one in EU playing it. Maybe we need it to come to switch, or PS plus because this is a travesty that no-one is playing it. P.S ty TB for the recommendation.", "timestamp_created": 1492034434, "timestamp_updated": 1492034434, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.543568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31002020": {"recommendationid": "31002020", "author": {"steamid": "76561197993717768", "num_games_owned": 423, "num_reviews": 17, "playtime_forever": 474, "playtime_last_two_weeks": 0, "last_played": 1500151833}, "language": "english", "review": "Gives me Bomberman tingles but with the modern day sensibilities and style of something like Towerfall. For me though, this trumps both due to its plethora of game modes, maps, unique and diverse characters and, ultimately, the ribbon that ties it all together: the invisibility.\n\nIn Invisigun Heroes it's about reading your foes and anticipating their position; looking and listening for subtle cues -- footsteps in the sand/snow, splashes in the water, impact thuds against walls; cooking up strategies with your hero for the mode and map you're on; snagging pickups to aid your chances of success. Sometimes it's good to just stand still and use your senses to pinpoint players and make a surgical strike, other times you'll need to just use your intuition and bulldoze in there.\n\nIt blows my mind that this was made by one guy because it's so polished with a cracking little tutorial, field guide and hero profiles, a snappy UI as well as beautiful pixel art and a fittingly pulsing arcade soundtrack (Shadi Muklashy worked on the HAWKEN soundtrack which was also great). Gah, Invisigun Heroes deserves much more love.\n\nAdd to all this that it's got online and local multiplayer as well as a LAN/private IP mode and you're looking at a dynamite package for party play. I've only played locally and it was a total blast, but I hear that the Discord channel is the place to go to arrange online games.\n\nFor £11 it's a no-brainer if you're partial to some good ol' fashioned multiplayer arcade action.\n\nOh, and it's not exactly a game for solo play. There's a single-player challenge mode which is good to cut your teeth on, but it's best enjoyed against real people.", "timestamp_created": 1491589055, "timestamp_updated": 1491589055, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.688136", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30918619": {"recommendationid": "30918619", "author": {"steamid": "76561198377454738", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 2997, "playtime_last_two_weeks": 0, "last_played": 1496533035}, "language": "english", "review": "I LOVE playing this game!!!  The fact that you're invisible (except for when you shoot, use your special ability, or bump into objects on the map) makes every kill you feel OH SO GOOD and when someone takes you out, you want revenge, that much more!!  <3 <3 <3", "timestamp_created": 1491210236, "timestamp_updated": 1491210236, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.599649", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30725360": {"recommendationid": "30725360", "author": {"steamid": "76561198054006778", "num_games_owned": 241, "num_reviews": 10, "playtime_forever": 336, "playtime_last_two_weeks": 0, "last_played": 1513985525}, "language": "english", "review": "Very fun multiplayer game, please spend your DOSH on this game, they deserve it!", "timestamp_created": 1490443354, "timestamp_updated": 1490443354, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30686625": {"recommendationid": "30686625", "author": {"steamid": "76561198009283722", "num_games_owned": 1279, "num_reviews": 63, "playtime_forever": 65, "playtime_last_two_weeks": 0, "last_played": 1490212551}, "language": "english", "review": "Product was sent to me by the developers free of charge.\n\nPros:\nInvisibility mechanic - Helped by environmental sound and visual ques, one of the more unique games you can\nget for your money for game night.\nCharacters - Each has thier own special ability and taunt phrases.\nArt - Incredibly colorful and detailed that lends itself to the games invisibility mechanic.\nSounds: Music is amazing and sound design is superb. Blassting your friends sound great.\nSet-up - No EULA, no tutorial, get right in with an X-input or D-Input controller or share a keyboard.\nStats - Track progress with a detailed achievement and stat system for single and multiplayer modes.\nContent - 5 themed planets each with 10 different maps (50 maps in total) with 7 game modes to choose from.\n\nNeutral:\nOne play challenge mode (nice bonus but nothing that will hold your interest.\nAI - A bit buggy during some objective-based game modes but otherwise decent enough.\n\nCons:\nCustomization - No extended options like you would have in Smash Bros. Melee or Towerfall for permanent powerups.\nOnline - Not a lot of people are playing and there is no proper lobby system.\n\nOverall, it's a solid game for couch game-night but wait for a patch for online to get better.\n\nMore impressions here:\nhttps://www.youtube.com/watch?v=F-2-_qdOeIA&feature=youtu.be", "timestamp_created": 1490282242, "timestamp_updated": 1490282260, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.479118", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "30627357": {"recommendationid": "30627357", "author": {"steamid": "76561198353107369", "num_games_owned": 48, "num_reviews": 1, "playtime_forever": 31912, "playtime_last_two_weeks": 710, "last_played": 1516416903}, "language": "english", "review": "Invisigun heroes is by far one of my favorite.\n\n Below I will give you reasons why you would want to buy this game and why you wouldn't. I just want to say before I do and before we delve into the facts that subjectively this is my favorite game and I implore you to at least try it. The [b]free demo version is a great place to start hop on the invisigun discord[/b] https://discord.gg/KJ88HV and test it out for yourself because unless you are stressed for time that is one of the best ways to truly see if this holy grail of a game is for you. Anyway on with the main review.\n\nVisablity \n\nWhat is the first complaint I always see? Visibility. This game is a hard at first movement is a little tricky it will take getting used too 20-30min in and you will probably have a feel for it though and its just up from there. This is a key feature of the game and adds so much depth it is ridiculous. Ears become your new main sensory organ here. You can't just take away sight for people and tell them to go nuts. That just wouldn't work. This game adds huge audio clues and having fun at this gsme in the later stages is centric around understanding this simple sound step system. Headphones are certainly reccomended for this game it does include stereoscopic sound for steps. This is very very important for understanding where others and even yourself are located. This is easy to learn but hard to master which adds a great and fun curve to climb even at the highest levels of play people don't always know where someone is because of a thing called \"vertical juking\" where you pretend to go up and then go down and the such because you can't hear the difference in audio for the Y axis it can throw the person off and force them into a situation of uncertainty.\n\nCharacters-\n\nAbility- each character has a unique ability that is centric for gaining an upper hand on your opponent. The characters ability is simple and doesn't hold enough influence to force you into a play style every character has a pretty flexible range of play styles and each character caters to some form of play style So you have options most characters abilitys are easy to understand but vary in complexity. Overall every character besides maybe Epi are very intuitive even early on where a game or two with them and you get the jist of what you can do.\nVictory and dominance assertion/comedy- As of version 1.5 each character has a unique victory stance that you/and your friends can laugh at. With 8 characters 9 confirmed characters and possibly even more options are pretty varried. \n\nPlanets- There are five planets (possibly another at some point definitely more maps though)  12 maps for each planet to a total of 60 maps.\n\nPlanet:mechanics- each  planet has a unique theme and unique mechanics for it. To avoid making this too lengthy I'll talk about one of my favorite planet and its mechanics. Arenae has a desert theme. Sand piles slowly gather in certain spots that slow down shots as they pass through to a minimum speed.  Walking through sand piles or shooting them removes them till they collect enough sand to be interacted with again. Sand tiles leave footprints when walked over and make a very unique sound. Carpets simply make a unique sound when walked on. Triggered walls are walls that either go down or up dependant on their current position when you step on the or one of many buttons located on the map. Rays of light can appear on the outskirts of maps that if walked near are blocked out thus revealing your position. Water makes a unique sound and visual when walked over but it doesn't leave any lasting marks like sand.\n\nGame modes- these are already brushed up on if you simply look at the games description. They are all pretty neat but survival is surely the classic pick that represents the game very well.\n\nPlayer base- being a single developer indie game has kept this game out of the light for too long. My original review had a complaint with finding matchs but I no longer have that problem on the discord. Randomly searching for matchs I haven't tried in a while but is starting to look promising the way we have been growing recently. I implore and highly recommend you join the discord. We are all a very polite and relaxed group of people who are almost always down to play. [b] again the link to the discord [/b] https://discord.gg/KJ88HV\n\nEarly adopting- I don't mean to sound like a hipcat but joining the discord and adding in what you think and adding constructive cool/creative ideas is always welcome and can actually change the game quite a bit. Not that many people do it so id you share your ideas you might see not only a better game but a game you can say you helped make.\n\nReplay ability- this game has great replay ability because of online and how every match is going to be unique and constantly changing there is also a bot mode and a challenge mode that you can run through which is fun but plsying against a player is always more exiting. No worry about toxic behaviour either we try to keep that at an all time low in our discord as well as canned messages while playing the match they have been designed to be pretty lacking in BM potential.\n\nMore?-If you have any questions I haven't answered here or just want more direct and in-depth personal feedback please do not even hesitate to comment.", "timestamp_created": 1489971108, "timestamp_updated": 1505152785, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.525368", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30502329": {"recommendationid": "30502329", "author": {"steamid": "76561198175304725", "num_games_owned": 77, "num_reviews": 3, "playtime_forever": 131, "playtime_last_two_weeks": 0, "last_played": 1485324237}, "language": "english", "review": "Backed it on kickstarter about a year ago, worth every penny.", "timestamp_created": 1489468924, "timestamp_updated": 1489468924, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.543568", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30478757": {"recommendationid": "30478757", "author": {"steamid": "76561198308114174", "num_games_owned": 16, "num_reviews": 3, "playtime_forever": 774, "playtime_last_two_weeks": 0, "last_played": 1513732607}, "language": "english", "review": "A fresh concept with fun graphics and gameplay", "timestamp_created": 1489349715, "timestamp_updated": 1489349715, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30477165": {"recommendationid": "30477165", "author": {"steamid": "76561198026858060", "num_games_owned": 182, "num_reviews": 4, "playtime_forever": 228, "playtime_last_two_weeks": 0, "last_played": 1489348060}, "language": "english", "review": "Really great game, amazing to sit down and play with some friends or peeps on the official discord.\nThe community is very small so you probably wont games reliably, but being active on the discord and knowing when people group up to play is a good way to play semi-regularly\n\nIts very very hard to recommend this game with how tiny its community is right now, but the game itself is amazing, so take that as you will.", "timestamp_created": 1489344583, "timestamp_updated": 1489344583, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30475053": {"recommendationid": "30475053", "author": {"steamid": "76561198052320460", "num_games_owned": 339, "num_reviews": 5, "playtime_forever": 261, "playtime_last_two_weeks": 0, "last_played": 1502651572}, "language": "english", "review": "For long I've searched for a game like Invisigun Heroes, one that takes you back to those good old bomberman times, just gathering beside one computer to outplay each other, in all good fun. Invisigun also has something new to offer, it has its own twist on this genre, the characters are invisible when you're not shooting or using an ability. This adds a competitive element to the game, so there is definitely a lot to master in this game.\n\n+ Pros \n\n- Very aesthetic pixel artstyle\n- The gameplay is involving and fast paced\n- Lots of maps to choose from, 50 maps in separated to their own zones\n- There are plenty of gamemodes to choose from, each of them interesting\n- You have 8 champions to choose from, each having their own unique ability and different playstyles\n- You can play local multiplayer and also online\n- Instant Replay is a fun feature\n- The taunts the characters make\n\n- Cons\n\n- 8 heroes is plenty for the game to feel varied, but in my opinion a few more couldn't hurt.", "timestamp_created": 1489337969, "timestamp_updated": 1489338055, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.510404", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30347410": {"recommendationid": "30347410", "author": {"steamid": "76561198039267476", "num_games_owned": 151, "num_reviews": 4, "playtime_forever": 251, "playtime_last_two_weeks": 0, "last_played": 1488763894}, "language": "english", "review": "Brillinat game, facinating concept with a ton of beautiful content", "timestamp_created": 1488755817, "timestamp_updated": 1488755817, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30341351": {"recommendationid": "30341351", "author": {"steamid": "76561198041112457", "num_games_owned": 241, "num_reviews": 1, "playtime_forever": 96, "playtime_last_two_weeks": 0, "last_played": 1487448741}, "language": "english", "review": "A very fun and unique multiplayer top down shooter. Highly recommend for playing with your friends. Also has onlince multiplayer with matchmaking.", "timestamp_created": 1488733161, "timestamp_updated": 1488733161, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30305169": {"recommendationid": "30305169", "author": {"steamid": "76561197994436004", "num_games_owned": 223, "num_reviews": 2, "playtime_forever": 19, "playtime_last_two_weeks": 0, "last_played": 1488590306}, "language": "english", "review": "Great game, really straightforward to get into but definitely will have lots to pick up on in terms of nuance. Personally I can't wait pissing off my friends in local while playing it.", "timestamp_created": 1488590502, "timestamp_updated": 1488590502, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30302433": {"recommendationid": "30302433", "author": {"steamid": "76561198066496324", "num_games_owned": 236, "num_reviews": 3, "playtime_forever": 710, "playtime_last_two_weeks": 0, "last_played": 1509064084}, "language": "english", "review": "Incredibly fun to play with friends or online. The only problem it was hard to make a multiplayer match but its fixed now. COME ONE COME ALL", "timestamp_created": 1488577328, "timestamp_updated": 1488577328, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.499956", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30294427": {"recommendationid": "30294427", "author": {"steamid": "76561197994883935", "num_games_owned": 1034, "num_reviews": 74, "playtime_forever": 30, "playtime_last_two_weeks": 0, "last_played": 1487694368}, "language": "english", "review": "Best local mp game I have ever played, period :D", "timestamp_created": 1488546578, "timestamp_updated": 1488546578, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.496451", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30265670": {"recommendationid": "30265670", "author": {"steamid": "76561198002368830", "num_games_owned": 409, "num_reviews": 11, "playtime_forever": 11, "playtime_last_two_weeks": 0, "last_played": 1488396024}, "language": "english", "review": "I'm sure it's a fun game, but they had pretty much no pr or hype before totalbiscuit made a video on it. For a game relying this much on multiplayer the matchmaking is awful due to a overcomplicated custom host system.\n\nIt's pretty much impossible to play the game online. (with strangers)\n\nEDIT:\nPS\nIf you have 4 friends to play with then the shit multiplayer system obviously doesen't matter to you. But not having a queue system still lowers the value of the game. A functional multiplayer queue would make it way easier to enjoy the game.", "timestamp_created": 1488396125, "timestamp_updated": 1488677387, "voted_up": false, "votes_up": 31, "votes_funny": 1, "weighted_vote_score": "0.468712", "comment_count": "12", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30230441": {"recommendationid": "30230441", "author": {"steamid": "76561198037041115", "num_games_owned": 86, "num_reviews": 1, "playtime_forever": 22, "playtime_last_two_weeks": 0, "last_played": 1488239227}, "language": "english", "review": "My replacement for Nidhog as far as local multiplayer game. Not dishing hard on Nidhog, but we've played the death out of it, and Invisigun Heroes promises to be a great local game with easy to learn controls.", "timestamp_created": 1488239371, "timestamp_updated": 1488239371, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.535145", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30197496": {"recommendationid": "30197496", "author": {"steamid": "76561198071698188", "num_games_owned": 97, "num_reviews": 1, "playtime_forever": 245, "playtime_last_two_weeks": 0, "last_played": 1494643361}, "language": "english", "review": "Ive only played about a couple of hours but i would recommend this game in a heartbeat. it has a wide variety of game modes and charactes to choose from, thus making replay-ability not an issue at all. like most people, i wish this game had a bigger player base, but if you have someone to play with this is not a problem, and even if you do not, there are tons to learn from this game (characters/stages/modes) and the single player mode is very chellenging to keep you playing even by yourself.", "timestamp_created": 1488119892, "timestamp_updated": 1488119892, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.581414", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30181015": {"recommendationid": "30181015", "author": {"steamid": "76561198072270271", "num_games_owned": 91, "num_reviews": 6, "playtime_forever": 3133, "playtime_last_two_weeks": 0, "last_played": 1498398729}, "language": "english", "review": "Invisigun Heroes is a game I bought after watching the gameplay trailer one time.  Much like Crypt of the Necrodancer, I could tell this concept would be very fun to me, and I was not wrong.  But I think the concept of this game would be fun to *everyone* if they would just give it a chance.  This is the most fun game I've played in a long time.\n\nFirst off, at its core this is a multiplayer competitive game like classic Bombermans or any arena fighter/shooter.  If you only like single-player games and have no friends: then Invisigun probably isn't for you.  You don't need to read anymore.  If however, you love laughing (and crying) with your friends through hilarious sets long into the night: you're almost doing yourself a disservice by not owning this game.\n\nGameplay:  The best.  The concept is easy to explain and the movement is snappy and grid-based.  Everyone is invisible, even you, but you can count steps and keep track of where you are without revealing yourself.  Shooting, using your chosen character's ability, bumping into anything accidentally, or walking through certain environments, all reveal you briefly.  There's a strong element of deception and prediction to the game.  I'll shoot a few times in a row walking forward along the bottom hallway of a map, then immediately stop and go back around a different way.  My antsy opponent will shoot down where I made him think I'd be, giving away his position.  And a few seconds later I shoot him from an angle he totally did not expect.  There are 8 characters and 50 maps right now, with 7 modes playable on every map and a lot of fun powerups.  The game is planning on having even more stuff added though.  It also supports local and online matches in any combination.  You can have only one friend over and game together on your PC and still take that lobby online to get 2 randos.  The netcode is surprisingly good for an indie game and the distances I play it at.  I have playable matches with people halfway around the world, which is more than I can say for Street Fighter V.  The only real potential flaw with the gameplay is that some stubborn players who refuse to think will just not get it.  You have to put in just a bit of effort to really enjoy this game and get decent at it.  People who won't even do that tend to (wrongly) dismiss the game as \"all luck\"\n\nGraphics:  Solid.  This has some of the best tile art and effects I've seen in a game at this resolution, no pixel out of place.  Unfortunately the character sprites themselves in-game are the weakest part of the art, but they also spend most of the game being invisible.  By contrast, their full size art on the hero profiles and character select screens looks great.  Overall it's easily some of the bext pixel art around and quite a bit more stylized and less lazy than the endless storm of lazy games on steam cashing in on the words \"pixel art\" with no effort to prey on nostalgia.  In Invisigun, clearly deliniated tiles are important to the gameplay.  And these maps would make most SNES and GBA classics jealous.\n\nSound:  Great.  Every planet has two music themes and they are all really great, bass-heavy and jammin.  The main menu theme is alright but the loop is a little short, which can get repetitive if you are waiting on it for a while.  SFX are top notch and designed very well, with positional sound based on where the invisible enemy players are and different foot steps for every type of terrain.You'll want to turn the SFX above the music and any voice chat you're using, and also wear headphones.  A combination of subtle audio and visual cues are how you will figure out the positions of your opponents by their small mistakes.  The game supports turning the music all the way off if you'd rather play your own, but you're missing out if you haven't heard all of the planet themes yet.\n\nIn summary, Invisigun Heroes is actually fun in a way that I haven't enjoyed in a while.  It's rewarding in a way that games used to be with my friends when I was growing up, with the right combination of skill and luck that everyone had fun without being too far on the luck side to be watered-down garbage like Mario Kart.  I'm not spilling over with rage when I lose in Invisigun Heroes, which is a very different feeling than many other games in my Steam library; a much better feeling.  Right now the game is still in its early days and the community is very small, but it's also friendly and not a wretched hive of scum and toxicity like your MOBA of choice.  So not only is the game fun and non-threatening, but so are the players.  I only wish the community was a bit bigger, but it'll get there.  Maybe you can help it get there?\n\n", "timestamp_created": 1488065955, "timestamp_updated": 1488065955, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.587642", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30163522": {"recommendationid": "30163522", "author": {"steamid": "76561197998876045", "num_games_owned": 481, "num_reviews": 26, "playtime_forever": 387, "playtime_last_two_weeks": 38, "last_played": 1515867388}, "language": "english", "review": "Get some people together to play this game (over voice chat or locally) and you will have an absolute blast.\n\nDon't try to go online, don't play by yourself, it is not fun for so many reasons mostly due to the way the game is designed.\n\n\nOk so my old review below is still completely relevant -> if you're just picking this up for yourself and have no one you know to play it with. If it's just for yourself it is highly unlikely that you will like it or even get to play it at all as the \"matchmaking\" is very poorly made.\n_______________________________________________________________________\nI got this game on the recommendation of total bisquit.\nTotal bisquit says that this game is amazing and with depth but it has several big issues in my opinion.\n\nI would like to state that the developer has addressed that they're working on some of the issues, and when they're fixed I will gladly pick up the game again and leave a positive review, but for now I can't recomend this game.\n\nI made a review before and the developper themselves replied that my review was misleading because of one of the cons I stated. It made me doubt my initial judgement, so I picked the game back up to see if I was wrong and to record my experience/issue so there's no doubt what I'm talking about.\n\nPros:\nPretty pixel art\nNice music \nMany stages\nSolid netcode\n\nCons:\nThe multiplayer/\"matchmaking\" system is garbage, instead of having 1 \"matchmaking\" button where it just finds the closest people who is also searching for games it has an old outdated \"Host\" and \"join\" system, where you either have to host or join to find a game. meaning for example, 2 people could be wantint to play the game, go to the join section for 5 minutes, with no luck and then both go to host, even though there are two people wanting to play they don't get to play because of the way the game is set up. This is by far the biggest issue with this game, combined with the small playerbase a game like this will naturally have, and the absurdly high pricetag you have a stillborn game. The developper says they're working on this and if this is fixed along with the price I see myself picking the game back up and I might change the review to positive.\n\nMovement IS NOT 1:1, but you have to time your presses, this causes the game to be unnesesarily unpredictable in my oppinion. The developper commented on my last review that this is untrue and misleading. I doubted myself and picked the game back up and took a video of the issue, now noone can really claim that it's misleading. seasoned players will naturally pick the timing up and will probably not even make individual key presses most of the time, but it is an unnesesarily frustrating aspect of the game especieally for a new player.\n\nPlease click this link to see what I mean: https://youtu.be/4jWZIh4zOSw", "timestamp_created": 1488019105, "timestamp_updated": 1504021354, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.469434", "comment_count": "8", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30162570": {"recommendationid": "30162570", "author": {"steamid": "76561197997580809", "num_games_owned": 185, "num_reviews": 13, "playtime_forever": 303, "playtime_last_two_weeks": 0, "last_played": 1500989858}, "language": "english", "review": "Intense, fun with friends, definetly will play more. For this price it's a ton of content as well (50 maps, 7 game modes). The level of polish and love this game must have received is astonishing. Worth a try!", "timestamp_created": 1488016188, "timestamp_updated": 1511389296, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30157542": {"recommendationid": "30157542", "author": {"steamid": "76561197984012553", "num_games_owned": 836, "num_reviews": 28, "playtime_forever": 354, "playtime_last_two_weeks": 0, "last_played": 1505059385}, "language": "english", "review": "This is an instant multiplayer classic. The references to Towerfall hold up in my opinion. It's obviously a very different game, but it's on that level. It's that good!\n\nI just played online with strangers, and it was really fun! I used their official Discord and immediately found people to play with.\n\nAs someone who gladly bought Towerfall on 3 different platforms, I wouldn't hesitate to buy this again if it came out on the Switch or for Android with gamepad support. Great game, totally worth the price.", "timestamp_created": 1487996338, "timestamp_updated": 1487996338, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497512", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30153626": {"recommendationid": "30153626", "author": {"steamid": "76561198037569377", "num_games_owned": 177, "num_reviews": 10, "playtime_forever": 219, "playtime_last_two_weeks": 0, "last_played": 1489946355}, "language": "english", "review": "Great game, just needs more players as it's hard to find a game", "timestamp_created": 1487980591, "timestamp_updated": 1487980591, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30152183": {"recommendationid": "30152183", "author": {"steamid": "76561198013931664", "num_games_owned": 172, "num_reviews": 1, "playtime_forever": 361, "playtime_last_two_weeks": 0, "last_played": 1488918965}, "language": "english", "review": "Great underappreciated game!", "timestamp_created": 1487975570, "timestamp_updated": 1487975570, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.449312", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30137146": {"recommendationid": "30137146", "author": {"steamid": "76561198002874170", "num_games_owned": 2507, "num_reviews": 56, "playtime_forever": 13, "playtime_last_two_weeks": 0, "last_played": 1488151191}, "language": "english", "review": "I'm sure it's a lot of fun. However matchmaking doesn't work.\n\nDevs.. at least start matches with bots and allow public players to join if there are that few player. :(\n\nFor an online centric game, it's basically unplayable in it's current state. Which is upsetting because it seems like a lot of fun. But not much to playing single player challenges.\n\nIF THIS IS FIXED I'LL UPDATE MY REVIEW.\n\nUpdate: Tried again today at 3pm PST on a sunday to find an online game hosted. No dice.\n\nIf it's not clear from above. I am stating that if matchmaking cannot find a game for players SEARCHING for one, it should automatically create one with bots until more players join. Otherwise players will open the client, try to find a game, and leave frusturated. That will kill this community and game quickly. I hope this is solved because this game seems really good but currently I cant play is outside of local friends.", "timestamp_created": 1487928143, "timestamp_updated": 1488151463, "voted_up": false, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.489677", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30134462": {"recommendationid": "30134462", "author": {"steamid": "76561198186808135", "num_games_owned": 21, "num_reviews": 1, "playtime_forever": 87, "playtime_last_two_weeks": 0, "last_played": 1487987253}, "language": "english", "review": "Super fun, multiplayer is top notch", "timestamp_created": 1487915247, "timestamp_updated": 1487915247, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.441401", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30111129": {"recommendationid": "30111129", "author": {"steamid": "76561198361967761", "num_games_owned": 6, "num_reviews": 1, "playtime_forever": 32, "playtime_last_two_weeks": 0, "last_played": 1492734894}, "language": "english", "review": "Only played a little bit but I can tell I'm going to be hooked.", "timestamp_created": 1487817153, "timestamp_updated": 1487817153, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.463559", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30096538": {"recommendationid": "30096538", "author": {"steamid": "76561198040822988", "num_games_owned": 169, "num_reviews": 1, "playtime_forever": 183, "playtime_last_two_weeks": 0, "last_played": 1490218843}, "language": "english", "review": "I bought this game yesterday to play with 4 friends locally and it did not dissapoint.\n\nWe played for three hours straight and were laughing, swearing and having a great time. So much so that we're already planning when we can meet up and play again.\n\nThe unique concept of everyone being invisible including yourself makes for and excellent mix of strategy and also hilarous random luck. The majority of your kills will feel earnt but every now and then you'll get a satisfying lucky shot.\n\nThe game has tonnes of levels each with unique environments and hazards that effect the gameplay. There are also 8 modes although we felt come worked better with the main concept than others. We mostly played survival as the standard hunting each other was just so much fun.\n\nAs for the online, I have a feeling that the playerbase won't be an issue for too long as the game is rapidly increasing in popularity. All 3 of the friends I played with have now bought the game and plan to play it online.\n\nI highly reccomend this game, even if you haven't got anyone to play with as it's worth the time finding a group to play with just to play this game.", "timestamp_created": 1487759197, "timestamp_updated": 1487759302, "voted_up": true, "votes_up": 19, "votes_funny": 1, "weighted_vote_score": "0.719705", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30085768": {"recommendationid": "30085768", "author": {"steamid": "76561198030912594", "num_games_owned": 74, "num_reviews": 12, "playtime_forever": 155, "playtime_last_two_weeks": 0, "last_played": 1487679615}, "language": "english", "review": "this game has a great tutorial to begin with which explains how the game works and about some of its characters.\nin total it has 8 heroes, 5 worlds with all 10 maps and 6 game modes.\nyou have single player, challenge mode, to complete maps, you have online join match mode to join any match that is happening online and multiplayer battle mode, to create your own game or to play on of the game modes against bots.\nOverall as a value proposition this game is totally worth it but unfortunatly its hard to find any online battles at the momment due to the low player base and the puzzling choice to put player in regions.\n\nI would say this game is worth checking out and buying, to se my full review and immages from the game see my video review on youtube:\nhttps://www.youtube.com/watch?v=CYLBewnh8BI", "timestamp_created": 1487706141, "timestamp_updated": 1487706141, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30071017": {"recommendationid": "30071017", "author": {"steamid": "76561197987132645", "num_games_owned": 187, "num_reviews": 7, "playtime_forever": 2498, "playtime_last_two_weeks": 0, "last_played": 1503370844}, "language": "english", "review": "This game is amazingly innovative and surprisingly polished. I could play this game for days. Strongly recommend.", "timestamp_created": 1487646256, "timestamp_updated": 1487646256, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.595725", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30063692": {"recommendationid": "30063692", "author": {"steamid": "76561198013623311", "num_games_owned": 82, "num_reviews": 2, "playtime_forever": 2069, "playtime_last_two_weeks": 0, "last_played": 1506627702}, "language": "english", "review": "Excellently fun. Looking forward to matchmaking being fixed! Can't wait to play with friends.", "timestamp_created": 1487616327, "timestamp_updated": 1487616327, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30049237": {"recommendationid": "30049237", "author": {"steamid": "76561197995209222", "num_games_owned": 105, "num_reviews": 1, "playtime_forever": 871, "playtime_last_two_weeks": 0, "last_played": 1508202477}, "language": "english", "review": "A quick to pick up, very difficult to master game. It's a lot of fun when you get a group together, but it is a bit hard to find a game normally. This game deserves a lot more exposure though, it's great fun.", "timestamp_created": 1487558729, "timestamp_updated": 1487558729, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30039904": {"recommendationid": "30039904", "author": {"steamid": "76561198133681147", "num_games_owned": 245, "num_reviews": 4, "playtime_forever": 192, "playtime_last_two_weeks": 1, "last_played": 1515440571}, "language": "english", "review": "It's good", "timestamp_created": 1487524486, "timestamp_updated": 1487524486, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30036603": {"recommendationid": "30036603", "author": {"steamid": "76561198166316793", "num_games_owned": 3, "num_reviews": 1, "playtime_forever": 609, "playtime_last_two_weeks": 0, "last_played": 1512062502}, "language": "english", "review": "This is that arcade game you can sink a hundred hours into. I hope it get more players online because it really is an addicting experience. I like it so much I want to support the developer more in some way. It is bomber man with more tactics, you either count your steps or take a chance to be aggressive and stay visible.", "timestamp_created": 1487515558, "timestamp_updated": 1487515558, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.519231", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30032760": {"recommendationid": "30032760", "author": {"steamid": "76561198027042852", "num_games_owned": 342, "num_reviews": 1, "playtime_forever": 409, "playtime_last_two_weeks": 0, "last_played": 1512246290}, "language": "english", "review": "Extremely fun, tense, and strategic experience. Just doing 1v1s with a friend we were both laughing and enjoying the **** out of this game. \n\nSometimes it's funny just to watch the clusterf*ck  when people run into each other and start panick-shooting. \n\nHighly recommended if you have friends to play with - You'll have a blast.", "timestamp_created": 1487505396, "timestamp_updated": 1487505396, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30030067": {"recommendationid": "30030067", "author": {"steamid": "76561198116370923", "num_games_owned": 363, "num_reviews": 33, "playtime_forever": 254, "playtime_last_two_weeks": 0, "last_played": 1491685074}, "language": "french", "review": "Funny but there are not enough players.", "timestamp_created": 1487497279, "timestamp_updated": 1487497279, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497512", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30029869": {"recommendationid": "30029869", "author": {"steamid": "76561197976505179", "num_games_owned": 146, "num_reviews": 5, "playtime_forever": 6, "playtime_last_two_weeks": 0, "last_played": 1487495586}, "language": "english", "review": "The idea seems great, the execution solid - but finding a match online is like winning the lottery. Game severely lacks players, which is a K.O. for such a title (except you bring your own active community of friends).", "timestamp_created": 1487496689, "timestamp_updated": 1487496689, "voted_up": false, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.339902", "comment_count": "11", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30026221": {"recommendationid": "30026221", "author": {"steamid": "76561198328800950", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 18, "playtime_last_two_weeks": 0, "last_played": 1487482623}, "language": "english", "review": "Super fun and addictive. I LOVE IT!!!", "timestamp_created": 1487482690, "timestamp_updated": 1487482690, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.499349", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30021081": {"recommendationid": "30021081", "author": {"steamid": "76561197987035209", "num_games_owned": 254, "num_reviews": 2, "playtime_forever": 336, "playtime_last_two_weeks": 0, "last_played": 1488097300}, "language": "english", "review": ".", "timestamp_created": 1487460223, "timestamp_updated": 1487460223, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.395987", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30015338": {"recommendationid": "30015338", "author": {"steamid": "76561197984508476", "num_games_owned": 125, "num_reviews": 2, "playtime_forever": 201, "playtime_last_two_weeks": 0, "last_played": 1490739727}, "language": "english", "review": "I want to lioke this game, but the matchmaking is so abysmal. The last five times I've tried to log on, I've spent at least ten minutes trying to find a match, but to no avail. It will keep trying to pair me to matches that are already started, or are already full. It's like the creators put zero thought into the matchmaking. It's super disappointing, because I really want to play this game.", "timestamp_created": 1487441916, "timestamp_updated": 1487441916, "voted_up": false, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.243651", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30008093": {"recommendationid": "30008093", "author": {"steamid": "76561198005176895", "num_games_owned": 538, "num_reviews": 5, "playtime_forever": 1351, "playtime_last_two_weeks": 0, "last_played": 1505484128}, "language": "german", "review": "IH ist ein Spiel mit Fokus auf Mehrspieler-Matches (lokal und online, mit oder ohne Bots) mit bis zu 4 Leuten gleichzeitig.\nDie Kämpfe selbst finden auf einer von derzeit 50 Maps statt, die sehr an alte Bomberman-Teile (z.B. auf dem SNES) erinnern.\n\nZur Wahl stehen, neben 7 Spielmodi, 8 spielbare Charaktere mit unterschiedlichen Fähigkeiten (z.B. Portale legen und benutzen, eine Drone losschicken oder Gegner mit einem Schwerthieb betäuben), die aber alle eines gemeinsam haben:\nSie sind während des Matches unsichtbar, solang sie nicht angreifen oder eine Fähigkeit benutzen.\n\nDas bedeutet, dass während des Großteils einer Partie weder man selbst noch die Gegner zu sehen sind, was das Ganze zu einer unter Umständen sehr hinterhältigen Geschichte werden lässt, sobald man raushat, wie die eigenen Bewegungen einzuschätzen sind und man sich so auch ohne die eigene Figur zu sehen orten kann.\nIn dem Moment verbringt man mehr Zeit damit, die Gegner zu beobachten und mögliche Wege zu finden, diese um die Ecke zu bringen, zu verwirren, ihnen Hinterhalte zu stellen usw.\n\nDas mag in Schriftform seltsam klingen - vor allem wenn die Schriftform meine ist - aber es kann einen Heidenspaß machen.\n\nALLERDINGS ist die Playerbase des Spiels noch sehr klein - und das ist die Krux an der Geschichte - sodass es aktuell schwierig sein kann, regelmäßig Online-Matches zu finden, wenn man nicht den offiziellen Discord-Channel zur Hilfe nehmen will. \nLetzterer ist voller netter Leute (noch) und hilft beim Starten von Spielen ungemein - rudimentäre Englischkenntnisse, neben Discord als Programm, sollten aber vorhanden sein um da was in Gang zu bringen.\n\nAlles in allem meine vollste Empfehlung. \nMacht unheimlich viel Spaß!\n\n- - -\n\nAch ja, einen unspektakulären Singleplayer gibt es auch. Nur um es erwähnt zu haben.", "timestamp_created": 1487422823, "timestamp_updated": 1487509679, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.504951", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30005814": {"recommendationid": "30005814", "author": {"steamid": "76561198049335194", "num_games_owned": 39, "num_reviews": 5, "playtime_forever": 319, "playtime_last_two_weeks": 0, "last_played": 1489230540}, "language": "koreana", "review": "자기 캐릭터도 안보이고 상대캐릭터도 안보이는 상태에서 혼자서 살아남는 게임입니다\n자신의 캐릭터는 자기가 방향키를 눌러서 조종하며 위치를 대충 생각하며 해야 하고, 모든 캐릭터는 벽에 닿거나 오브젝트에 닿으면 피드백이 있어 그것으로 위치를 유추할 수 있습니다\n또 총을 쏘거나 번개가 칠때마다 잠깐잠깐 모습이 보이는데 이를 통해 위치를 알아낼 수 있습니다\n캐릭터마다 텔레포트나 점프 등 특수능력이 한가지 씩 있는데 이를 통해 상대방이 자신의 위치를 예측하기 어렵게 만들거나 상대의 이동을 제한할 수 있습니다\n게임모드는 여러가지가 있는데 4명중 1명만 살아남는 서바이벌만 해봤습니다. 다른건 잘 모르겠네요\n약간 크레이지 아케이드하고 비슷한 느낌의 중독성이 있습니다. 꿀잼이니까 어서 사서 하세요.\n\n자동매칭이 있긴 하지만 아직 신작게임이라 사람이 많이 없어서 온라인을 즐기려면 디스코드 채널에서 사람들을 모아야 합니다\n아래 디스코드 채널로 오시면 세계의 다른 유저들과 수월하게 매치를 할 수 있습니다\n\nhttps://discordapp.com/invite/ycEhg2Q", "timestamp_created": 1487415915, "timestamp_updated": 1487415915, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501718", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30005505": {"recommendationid": "30005505", "author": {"steamid": "76561198184723083", "num_games_owned": 170, "num_reviews": 26, "playtime_forever": 160, "playtime_last_two_weeks": 0, "last_played": 1487763541}, "language": "english", "review": "额妹子嘤嘤嘤！！！！！ 游戏真的是超级好玩\n\n现在给差评是因为玩的人太少，这游戏如果缺少联机模式乐趣大大减少，希望推出4人包。", "timestamp_created": 1487414910, "timestamp_updated": 1487740568, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.313873", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29992192": {"recommendationid": "29992192", "author": {"steamid": "76561198023508743", "num_games_owned": 399, "num_reviews": 16, "playtime_forever": 52, "playtime_last_two_weeks": 0, "last_played": 1468741105}, "language": "english", "review": "I'm so happy to have been with this game since it's humble Kickstarter beginnings. The gameplay is a blast, and another party game with local multiplayer is always a win. The dev is fairly responsive, and actually fixes things that need fixing (not that this has happened much, even with the pre-release testing I was able to do). If you're a fan of the art style and want to have something you can play with everone in the same room, give it a shot for sure!", "timestamp_created": 1487361854, "timestamp_updated": 1487361854, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29982471": {"recommendationid": "29982471", "author": {"steamid": "76561198062735178", "num_games_owned": 507, "num_reviews": 93, "playtime_forever": 1569, "playtime_last_two_weeks": 0, "last_played": 1505212290}, "language": "schinese", "review": "该游戏像素风, 画面精致 细腻, 比较讲究技术, 每个角色技能不同, 除动作时一般都是隐形, 然后配合技能 道具和地形教人作人.\n\n当你准备玩这个游戏时 请保持耐心 请保持耐心 请保持耐心, 因为没有耐心一般都会流失, 没找到游戏的乐趣, 刚进游戏时一般都难上手(心算+操作帝 除外), 但当你上手 习惯这个游戏时, 你就发现自己 简数心算, 即时记数 等感知能力升级, 可以愉快的饲笔, 为了让新人更快的上手, 这里给出一些个人建议, 希望对各位有帮助:\n\n初玩时: 学着一步一下的敲键盘, 然后学着1至2 的心数每一步, 慢慢来 可以更快的找到感觉, 会发现几乎能走到你想走的位置.\n\n入门时: 学着1至n(10)的心数每一步, 学着计算目的地的步数, 习惯起来几乎能快速走到每个地方.\n\n至于进阶,高级等技巧就留给大家研究了(其实我是新人-.-), 希望有更多上手的玩家, 毕竟都会玩对撕才更激烈哈.", "timestamp_created": 1487332315, "timestamp_updated": 1505027928, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.490291", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29974626": {"recommendationid": "29974626", "author": {"steamid": "76561198051575594", "num_games_owned": 95, "num_reviews": 5, "playtime_forever": 765, "playtime_last_two_weeks": 0, "last_played": 1487631322}, "language": "english", "review": "This game is absolutely stunning and original. The concept of playing as an invisible character leads to a lot of interesting strategies, and keeping track of myself is a challenge that I've never experienced in a game before. The wide variety of modes, maps, and playable characters, not to mention bots and the single player challenge mode, add enough content to fully warrant the $15 price tag. I particularly like how many stage gimmicks there are that really change the game around. My favorite so far has to be the lightning which briefly reveals all players. The sound and art are also amazing. In particular, the visual distortion effects are superb.\n\nMy only real negative is the lack of an online player base. It's difficult to find matches, and there usually aren't any at a given time. You can host your own matches, and it doesn’t take too terribly long to find somebody, but waiting for a third and fourth person would probably take a while. I think that if the menu was cleared up to prominently feature a \"Host Public Match\" button right next to the \"Join Public Match\" button, or if a player matchmaking queue was implemented, this problem could probably be mitigated to some extent. I don't entirely buy that the lack of online activity is due to lack of player interest. Also, there's always the public discord server for finding matches if you want to go the extra mile, but that is in no way a permanent solution. Hopefully this problem can be resolved, because this is certainly a spectacular game.\n", "timestamp_created": 1487295373, "timestamp_updated": 1487295373, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29972960": {"recommendationid": "29972960", "author": {"steamid": "76561197980673891", "num_games_owned": 177, "num_reviews": 4, "playtime_forever": 11, "playtime_last_two_weeks": 0, "last_played": 1487287527}, "language": "english", "review": "Bought the game because of TB, Game is awesome, Just no Online matches to be found. Other than that, game seems like it will be a lot of fun!", "timestamp_created": 1487287607, "timestamp_updated": 1487287607, "voted_up": true, "votes_up": 22, "votes_funny": 0, "weighted_vote_score": "0.642501", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29969503": {"recommendationid": "29969503", "author": {"steamid": "76561197988473771", "num_games_owned": 135, "num_reviews": 2, "playtime_forever": 80, "playtime_last_two_weeks": 0, "last_played": 1489592560}, "language": "english", "review": "Awesome Game!\n- Easy to learn hard to master\n- Great amount of maps and game-modes.\n- Very fun in local, as well as online- multiplayer\n- Hectic and tactical gameplay, that gets you thinking", "timestamp_created": 1487274171, "timestamp_updated": 1487274171, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.487288", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29958516": {"recommendationid": "29958516", "author": {"steamid": "76561198033488550", "num_games_owned": 360, "num_reviews": 30, "playtime_forever": 145, "playtime_last_two_weeks": 0, "last_played": 1500814690}, "language": "turkish", "review": "A very nice Bomberman inspired game.", "timestamp_created": 1487237658, "timestamp_updated": 1487237658, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29931239": {"recommendationid": "29931239", "author": {"steamid": "76561198125439172", "num_games_owned": 46, "num_reviews": 2, "playtime_forever": 800, "playtime_last_two_weeks": 0, "last_played": 1497734037}, "language": "english", "review": "I was an early alpha backer of this game, having known the dev Shadiradio from his previous game, Hawken.  It's been a ton of fun playing and watching and learning.  The gameplay are fantastic and tricky, allowing for so many possibilities.  Invisigun Heroes is sneakily disguised as a couch party game for 4 people but has immense depth and potential to be so much more competitive and serious if you spend enough time in the game.  I've never found such a cerebral top down pixel shooter.\n\n10/10, would buy again. Oh, and the art and music for this game is top notch.", "timestamp_created": 1487117238, "timestamp_updated": 1487117327, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.630323", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29929251": {"recommendationid": "29929251", "author": {"steamid": "76561198025400260", "num_games_owned": 363, "num_reviews": 3, "playtime_forever": 157, "playtime_last_two_weeks": 0, "last_played": 1494982767}, "language": "french", "review": "Quel beau jeu à jouer pendant une fête ou un rassemblement d'amis! C'est coloré, c'est tendu, les contrôles réagissent bien! Je le recommande!", "timestamp_created": 1487108390, "timestamp_updated": 1487108390, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497512", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29918181": {"recommendationid": "29918181", "author": {"steamid": "76561197968186908", "num_games_owned": 500, "num_reviews": 11, "playtime_forever": 38, "playtime_last_two_weeks": 0, "last_played": 1486776595}, "language": "english", "review": "We bought it as it was touted as \"A mix of towerfall and bomberman\" ...sadly its neither of these things.\n\nWe played it 4 player local multiplayer, for about an hour. It's frustrating, boring, and when people do get killed/you win it's ultimately anticlimactic.\n\nArt style is nice, ui is nice, audio is good, engine runs well, but the core \"hook\" of the game just isn't that great - and that's the most crucial part.\n\nIt's definitely not worth £10.99, so I refunded it. If it was £1.99, it might have been worth keeping for the occasional knock about, but for the time being: stick with Towerfall or Bomberman, don't bother with Invisigun Heroes.\n\nShame really, thought this was going to be a good one.", "timestamp_created": 1487069132, "timestamp_updated": 1487069132, "voted_up": false, "votes_up": 15, "votes_funny": 2, "weighted_vote_score": "0.140365", "comment_count": "9", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29911569": {"recommendationid": "29911569", "author": {"steamid": "76561198028157131", "num_games_owned": 364, "num_reviews": 9, "playtime_forever": 649, "playtime_last_two_weeks": 0, "last_played": 1491265126}, "language": "english", "review": "This game absolutely rekindles the kind of excitement one expects when playing [insert-your-favorite-single-screen-multiplayer-game-here] with a handful of buddies. The thrill of getting inside your opponents' heads to outwit them is strong in this one. The controls are really simple, and the game is super easy to learn and understand (even with plenty of characters and maps to learn), but becoming GOOD at it is definitely a challenge. If you're asking me, it's worth your time and money. I mean, if you like fun and joy, and all.\n\nAlso, you can create your very own victory phrases for whenever you win a round. Dunno about you, but that makes me giddy.", "timestamp_created": 1487031658, "timestamp_updated": 1487031658, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29911445": {"recommendationid": "29911445", "author": {"steamid": "76561198040461921", "num_games_owned": 229, "num_reviews": 14, "playtime_forever": 770, "playtime_last_two_weeks": 0, "last_played": 1489021451}, "language": "english", "review": "I can't recommend this game enough, online top-down stealth shooter with fantastic visuals and sound. multiple game modes to keep you active online as well as local, local/online, and a single player challenge mode just in case. Multiple characters all with their own abilities add flavor and style, and from what I've been hearing possibly another character in the future. Get this while it's hot, and stick around so the player base doesn't take a flip. Game has a lot to offer, and will definitely keep me playing for a hot minute. Has a few bugs but the devs are still working on it, and from what I've seen they're not big enough to complain about. Only thing I can ask for, is tournaments and a 2v2 option. Go invisible, snipe your friends in the back, and GET THIS GAME so you can do so. OH! and you can put in your own custom phrases for the characters to say at the end of each round, just because.", "timestamp_created": 1487030977, "timestamp_updated": 1487035588, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.565217", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29910958": {"recommendationid": "29910958", "author": {"steamid": "76561198094957635", "num_games_owned": 53, "num_reviews": 3, "playtime_forever": 516, "playtime_last_two_weeks": 0, "last_played": 1509045778}, "language": "russian", "review": "[b] Данную игру я рекомендую для людей,  готовых к открытому общению и желающих поработать своими мозгами. Так же я НЕ советую её тем, кто остерегается или избегает иностранных людей по различным причинам и тем, кто уже свыкся с онлайн играми крупных разработчиков, у которых нажав кнопку \"Найти игру\" программа все делает за вас. Ниже я объясню причины того, почему данная игра не придется по вкусу всем или даже большинству. [/b]\n\nВы играете против 1-3 игроков за персонажа, который является невидимым. Невидимость раскрывается на пару секунд если вы стреляли или использовали свою уникальную способность, которая для каждого персонажа своя. Ваша задача не потеряться в ориентации в пространстве, т.к. вы не видете как себя, так и противников; следить за подсказками, которая дает игра о вашем нахождении и нахождении других игроков (звуки шагов, шевеление кустов, на снегу появляются отпечатки, стены, в которые врезаются игроки, подсвечиваются); не ошибиться самому  и не выдать свое местоположение, потому что одна ошибка может стоить вам жизни. [b] В этой игре если вы словите хоть один выстрел - вы умерли [/b]; за каждого персонажа каждый игрок может выработать свою тактику игры: кто-то играет агрессивно, кто-то играет в защиту, кто-то играет в контроль карты. Все зависит от вас, вашей изобретательности, способности быстро мыслить и предугадывать действия противников. \nВсе это сопровождается приятной музыкой и пиксельной графикой, а так же живым общением с людьми по интересам, а иногда и с разработчиками, и обсуждением впечатлений на общем сервере в дискорде.\n\n\nСражу скажу о двух недостатках:\n[olist]\n[*] Поиск игроков нужно проводить общаясь с людьми напрямую. В игре не имеется автоподбора игроков и кто-то должен выступить в роли Хоста, а другие люди к нему подключаются.\n[*] Второй недостаток вытекает из первого и он заключается в пинге. Если у хоста не очень хороший провайдер и между вами имеется расстояние больше, чем между соседними улицами, то пинг все-таки отражается на игровом процессе.\n[/olist]\n\nЭти недостатки значительно скажутся на количестве желающих в первое время, пока число игроков не возрастет достаточно, чтобы у создателей игры имелся смысл держать сервера с автоподбором игроков.  Одна из причин этому - англоязычное сообщество. Не все владеют английским языком на достаточном уровне по различным причинам (либо же сами не верят в то, что нормально знают), и языковой барьер становится проблемой - чтобы собрать людей вам с ними необходимо поговорить лично и многие желают так же разговаривать с вами в процессе игры.\n\nНо в свою очередь это становится своего рода одним из плюсов данной игре, о которых я сейчас расскажу.\n\n[olist]\n[*] Из личного опыта, люди, собирающиеся на парочку матчей, достаточно лояльны друг к другу, образованны и с ними приятно общаться во время матчей. Если вам с кем-то понравилось играть, то вы можете сыграть с ним в любое другое время, легко найдя его вновь на сервере дискорда.\n[*] Желающие подтянуть свой разговорный язык могут это сделать в данной игре, т.к. все с пониманием относятся к вам и ничего от вас не требуют. Общение происходит на доступном уровне и организовывается своего рода товарищество.\n[*] По самой игре, приятная музыка и графика.\n[*] Игровой процесс, который не требует от вас огромного количества времени. Все матчи проходят довольно быстро, до 20-30 минут при четверых игроках и до 10 минут 1на1.\n[*] Сбалансированная и честная игра. Все персонажи доступны вам сразу, их не надо открывать и все по своему уникальны. \n[*] Огромное количество карт с различными препятствиями, погодными условиями, бонусами, которые влияют на ход игры и каждый раунд не похож на предыдущий.\n[*] Несколько игровых режимов.\n[*] Последнее, но не менее важное - удовольствие, которое получаешь от игры. Не зависимо от того, обыграл ты противника, или он тебя - игра не напрягает и всегда можно посмеяться с глупых ошибок.\n[*] Этот пункт еще не в силе, но общаясь с разработчиками я узнал, что скоро будут введены стимовские карточки и разработчики уже занимаются этим вопросом. Так  же в процессе создание новых героев.\n[/olist]\n\n\nНа этом и заключается обзор данной игры. Если вам все же захочется дать шанс этой игре и опробовать ее, милости просим. Наше сообщество всегда радо новым игрокам и готовы помочь в освоении игрового процесса. \nНадеюсь, что мой обзор был для вас полезен.", "timestamp_created": 1487028141, "timestamp_updated": 1487028473, "voted_up": true, "votes_up": 26, "votes_funny": 1, "weighted_vote_score": "0.760074", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29909052": {"recommendationid": "29909052", "author": {"steamid": "76561198011496847", "num_games_owned": 508, "num_reviews": 33, "playtime_forever": 494, "playtime_last_two_weeks": 0, "last_played": 1493739442}, "language": "japanese", "review": "Invisigun Heroesとは！\nステルスとシューティングを組み合わせた全く新しい対戦シューティンｇ…いやこれだとそーでもないな。\nいやしかし、このゲームのステルスっぷりはただ事ではありません。なんとみんな完全透明になってしまうのです…そう、自分が操作するキャラすらも！\n\n[h1]見逃すな　その足跡が　命取り[/h1]\nさて、先に述べた通り、敵も自機もゲーム開始時点で透明になります。\nじゃあどうやって自機の位置を確認したり索敵するのかと申しますと、こんな感じ。\n[list]\n[*]足音\nざっくりとですが相手の位置を掴めます。\n[*]地形の変化\n砂地や水場を歩くと波紋や足跡が出現します。また不可視中でも光は遮られるため、日照のある窓に近付くと陰ったりします。\n[*]壁との接触\n壁などの移動阻害地形に触れるとその壁にエフェクトが発生します。\n[*]他プレイヤーとの接触\n他のプレイヤーと触れると双方一瞬不可視が切れ、更に少しの間行動不能になります。\n[*]攻撃\nショットを撃つ際に一瞬不可視が切れます。\n[*]特殊能力の使用\n各キャラ固有の特殊能力を使う際に不可視が切れます。\n[*]一部対戦ルールのシステム\n一部の対戦ルールでは、勝利条件を満たそうとすると不可視が切れたり、あるいは非常に現在位置が判り易くなります。\n[/list]\nそのほか移動速度は一定なので、記憶力と操作精度さえ完璧ならば、自機の位置は常に特定可能です（※かなり難しい）。\nさて、彼我の位置関係がはっきりしたらショットを撃ちましょう。一発当てれば相手は容赦なく白骨化し死亡！　逆に当てられたら自分がスケルトン！　大変判り易い命のやり取りに震えが止まりません。\n\n[h1]さあ選べ　マップにルール　キャラクター[/h1]\nこのゲームには7つの対戦ルールと8人のキャラクター、そして滅法沢山の対戦マップが存在します。\n\n他プレイヤーを全滅させて既定のラウンド数を先取するSurvival、特定の領域に一定時間とどまるZone Controlといった判り易いものから、マップ全域にランダムに現れる魔物の近くに留まり、地中に返すことで出現するコインを集めるBeast Tamer、某スプラなんとかのように地面を自分のカラーで染め（ただし染める方法はタイル上を歩くことのみ）、ゲーム終了時に最大面積を塗ったプレイヤーが勝利するLand Grabといった捻りの利いたルールもあり、更にマップは矢鱈滅多に数があるため、毎回同じ展開というのはなかなか起きにくくなっています。\n\nまた8人のキャラクターはそれぞれ特殊能力を持っており、ジャンプして地形や弾を飛び越える、当てた相手を短時間行動不能にできる上に弾を跳ね返す斬撃を出す、一定軌道を往復し、他プレイヤーを見つけると追従して爆発するビットを放つなどなかなか多彩。\nマップによって若干の有利不利は生じますが（ダッシュ移動ができるキャラは入り組んだマップだと若干能力を生かしにくいなど）、基本的には大きな差は出にくく実力勝負になりやすい構成です。\n\nそうそう、ゲームモードは2種類のみです。\nひとつはマルチプレイヤーモード。オンラインオフライン人間BOT入り乱れて、様々なルールでの対戦が楽しめます。メインコンテンツはこちら…なんですが、プレイヤー数があまり多くなく、なかなかマッチングしません。\nとはいえ、少人数ながらちょこちょこと遊んでいる方はいるので、皆さんも是非購入してプレイしてほしいなあ。ていうか、キックスターターでそこそこ沢山投資があったはずなのに、何故こんなにプレイヤーが少ないのか…。\n\nもうひとつはチャレンジモードで、こちらはソロ専用。ゲーム中に登場する全ステージをEasy、Normal、Hardの3レベル分、Botプレイヤー3体を相手に1ラウンドも落とさずに4ラウンド先取する必要があるというなかなか面倒くさいモードです。\n\n[h1]gif動画　いつでも作成　できるのよ[/h1]\nさて、このゲームは各ラウンド終了時にボタン一発で決着前後数秒分のリプレイをgif動画として出力することができます。\nほらほらこんな感じ↓\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=860718693\nこれで思わず笑っちゃうような対戦結果や俺TUEEEEE動画を撮影してアップロードしたら楽しいと思わない？　思うよね！\nはい、じゃあそんなあなたはサクッとInvisigun Heroes買って遊びましょう。\nいやホント、こんな良くできたゲームなのになんでこんなに人少ないんだろうね。やっぱりキャラが透明で絵面が地味だからかなあ。", "timestamp_created": 1487019459, "timestamp_updated": 1487108782, "voted_up": true, "votes_up": 65, "votes_funny": 9, "weighted_vote_score": "0.824735", "comment_count": "4", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29888941": {"recommendationid": "29888941", "author": {"steamid": "76561197998009585", "num_games_owned": 271, "num_reviews": 1, "playtime_forever": 725, "playtime_last_two_weeks": 0, "last_played": 1512624880}, "language": "english", "review": "Invisible Bomberman with Guns, Power-ups, Couch-Play, Online-Play! \n\nBeautiful and smooth mechanics. Do it if you want a wonderful party game. You do.", "timestamp_created": 1486953507, "timestamp_updated": 1486953507, "voted_up": true, "votes_up": 30, "votes_funny": 0, "weighted_vote_score": "0.733829", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29866661": {"recommendationid": "29866661", "author": {"steamid": "76561198297282115", "num_games_owned": 22, "num_reviews": 1, "playtime_forever": 46, "playtime_last_two_weeks": 0, "last_played": 1486998441}, "language": "schinese", "review": "游戏很简单，也很有趣！全程隐身（所有人）的设定，让人眼前一亮！就是玩的人不多，现在多是打电脑，要是像网游一样，感觉会更棒！！多点人玩的话~~相信这游戏绝对让人上瘾~欢乐多多！", "timestamp_created": 1486884845, "timestamp_updated": 1486884845, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.544073", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29866240": {"recommendationid": "29866240", "author": {"steamid": "76561198259475729", "num_games_owned": 22, "num_reviews": 1, "playtime_forever": 13, "playtime_last_two_weeks": 0, "last_played": 1494386255}, "language": "schinese", "review": "就非常可爱！像素电子风格特别出众！一局也很就能结束！因为很简单所英文废也还是能看懂不过还是能希望有中文~\n真的很喜欢~", "timestamp_created": 1486883117, "timestamp_updated": 1486883117, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.486760", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29863588": {"recommendationid": "29863588", "author": {"steamid": "76561198129002810", "num_games_owned": 78, "num_reviews": 5, "playtime_forever": 466, "playtime_last_two_weeks": 0, "last_played": 1513749279}, "language": "english", "review": "Backed this game during it's Kickstarter, suffice it to say the final product is a fantastic game.\n\nIt's effectively Bomberman, but instead of dropping bombs everyone uses an Invisigun, which fires a blast in a direction that goes until it hits an object or a player. Everyone is invisible but firing your gun or using your character's signature ability causes you to become temporarily visible. In addition environments are designed with small features that give away your location (walking in water causes splashes, snow leaves foot prints, windows casting light will have the light obscured if your standing in the way, etc.). Game is playable locally with up to 4 players. The AI is very smart-but fair. Gameplay is addicting, and I highly recommend it to anyone who enjoys co op games in a similar fashion to Bomberman or Towerfall.", "timestamp_created": 1486870998, "timestamp_updated": 1486870998, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.591837", "comment_count": "2", "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "29863137": {"recommendationid": "29863137", "author": {"steamid": "76561198191864505", "num_games_owned": 34, "num_reviews": 1, "playtime_forever": 22, "playtime_last_two_weeks": 0, "last_played": 1486868309}, "language": "english", "review": "This is a good game novel style and creative design but it‘s too difficult for noob~ yes im noob ~I Played the thirty HARD game all lose~So I gave up\n\n\n好游戏但这个游戏太难了 30把困难模式全输……QWQ", "timestamp_created": 1486868839, "timestamp_updated": 1486868839, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29862067": {"recommendationid": "29862067", "author": {"steamid": "76561198066250885", "num_games_owned": 54, "num_reviews": 7, "playtime_forever": 70, "playtime_last_two_weeks": 0, "last_played": 1487078071}, "language": "schinese", "review": "服务器选择的话用日本线路比较稳定点，ping也低，有朋友一块玩是极好的。如果什么时候出了国服（可能性不大吧，不过现在也能玩）极好的。\n\n8/10", "timestamp_created": 1486863982, "timestamp_updated": 1486863982, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500832", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29848791": {"recommendationid": "29848791", "author": {"steamid": "76561198031325171", "num_games_owned": 816, "num_reviews": 7, "playtime_forever": 277, "playtime_last_two_weeks": 0, "last_played": 1487199771}, "language": "english", "review": "Invisigun - what an absolutely glorious indie gem!  If you read no further, go with your instinct and give this title a chance at the asking price – it’d be *criminal* to pass this one by.  An amazing distillation of so many classic favourites from over the decades, combined with unique and highly clever mechanics, Invisigun has sunk its hooks into me from the first moment, and I can't wait to experience more.  Think Bomberman with beautiful classic Zelda-inspired graphics, hints of Power Stone, and frissons of several other “greats”.  And don’t even get me started on the soundtrack!  Only a few hours in, I’m already awestruck by the love and polish evident in every aspect, the simple-to-learn-but-hard-to-master gameplay, and the genuine and immediately-apparent FUN.  I don’t say this lightly – I see genuine brilliance evident in this game and give mad respect to its one-man developer.  \n\nTaking the narrow view, it's a great \"party game\" – but it doesn’t take much effort to reveal oh-so-much more under the surface.  There's real strategy and skill involved, to be developed over a long period of practice and experience.  Yes, it’s easy to jump into, but even in my first online multiplayer matches with evenly-matched opponents, I was finding myself embroiled in satisfying sparring matches of bluffs, jukes, and mindgames to anticipate the location of the competitors and bait them into my traps whilst avoiding the same in return.  This is a case of satisfying my inner-competitive-strategist, but in digestible periods of time which work well with a busy lifestyle – a typical first-to-5-wins match often takes only five to ten minutes!  Speaking of longevity, there are already 50 unique maps at launch, with deformable and otherwise-dynamic terrain, each of which favours unique strategy and caters to the skills of different characters.  But I’m told there are already more maps on the way, and even another character!\n\nI’m clearly all in favour of Invisigun but, as with any game at launch, there are a few issues that could be improved.  And those mostly involve the online matchmaking.  While it can be fun to learn maps by sparring with the bots in offline singleplayer, this game is undoubtedly at its best in live multiplayer.  And there *are* people playing online! - but you wouldn’t necessarily know it unless you jump onto the Discord channel.  You see, there is no online server browser – you can only choose which region (or “all”/”best” regions) you wish to connect to, then search for an open match to jump into.  But unless a host is actually sat in their created lobby, waiting for players to join, then you won’t know the server even exists because you cannot join matches in progress, even to sit in the lobby.  And if a multiplayer match is partially filled out with bots (optional), then those bots fill the available slots for human players to join.  So for all practical purposes right now, you’ve got to jump onto the Discord channel and do your matchmaking there.  However, the developer seems to be very aware of these issues and I have faith that they will be addressed in due course.  On the other hand, my early interaction with the player community through Discord has been an entirely positive experience!\n\nTo me, this game is a real treasure find – the kind I sift through endless product release pages and games bundles hoping to discover.  I had no idea it even existed before launch, and it arrived without any hype on Steam.  Were it not for a casual glance at the “new releases” list for the day and a few minutes with a Twitch stream by LEMental,  it might have passed me by entirely.  What an unjust fate that such an expertly crafted and outstanding title be left unnoticed by the masses due to underexposure.  Well! - hopefully those of us lucky enough to find it, and sing its praises, bring more of our fellow gamers into the fold!  One only needs to know it it exists and to try it, then the quality of the game speaks for itself.  So grab it, then come find us on Discord! https://discord.gg/ycEhg2Q", "timestamp_created": 1486823062, "timestamp_updated": 1486823062, "voted_up": true, "votes_up": 29, "votes_funny": 0, "weighted_vote_score": "0.688984", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29847760": {"recommendationid": "29847760", "author": {"steamid": "76561198144019215", "num_games_owned": 310, "num_reviews": 7, "playtime_forever": 496, "playtime_last_two_weeks": 0, "last_played": 1504935722}, "language": "schinese", "review": "很有乐趣，不过找到一起联机的人有点难(((\n\n609929722<-对战群一起来玩嘛....", "timestamp_created": 1486820248, "timestamp_updated": 1486820248, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.550422", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29835453": {"recommendationid": "29835453", "author": {"steamid": "76561198084101201", "num_games_owned": 125, "num_reviews": 5, "playtime_forever": 129, "playtime_last_two_weeks": 0, "last_played": 1502524878}, "language": "french", "review": "Un véritable coup de coeur. \nUn Gameplay super original faisant un peu penser à Bomberman, une Bande-son vraiment sympa et des graphimes en pixels très jolies.\nPour l'instant on peu rencontrer quelques difficulter à trouver une partie à moin de l'héberger soit-même. Mais le jeu dispose de son propre serveur Discord pour trouver d'autres joueurs ce qui est appréciable. Sinon il y a toujours un mode en local jusqu'à 4 joueurs ou contre des bots.\nUn grand jeu indé qui mérite que du monde si intéresse, je le recommande vivement!", "timestamp_created": 1486772025, "timestamp_updated": 1486772025, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.508165", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29825480": {"recommendationid": "29825480", "author": {"steamid": "76561198017109530", "num_games_owned": 159, "num_reviews": 2, "playtime_forever": 323, "playtime_last_two_weeks": 0, "last_played": 1500321660}, "language": "english", "review": "Very good game! Definitely worth buying.\n\nPros+ :\n-Awesome pixel-graphics (for me thats a pro for sure)\n-Good music\n- 8 different characters, each with a unique skill \n-Many different maps and gamemodes\n-Singleplayer versus bots\n-Local multiplayer (so much fun)\n-Online multiplayer \n-easy to learn (hard to master)\n-Reminds me of good old bomberman, but even better\n\nCons- :\n-Not announced to be released for nintendo switch. Srsly this game would fit perfectly onto that!\n\n", "timestamp_created": 1486738983, "timestamp_updated": 1486738983, "voted_up": true, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.637363", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29825419": {"recommendationid": "29825419", "author": {"steamid": "76561198132874822", "num_games_owned": 298, "num_reviews": 39, "playtime_forever": 278, "playtime_last_two_weeks": 0, "last_played": 1514618150}, "language": "schinese", "review": "玩了大概一小时单机，先简单评价一下。\n\n[h1]游戏模式[/h1]\n游戏是一个FFA(free for all)的竞技场模式，使用最简单的射击和一个根据选择角色的而不同的技能，尽可能的击杀别人活到最后。\n这款游戏的亮点在于，[b]不论是敌人还是自己，都是隐形的。[/b]这里的隐形，是连玩家自己控制的角色都看不到的，只有开枪和放技能的一瞬间会显形，这就极大的增强了本身很简单的竞技场的模式的乐趣。由于大家谁都看不见谁，而且挨一枪就会死，但是又需要开枪找自己的位置，所以游戏整体节奏会非常紧张刺激，[spoiler]有点“忍村”的感觉[/spoiler]\n\n[h1]可玩性[/h1]\n即使再新奇的竞技场模式，没有新玩意儿也是很容易腻的。游戏内置了非常多的地图，有很多地图的地形、环境对于游戏玩法是有很大改变的。比如水踩上去会有水花，墙壁上的灯会被挡住亮光，下雨打雷的一瞬间可以看到所有人等等等等..对于本身贫乏的游戏模式增添了不少亮点。\n[spoiler]不过单机再丰富，这种游戏模式一个人玩也是太孤独了（\t不建议单人玩家入手，或者等降价也可以。[/spoiler]\n\n[h1]画面/音乐[/h1]\n画面绝对是像素游戏的佼佼者！光影、环境、打击感都非常棒，如果喜欢像素风格应该不会不喜欢这款游戏。\n音乐就是规规矩矩的“像素风格”了，风格很统一，不过有点单调。对于音乐不是很在行，就不多评论了。\n\n推荐度\n对于单机玩家6/10\n虽然有在线匹配功能但是因为人少实际上是找不到人的\n有基友一起玩的话8/10\n支持本地4人，不过真在一个键盘上4个人玩估计要死人。少两分是友尽分。其实有朋友一起玩的话，什么游戏不能打10分呢", "timestamp_created": 1486738800, "timestamp_updated": 1486774663, "voted_up": true, "votes_up": 15, "votes_funny": 1, "weighted_vote_score": "0.698148", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29824357": {"recommendationid": "29824357", "author": {"steamid": "76561198277588713", "num_games_owned": 134, "num_reviews": 9, "playtime_forever": 198, "playtime_last_two_weeks": 0, "last_played": 1501289764}, "language": "schinese", "review": "We need Chinese, thank you!\n我们需要中文\n坑基友的游戏,可以和基友愉快的厮杀了。\nBGM带感，手柄震的非常爽。", "timestamp_created": 1486735863, "timestamp_updated": 1486735913, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.510583", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29823699": {"recommendationid": "29823699", "author": {"steamid": "76561198215176516", "num_games_owned": 53, "num_reviews": 10, "playtime_forever": 47, "playtime_last_two_weeks": 0, "last_played": 1491825804}, "language": "schinese", "review": "此游戏需要最铁的基情!\n新一代友尽系列巨作!\n目前的画风和创新感都很棒 买不了吃亏买不了上当!\n手残多动症党的挑战!\n因为是小伙伴送的所以要好好珍爱它 \n最后是这服务器貌似很难匹配？请加好友！", "timestamp_created": 1486733920, "timestamp_updated": 1486733920, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29820041": {"recommendationid": "29820041", "author": {"steamid": "76561198171426138", "num_games_owned": 73, "num_reviews": 5, "playtime_forever": 119, "playtime_last_two_weeks": 0, "last_played": 1490504763}, "language": "english", "review": "I have been trying out the game for a while and it's amazing in visual, music and gameplay!\n\nJust a little suggestion though haha, I understand that it is part of the idea of the game to be invisible in game and trying to figuring out the position, but it seems to be fustrating at times when you can't even figure out where you are and got killed. I would be very much helpful when you can see yourself as a transparency charracter in game while figuring out other players. I'm sure it would reduce a lot of confusion and fustrated during the game.\n\nIf it would be able to purchase/download soundtrack used in the game that would be awesome!", "timestamp_created": 1486720062, "timestamp_updated": 1488438070, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502625", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29811542": {"recommendationid": "29811542", "author": {"steamid": "76561197970431751", "num_games_owned": 723, "num_reviews": 3, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1500934775}, "language": "english", "review": "First impressions are extremely positive. I haven't played a hundred hours, but I know when I'm having fun. This game oozes charm and definately has that \"one more match\" quality.\nOn point pixel art, great game mechanics, quality sound design; this game needs an army of players right now! \nWell worth the price of admission if you're a fan of classics like Bomberman or newer titles like Towerfall. Or if you have even a passing interest in gaming. Buy it; it costs less than most things and is better than a lot of them. Take pizza for example... Pizza is highly overrated as a party expense. Just fire this up at your next party! Your guests will forget about minor concerns like hunger, thirst or the declining economic and social climate, and soon they will have transcended to a level of pure ninja-like precision. Living only to strike, deadly from the shadows. Like a snake. Or a tiger or something. I don't know. I'm rambling now, aren't I? I always do this, I have trouble knowing when to stop. Should I stop now? I'll stop.", "timestamp_created": 1486679464, "timestamp_updated": 1486680727, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29808424": {"recommendationid": "29808424", "author": {"steamid": "76561197967039301", "num_games_owned": 229, "num_reviews": 3, "playtime_forever": 39, "playtime_last_two_weeks": 0, "last_played": 1486628434}, "language": "english", "review": "Absolutely gorgeous. The art and effects are just beautiful. The sound and music is great. Everything about this game you can tell was put together with love and care and the polish shines through. Definitely my goto party game now. Reminds me a lot of bomberman with friends back in the day.", "timestamp_created": 1486668464, "timestamp_updated": 1486668464, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29806143": {"recommendationid": "29806143", "author": {"steamid": "76561198080803428", "num_games_owned": 44, "num_reviews": 1, "playtime_forever": 71, "playtime_last_two_weeks": 0, "last_played": 1496703891}, "language": "english", "review": "Not only is this game a great party game its also great if you can't have friends over bcause the developer didn't overlook online play! I backed this on Kickstarted and am extremely happy I did. What makes this game unique and fun is the fact that you and all other players are invisible unless your shooting or using your specially ability. This is overall a well thought out and well exicuted game!", "timestamp_created": 1486661425, "timestamp_updated": 1486661425, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29805697": {"recommendationid": "29805697", "author": {"steamid": "76561198256710337", "num_games_owned": 178, "num_reviews": 10, "playtime_forever": 26, "playtime_last_two_weeks": 0, "last_played": 1486662438}, "language": "schinese", "review": "我觉得对我这种智商不够的多动症来说有点难，但画风很好，而且设定也很有趣的样子。但我现在连电脑都打不过，每次都输一局就很气...不过大致摸清楚了这游戏的套路了，应该还会再玩一会。", "timestamp_created": 1486660117, "timestamp_updated": 1486660117, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29804919": {"recommendationid": "29804919", "author": {"steamid": "76561198220535437", "num_games_owned": 281, "num_reviews": 1, "playtime_forever": 64, "playtime_last_two_weeks": 0, "last_played": 1487008573}, "language": "english", "review": "First time for me to write a review and I dont think I need a lot of words here.\nIt is great, it seems to be a lot of fun and it has the potential to destroy many friendships.\nGet this game, try it out, after all you can still refund it if you dont like it.\nBut really guys...GET THIS GAME!", "timestamp_created": 1486657892, "timestamp_updated": 1486657892, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29803002": {"recommendationid": "29803002", "author": {"steamid": "76561197978412138", "num_games_owned": 271, "num_reviews": 6, "playtime_forever": 959, "playtime_last_two_weeks": 0, "last_played": 1510439377}, "language": "english", "review": "Kickstarter backer here. I've been playing this game since alpha.  It's a nice twist on the single screen arena genre.  Since both you and your opponents are invisible most of the time, it demands some effort to track your own position as you play, but the payoff when this becomes second nature is worth it. It's simple to grasp but has a high skill ceiling, and has become a lunchtime favourite on the office couch. The pixel graphics are a perfect homage to 16 bit 90s consoles with lush palettes, the maps are varied and full of detail and interesting features, and the sound design is deep and multilayered.", "timestamp_created": 1486652585, "timestamp_updated": 1486652801, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.550474", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29802127": {"recommendationid": "29802127", "author": {"steamid": "76561197980128981", "num_games_owned": 355, "num_reviews": 3, "playtime_forever": 396, "playtime_last_two_weeks": 0, "last_played": 1510687012}, "language": "english", "review": "Both very enjoyable and challenging party game with beautiful graphics and great soundtrack", "timestamp_created": 1486650083, "timestamp_updated": 1486650083, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.462963", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29793983": {"recommendationid": "29793983", "author": {"steamid": "76561198148114885", "num_games_owned": 23, "num_reviews": 4, "playtime_forever": 21, "playtime_last_two_weeks": 0, "last_played": 1489164719}, "language": "schinese", "review": "I need Chinese   ~!   我需要中文~!\n从小就爱玩泡泡堂 相信大家都玩过  哈哈哈 ~ 这个游戏有点类似 不过不是放泡泡炸人  是拿鸡鸡射别人   很欢乐 惊险刺激  个人而言不是很喜欢像素画风  如果做成Q版就好了   还是测试版本 期待完善~！！", "timestamp_created": 1486610542, "timestamp_updated": 1486611153, "voted_up": true, "votes_up": 11, "votes_funny": 3, "weighted_vote_score": "0.544029", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29791489": {"recommendationid": "29791489", "author": {"steamid": "76561198174901462", "num_games_owned": 79, "num_reviews": 28, "playtime_forever": 13212, "playtime_last_two_weeks": 0, "last_played": 1514173682}, "language": "english", "review": "I first played Invisigun at PAX, and I loved it. I immediately went home and backed it on kickstarter so I could get it as soon as possible. I followed it intensely, and had a month where I was checking my email and the forums multiple times every day just so I could get even a scrap of news about it. As soon as I got it, I promptly annoyed my friends incessantly to play with me. Sadly, I ended up playing mostly with bots. :Neko: That was fine, though. Even with the three worlds that there were when I got it, there was still a ton to do. The game only went uphill from there. Much to my delight, the bots AI was improved immensely until they actually became as good as a real player. Two new planets were added, full of new mechanics. New heroes were added, and the gameplay was completely changed based on the discussions on the forums. This game kept getting better and better, and it won't stop now. The dev is one of the best I've seen, and sure knows how to make a great game. Honestly, this game coudld go down in history as one of the first and THE best to pull off \"everyone is invisible.\" (A surprising amount of companies have started developing games shockingly similar to this. I think they can see how successful this game will be! :P) Without a doubt, I highly recommend this game.\n\nI look forward to seeing you join us; we need some more people to play online with! :D\n\nNote: on most of my games, I leave my computer running for weeks, so the hours are greatly exaggerated. This is not the case with Invisigun. Me and my friends have actually played almost 162 hours and I'm not tired of it yet! It looks like I never play this game, but don't be fooled. It's one of my all-time favorites.", "timestamp_created": 1486596933, "timestamp_updated": 1486597306, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.525000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29791257": {"recommendationid": "29791257", "author": {"steamid": "76561198002560836", "num_games_owned": 491, "num_reviews": 34, "playtime_forever": 737, "playtime_last_two_weeks": 0, "last_played": 1502570151}, "language": "english", "review": "Awesome game. OOzes detail and love. Like Bomberman on crack. Being able to play with friends Local and play WITH those friends online when they are over hanging out is a big plus for me and a lot of games need to do this.", "timestamp_created": 1486595748, "timestamp_updated": 1486595748, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.488158", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29791043": {"recommendationid": "29791043", "author": {"steamid": "76561198037608752", "num_games_owned": 93, "num_reviews": 3, "playtime_forever": 46, "playtime_last_two_weeks": 0, "last_played": 1489329274}, "language": "brazilian", "review": "Jogo sensacional! A arte lembra um pouco bomberman, porém é bem criativo! Muito bm desenvolvido. Trilha sonora excelente!", "timestamp_created": 1486594655, "timestamp_updated": 1486594655, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.605178", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29790121": {"recommendationid": "29790121", "author": {"steamid": "76561197961063014", "num_games_owned": 2343, "num_reviews": 28, "playtime_forever": 217, "playtime_last_two_weeks": 0, "last_played": 1487043046}, "language": "english", "review": "This game is definitely worth a look for anybody that likes competitive party-style games!  \n\nTake the 4-player single-screen chaos of Bomberman, add invisibility, stealth tactics, class-based abilities, tons of maps, lots of game modes, and now you're starting to get the picture.  Relatively easy to pick up, but has a high skill ceiling if you really get into it.\n\nUnlike a lot of indie competitive games, it has support for bots AND multiplayer AND shared screen playing.  All in the same match, if you want!  And then there are single player challenges on top of that.  So no worries about buying a game that you can't play when nobody else is at your house!\n\nThere is also great music and awesome pixel art with tons of little details in the active environments that give other players away (footsteps, water splashes, moving cameras, opening doors, etc)...just tons of love and polish in every aspect!  And it all impacts the gameplay.\n\nDisclaimer: I am a friend of the developer, and he is one of the nicest and most genuine guys you could ever meet, so my opinion may be biased.  I'm OK with that.  :)", "timestamp_created": 1486590385, "timestamp_updated": 1486590538, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.638193", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29787696": {"recommendationid": "29787696", "author": {"steamid": "76561197970898813", "num_games_owned": 378, "num_reviews": 2, "playtime_forever": 23, "playtime_last_two_weeks": 0, "last_played": 1509804305}, "language": "french", "review": "Un excellent party game, dans la lignée de TowerFall et autre Samourai Gunn. Très pratique à sortir quand vous recevez, pas besoin d'etre méga skillé pour passer une bonne soirée dessus (contrairement à Towerfall qui nécessite quelques temps d'adaptation pour une personne peu habituée)\n\nJeu joué sur la version itch.io d'où mon compteur nul d'heures sur le jeu :)\n\nUn solide suivi du développeur.", "timestamp_created": 1486581522, "timestamp_updated": 1486664633, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29786509": {"recommendationid": "29786509", "author": {"steamid": "76561198017329396", "num_games_owned": 103, "num_reviews": 1, "playtime_forever": 23965, "playtime_last_two_weeks": 670, "last_played": 1516319863}, "language": "english", "review": "Invisigun Heroes adds depth to the classic 'Bomberman' shared screen party game formula with the addition of invisibility for all players and special character abilities.  The game achieves complexity and depth without sacrificing ‘pickup and play’ simplicity.\n\nPlayers can select from several characters each with their own special ability, then vary their gameplay with diverse strategies from deviously sneaky to fiercely aggressive while keeping opponents guessing due to the invisibility mechanic.\n\nThe game is not a run of the mill low-resolution game, every map is overflowing with lovingly created pixel art, from rain drops splashing onto the ground to particle effects floating in the air.  It seems there is always something new to notice.\n\nInvisigun Heroes is remarkably flexible, allowing players to mix and match local players with online players and enjoy many modes across a vast selection of unique and engaging maps.\nWhile the game is best playing against friends, the single player Survival Challenge mode is a great way to try maps, characters and refine your skills while invisible.\n\nIt is truly a pleasure to play. Even on a losing streak, a tricky play that surprises your opponent and leads to a kill will leave a smile on your face.  Moments like these will keep you playing for hours.\n\nI [b]highly[/b] recommend Invisigun Heroes.", "timestamp_created": 1486577277, "timestamp_updated": 1486577277, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.605816", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29786448": {"recommendationid": "29786448", "author": {"steamid": "76561197993179323", "num_games_owned": 176, "num_reviews": 5, "playtime_forever": 26938, "playtime_last_two_weeks": 580, "last_played": 1516401125}, "language": "english", "review": "​This game is AMAZING! A very interesting take on the 4 player top down party style game. A must have for anyone who likes games such as Towerfall or Samurai Gunn. But, this game blows those games out of the water with it's extra features (online multiplayer) and novel mechanics.\n\nBasics: Everyone is invisible. You can move on a grid orthogonality (up, down, left, right). Each step makes a noise. When you fire or use an ability (8 different characters) it reveals you for a short time. If you bump into or walk over certain terrain it can give away your location subtly via sounds or animation cues.\n\nGraphics: If you like the pixelated art style, they NAILED IT!\n\nMusic: The diverse scores capture the feel of the different planets (5). I could listen to most of them on repeat.\n\nSound Effects: Sound is SO IMPORTANT in this game and they did a fantastic job at conveying things like footsteps to the players. I highly recommend headphones. I feel that people with hearing impairments will struggle with this game but it's not unplayable.\n\nMultiplayer: Multiplayer is the core of this game. Invisigun Heroes allows you to play cross platform (Linux, Mac, Windows) multiplayer with anyone in the world. You can also add more local players seemlessly. There is basic matchmaking and you can even host private ip games. There is no online communication (you will want to join the discord).\n\nControls: Keyboard can be remapped to be any controls. This game is meant for controller though. My Xbox360 controller and iBuffalo classic USB gamepad worked like a charm. This game can be a little tricky to get your berrings on where you're at. I can see new players being frustrated by that learning curve.\n\nGamemodes: There are 7 different gamemodes of everything you might want in a game like this, all of which are free for all (no teams (っ- ‸ – ς) ).\n\nTLDR Pros/Cons:\n\nPros: Cross platform local/online multiplayer (up to 4 playes/bots), fantastic pixel art, great retro inspired music, 50 stages, 7 gamemodes, easy to understand, high skill cap.\n\nCons: Free for all only (no teams), no real singleplayer game (bots only), learning curve to move while invisible, no online chat.​", "timestamp_created": 1486577046, "timestamp_updated": 1490578041, "voted_up": true, "votes_up": 41, "votes_funny": 0, "weighted_vote_score": "0.763208", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39501918": {"recommendationid": "39501918", "author": {"steamid": "76561197969918459", "num_games_owned": 864, "num_reviews": 15, "playtime_forever": 88, "playtime_last_two_weeks": 88, "last_played": 1516512643}, "language": "english", "review": "Wow. This game is amazing. Fills that bomberman gap that's been around forever. The game is hard to play but really satisfying. Really amazing and impressive small game. Letting folks try the game with a friend who has purchased it is a great option and feels really friendly. Most folks I've played with ended up purchasing it.\n\nGreat and unusual versus game.", "timestamp_created": 1516512822, "timestamp_updated": 1516512822, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39488217": {"recommendationid": "39488217", "author": {"steamid": "76561198149310581", "num_games_owned": 72, "num_reviews": 7, "playtime_forever": 253, "playtime_last_two_weeks": 253, "last_played": 1516501488}, "language": "english", "review": "This game is a blast. The unique premise is executed very well and makes for an addictive game you can quickly pick up and play for a round, or sink hours into at a time.\n\nWhat really suprised me is the amount of content in the game. There are 67 maps across 6 different planets that have different layouts, aesthetics and gimmicks, 9 characters with different powerups, 7 unique game modes and a suprisingly fun and relaxing single player mode that should take you 5-10 hours (depending on the difficulty a lot).\n\nThe only issues I have with the game is that going from round to round can take a bit longer than I'd like (though it's definitely not egregious), occasional crashes with intel graphics (the game is lightweight and ideal for laptops) and there aren't enough people playing it!\n\nThe game is well designed, well executed, polished and definitely worth the price, so go buy it and contribute to the player pool!", "timestamp_created": 1516467892, "timestamp_updated": 1516493781, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501511", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 179, "total_negative": 11, "total_reviews": 190}}
