{"reviews": {"38607593": {"recommendationid": "38607593", "author": {"steamid": "76561198119516078", "num_games_owned": 47, "num_reviews": 2, "playtime_forever": 2035, "playtime_last_two_weeks": 0, "last_played": 1469742022}, "language": "english", "review": "I have all the aveyond games and it was safe to say, I was hyped for this new one. Good game! But nothing will ever EVER amount the ORIGINAL aveyond game, Rhen's Quest.", "timestamp_created": 1514092439, "timestamp_updated": 1514092439, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.489583", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35160434": {"recommendationid": "35160434", "author": {"steamid": "76561198025403989", "num_games_owned": 1970, "num_reviews": 66, "playtime_forever": 2164, "playtime_last_two_weeks": 0, "last_played": 1506188349}, "language": "italian", "review": "Bene, finalmente ho terminato l'ultimo gioco degli Aveyond.\n\nI primi due mi erano piaciuti molto e mi spiace non ci siano su Steam. Purtroppo li presi su Impulse/Gamestop e su Steam la collezione pare monca. Peccato perchè non erano male.\nIl terzo è diviso in 4 parti e mi ha deluso moltissimo: ho bocciato tutti e quattro i sottocapitoli, anche per il fatto che hanno diviso in 4 un gioco che come lunghezza era paragonabile ai primi due e al quarto: un completo nonsense. E anche per l'estenuante backtracking.\nPer il quarto che dire. Beh, è bellissimo.\n\nDiciamo subito che ci sono state almeno un paio di circostanze in cui ho riso di gusto. Ma non sorridendo, proprio ridendo come un fesso davanti lo schermo. Il protagonista Boyle è un soggettone che vuole fare il cattivone (in passato lo era) ed è promesso sposo ad una strega cattiva (Ingrid): i due si beccano in continuazione durante tutto il gioco, e non solo, ci sono stati momenti con altri personaggi davvero piacevoli, che mi hanno appunto strappato più risate.\nIl gioco è lungo (tra 35 e 40 ore se si decide di portare tutte le missioni a termine), anche se per qualche missione permane il problema del backtracking (soprattutto una quest relativa alla formazione di una congrega delle streghe, ma ne vale la pena per avere una maledizione finale che fa un fracco di danni).\n\nLe missioni sono appuntate su un diario e mano a mano che si risolvono vengono cancellate, quindi il tutto è molto pulito e ordinato. Anche se l'uso dell'inventario per gestire gli oggetti è molto scomodo, perchè bisogna scorrerli sempre uno ad uno non potendo gestire le loro priorità (ad esempio, se durante un combattimento un personaggio muore bisogna scorrere tutti gli oggetti per trovare quello che permette la resurrezione e questo viene messo in fondo alla lista).\n\nC'è molto di avventura grafica oltre ai combattimenti, con enigmi (bella la parte dentro il castello in cui bisogna capire cosa fare per procedere tra le stanze inizialmente inibite) e la disposizione dei mondi verso cui viaggiare è abbastanza intelligente, anche se a volte si dimenticano i nomi delle locazioni e si fa fatica a ricordare dove andare. Ma c'è anche una specie di netherworld che permette di fare viaggi veloci e leggere i nomi delle locazioni di arrivo su comodi cartelli. Verso la fine si sblocca anche la nave e si può anche viaggiare liberamente.\n\nA parte il backtraking (che per questa tipologia di gioco è sempre presente e a volte è snervante perchè alcuni passaggi sono labirintici e si vorrebbe evitare di rifarli più volte) evidenzio tre altri difetti:\n\n1- le missioni secondarie sono piacevoli, ma a volte lo sforzo non dà grandi soddisfazioni finali, o perchè l'oggetto acquisito è inutile o perchè magari in precedenza si era già presa un'arma (o armatura) potente in un'altra missione e ci si ritrova come premio di missione qualcosa di più scarso. Inoltre le missioni non rilasciano esperienza: secondo me avrebbero dovuto implementarla. Anche perchè...\n\n2- la sezione finale è davvero sproporzionata in quanto a difficoltà rispetto il resto del gioco (non impareranno mai a gestire questo aspetto, mai). In genere combattimenti contro nemici nuovi e boss sono piacevoli e ben misurati, ma poi si arriva sulla Montagna del Teschio e si scopre di avere di fronte nemici troppo OverPowered, boss finale compreso. Qui ho faticato un po', e sono stato costretto a tornare indietro per finire altre missioni, trovando armature migliori, e livellare maggiormente.\n\n3- la trama generale non è proprio chiara e nel complesso non ha molto mordente. Per fortuna Boyle ed Ingrid tengono alto lo spirito dell'avventura.\n\nBelle le locazioni, belle alcune pensate (interruttori che modificano ad esempio la conformazione di un livello) e bella la sequenza finale (con battuta epica finale di Boyle) in cui si inserisce anche una sequenza che dipende dalla romance intrapresa durante il gioco. C'è pure la cosa scema a chiudere.\n\nLo consiglio vivamente, lo ritengo l'episodio più riuscito tra i quattro Aveyond.\n\n8/10", "timestamp_created": 1506190463, "timestamp_updated": 1506192276, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.514349", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34909583": {"recommendationid": "34909583", "author": {"steamid": "76561198130552357", "num_games_owned": 20, "num_reviews": 2, "playtime_forever": 1630, "playtime_last_two_weeks": 0, "last_played": 1507664803}, "language": "english", "review": "So prior to this game I had only played Ahriman's Prophecy and loved it. Based on reviews I decided to start with this game and was not disappointed. There were some times when I didn't know where to go so I had to Google but I do that with pretty much every game. If you are looking for a fun throwback RPG with a lot of humor, give this one a try. I will definitely be playing the rest of the games within the Aveyond series.", "timestamp_created": 1505255535, "timestamp_updated": 1505255535, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34754321": {"recommendationid": "34754321", "author": {"steamid": "76561198192001819", "num_games_owned": 18, "num_reviews": 1, "playtime_forever": 1833, "playtime_last_two_weeks": 0, "last_played": 1504682325}, "language": "english", "review": "As a life-long fan of the Aveyond series, I can say with certainty that this is an incredible game. However, it's not an Aveyond game. Yes there are references here and there in conversation, but the only thing that makes this game by definition an Aveyond game is the presence of the holy land of Aveyond itself. You could change the name of that place and erase the 5 or 6 references you get in passing and you wouldn't even know it was part of the series. Like I said before I don't think this is a bad game, but it just doesn't have the feeling of being on a proper quest to save the world. In every Aveyond prior to this, there has been a real threat of an evildoer plotting some grand plan, and you are sent on a quest to stop this from happening, running into all sorts of plot twists, tricky puzzles and difficult enemies along the way. In this game, [spoiler] you start off on a quest to find your dog, and even when the game seems to pull out the dramatic plot of an evil demon, [/spoiler] the main characters brush it off as a joke, leaving the whole plot lacking to feel of a real, important goal.\n\nAnother aspect of the game that I believe sets it aside for the rest of the series is the amount of consistencies of the series that were broken:\n[list]\n[*]There is little to no mention of Thais or the Pendragons\n[*]The menus work in a completely different way (i.e. no numbers on health/mana bars when using items, an individual equip menu for every character in their profile instead of one equip menu for everyone, the unappealing new layout of the home menu (especially when trying to use keys to quickly navigate the screen) etc.)\n[*]New interactions with spells (i.e. a spell may hit a random number of times, hit a random enemy/random enemies, hit the hero party etc).\n[*]Plently of memorable item, monster and character sprites were removed (which seems petty, but alongside everything else it kind of just sealed the deal)\n[/list]\nI feel like any one of these things could be implemented without alienating the game from the series, but all 3 along with others I might not have said are definitely a rather large shock.\n\nAs I have already eluded to, I also believe this game relies too much on it's comedic value to hold the player's interest in the plot (and the game as a whole). I had my fair share of good laughs during the Orbs of Magic series (usually during exchanges between Te'ijal and Galahad), and yes they made the games all the more enjoyable and added a sense of personality to the characters, but what keeps me going back to those games (as well as Aveyond 1 and 2) is the sense of completion I get every time I complete a quest, defeat a difficult enemy or ultimately finish the game. But because of all the satire and lack of suspense as to the final boss' plans, I found myself at the end of this game without even realising it. The feeling of approaching the climax of the story (i.e. the final showdown to stop your enemy's plan once and for all) just wasn't there. The fact that so many quests are left out of your journal for you to figure out on your own (i.e. [spoiler] the whole ordeal involving the two wizards and their towers [/spoiler]) didn't help either, as I went into the final fight fully expecting futher story development involving those side quests that I had assumed would come up later. (Please note that I am not saying the unwritten side quests were a negative addition. They are a great source of replay value and add that extra sense of completion to the game. However they should probably be pushed further to the side so as to not interfere with the apparent progression of the main storyline, or else they may actually withdraw from the sense of completion as it did with me).\n\nAnother note that I should make is that the number of highly problematic bugs in the game (at least at the time I played it) is rather alarming. Some characters don't show up during cutscenes, images may be doubled (i.e. [spoiler] a tile showing glowing eyes in a hollow tree shows a duplicate beneath itself on the misty mountain as the start of the game [/spoiler] ). And even carrying certain items interfered with menu interactions.\n\nI love the Aveyond series dearly, and I did thoroughly enjoy this game. I did get a good sense of completion for all the quests I finished and secrets i found. However, it just doesn't fit the epic fantasy adventure RPG role that the series demands of any addition. I find it to be more of a sort of parody of the series. My overall rating for the game (based on satisfaction) would be about 6/10.", "timestamp_created": 1504610362, "timestamp_updated": 1504610362, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34427905": {"recommendationid": "34427905", "author": {"steamid": "76561198258891779", "num_games_owned": 30, "num_reviews": 3, "playtime_forever": 3495, "playtime_last_two_weeks": 0, "last_played": 1503452720}, "language": "english", "review": "This is the 4th game in the Aveyond series and quite frankly the best. It's the first game I beat without cheats, and I loved every hour of it (note: my gametime is inaccurate I may or may not have left this open >.>) The goodie caves in this game don't break it, they help. And yes, I KNOW it looks RPG makery but it looks better than the previous games and I enjoyed looking at all the new designs and exploring the new world. Also, if for nothing else, get it for the story line and dialogue. Surprsingly hiLARious whether you expect a giggle or not, and the plot itself is super engaging. If you're not used to Aveyond games, this may be tricky for you. But I'd definitely buy this one if you've been thinking about the series, and even if you've already played it? Still get it. There are references to the older games in the series and let's be real I love this game and so should everyone else.", "timestamp_created": 1503453774, "timestamp_updated": 1503453774, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33941083": {"recommendationid": "33941083", "author": {"steamid": "76561198099010422", "num_games_owned": 24, "num_reviews": 1, "playtime_forever": 1434, "playtime_last_two_weeks": 0, "last_played": 1500927885}, "language": "english", "review": "I have played all the Aveyond games and I have loved them all... except for this one. That's not to say it isn't an okay game, but it didn't live up to the expectations I have come to have for an Aveyond game. It was a bit disappointing.\n\nPros:\n - The characters are well done. Boyle makes for a fun and interesting \"hero\". The side characters are just as interesting and the dialog is well written..\n - The art is, as usual, beautiful. Each location has so many little details that make the map come alive.\n - The mechanics are great. Each character has their own set of unique skills. Changing one active party member for another can have a real impact in a fight.\n - The humor is on point.\n - Lots of little easter eggs / throwbacks to previous Aveyond games.\n\nCons:\n - The quests were all over the place, to the point it became confusing in parts. While a game can be boring if it is too linear, this game would have benefitted from more clear direction.\n - The story started out strong, but fell apart toward the middle. \n - Backtracking. A lot of tedious back and forth, zig zagging all over. It got pretty boring.\n - The locations, while beautiful, felt small and cramped. The overall world map felt like each continent / island was stuck together on a too-small map at the end. Where previous games felt open and vast, this one felt small and squished.\n - The ending. No spoilers, but it was a letdown. I kept saying to myself \"That's it?\". Pretty disappointing.\n\nOverall, the game started out strong but seemed to lose it's way around the middle. I enjoyed it for the most part, but I felt as though the game had potential to be better than it was. If you love the Aveyond games, by all means get the game. Maybe wait until it's on sale though.", "timestamp_created": 1501557814, "timestamp_updated": 1501557814, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.563805", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33709146": {"recommendationid": "33709146", "author": {"steamid": "76561198113932136", "num_games_owned": 10, "num_reviews": 3, "playtime_forever": 5713, "playtime_last_two_weeks": 0, "last_played": 1500860071}, "language": "english", "review": "This is beyond a shadow of a doubt my LEAST favorite Aveyond game.  I think I own around 7 of them. The others are awesome. This one is torturous.\n\nPros: It's Aveyond. Cute characters. Nice story. Beautiful graphics. Characters in reserve earn xp. \n\nCons: Too confusing. As with all Aveyond games, you have to zig zag all over the place. Not a problem but without maps included it is hellacious trying to figure out how to get back to a previous location. Between the ferry, mist portal and ship....I don't know which way is up. With previous Aveyonds, you took your ship to a location and maybe had to navigate a woods or two. \nI've spent most of my time trying traveling and googling 'how do I get to (insert town name'. \n\nMore cons: Game is very skimpy as far as coins go. Drops from fights wouldn't be so bad if the weapons and armors weren't so expensive. With previous Aveyonds, I never ran out of money. \n\nIf you're looking for your typical fun Aveyond game, this isn't it.\n\nIf I wanted to be this frustrated and clueless with a game, I would have played Nancy Drew instead.\n\nEDIT: Forgot to mention 6/10 times I minimize the game to consult strategy guide or Google, the game glitches and my mouse cursor blinks and disappears. \nIf I am in a doorway or near stairs, my char will automatically walk up and down the stairs, or back and forth through the doorway and I can't stop him.\n\nIf I'm out in the open, the char will randomly walk in 1 direction until he can't any longer. I cannot move him with my mouse. Keyboard commands still work. I have no option but to save and restart the game.", "timestamp_created": 1500683545, "timestamp_updated": 1500684089, "voted_up": false, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.529928", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30081187": {"recommendationid": "30081187", "author": {"steamid": "76561198014432830", "num_games_owned": 94, "num_reviews": 4, "playtime_forever": 1979, "playtime_last_two_weeks": 0, "last_played": 1490027779}, "language": "english", "review": "I haven't finished this game yet, but from what I've played it's been quite charming! I even caught myself chuckling a few times. It's regular RPGmaker fare in terms of actual gameplay, however being a seasoned fan of the Aveyond series I'm here for the story, and as I've said, it hasn't been disappointing. Fun stuff, cute game.", "timestamp_created": 1487691742, "timestamp_updated": 1487691742, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30080616": {"recommendationid": "30080616", "author": {"steamid": "76561197982784967", "num_games_owned": 168, "num_reviews": 9, "playtime_forever": 2416, "playtime_last_two_weeks": 0, "last_played": 1487017026}, "language": "english", "review": "Wish I could recomend this as the only big issues it has are technical.\n\nPrimary Issues:\nOnly two screen sizes, full screen and tiny. Full screen stretches the game for wide screen.\nSlow movement. Several things go into this complaint. I'll detail it in full at the bottom.\nAudio slider for sound does not work.\n\n\nPositives:\nStory starts out fun and strong. Loses some focus in the middle but never becomes tedium.\nMechanics are an embaressment of riches. Every character has their own.\nThe meta dungeon was inventive. Cool idea well executed.\nBeing able to steal anything on the usuable item table was great.\nItem that let's you see goodie rooms. Saves me from looking up (more) spoilers online.\nBoyle's starting pokemon is the best pokemon for the whole game.\nNo random encounters, in spots this lets you run past higher level enemies to loot things.\n\n\n\nSlow movement:\nLate game there's no teleportation between cities, there is a system to reduce how much walking you need to do to get where you want to go but for this whole game you will be walking from point A to point B. There are several points where the next event isn't obvious, searching for them adds to the travel time.\n\nMovement is handled with either mouse or 'wasd'. This is an issue as clicking on some things is hard due to their size while using pure 'wasd' will end up hurting your hand. And when using 'wasd' the fidelity feels off as when the character rotates direction 180 degrees they rotate in 90 degree chunks adding several frames of lag to the movement. \n\nThe walk speed is a fixed rate for the whole game and it's not fast. This makes backtracking through large areas like cities painful. Eventually I settled on using both mouse and 'wasd' to minimize hand pain.", "timestamp_created": 1487689912, "timestamp_updated": 1487689912, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.560811", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30068502": {"recommendationid": "30068502", "author": {"steamid": "76561198065209195", "num_games_owned": 300, "num_reviews": 31, "playtime_forever": 3486, "playtime_last_two_weeks": 0, "last_played": 1487629321}, "language": "english", "review": "First off, if you are looking for a continuation of Aveyond 3 series, this isn't it.  HOWEVER, I laughed my butt off playing this game! Mechanics are great, battles get more challenging as you go along, and tons of side quests.  Highly recommended.", "timestamp_created": 1487633974, "timestamp_updated": 1487633974, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502633", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28492855": {"recommendationid": "28492855", "author": {"steamid": "76561198327393610", "num_games_owned": 57, "num_reviews": 2, "playtime_forever": 1532, "playtime_last_two_weeks": 0, "last_played": 1484956579}, "language": "english", "review": "after playing the entire serie of aveyond 3 wish was bad because of all the sidequests you were forced to do to complete the game and because of the fucking backtracking i was really doubting aveyond 4 but the second i started the game and saw the intro i knew i was gonna have a good time. i have not had this much fun with an rpg in a really long time and i really recommend buying it. its pretty long it took me 25 hours to finish and i was playing on normal difficulty so i didnt have to grind at all and i think i missed a quest or 2 but i completed most of the game and it was the best 25 hours of this year. i will give it a 9/10 because of some sound bugs and menu bugs in combat but otherwise i had a blast. if you want a game with mostly a fun instead of a serious story then buy this game and enjoy the 20 hours gameplay of it", "timestamp_created": 1482264725, "timestamp_updated": 1482264725, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501209", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28173698": {"recommendationid": "28173698", "author": {"steamid": "76561198145924434", "num_games_owned": 97, "num_reviews": 1, "playtime_forever": 5553, "playtime_last_two_weeks": 0, "last_played": 1502420407}, "language": "english", "review": "I really love this game", "timestamp_created": 1480814220, "timestamp_updated": 1480814220, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.498721", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25071843": {"recommendationid": "25071843", "author": {"steamid": "76561198100308629", "num_games_owned": 88, "num_reviews": 1, "playtime_forever": 2103, "playtime_last_two_weeks": 0, "last_played": 1472004788}, "language": "english", "review": "Loved the game. Another exellent game from aveyond studio with a totally awesome story <3", "timestamp_created": 1471867250, "timestamp_updated": 1471867250, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.498721", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24821298": {"recommendationid": "24821298", "author": {"steamid": "76561198073032276", "num_games_owned": 116, "num_reviews": 1, "playtime_forever": 1793, "playtime_last_two_weeks": 0, "last_played": 1470799302}, "language": "english", "review": "For fans of RPGmaker games you will definitely enjoy this one. Great for new players to the series/RPGmaker as it can be played as a stand alone game, and for players of previous Aveyond games there are a few easter eggs that will make you laugh. The dialouge is unique, humorous and engaging, and the story is rich and well rounded. Plenty of side quests to keep you entertained, and multiple endings. The puzzles are fantastic, not too easy but not impossible. The playable characters each have their unique fighting style and are all equally strong, which makes it a difficult choice to choose which ones to play (which in my opinion, is a good thing because you don't have to play characters that you don't like just because they are stronger). Speaking of characters, all characters gain experience points even when not in play, so if you end up wanting to switch later you don't have to go back and grind to raise the level of the excluded characters. The footsteps get a little annoying but I soon forgot after about 5 minutes of playing. Overall, I really enjoyed this game, the developers  for Aveyond really did a great job with this one.", "timestamp_created": 1470895894, "timestamp_updated": 1470895894, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.548872", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24382121": {"recommendationid": "24382121", "author": {"steamid": "76561198036677983", "num_games_owned": 115, "num_reviews": 2, "playtime_forever": 1984, "playtime_last_two_weeks": 0, "last_played": 1468803801}, "language": "english", "review": "Just finished this game today and I have to say, it was a work of art. Loved every minute of this game and I will be going back and tracking down anything else to do with Aveyond. If you enjoy older RPGs like Breath of Fire you will love this game.", "timestamp_created": 1468804479, "timestamp_updated": 1468804479, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501151", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24105819": {"recommendationid": "24105819", "author": {"steamid": "76561198205026109", "num_games_owned": 76, "num_reviews": 3, "playtime_forever": 1509, "playtime_last_two_weeks": 0, "last_played": 1467704191}, "language": "schinese", "review": "很久之前就接触 Aveyond 系列的游戏，玩第一部的时候觉得还不错，经过这么多年已经出到第四部了。\n\n第三部到第四部之间隔的时间真得挺久的，不知道什么时候开始官网上的 Aveyond 4 就一直写着 Coming Soon，经过这么多年终于新鲜出炉了，作为老玩家表示这一代的 Aveyond 绝对是厚积薄发，没有让我失望！\n\n在主线剧情方面上 Aveyond 4 延续了前作的风格，有经典 JRPG 的特点，并且[b]依然[/b]是主角拯救世界。不过故事展开的方式有了一些变化，主角不像是前作那样出身于普通人，而是征服世界未遂的 Boyle the Horrible。故事在散播正能量的同时也有很强的讽刺意味，打算征服世界的 Boyle 和拯救世界的英雄 Herclues 的实际身份完全反了过来。不得不再一次感叹编剧的想象力。\n\n但是感觉 Aveyond 系列的气氛慢慢由严肃转为逗比，在 Aveyond 3 以后更是如此。在看 Aveyond 4 开场动画的时候笑出声，并不是因为它真的幽默，而是感觉一开始的 Boyle 作为反派，给人一种“坏到傻”的感觉。剧情中的角色也会不分场合地开各种玩笑，就连国王都是一副不正经的样子。这让我感觉是在看一出闹剧，虽然很欢乐，但是感觉总是不对。相比之下我还是喜欢 Aveyond 1 的那种严肃向的感觉。\n\n人物刻画方面做得很不错，Boyle 和 Ingrid 这一对冤家简直太逗了，还有 Robin 这个年轻的骑士简直就是傻白甜。剧情中的 NPC 也是非常有趣的，而且不同地区的 NPC 的性格非常不同，这也是 Aveyond 系列的一大特色，希望能继续保持下去。\n\n游戏细节部分制作得非常好，首先地图画质上和 3 代相比有了巨大的提升，并且也加了很多“特技”，人物行走图上还有一些细微动作，感觉到了良心。我非常喜欢 Windy Hills 那里的吊索桥的设计，主角走上去桥会微微晃动一下，感觉很逼真。人物经过不同区域的行走速度都会发生变化，爬梯子人会背过身去，还有脚步声的细节，都非常不错。\n\nAveyond 4 的可玩性非常高，并且我感觉它的解谜成分是所有 Aveyond 系列中最多的，皇宫地下洞窟的迷宫设计得很棒，精灵村图书馆的解谜也很有趣，相比于 Aveyond 1 里面吸血鬼村的那几个猜谜，简直好太多了。战斗系统也是改进了许多，我记得 3 代之前的回合制几乎没有任何的改动，到了 4 代战斗系统终于改了，加了一些新奇的玩法，我想说这不是早就应该这么做了么……支线的任务也蛮丰富的，奖励也不错，最后，好感度系统依然是那么简陋。另外这游戏像 Aveyond 3-4 一样，金钱资源非常稀少，十分考验大家的经济头脑。\n\n说句题外话，Aveyond 4 里面的很多内容都和前作有关系，可能是向前作致敬，不过也可能是制作组在偷懒。但是无论如何，Aveyond 4 如果在玩前作的梗的话，那么刚接触此作品的玩家就会一脸懵逼。首先，依然是万年老梗 Te'ijal 和 Galahad，他们两位出现在 Aveyond [b]所有[/b]系列当中，虽然我承认我比较喜欢 T 姐和 G 叔（称呼好像有什么不对），但是，你们能不能换一些人来客串？[strike]我知道过了这么久了能活下来的只有他俩，别人都老死了[/strike]还有就是 Two-Card Flip Game 里面的卡牌，虽然我玩到最后也不知道这游戏到底该怎么玩，但是里面的卡牌多数借鉴了 Aveyond 3 的人物，例如 Mel, Edward, Gyendal 等。还有 Robin 商店任务里的某个顾客说她怀念 Shaenir 的天气，Shaenir 其实是 Aveyond 2 里面唯一的一个北方城市。总之看到这些梗老玩家表示很亲切，新玩家就算是懵逼也不太影响对剧情的理解吧（大概\n\n好了下面说说 Aveyond 4 的问题。首先我玩通关之后表示剧情气氛是个硬伤，这部游戏从头到尾所有的角色几乎都在讲笑话，这真不是件好事情。然后就是主线里面有某些严重拖延剧情的现象，虽然有传送系统但是主角的移动速度真是太慢了，还是有很多时间花在了跑路上（雾灵妹子上下梯子不减速我也是才知道的）。这个游戏我卡过一次关，就是在解救 Hi'beru 返回 Tor 那里。说实话我真没找到第二个大陆的 Port 在哪，后来一顿瞎找终于在一个很[spoiler]哔[/spoiler]的地方找到了那个 Port 我想说制作组你们是不是故意把 Port 画成那样好让我们看不见的？\n\n总之，Aveyond 4 是一款非常棒的游戏，无论新玩家还是老玩家，都值得去体验一下。", "timestamp_created": 1467713939, "timestamp_updated": 1471183075, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.645389", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23994011": {"recommendationid": "23994011", "author": {"steamid": "76561198031747168", "num_games_owned": 793, "num_reviews": 4, "playtime_forever": 1062, "playtime_last_two_weeks": 0, "last_played": 1454975904}, "language": "english", "review": "I own and played all parts of the Aveyond games series as well as the predecessor, Ahriman's Prophecy (not all are available on Steam, though). What I love about this series is the mixture of rich story and humor, paired with classic RPG elements from the old console days.\nThat said, in Aveyond 4, you start out as a villain. It is quite fun and a worthwhile story. I highly recommend playing this! =)", "timestamp_created": 1467401037, "timestamp_updated": 1467401037, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23893713": {"recommendationid": "23893713", "author": {"steamid": "76561198113610725", "num_games_owned": 62, "num_reviews": 8, "playtime_forever": 1821, "playtime_last_two_weeks": 0, "last_played": 1484426783}, "language": "english", "review": "I haven't yet completed the game, but it's definitely worth the money.\nI waited to Amaranth games to release it on steam and i was so excited to get it.\nI waited 4 years to this game and i have to say - it's just brilliant, everything is so great.\nToday i'm 18 y.o and the first time i played aveyond at age 9 I fell inlove.\n\nThe story so far is really interesting (like in every aveyond games) and fun.\nThe music is more than great as always. The humor always makes me laugh so hard. I just love it.\n\nI played all the aveyond series and none of them were bad. they're more than good and i so recommend this game.\n", "timestamp_created": 1467121873, "timestamp_updated": 1467121873, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.547014", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23862276": {"recommendationid": "23862276", "author": {"steamid": "76561198170625769", "num_games_owned": 142, "num_reviews": 6, "playtime_forever": 1878, "playtime_last_two_weeks": 0, "last_played": 1475950971}, "language": "english", "review": "I have been a huge fan of the Aveyond series. Playing every single game and could play more if they could make more.\n\nAveyond 4 is amazing, fun and in my opinion a game everyone should experience!!! The creators of the game are awesome people. If you like RPG maker games then you need to buy this game asap. One of the best RPG maker games you can find anywhere!\n\nThis Aveyond game has a great story with Boyle which really grows on you. The game itself looks really good, plays really well and I would say 10/10! Also you don't need to play another game to understand what is going on in this game, first story line with Boyle.\n\nPs- I would recommend this series to anyone (and i do) so please support the developers and maybe try the first Aveyond games and work your way into the series!", "timestamp_created": 1467036140, "timestamp_updated": 1467036140, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22568544": {"recommendationid": "22568544", "author": {"steamid": "76561198255233792", "num_games_owned": 38, "num_reviews": 1, "playtime_forever": 16483, "playtime_last_two_weeks": 0, "last_played": 1498808634}, "language": "german", "review": "Sehr solides RPG-Maker Spiel. Macht auf jedenfall Spaß und wenn man sich mit der Graphik von den Makern anfreunden kann, und mehr Wert auf ne gute Story legt ist es auf jedenfall empfehlendswert :D", "timestamp_created": 1461336382, "timestamp_updated": 1461336382, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22504425": {"recommendationid": "22504425", "author": {"steamid": "76561198077786015", "num_games_owned": 82, "num_reviews": 5, "playtime_forever": 7914, "playtime_last_two_weeks": 0, "last_played": 1513718545}, "language": "german", "review": "Wer die Aveyond-Serie kennt, wird auch hier nicht enttäuscht!\n\nDas Spiel hat wieder jede Menge Humor und erzählt eine Geschichte, so dass man immer wieder weiterspielen möchte. \n\nEin paar Mal bin ich steckengeblieben und musste eine Suchmaschine verwenden, um weiterzukommen. Das mag ich eigentlich nicht, aber kenne es von den Teilen davor. \n\nDie Graphik war noch nie so schön (für RPG-Maker-Verhältnisse natürlich), man merkt einfach, dass das Spiel mit Liebe zum Detail gestaltet wurde. \n\nDas Balancing ist sehr gut geworden, die Kämpfe waren nur einmal frustriend schwierig. Da war ich aber schon so gut wie am Ende, und nachdem ich meine gesammelten Level Eggs verputzt hatte war auch das nur noch eine Frage von Geduld und heilender Nahrung (mmm jam, Dämonenkekse). \n\nIch freue mich schon, das Spiel in zwei Jahren nochmal durchzuspielen... und dann noch mehr Seitenquests zu schaffen :-)\n\nWer RGP-Maker-Spiele ablehnt wird mit diesem Titel nicht glücklich. Ebenso wer nicht gerne Spiele auf Englisch spielt. \n\nAnsonsten... Viel Spaß beim Spielen!\n\n", "timestamp_created": 1461008517, "timestamp_updated": 1461008517, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22277076": {"recommendationid": "22277076", "author": {"steamid": "76561198095404968", "num_games_owned": 353, "num_reviews": 204, "playtime_forever": 36, "playtime_last_two_weeks": 0, "last_played": 1459986386}, "language": "english", "review": "The best Aveyond I ever done played, and a pretty good RPG. Much, much funnier and original than what I usually see in the way of RPGMaker fare. The inclusion of a \"Smooth Mode\" finally fixes that choppy camera scrolling, which makes even easier to enjoy the writing and story, since I won't suffer from motion sickness anymore. The plugins all work well, the portraits are clean enough for a comic book, the music and sound effects match the great humor and finely paced cutscenes, and nothing feels like it was forced in. Plus you get to play as monsters, and that's always okay by me. It all comes together for a spooky funny fun time, but no onions. Doesn't need 'em, but it could use 'em.", "timestamp_created": 1459986373, "timestamp_updated": 1459987120, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502712", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22262643": {"recommendationid": "22262643", "author": {"steamid": "76561198283562272", "num_games_owned": 75, "num_reviews": 1, "playtime_forever": 2016, "playtime_last_two_weeks": 0, "last_played": 1505659015}, "language": "english", "review": "I have played all the Aveyond games and thoroughly enjoyed the series. I was very excited to find out and actually play Aveyond 4: Shadow of the Mist. I am very particular in what games I choose to play and stick to only certain types of games such as RPG and adventure, for example. The platform for this game is different than the others and I believe it is a good change. The storyline is also unique, the main character is a retired villain who failed in taking over the world. This is a great change from the same old hero versus villain games. It also has different versions depending on which direction you choose to take in the game. It is humorous, which adds more fun to the game, and I think, the dialogue isn't overdone where you are just clicking to get through it. In addition, there are numerous side quests and secret caves. Overall, I really liked this Aveyond and would highly recommend it. I look forward to more games by this developer in the future.", "timestamp_created": 1459910276, "timestamp_updated": 1459910276, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22201806": {"recommendationid": "22201806", "author": {"steamid": "76561198189070071", "num_games_owned": 15, "num_reviews": 1, "playtime_forever": 23, "playtime_last_two_weeks": 0, "last_played": 1514790276}, "language": "english", "review": "I love this game.. I got a free code from Amaranthia Games.  As I own all the games of this series I will enjoy for a long time. keep up the work", "timestamp_created": 1459618284, "timestamp_updated": 1459618284, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22056492": {"recommendationid": "22056492", "author": {"steamid": "76561198164584011", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 229, "playtime_last_two_weeks": 0, "last_played": 1488055495}, "language": "english", "review": "This is the best Aveyond yet! It was a long wait but so very worth it; a compelling and funny story, interesting characters and lots of great quests. It's a brand new story so you don't have to play the other Aveyond games to follow along with this one, but you should because they're fun too!\n\nI felt that the importance of gear was downplayed somewhat in this game, gearing up to ultimate weapons and armor is one of my favorite elements, but that was my only disappointment.\n\nI did encounter one bug in the game where it froze when I crossed to Windshire via the ferry and I couldn't get passed it no matter what I tried.  However this doesn't hurt my review of the game because I received excellent support.  I brought up the issue in the Aveyond Forum and a developer had me e-mail them my saved file, fixed my saved game so that I could play again and then taught me how to fix it myself if it ever happened again.  Amazing.\n\nSo please keep making more great games, can't wait for the next one!", "timestamp_created": 1458967501, "timestamp_updated": 1458967501, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21953713": {"recommendationid": "21953713", "author": {"steamid": "76561198086359390", "num_games_owned": 15, "num_reviews": 1, "playtime_forever": 3273, "playtime_last_two_weeks": 0, "last_played": 1512156050}, "language": "english", "review": "It's so funny and creative in the way that you're a villain saving the world :3", "timestamp_created": 1458508194, "timestamp_updated": 1458508194, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21897169": {"recommendationid": "21897169", "author": {"steamid": "76561198152595632", "num_games_owned": 24, "num_reviews": 1, "playtime_forever": 4343, "playtime_last_two_weeks": 0, "last_played": 1512187668}, "language": "english", "review": "I have played all the Aveyond games and have loved them all.  They have hours of play and are well written and fun.  They are also clean and I have no qualms about my children watching or playing them.  This latest game is just as good as all the others.  I wasn't sure about it at first as it is a little different platform and the main characters are retired villains, but I have loved it.  It has quite a bit of humor and it is fun to watch the characters try to remain villains while they are being heroes and saving the world.  I look forward to more games by this developer.  They are among my most favorite games.", "timestamp_created": 1458272493, "timestamp_updated": 1458272493, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21594526": {"recommendationid": "21594526", "author": {"steamid": "76561198149511067", "num_games_owned": 5, "num_reviews": 2, "playtime_forever": 1948, "playtime_last_two_weeks": 0, "last_played": 1457400828}, "language": "english", "review": "Lovely game! I've been searching for Aveyond like rpgs being a huge fan of the series, and when I found out that Aveyond 4 was on Steam I was thrilled, I got it as a gift and am sooo happy with it! It really takes you back, old characters from the series emerge, the game play is much as it was in the other ones, lovely music and great maps, battles are a joy, not like other rpgs where it gets tedious, the storyline is interesting, everything is amazing! I greatly recommend it!", "timestamp_created": 1456967973, "timestamp_updated": 1456967973, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21585194": {"recommendationid": "21585194", "author": {"steamid": "76561198258354526", "num_games_owned": 45, "num_reviews": 5, "playtime_forever": 1685, "playtime_last_two_weeks": 0, "last_played": 1456954588}, "language": "dutch", "review": "I've been an Aveyond fan ever since Rhen's quest and though I liked this game less than its predecessors, I was still hooked and played probably a bit too much these last couple of days :)\nThe bad guy (though naughty would probably be a better word, I LOVE Boyle, he's adorkable <3) turns good without him even noticing it was a real nice break from \"innocent hero saves the day, the world, and gets the girl\".\n\nWill certainly replay! (And come on, Amarant! Put on Rhen's and Ean's Quest on Steam too!)", "timestamp_created": 1456931992, "timestamp_updated": 1456931992, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21558878": {"recommendationid": "21558878", "author": {"steamid": "76561198064939209", "num_games_owned": 84, "num_reviews": 8, "playtime_forever": 3897, "playtime_last_two_weeks": 0, "last_played": 1484000974}, "language": "english", "review": "This game is fantastic! The story is great, it is super funny to read all the dialogue, the characters are all very loveable, the music is beautiful, the game takes a while to complete (I am not even half way through it yet), it just is absolutely breaking all my expectations ten fold! I cannot recommend this game strongly enough. I have been playing it non-stop sense I got it. It really brings me back to the old games, which by the way, its just as good as those for sure.", "timestamp_created": 1456811951, "timestamp_updated": 1457502993, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21360963": {"recommendationid": "21360963", "author": {"steamid": "76561198273309214", "num_games_owned": 12, "num_reviews": 1, "playtime_forever": 7, "playtime_last_two_weeks": 0, "last_played": 1456051520}, "language": "english", "review": "I absolutely love Aveyond Games.  This one is different from the others, in the sense that you are playing a villian(ish) as opposed to a hero-but it allows for some great dialogue and a different game-and I liked it.  My favorite character was the Raven Lord-he has some great lines.  Aveyond is fun to play, and I am always sad when I finish the game, because it means I'll have to wait for the next version to come out.  If you are looking for interesting quests and funny dialogue, give this game a try.\n(I was provided a game key to type this review, because I'd already bought the game before it came out on Steam.  I buy the games the day they come out-but I'm excited they are on steam now).", "timestamp_created": 1456051525, "timestamp_updated": 1456051525, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.506579", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21341897": {"recommendationid": "21341897", "author": {"steamid": "76561198245904592", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 13, "playtime_last_two_weeks": 0, "last_played": 1454883072}, "language": "english", "review": "I have never been a huge gamer, but I have loved all of the Aveyond games and \"Aveyond 4: Shadow of the Mist\" has been one of my favorites. When I heard another Aveyond game was coming out, I bought it the moment I could and I definitely didn't regret it.\n\n This game was the perfect mix for me. It is hilarious, quirky, and had a fun story line; I have never played a game where a retired villian was the reluctant hero (but don't let him hear you call him a hero- it would affend him). The characters were fun and it was enjoyable to see what they would do and say next.\n\nI also liked the basic set-up of the game. There were one of two large quests to work on throughout the game, which were made up of various smaller quests. There were also side quests that there was the option of working on that I had a lot of fun with. I enjoyed them so much that I refused to fight the final battle until I had finished all of them. I liked the end of the game and I'm probably going to go back and work towards the other possible endings.\n\nThe one downside of the game for me was that it sucked me in. ;)  I went to work quite a few times with bleary eyes, because I was enjoying myself too much and wanted to do just one more quest. It was hard for me to resist.\n\nI received a free steam key to write a review. However I originally bought it through Aveyond.com. It is definitely worth purchasing. :)\n", "timestamp_created": 1455980847, "timestamp_updated": 1455980847, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21265986": {"recommendationid": "21265986", "author": {"steamid": "76561198245094182", "num_games_owned": 12, "num_reviews": 2, "playtime_forever": 9551, "playtime_last_two_weeks": 0, "last_played": 1495905144}, "language": "english", "review": "I am a full-on Aveyond Kingdom fan. Amaranth/Aveyond Kingdom and John Wizard are my 2 favorite game makers, and they frequently collaborate with each other. Their games are reminiscent of the old Square Soft games, for the Super Nintendo with strong stories and fun sidequests. They are as much fun as The Legend of Zelda or any early Final Fantasy game ever was.\n\nAveyond Kingdom’s Aveyond 4, Shadow of the Mist is in many ways, a more polished production than their earlier work.  The graphics and backgrounds are the best they have produced by far. The storyline is both deep and hilarious, and the characters are, for the most part, engaging.\n\nThis game incorporates the traditional elements of puzzle-solving, action, and adventure into a neat and enjoyable package. There are the usual elements of high fantasy, with the characters ruthlessly poking fun at themselves. The enemies are creative and fun to fight.\n\nBecause they are failed villains, Boyle and Ingrid are unhappily in love, and that storyline adds ongoing humorous elements. Myst and Robin are naive and make good foils for Boyle and Ingrid. Hi’beru and Rowen arrive later in the game, and Phye arrives so late I did wonder why he was included at all. As a Draghar, Phye does have some power, but I think like a writer, so in my opinion, all the characters should be in place at the midpoint. Because he arrives so close to the end, we don’t get to know him as well as I would have liked.\n\nI purchased the game the day it was released. I have played the game through to the end four times. The first time through, I had Ingrid join Lorelei’s coven and married her off to Boyle. With that scenario the game played smoothly with no glitches. I was in love with the game!\n\nThe second time through I had Ingrid join Jinx’s coven, but when I tried to complete the task of selling the craft in Robin’s store, the game froze and I had to take drastic measures to close the game down. No matter what I did, in this scenario the game froze at that point every time.\n\nSo I went to their website and, following the suggestions in their forums, I reinstalled the game. I never got past that point on that particular attempt.\n\nSo I started a new game, and that time I had her join the transformations coven. This went well for the most part, but with one major flaw. Ingrid gained the ability to transform into a dragon, but the skill didn’t appear in her menu. When I went out to the forums to see how to solve that, the answer was that it would be resolved in the next build. I was disappointed, as I did want to have the ability to play her as a dragon.\n\nHowever, that time I married Ingrid off to Hi’beru, which was cute.\n\nThe environments that the game is set in are lush and beautiful, dark and moody. The music is amazing and really contributes to the enjoyment of the game.\n\nThe game is fun, hilarious, and when it works properly, it’s a great way to spend 25 or so hours.\n", "timestamp_created": 1455677061, "timestamp_updated": 1455677061, "voted_up": true, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.531250", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21250527": {"recommendationid": "21250527", "author": {"steamid": "76561198026026011", "num_games_owned": 7, "num_reviews": 1, "playtime_forever": 8, "playtime_last_two_weeks": 0, "last_played": 1455623297}, "language": "english", "review": "I received a free download key for this in exchange for leaving a review as I purchased the game from the website directly.  It is a fantastic game, I've already played it through once and I am currently working on the 2nd time around and have already found stuff I missed 1st time.  A lovely little RPG with a sense of humour and various quirky characters, the ending changes according to choices made during the game so playable again and again.  Have purchased the entire Aveyond series of games over the years and love all of them, I would find it difficult to choose a favourite.", "timestamp_created": 1455623315, "timestamp_updated": 1455623315, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21243275": {"recommendationid": "21243275", "author": {"steamid": "76561198012776484", "num_games_owned": 30, "num_reviews": 7, "playtime_forever": 374, "playtime_last_two_weeks": 0, "last_played": 1459992316}, "language": "english", "review": "This game is very amusing, mainly due to the writing.  The anti-hero turned hero is a great premise.  The best feature is the click pathfinding.  It can sometimes relieve you of manually walking around a large obstacle like a tree to get to a place you can see on the screen.", "timestamp_created": 1455586082, "timestamp_updated": 1455586082, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21223296": {"recommendationid": "21223296", "author": {"steamid": "76561198259562846", "num_games_owned": 39, "num_reviews": 1, "playtime_forever": 1233, "playtime_last_two_weeks": 0, "last_played": 1496294128}, "language": "english", "review": "Aveyond does it again.", "timestamp_created": 1455511460, "timestamp_updated": 1455511460, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21192200": {"recommendationid": "21192200", "author": {"steamid": "76561198123765531", "num_games_owned": 93, "num_reviews": 25, "playtime_forever": 3150, "playtime_last_two_weeks": 0, "last_played": 1506991407}, "language": "english", "review": "20 hours in and I've finished my first playthrough.  I loved this game!  I'm a big fan of the whole Aveyond series.  This one ties in nicely to the other games, but you can definitely play it without having played the others - there's just little bonus jokes and such that you only get if you've played all the games.  The dialog is funny, clever, cute and well-written.  All the grammar and spelling is correct (one of my pet peeves is games with incorrect grammar and spelling, the Aveyond ones are safe from that).\nThis is an RPG Maker game with very cute sprites.  The sprites are very nice, and you can actually tell which sprite is which character.  The art (the non-RPG maker generated art) is lovely; the character art in particular was great, with very expressive faces (that actually looked like realistic emotions instead of something out of a Looney Toon).\n\nI recommend this to anyone with a good sense of humor, and anyone who likes RPGs.  If you liked the other Aveyond games, you'll almost certainly enjoy this.  If you liked Cthulhu Saves the World, you'll like this (IMO this is better than Cthulhu - the art is nicer and you can actually follow the maps).  Try the demo, it's a good representation of the game play.", "timestamp_created": 1455404767, "timestamp_updated": 1455404767, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21183274": {"recommendationid": "21183274", "author": {"steamid": "76561198092573192", "num_games_owned": 400, "num_reviews": 23, "playtime_forever": 1239, "playtime_last_two_weeks": 0, "last_played": 1455380735}, "language": "english", "review": "yep, its an Aveyond game alright\n\nits an improvment\nall the charecters and NPCs are quirkys and the jerks gets hit really hard\nthe main character even tho i hated him at first for being uncompetance \nbut then you find out that he has a really nutral funny theme that gose around for him\n\nthe game has a marrage endings kinda like in aveyond 1\nand random cameos from the previous games\n\nthe music and the rpg maker gameplay is  decent \n\nthe only gripe i have with the game is that just like the rest of the aveyond series you will need a guide in order to not get stuck in a majore quests in a crap lead of locations to go from\nand some of those quests require you to go look for a random NPCs in a really big towns\n\noverall i advise jumping at this 4th instalment in the series\nits has a really good funny jokes and King Midas golden touchs refrance that gose around with it", "timestamp_created": 1455381775, "timestamp_updated": 1455382007, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.412493", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21164848": {"recommendationid": "21164848", "author": {"steamid": "76561198086212393", "num_games_owned": 10, "num_reviews": 3, "playtime_forever": 1284, "playtime_last_two_weeks": 0, "last_played": 1459423834}, "language": "english", "review": "Tottaly worth it, the story was hilarious, funny, and excellent art tho\nI've been playing Aveyond 2 & 3 too but this was the best from Aveyond series IMO", "timestamp_created": 1455322225, "timestamp_updated": 1455322225, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21137102": {"recommendationid": "21137102", "author": {"steamid": "76561198098699280", "num_games_owned": 18, "num_reviews": 1, "playtime_forever": 1012, "playtime_last_two_weeks": 0, "last_played": 1485019768}, "language": "english", "review": "Aveyond is a wonderful series of RPG games. It reminds me of those old school games like Pokemon and Zelda, but the storyline is a lot stronger. The characters are likable, the dialogue is actually hilarious, and there's a great balance between quests and battling.\n\nI've played (and loved!) all of the previous Aveyond games, but you could even start with this game if you've never played an Aveyond game before.", "timestamp_created": 1455225816, "timestamp_updated": 1455225816, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21097882": {"recommendationid": "21097882", "author": {"steamid": "76561198235921380", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1813, "playtime_last_two_weeks": 0, "last_played": 1454955761}, "language": "danish", "review": "didnt feel like aveyond. it took me about 30 hours to finish, and that good. but theres so many cons. it seemed to easy to figure out.\ndont buy.", "timestamp_created": 1455096691, "timestamp_updated": 1455096691, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497512", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21096618": {"recommendationid": "21096618", "author": {"steamid": "76561197996696153", "num_games_owned": 180, "num_reviews": 2, "playtime_forever": 114, "playtime_last_two_weeks": 0, "last_played": 1455089855}, "language": "english", "review": "As a long time fan of the Aveyond series, I was excited to hear Aveyond 4 finally come out, and purchased it the day of release.  Soon, I got a free key for Steam from the developer and am excited to see this title finally out on Steam!  I completed the game in a blind playthrough in about 26 1/2 hours between Steam and the non-steam installer.\n\nThis game has all of the humor of the other games in the series, but has the unique twist of featuring a villain as the protagonist!  Some of the ongoing storylines from previous games find their way into this one as various cameos, which will appeal to fans of the series.\n\nAs for the game itself, it's a fairly easy to pick up RPG.  Instead of the archetypical classes you find in other fantasy based games, each character has their own set of skills and abilities, and each character obtains their abilities in different ways.\n\nThe story is engaging, and even the side quests are interesting and entertaining.  My only complaint is that the difficulty of the monsters in the last zone of the game is FAR above the difficulty found in the rest of the game... for instance, the monsters in the previous zone would hit my characters for 1, but in the final zone could kill with bad RNG.\n\nAside from that nitpick, the game feels polished and plays well on an XBox One controller, despite having to use an analog stick instead of a D-pad.  My only suggestions for improvement are the lack of a scaling full screen mode, and the ability to remap controls.\n\nIf you like engaging, story-driven RPGs, Aveyond 4 - or any Aveyond game, really - is for you.", "timestamp_created": 1455090746, "timestamp_updated": 1455090746, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21090082": {"recommendationid": "21090082", "author": {"steamid": "76561198270969577", "num_games_owned": 13, "num_reviews": 1, "playtime_forever": 2292, "playtime_last_two_weeks": 0, "last_played": 1454891343}, "language": "english", "review": "Great game! I have always loved the Aveyond games, but this one is especially comical, I recommend it 100%", "timestamp_created": 1455064870, "timestamp_updated": 1455064870, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21064217": {"recommendationid": "21064217", "author": {"steamid": "76561198097603192", "num_games_owned": 86, "num_reviews": 8, "playtime_forever": 632, "playtime_last_two_weeks": 0, "last_played": 1455229340}, "language": "english", "review": "What a great game, pretty funny and the story got me engaged. At that low price I'd say it's a must buy.", "timestamp_created": 1454974641, "timestamp_updated": 1454974641, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.498424", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21042891": {"recommendationid": "21042891", "author": {"steamid": "76561198120157127", "num_games_owned": 211, "num_reviews": 17, "playtime_forever": 2566, "playtime_last_two_weeks": 0, "last_played": 1455830676}, "language": "turkish", "review": "Zaten unutulmaz bir seridir Aveyond. Bu oyunuda diğer Aveyond oyunlardan eksik kalır bir yanı yok hatta diğer oyunlarından farklı bir havası var. Karakterleri, müzikleri, hikayesi herzamanki gibi etkileyici. Az da olsa bu tarz oyunları seviyorsanız yada kararsız kaldıysanız mutlaka alın gerçektende buna değer. \nEn azından indirime girmesini beklerseniz oldukça ucuz bir fiyata böyle bir sanat eserini alabilirsiniz.", "timestamp_created": 1454900775, "timestamp_updated": 1485896505, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21030408": {"recommendationid": "21030408", "author": {"steamid": "76561198161021610", "num_games_owned": 7, "num_reviews": 2, "playtime_forever": 699, "playtime_last_two_weeks": 0, "last_played": 1455639304}, "language": "english", "review": "Hello,\n\nfirst I must say that I've completed the game four times already, because I bought it on the official web when it came out and got a free steam key as a present, so this is the 5th time I play it. I've been following Amaranth Games since Aveyond 1 and I'm a huge fan of Aveyond series and JRPG in general.\n\nI highly recommend this game, because first of all it is really enjoyable and fun to play, you don't get bored while playing and that is very important for me as a player. It contains so many funny situations and exellent humour, characters that are not your everyday cliché heroes, beatiful maps and places to visit, and don't get me start about those amazing puzzles and dungeons. I mean you really need to try the Halaina Dungeon, it's one of my fav things in the game. You also can do many other things like: joining a coven, marry your characters, join the night watch...yes there is a night watch and quests that you need to complete at night, collect some cute things, pumpkin smashing etc. You can choose between 3 covens and 3 characters, and 3 difficulty modes to play, so the game has a replay value as well. So give this game a chance, trust me, you won't regret it :)\n\nKudos to Amaranth Games team for making another beautiful and highly enjoyable game :)\n\n\nMoony\n\n\n\n", "timestamp_created": 1454864892, "timestamp_updated": 1454864892, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21006956": {"recommendationid": "21006956", "author": {"steamid": "76561198074709322", "num_games_owned": 11, "num_reviews": 1, "playtime_forever": 58, "playtime_last_two_weeks": 0, "last_played": 1494137088}, "language": "english", "review": "dank ass shit", "timestamp_created": 1454791516, "timestamp_updated": 1454791516, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.458015", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20997440": {"recommendationid": "20997440", "author": {"steamid": "76561198104808403", "num_games_owned": 7, "num_reviews": 1, "playtime_forever": 44, "playtime_last_two_weeks": 0, "last_played": 1454767993}, "language": "english", "review": "I have always liked Aveyond RPGs.  This one was no exception. I actually played most of this from another source before it became available on Steam where I was issued a free steam key and finished the game.  If you haven't played the other Aveyond Games that preceed this one, then you really should play them in order or you lose most of the story and there will be spoilers.  These games are just fun, light and quick.  They have good characters, enough puzzles to make some areas challenging, and you can control some of the outcomes based on your decisions.  This particular game I realized after the fact that I needed to do some side-quests first that would've made my gaming much easier as far as money drops (Robin's Store and Sid's Riddles).  I also learned that I missed some side-quests with dolls by not answering certain questions 'correctly'.  Yet, that is part of the fun of the game.  You can play it again focusing on different characters in your party and following different side-quests while following the main quest.  I really liked this game and always look forward to the next Aveyond release.", "timestamp_created": 1454768728, "timestamp_updated": 1454768728, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20986799": {"recommendationid": "20986799", "author": {"steamid": "76561198106383127", "num_games_owned": 14, "num_reviews": 1, "playtime_forever": 8, "playtime_last_two_weeks": 0, "last_played": 1454734391}, "language": "english", "review": "Although it looks like I haven't played much of this game, in reality I have beat it! I received a free copy of this game on Steam after purchasing it from another source in return for writing this review. In my game, I've played around 40 hours, and it was all an absolute delight! \n\nAveyond has been a series I have been playing since I was a little girl, and I've always eagerly awaited all the additions to the series. By far, Aveyond 4 has been my favourite contribution. Although it says Aveyond '4', don't let that fool you! This game is very much a standalone game. It's set in the same universe as the previous Aveyond games, but other than a few teeny tiny references that don't matter much to actual gamepla\ny, you don't need to play previous games! Still, I think this game would be an amazing beginning to an Aveyond journey, and I sincerely hope anyone who purchases this game goes back and plays the past games. <3 \n\nThis game is in a style I adore, and the plot is fantastically witty, along with dialogue that can compare to some of the most popular games on the market. It's so damn funny! Buy this game people! You won't have any regrets!", "timestamp_created": 1454734421, "timestamp_updated": 1454734421, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20985383": {"recommendationid": "20985383", "author": {"steamid": "76561198203872847", "num_games_owned": 67, "num_reviews": 1, "playtime_forever": 1658, "playtime_last_two_weeks": 0, "last_played": 1456110813}, "language": "english", "review": "Best of the Aveyond titles thus far. The humor and references to RPGs in general are the best part. It's fun to play a retired villian finding his puppy (wolf minion).", "timestamp_created": 1454728944, "timestamp_updated": 1454728944, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20983031": {"recommendationid": "20983031", "author": {"steamid": "76561198124500701", "num_games_owned": 50, "num_reviews": 2, "playtime_forever": 811, "playtime_last_two_weeks": 0, "last_played": 1486915884}, "language": "english", "review": "I have played Aveyond since I was seven, in 2006. I watched my mom play the first. My brother and I would help my mom by trying to figure out hard places. I loved it, and by the time the second game was released, my mom let us play it. I love role playing games, and these are my favorite. I loved playing the previous games. This game started out great! I am not going to spoil anything, but let's just say there has been a really cool change in the series, and when you play, you will figure it out! Amaranth Games, you have blown me away since I was seven, and you will continue to do so in the future! Thank you so much for creating a really cool and funny bond between me, my brother, and our mother!", "timestamp_created": 1454719997, "timestamp_updated": 1454719997, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20982745": {"recommendationid": "20982745", "author": {"steamid": "76561198049056580", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 1370, "playtime_last_two_weeks": 0, "last_played": 1495274291}, "language": "english", "review": "I've been a fan of the Aveyond series since the first game, and Amaranth Games just keeps topping themselves each time they come up with a new title. \nI've had a blast playing the game - and now that I have it on steam I'll be sure to replay it over and over again!\n", "timestamp_created": 1454718986, "timestamp_updated": 1454718986, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20975398": {"recommendationid": "20975398", "author": {"steamid": "76561198044472948", "num_games_owned": 135, "num_reviews": 1, "playtime_forever": 22485, "playtime_last_two_weeks": 0, "last_played": 1515000162}, "language": "english", "review": "I love this game!  I have played and enjoyed all of the games in this series.  I love the dialog and there is so much to explore.  I highly recommend it!  My fiance bought it for me when it was first released and it came with a free steam code.  I have played around 63 hours (before I got the Steam code for it).  Like with the other Aveyond games, you can play it oer and over and notice something new and different each time.", "timestamp_created": 1454697973, "timestamp_updated": 1454698207, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.564496", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20973927": {"recommendationid": "20973927", "author": {"steamid": "76561198071190703", "num_games_owned": 30, "num_reviews": 4, "playtime_forever": 1741, "playtime_last_two_weeks": 0, "last_played": 1454692845}, "language": "english", "review": "If you're a fan of the previous Aveyond games, you'll enjoy this one. If you've never played them before, you'll still enjoy this one! Its a shorter RPG, or at least it feels like it, and the writing and humor are wonderful. The \"fast travel\" isn't really fast, which is kind of a problem, and so there's a lot of walking with no real way to make it go faster, A few of the puzzles and sidequests are a bit obtuse at times, but thankfully the creator's website has the answers to just about all of them, if you don't feel like buying the strategy guide. \n\nA few of the jokes will be funnier if you've played previous installments but this is largely unconnected to the previous three games in the series and easy to enjoy if you're new to the series. (Just remember, if you do go back to play the other games, that the first two are nearly ten years old now and the age shows.)", "timestamp_created": 1454693513, "timestamp_updated": 1454693513, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20970705": {"recommendationid": "20970705", "author": {"steamid": "76561198123832550", "num_games_owned": 88, "num_reviews": 7, "playtime_forever": 740, "playtime_last_two_weeks": 0, "last_played": 1481320858}, "language": "english", "review": "I was offered a free steam code to write a reveiw on this game. This game has appealing graphics and the dialougue/ cutscenes are funny(sometimes)/entertaining. The characters are well built and it is easy to get attached to them. The gameplay is challenging and it keeps you wanting more. They added new concepts to the game and the developers definitly stepped up their game to make this fantastic game. I highly recommend this game for everyone. 10/10", "timestamp_created": 1454683861, "timestamp_updated": 1454683861, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20969443": {"recommendationid": "20969443", "author": {"steamid": "76561198065290207", "num_games_owned": 467, "num_reviews": 44, "playtime_forever": 83, "playtime_last_two_weeks": 0, "last_played": 1454678747}, "language": "english", "review": "Aveyond 4: Shadow ofthe Mist is everything I longed for in an old school rpg. Great storyline. Fantastic mazes. Good adventuring. Hilariously funny plot turns. Nice 8 bit chip tunes. \n\nThis game is very compareable to 'Secret of Mana' or 'Legend of Zelda: A Link to the Past' which were both for the SNES console.\n\nThis game is a breath of fresh air for the retro rpg genre. Do not pass this up!\n\nGameplay:\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=616470116", "timestamp_created": 1454679808, "timestamp_updated": 1454679808, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.517634", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20962632": {"recommendationid": "20962632", "author": {"steamid": "76561198271121149", "num_games_owned": 22, "num_reviews": 1, "playtime_forever": 158, "playtime_last_two_weeks": 0, "last_played": 1514430347}, "language": "english", "review": "I have been a long-time fan of all the Aveyond games--they've followed me through childhood--and playing Aveyond 4 as an adult has been a great way to come back to the series. Each of the games is their own experience, and while in certain narrative ways Aveyond 4 feels like a regression, as far as gameplay goes, the series has grown in some fantastic ways. Though I feel as though the protagonist was the wrong choice for this game, the game maps are extensive and rewarding, and the arc of the game is smooth and fulfilling. The way the game plays is excellent, and the narrative aspect mostly provides context for how to view it, so although I was largely disappointed in the story of the game, I loved Aveyond 4 as a whole.\n\nOverall, I had a great experience and would wholly recommend it. That said, this review is largely narrative critique. \n\nTHE NARRATIVE:\n\nNarratively, Boyle felt like the wrong choice for the protagonist. He is not engaging as a main character--the humor regarding 'retired villains' and 'heroes' fell flat, and it felt reductive. The best part about him was his relationship with his dog, but that dedication is not enough to make a protagonist. An attempt at humor regarding evildoing in a comical tone is not enough to make a protagonist, either. While the backstory about how he found his dog as a pup was touching, it does not offer strong enough motive for him to be the main character of this story. He is mostly a static character. While he does admit that doing good is pretty good, it is dulled by the joke of it all, and the retired supervillain aspect diminishes the entire relationship of good and evil. Basically, it seems as though he was truly good all along, and the only amount of growth is in his awareness of this, and it is not enough to drive an entire game. His personal stake in this journey is not, narratively, the strongest one.\n\nBoyle is looking for his dog; Myst is looking for her brother. In order to find his dog, Boyle must find Myst's brother, who was snatched by a demon. Even the game's title, \"Shadow Of The Mist\", suggests that Myst is the one with more to lose, here. Boyle plays the reluctant hero, but it is irritating to have what feels so much like Myst's story filtered through this flat, reductive joke of a retired supervillain. Myst has never been away from the mountain, and while she also needs to find her little brother, she longs to see the sights outside of The Mist. She has so much to learn, so far to go. She has the most reason to go on this journey to defeat the demon and save her brother, and she has the farthest to grow. She is the most dynamic character, at a tipping point of her life.\n\nIf Myst were the main character, the framing of this game would've been much more powerful--and it would've offered a kind of serious beauty to it, too. In that way, it would mirror Aveyond 2, which was personally an extremely successful, gorgeous game with a very gentle, fairy-tale like story. This still would've been light-hearted in (many ways, and a grand heartfelt adventure, but it would've also had the background context of a fairy-tale. This game could've so easily been absolutely incredible, beautiful, had Myst been the protagonist. She has every reason to be. Also, her background as a Myst Wraith is so much more compelling than the dull, simplifying joke of the Retired Supervillain.\n\nTHE GAMEPLAY: \n\nThe maps are beautiful. They are detailed, extensive, and so very rewarding. The chests are set up so that they can be seen when strolling on the most obvious paths, and while it does take some challenge to look for them, it is not to the point of frustration. Taking the effort to go the long way around for a chest that was seen ten minutes earlier is always worth the effort. The color schemes of the maps are brilliant, well-thought, and the layouts of all the buildings are varied, textured, not tired and reused. Each part of the journey has its own distinctive map which feels like its own little area within a larger world, which helps create a better idea of this lush, full world of Aveyond. The only complaint here is that some of the maps are so ambitious that they lag on soe systems. I also loved how purposeful all the sidequests were; everything was important.\n\nThe battle system is set up in a spin of the traditional turn-based system. It makes battles so much less tedious. Each character has a different role in battle, with their own pros and cons, and it is very fun to think about how best to use each character. Myst has a few different abilities, including a healing and shapeshifting one, and using these abilities does not require a cost of mana or skill point, although it does mean that these abilities aren't as powerful as ones that would have a cost. Boyle's darkness points are replenished with physical attacks, and he uses these same points to cast magic, and it is very fun to have a wizard type who is also a formidable physical attacker--in addition to his minion, whose attacks add additional damage at every turn. Those are only two of the characters, but all of them have roles that aren't so simple as deducting a mana / skill point cost. The character battle roles are fun, and the battles demand a measure of attention that makes it so they aren't a matter of grinding through the same predictable battle rhythm again and again. It's more fluid than that.\n\nThe only thing I would say is that there are many characters who get introduced too late in the game to really develop an affection for them, or a feel for their role in battle, so they don't get the opportunity to shine. It's more difficult to care about them, when there is so little time to get familiar with them.\n\nLASTLY:\n\nIn a lot of ways, I do not think Aveyond is the right arena to even attempt deconstructing Heroes or Villains--that seems more the space of cape comics and games inspired by those. It felt odd and uncomfortable to reference that type of Hero vs. Villain relationship in a largely original, fantastical world such as Aveyond. Also uncomfortable in the game was the way sprites from popular anime series appeared in prominent side quest characters, as if, no one would notice Hetalia sprites or Chi from Chobits acting in ways that seemed to serve no purpose, no reference, to their original series at all. It was not right to include representations of those licensed designs in this original game being sold for its own profit. Original sprites should have been made by the Aveyond team. Both of these aspects broke immersion of Aveyond as the world of Aveyond, an original fantasy world with, largely, its own mythos which does at times reference outside ones, like Aveyond 2 and the Snow Queen, and moments like referencing the Fruit of the (Greek) Gods (a pomegranate) in Aveyond 1.  \n\nIn terms of media representation, the Aveyond series made such an impact on me as a kid realizing that girls and women were powerful, complex characters, and to see them in positions of power, as heroes unqualified by the acts of men, it was incredible. And honestly, if I wanted to play a game about a man, I'd look literally anywhere else. That was one of the first reasons why Boyle failed as a protagonist for me. He has nothing to add to the conversation. He is not refreshing in any way. There are countless characters like him, and there are so few respectful representations of women in games, especially Fantasy ones known for their trope of women as reward for the (male) hero's triumphs, damsels in distress, or as vile and petty temptations of evil.\n\nAll this said: I loved this game. It may be because I played it most recently, but it was my favorite game to play. But, narratively, it doesn't compare with Aveyond 1 or Aveyond 2 and the way those games stayed in my heart. I still had a blast, though, and am looking forward to replaying it\n\n*Disclaimer: I received a free Steam key for this review, and I originally got the game elsewhere.", "timestamp_created": 1454648710, "timestamp_updated": 1454648842, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20962569": {"recommendationid": "20962569", "author": {"steamid": "76561198044642049", "num_games_owned": 123, "num_reviews": 1, "playtime_forever": 52, "playtime_last_two_weeks": 0, "last_played": 1454648033}, "language": "english", "review": "I've been a fan of Aveyond games since the first one came out, and Aveyond 4 is no exception. This is a very fun game, as you are playing as a villain, and he's just as sarcastic and witty as I would have expected. This game is awesome, and a lot of fun.\n\nDisclosure: I purchased this game when it originally came out, and received a free Steam key when it was released on Steam.", "timestamp_created": 1454648355, "timestamp_updated": 1454648355, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20961880": {"recommendationid": "20961880", "author": {"steamid": "76561198096445862", "num_games_owned": 81, "num_reviews": 20, "playtime_forever": 8, "playtime_last_two_weeks": 0, "last_played": 1454644360}, "language": "english", "review": "THIS MAY CONTAIN SPOILERS!!!\n\nFor my review, I'd give it 4/5 (but totally recommend it!). Mainly because I kinda didn't like the art. It really could have been better. \n\nThe music on the other hand was (and I quote Sid!) grandiose! Music (for me) is the most important thing in a video game lacking voice over. aveyond 4 blew my mind with its music. My favorite tracks were the ones playing in Ulrock, Delamere and Halaina. \n\nThe story was really fun; I enjoyed every bit of it. And I loved how every party member had their own little endings and the consequences of the sidequest we played too!\n\nMy favorites were Myst and Hi'beru. Really loved it when Myst angered Boyle. And how Hi'beru always came to rescue when dreams were involved.. and that ending with the gladiator? Priceless!!!\n\nI had Ingrid paired with Phye in my game just because I didn't like her with Boyle. Call me silly, but I think he and Myst have much more chemistry :P\n\nBesides, Ingrid deserves a strong man and Phye was prefect.\n\nHinting that Boyle has some connections with the Pendragons was interested. I'd love to see this idea being expand on in the future. It really sets the bases for a new game *wink wink*\n\n \nRegarding the curse; my theory is that Boyle did break it. Remember that moment when he was like \"Fang is my true love\"? this is a type of unconditional love. Because as far as I know, love extends beyond romance type. So, I think Ingrid knows that too but didn't tell Boyle else her plan will fail. Anyone else thinking the same thing?\n\n \n\nA side note; mentioning the suggested subtitles for the game which was posted originally on Facebook dring the ending scene actually made me scream because I was one of the peeps who suggested a subtitle for Aveyond and my submission was considered (albeit for a book about Boyle but anyway)! It made me really, really,really,really,REALLY HAPPY to see it in-game. Thanks so much Aveyond Dev team!\n\n \n\n Oh and since I also got the strategy guide, I'd like to point out that it's not as helpful as I expected. I found myself surfing the forums more than reading the guide. \n\nFor example, it only mentioned that Myst can get a bear amulet but doesn't mention how to get it and from where. Also that part about Rowen's sword singing skill was not written. I accidentally stumbled upon a topic on the forum discussing it. \nHowever, it came handy when I was looking for the goodie caves before solving Sid's puzzle.\n\nFinally; I'd like to metin that I got this game when it was first released in December from aveyond Kingdom sit, and as soon as the game was released on Steam,  I got a free Steam key, so, I would like to thank Amanda and the team for this. Many other developers forget about the loyal fans as soon as the game is greenlit on Steam *cough* Bethesda *cough* :)\n\n\nI look forward to playing more games from you!", "timestamp_created": 1454644396, "timestamp_updated": 1499523685, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "20955440": {"recommendationid": "20955440", "author": {"steamid": "76561198173253221", "num_games_owned": 57, "num_reviews": 1, "playtime_forever": 563, "playtime_last_two_weeks": 0, "last_played": 1497589814}, "language": "english", "review": "This is a great addition the the Aveyond games! Great characters, pleasing graphics (2D), and an awesome, quirky story! Hours of entertainment! I HIGHLY recommend Aveyond 4! \n\n*Note: I originally bought the game on Aveyond.com when it was first released. The developers gave free steam codes for the game!", "timestamp_created": 1454616043, "timestamp_updated": 1454616043, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20949007": {"recommendationid": "20949007", "author": {"steamid": "76561198117140649", "num_games_owned": 79, "num_reviews": 2, "playtime_forever": 1388, "playtime_last_two_weeks": 0, "last_played": 1454947195}, "language": "english", "review": "So so fun! Really well written, made me laugh so many times. The quests are entertaining and unpredictable. Loved the references to the other games.\nWell worth a purchase!", "timestamp_created": 1454590535, "timestamp_updated": 1454590535, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20948127": {"recommendationid": "20948127", "author": {"steamid": "76561198112991085", "num_games_owned": 44, "num_reviews": 1, "playtime_forever": 1233, "playtime_last_two_weeks": 0, "last_played": 1495022497}, "language": "english", "review": "I have enjoyed playing this game and I hope others will try it, because it is fun and addictive to play.", "timestamp_created": 1454585706, "timestamp_updated": 1454585706, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20945630": {"recommendationid": "20945630", "author": {"steamid": "76561198155833291", "num_games_owned": 6, "num_reviews": 1, "playtime_forever": 11, "playtime_last_two_weeks": 0, "last_played": 1454570614}, "language": "danish", "review": "This is by far one of the best games i have played, i always loved all of the aveyond games, there is so many hours playtime, and a very good story, and so many quest so the game never gets boring. \n\n", "timestamp_created": 1454570618, "timestamp_updated": 1454570618, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20943390": {"recommendationid": "20943390", "author": {"steamid": "76561198097642631", "num_games_owned": 47, "num_reviews": 2, "playtime_forever": 10, "playtime_last_two_weeks": 0, "last_played": 1454554634}, "language": "turkish", "review": "A fun, hillarious game. Best one of the series I think. A villain turned into the hero thing was awesome, with silly,idiotic paladins running like chickens. :D  :D It was really setisfiyng to see one of the most annoying creatures from earlier serious finally got what they deserved :D I am saying only one thing about that. :D Herculessss finally. :D I recommend for everyone to play this game and others from Aveyond world.  It will be a fantastic journey like none other. :D", "timestamp_created": 1454554653, "timestamp_updated": 1454554653, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20943345": {"recommendationid": "20943345", "author": {"steamid": "76561198279406881", "num_games_owned": 103, "num_reviews": 1, "playtime_forever": 73, "playtime_last_two_weeks": 6, "last_played": 1515480277}, "language": "english", "review": "I've always enjoyed the Aveyond series, and this one is no exception!  The storyline is great and the character dialogues crack me up.  If you like turn-based rpgs and rpg maker games, this one is for you!  I haven't beaten it yet, but I am enjoying every minute of the experience.  I purchased this game on aveyond.com and received a free steam code.", "timestamp_created": 1454554451, "timestamp_updated": 1454554451, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20940499": {"recommendationid": "20940499", "author": {"steamid": "76561198143332886", "num_games_owned": 45, "num_reviews": 16, "playtime_forever": 104, "playtime_last_two_weeks": 0, "last_played": 1492190245}, "language": "english", "review": "One of the best games I have ever played and even though it says I don't have much playtime I bought it on on the official site for twenty dollars and it was worth every penny. I highly recommend you all try this but here are my thoughts on the game.\nPros:\n-Beautiful artwork, You will be able to tell a how much work was put into every area.\n-Humor: Its not often when you find a good game full of humor and I actaully laughed out loud twice\n-Story: Very good story, not the best in the world but definitly a reason to buy the game\n-Great community: The devs are involved and always ready to help and so are the people i have met who play the game\n-Good playtime and replay value: You will get plenty of playtime I believe i have a little more than 30 hours on just one playthrough (I am a bit slow) and I intend to do another playthrough\n-Combat: While the combat system isn't the most uniqe I just LOVE how all the different characters have there own uniqe abilities and systems for those abilities. Its not just the boring use mana to cast a spell, or have a basic attack\n-Puzzles: There were some puzzles that I really enjoyed to solve, my favorite part of the game was the probably the dungeon which is a very confusing hour puzzle, that I loved to solve.\nThere are more benefits that I loved but those are probably the main ones\nCons:\n-Navigating the map: It takes a while getting used to navigating the world map and it can be a fair amount of walking getting to where you want to go sometimes\n-Vauge quest descriptions sometimes: Sometimes a quest can be kind of vauge and its hard to figure out where your supposed to go or do.\n\nAll in all I definitely reccomend this game.", "timestamp_created": 1454539213, "timestamp_updated": 1454539213, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.458253", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20936109": {"recommendationid": "20936109", "author": {"steamid": "76561198036917793", "num_games_owned": 250, "num_reviews": 8, "playtime_forever": 1489, "playtime_last_two_weeks": 0, "last_played": 1455409949}, "language": "english", "review": "So this is SoloKane's wife writing a review for Aveyond....in case anyone was wondering why he was playing this game.  Definitely not his style but totally mine.  I have been a huge fan of the Aveyond series for years.  I actually purchased this directly from the game maker and then got a free steam key from them for writing a review.  To date I have over 20 hours of game play and it's so much fun.  The characters are interesting and funny.  Puzzles are challenging.  This is a great game in the Aveyond series with updates in its gaming system.  Anyone who likes RPG that has a sarcastic fun sense of humor is going to love this game and the whole series.  Super pleased that it's not by chapters like the last game.  Thanks Aveyond Kingdom!", "timestamp_created": 1454523349, "timestamp_updated": 1454523349, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20932036": {"recommendationid": "20932036", "author": {"steamid": "76561198182271671", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 17, "playtime_last_two_weeks": 0, "last_played": 1454508785}, "language": "english", "review": "I've played all other Aveyond games before and when reading the story of this one I wasn't sure what to think at first. I downloaded the demo anyway and even before I reached the end I was hooked. \n\nI finished the game once now and it took me 28 hours, I've done all main quests and side quests and used the developer's forum a few times for help, otherwise it might have taken me even longer. There are many quests, side quests, goodie caves (and I haven't even discovered all of them) and entertaining dialogues. The fights were just perfect for me on the \"normal\" game setting, not too easy, not too hard. I also love the certain decissions in the game lead to other endings. I must also mention that the music adds to the fantasy themes, every town has suiting music, which somehow gives you an even better \"feeling\" of what the town would be like. \n\nIf you're a fan of RPG style games or just like pretty pixels and love a story and lots of quests, I'm quite sure this is a game for you too. I received a free Steam key for my review, but already bought (and finished) this game a month ago from the developer's platform.", "timestamp_created": 1454509209, "timestamp_updated": 1454509209, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20926674": {"recommendationid": "20926674", "author": {"steamid": "76561198141828152", "num_games_owned": 17, "num_reviews": 1, "playtime_forever": 356, "playtime_last_two_weeks": 0, "last_played": 1506574864}, "language": "english", "review": "This game is an absolute masterpiece! It allows for players who have anywhere from no time on their hands to three months. You can have fun playing this game no matter how much or how little you can devote to it. The storyline is entertaining, the characters are great fun, the minions are delightful, the side quests are enchanting, and the mini-games are cute. The characters themselves are actually diverse enough in their abilities to make your party selection an actual act of strategy whereas it used to be mostly a question of which magic weilder/fighter balance do you prefer; now you have to decide whether you want healing, fire, magic, multi-attacks, dream magic, or assorted team-attacks. The combat system is a vast improvement on any I have heretofore played. In short: BUY THIS GAME!", "timestamp_created": 1454482583, "timestamp_updated": 1454482583, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20926210": {"recommendationid": "20926210", "author": {"steamid": "76561198273459405", "num_games_owned": 26, "num_reviews": 2, "playtime_forever": 16, "playtime_last_two_weeks": 0, "last_played": 1454479916}, "language": "english", "review": "I like the game. It is the 4th in a series set in the same universe. All games are independent from each other and can be played independently.\nAveyond 4: Shadow Of The Mist is a classic RPG game that follows a story line, but allows to create your own fighting team from a group of characters that can join you. It involves monster fighting and puzzle solving.\nThe graphics are old school.\nThe story line traditional, but the dialogue funny and tongue in cheek. \nThe game has 3 difficulty setting. Multiple save slots make it easy to work on alternate story arcs for some of the team members and changing the finale.\nI enjoyed playing Aveyond 4.", "timestamp_created": 1454479509, "timestamp_updated": 1454479509, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20925607": {"recommendationid": "20925607", "author": {"steamid": "76561198279026818", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 760, "playtime_last_two_weeks": 0, "last_played": 1455775918}, "language": "english", "review": "The heroes found your evil lair, made it past traps, minions, even a dragon, and now you are utterly defeated.  So what's a villain to do?  Retire.  That is until your dog goes missing after a mysterious fog settles over town.  And now you must go back out into the world to rescue him.\n\nAnd so the game begins.  Full of wit, well designed gameplay and surprising endearing ex-villains, Aveyond 4 has lived up to all my expectations.  I especially love that this is a full length game, not somethng that is over in the first few hours.  After 17+ hours of game time I'm still discovering new areas of the map, unlocking new side quests, and making progress on the main storyline.  There's still plenty of game ahead and I'm excited to see where it goes.\n\nI originally purchased this game on the Aveyond website when it was first released.  I have been a fan of Amaranth Games since Aveyond 1 and I'm thrilled to see this latest installment with its twist on the classic hero's journey.  I received a free key to download the game here on Steam so that I could share my impressions of the game with the Steam community.  I fully recommend Aveyond 4 to anyone who likes good humor and great RPGs.", "timestamp_created": 1454475902, "timestamp_updated": 1454912575, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20925468": {"recommendationid": "20925468", "author": {"steamid": "76561198100875781", "num_games_owned": 16, "num_reviews": 1, "playtime_forever": 443, "playtime_last_two_weeks": 0, "last_played": 1489364403}, "language": "english", "review": "This is my favorite Aveyond game to date, and I've enjoyed all of them! It has an awesome cast and story. I love that the main character is a failed villain - it's a nice change from farmboy-turned-hero saves the day RPGs, and it makes for some very funny writing. The puzzles are unique and really, really well done. Battle is intuitive without being tedious, and the different skills characters can learn are fun to experiment with!\n\nI bought Shadow of the Mist through the Aveyond website, and I've played it through twice so far. I received this Steam key for free in return for writing a review. I don't use Steam often, but I've already told everyone I know to play Aveyond, so why not? :)", "timestamp_created": 1454475024, "timestamp_updated": 1454475024, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20923808": {"recommendationid": "20923808", "author": {"steamid": "76561198280920396", "num_games_owned": 17, "num_reviews": 1, "playtime_forever": 1349, "playtime_last_two_weeks": 0, "last_played": 1472087904}, "language": "english", "review": "I love this  game. I have all of the Aveyond games and they just keep getting better and better.", "timestamp_created": 1454466108, "timestamp_updated": 1454466108, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20923029": {"recommendationid": "20923029", "author": {"steamid": "76561198030962302", "num_games_owned": 11, "num_reviews": 1, "playtime_forever": 322, "playtime_last_two_weeks": 0, "last_played": 1454723202}, "language": "english", "review": "I received a free Steam key for this game to review, however I also own the direct PC version and have clocked over 27 hours of playtime.\n\nThis game is a refreshing take on the stereotypical sword and sorcery rpg storyline.  What happens to villains after they are defeated?  Do they retire?  Is there anything that could cause them to turn a new leaf, and become \"heroic\"?  The storyline is clever and character interactions are always amusing.  All six playable characters have their own unique gameplay and skills and the ability to freely switch combat members allow you to customize your party for specific encounters.  Gear upgrades are significant enough to feel worthwhile, and while you can finish the main storyline without completely exploring the world, the most powerful armors require full exploration of bonus areas.  Side quests for each area are easy to find or ignore as you see fit, and are generally found in the area where they are completed to cut down on unnecessary backtracking.  \n\nThe game is challenging enough to need to use your brains, while being balanced around not needing to grind levels to be able to survive the next quest area.  You can save at any time outside of battle, which makes Aveyond 4 perfect for casual gamers or adult gamers who may never know when playtime will be interrupted.  Hidden quests (not listed in your journal), hidden treasures and a hidden class skill for one of the playable characters reward players who take the time to fully explore and pay careful attention to npc conversations.  \n\nI have a hard time thinking of cons for this game, but the one annoying thing I have found is that sometimes the mob grouping pulls in enemies from off screen when initiating combat.  When I touch an enemy sprite to initiate combat and I only see two sprites on the screen, I shouldn't pop a battle with 4 mobs.  When the battle is over I see that extra two were around a corner and blocked by trees.  In the same vein, sometimes enemy sprite loot marks are difficult/impossible to find.  This does not happen enough to be more than a temporary irritation though.  \n\nOverall it has been a great game, and I highly recommend it both as an introduction to the Aveyond series and for those who played Aveyonds 1-3.", "timestamp_created": 1454462195, "timestamp_updated": 1454462195, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20922914": {"recommendationid": "20922914", "author": {"steamid": "76561197995873577", "num_games_owned": 102, "num_reviews": 1, "playtime_forever": 60, "playtime_last_two_weeks": 0, "last_played": 1454468536}, "language": "english", "review": "What I love about this game is what I love about all traditional RPGs: the story. You get complex characters and a comprehensive world where you feel like you are a part of the story. The characters are witty and interesting, and you end up caring about what happens to them. I originally bought this game directly from the developer and was given a steam code to review it on here. So far I've played it twice (because there are differences in some quests and activities depending on your choices). My first playthrough was 37 hours and my second was 27. I am currently about to start my third play through and the banter between the characters is still amusing :) I look forward to the next installment in this wonderful series.", "timestamp_created": 1454461641, "timestamp_updated": 1454461641, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20922846": {"recommendationid": "20922846", "author": {"steamid": "76561198281009900", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1454431384}, "language": "english", "review": "Aveyond 4:  Shadow of the Mist is in the family of the Aveyond games and one of the best games I have ever played.  It is challanging, eventful, and keeps you wanting to keep playing and advancing in the game itself.  I have played all the Aveyond games and could not wait for them to come out with another.  It was so very worth waiting for.  The creators of this game are very talented and very helpful if you get stuck.  If you play any game let this be one of them you will not regreat it.  It is not a short game, so you will be playing for quite awhile and it has a selection for what level you want to play in.  The story is good along with the characters.", "timestamp_created": 1454461363, "timestamp_updated": 1454461363, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20922503": {"recommendationid": "20922503", "author": {"steamid": "76561198064268093", "num_games_owned": 6, "num_reviews": 1, "playtime_forever": 617, "playtime_last_two_weeks": 0, "last_played": 1454459902}, "language": "english", "review": "I am a long time Aveyond fan. I have been playing the Aveyond games since 2009. Each and every one of them have had me eager to play more and for longer. The storylines are captivating, the humor is fun without being crude, and the quests are challenging without being completely impossible to solve. The graphics are great and the music fits well with the scenery. Aveyond 4 was no exception. I was fortunate to be among one of the first to purchase the game (after waiting eagerly since the last installment Aveyond 3-4: The Darkthrope Prophecy) directly from aveyond.com. I thoroughly enjoyed the different perspective of playing a reluctant villain turned hero saving the world.\n\nAveyond is the standard that I judge all other RPG games; and sadly most don't hold a candle to this series. I highly recommend this game along with all other Aveyond games.\n\nI received a free game key for steam in return to give an honest review of the game.", "timestamp_created": 1454459874, "timestamp_updated": 1454459874, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20921773": {"recommendationid": "20921773", "author": {"steamid": "76561198281054705", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 310, "playtime_last_two_weeks": 0, "last_played": 1454457296}, "language": "english", "review": "This game is AWESOME.  I got a free key but I purchases it through Amaranth Games.  This game is so much fun.  There are many Aveyonds and have been a fan for years.  The stories are always awesome and always challenging.  Need to think to win this game.  I loved it loved it loved it!!!!", "timestamp_created": 1454456384, "timestamp_updated": 1454456384, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20921689": {"recommendationid": "20921689", "author": {"steamid": "76561198041497958", "num_games_owned": 842, "num_reviews": 16, "playtime_forever": 2014, "playtime_last_two_weeks": 0, "last_played": 1454722731}, "language": "english", "review": "Aveyond 4: Shadow Of The Mist; man, how do I start? I love this game, the battle sequence, the music, the characters, the humor. All of it combined, just makes this a one-of-a-kind RPG. If you like RPG maker games, you should definitely give this one a try.", "timestamp_created": 1454456073, "timestamp_updated": 1454456073, "voted_up": true, "votes_up": 6, "votes_funny": 2, "weighted_vote_score": "0.592381", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20920315": {"recommendationid": "20920315", "author": {"steamid": "76561197988622597", "num_games_owned": 263, "num_reviews": 15, "playtime_forever": 4589, "playtime_last_two_weeks": 1, "last_played": 1515702730}, "language": "english", "review": "Love the comical features of this game. its an atypical RPGMaker game but the storyline is hilarious! a must play for any JRPG gamer.", "timestamp_created": 1454450323, "timestamp_updated": 1454450323, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500104", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20919131": {"recommendationid": "20919131", "author": {"steamid": "76561198125480725", "num_games_owned": 66, "num_reviews": 6, "playtime_forever": 7, "playtime_last_two_weeks": 0, "last_played": 1454445541}, "language": "english", "review": "A truly enjoyable RPG!  Just plain fun.\n\nFrom the makers of the Aveyond series (all wonderfully made), this is a departure from the original storyline. It is a complete, stand alone game, although there are some subtle references to the previous games, they are there to give you a chuckle, but in no way impact the story.\n\nYou play Boyle, a villain, who becomes, through many misadventures, an unwilling hero. The characters are all unique, with unique skills/attributes/mannerisms. While the main story is very linear, there are TONS of side quests to pursue. Some are mentioned in your log book. Some you will stumble upon, and need to remember.\n\nThe battle system is great, turn based, and each character has very different skills to work with. The artwork is a pleasure to look at. But I think where this game shines is just the sheer \"funness\". The writing was just hilarious in so many parts. It's like being part of a group of people that are thrown together, and are always fussing/quipping, jabbering, etc. I loved that!\n\nI did get a Steam key, since I purchased the game originally on the Aveyond website. It took me almost 32 hrs to complete the first time around. If I had one complaint, it's that early on there is a LOT of walking around, back and forth, but once you get to the mist system, it's much quicker/easier.\n\nJust tons of fun, and great replay value too, since you can chose to do a few things differently with your characters (as some can get married, but you have to figure out how, and to whom).", "timestamp_created": 1454446555, "timestamp_updated": 1454446555, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500104", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20918478": {"recommendationid": "20918478", "author": {"steamid": "76561198080599890", "num_games_owned": 18, "num_reviews": 1, "playtime_forever": 337, "playtime_last_two_weeks": 0, "last_played": 1493138736}, "language": "english", "review": "I love the Aveyond series having started playing with the original game in the series Ahriman's prophecy about 10 years ago and have to say was super excited to see that Aveyond 4 was due out. I was not disappointed the high quality graphics, storyline and quirky characters lived up to my expectation. The option to choose the degree of difficulty and the added hidden goodies all add up to make a great game. Even though this is part of a series, Aveyond 4 is fine to play individually with a self-contained story, with some comments back to previous games but these don’t affect the story. \nI originally bought this through the developer’s website and got a free steam key so am in the process of restarting and completing the game (maybe on the hard difficulty). I would definitely recommend this game and the others in the series as a fantastic diversion from everyday bordem :)", "timestamp_created": 1454444434, "timestamp_updated": 1454444434, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500104", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20917526": {"recommendationid": "20917526", "author": {"steamid": "76561198170085471", "num_games_owned": 52, "num_reviews": 1, "playtime_forever": 99, "playtime_last_two_weeks": 0, "last_played": 1487007789}, "language": "french", "review": "J'ai toujours adoré les Aveyond, j'ai joué plusieurs à chacun d'entre eux et j'ai presque grandi avec. Ces jeux sont géniaux et c'est vraiment dommage qu'ils soient si peu connu parce qu'ils méritent vraiment le coup d'oeil :D", "timestamp_created": 1454441480, "timestamp_updated": 1454441480, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "4.980100", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20916776": {"recommendationid": "20916776", "author": {"steamid": "76561198059557958", "num_games_owned": 61, "num_reviews": 1, "playtime_forever": 1589, "playtime_last_two_weeks": 0, "last_played": 1503251814}, "language": "english", "review": "I bought the game a day or 2 after its release on the original website, I got a free steam key from them now, and i'm more than willing to review this game.\n\nThe first time I played an Aveyond game it was Aveyond 1 back in 2006, I was a 3rd or 4th grader, I think, and up until that point I had never played anything like it, I had never been overly into gameing until i played Aveyond 1. I think the reason I am able to call myself a gamer today is all thanks to Aveyond 1.\n\nSo now, Aveyond 4 was released a month or so back, and I think it may just be, my favorite Aveyond so far, the characters are interesting and genuine right from the beginning. The combat was very involved and fun. The music in this game is just as good, if not better, than the pervious games, a majority of the songs, have personality, which I find makes the game, in general, better.\n\nIf your thinking about getting this game, I suggest you do it, it's worth the price.\n\nAlso, military squrriels.(they're the best)", "timestamp_created": 1454439178, "timestamp_updated": 1454439178, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502591", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20915782": {"recommendationid": "20915782", "author": {"steamid": "76561198259395134", "num_games_owned": 45, "num_reviews": 2, "playtime_forever": 13, "playtime_last_two_weeks": 0, "last_played": 1454435941}, "language": "english", "review": "Aveyond is the first RPG game I ever played (years ago) and it hooked me on PC gaming.  The Aveyond series is a well planned and exicuted and entertaining series of games.  Shadow of Mist is a twist to the previous games but it is still of equal quality and It is entertaining, and IMO and easy RPG to play.\n\nI did revieve a free Steam coupon for this game woth my promise to post a review.  I would have done so without the coupon.\n\nPLEASE give Aveyond a try.  You will not regret it.", "timestamp_created": 1454435954, "timestamp_updated": 1454435954, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500104", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20914821": {"recommendationid": "20914821", "author": {"steamid": "76561198014736853", "num_games_owned": 134, "num_reviews": 2, "playtime_forever": 994, "playtime_last_two_weeks": 0, "last_played": 1482835414}, "language": "english", "review": "Good game. Well plotted out with good humour and the puzzles can be solved logically.\n\nI'm already playing through again to try to complete all of the side quests. As with previous Aveyond games, I'm sure this is one I'll come back to every year or so just to enjoy it again.\n\n(Disclosure: I originally bought the game direct from the Aveyond website, and have since been given a free Steam key to get the Steam version)", "timestamp_created": 1454432732, "timestamp_updated": 1454432732, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500104", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20914213": {"recommendationid": "20914213", "author": {"steamid": "76561198054502442", "num_games_owned": 59, "num_reviews": 1, "playtime_forever": 10, "playtime_last_two_weeks": 0, "last_played": 1454430495}, "language": "english", "review": "Don't be fooled by my low play time; I bought it from their website originally and just got the key. This is my first ever review, too! Mostly because I'm super lazy. Now here you go: 10/10\n\nThis is a great game. I've been a follower of the Aveyond series since it first came out years ago, and (unlike many series), the quality has only gone up with each game.\n\nStory and writing: The story is amazing. Aveyond is what got me into RPGs in the first place, and I've yet to come across another that has such well-written characters and a cohesive plot. It's made me laugh from the get-go and has a bit of a different spin from the other games; this time, you're playing from the perspective of a retired villian who's sort of forced into the role of hero. It's original and well-done, without gramatical or spelling errors.\n\nMusic: The soundtrack is, as always, incredible. Aaron Walz has really outdone himself with this one.\n\nGameplay and controls: There are both keyboard and mouse functions, for whichever you prefer, and everything is really easy to figure out without being annoying. It's pretty stnadard, but in a good way.\n\nArt: Aveyond has given me extemely high standards for art, and is the sole reason why I'm hesitant to play many other RPGs that aren't quite up to par. SotM very much keeps with this standard. The art is beautiful and expressive, and unlike many other games that have decent art to provide nothing more than a visual, the art in this game really adds something. The expressions are hilarious and personal, and you can really tell that a lot of effort was put in.\n\nCombat: Simple without being boring. It's turn-based and the abilities of each character are truly well thought-out. \n\nMy impression as a whole: Play the damn game. It's very much worth the price (and to be honest, one of the only games that I'm willing to spend more than $10 on), and the more people who play, the easier it is for the series to continue on and flourish. If you're new to the series, absolutely give it a shot. Hell, give all of them a shot. They're all great. If you're a veteran, well, you probably already own it. 10/10", "timestamp_created": 1454430540, "timestamp_updated": 1454430540, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500104", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20913580": {"recommendationid": "20913580", "author": {"steamid": "76561198026036199", "num_games_owned": 96, "num_reviews": 1, "playtime_forever": 1664, "playtime_last_two_weeks": 0, "last_played": 1486242433}, "language": "english", "review": "I love the Aveyond games, and so I had being eagerly anticipating this new installment to this old school RPG series (I got this elsewhere and have been given a free Steam key thanks to the lovely people at Amaranth Games). This is an engaging stand alone story, so you don't need to have played the other games before diving into this one, for fans of the series like myself there are nods to the earlier games and old friends scattered throughout. I love the humor and hours of game play with side quests and secret goodie locations, these games offer, be warned they're highly addictive!!!!!", "timestamp_created": 1454428166, "timestamp_updated": 1454428889, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.572954", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20913082": {"recommendationid": "20913082", "author": {"steamid": "76561198032680200", "num_games_owned": 261, "num_reviews": 3, "playtime_forever": 67, "playtime_last_two_weeks": 0, "last_played": 1454601099}, "language": "english", "review": "Cute little game from the great people over at Amaranth games - a game so nice I bought it twice!  Great story (so far, haven't finished) and great characters, with good humour beats as well.  Worth a look if you're into JRPGs (even ones made by Westerners).", "timestamp_created": 1454426112, "timestamp_updated": 1454426112, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.532700", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20912739": {"recommendationid": "20912739", "author": {"steamid": "76561198082333053", "num_games_owned": 25, "num_reviews": 1, "playtime_forever": 1368, "playtime_last_two_weeks": 0, "last_played": 1454642316}, "language": "english", "review": "I've been a huge fan of Amanda and Amaranth Games since Ahriman's Prophecy first came out, but for me, AV4 beats them all. Despite the lack of an item/setting to speed up movement (thus making travel rather slow), the humor and plot (failed villain turned reluctant hero) more than make up for spending a little too much time trying to get to people and places. There has been some commentary on Ingrid \"forcing\" her love interests into a relationship, but having actually played through each of the romances, the men never felt forced to me.\n\nOverall, Boyle is the perfect mix of \"Oh [insert divinity], we have to save the world!\" heroism and \"Why can't I just torture innocent villagers in a dungeon?\" villainy, and AV4 is bold, beautiful, and brilliant.\n\n4.3/5\n\nAdditional note, I bought this game when it first came out and received a free Steam Key for writing a review.", "timestamp_created": 1454424767, "timestamp_updated": 1454424934, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.581320", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20912488": {"recommendationid": "20912488", "author": {"steamid": "76561198237802274", "num_games_owned": 19, "num_reviews": 1, "playtime_forever": 15712, "playtime_last_two_weeks": 0, "last_played": 1470273065}, "language": "english", "review": "I am an Aveyond fan . . . . This is a new twist of the Aveyond games with a new Darkthrope.  Even if he is \"evil\" and cursed to marry a witch - he is a very likable character.  You have a great quest to complete and a new group of heros - along with a few favorites from previous games.  Of course you can have a marriage at the end . . . . if you get enough attaction points.  I personally loved the game and will play more than once.", "timestamp_created": 1454423933, "timestamp_updated": 1454423933, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.598697", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20909900": {"recommendationid": "20909900", "author": {"steamid": "76561198161936315", "num_games_owned": 20, "num_reviews": 2, "playtime_forever": 3070, "playtime_last_two_weeks": 1283, "last_played": 1516403841}, "language": "english", "review": "Once in a great while you find a series of games that become milemarkers through the changes and phases of your life.  When I first began playing Ahriman's Prophecy, my daughter was just beginning high school.  I was excited, as our new computer had a brand new operating system called Windows XP.  \n\nFastforward to last summer.  My granddaughter came to stay with my husband and I for the summer.  She played through Aveyond, Aveyond 2 and the various chapters of Aveyond 3.  She quickly fell in love with the games, as had her mother and I years before.  When I told her that the release of Aveyond 4 was on the horizon, she became at least as excited as many fans of the Fallout series, awaiting Fallout 4.  \n\nAveyond is a familiar place, and has seen at least as many changes as the lives of the wonderful people who make up the fanbase. If you're looking for an intense, fast paced game with gore and violence aplenty, move along.  If you'd like to recover some of the innocent wonder and happiness the world so callously tries to strip away, welcome to The Kingdom. Relax, sit back and just...play. \n\nIf you've ever had a beloved pet go missing, you'll know very well the depths of despair and challenges of finding them  and bringing them safely home again. In Aveyond 4 you'll revisit this issue, but with a wonderful twist.  There are riddles to be solved, mountains to climb, tournaments to win, and a narcissistic king who simply will not take no for an answer.   Aveyond 4 is packed with various  quests.  There are old friends, new heroes, dragons, elves and wicked witches. Have you ever pondered the meaning of a particularly disturbing nightmare?  Someone in this game might have the answer. Love, betrayal and wonder await you.\n\n  If you've ever enjoyed wandering around town and country with a good friend while the rest of the world is quietly slumbering, aiding a hilarious faction that desires to rule the world (a top secret faction that might actually do a better job than the figurehead in place), give this game a try!  \n\nThis game is not a race, it's a meandering walk throught he woods, exploring every leaf, feeling the wind in your hair and the warmth of the summer sun on your face.  Slow down, lock your inner critic in the dungeon buy this game and just enjoy.\n\nI purchased this game from the Aveyond website a few months back.  When I heard that Aveyond 4 was coming out on Steam, I wrote to ask of I could review the game here.  The deleloper was kind enough to send me a key code for downloading the game here on Steam.  I delighted for the opportunity to review it.  Give Aveyond 4 a try.\n  \n\n", "timestamp_created": 1454411973, "timestamp_updated": 1454411973, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.538366", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20909037": {"recommendationid": "20909037", "author": {"steamid": "76561198178680873", "num_games_owned": 13, "num_reviews": 1, "playtime_forever": 7, "playtime_last_two_weeks": 0, "last_played": 1454407440}, "language": "italian", "review": "This game is awesome! Seriously the all Aveyond series is a masterpiece for every rpg 16bit fan and not to mention how nice the staff is. I bought originally the game when it first came out on their website and they were so kind to lend me a free product key for steam so I could write a review about this game. If you're looking for a fun and long adventure full of laughs, feels and a very deep story please checkout this game: I promise you won't regret it!", "timestamp_created": 1454407661, "timestamp_updated": 1454407661, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20908342": {"recommendationid": "20908342", "author": {"steamid": "76561198277595153", "num_games_owned": 243, "num_reviews": 12, "playtime_forever": 877, "playtime_last_two_weeks": 0, "last_played": 1454516137}, "language": "english", "review": "I would highly recommend AV4: Shadow Of The Mist to anyone who loves RPG games.\nI bought this game initially when it was released on the developers website and I recieved a free key for the Steam release of the game.\n\nThe game is funny engaging and a really good play, with three modes of play, I played the easy mode on my first play through, currently on Steam I'm playing on normal, and I'll finally play hard mode. \n\nThe story is a little differnt from the normal hero tale, how can it not be when the hero is a retired villian and interaction between party members makes it much more alive, some of the dialogue had me laughing out loud.\n\nIt also ties into other AV games with more than a nod to past related topics, squirels and sword singers to name a couple.\n\nLots of puzzles to solve a great touch, a new and old characters to meet and fall in love with.\n\nAnd does the ending hint at a new AV game may be on the cards, we can but hope\n\nA game that is suitable for both experienced and new rpg fans \n", "timestamp_created": 1454403710, "timestamp_updated": 1454403710, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.466667", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20906364": {"recommendationid": "20906364", "author": {"steamid": "76561198052255011", "num_games_owned": 42, "num_reviews": 10, "playtime_forever": 221, "playtime_last_two_weeks": 0, "last_played": 1465873341}, "language": "english", "review": "I love this series and soon as Aveyond 4 came out i bought it on Amaranth Games and as a gift they sent me a key to get it free on steam.  If you are into old school rpg then give this game a try", "timestamp_created": 1454390070, "timestamp_updated": 1454390070, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.495751", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20906022": {"recommendationid": "20906022", "author": {"steamid": "76561198029843150", "num_games_owned": 200, "num_reviews": 4, "playtime_forever": 8, "playtime_last_two_weeks": 0, "last_played": 1454387463}, "language": "english", "review": "I've loved playing games in the Aveyond series since 2007\nI've played them tons, and I definitely recommend them as a classic rpg game with many features and secrets hidden throughout. \nAlthough this game is just new on steam, I owned it previously and received a code for steam. My current save is 8 hours, and I've loved everything in it so far.", "timestamp_created": 1454387730, "timestamp_updated": 1454387859, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20905868": {"recommendationid": "20905868", "author": {"steamid": "76561198159798736", "num_games_owned": 9, "num_reviews": 1, "playtime_forever": 60, "playtime_last_two_weeks": 0, "last_played": 1454471605}, "language": "english", "review": "I have long been a fan of the Aveyond games.  However, you do *not* need to have played any of the others to enjoy or understand this game.  There are a couple of long-lived recurring non-playable minor characters from earlier series, but they do not play major roles in this game.  This is also a complete game, unlike the 4-part Aveyond 3.\n\nYou can play this with either a keyboard or a mouse.  I generally prefer the keyboard unless I am trying to navigate tricky terrain or avoid a bad guy without a fight.\n\nThis is a long, detailed, well-imagined fantasy game.  There are battles, and you can have up to four fighters (plus one minion) from amongst your seven party members (you won't have seven party members the whole game, for most of it you will have fewer than seven).  Each character has different battle skills and strengths, and you may not want the same fighters in every situation.  You will have a chance to experience the battle interface during the demo. \n\nThe party does not always remain the same, either.  Although Boyle is the main character, occasionally other playable characters will have quests without him.   All the characters have unique backgrounds, and many are very different characters than we have seen in previous games.\n\nThere is a lot of fun, snarky humor in this game, especially with two of the MCs (Boyle and Ingrid) being an ex-villain and a witch.  Possibly reformed characters make great reluctant heroes.   Boyle's primary loyalty is to his dog/wolf Fang.  It takes him a while to get used to being part of a group.\n\nI don't want to give away much of the plot, but there many different locations in this expansive world, allowing for many different creatures and scenery.  (Mountains, forest, farmland, desert, seaside mining town, swamp, dreamscape, etc).  There are a bunch of main quests, and a fair number of optional side-quests with useful rewards.\n\nThere are several options for replayability, too, especially involving Ingrid, who can marry one of several men, depending on who she fancies and how much work she puts into it, and also join one of three witches covens, each with its own unique spells.  Eventually I want to try al the options.\n\nSo, try the demo and see if this is the sort of game you like.  (Note: the first half-hour is more scripted than the rest of the game, so do not be misled or turned off by the initial nudging).  \n\nAlso, my tip to you - save early and often, especially before battle.  And talk to everyone you encounter.  \n\nI had (and am having) lots of fun with this game and I hope you do too.  In some respects it is like immersing yourself in an interactive book/movie and experiencing a deep and nuanced world.  You might have to put more effort into it that the normal shooter or point-and-click games, but you will be rewarded for your efforts with a unique experience most games do not give you.  Most games are forgettable and interchangeable, but I always remember the Aveyond games and characters long after I am done playing.  Aveyond 4 makes me smile and forget about the real world for a while.    \n\nDisclaimer: I bought the PC version of this game when it was first released in December, and received a free Steam key from the developer.\n", "timestamp_created": 1454386707, "timestamp_updated": 1454386707, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20905780": {"recommendationid": "20905780", "author": {"steamid": "76561198107998486", "num_games_owned": 44, "num_reviews": 5, "playtime_forever": 9875, "playtime_last_two_weeks": 0, "last_played": 1472831025}, "language": "english", "review": "I am so happy to see Aveyond come on to Steam.  The entire series should be on Steam. Aveyond 4 is the newest release in this wonderful series. The first was in 2006- I have been following it for the last 10 years. This is one of the most clever and unique RPG games you will find.  It is intensely story-driven, immersive, and extremely well-written.  The graphics, while not your typical Skyrim-ish style, are beautiful and engaging. Oh, and the music!! I believe Aaron Walz does the music, and it is just so lovely. I have kept the games on just to play the music for ambience.\n\nAveyond 4 is about Boyle and his friends- he is a failed villain on a new quest with  some new friends.  It's a funny game.  Very witty. And you get to shapeshift and catch cheekis. And minions!  You can have minions!\n\nDISCLAIMER: I did receive a Steam code for the came in exchange for this review, HOWEVER I did purchase the game from the developer the day it came out, and i would have written the review anyhow. A lot of heart went into this game and the entire series.", "timestamp_created": 1454386205, "timestamp_updated": 1454386205, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20905211": {"recommendationid": "20905211", "author": {"steamid": "76561198013183737", "num_games_owned": 22, "num_reviews": 1, "playtime_forever": 181, "playtime_last_two_weeks": 0, "last_played": 1512435435}, "language": "english", "review": "I bought this game direct from Amaranth Games when it first came out and received a free Steam key for feedback.\n\nI have enjoyed all of the Aveyond games, but this may be my favorite.  The characters are well developed and the humor is great. \n\nBattles are challenging without being a chore, but certain enemies are tough even on the easy setting.  I found very little grinding to be necessary on the normal setting - usually just needing to switch my party around to suit certain enemies.  Every character is useful at some point.  \n\nThere are plenty of sidequests with great rewards and some puzzles that are fun to work through.  I have played completely through the game three times to try all possible covens and get all the different marriages at the end.  \n\nThe main con with the game is that there is a lag in certain areas.  Shutting down background programs helps a little, but doesn't really fix it.  Another minor issue is that you have to buy items one at a time which is a bit of a pain when trying to stock up before a boss battle.  \n\nWhile the game does have references to the previous games in the series, it is not necessary to play them first and this game can stand very well on its own.", "timestamp_created": 1454382459, "timestamp_updated": 1454382459, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20904710": {"recommendationid": "20904710", "author": {"steamid": "76561198067360099", "num_games_owned": 39, "num_reviews": 1, "playtime_forever": 38, "playtime_last_two_weeks": 0, "last_played": 1454435282}, "language": "english", "review": "Aveyond 4  gave me a nice break from Skyrim.   The entire Aveyond series are among my favorite games, right up there with Skyrim, Fable 3, Fable 2, King's Quest and Dawn's Light.   I got this game through Amaranth games first and received a free steam key to review the game here on Steam.    \n\nAveyond 4, so far my favorite of the series, has an excellent storyline that pulls you right in from the start and keeps your interests with plot twists, entertaining characters and npc's.   Some highlights -- militant squirrels, plenty of humor sometimes when you least expect it, simple controls, beautiful artwork, both the characters and the backgrounds.  And the loot, including hidden goodie caves filled with treasure.  \n\nI recommend playing the entire Aveyond series.  \n", "timestamp_created": 1454379583, "timestamp_updated": 1454379583, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20904690": {"recommendationid": "20904690", "author": {"steamid": "76561198273038248", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 902, "playtime_last_two_weeks": 0, "last_played": 1468294658}, "language": "english", "review": "Love the whole Aveyond series, love this game. Great characters, unique items, clear storyline, and at least 30 hours of gameplay.", "timestamp_created": 1454379515, "timestamp_updated": 1454379515, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.485509", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20904090": {"recommendationid": "20904090", "author": {"steamid": "76561198041436421", "num_games_owned": 42, "num_reviews": 2, "playtime_forever": 6, "playtime_last_two_weeks": 0, "last_played": 1454376286}, "language": "english", "review": "I have played this game for well over 24 hours and got it for free due to being a supporter. I love this game and have played every aveyond ever made. This game is all about Retro RPG. Like Final Fantasy was back like 1-7. The best part is the goodie caves which are hidden in each game in random walls so you want to find them to be the best. If you liked Final Fantasy 1-7 then you will love this game.", "timestamp_created": 1454376295, "timestamp_updated": 1454376295, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.489583", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20903811": {"recommendationid": "20903811", "author": {"steamid": "76561198200768655", "num_games_owned": 16, "num_reviews": 1, "playtime_forever": 51, "playtime_last_two_weeks": 0, "last_played": 1454375147}, "language": "english", "review": "I've loved the Aveyond series since I discovered it, and Aveyond 4 is no exception. In a world where people talk unironically about heroes and villians, the creators have done a good job of introducing ambiguity into the definition, and the characters are a hoot.\n\nI bought the game on my own, but was given a free Steam key for feedback.", "timestamp_created": 1454374777, "timestamp_updated": 1454374777, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.519794", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20903390": {"recommendationid": "20903390", "author": {"steamid": "76561198156396851", "num_games_owned": 84, "num_reviews": 1, "playtime_forever": 613, "playtime_last_two_weeks": 0, "last_played": 1490296193}, "language": "english", "review": "Pros:\n- excellent art, both for backgrounds and characters\n- quirky characters and NPCs\n- intriguing story that can be very unpredictable\n- on-point humor when you do and don't expect it\n- you can romance select people in your party\n- many throwbacks and references to previous games and characters in the Aveyond series\n- simple controls\n- militant squirrels\n- combat is intuitive but can be challenging if you don't know what to expect\n\nCons:\n- you do have to grind on occasion (unless you're on the easiest setting)\n- there is a version of fast travel, but it still takes a significant chunk time to get from place to place\n- some sidequests are unnecessarily convoluted (but only a few)\n- doesn't appear to have much replay value\n- bears\n- Te'ijal's sprite still doesn't match her appearance\n\nI originally bought this from Amaranth's website when it first came out and I received a free Steam key as a result. I haven't yet completed the game, but it's definitely worth the money - especially if you've played previous games from the Aveyond series!", "timestamp_created": 1454372644, "timestamp_updated": 1454372644, "voted_up": true, "votes_up": 25, "votes_funny": 3, "weighted_vote_score": "0.701402", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20902639": {"recommendationid": "20902639", "author": {"steamid": "76561198093307336", "num_games_owned": 30, "num_reviews": 1, "playtime_forever": 14, "playtime_last_two_weeks": 0, "last_played": 1454369429}, "language": "english", "review": "I got this game through Amaranth games at first. Aveyond is easily one of my favorite game series to date - the stories are wonderful, the character development is fantastic, and I love the play style. Since I bought the game through their website, I got a free key for Steam, so now I can keep it no matter what!\nSeriously, guys, these games are awesome and I highly recommend playing not only this one, but all the others as well.", "timestamp_created": 1454369449, "timestamp_updated": 1454369449, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.438559", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20901346": {"recommendationid": "20901346", "author": {"steamid": "76561197997621033", "num_games_owned": 68, "num_reviews": 1, "playtime_forever": 7, "playtime_last_two_weeks": 0, "last_played": 1455951951}, "language": "english", "review": "A fun game with good characters and story. A  fine installment in to the aveyond series and a game worth playing.", "timestamp_created": 1454363855, "timestamp_updated": 1454363855, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.426324", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 102, "total_negative": 4, "total_reviews": 106}}
