{"reviews": {"38012443": {"recommendationid": "38012443", "author": {"steamid": "76561197978416162", "num_games_owned": 52, "num_reviews": 1, "playtime_forever": 891, "playtime_last_two_weeks": 0, "last_played": 1514149671}, "language": "english", "review": "The Best game so far on Steam, when Im finally drunk !!", "timestamp_created": 1512242079, "timestamp_updated": 1512242079, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30860127": {"recommendationid": "30860127", "author": {"steamid": "76561198002416419", "num_games_owned": 110, "num_reviews": 13, "playtime_forever": 884, "playtime_last_two_weeks": 0, "last_played": 1491873185}, "language": "english", "review": "It is what it looks like a pretty simple, 2D, top down space shooter with a huge proceedurally generated universe. I am enjoying it thoroughly. I was expecting to have finished it and figured out the pixelfrazzer by this point (about 10 hours of gameplay), but I have not yet... It is on the edge of feeling grindy at this point as I havent seen much new stuff in the last few upgrades of difficulty, but I will give it a few more hours and see how it goes.", "timestamp_created": 1490988967, "timestamp_updated": 1490988967, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.503058", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28684804": {"recommendationid": "28684804", "author": {"steamid": "76561198058879819", "num_games_owned": 279, "num_reviews": 5, "playtime_forever": 91, "playtime_last_two_weeks": 0, "last_played": 1482782457}, "language": "english", "review": "A neat, simple game with nevertheless more depth to it than one might think at first glance. \n\nIn it you control an initially small and relatively weak spacecraft that, as you explore the randomly generated cosmos, becomes more and more powerful as you defeat enemies, complete quests and pick up or buy new equipment. While the game has a roguelike feel to it dying is not the end of your journey though it isn’t without its drawbacks either. Its is easy (and fun) to lose track of time when playing this little gem and its compelling gameplay along with the clever easter eggs make you keep coming back to this. The clean minimalistic graphics and soundscape tie the whole thing together into a single, enjoyable experience.\n\nWould I recommend that you buy this game? If my description of it sounds like something that you might enjoy then at its current price point there is really no reason not to.", "timestamp_created": 1482782586, "timestamp_updated": 1482782586, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.438174", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "28640923": {"recommendationid": "28640923", "author": {"steamid": "76561198284947630", "num_games_owned": 15, "num_reviews": 4, "playtime_forever": 386, "playtime_last_two_weeks": 0, "last_played": 1513438959}, "language": "english", "review": "Good time-waster.", "timestamp_created": 1482687122, "timestamp_updated": 1482687122, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "25412605": {"recommendationid": "25412605", "author": {"steamid": "76561198009853589", "num_games_owned": 215, "num_reviews": 2, "playtime_forever": 2395, "playtime_last_two_weeks": 0, "last_played": 1473443478}, "language": "russian", "review": "Настоящий шедевр: открытый мир, квесты, разнообразное комбинируемое оружие и внезапные враги. Правда, через несколько часов при открытой карте начинает заметно подтормаживать, но это не беда. 9 паззлов из 10", "timestamp_created": 1473350467, "timestamp_updated": 1473350467, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24747131": {"recommendationid": "24747131", "author": {"steamid": "76561198113711146", "num_games_owned": 202, "num_reviews": 6, "playtime_forever": 724, "playtime_last_two_weeks": 0, "last_played": 1470585803}, "language": "english", "review": "welp, since this game doesnt get as much attention and basically is dead (which is really unfortunate) i will now write my review about \"space - The return of the pixxelfzarrer\"\n\nLets start with the obvious, the game is not a beauty, but its not intented to be the most awesome looking game out there, well, at least i hope it isnt ;D\nA game doesnt need to look good, to be a good game, just look at masterpieces like dwarf fortress, its plain looking, but offers so much depth like no other title.\nSo does Space - tRotP, but its stand outs are exploration.\nYou are able to skale the difficulty, and the harder the game gets, more areas and enemies are unlocked, and im not talking about just a few elites here and there, nope, while playing the game you suddenly stumble across clouds of bubble monsters, giant lazer- minefields, a \"borg-like\" race, motherships of all kinds and shapes, roaming swarms of drones, .... hell, even i didnt see everything yet.\nHell, you can even blow up freaking stars, and use them as wormholes, the possibilities are endless.\n\n\nOne might say the combat is not extraordinarry complicated (mostly due to the fact that its 2d) and he might be right to some extend, but it offers a lot of customisation: you have 2 weapon slots, wich you can use for either a lazerbeam or a standart spamgun. Sounds dire? wait, thats not all, you can augment both of those slots with a variety of upgrades, and combine them for really interessting effects.\nAnd you have 5 slots for your ship augments, for example a simple heal, a shield, or do you want to sent a swarm of killerdrones at your enemy? \n\nEarlier i said the game shines on its exploration part, yes, indeed, while you can always teleport back to your starting planet, you can only upgrade flat stats on your \"garage\", but this wont do. The game actually forces you to go out there and visit space, because you can only progress (meaning getting your very important augments) when you find another planet, that has a merchant. AND again, merchants only offer you a limited amount of stuff, and while they may refresh their stock, its always better to search for more merchants, instead of just babysit there.\n\nThe game doesnt seem really challenging at first, but be warned, it can be really hard if you think guns blazin is the way to go. Especially when the game difficulty gets a little bit started, the game likes to use the secret art of \"throwing so much shit at you that you cant even see what hit you\". Kkeeping a cool head is key in later battles, and knowing when to retreat and come back later really helps, ESPECIALLY when you want to take out a fortress of enemies.\n\nall in all, its a solid game, not a blockbuster, but a secret pearl in this whirlpool of narrow rollercoster- gamedesign we have these days\n\ni say its a 9 / 11", "timestamp_created": 1470510033, "timestamp_updated": 1470510234, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497322", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24409178": {"recommendationid": "24409178", "author": {"steamid": "76561198085405990", "num_games_owned": 105, "num_reviews": 10, "playtime_forever": 108, "playtime_last_two_weeks": 0, "last_played": 1469031460}, "language": "russian", "review": "Годная игра.\nЭта игра меня удивила,так как стоит всего 79 р,и за эти 79 р вы получаете отличное рпг с открытым миром и случайнымимирами(NO MAN'S SKY для слабых пк)", "timestamp_created": 1468939950, "timestamp_updated": 1468939950, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.507874", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24363037": {"recommendationid": "24363037", "author": {"steamid": "76561198000965264", "num_games_owned": 375, "num_reviews": 12, "playtime_forever": 351, "playtime_last_two_weeks": 0, "last_played": 1468713558}, "language": "english", "review": "Pretty fun, the fact that you have to figure out a lot of stuff by yourself can be a perk or minus depending on how you like to play. Large variety in weapon upgrades.\n\nNote: the basics are explained by the tip system it's just the question you have later that must be figured out.", "timestamp_created": 1468713965, "timestamp_updated": 1468713965, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22872055": {"recommendationid": "22872055", "author": {"steamid": "76561197968547267", "num_games_owned": 673, "num_reviews": 25, "playtime_forever": 471, "playtime_last_two_weeks": 0, "last_played": 1462821420}, "language": "english", "review": "Fun, light shooter.\n\nGreat graphic style, interesting upgrades, freeform play in an open play field, lightly punishing death mechanic, choose your own difficulty on the fly. I'm playing with keyboard and mouse, I bet it would be even more fun as a twin stick shooter.", "timestamp_created": 1462750175, "timestamp_updated": 1462750175, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.508013", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20821223": {"recommendationid": "20821223", "author": {"steamid": "76561198062232099", "num_games_owned": 5111, "num_reviews": 285, "playtime_forever": 179, "playtime_last_two_weeks": 0, "last_played": 1453953756}, "language": "english", "review": "Space – The Return of the Pixxelfrazzer is a return to old school style space exploration action games. The developer, Sørb, is a one man show and it truly shows throughout the creation of the game. I do not mean that as a negative either. It’s a simple fact. Every game design choice all of the way through to the creation of game’s engine is decided, designed and developed by Sørb. A very admirable effort is made to create a solid game and it achieves that status, solid.\n\nIt’s space exploration at it’s near pinnacle. You start the game not knowing what to do but you have a basic quest outline – attack X many space ships. You kill them. Then you’re given another quest and then another. All of the while you’re starting to realize just how gigantic space is. Space is never quite what you would imagine it to be and that is a good thing. Objects can transform, including quest objects, into all sorts of different things. It’s arguably as close as you’ll get to feeling like Han Solo in the Empires Strikes Back flying the Millennium Falcon when he tries to evade an asteroid field in order to find a safe place only to fly into the mouth of an Exogorth without knowing it. Space has so many different quirks such as this it’s hard not to appreciate the amount of effort put into its design.\n\nThe variety of weapons, quests, planets, etc. are incredible creating a game world where there is seemingly always something to see and to enjoy. The sound and graphics are old school and therefore may not appeal to players demanding the latest and greatest but for someone who can appreciate the fact that sometimes less is more it is easy to look past and perhaps even appreciate more. Other than that there really isn’t much to knock about the game and that’s being fair. It’s not the greatest game of all time but there’s more than enough content here to spend a few hours with an enjoyable title.\n\nSadly with just 17 Steam reviews and an estimated 394 – 1858 total owners (according to SteamSpy), Space – The Return of the Pixxelfrazzer has been a criminally overlooked title that is yearning to be played.\n\nFor similar reviews and our popular daily giveaways please visit http://www.steamified.com/", "timestamp_created": 1454053072, "timestamp_updated": 1454053072, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.561478", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "19533074": {"recommendationid": "19533074", "author": {"steamid": "76561198018101085", "num_games_owned": 392, "num_reviews": 2, "playtime_forever": 1392, "playtime_last_two_weeks": 0, "last_played": 1508687803}, "language": "english", "review": "Lots of customization, manually scaling difficulty, smooth and tight gameplay\nAfter a point you are only really getting bigger numbers though, there's not a whole lot of content, but what's there is really nice and easily 5+ hours of gameplay", "timestamp_created": 1449429713, "timestamp_updated": 1449429713, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.491401", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19446036": {"recommendationid": "19446036", "author": {"steamid": "76561197984505368", "num_games_owned": 1327, "num_reviews": 177, "playtime_forever": 34, "playtime_last_two_weeks": 0, "last_played": 1449021642}, "language": "english", "review": "There's a very charming game of discovery and exploration in here - I think - I've hit a few snags but I'm slowly figuring-out what's going on.\n\nIn my first run I met a triangle who wanted to be my friend - some higsaw pieces who I reunited and some octopus-looking-things which glowed for - well - I've no idea but I intend to find out!\n\nMy only grumble is that dying = losing money which would be OK if that wasn't money 'lost forever' from that 'universe' - meaning your progress in that 'universe' was just stunted a bit.  Every reload is a 'new universe' too - which solves the money thing but then breaks the exploration thing and\n\nI'm still enjoying it ;0", "timestamp_created": 1449091009, "timestamp_updated": 1449091009, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.507715", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19060704": {"recommendationid": "19060704", "author": {"steamid": "76561197970292901", "num_games_owned": 530, "num_reviews": 14, "playtime_forever": 641, "playtime_last_two_weeks": 0, "last_played": 1505606741}, "language": "english", "review": "Developer genuinely cares and has taken the time to sort the isues I've had with getting local coop to work.   Kudos on a great game and even better support.", "timestamp_created": 1447457706, "timestamp_updated": 1447871118, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.508508", "comment_count": "9", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18998071": {"recommendationid": "18998071", "author": {"steamid": "76561198040557124", "num_games_owned": 1470, "num_reviews": 53, "playtime_forever": 250, "playtime_last_two_weeks": 0, "last_played": 1491970265}, "language": "english", "review": "Basic but Beautiful. The game is fun to fly around discovering new things, alien creatures, both friendly and not, upgrading, and again, just flying around. Simple but well thought out. Time well spent and easily consumed while in this galaxy.", "timestamp_created": 1447190478, "timestamp_updated": 1447190478, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18979649": {"recommendationid": "18979649", "author": {"steamid": "76561198045807635", "num_games_owned": 1865, "num_reviews": 80, "playtime_forever": 436, "playtime_last_two_weeks": 0, "last_played": 1509861170}, "language": "english", "review": "One of the few games I've bought for full price, and the full price was definitely worth it.  This game should be worth way more, too; it's got polished, well-constructed gameplay, and hours of fun to be had.  Far more, anyway, than some more expensive games (*cough The Order 1886 cough*).  This is one of those indie gems that you have to dig to find, but it's totally worth it.\nIt's like Asteroids but better.", "timestamp_created": 1447116968, "timestamp_updated": 1447116968, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500398", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18940965": {"recommendationid": "18940965", "author": {"steamid": "76561198016707912", "num_games_owned": 487, "num_reviews": 38, "playtime_forever": 137, "playtime_last_two_weeks": 0, "last_played": 1446935831}, "language": "english", "review": "Very good game for 3 dollars. This is one of the rare indie gems I always look for when browsing Steam. \nThere isn't a plot, there are barely any instructions, this game is mainly about exploration, combination, and having fun. You can always fing something new and unexpected, a new type of asteroid that causes gravity fluctuation when you shoot it, or some kind of a bio-minefield that seems to be harvested by lasers. You can equip modifiers to your weapons that you can even combine (freezing, splitting, critting bullets anyone?).\nIf you like these kind of true sandbox games, and like to explore, for 3 dollars I can only recommend it.", "timestamp_created": 1446936451, "timestamp_updated": 1446936451, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500398", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18934983": {"recommendationid": "18934983", "author": {"steamid": "76561197970805557", "num_games_owned": 3800, "num_reviews": 14, "playtime_forever": 51, "playtime_last_two_weeks": 0, "last_played": 1446932828}, "language": "english", "review": "It's an interesting take on Asteroids and exploration. Well worth the cost as it's quite fun.", "timestamp_created": 1446918062, "timestamp_updated": 1446918062, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500398", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18925744": {"recommendationid": "18925744", "author": {"steamid": "76561197980795527", "num_games_owned": 256, "num_reviews": 33, "playtime_forever": 778, "playtime_last_two_weeks": 0, "last_played": 1447284227}, "language": "english", "review": "Just straight-up fun. It's Asteroids with some light RPG mechanics on top and a procedurally generated world every time you play. What more could you want?\n\n-Note: Just blew up a star, collapsed into a black hole. I have no regrets.", "timestamp_created": 1446886920, "timestamp_updated": 1447025552, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.500398", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18921910": {"recommendationid": "18921910", "author": {"steamid": "76561198072084322", "num_games_owned": 90, "num_reviews": 3, "playtime_forever": 153, "playtime_last_two_weeks": 0, "last_played": 1446932097}, "language": "english", "review": "[h1]Positives[/h1]\n[list]\n      [*] Random generation\n      [*] Random Music\n      [*] Assortment of weapon upgrades and abilities\n      [*] Minecraft Blocks in space\n      [*] Giant Spacemen\n      [*] PuzzleBeasts\n      [*] Freeze Planets\n      [*] Glowing space jellyfish\n      [*] its $2.99\n[/list]\n\n[h1]Negatives[/h1]\n[list]\n      [*] Nothing\n[/list]\n\n[h1]Conclusion[/h1]\n\nWould kill more PuzzleBeasts\n\n10/10\n", "timestamp_created": 1446866553, "timestamp_updated": 1446866553, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.486726", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18902447": {"recommendationid": "18902447", "author": {"steamid": "76561198126663267", "num_games_owned": 5, "num_reviews": 3, "playtime_forever": 651, "playtime_last_two_weeks": 0, "last_played": 1447185463}, "language": "english", "review": "Addicting. Lot's of surprises and little easter eggs. Lot's of room to upgrade.", "timestamp_created": 1446785984, "timestamp_updated": 1446785984, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500398", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18864207": {"recommendationid": "18864207", "author": {"steamid": "76561198061211538", "num_games_owned": 91, "num_reviews": 2, "playtime_forever": 1046, "playtime_last_two_weeks": 0, "last_played": 1503145137}, "language": "english", "review": "[h1] Space! [/h1]\nif you ever had the desire to punsh jelly fish with a wrecking ball in space, this might be the game for you.\nThis table shows the most significant features in the game:\n[table]\n    [tr]\n        [th]Jelly fish hits:[/th]\n        [th]result[/th]\n    [/tr]\n    [tr]\n        [td]planet[/td]\n        [td]planet glows[/td]\n    [/tr]\n    [tr]\n        [td]player[/td]\n        [td]player glows[/td]\n    [/tr]\n    [tr]\n        [td]wrecking ball[/td]\n        [td]wrecking ball glows[/td]\n    [/tr]\n    [tr]\n        [td]asteroid[/td]\n        [td]asteroid glows[/td]\n    [/tr]\n[/table]\nAlso the combination of weapons can be great.\nSplitting shots with critical damage and target-seeking is one heavy thing.\nAnd a gravity bomb! You'll just need the gravity bomb!\nLast but not least there are little friendly ships who help you alot!\n...and kick you out by triggering a minefield.\n10/10", "timestamp_created": 1446587543, "timestamp_updated": 1446587543, "voted_up": true, "votes_up": 4, "votes_funny": 4, "weighted_vote_score": "0.548152", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18854526": {"recommendationid": "18854526", "author": {"steamid": "76561198133272013", "num_games_owned": 188, "num_reviews": 13, "playtime_forever": 341, "playtime_last_two_weeks": 0, "last_played": 1460548981}, "language": "english", "review": "10/10 Honestly!  I was scrolling on steam store looking to 'waste' my cash on some game I honestly wouldnt play.\nI've bought over 30 games recently and dammmmm I was suprised to see this in the new feed with only one review!!!\nI opened it... ASTERIODS... Also I saw that little Minecraft easteregg by the way <3\n\nIt's an honestly amazing game worth over $2.99\nI will play this in my spare time so much!\nPlease keep it fresh with new updates often!!\n\nALSO PLZ NERF PUZZLEBEAST. ( I'll also post in forums how to beat it coz I'm so lost with that)\n\nAnyways!\n10/10 would play nonstop", "timestamp_created": 1446547201, "timestamp_updated": 1446547201, "voted_up": true, "votes_up": 3, "votes_funny": 2, "weighted_vote_score": "0.486726", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18854393": {"recommendationid": "18854393", "author": {"steamid": "76561197966446818", "num_games_owned": 1113, "num_reviews": 56, "playtime_forever": 406, "playtime_last_two_weeks": 0, "last_played": 1507471431}, "language": "english", "review": "Looked like the type of game I would love: Random generation, very little dialog (ain't nobody got time for that), space, shooting and loot.  3 hours of 'my wife making comments that I'm always on that damn computer' later and I'm hooked on it.", "timestamp_created": 1446546418, "timestamp_updated": 1446546418, "voted_up": true, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.589395", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18852045": {"recommendationid": "18852045", "author": {"steamid": "76561197999340711", "num_games_owned": 883, "num_reviews": 32, "playtime_forever": 172, "playtime_last_two_weeks": 0, "last_played": 1450230888}, "language": "english", "review": "Paid $3 for a game.\n\nAsteroids on steroids.\n\nWould pay $3 again.\n\n10/10", "timestamp_created": 1446530322, "timestamp_updated": 1446530322, "voted_up": true, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.355656", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18851179": {"recommendationid": "18851179", "author": {"steamid": "76561197962599001", "num_games_owned": 293, "num_reviews": 20, "playtime_forever": 1160, "playtime_last_two_weeks": 0, "last_played": 1506997227}, "language": "english", "review": "$2.99. Fired it up just to check it out, thought i would do other stuff. Three and a half hours later I write this. Even if I didn't play it ever again, it would be far more worth while than the $12 or so for the average two to three hour yawn fest movie. Much more entertainment dollar value to be found here for sure. \nIt's pixely space shooty physics fun.\nYou should buy this.", "timestamp_created": 1446524701, "timestamp_updated": 1446525136, "voted_up": true, "votes_up": 14, "votes_funny": 2, "weighted_vote_score": "0.560607", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18847791": {"recommendationid": "18847791", "author": {"steamid": "76561197983680292", "num_games_owned": 484, "num_reviews": 11, "playtime_forever": 345, "playtime_last_two_weeks": 0, "last_played": 1458773739}, "language": "english", "review": "Space - The Return of the Pixxelfrazzer is a spectacular game.\nI'm always happy when \"one of those\" games falls into my hands.\nYou know, the ones you start of without a clue of what you are doing but the game pully you in nonetheless and before you know it it's morning and you didn't get any sleep.\n\nThis game defines itself through wonderful quirkiness.\n\nOne time when I was shooting at asteroids for money, one asteroid transformed into a monster and ate me.\nAnother time I was doing a quest, and when I was done the questobject suddenly killed me.\n\nSpace is never what you expect in this game, and I'm loving it.\n\nAdd to that the amount of detail besides having everything turn and eat you, and you realize this is a gem.\n\nThere's a \"wiggle\" upgrade in the game, which is supposed to make you bullets wiggle.\nBut, and I kid you not, the description text of said upgrade wiggles aswell.\n\nIt's the small things that make you wonder and smile, and it's doing that all the time.\nI guess part of this comes by not explaining much besides the basics, so you're left with a universe of strangeness to figure out.\n\nThe controls are more on the simulation side of things in normal mode, but then there's that other mode that's great for dodging and stuff.\n\n\ntl;dr\nGame is random\nGame is fun\nGraphics are retro, but with a lot of attention to detail\nMusic feels weird at first, but you grow to like it\nComplete freedom - do whatever you want\nGame takes you by the hand via tips flashing in every now and then\nYou can set the difficulty anytime\nIt has coop\nThere is a lot of things to see\nYou can freeze Planets.", "timestamp_created": 1446506963, "timestamp_updated": 1446506963, "voted_up": true, "votes_up": 6, "votes_funny": 2, "weighted_vote_score": "0.565732", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18847292": {"recommendationid": "18847292", "author": {"steamid": "76561198041911763", "num_games_owned": 101, "num_reviews": 8, "playtime_forever": 33, "playtime_last_two_weeks": 0, "last_played": 1446577303}, "language": "english", "review": "bought freeze gun and froze a planet\n\n10/10", "timestamp_created": 1446504645, "timestamp_updated": 1446504645, "voted_up": true, "votes_up": 12, "votes_funny": 10, "weighted_vote_score": "0.475037", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 7, "review_score_desc": "Positive", "total_positive": 27, "total_negative": 0, "total_reviews": 27}}
