{"reviews": {"39391775": {"recommendationid": "39391775", "author": {"steamid": "76561197989717341", "num_games_owned": 159, "num_reviews": 1, "playtime_forever": 36, "playtime_last_two_weeks": 0, "last_played": 1471012904}, "language": "english", "review": "Great story with a great twist on adventure games gameplay", "timestamp_created": 1516115487, "timestamp_updated": 1516115487, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39321929": {"recommendationid": "39321929", "author": {"steamid": "76561198293669032", "num_games_owned": 118, "num_reviews": 4, "playtime_forever": 860, "playtime_last_two_weeks": 307, "last_played": 1515459192}, "language": "english", "review": "Very nice", "timestamp_created": 1515881546, "timestamp_updated": 1515881546, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39275368": {"recommendationid": "39275368", "author": {"steamid": "76561198798566129", "num_games_owned": 18, "num_reviews": 4, "playtime_forever": 743, "playtime_last_two_weeks": 738, "last_played": 1515672333}, "language": "english", "review": "8/10 The writing is fantastic, story is really well told. My jaw actually dropped at the twist. For a retro-style, pixel art game, the design was amazing. Decent to very good voice acting. Music is repetitive MIDI-ness, but kinda catchy.  Love everything  Wadjet Eye puts out and can't wait for Unavowed.\n\nI absolutely recommend it to hardcore adventure gamers (though most have probably played it by now). I would caution newcomers: this game is tough! I admit, I consulted a walkthrough more than I like to. Most of the time, I just should have tried harder. Also, the short-term memory system, while innovative, did frustrate me more than once. I had to do a lot of backtracking to put an item in STM so I could reference it in conversation. I'm just so used to games automating this for me. But even that had a way of making me think more deeply about what I was doing, which was pretty great.", "timestamp_created": 1515743875, "timestamp_updated": 1515743875, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.491007", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38931232": {"recommendationid": "38931232", "author": {"steamid": "76561198055331665", "num_games_owned": 190, "num_reviews": 5, "playtime_forever": 64, "playtime_last_two_weeks": 0, "last_played": 1514873963}, "language": "english", "review": "There is one thing I could not get over and that is the atrocious interface.\n\nThe general drag and drop approach for using items and dialogues just makes playing the game an uncessary chore. It just doesn't work, slows you down and gets you extremely annoyed at time.\n\nAnd as nice as the short term memory feature idea is in theory its implementation is just bad. It makes the game more of a chore as you constantly have to drag stuff in and out of there. And the game makes excessive use of it, meaning you are fighting the atrocious interface all the time instead of enjoying the game and its story.\n\nAnd to top it off the way you switch between the multiple chracters and how they interact which is each other is just annoying as well.\n\nIt seems clear that the game was designed with touch screen in mind. It shows everywhere. But with mouse and keyboard on a PC the game is basically unplayable.\n\nIn the end you are just fighting the interface itstead of solving puzzles. Do not buy this even when it is on sale for 1.99 EUR.", "timestamp_created": 1514802762, "timestamp_updated": 1514803152, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.508993", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38881116": {"recommendationid": "38881116", "author": {"steamid": "76561198003416630", "num_games_owned": 169, "num_reviews": 7, "playtime_forever": 29, "playtime_last_two_weeks": 0, "last_played": 1514676615}, "language": "french", "review": "Très déçu par ce jeu que je pensais satisfaire mes goûts old-school :\n- Résolution dégueulasse.\n- Pas d'options (!)\n- Mouvements lents du perso.\n- Gros curseur, clics pas très précis.\n- Inventaire qui se déplie pas ergonomiquement.\n- Pas de bruitages !!\n- Pas de musique dans certains passages ! Silence de mort, on joue dans le silence...\n- Level design et énigme niveau CP, bugué, etc...\n\nJ'ai passé le premier niveau de l'appart, et le 2e \"niveau\" (si on peut appeler ça comme ça) du tram, qui dure 2mn de cinématique et 30s de recherche.\nEnsuite je tombe sur un menu qui me propose quatre choix : quatre MONTRES/HORLOGES de différents styles... pour... quoi faire ???\nON COMPREND RIEN ? C'est l'inverse de la situation où des débiles comprennent pas un langage trop évolué : ici on est face à un langage pas du tout évolué, et face à la débilité. Comment faire PIRE pour ne PAS se faire comprendre ?\n\nEnsuite je clique au hasard, et là j'arrive au niveau de la fillette qui se cache dans une chambre. Je ramasse l'ourson, je vais me cacher SOUS LE LIT. J'attends. Il n'y a que des détritus, et une grille d'aération. Impossible d'avancer. Je ressors pour ouvrir le coffre, et rien. Je regarde l'ourson, il y a un numéro affiché dessus ! (sic). Le monstre casse la porte. PERDU.\n\n2e essai. J'essaie de taper le numéro direct... et il marche pas. Dans un sens ou dans l'autre, rien, nada.\nLe monstre casse la porte. \n\nSuper.\n\nSuper. Naze. \n\nFatigué. Poubelle. Cliquzer 10x à pour chaque mouvement, pour rammasser un objet, pour fermer l'inventaire qui s'ouvre tout seul, pour le rouvrir plus tard... Pour observer un objet... Bref, spammer le clic gauche, dans le silence, ET DANS L'ENNUI !", "timestamp_created": 1514677259, "timestamp_updated": 1514677259, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.528579", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37483192": {"recommendationid": "37483192", "author": {"steamid": "76561198031254500", "num_games_owned": 215, "num_reviews": 7, "playtime_forever": 395, "playtime_last_two_weeks": 0, "last_played": 1511598436}, "language": "english", "review": "it's a good adventure game imo", "timestamp_created": 1511598875, "timestamp_updated": 1511598875, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.485171", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35089099": {"recommendationid": "35089099", "author": {"steamid": "76561198000413287", "num_games_owned": 2509, "num_reviews": 36, "playtime_forever": 520, "playtime_last_two_weeks": 0, "last_played": 1403275368}, "language": "english", "review": "You control four characters starring in the mysterious and intriquing story full of drama and suspension that will make you interested, wondering and dubious just until the very end which will leave your mind flabbergasted. No, it's not Heavy Rain... I actually liked Resonance even better.\n\nPROS\n+ great writing, neat story, likeable characters\n+ oldschool graphics reminiscent of the golden point'n'click era of the 90's\n+ story is switching between four characters you control\n+ music, atmosphere and overall direction\n+ puzzles that will tease your brain yet won't frustrate you\n\nCONS\n- approximately 8 hours to finish the game might be too short for someone as there is no replay value\n\nIt's been years since I played the game and I feel like I owe this game a thumbs up. I don't remember all the details yet I remember that I played it right after playing Heavy Rain and I couldn't help but constantly compare those two, yet somehow it took me so long to finish HR but Resonance I've beaten in two sessions. It's an overlooked gem which I would recommend to everyone who'd like to try some point'n'click adventuring.", "timestamp_created": 1505930087, "timestamp_updated": 1505930087, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.539605", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34644895": {"recommendationid": "34644895", "author": {"steamid": "76561198011064992", "num_games_owned": 317, "num_reviews": 4, "playtime_forever": 97, "playtime_last_two_weeks": 0, "last_played": 1439518947}, "language": "english", "review": "loved it", "timestamp_created": 1504215997, "timestamp_updated": 1504215997, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.427847", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34614130": {"recommendationid": "34614130", "author": {"steamid": "76561198037894000", "num_games_owned": 505, "num_reviews": 45, "playtime_forever": 777, "playtime_last_two_weeks": 0, "last_played": 1504025273}, "language": "spanish", "review": "Después de seguir el consejo de un malvado demonio y probar la saga Blackwell Legacy, volví a dejarme guiar y adquirí esta magnifica aventura.\n\nPodremos usar a lo largo de la aventura hasta 4 personajes, que tendrán que confiar y colaborar entre ellos pese a sus distintas motivaciones.\n\nWadjet Eye Games ha logrado sorprenderme una vez mas con una historia adulta, oscura y con sorprendentes cambios de guión que logran que te quedes pegado al monitor deseando avanzar y descubrir mas de la historia.\n\nUn juego complicado, con muchos puzzles a los que tendrás que dedicar un tiempo para poder resolverlos (como el del puñetero cableado de una puerta!) y que añade un sistema de juego muy interesante para resolver las situaciones que nos presentan.\n\n El juego consta de 3 menús que podemos usar:\n-Recuerdos: Podemos acceder a suscesos que hemos hecho anteriormente para recordar pistas o usarlo en conversaciones con otros npcs.\n-No sé como definir el 2º, pero digamos que son los elementos que podemos observar en el juego, como una ventana rota, un ordenador, etc.. . La diferencia es que no vienen predefinidas como en otras aventuras, si no que esta vez tienes que seleccionarlas y añadirlas a dicho menú para su posterior uso en las conversaciones.\n-Inventario: Lo de siempre en estos juegos .\n\n\nHabrá que conseguir mas juegos, y que nuestros colegas de Guiaspat y sus asociados sigan recompensándonos con sus traducciones :)\n\nNota final 9/10\nPodría tener traducción oficial y compatible con los logros!", "timestamp_created": 1504115293, "timestamp_updated": 1504115293, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.617834", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34550699": {"recommendationid": "34550699", "author": {"steamid": "76561198038245996", "num_games_owned": 120, "num_reviews": 4, "playtime_forever": 726, "playtime_last_two_weeks": 0, "last_played": 1503711460}, "language": "brazilian", "review": "Valeu a pena pela estória legal e sua mecânica de multiplos personagens", "timestamp_created": 1503920523, "timestamp_updated": 1503920523, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34223781": {"recommendationid": "34223781", "author": {"steamid": "76561198065952271", "num_games_owned": 234, "num_reviews": 27, "playtime_forever": 431, "playtime_last_two_weeks": 0, "last_played": 1502661264}, "language": "english", "review": "Excellent adventure game. I don't recall having played one with a similar mechanic: you have Long Term Memory and Short Term Memory besides Inventory. LTMs are only gained through story, but STMs you can \"get\" from the scenes, recording them for bringing them up in speech. It's very interesting and functional.\nThe story is great, with twists I couldn't foresee and multiple endings, The puzzles makes sense, and the \"talk with other characters to get a hint\" really helps. It needs to be said because I have played a lot of games that in-game hints don't help at all.\nAnother great adventure from Wadjet Eye. I highly recommend this one, Technobabylon, and Primordia.", "timestamp_created": 1502661863, "timestamp_updated": 1502661863, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.529667", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34191104": {"recommendationid": "34191104", "author": {"steamid": "76561197970889689", "num_games_owned": 32, "num_reviews": 1, "playtime_forever": 623, "playtime_last_two_weeks": 0, "last_played": 1481227560}, "language": "english", "review": "captivating storytelling in one of the best PnC-adventures i have ever played through. dont be turned off by the retro graphics, you would miss a truly special adventure game.", "timestamp_created": 1502543879, "timestamp_updated": 1502543879, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.505798", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33977126": {"recommendationid": "33977126", "author": {"steamid": "76561198035047403", "num_games_owned": 24, "num_reviews": 1, "playtime_forever": 1115, "playtime_last_two_weeks": 0, "last_played": 1501709265}, "language": "brazilian", "review": "Jogo muito bom. Com puzzles de várias dificuldades, reviravoltas e suspense.", "timestamp_created": 1501700358, "timestamp_updated": 1501700358, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.491007", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33589599": {"recommendationid": "33589599", "author": {"steamid": "76561198012395761", "num_games_owned": 363, "num_reviews": 10, "playtime_forever": 930, "playtime_last_two_weeks": 0, "last_played": 1500224902}, "language": "english", "review": "I love point-and-click adventures. Usually the only chore with this genre is that sometimes there is no rhyme or reason to the puzzles, and one ends up clicking and combining everything possible in order to proceed.\n\nThis game has a similar problem with a twist. Most of the time it is clear WHAT should be done, and the actions make sense as such, but the user interface is so horrid it regularly is nigh impossible to figure out HOW to do it. In general, the game's UI makes doing anything at all as hard as possible, and not in an entertaining manner.\n\nJust an example: there is a thing you need to read to gain crucial information, and it is made clear you can't take the thing with you. In most games, simply reading the thing would unlock dialogue options related to it. Not here; you have to figure out that you CAN drag-and-drop the thing into a special inventory (\"short term memory\"), where it becomes a conversation item, that can then be used in dialogues elsewhere. Anything can be dragged into this inventory, but only a few items can be stored there at one time; as it is often not clear which STM items are important and where they should be used, this quickly becomes very annoying. (To muddy the waters even further, there's also a third separate inventory, for \"long term memories\". They also need to be used like items.)\n\nThere are not enough saving graces either. Having several playable characters is an intriguing idea and one plot twist and a couple of puzzles utilize it nicely, but it also multiplies the irksomeness of the overly convoluted inventory system. (And that's a major issue, because most of the gameplay in this genre consists of inventory management.) The story is OK, but not very original. Graphics are very retro and get the job done, but are nothing to write home about. The characters are clichéd and lack depth. Dialogues are vapid. Atypically for a Wadjet Eye Games product, even voice acting and music are stale. And the vexing trial-and-error games in the end ensure the whole thing ends on a sour note.\n\nI crawled my way through, but playing this game felt like working a never-ending shift in an office where someone regularly hides your mouse and keyboard.", "timestamp_created": 1500225241, "timestamp_updated": 1500229357, "voted_up": false, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.604029", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33138321": {"recommendationid": "33138321", "author": {"steamid": "76561197972470324", "num_games_owned": 300, "num_reviews": 2, "playtime_forever": 386, "playtime_last_two_weeks": 0, "last_played": 1499011319}, "language": "english", "review": "I've played many, many point and click adventure games over the years and this one rates among the very best. Pretty tough at certain points, but the puzzles were always logical and fair. Story is great, atmosphere spot on. I've only played a handful of Wadjet games so far but to be honest I don't know why.. they never seem to disappoint. This particular one comes with my highest recommendation!", "timestamp_created": 1499011701, "timestamp_updated": 1499011701, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.505798", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32828802": {"recommendationid": "32828802", "author": {"steamid": "76561198033812163", "num_games_owned": 1591, "num_reviews": 337, "playtime_forever": 134, "playtime_last_two_weeks": 0, "last_played": 1498419194}, "language": "english", "review": "I love pnc adventures and developers such as Wadjet Eye, but I have to say this game for me has the worst User Interface I have ever had the misfortune to play through. I recently finish Shardlight and alot of the other games from Wadjet Eye and loved them, Resonance though has a horrible UI. So much so, it has completely put me off playing the game. I can not recommend this title because of this.\n\nMy Score - 5/10", "timestamp_created": 1498507690, "timestamp_updated": 1500725678, "voted_up": false, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.442718", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31919298": {"recommendationid": "31919298", "author": {"steamid": "76561198046123558", "num_games_owned": 767, "num_reviews": 6, "playtime_forever": 626, "playtime_last_two_weeks": 0, "last_played": 1495143712}, "language": "english", "review": "In my opinion Resonance is the best point-and-click game of the past 15 years. If that seems like a bold statement, let me explain why I believe that.\n\nOn first glance this game seems like a tribute to old school games of this genre, but its graphic style is maybe its only classical aspect. Rarely have I ever seen so many innovations and brilliant design decisions in a single game. After a short introduction you find yourself in control of 4 different characters, each with their own inventory and Short Term Memory. A third category, Long Term Memory, is mostly shared between all the characters. Considering that every single object or character in the world can be memorized for a later use, the game presents us with a number of options that far exceeds any adventure game I have ever played. \n\nSome people said it was complexity for complexity sake. I strongly disagree with that. By offering us that many choices, the game forces us to get rid of the old habit of rubbing each item against every other to find a solution ; in Resonance it would take a lifetime to test everything. As a direct result you have to pay attention to what's happening and figure out all the puzzles by thinking about them logically : you can't brute force your way through. \n\nThis makes the progression that much more involving and satisfying. Resonance is a game that trusts its players to be willing to pay attention to details and spend some time thinking before acting. Play this game carelessly and you will be frustated : is that a fault of the game though, or just your lack of focus ?\n\nThe overall story is fascinating but it's the narration and the way the puzzles are set up that truly elevate this game to a masterpiece. Being able to use information in addition to regular items is truly revolutionary and gives the developer a way to set up brilliant puzzles all through the game. Interactions with computers are simulated though a visual interface that reminded me of Vampire The Mascarade : Bloodlines and Uplink. By allowing you to type passwords, browse through files or type console commands, this system gets very involving and satisfying. I would love to go into details about some of the best parts of this game but I truly believe you should experience them for yourself. \n\nI could probably talk about this game for hours but it would be a shame to reveal too much about it. I cannot encourage you enough to play it if you like adventure games or are just interesting in game design. It's innovating, surprising, involving, emotional, satisfying, and just plain brilliant. I know it one of the very few games I will still be thinking about in years.", "timestamp_created": 1495553031, "timestamp_updated": 1495553031, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.579733", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31872410": {"recommendationid": "31872410", "author": {"steamid": "76561198035946000", "num_games_owned": 471, "num_reviews": 240, "playtime_forever": 889, "playtime_last_two_weeks": 0, "last_played": 1495328687}, "language": "english", "review": "Cool Adventure Clickie.\nComment to the story writer - if a spherical section of structural steel is removed - the building will most likely collapse.\nComment to devs - please include VSync, because the game exe runs via DXWnd, my card cannot take control of settings.\nOtherwise - thanks!", "timestamp_created": 1495328882, "timestamp_updated": 1495328882, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.479986", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31737740": {"recommendationid": "31737740", "author": {"steamid": "76561197964292875", "num_games_owned": 537, "num_reviews": 177, "playtime_forever": 4474, "playtime_last_two_weeks": 0, "last_played": 1494728672}, "language": "english", "review": "For those that are wondering what would be a good old school adventure game to play after playing Gemini Rue - look no further. Resonance is a good sci-fi mystery story with a great twist and excellent backgrounds and music. It also has excellent puzzles where I had to sit and think but not too frustrated. I highly recommend it. 9/10!", "timestamp_created": 1494728779, "timestamp_updated": 1494728779, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.529510", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31630736": {"recommendationid": "31630736", "author": {"steamid": "76561198057386857", "num_games_owned": 1603, "num_reviews": 198, "playtime_forever": 446, "playtime_last_two_weeks": 0, "last_played": 1494265140}, "language": "russian", "review": "Душевный крупнопиксельный квест. Resonance не самая, по моему мнению, удачная из выпущенных Wadjet Eye Games игр, но безусловно запоминающаяся и затягивающая. Рекомендую.", "timestamp_created": 1494265672, "timestamp_updated": 1494265672, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.509138", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 325, "total_negative": 28, "total_reviews": 353}}
