{"reviews": {"39427527": {"recommendationid": "39427527", "author": {"steamid": "76561198042260385", "num_games_owned": 178, "num_reviews": 6, "playtime_forever": 755, "playtime_last_two_weeks": 755, "last_played": 1516327707}, "language": "english", "review": "I've only played several hours and I am in love with this game. When I first downloaded it I wasn't very intrigued, due to how I felt making things, not getting things to line up properly, but after about ten minutes I made a neat helmet I could wear on my avatar. Still at this point I felt like it was too time consuming until I went to some people's worlds and saw the cool things they made. Eventually I reached a big reason why this game is so good I met two random people and they decided to take me and a few others on a crazy journey, basically we broke the game by flying around at supersonic speeds and had a great time. This game is great because of how creative you can be and the things you can make and the people you will meet along the way to have a good time.", "timestamp_created": 1516244014, "timestamp_updated": 1516244014, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39329641": {"recommendationid": "39329641", "author": {"steamid": "76561198079436246", "num_games_owned": 152, "num_reviews": 12, "playtime_forever": 391, "playtime_last_two_weeks": 294, "last_played": 1516083445}, "language": "english", "review": "Aside from the steep learning curve and several missing tools (Scale snap to grid, ability to select multiple objects, mirroring, etc. Least I believe they are missing), it's quickly become one of my favorite VR games. From the ability to create whatever you want, to seeing what everyone else can create and imagine, it's an amazing experience of fun.", "timestamp_created": 1515908800, "timestamp_updated": 1515908800, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.517241", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39268144": {"recommendationid": "39268144", "author": {"steamid": "76561198191576345", "num_games_owned": 184, "num_reviews": 7, "playtime_forever": 2318, "playtime_last_two_weeks": 0, "last_played": 1492031577}, "language": "english", "review": "Fantastic world builder with an awesome dev. The fact it's free now is mind blowing, literally no reason not to!", "timestamp_created": 1515713353, "timestamp_updated": 1515713353, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39214729": {"recommendationid": "39214729", "author": {"steamid": "76561198415990769", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 12549, "playtime_last_two_weeks": 3026, "last_played": 1516391258}, "language": "english", "review": "Before discovering Anyland I would have never thought I'd be able to create interactive environments or things without learning a coding tool like Unity... BUT now I know it's possible and it's due to the creators of and in Anyland.\n\nThis is a social platform that allows you to create environments and things in world without having to know coding languages... it's creation tools aren't intuitive at first BUT if you watch a few youtube instruction videos and/or make friends in Anyland, the creation tools have a small learning curve. The tools allow you to script anything you make or anything that has been made clonable. EVERYTHING you encounter in Anyland was created by the users in Anyland with the in world creation tools... so Anyland is as cool and interesting as we make it!\n \nThe social aspects are diverse but the ability to collaborate and share creations is exciting and inspiring to me. Going exploring into areas/worlds is made fun partially because you can collect cool items along the way and meet new people in crazy avitars created with the in world tools! \n\nIf you like the idea of creating and/or exploring and/or collecting and/or collaborating and/or socializing in unique environments... give Anyland at least 8 hours of your time (not in one day, unless thats your flow) and I think you'll understand it's potentials and value.", "timestamp_created": 1515525809, "timestamp_updated": 1515525809, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38921065": {"recommendationid": "38921065", "author": {"steamid": "76561198040869501", "num_games_owned": 123, "num_reviews": 3, "playtime_forever": 6492, "playtime_last_two_weeks": 102, "last_played": 1516212926}, "language": "english", "review": "Sick stuff. Check it out, homirez. (hit me up in-game <3)", "timestamp_created": 1514771467, "timestamp_updated": 1514771467, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38681241": {"recommendationid": "38681241", "author": {"steamid": "76561198050767278", "num_games_owned": 105, "num_reviews": 14, "playtime_forever": 2230, "playtime_last_two_weeks": 0, "last_played": 1511762369}, "language": "english", "review": "this game is freakin amazing... i cannot believe this game is FREE!!!! so much you can do! craft your heart out.. build your own little world! you can even craft a tv that can play youtube videos you can watch  WHILE CRAFTING!!! im amazed with this game. im inlove with it. \nthe only CON is that you can only place so many objects in your world :( so it limited the detail you can put into it.\ni hope they fix this. also, a save file feature would be nice too. you have no idea how many times i have accidently deleted something i worked so hard on", "timestamp_created": 1514256577, "timestamp_updated": 1514256577, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": "3", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38522382": {"recommendationid": "38522382", "author": {"steamid": "76561198084704299", "num_games_owned": 95, "num_reviews": 2, "playtime_forever": 13198, "playtime_last_two_weeks": 3054, "last_played": 1516332016}, "language": "english", "review": "Considering how much time I've spent in this game, I should probably review it.\n\nAnyland is not like any other game I've ever played. To start with, it is at once the easiest game I've ever played, and the hardest. The game doesn't set up any bad guys to beat, and there are no inherent missions to clear. You don't get a high-score, and you're never in danger of dying. You build things out of simple shapes. A table is a flat block and a four long blocks, a drink is a cylinder with liquid inside. The scripting is as simple as telling an object to do something when something else happens. On the surface, it seems to be nothing more than a cute social VR game, one where things a bit more customizable than others, but that's about it\n\nThat's easy mode.\n\nThen we have \"hard mode.\"\n\nWhen you really start getting into it, you'll find a game that is more intricate, more elaborate, more involved, and more open-ended than anything I've ever experienced before.\n\nMost people start with making an avatar, it's a good place to start, and deceptively simple. I've seen avatars that have a squirrel piloting a a WW11 aircraft for a head, one that looks like the Job Bot from Job Simulator, one that has a bird of a head and two birds for hands and nothing else, and a one that looks like a very classy robot. My own avatar has a rocket powered fist I can fire. I made it because I could, and because it pleased me, and for no other reason. You're only limited by your imagination and the amount of time and work you're willing to put into the things you make.\n\nLike guns? There are million to try out. Don't like any of the ones you find? Make your own. You can make it fire anything you want. Bullets, grenades, lazers, bubbles, lava, pigs. You make it, you can fire it.\n\nDon't like guns? Make anything else. Literally. Anything. Else. I made a forest. I also made some fish, they swim around in a little pond. I know someone who made a replica of the Disney Castle. Someone made a train you ride. For Halloween, some users made a Haunted Trail. It was jump scares and even an entrance to The Upside Down. There are worlds built around solving puzzles, worlds built to look beautiful, worlds built for playing games. Just the other day I saw a world where someone made a bubble machine with poppable bubbles.\n\nNot every world or item is great. Not every world or item is perfect, and that is why this game is \"hard.\" Every single thing I've mentioned so far was made by players. The Devs in this game are incredibly responsive to the community, and very interactive, but they only provide the tools. Literally just the tools. When you zone in for the first time, there's no tutorial. You just find yourself on a barren rock with nothing but a pair of hands and a ring on your thumb. There is a tutorial video on the ring you can watch from within the game, but it's nothing more than the basics of the basics. The devs don't want to restrict you on what you think you can do, everything is up to you. So the devs don't provide instruction--\n\nBut the other players do. I've never encountered such a positive community before in an online game. Sure, there are a few bad eggs, but those are very rare, and in over 100 hours of playing I've met maybe two. The community is small, but very helpful. When you're first \"born\" into the world, an announcement is sent out, and chances are someone will stop by to greet you. Don't be shocked, we all just want to share how great of a place Anyland is, and make sure you know how to play. If you have questions, ask--someone will answer. If they don't know the answer, well, we'll try to figure it out together. This isn't just a social community, this is a community of psuedo-gods creating a multi-verse together.\n\nAre you ready to build with us?\n", "timestamp_created": 1513930719, "timestamp_updated": 1513930719, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.565217", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38313972": {"recommendationid": "38313972", "author": {"steamid": "76561198204707856", "num_games_owned": 359, "num_reviews": 2, "playtime_forever": 8398, "playtime_last_two_weeks": 3390, "last_played": 1516355605}, "language": "english", "review": "So far of all theVR games i have played this is by far the most fun. The learning curve for creation is a little steep but the people on here are always more than willing to give you tips or advice on how to improve a creation.\n\nA little note for any who may be potentially driven away by the creation tools payment thing. you can always get them for free on a weekly basis. it is free to play you can choose to pay for the tools to help support the developers.", "timestamp_created": 1513302434, "timestamp_updated": 1513302609, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38250324": {"recommendationid": "38250324", "author": {"steamid": "76561198189265346", "num_games_owned": 39, "num_reviews": 11, "playtime_forever": 4994, "playtime_last_two_weeks": 1713, "last_played": 1516305491}, "language": "english", "review": "This game is extremely cool. I honestly think I underpaid. You can make whatever you want whenever you want, nothing except your starting part is pre-made, and you don't have to pay anything.\n\nTO ANY NEW PLAYERS: THE BUILD TOOLS DON'T REQUIRE A SUBSCRIPTION. YOU CAN JUST KEEP DOING THE WEEK TRIAL OVER AND OVER AGAIN\n\nPros-n-Cons\n\nPros:\nYou can make anything\nNo credit card required\nUses steam credits for donation\nActive developers\nActive players\nFriendly community\n\nCons:\nRandom bug where controller vibrates\nSubscription drives some people away (who don't realize you can do it for free forever)\nHard to make body :(\nThat one flying thing that I made that keeps running into my face\n\n10/10 would make face rammer again.", "timestamp_created": 1513057234, "timestamp_updated": 1514853036, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38191066": {"recommendationid": "38191066", "author": {"steamid": "76561197997080649", "num_games_owned": 408, "num_reviews": 2, "playtime_forever": 1510, "playtime_last_two_weeks": 76, "last_played": 1516227373}, "language": "russian", "review": "Anyland это игра, в которой весь игровой мир создан совместными усилиями самих игроков. Вы не найдете здесь процедурно сгенерированных локаций, здесь нет рецептов для крафта, а материалы не нужно копать под землей. Всё, что у вас есть - это набор геометрических примитивов, материалов и текстур, система партиклов, скриптовый язык и ваше воображение. Конечно, если не хочется создавать что-то самому, всегда можно скопировать предметы, созданные другими людьми. Здесь есть множество крутых предметов, таких как световые мечи, разного рода оружия, всякие девайсы, шуточные устройства, мебель любого калибра, дома, что угодно. Но, поверьте, вам захочется создавать что-то, поскольку это действительно впечатляет и затягивает.\n\nИгровое сообщество очень дружелюбное и общительное, половина геймплея это именно общение, взаимодействие с другими игроками. И в этом отношении игра иногда создает ситуации, чувственное восприятие которых сравнимо с реальными тусовками с реальными людьми. Понимаешь, что некоторые моменты невозможно повторить или вернуть. В сообществе есть особенно активные игроки, которые создают нереально крутые штуки, и с ними можно пообщаться и чему-нибудь научиться. Что и говорить, даже сам разработчик (Phillip)  периодически встречается в игре.\n\nДля русскоязычных игроков стоит добавить, что всё (или почти всё) общение происходит в устной форме. Если у вас есть навыки английского языка, готовьтесь к тому, что рано или поздно языковой барьер просто порвётся. Большинство игроков очень терпеливы и тут мало настоящих носителей английского языка, вам помогут и подскажут, даже если вы говорите на ломаном английском языке.\n\nИгра очень затягивает и порой воспринимается как вторая жизнь. За время игры не встретил ни одного русскоговорящего человека, но и общение на английском идет очень хорошо и приятно. Заходите, творите, общайтесь. Добро пожаловать в Anyland!", "timestamp_created": 1512852006, "timestamp_updated": 1512852006, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38104629": {"recommendationid": "38104629", "author": {"steamid": "76561198114294787", "num_games_owned": 9, "num_reviews": 5, "playtime_forever": 103, "playtime_last_two_weeks": 0, "last_played": 1513782409}, "language": "english", "review": "Personally I use the desktop mode and seeing how im not able to completely play the game to its potential I still think its a pretty amazing. I may not have played it for a long time but i still enjoyed every moment because the people on there are all really nice and funny when you actually leave your home area. Honeslty the more you play and look around and explore, chances are the more you will enjoy it.", "timestamp_created": 1512571076, "timestamp_updated": 1512571076, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37989459": {"recommendationid": "37989459", "author": {"steamid": "76561198092276025", "num_games_owned": 57, "num_reviews": 7, "playtime_forever": 14085, "playtime_last_two_weeks": 7881, "last_played": 1516381704}, "language": "english", "review": "This game is so fucking good.\n\nI am so surprised this game hasn't gained more attention.\n\nJust play it, trust me.", "timestamp_created": 1512173369, "timestamp_updated": 1512173369, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.503311", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37971693": {"recommendationid": "37971693", "author": {"steamid": "76561198433666559", "num_games_owned": 5, "num_reviews": 4, "playtime_forever": 10, "playtime_last_two_weeks": 0, "last_played": 1512067743}, "language": "english", "review": "Not worth the time you need for downloading and installing. The Game is made up of primitive geometries only. No other people online. No fun and looks like ****.", "timestamp_created": 1512117945, "timestamp_updated": 1512117945, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.321109", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37923411": {"recommendationid": "37923411", "author": {"steamid": "76561198003898376", "num_games_owned": 91, "num_reviews": 13, "playtime_forever": 1658, "playtime_last_two_weeks": 0, "last_played": 1514769891}, "language": "english", "review": "Holy Cow....\nSo.. 171 days ago (the log says) I tried this game out. Went in.. tried to make something, got frustrated, then left. Today out of boredom, I was browsing VR game reviews. Came across all the hoopla here and thought..  I remember trying that weird game. Guess I'll see if something has changed. Logged on...  zoned in to my floating island with the  boobs suspended in space. I think I was trying to make a face, but gave up when I couldn't figure out how to delete a mistake. So these boobs have been suspended in mid air for 171 days waiting to be deleted.  Determined to figure this shit out.... I started messing around, and the first thing I made was a moon... which was enough to pique my interest. Now... i'm building a temple for the Goddess Awara... and I'll probably have a few more moons and stars... and other things. This is an Aquarians dream come true.  i'd rate it 9/10...  had to -1 for the learning curve. it's challenging... but i have a feeling it's worth it.", "timestamp_created": 1511947370, "timestamp_updated": 1511947370, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.563001", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37373329": {"recommendationid": "37373329", "author": {"steamid": "76561197970491406", "num_games_owned": 498, "num_reviews": 1, "playtime_forever": 746, "playtime_last_two_weeks": 0, "last_played": 1511289089}, "language": "english", "review": "Great VR Builder/Sandbox. Active and engaged developers and community.", "timestamp_created": 1511542143, "timestamp_updated": 1511542143, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.512987", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37371996": {"recommendationid": "37371996", "author": {"steamid": "76561198046457618", "num_games_owned": 33, "num_reviews": 2, "playtime_forever": 3236, "playtime_last_two_weeks": 54, "last_played": 1515989204}, "language": "english", "review": "This game is amazing. AND ITS FREE. You can build stuff of your dreams, and meet new people.\n", "timestamp_created": 1511541744, "timestamp_updated": 1511541744, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503311", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37175133": {"recommendationid": "37175133", "author": {"steamid": "76561198052729722", "num_games_owned": 147, "num_reviews": 1, "playtime_forever": 26044, "playtime_last_two_weeks": 1773, "last_played": 1516148281}, "language": "english", "review": "One of the best sandbox VR games.\nand its free!", "timestamp_created": 1511464345, "timestamp_updated": 1511464345, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.512987", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37074792": {"recommendationid": "37074792", "author": {"steamid": "76561198110546528", "num_games_owned": 137, "num_reviews": 3, "playtime_forever": 19096, "playtime_last_two_weeks": 3415, "last_played": 1516382973}, "language": "english", "review": "This is one of the best VR games ever!\nAnd this is definitely the best sandbox game out there!", "timestamp_created": 1511445884, "timestamp_updated": 1511445884, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503311", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36771145": {"recommendationid": "36771145", "author": {"steamid": "76561198051443068", "num_games_owned": 111, "num_reviews": 11, "playtime_forever": 1087, "playtime_last_two_weeks": 0, "last_played": 1512440219}, "language": "english", "review": "Is easily on of my favorite vr games and the community is so nice and helpful.", "timestamp_created": 1511380703, "timestamp_updated": 1511380703, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.503311", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36458948": {"recommendationid": "36458948", "author": {"steamid": "76561198110670256", "num_games_owned": 150, "num_reviews": 21, "playtime_forever": 1486, "playtime_last_two_weeks": 0, "last_played": 1510976141}, "language": "english", "review": "Anyland keeps sucking me back in, not sure why? Creating is fun but kinda finnicky, some new features are hard to understand, some menus have become very clunky with pages of options, sub groups confuse me, etc. But the feeling of standing in your own little world is great, thinking \"I made this\" and stuff. \n\nPeople seem nice but I am super shy so i don't talk much, so prepare yourself to talk to peeps if you go online. Also some people flex with their avatars real hard but whatever, y'know. not my place to judge. \n\nThere are many, many places to visit, and some are really stunning once you realize how finnicky building can be. It's cool to just visit, you don't really have to build.\n\nSo this is a great thing! I suggest you visit, and i guess make the donation they have now, because the devs constantly update it and are even online often too! A very unique experience.", "timestamp_created": 1510455531, "timestamp_updated": 1510455531, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.489164", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36429146": {"recommendationid": "36429146", "author": {"steamid": "76561198358034703", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 21183, "playtime_last_two_weeks": 0, "last_played": 1510111685}, "language": "english", "review": "I dearly love Anyland. It it by far the best VR thing out there. I have used it to build notebooks and thinking spaces that I would otherwise not had the tools to build. I know it is meant for building a universe together but I use it as an sketchbook and spatial meeting place. Its fantastic.", "timestamp_created": 1510354170, "timestamp_updated": 1510354170, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.508197", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35808721": {"recommendationid": "35808721", "author": {"steamid": "76561198312750267", "num_games_owned": 23, "num_reviews": 15, "playtime_forever": 8, "playtime_last_two_weeks": 0, "last_played": 1507756457}, "language": "english", "review": "Not worth getting, its pretty much 80% DLC and you can't really do anything without buying it.\nSo don't get it.", "timestamp_created": 1508292016, "timestamp_updated": 1508292016, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.254910", "comment_count": "4", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35563721": {"recommendationid": "35563721", "author": {"steamid": "76561198208023683", "num_games_owned": 49, "num_reviews": 3, "playtime_forever": 2624, "playtime_last_two_weeks": 0, "last_played": 1512319594}, "language": "english", "review": "its very annoying that my glowhands light the interface please\nmake it so the interface isnt affected by light", "timestamp_created": 1507442718, "timestamp_updated": 1508048138, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.493827", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35481301": {"recommendationid": "35481301", "author": {"steamid": "76561198049243982", "num_games_owned": 157, "num_reviews": 5, "playtime_forever": 4667, "playtime_last_two_weeks": 0, "last_played": 1512595703}, "language": "english", "review": "So, after a week of playing this game using my oculus, here is the story i want to tell:\n\ni've seen soemone i play modbox with occasionally try this game out, so naturally, and out of curiosity, and because it is free, i downloaded it.\nfunnily enough, my friend didn't liked anyland as much as i do now.\n\nthis game has a steep learning curve.\n\ni startet out in my dark diskworld, messing around with the options menu, where i saw that, apparently, to create stuff you would have to pay for it, or try it out for a week for free.\nnot wanting to immediately starting the trial week, i started looking at the different areas that were available.\ni've seen only one area with one dude in it.\nthe trash zone.\n\"sounds intruguing\".\nso i went in there, and arrived in a dark, lonely road in the woods, with a sewer acess grate a bit far off.\n\"looks cool\", i thought, and moved in to try to open the sewer cover.\nwhat i found in the sewer changed my life...\n\nit was \"Overvisor\".\nat the time i didn't knew that, but he was a huge deal in the community.\ni think i bothered him a bit, he seemed tired, but he was still nice, something i did not expect (but later on i realized that being nice is the norm in this game).\nhe showed me what he had done (amazing sewer system, awesome effects, complicated arm computer),\nand he told me the one thing that would get me hooked on this game:\nyou don't need to pay, ever, to build stuff.\n\nyep, this game is completely free to play.\napparently, the devs were miscommunicating.\nthe game would just ask you every week to donate, but it's just that - a donation.\nso i started messing around with my world.\n\nthe first thing i created was an apple.\nthen i added eating animations.\nnow i had an apple that would shrink when i took a bite out of it.\nthen i made a guitar.\nthen i made myself a medieval helmet that would light up when you talk.\nthen i met more nice people.\nthen i started hoarding stuff.\n\non the second day of playing this game, i asked in the forums how people are making guns.\nthey linked me a video tutorial.\nafter watching it, i made a nerf gun.\nand a toolbelt.\nand my floating island.\nand met more friendly people.\n\nnow, i've spent a week playing it.\nevery so often i would log on, meet familiar faces, meet new people, and all of them are nice.\ni've made a gun that can teleport people to my home or kill them, depending on what you set it to\n(cue star trek's \"setting phaser to stun\" - damn, i should've added a stun mode :D)\n\ni've made my own card.\nif you scan it, you take an airship ride to my place.\nand if you jump into the airship there, you can ride it back to where you came from.\nand if you miss me, you can elave me a message in my mailbox.\nand i've got multilpe islands.\nmy home is improving.\nmy skills are improving.\nmy social circle is improving.\n\nlater on, i noticed different snapping options, and my builds became nicer to look at.\ni still have my shoddy, bent portal gun (that shoots kinda sideways), but my home looks better by the day\n(when i get  to design stuff - usually i like to talk to people)\n\ni love this game. i love this community.\nthe developer is online often, doing his rounds, speaking to people, looking for bugs and feedback.\nhe is dedicated.\ni'm planning to build a shrine to him in my world.\ni already have a body pillow of him.\n\n------------------------------------\n\nif you own a VR headset and if you like doing beautiful and/or complicated stuff, this gaem is for you.\nif you like to meet new, nice people from all over the world, this game is for you.\nif you like shooting your friends in the face, this game is for you.\nif you like the original doom, well, someone has remade it for you.\nif you like rainbow six: siege, well, someone is working on that for you.\nif you like to make music, this game is for you.\nif you like trains, this game is for you (seriously, the working train system by fazzi is amazing!)\nif you like memes, this game is for you.\nif you like sleep deprivancy because you're living in a country o nthe other side of the globe, and most people are online when it's midninght where you live, this game is for you.\nif you don't like sleep deprivancy, well, you will learn to embrace it for all the good parts this game has to offer.\nif you like funny objects/tools, this game is for you.\nif you like your VR headset, this game is for you.\n\njust don't get frustrated if you don't understand it's logic components.\ni've met a guy who hasn't touched the logic components of this game, ever, and he palyed for more than a year and made himself a name in it^^\nand if you suck at making beautiful things, then just ask people to do models for you, you can add the logic yourself.\nor ask people to do the logic for you.\nor see if someone has already made what you're looking for.\nlike the portal gun from portal.\nor the portal device from rick and morty.\nor realistic guns.\nor unrealistic guns.\nor the tardis.\nand more!\n(everything working ofc)\n\nso, if you own a VR headset, then go download this game, see if anyone is online on http://in.anyland.com/\nand come say hello^^\ni promise you, we won't send you straight to purgatory when you join^^\n(you can't use teleport bullets on people who don't have a body, so we'll most likely just give you a body and then transport you to purgatory... jk. we aren't giving out bodies, just heads^^)\n(btw, there's also a body shop where you can simply take bodies you like)", "timestamp_created": 1507154162, "timestamp_updated": 1507154162, "voted_up": true, "votes_up": 40, "votes_funny": 4, "weighted_vote_score": "0.788657", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35460557": {"recommendationid": "35460557", "author": {"steamid": "76561198064879265", "num_games_owned": 81, "num_reviews": 36, "playtime_forever": 4536, "playtime_last_two_weeks": 14, "last_played": 1516211387}, "language": "english", "review": "what to make a gun that shoot more gun? you can! \n\nits hard to learn at first but you will definitly like the game if you take your time\n\nits f2p so try it and see by yourself   \n\nthe only cons i see is you need to be creative and you need patience because sometime it aint easy building epic stuff,  that and the interface is clunky a bit\n\ni definitly recommend it\n\n", "timestamp_created": 1507082099, "timestamp_updated": 1507082099, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35457980": {"recommendationid": "35457980", "author": {"steamid": "76561198136765481", "num_games_owned": 70, "num_reviews": 13, "playtime_forever": 11698, "playtime_last_two_weeks": 1, "last_played": 1515637892}, "language": "english", "review": "Best sandbox vr game \nCant get any better then this. \nOh yah and its free!", "timestamp_created": 1507069905, "timestamp_updated": 1507069905, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35402744": {"recommendationid": "35402744", "author": {"steamid": "76561198205730141", "num_games_owned": 37, "num_reviews": 5, "playtime_forever": 262, "playtime_last_two_weeks": 0, "last_played": 1512609225}, "language": "english", "review": "When I got in I went to the first place suggested and it had giant statues of a couple of the characters from Gorillaz and a billboard where I found an advertisement for the Cafe 80's from Back to the Future II. So I typed it in the search and it was incredible. It was just like in the movie and even the arcade game worked, I felt like Marty McFly.\n\nThen I realized I could see which worlds had people in them and I went to a place where a couple players/creators were discussing a new helmet that one of them had been working on for two days and wasn't sure what size he wanted to make it. Then I went and found some girl who I talked to about the game for a minute and we stood and watched YouTube at her computer desk. \n\nThen I left to find other worlds but she pinged me with an invite to join her somewhere else so then we went to a bunch of crazy user made places together. We found Boos from Mario, I went to Mos Eisley. We went inside a pervert's monitor, we interacted with a guy who had a great snowman avatar and a guy that occasionally showed up on our adventures zapped us with some.gun that forced us to go to his house to see his latest creations. What a trip..", "timestamp_created": 1506912237, "timestamp_updated": 1506912237, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.507373", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35099407": {"recommendationid": "35099407", "author": {"steamid": "76561198010828887", "num_games_owned": 285, "num_reviews": 136, "playtime_forever": 1163, "playtime_last_two_weeks": 10, "last_played": 1515190531}, "language": "english", "review": "its Free and good and full of creative ppl instead of stolen miku miku dance avis like othr gamez", "timestamp_created": 1505979040, "timestamp_updated": 1505979040, "voted_up": true, "votes_up": 3, "votes_funny": 2, "weighted_vote_score": "0.344299", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34959922": {"recommendationid": "34959922", "author": {"steamid": "76561198089876770", "num_games_owned": 90, "num_reviews": 19, "playtime_forever": 56, "playtime_last_two_weeks": 0, "last_played": 1483156066}, "language": "english", "review": "Good game, but It could have been free to begin with, BUT they listened to the comunity.", "timestamp_created": 1505432251, "timestamp_updated": 1505432251, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.475230", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34830926": {"recommendationid": "34830926", "author": {"steamid": "76561198369293077", "num_games_owned": 21, "num_reviews": 13, "playtime_forever": 70, "playtime_last_two_weeks": 0, "last_played": 1510128330}, "language": "schinese", "review": "这是 一款非常好玩的游戏，开放式的沙盒类VR游戏。沙盒类游戏大家应该都玩过人气很旺的《我的世界》，玩家在游戏中自由建设和破坏，而《Anyland》这款游戏采用的玩法是多人互动游戏，你可以建造一个只属于你的空间，之后和玩家进行相互拜访，玩法相当的自由，你完全可以按照自己的喜好来调整空间的装饰。可以在里面创造自己的角色，打造自己的天地，手指动一动就可以编辑出“阳光小岛”或“忧郁城堡”，而且别人无法对你的杰作进行更改。当然，通过设定，你也可以让别的玩家克隆你的作品并添上几笔，还可以看看别人是怎么把你创造的木椅华丽变身为奢华的沙发。总而言之，就是随心所欲的，当然也可以大开脑洞去建造自己独特完美的城堡。我就是用这个设计出来一个简单的飞行器，在阳光海滩上飞。还有钢琴、架子鼓随性的玩，加上轻盈欢快的背景音乐，特别惬意舒适。当然我是用大朋E3定位版头盔玩的。", "timestamp_created": 1504941220, "timestamp_updated": 1504941220, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34487221": {"recommendationid": "34487221", "author": {"steamid": "76561197979918194", "num_games_owned": 582, "num_reviews": 53, "playtime_forever": 2638, "playtime_last_two_weeks": 0, "last_played": 1504927427}, "language": "english", "review": "I bought this game back when it had a buy once play free model, and honestly I am pretty happy about the purchase.\n\nThey currently have it F2P and are going to add a yearly subscription to it, but early buyers get a free pass.\n\nIn anyland you have a blank plain to build whatever it is you wish, using basic shapes you connect, attach, color and program them to do different interactions.  Such as making a door which opens and shuts when you touch or press on the handle.\n\nThe game is also entirely multiplayer, you can visit your friends creations as well as others and talk to them in voice-  personally I haven't seen anyone else yet, but I'm a bit of a loner and stay mostly to my castle I'm working on.\n\nI suggest giving the game a try, and see how you like it.", "timestamp_created": 1503685997, "timestamp_updated": 1503688219, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.507373", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34426690": {"recommendationid": "34426690", "author": {"steamid": "76561198277384080", "num_games_owned": 30, "num_reviews": 1, "playtime_forever": 1961, "playtime_last_two_weeks": 33, "last_played": 1515892242}, "language": "english", "review": "it good game.", "timestamp_created": 1503447447, "timestamp_updated": 1503447447, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34320364": {"recommendationid": "34320364", "author": {"steamid": "76561197990364033", "num_games_owned": 195, "num_reviews": 2, "playtime_forever": 1423, "playtime_last_two_weeks": 0, "last_played": 1511140695}, "language": "english", "review": "Honestly the coolest vr game I have ever played. This game has so much potential with what you can do or make! If you like building or creating new things this game will completely blow your mind. Do you want to make your own gun and even own bullets that come out if it? It's possible. Do you want to make a lizard that bites your hand when you touch it? It's possible. You can make almost anything, you just need to take the initial time to learn the basics. Even if you aren't amazing at building just seeing other players creations and interacting with each other is amazing. Everyone I have met is very helpful and nice in the community.", "timestamp_created": 1503028432, "timestamp_updated": 1503028432, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.574894", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34282612": {"recommendationid": "34282612", "author": {"steamid": "76561198159310724", "num_games_owned": 50, "num_reviews": 6, "playtime_forever": 38, "playtime_last_two_weeks": 0, "last_played": 1502952421}, "language": "english", "review": "I dont have a headset so I cant play it but it's still a good game 10/10", "timestamp_created": 1502911734, "timestamp_updated": 1502911734, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.357492", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33849565": {"recommendationid": "33849565", "author": {"steamid": "76561198009371606", "num_games_owned": 82, "num_reviews": 10, "playtime_forever": 192, "playtime_last_two_weeks": 0, "last_played": 1508586316}, "language": "english", "review": "Totally wonderful. Better building tools than Google blocks. Easy to build complex worlds, including interactive scripts and custom avatars.\n\nDesperately in need of more players though, since there's only a couple on at a time.\n", "timestamp_created": 1501224079, "timestamp_updated": 1501224079, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.507576", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33758380": {"recommendationid": "33758380", "author": {"steamid": "76561198065864756", "num_games_owned": 95, "num_reviews": 14, "playtime_forever": 94, "playtime_last_two_weeks": 0, "last_played": 1501282389}, "language": "english", "review": "Really awesome time building stuff in multiplayer.", "timestamp_created": 1500869168, "timestamp_updated": 1500869168, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.507576", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33705955": {"recommendationid": "33705955", "author": {"steamid": "76561198147308067", "num_games_owned": 174, "num_reviews": 5, "playtime_forever": 10258, "playtime_last_two_weeks": 261, "last_played": 1515892246}, "language": "english", "review": "amazing game great community once you get past learners curve its amazing if anyone is going to get this game I suggest watching some tutorials or meeting some people in the areas tab and asking them how to play I personally made a tutorial for this game https://www.youtube.com/watch?v=77ywUFdlS_w the game is amazing you can make guns that when you shoot someone it sends them to hell or if you shoot them it creates a kitten! love the game  keep up the great work dev(s)", "timestamp_created": 1500671631, "timestamp_updated": 1500671631, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.480000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33192971": {"recommendationid": "33192971", "author": {"steamid": "76561198045599903", "num_games_owned": 89, "num_reviews": 3, "playtime_forever": 19, "playtime_last_two_weeks": 0, "last_played": 1499106064}, "language": "english", "review": "Ok change, my mistake. Developer contacted me and I have a lifetime perk that I didn't realize I had since I purchased the software when it first came out. My thanks to the developer and I am editing my review to reflect my appreciation of the developers prompt contact", "timestamp_created": 1499102213, "timestamp_updated": 1499395032, "voted_up": true, "votes_up": 9, "votes_funny": 2, "weighted_vote_score": "0.584333", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32631563": {"recommendationid": "32631563", "author": {"steamid": "76561197979860841", "num_games_owned": 92, "num_reviews": 4, "playtime_forever": 472, "playtime_last_two_weeks": 0, "last_played": 1499706863}, "language": "english", "review": "Just re-discovered this. It's def worth it I think. I can't build a damn thing, but the people are cool, and Insanely talented. I can't believe more people aren't already playing! And it's Free right now 6/21/17 Soo why not check it out, right?", "timestamp_created": 1498094285, "timestamp_updated": 1498094285, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.566010", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32235229": {"recommendationid": "32235229", "author": {"steamid": "76561197971508785", "num_games_owned": 29, "num_reviews": 9, "playtime_forever": 20107, "playtime_last_two_weeks": 0, "last_played": 1514162486}, "language": "english", "review": "i like building games and this has VR support so i like it just need more people.", "timestamp_created": 1496825994, "timestamp_updated": 1496825994, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.612023", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32160515": {"recommendationid": "32160515", "author": {"steamid": "76561198091198311", "num_games_owned": 54, "num_reviews": 6, "playtime_forever": 3300, "playtime_last_two_weeks": 0, "last_played": 1515086771}, "language": "english", "review": "Please make putting on bodys easier, I currently am having trouble putting on a darn body.\n\nEdit: Head popped off for some reason when I was adjusting arm. Now I can't put the head on.\n\nA better idea of putting bodys on would be to put the dots in front of you as if there were a mannequin. You put the body parts there, and it will appear on you. Please make this possible, because putting parts on now are too much of a struggle.\n\nOther than that this is a fun game.", "timestamp_created": 1496520823, "timestamp_updated": 1496521755, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.499550", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32128921": {"recommendationid": "32128921", "author": {"steamid": "76561198334042123", "num_games_owned": 16, "num_reviews": 1, "playtime_forever": 12, "playtime_last_two_weeks": 0, "last_played": 1496409728}, "language": "russian", "review": "b3wnnnnnnnnz3nrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr      rrrrrrrrrrrrrrrrrrrrrrrrrrrrrr r r  rr r  r", "timestamp_created": 1496409661, "timestamp_updated": 1496409661, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.372494", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32069973": {"recommendationid": "32069973", "author": {"steamid": "76561198077226160", "num_games_owned": 305, "num_reviews": 62, "playtime_forever": 148, "playtime_last_two_weeks": 0, "last_played": 1509250587}, "language": "english", "review": "This game remind me of 'The Seed' in SAO.", "timestamp_created": 1496173249, "timestamp_updated": 1496173249, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.507100", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32046820": {"recommendationid": "32046820", "author": {"steamid": "76561198135438892", "num_games_owned": 2264, "num_reviews": 3289, "playtime_forever": 1136, "playtime_last_two_weeks": 0, "last_played": 1496185550}, "language": "romanian", "review": "Very nice game", "timestamp_created": 1496081351, "timestamp_updated": 1496081351, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.370562", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31981088": {"recommendationid": "31981088", "author": {"steamid": "76561198017751512", "num_games_owned": 134, "num_reviews": 31, "playtime_forever": 26721, "playtime_last_two_weeks": 607, "last_played": 1516395621}, "language": "english", "review": "The best creator tool of all time.", "timestamp_created": 1495828988, "timestamp_updated": 1511724105, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31944455": {"recommendationid": "31944455", "author": {"steamid": "76561198369133142", "num_games_owned": 10, "num_reviews": 1, "playtime_forever": 5874, "playtime_last_two_weeks": 0, "last_played": 1504839483}, "language": "english", "review": "Phill, you genius! This game. Is amazing! After getting used to the building tools, i could build anything! The game in it's self has a low player base. But that community is great! Knowing everyone is what keeps the game interesting!", "timestamp_created": 1495678726, "timestamp_updated": 1495678726, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501050", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31886822": {"recommendationid": "31886822", "author": {"steamid": "76561198058204754", "num_games_owned": 175, "num_reviews": 5, "playtime_forever": 56963, "playtime_last_two_weeks": 1943, "last_played": 1516239969}, "language": "english", "review": "I've just realized I haven't written a review after 600+ hours of playing! \n\nAnyland is an absolutley incredible game. It's got an active dev, frequent updates, and a very friendly community. If you just want to create something cool, like a replica of your favorite movie prop, or a sci-fi version of your house, Anyland is for you. Even if you don't have the creativity to build something amazing, it's still very fun to talk with other players. \n\nThere is a bit of steep learning curve, but with the help of one of the many great tutorial videos that you can find online, you can learn the game's very simple, but deep scripting system.\n\nIn short, if you want a game to where you can express your creativity, or if you just want to play a great social game, install Anyland.", "timestamp_created": 1495386302, "timestamp_updated": 1508343717, "voted_up": true, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.647996", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31827037": {"recommendationid": "31827037", "author": {"steamid": "76561198082864452", "num_games_owned": 142, "num_reviews": 14, "playtime_forever": 8806, "playtime_last_two_weeks": 0, "last_played": 1514661375}, "language": "english", "review": "Okay, time to leave a review!\n\nFirst off, dont be put off by the subscriptions for building, the devs are trying out ways to make the game work for everybody.  And make no mistake they are probably the most active VR devs around, with exciting updates coming thick and fast. In VR this is the place to be, to create or endlessly explore what others have built.\n\nThe community is great,  You can 3d print what you make in VR, which is awesome, and works really well (especialy if you want to build artculated robots!) and makes for great multimedia shinanigans.\n\n So come to anyland, it's party time! :)", "timestamp_created": 1495132990, "timestamp_updated": 1495132990, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31793096": {"recommendationid": "31793096", "author": {"steamid": "76561197968981494", "num_games_owned": 428, "num_reviews": 20, "playtime_forever": 1984, "playtime_last_two_weeks": 0, "last_played": 1511299718}, "language": "english", "review": "You can create matter from space and share it with friends. What's not to like.", "timestamp_created": 1494962667, "timestamp_updated": 1494962667, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31776245": {"recommendationid": "31776245", "author": {"steamid": "76561197972083796", "num_games_owned": 233, "num_reviews": 16, "playtime_forever": 402, "playtime_last_two_weeks": 0, "last_played": 1514598429}, "language": "english", "review": "Built for VR and ONLINE play ONLY...\n\n A fantastic title in which you can build and code almost anything with some trail and error, there are some annoying limitations at the moment and numerous bugs, but updates come on a regular basis and if given some love and a local download option to save your worlds and items this has real promise, Games like Garrys Mod and Little Big Planet are the only other aalternatives i can think of in this Genre im calling \"User Generation\" in which the game you play IS the game you create, want flying toasters? done, want a gun that shoots waffles, done.\n\n  This genre badly needs more titles such as this as Anyland is in a way a simplified Game engine such as Unreal or Unity in game form, so again with more updates, bug fixes, and a much needed desktop/controller mode for quick building on a laptop on the go, this will be one of my favorite games of all time.", "timestamp_created": 1494881069, "timestamp_updated": 1494881069, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31409357": {"recommendationid": "31409357", "author": {"steamid": "76561197968549330", "num_games_owned": 508, "num_reviews": 1, "playtime_forever": 553, "playtime_last_two_weeks": 0, "last_played": 1515137598}, "language": "english", "review": "Amazing!  What this developer has created pretty groundbreaking.  Its not so much a game but a huge toolset for you to create what you want in VR.  Takes about an hour to get used to controls.  More advanced stuff can be found in a bunch of youtube videos.  Well worth the purchase.", "timestamp_created": 1493358807, "timestamp_updated": 1493358807, "voted_up": true, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.525862", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31361281": {"recommendationid": "31361281", "author": {"steamid": "76561198094956644", "num_games_owned": 251, "num_reviews": 42, "playtime_forever": 280, "playtime_last_two_weeks": 0, "last_played": 1493505902}, "language": "english", "review": "You can make anything. Perfect for people who love to create, or explore other people's creations. And everyone seems friendly so far.\n\nDefinitely recommend this game especially for its price.", "timestamp_created": 1493141112, "timestamp_updated": 1493141112, "voted_up": true, "votes_up": 1, "votes_funny": 2, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31234910": {"recommendationid": "31234910", "author": {"steamid": "76561198264128255", "num_games_owned": 77, "num_reviews": 30, "playtime_forever": 992, "playtime_last_two_weeks": 0, "last_played": 1492020639}, "language": "english", "review": "Really interesting VR world building game!  aka \"sandbox\"\n\nThere is a bit of a learning curve to make complicated things, but the other users are friendly and will help you.", "timestamp_created": 1492599654, "timestamp_updated": 1492599654, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31207466": {"recommendationid": "31207466", "author": {"steamid": "76561198026852253", "num_games_owned": 125, "num_reviews": 15, "playtime_forever": 44570, "playtime_last_two_weeks": 2034, "last_played": 1516394452}, "language": "english", "review": "It's basically the Unity VR SDK, but with really smooth multiplayer and easier-to-use interface. \n\nYou can make stuff and code it in VR live with other people, including your own body. This game is next-level stuff.", "timestamp_created": 1492464217, "timestamp_updated": 1492464217, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.497838", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31201563": {"recommendationid": "31201563", "author": {"steamid": "76561198155202114", "num_games_owned": 32, "num_reviews": 6, "playtime_forever": 222, "playtime_last_two_weeks": 0, "last_played": 1495209298}, "language": "english", "review": "cool game buttt\n- not so many objects\n- not too many cool options\n- a LOT of bugs (i mean a LOT of bugs)\n- multiplayer sometimes doesnt work\n- because of the bugs you have to restart the game several times\n\nPro's\n- fun and stuff", "timestamp_created": 1492442994, "timestamp_updated": 1492442994, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.496689", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31192257": {"recommendationid": "31192257", "author": {"steamid": "76561197990973783", "num_games_owned": 286, "num_reviews": 5, "playtime_forever": 7354, "playtime_last_two_weeks": 0, "last_played": 1512928209}, "language": "english", "review": "Picked this game up on a whim, and I am blown away. If you own a VR headset, and enjoy having complete control of pretty much everything, then this is a no brainer.", "timestamp_created": 1492402592, "timestamp_updated": 1492402592, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31182455": {"recommendationid": "31182455", "author": {"steamid": "76561198360692439", "num_games_owned": 28, "num_reviews": 2, "playtime_forever": 10886, "playtime_last_two_weeks": 0, "last_played": 1514734969}, "language": "english", "review": "I love this game and cant stop playing it and everyone is really nice\n", "timestamp_created": 1492361812, "timestamp_updated": 1492361812, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.563492", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31141854": {"recommendationid": "31141854", "author": {"steamid": "76561198122722012", "num_games_owned": 60, "num_reviews": 2, "playtime_forever": 1548, "playtime_last_two_weeks": 0, "last_played": 1492286683}, "language": "english", "review": "I got the game because of a friend, I tried it and everything was confusing so i went online for help. It gave some of the basic out lines such as how to move between worlds and stuff, but it still didnt help any more than that. When i came back on i started building a house on my area, which took me forever because of the controls. In the middle of building it, my house got deleted randomly. Really its no fun.", "timestamp_created": 1492197875, "timestamp_updated": 1492197875, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.414365", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31089729": {"recommendationid": "31089729", "author": {"steamid": "76561198344708794", "num_games_owned": 42, "num_reviews": 14, "playtime_forever": 16470, "playtime_last_two_weeks": 1, "last_played": 1515429799}, "language": "english", "review": "This is an amazingly cool game.  Build your little part of the world any way you want to.  Explore what everyone else has built.  It's something you just have to experience to understand.  Granted, you do just get thrown in without any real tutorials and it can be frustrating, so do yourself a favor and watch some YouTube tutorials. It makes it SO much easier and fun.", "timestamp_created": 1491964137, "timestamp_updated": 1491964137, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31085641": {"recommendationid": "31085641", "author": {"steamid": "76561198241852756", "num_games_owned": 162, "num_reviews": 20, "playtime_forever": 65, "playtime_last_two_weeks": 0, "last_played": 1491957287}, "language": "english", "review": "This is an amazing app that gives you an insane amount of creation tools!  I can't wait to dive deeper into it, and start experimenting with the tools!", "timestamp_created": 1491943498, "timestamp_updated": 1491943498, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.474138", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31076302": {"recommendationid": "31076302", "author": {"steamid": "76561198006388245", "num_games_owned": 195, "num_reviews": 6, "playtime_forever": 1067, "playtime_last_two_weeks": 0, "last_played": 1493063829}, "language": "russian", "review": "Отличная игра-песочница со встроенным скриптовым языком. Здесь вы можете создать абсолютно все что позволяет ваша фантазия, а затем поделиться своим творением с другими ироками. Или же вы можете путишествовать по мирам других игроков в поиске прикольных ништяков.\n\n10 саблезубых зомби-зайцев из 10 :)\n", "timestamp_created": 1491909625, "timestamp_updated": 1491909625, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.507610", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31073657": {"recommendationid": "31073657", "author": {"steamid": "76561198089393740", "num_games_owned": 101, "num_reviews": 7, "playtime_forever": 2412, "playtime_last_two_weeks": 0, "last_played": 1514036261}, "language": "russian", "review": "Шикарная игра-движок!\n\nВы можете создать любой обьект, газ или источник света, включить гравитацию или наоборот, активировать невесомость для любого обьекта. Прототипирование/создание миров очень быстрое и удобное. Можно строить/моделировать совместно с вашими друзьями, при том к вам в мир могут приходить другие игроки и поделится советом или своими обьектами.\n\nТак-же всё что вы построили можно оживить! В игру встроен свой скриптовый язык(он не сложный), с помощью которого можно изменять свойства созданых вами обьектов, цвет/свет/движение/деформация/ускорение/звук/системы частиц и многое другое.\nОружие может стрелять чем угодно, звуком, световым лучом,частицами, любым физическим обьектом или телепортировать вас в точку попадания и т.д.\n\nВы можете создать собственый экран, от пары дюймов(и прикрепить его себе на руку), до 200\" панели и даже больше. И привязать его(экран) к YouTube! Вбить в поиске всё что вам интересно, и продолжать моделировать мир под любимую музыку или передачу, поглядывая на монитор.\n\nВ игре уже очень много созданого игроками контента. Всё это можно копировать к себе в инвентарь, и в дальнейшем разместить в своем мире, или разобрать и модифицировать. Или просто изучить как это было сделано!\n\nВ общем советую всем кто любит что-то создавать или просто бродить по мирам других людей, общатся с ними и взаимодействовать с окружением.", "timestamp_created": 1491894724, "timestamp_updated": 1491894724, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.604380", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30970722": {"recommendationid": "30970722", "author": {"steamid": "76561197960270993", "num_games_owned": 294, "num_reviews": 13, "playtime_forever": 448, "playtime_last_two_weeks": 0, "last_played": 1504078844}, "language": "english", "review": "Every VR owner should have this. If this is on sale, it's a no-brainer to get. It's still a little early in development and you have to figure things out a bit, but there is tons of functionality already. The worst part is that there are not many people playing, so buy the damn game and play it! Every time I've gone into someone's place and there are a few people, it's extremely surreal seeing all these 100% custom avatars talking and socializing in a 100% user created area that actually looks great. You really feel like you are in some bizarre alternate reality.", "timestamp_created": 1491438059, "timestamp_updated": 1491438059, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.618056", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30890173": {"recommendationid": "30890173", "author": {"steamid": "76561198073024788", "num_games_owned": 149, "num_reviews": 4, "playtime_forever": 2788, "playtime_last_two_weeks": 0, "last_played": 1514861275}, "language": "english", "review": "I have made so much that I've ran out of ideas!  But when I think of one it is fun and awesome to design and script.  My latest creation is a head and arm that can teleport you anywhere and can also put up a shield to block your head and body from people shooting at you.  I also made it so my right arm shoots popcorn!\n\nI really reccomend buying as this game has brought lots of fun with my friends and I.", "timestamp_created": 1491096277, "timestamp_updated": 1491096310, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502058", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30826883": {"recommendationid": "30826883", "author": {"steamid": "76561197982023906", "num_games_owned": 288, "num_reviews": 9, "playtime_forever": 1400, "playtime_last_two_weeks": 0, "last_played": 1513240059}, "language": "english", "review": "learning curve is there, but once you get the hang of things (still working on this) the game is great. Yes it could use more, but Its getting  there.  Nice relaxing game where you build whatever you can dream up. Talk to people , hang out relax, run around the sky is the limit here.", "timestamp_created": 1490851118, "timestamp_updated": 1490851118, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.525862", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30773447": {"recommendationid": "30773447", "author": {"steamid": "76561197995107123", "num_games_owned": 239, "num_reviews": 10, "playtime_forever": 4343, "playtime_last_two_weeks": 36, "last_played": 1516280469}, "language": "english", "review": "Brilliant. That's the best way to put this into words.\n\nI have been building and creating content in SecondLife and other programs for 12 years or so. \n This is sl in vr , without the land costs ,, limited space and the deadly need to make money on everything you do.  And everything made is made within the game so the playing field is leveled,, the endless amount of space is sitting there waiting.  \n\nMany base shapes \nlots of colors, textures ( and that's 2 texture layers and a color /material,. layer.\nThe easiest scripting language ever created. (seriously if you can read you can script)\nSpace , Free ,, as much as you need as much as you want ,, you don't get limited by having to Buy or rent space.  \nCommunity is mostly adult  and friendly , with the random teen tossed in to keep things interesting and to remind you this IS the internet.\n\nBy far the thing i  load up most on the vive.\n\nI had a small bit of trouble at first figuring out the tools but ,, im new to VR.\n Its   a wide open playground with really good people in it. \n\nCome in, make something. Anything.", "timestamp_created": 1490625878, "timestamp_updated": 1490626290, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.691549", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30674712": {"recommendationid": "30674712", "author": {"steamid": "76561197961664852", "num_games_owned": 217, "num_reviews": 2, "playtime_forever": 17502, "playtime_last_two_weeks": 0, "last_played": 1513722692}, "language": "english", "review": "Anyland is a game that combines the creativity of Second Life and Minecraft with the unique social and expressive setting of VR to create an experience that is really rather enjoyable, if a little unpolished. \n\nIf you're a graphical fidelity junkie, this game isn't for you. However, if you're the type to ignore graphics in lieu of a fun community, unique gameplay, and TONS of creative tools at your disposal, this game will provide you with nonstop entertainment for hours on end. The creativity of Anyland's community feels very reminiscent of Minecraft. \n\nIf any of what I've said sounds remotely fun, definitely pick up a copy of Anyland. Worth every penny.\n\nOverall Rating: 8.5/10", "timestamp_created": 1490213966, "timestamp_updated": 1490213966, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.526814", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30628316": {"recommendationid": "30628316", "author": {"steamid": "76561198020764073", "num_games_owned": 39, "num_reviews": 2, "playtime_forever": 1219, "playtime_last_two_weeks": 0, "last_played": 1503264493}, "language": "english", "review": "I like how much I'm allowed to customize about the world at the moment. It's like SculptrVR, except without the voxels, and you can make things move, and you can change the properties of the sky, and you can see how many people are actually in each room, and one can change more of their body appearance, and there are throwable objects, and with SCRIPTING!!!! That's one of the biggest hooks for me; the scripting part means there are so many possibilities for user-defined minigames, or maybe even an entire saga of user-defined maps, etc.\n\nBUT...I'd also say that the actual creating of things could be way easier, for sure. For people like me who find it pretty much unacceptable to have anything whatsoever uneven when it seems like it shouldn't be, aligning everything properly when I'm building something with all the right distances and angles (not just multiples of 90 degrees) is currently a nightmare.\n\nChanging avatars is also frustrating sometimes. I do NOT like the balls that one has to touch things to in order to apply those things. As with before, there is the issue of alignment and centering, but also, sometimes it doesn't work, in which case the thing I've tried to align perfectly for tens of seconds with the ball I want to attach it to disappears as I let go, forcing me to start all over again.\n\nI actually haven't been in multiplayer mode as of yet, so I won't comment on it.\n\nIn the future, I'll probably ask in Anyland's steam forum whether or not the option to (setting aside floating point precision error) perfectly position, scale, and tilt obejcts when creating a thing is something that could be implemented, because that would be wonderful.", "timestamp_created": 1489976838, "timestamp_updated": 1489976838, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30604677": {"recommendationid": "30604677", "author": {"steamid": "76561198064874585", "num_games_owned": 252, "num_reviews": 20, "playtime_forever": 132, "playtime_last_two_weeks": 0, "last_played": 1485205041}, "language": "english", "review": "Really cool world builder/item builder/social game.", "timestamp_created": 1489886692, "timestamp_updated": 1489886692, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30339011": {"recommendationid": "30339011", "author": {"steamid": "76561198047814884", "num_games_owned": 105, "num_reviews": 4, "playtime_forever": 37, "playtime_last_two_weeks": 0, "last_played": 1488679329}, "language": "english", "review": "No tutorial since they just sort of drop you in there. I had to look up tutorials myself. Then everything I tried to make would disappear once I knew what I was semi-doing. I spent a half hour of making an awesome object for nothing.", "timestamp_created": 1488726030, "timestamp_updated": 1488726030, "voted_up": false, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.383254", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29980696": {"recommendationid": "29980696", "author": {"steamid": "76561198060738270", "num_games_owned": 137, "num_reviews": 5, "playtime_forever": 19545, "playtime_last_two_weeks": 98, "last_played": 1515975294}, "language": "english", "review": "This game is great if you own an hmd pick this game up, great dev great people and great game play i am addicted in a healthy way i think", "timestamp_created": 1487325231, "timestamp_updated": 1487325231, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.564674", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "29976005": {"recommendationid": "29976005", "author": {"steamid": "76561197966649882", "num_games_owned": 1249, "num_reviews": 80, "playtime_forever": 2267, "playtime_last_two_weeks": 155, "last_played": 1515725952}, "language": "english", "review": "[h1]Anyland - [i]Build and animate whatever you want in vr and share it with friends![/i][/h1]\n\nIf you are old like me (38years young) i'm sure you have played with lego, if you are a little younger then you may of also played with many of the spin offs that allowed you to add motors to your creations (or played minecraft, the awesome lego of today), the youth have no idea how good the toys are they have access to these days lol,\nAnyland is like lego in vr (without the pointy bits that you find with your feet in the middle of the night) you can make almost anything your mind can think off…. If you stick with it! What is more you can animate the items with scripts. The thing that will keep you coming back to the game is the community though, they never cease to amaze me, but more about them further down. \nSo how complex can you get? Well here is a couple of examples, a player showed me a button on his wrist, when pressed glowing wings unfolded from his body, a body he fully made in anyland! Yesterday when playing around with my space (of which you can have a seemingly unlimited supply of should you wish it) some players popped in and showed me a lot of devices, from a gun that fires small needless that actually have an injection animation when they hit you and can then teleport you, to a gun that fired giant cheese puffs that start small and then slowly engulf you.\nYou can also put anything you see into your inventory, don't worry about your kleptomaniac impulses upsetting people, it makes a copy, the original item remains :) and you have 100 pages to utilise so you will not run out of space anytime soon, These items can then be placed in your own areas (and when you look at the description you can see how many times it is placed and its author, a great way to see how popular your item is) \nAnother very important thing to note, the developer clearly cares deeply for the game and his community, many updates and bug fixes, this is no money grabbing shovelware game.\n\n[b]ROOMSCALE / ENVIRONMENT[/b] \nThe roomscale is pretty perfect for this, once you get the hang of the commands you will be teleporting about and creating items left right and center, at no point did i feel restricted by the roomscale mechanics and you are even able to rotate your self via buttons should you need to, i have also played via the lazy method…. Sitting on my sofa. Now the environments, ok heres where this one is a little hard to review, The environments are all made by the players, so my area since im a noob is very bland, blocked shapes, but then you get some areas that are just breathtaking, some people have spent some serious time and effort to make some truly wonderful areas. It is a game that is almost as much fun to simply explore as it is to create!\n\n[b]GRAPHICS[/b] \nMost things are basic shapes, but with these basic shapes you can build anything, you can also colour them, turn them to metal, to a video screen for youtube, to fluid, to glass. There are both area lights with real time lighting to spotlights that have full lighting and shadows, so again graphics are tricky to nail down….this is no witcher 3 but it is also better then minecraft if you put the time in to make your area awesome…. Overall i would say that it is a great graphic style for this game.\n\n[b]PERFORMANCE[/b] \nNow mostly the game runs great, i have visited areas with thousands of objects and been unaffected, i have also had my fair share of crashes, a testament to the game though is that when i have crashed i have simply loaded up the game straight away. I have seen objects that will bug out players, and currently a door i made has glitched and has a nasty habit of following players around, i have had some fellow players threaten to make a “Dave’s Door” meme...gulp… but it is early access, a phrase that does make us groan i know and often used to cover a multitude of sins but here it is true, the developer can be seen to clearly be fixing bugs and adding content, in fact since i bought the game i do not think i have seen a single day without a patch (Philip the dev seems to be a one man machine and i truly wonder if he actually sleeps and eats or just codes non stop, there is a reason my fellow players love him so much that there is even a “Church of Philip” (an institution i think i may be banned from for excessive punning)\nSo in short not the smoothest vr game i have ever played but by no means too buggy (and when it is running ok...which is the majority of time… it is perfectly fine)\n\n[b]INTUITIVENESS[/b] \nOk here for me is where it fails, my first experiences with the game had me so frustrated i rage quited (an absolute rarity for me) and almost refunded the game, however there is an amazing community in this game and they helped me on the forums and then helped me in game, within a few hours of getting help i was creating animated doors (not the Dave stalker door) with multiple sections and even made myself a head that has an animate mouth which opens and closes as i talk. And just yesterday i made a slot in my body open up like a tray and have a torch dropped into it that other players can use. \nSo let us say it is not intuitive to begin with and has a learning curve that can be got over fast with the help of its community.\n\n[b]MULTIPLAYER:[/b] \nOh man, this is where the game shines, the community in this game, as i have said multiple times now, are awesome. Never have i felt so welcomed in a game then in this one, from people stopping by and complementing my animations on my door and showing me little tips and tricks to impromptu parties…. Yesterday i was working in my secret lab (that is open to the public) when a couple of players popped in, with in minutes we were laughing and seeing the cool things they found and made...a few minutes later more people turned up , we were all talking, laughing and before i knew it time had slipped away and it was 7am and i decided i needed to sleep,(i got woken up at 10am by a neighbour who demanded i keep it down in future….seems i was having so much fun laughing and chatting that i woke him up … oops, but it shows what i mean by how fun this community is.\n \n[b]PROS:[/b] \n[list]\n[*] Awesome community.\n[*] Very active dev.\n[*] Your avatar is made by you (or for you) and as such can be unique.\n[*] Your imagination really is the limit of what you can build.\n[*] A super simple yet really powerful scripting and animation system.\n[*] The community that is so good it really has to be said twice.\n[*] Exploring other peoples worlds is amazing, the details some put into them,  and the stuff they make is just awe inspiring. \n[/list]\n\n[b]CONS:[/b] \n[list]\n[*] Steep learning curve to start off with if you do not talk to others.\n[*] Some bugs can be a bit annoying.\n[*] Putting on your body (specially the torso) is very tricky to get right.\n[*] No undo button (though you can undo a deletion)\n[/list]\n\n[b]VERDICT[/b] \nIf you are not a complete solo only gamer and enjoyed lego this is a must have.\nIf you love minecraft for the creative side, then you need this game.\nYou will totally get your money's worth from this.\nAlso did i mention, the community is very good?\nYep it has my seal of approval (no actual seals were harmed in the making of this approval)", "timestamp_created": 1487302266, "timestamp_updated": 1487302478, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.584235", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29854794": {"recommendationid": "29854794", "author": {"steamid": "76561198022527992", "num_games_owned": 684, "num_reviews": 37, "playtime_forever": 15837, "playtime_last_two_weeks": 0, "last_played": 1511506449}, "language": "english", "review": "Anyland is Amazing. \n\nThe only word to describe it you can be anyone or anything you choose and create anything you want in this world and the small but dedicated regular players will cast no judgment infact we'll welcome you open armed into our little community \n\nAnyland is a world I drop in on almost everyday I meet my friends in there rooms I chat help them come up with ideas and have lots of fun together. \n\nWhether that be taking a torch and pitchfork and surprising one or own in there world or just hanging out together chatting. \n\nAnyland is wonderful. \n\nI simply cannot recommend it highly enough.", "timestamp_created": 1486839371, "timestamp_updated": 1486839371, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.494759", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29788079": {"recommendationid": "29788079", "author": {"steamid": "76561198028954718", "num_games_owned": 126, "num_reviews": 2, "playtime_forever": 35, "playtime_last_two_weeks": 0, "last_played": 1486581560}, "language": "english", "review": "\n I am impressed! I only had a little bit of time today to try out Anyland and it is amazing. You can create any little world you want to be in. Dark and spooky. Bright and happy.... It is amazing! \n\n I can't wait to see everyones creations.", "timestamp_created": 1486582841, "timestamp_updated": 1486582841, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.492570", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29659215": {"recommendationid": "29659215", "author": {"steamid": "76561198000756286", "num_games_owned": 249, "num_reviews": 48, "playtime_forever": 971, "playtime_last_two_weeks": 0, "last_played": 1509078713}, "language": "english", "review": "one of the greatest games/experiences i have had in VR.  MY only complaint about the game would be that i wish the community was bigger.  But if you are on the fence about this game go to youtube and watch some of the crazy stuff people are doing in this game.  I'm, sure you will be sold on it afterwards.", "timestamp_created": 1486079715, "timestamp_updated": 1486079715, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.492570", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29570793": {"recommendationid": "29570793", "author": {"steamid": "76561198052031616", "num_games_owned": 99, "num_reviews": 11, "playtime_forever": 158, "playtime_last_two_weeks": 0, "last_played": 1485635801}, "language": "english", "review": "ok, so its good, and its been made accessible to a wide cross section of gamers with its simple interface, but id like to see some more advanced tools - but thats just me.", "timestamp_created": 1485715689, "timestamp_updated": 1485715689, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29557331": {"recommendationid": "29557331", "author": {"steamid": "76561197975053184", "num_games_owned": 296, "num_reviews": 2, "playtime_forever": 30256, "playtime_last_two_weeks": 777, "last_played": 1516321451}, "language": "english", "review": "Really enjoy this one just look at my in game time.", "timestamp_created": 1485669720, "timestamp_updated": 1485669720, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.513800", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29553854": {"recommendationid": "29553854", "author": {"steamid": "76561197973955991", "num_games_owned": 51, "num_reviews": 7, "playtime_forever": 72, "playtime_last_two_weeks": 0, "last_played": 1484964826}, "language": "english", "review": "Interface is  clunky and irritating. Just wait until you accidentally wipe out something you have really been struggling to do and can't undo your erasure.", "timestamp_created": 1485652208, "timestamp_updated": 1485652208, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.453889", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29400022": {"recommendationid": "29400022", "author": {"steamid": "76561197978764516", "num_games_owned": 524, "num_reviews": 6, "playtime_forever": 3188, "playtime_last_two_weeks": 0, "last_played": 1511824600}, "language": "english", "review": "One of my most favorite experiences on the Vive!", "timestamp_created": 1485011950, "timestamp_updated": 1485011950, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29391295": {"recommendationid": "29391295", "author": {"steamid": "76561198084453570", "num_games_owned": 239, "num_reviews": 5, "playtime_forever": 9475, "playtime_last_two_weeks": 0, "last_played": 1491759115}, "language": "schinese", "review": "第一次评论，给10分，游戏内容太多了，可以输入英文得到任何东西，培养创造力的绝佳游戏。", "timestamp_created": 1484980900, "timestamp_updated": 1484980900, "voted_up": true, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.557047", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29387879": {"recommendationid": "29387879", "author": {"steamid": "76561198166118947", "num_games_owned": 58, "num_reviews": 3, "playtime_forever": 90, "playtime_last_two_weeks": 0, "last_played": 1484881637}, "language": "english", "review": "I received this game for free from the developer giving away keys on Reddit.\nI had it sitting in my wishlist, and was pretty psyched that I got  a free key.\nAnyways...\n\nThis is the craziest VR experience I have had so far. You make anything you want in this \"game\" and then give it actions or motions, pretty much whatever you want to do or create, you can. It's freaking insane.\nThere is a bit of a learning curve, but there are in game tutorials as well as videos on YouTube explaining how to craft and script items.\nDo yourself a favor and go to YouTube and watch some videos!\nIf you have any interest in VR/Modeling/Animation/Scripting/Creating/etc, then do yourself a favor and pick up this game/experience.\nIt is undoubtedly worth the money for what you get in return and it is infinitely playable.", "timestamp_created": 1484963828, "timestamp_updated": 1484963828, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "2", "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "29370214": {"recommendationid": "29370214", "author": {"steamid": "76561197960357716", "num_games_owned": 2054, "num_reviews": 8, "playtime_forever": 45144, "playtime_last_two_weeks": 2040, "last_played": 1516328365}, "language": "english", "review": "Do you own a VR headset? Do you like to create stuff? Do you like to occasionally socialize with other friendly and creative people? If you do, then you owe it to yourself to spend 10 minutes checking out some of the completely player-created worlds and objects within this game. I have more than a few games in my account, but almost none of them have made me want to go back over and over like this one. Quickly taking over for highest hour count of any game I own. Build anything you can imagine. \n\nIt's not perfect. Tools could be a little better, could have more scripts, and certain things currently prevent some game mode types. That being said, it feels like what you can do is much larger than what you can't.", "timestamp_created": 1484893654, "timestamp_updated": 1484893654, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.580979", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29366016": {"recommendationid": "29366016", "author": {"steamid": "76561198009928642", "num_games_owned": 338, "num_reviews": 16, "playtime_forever": 145, "playtime_last_two_weeks": 0, "last_played": 1485025194}, "language": "english", "review": "Received the product from the Reddit giveaway, and I've only played for a little bit. That said, the potential in this game seems amazing. It reminds me of coding areas in MUD days, but instead in 3D environments.", "timestamp_created": 1484871679, "timestamp_updated": 1484871679, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "29310963": {"recommendationid": "29310963", "author": {"steamid": "76561198089951186", "num_games_owned": 236, "num_reviews": 31, "playtime_forever": 1091, "playtime_last_two_weeks": 0, "last_played": 1502865883}, "language": "english", "review": ">enter anyland\n>be confused\n>go to tutorial\n>learn shit\n>go to anyland again\n>make a terrifying creature\n>go to other peoples places\n>steal their shit\n>\"create your own world with your own creations\"\n>be a god", "timestamp_created": 1484632867, "timestamp_updated": 1499719940, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29282319": {"recommendationid": "29282319", "author": {"steamid": "76561197961688606", "num_games_owned": 41, "num_reviews": 5, "playtime_forever": 1056, "playtime_last_two_weeks": 0, "last_played": 1488964096}, "language": "english", "review": "Endless possibilities and a community to be proud of", "timestamp_created": 1484511190, "timestamp_updated": 1484511190, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.520392", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29193823": {"recommendationid": "29193823", "author": {"steamid": "76561198048238212", "num_games_owned": 315, "num_reviews": 28, "playtime_forever": 44, "playtime_last_two_weeks": 0, "last_played": 1484176430}, "language": "english", "review": "Its an good game but  the controls for building could be better and its not really your style if you can program and make games with unity or unreal engine.", "timestamp_created": 1484180159, "timestamp_updated": 1484180159, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.399692", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29150866": {"recommendationid": "29150866", "author": {"steamid": "76561198187005835", "num_games_owned": 35, "num_reviews": 2, "playtime_forever": 67530, "playtime_last_two_weeks": 0, "last_played": 1514923879}, "language": "english", "review": "This is definitely my favorite vr game. I would definitely recommend this to anyone who has a creative side. I'm currently creating a rpg style world with NPCs quests bosses weapons, hidden treasure all can be created in game using your own hands, making it much more enjoyable. The Developers are constantly listening to feedback and can often be seen in game. There is alot to learn and it takes time but it feels rewarding when you put the time in 10☆", "timestamp_created": 1484001205, "timestamp_updated": 1484001205, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.549699", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29125054": {"recommendationid": "29125054", "author": {"steamid": "76561198058199572", "num_games_owned": 82, "num_reviews": 14, "playtime_forever": 95, "playtime_last_two_weeks": 0, "last_played": 1483826368}, "language": "spanish", "review": "Un juego tipo sandbox en el que prácticamente todo es editable. Tiene muchas posibilidades de engancharte, si es que tienes la capacidad creativa necesaria , y la paciencia, para aprender sus entresijos. Por contra, los resultados son bastante poco pulidos, te sentirás como un niño trabajando con plastilina.\n\nEl juego basa su potencial en el modo multijugador, y si ya resulta complicado coincidir con alguien del mundo, más complicado es coincidir con españoles, o hispanohablantes.\n\nSi quieres hacer eso, te recomiendo unirte antes al servidor de Discord de \"Españoles en Realidad Virtual\" \n\nhttps://discord.gg/HQDpDek", "timestamp_created": 1483904682, "timestamp_updated": 1483904682, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29122973": {"recommendationid": "29122973", "author": {"steamid": "76561198011639584", "num_games_owned": 703, "num_reviews": 13, "playtime_forever": 2273, "playtime_last_two_weeks": 0, "last_played": 1514555341}, "language": "english", "review": "After this game get so much positive feedback over on Reddit I decided to give it a shot and I'm so glad that I did.\nAnyland allows to create your own worlds and fill them with whatever you want. Don't let the screenshots put you off the game, people can go into ridiculous amounts of detail. \nThe deveoloper is active and will listen to people's suggestions to make the game more enjoyable. \nThe only thing that the game is lacking in is players unfortuanately, but that can easily change - all you have to do is click that purchase button.", "timestamp_created": 1483900006, "timestamp_updated": 1483900006, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.503817", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29105457": {"recommendationid": "29105457", "author": {"steamid": "76561198346761898", "num_games_owned": 26, "num_reviews": 5, "playtime_forever": 462, "playtime_last_two_weeks": 0, "last_played": 1483251936}, "language": "english", "review": "Pretty great game. One suggestion would be a better tutorial built into the game, but other than that the game is awesome.", "timestamp_created": 1483844498, "timestamp_updated": 1483844498, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.504773", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29044974": {"recommendationid": "29044974", "author": {"steamid": "76561198093343376", "num_games_owned": 81, "num_reviews": 19, "playtime_forever": 5281, "playtime_last_two_weeks": 0, "last_played": 1513924200}, "language": "english", "review": "Amazing game, but has the WORST building system possible and crashes frequently, causing you to loose all your unsaved work. Consider this an early access game, that is fun when it works but still needs major improvement.", "timestamp_created": 1483651512, "timestamp_updated": 1483651512, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.499643", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29042886": {"recommendationid": "29042886", "author": {"steamid": "76561198083694969", "num_games_owned": 219, "num_reviews": 5, "playtime_forever": 518, "playtime_last_two_weeks": 0, "last_played": 1515001667}, "language": "english", "review": "Good for bulding but hopefully more poeple start playing soon.", "timestamp_created": 1483645819, "timestamp_updated": 1483645819, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29007641": {"recommendationid": "29007641", "author": {"steamid": "76561198023585660", "num_games_owned": 356, "num_reviews": 4, "playtime_forever": 3729, "playtime_last_two_weeks": 0, "last_played": 1514302925}, "language": "english", "review": "Honestly one of the best VR expierences I've had to date!\nSo much in here is possible and it's not difficult to get started, it has a very simple art style that is honestly versitile enough for beautiful, cute or detailed creations, I personally don't think the trailer does this much justice but detailed creations can really look nice!\n\nThe scripting is so simple! Yet powerful, it can recognice simple and also surprising interactions (You can set functions to an object even for when users LOOK at an object or for when you literally just touch it.) Also, you can use scripting on your own avatar! and add animations (More than just lip sync) for when you talk, or you can add buttons to yourself. (I've seen a chicken flying a UFO that could fire sunny-side up eggs at you with a button on their wrist.)\n\nOne of the only things that I find very limiting is the lack of grouped objects.. Currently it can be difficult/time consuming to animate many objects on a single creation.. (My avi has ears made of many parts, I'd LOVE to animate them, and I could but I'd be required to move all parts precisely.. And I just get lazy.. x3)\n\nYou also have an inventory where you can copy/save many creations you find entertaining or useful, and it's also very simple and easy to use (Tablet on your back that holds tiny versions of the objects you've saved.)\n\nAnd currently there's a decent amount of creations to explore! I've seen a nightclub with a working DJ table,\nLarge forrests,  mazes, a working RPG with written dialog, a recreation of someone's living room in a tree house!\nAnd much (Admittedly not TOO much.) more that I've personally seen, but I need to explore more... \n\nAll in all, I HIGHLY recommend this game, I will admit that the user base isn't high.. And that's one of the reasons I'm writing this review, but even when not hanging out with anyone you can be busy on creations! And also there's usually atleast a few users to say \"Hello\" to.\n\nI want this game to rise to add more worth to existing creations and for many new ones to come!\nI overall highly recommend this game and hope to see new users soon.\n\n", "timestamp_created": 1483540016, "timestamp_updated": 1483540016, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.621771", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28989325": {"recommendationid": "28989325", "author": {"steamid": "76561198008935116", "num_games_owned": 201, "num_reviews": 21, "playtime_forever": 1813, "playtime_last_two_weeks": 0, "last_played": 1485554325}, "language": "english", "review": "Just got Anyland a few days ago and love it. As someone else said it's like the earliest days of Second Life, back when it was about creativity and community rather than shopping. VR adds a whole new dimension and immersion. It's definitely for creative people and those who don't need hand-holding. You'll have to fumble around and search youtube video tutorials to figure out how to do many things, but it's worth it. Hopefully the community will grow over time.", "timestamp_created": 1483481582, "timestamp_updated": 1483481582, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28932975": {"recommendationid": "28932975", "author": {"steamid": "76561197991325897", "num_games_owned": 131, "num_reviews": 20, "playtime_forever": 174, "playtime_last_two_weeks": 0, "last_played": 1484735781}, "language": "english", "review": "This is a really neat experience.  Basically infinite customization for making worlds.  Found so many creative places, a laser tag arena, movie theater, etc.", "timestamp_created": 1483347099, "timestamp_updated": 1483347099, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28784915": {"recommendationid": "28784915", "author": {"steamid": "76561198161810434", "num_games_owned": 96, "num_reviews": 2, "playtime_forever": 1648, "playtime_last_two_weeks": 0, "last_played": 1499798888}, "language": "english", "review": "Been playing this game for a few days now and it's very easy to get carried away with the creative aspect.\n\nYour imagination litrally is the limit with this game and your free to create anything you can with the basic shapes provided.\n\nDefinitely worth the price paid, even more so when the game is on sale!\n\nYou won't regret buying this game if you like creative sandbox games.", "timestamp_created": 1483006432, "timestamp_updated": 1483006432, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.527837", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28536222": {"recommendationid": "28536222", "author": {"steamid": "76561198015605185", "num_games_owned": 324, "num_reviews": 13, "playtime_forever": 524, "playtime_last_two_weeks": 0, "last_played": 1506189051}, "language": "english", "review": "The game is great, you can create about anything you can think of.", "timestamp_created": 1482438389, "timestamp_updated": 1482438389, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28439382": {"recommendationid": "28439382", "author": {"steamid": "76561198217709980", "num_games_owned": 37, "num_reviews": 2, "playtime_forever": 24841, "playtime_last_two_weeks": 0, "last_played": 1513335953}, "language": "english", "review": "This is the BEST value in VR! A must have for any VR user, Vive or Rift. Anyland has a friendly, helpful community and many different user created social environments with fun games to play.\n\n The creation tool set is vast, Anyone with a creative streak could spend hundreds of hours just creating. Add that to the ever-present hang out and party ambiance and you have everything you need from a VR program!", "timestamp_created": 1482033677, "timestamp_updated": 1482033677, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.641526", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28411589": {"recommendationid": "28411589", "author": {"steamid": "76561198020440057", "num_games_owned": 384, "num_reviews": 57, "playtime_forever": 54, "playtime_last_two_weeks": 0, "last_played": 1480960598}, "language": "english", "review": "The controls are weird and unintuitive to me. I had a lot of trouble actually finding people to play with (maybe I was just on at the wrong time). I like the premise of it, but it just didn't feel right to me. For now it's a no go.", "timestamp_created": 1481919730, "timestamp_updated": 1481919730, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.467440", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28399482": {"recommendationid": "28399482", "author": {"steamid": "76561197992734826", "num_games_owned": 195, "num_reviews": 14, "playtime_forever": 1144, "playtime_last_two_weeks": 0, "last_played": 1487129298}, "language": "english", "review": "This game reminds me of the early days of second life, only in VR. SOOOO much potential, Only thing is instead of getting stuck on a mainland everyone gets there own private space. I saw someone do a rave room. By far blows away and club in SecondLife and its just a single square room.\nThe interactivity of this is nice.", "timestamp_created": 1481866390, "timestamp_updated": 1481866605, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.705174", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28313046": {"recommendationid": "28313046", "author": {"steamid": "76561197993914105", "num_games_owned": 152, "num_reviews": 1, "playtime_forever": 2182, "playtime_last_two_weeks": 0, "last_played": 1506120445}, "language": "english", "review": "This is the single greatest gaming experience I've ever had in or out of VR. If you own a VR headset you need this game. I was a huge fan of Manyland, the 2D browser game by the same developers. This game has really blown the 'build anything' idea from Manyland out of the water entirely. Yes, you can build any shape, and using the built in scripting engine you can easily make functional items with incredible possibilities but even more impressive are the community members who will help you build your creations and explain the best ways to go about it. You can even build a TV, throw any youtube video on it you want and watch videos with friends and visitors while you build. This is fully collaborative sandbox building, sharing items with friends and getting incredible creations from places you explore and people you meet. The only criticism I have is the game is very buggy and nowhere near complete but bugs are getting reported and fixed and if anything it's incredible that I can talk directly to the developer when he hangs out in game and make suggestions or tell him what I'd like to see next. Oh I forgot to mention, you can export objects you create to OBJ format and 3D-print them or just view them in any CAD software. Imagine when I show people VR, allow them to design any shape they want in this game and then print it out for them to take home. GGWP.", "timestamp_created": 1481474821, "timestamp_updated": 1481475098, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28290636": {"recommendationid": "28290636", "author": {"steamid": "76561197984784594", "num_games_owned": 199, "num_reviews": 2, "playtime_forever": 1304, "playtime_last_two_weeks": 0, "last_played": 1483299287}, "language": "english", "review": "This is an immersive, compelling game that offers hours, days, and possibly weeks/months/years of engaging experiential design play. It's an art-studio, a design lab, and a hang-out spot for awesome people. Once you get over the steep (but well-supported via video tutorials) learning-curve, you create items and environments and make friends in an incredibly cordial and supportive but laid-back community. Play privately or show off your area to other players. I prefer to play with my areas in public mode, and enjoy visiting with stoppers-by who offer help, show off their places, and chit-chat in the most friendly way. The design experience is enthralling, but the community makes it irresistable.\n\nI lose myself in this game for hours, shaping trees, flowers, cottages and lights. I'm building a life-sized permaculture demonstration garden. However, YOU can make whatever you want. What. Ever. You. Want. The creations I've seen range from the adorable, to the sublime, to the whimsical, to the absurd, to the comical.  I cannot emphasize enough how much I enjoy this game. If you want to spend as many hours in virtual reality as you would in, say, Minecraft or Second Life, then this is the game for you. \n\nNote: it takes a few hours of noodling around with the tutorials to achieve competence. I got as frustrated and angry as a spitting cat while I was learning. The result of competency, though, is a fluid, precise method of interaction that works really well. \n\n", "timestamp_created": 1481383052, "timestamp_updated": 1481383052, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.552844", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "28274469": {"recommendationid": "28274469", "author": {"steamid": "76561198109847392", "num_games_owned": 181, "num_reviews": 6, "playtime_forever": 2298, "playtime_last_two_weeks": 4, "last_played": 1515952867}, "language": "english", "review": "Very good game! I had much fun playing, not only because of the game itself. The community is great, every new comer is welcome and gets introduced to the game.", "timestamp_created": 1481307579, "timestamp_updated": 1481307579, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28239675": {"recommendationid": "28239675", "author": {"steamid": "76561198014586837", "num_games_owned": 287, "num_reviews": 11, "playtime_forever": 899, "playtime_last_two_weeks": 0, "last_played": 1506979855}, "language": "english", "review": "Ton of fun. Get to create anything and everything. Well worth the price.", "timestamp_created": 1481133244, "timestamp_updated": 1481133244, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28190747": {"recommendationid": "28190747", "author": {"steamid": "76561198095725336", "num_games_owned": 50, "num_reviews": 8, "playtime_forever": 602, "playtime_last_two_weeks": 0, "last_played": 1513989378}, "language": "english", "review": "supah fun", "timestamp_created": 1480878612, "timestamp_updated": 1480878612, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28113471": {"recommendationid": "28113471", "author": {"steamid": "76561198014422780", "num_games_owned": 140, "num_reviews": 6, "playtime_forever": 20784, "playtime_last_two_weeks": 0, "last_played": 1498785412}, "language": "english", "review": "I have been sleeping in Virtual Reality for the past 4 days...\nSeriously.\nI do other things, of course- but when all is done- I find my time re-creating my room from reality- importing it bit by bit into the alternate world created by my own digital hands.\nThis is amazing- this program \"Anyland\" coupled with room-scale virtual reality- allows for a user to create forms with function- to easily animate them or treat them like solid objects for other people to walk on.\nAt this moment I have my entire living area mapped out and brought into VR. I just finished my desk in the back, changed the walls into a nice metal/glass combo, made monitors and my computer, created a nice table with measurements built in- equal to reality.\nHow I map my room into VR:\nI stand there in the digital void, and feel an object in front of me with my physical hands- I then create a digital object to serve as a glowing pin suspended in the air and pin this to each corner of the physical object- in VR. Once I have the measurements, I quickly create a large rough polygon with my digital hands, resizing quickly to fill out the shape. I set the color and then decide if I want any additional functionality.\nFor most furniture items I set no further options, as I do not want other users entering my universe to start flipping the desk for fun.\nFor most other items, I set options to make the object \"holdable\". This will create a copy of the object in the user's hand 6 they attempt to \"grab\" the digital item.\nI can easily add an animation to an object-but think of this- when you animate an item in Virtual Reality, and are standing there amongst objects of your creation, the animated object feels very \"real\".\nThe process of animation is very easy-\nExample of animating the blink of an eyelid:\nSelect eyelid object\nOnce selected, a screen will appear, showing \"1\",\"2\"\nThese are the key frames in the action list\nBy default they are empty, but you can click on \"2\", move the item, click back on \"1\" and see the item jump back and forth/ only doing so when you click the buttons marked \"1\", and \"2\"\nBut if we wanted to make the thing animate on its own, we click on \"1\" and select the commands that pop up in this order:\nWhen starts then become next in 1s\nIt's easy.\nYou then click on 2, and under the command list, the bottom option will be the last used command- like a shortcut for your history.\nWhen starts then become next in 1s\nNext for the last position cycles back- so this animation will cycle between frame 1 and frame 2, every 1s- forever.\nNow imagine that instead of it just cycling, it waited for a command-\nAnyland allows for many triggers:\nWhen:\nTouched\nConsumed\nHeld\nThrown\nNearby\nTouched by\nEtc\nSo, if we wanted a shining red crystal floating in the air in front of us to activate a door that opens vertically upon a touch- the process is very easy and very awesome\nBest way to describe this is- \nReady player one\nOr your dreams come true.\nYou could sit there and recreate the entire movie of Jurassic park to become an interactive virtual reality experience if you just took the time. You could create full sized animated raptors, full sized animated t-Rex stepping on a full sized jeep, next to a full sized moat-cliff, near full sized giant trees, near full sized giant brachiosaurus that were animated eating leaves.\nUnderstand that this is not like a \"video game\"\nThis is virtual reality..\nAnd I really have been sleeping in VR.\nI pull up a nice documentary on my virtual television and slip on my virtual sleeping bag- animated to expand and contract with each breath.\nFunny thing is people still show up in my virtual room even when I'm sleeping. They stand over me and watch me. Some even put something relaxing on the television for me.\n\nhttps://youtu.be/DeSJBN2nqaY\n\n\nLink to playlist of 3 videos by Gooboberti on Anyland:\nhttps://youtu.be/ssODNmA-wUY?list=PL1ejlqbXsHawWiHXgkbQ_XpuQz6aQb2Ay\n\n\n\n", "timestamp_created": 1480571762, "timestamp_updated": 1480571762, "voted_up": true, "votes_up": 27, "votes_funny": 3, "weighted_vote_score": "0.732603", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28032524": {"recommendationid": "28032524", "author": {"steamid": "76561198014862557", "num_games_owned": 219, "num_reviews": 56, "playtime_forever": 730, "playtime_last_two_weeks": 0, "last_played": 1508950221}, "language": "english", "review": "Silly game, needs more players", "timestamp_created": 1480407451, "timestamp_updated": 1480407451, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.503817", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27970191": {"recommendationid": "27970191", "author": {"steamid": "76561197989952569", "num_games_owned": 414, "num_reviews": 16, "playtime_forever": 9739, "playtime_last_two_weeks": 0, "last_played": 1496017920}, "language": "english", "review": "This game is great! After watching the youtube tutorials I was able to make some amazing things right away. The only limit to what you can do in this game is your imagination.", "timestamp_created": 1480352776, "timestamp_updated": 1480352776, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.532193", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27941211": {"recommendationid": "27941211", "author": {"steamid": "76561198123989430", "num_games_owned": 136, "num_reviews": 8, "playtime_forever": 37792, "playtime_last_two_weeks": 560, "last_played": 1516296686}, "language": "schinese", "review": "40多个小时的体验，终于决定来写一下评测。\n\n首先，游戏需要一点英语基础，常用命令很快都能掌握。游戏本身英语玩家居多，虽然不能经常遇见，但对于练习英语口语和听力也算是个好去处。\n\n游戏内容类似于高级的积木，若干基本形状随意组合，几百种色差的色板和几种不同材质，加上灵活多变的动画指令，你可以做出各种神奇的玩具，比如传送枪，火箭筒，弩箭，激光剑，会飞的鸟，会跑的怪兽，突然冒出地面的幽灵，自动上升的孔明灯（这个是我做的非常简单）。\n\n如果你不擅长编制动画，你还可以造山，造海，造宫殿，只需要建造一个小模型，就可以等比放大到各种尺寸。\n\n再如果你没有艺术细胞啥也不会造，那就去别人家拿吧，游戏里所有的东西都可以添加到自己的背包里，然后回自己的世界再拿出来，部分作品作者们会开启克隆功能，你可以在原作基础上进行你想的一切修改，也可以观察学习原作者是如何作用动画指令做出那些神奇宝贝的。\n\n游戏里没有固定的人物形象，你的头，肢体都可以自己随意打造。我遇见很多兽人，机器人，圣诞老人，DOTA里的幽鬼，高达，抽象画。你的身体也支持动画编程，打开光剑和能量护盾，发射激光都只是最基本技能，还能造出什么要看你脑洞有多大。（感觉自己创造力有点枯竭）\n\n我和另一位中国玩家@VRTIME一起打造了一个领域CHINA TOWN，添加了一些小玩意，热烈欢迎有兴趣的同学前来参观，你可以用领域菜单（AREA）内右下角搜索功能关键词CHINA。\n\n现在已经有很多玩家建造了各种有趣的玩具和领域，山水，城镇，人物形象，兵器，玩具，飞船，乐器……可惜评测区不能贴截图，建议大家到截图区看一下玩家们的作品，anyland世界里所有东西都是玩家们自己动手建造的。\n\n现在游戏功能还在不断完善，开发者每周都会更新很多内容，Anyland宇宙一定会越来越繁荣。\n\n这里需要更多脑洞大开的玩家一起创世纪，在这里我们就是神，别犹豫了入手吧！", "timestamp_created": 1480334629, "timestamp_updated": 1486822603, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.642679", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27873144": {"recommendationid": "27873144", "author": {"steamid": "76561198042089998", "num_games_owned": 219, "num_reviews": 5, "playtime_forever": 2303, "playtime_last_two_weeks": 0, "last_played": 1494453115}, "language": "english", "review": "Difficult to learn, but the stuff you can do is pretty awesome", "timestamp_created": 1480274434, "timestamp_updated": 1480274434, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27825887": {"recommendationid": "27825887", "author": {"steamid": "76561198033359745", "num_games_owned": 82, "num_reviews": 9, "playtime_forever": 1347, "playtime_last_two_weeks": 0, "last_played": 1482691889}, "language": "english", "review": "6 Hours on day one. i only stopped because my controllers ran out of battery and i got tired of taking 5 minute breaks to charge them and keep playing . . so far ive built half my house to scale. meanwhile building i play youtube videos on an IMAX screen Behind Me for . . Very Fun And Great for practicing Scripting Or Whatever You Want To Call The If This Then That Type Programming. I Bet The Only Person Who Disliked This Game Has A Very Short Attention Span And Still Wants His Mommy To Tie His Shoes", "timestamp_created": 1480252315, "timestamp_updated": 1480252315, "voted_up": true, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.509794", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27716548": {"recommendationid": "27716548", "author": {"steamid": "76561198030515446", "num_games_owned": 509, "num_reviews": 4, "playtime_forever": 846, "playtime_last_two_weeks": 0, "last_played": 1498278312}, "language": "english", "review": "This is the Minecraft of VR, allowing so much creative potential and the ability to create whole worlds with such a small and easy-to-grasp set of tools.  The only issue I have right now is that I wish more people were playing and making stuff!", "timestamp_created": 1480187706, "timestamp_updated": 1480187706, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.540459", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27551507": {"recommendationid": "27551507", "author": {"steamid": "76561198070769462", "num_games_owned": 407, "num_reviews": 28, "playtime_forever": 51843, "playtime_last_two_weeks": 1494, "last_played": 1515992783}, "language": "english", "review": "UPDATE January 2017 -- I've now clocked over 200 active hours in Anyland over the past ~3 months, surpassing all other Steam games' /played.  #1 VR program for me indeed.\nThe devs are still adding features, many from suggestions, every few days.\nAfter teaching a few new players & friends, there is a learning curve to designing well, but it's easy to get up to speed by just building (practice practice practice) and experimenting. With the friendly community, bouncing ideas off each other & helping solve design problems is fun.\nI was initially wary of Anyland because I read \"scripting\" and thought \"too complicated\" and that was a mistake to think this. Scripting is optional but it's simple auto-complete commands from lists + your own variables. So simple, yet still powerful. Watch Philipp's short tutorial vids with quick examples, then experiment.\nNow I see various VR games, like wave shooters or \"experiences\" like walking around in an artsy environment for example, and instantly think \"I can make that myself in an evening or 2 in Anyland.\" ;-)\n\n\nIn the Top 5 \"Must Have\" Vive programs for me!\nAnyland is exactly what I wanted for VR and has taken over most of my VR game time since I bought it.\nNot content just cons00ming experiences, I want to create & build *anything*. And now I can create even worlds.\n\nEverything is fairly intuitive to do, from creating to moving to manipulating & resizing shapes; it all feels natural. This is 3-D modelling the way I always wanted, not in a 3-D CAD program on a 2-D monitor with a 2-D mouse.\nThe UI in-game for everything is smartly designed for interaction with VR hands. The devs are thinking in VR, not thinking of traditional 2-D UI for monitors and forcing it into VR.\n\nBecause controls & interfaces are smartly designed and intuitive, modelling things can be done fast after a very short learning curve.\nThe low-poly and low-texture aesthetic of Anyland helps to make modelling fast and easy, and thus the system requirements aren't obscene. (I've looked at other world-building VR programs out now which are ambitious and high-poly and I nope out because they're overly complex to create in.)\n\nThere's a straight-forward scripting language with auto-complete options which is simple to learn & use. This takes the possibilities from static objects & scenery to near-limitless possibilities.\n\nThe dev is active on the Steam forums and listens to suggestions, sometimes implementing new features & script commands the next day!\n\nMeeting other people in VR and chatting is always a great experience. In Anyland where you create your own avatar from scratch, it's even more impressive than other social VR \"games\" because you can fully represent how you want to look, not restricted to things like humanoid or... anything at all.\n\nMy only complaint is a personal one: I want to create so many things, buildings, and worlds and I only have so much time in a night!\n\nFans of RPO: this is like a nascent OASIS.\n\n\nBottom-line:\nIf you have a Vive, and enjoy exploring worlds and/or creating things then get Anyland!", "timestamp_created": 1480109792, "timestamp_updated": 1485028502, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27520485": {"recommendationid": "27520485", "author": {"steamid": "76561198009801173", "num_games_owned": 95, "num_reviews": 9, "playtime_forever": 3603, "playtime_last_two_weeks": 0, "last_played": 1511368777}, "language": "english", "review": "This game is really fun, all it needs it more people playing but its still fun creating your own stuff", "timestamp_created": 1480099484, "timestamp_updated": 1480099484, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.503817", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27508251": {"recommendationid": "27508251", "author": {"steamid": "76561198022679792", "num_games_owned": 40, "num_reviews": 1, "playtime_forever": 456, "playtime_last_two_weeks": 0, "last_played": 1513803708}, "language": "german", "review": "Super Spiel, einfach weiter zu empfehlen. Jeder der eine Vive besitzt und ein bisschen Kreativität besitzt, sollte dieses Spiel einfach kaufen! Es ist einfach umgesetzt und super einfach. Einfach ein bisschen Eingewöhnungsphase. \n\nDenoch ein Must-Have für mich, denn man kann hier einfach alles bauen und kreiren was man sich erdenken kann und sozusagen fast eine zweite Welt bauen könnte.\nViel Spass damit. und schreibt mir falls jmd mal lust hätte mit mier zu zocken... (Gibt ja noch nicht allzu viele Deutsche oder Schweizer, die eine Vive besitzen...\n\nAuf jeden Fall ein Lob Wert an den Entwickler, für die vielen Updates die immer wieder kommen!", "timestamp_created": 1480095900, "timestamp_updated": 1480095900, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26933398": {"recommendationid": "26933398", "author": {"steamid": "76561197962829908", "num_games_owned": 209, "num_reviews": 6, "playtime_forever": 32132, "playtime_last_two_weeks": 98, "last_played": 1515966440}, "language": "english", "review": "On my first visit in Anyland i dropped onto an island, its evening, there are a couple of torches, some rocks, a hotdog and a raygun.\nI play with the raygun and eat the hotdog, then a birdperson (birdlike avatar) walks up and says \"hi!\"\nI ask if he has made this world, \"nah, just some small stuff and the moon\".\nI look up and theres a huge smiley faced moon hanging in the sky.\nMy mind is blown, i realize that this is a strong first step towards the metaverse we all know from the classic books, a fully player created space, i break down laughing.\nMr Bird pulls a piano from his sleeve and starts playing a tune, i laugh even harder.\nI escape back to my empty starting area, sit down on the floor and repeat \"holy shit\" to myself a couple of times.\n\nAnyland is a wonderful place and its only going to get better :)", "timestamp_created": 1479941877, "timestamp_updated": 1479941877, "voted_up": true, "votes_up": 32, "votes_funny": 8, "weighted_vote_score": "0.761272", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26709362": {"recommendationid": "26709362", "author": {"steamid": "76561198000574574", "num_games_owned": 149, "num_reviews": 21, "playtime_forever": 133, "playtime_last_two_weeks": 3, "last_played": 1515953461}, "language": "english", "review": "This game CAN and probably WILL be great. But right now it feels like it's still in development, and I can't recommend it just yet.\nThis isn't a hard \"No\", but it's still a \"No\".\n\nIt's an online world that lets you build just about anything. The main problems I encountered though are that building things is difficult, clunky, and impercise. I often struggled to accomplish what I wanted to do, or once I finally did what I wanted to do I accidently undid it, or realized I can't edit it, and couldn't figure out why.\nThe shapes you get to work with are very basic, I'd have liked to have more options.\n\nIt's an online game, but because it's a paid game there's not as many people there as you'd find in other online games.\n\nIn the game's favor, the developers are still working on putting in more things and improving it all on a frequent basis, so like I said, maybe one day, but not worth your money just yet unless you really want to be in on this from the start.", "timestamp_created": 1479635481, "timestamp_updated": 1479635481, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.471436", "comment_count": "9", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26675431": {"recommendationid": "26675431", "author": {"steamid": "76561198028040391", "num_games_owned": 103, "num_reviews": 3, "playtime_forever": 883, "playtime_last_two_weeks": 0, "last_played": 1503445267}, "language": "german", "review": "Kaufen! Kaufen! Kaufen! Es lohnt sich! Herbe geniales Craftinggame mit unsäglich vielen Möglichkeiten!\n\nEs ist seine 12 Euro Wert (Nov. 2016)\n\nKauft es euch jetzt, wenn ihr eine HTC Vive besitzt! Bis zu den ersten Triple A Titeln ein Muss für alle Bastler.", "timestamp_created": 1479489526, "timestamp_updated": 1479489526, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26636190": {"recommendationid": "26636190", "author": {"steamid": "76561198340477202", "num_games_owned": 22, "num_reviews": 1, "playtime_forever": 39260, "playtime_last_two_weeks": 74, "last_played": 1516316197}, "language": "english", "review": "Amazing game, if you own a vive, buy it now. The building is intuitive and the  posibilites are endless.", "timestamp_created": 1479333699, "timestamp_updated": 1479333699, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.506680", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26601105": {"recommendationid": "26601105", "author": {"steamid": "76561198040840517", "num_games_owned": 437, "num_reviews": 22, "playtime_forever": 85, "playtime_last_two_weeks": 0, "last_played": 1479000839}, "language": "english", "review": "Check out our full review @ https://vivereport.com/2016/11/10/from-nothing-to-something-anyland-vr/\n\nAnyland is a virtual reality sandbox, an open universe in which you can create anything you want using polygon objects. In it, you can also visit others’ creations, and virtually socialize. \n\nAnyland allows you to program movement and sound into each object via a list of basic “when-then” scripts, as in, “when touched then play munching sound.” You can add functions so that you can interact with “things” and make them come alive. This is what makes Anyland absolutely exciting.\n", "timestamp_created": 1479137108, "timestamp_updated": 1479137108, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.490981", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26552917": {"recommendationid": "26552917", "author": {"steamid": "76561198046527015", "num_games_owned": 111, "num_reviews": 1, "playtime_forever": 379, "playtime_last_two_weeks": 0, "last_played": 1480299219}, "language": "english", "review": "Worth every penny, I've only had this game for a week and I've had so much fun in it.", "timestamp_created": 1478937036, "timestamp_updated": 1478937036, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26527190": {"recommendationid": "26527190", "author": {"steamid": "76561198005185068", "num_games_owned": 192, "num_reviews": 20, "playtime_forever": 126, "playtime_last_two_weeks": 0, "last_played": 1481815964}, "language": "english", "review": "Recommended.", "timestamp_created": 1478819639, "timestamp_updated": 1479723140, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.477941", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26523287": {"recommendationid": "26523287", "author": {"steamid": "76561197998501719", "num_games_owned": 33, "num_reviews": 1, "playtime_forever": 2574, "playtime_last_two_weeks": 0, "last_played": 1482892575}, "language": "english", "review": "This is a great game!  Easily one of the most enjoyable, creative experiences I've found on the Vive.  Easy to pick up and start creating, but plenty to learn which will keep your creativity from plateauing!", "timestamp_created": 1478804174, "timestamp_updated": 1478804174, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26509090": {"recommendationid": "26509090", "author": {"steamid": "76561197966491079", "num_games_owned": 102, "num_reviews": 1, "playtime_forever": 12045, "playtime_last_two_weeks": 0, "last_played": 1514739342}, "language": "english", "review": "Fantastic Game. Helps push your creative mind with others!", "timestamp_created": 1478725947, "timestamp_updated": 1478725947, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26492843": {"recommendationid": "26492843", "author": {"steamid": "76561198068045508", "num_games_owned": 94, "num_reviews": 5, "playtime_forever": 1128, "playtime_last_two_weeks": 0, "last_played": 1484035984}, "language": "english", "review": "This game is very unique and has SO MUCH potential. I spent over 2 hours and a half with my friend over in his Area building our characters and then we spent another 2 hours just going around exploring people's places, playing around with different things and what not. The only thing this game is missing is a bit more tools like a locking tool to lock things in place and some bending tools to accomplish even more precise creations and a bit more coding tools to make some more ambitious projects possible.", "timestamp_created": 1478629897, "timestamp_updated": 1478629897, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26469568": {"recommendationid": "26469568", "author": {"steamid": "76561197984224857", "num_games_owned": 188, "num_reviews": 20, "playtime_forever": 525, "playtime_last_two_weeks": 0, "last_played": 1510684026}, "language": "english", "review": "Brilliant in every way. I've been time-traveled back to the wild west of early unmoderated Second Life, with bizarre creations flying everywhere. Wonderuful and easy to use.", "timestamp_created": 1478495023, "timestamp_updated": 1478495023, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26460144": {"recommendationid": "26460144", "author": {"steamid": "76561197977671978", "num_games_owned": 445, "num_reviews": 11, "playtime_forever": 246, "playtime_last_two_weeks": 0, "last_played": 1498897653}, "language": "spanish", "review": "Me lo compré por probarlo un poco y pensando que seguramente pediría el reembolso y, cuando me vine a dar cuenta, llevaba ya más de 3 horas enganchado. Aun faltan muchas cosas por implementar, pero ya con lo que tiene hay material para divertirte un buen rato. Perfecto para gente creativa a la que le guste construir cosas, y encima puedes hacerlo con amigos!\n\nYo estoy muy contento con la compra. Los desarrolladores participan muy activamente en los foros, atentos a las peticiones de la comunidad, así que supongo que irán poco a poco añadiendo las cosas que la gente está pidiendo, como la opción de agrupar objetos, un botón de deshacer (update: acaban de actualizarlo añadiendo una primera versión del botón deshacer), nuevas posibilidades de edición de objetos como extrusión, recorte, texturas, etc.", "timestamp_created": 1478451138, "timestamp_updated": 1478539106, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26451008": {"recommendationid": "26451008", "author": {"steamid": "76561198076173152", "num_games_owned": 214, "num_reviews": 39, "playtime_forever": 539, "playtime_last_two_weeks": 0, "last_played": 1492894909}, "language": "english", "review": "brilliant creative space to share with friends. It's a really unique experience to be able to craft to this degree of control, it's really just your imagination as the limit", "timestamp_created": 1478416552, "timestamp_updated": 1478416552, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26392019": {"recommendationid": "26392019", "author": {"steamid": "76561198119035044", "num_games_owned": 114, "num_reviews": 6, "playtime_forever": 756, "playtime_last_two_weeks": 0, "last_played": 1491531747}, "language": "english", "review": "This truly is a versitile and fun game. Bit of a learning curve, but for 12 dollars you can create anything. I do love this game.", "timestamp_created": 1478130274, "timestamp_updated": 1478130274, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26362314": {"recommendationid": "26362314", "author": {"steamid": "76561198278912293", "num_games_owned": 86, "num_reviews": 8, "playtime_forever": 39472, "playtime_last_two_weeks": 252, "last_played": 1516342957}, "language": "english", "review": "This game is where all my VR time is going right now. It's hard to even describe the scope that this sandbox has. The ability to run little scripts for animating parts of things you build is mind boggling. I bought this after reading all the glowing reviews thinking that it might be fun. When I started using it I met people who had only been using the program for a few weeks and had created huge areas of really amazing things. This seems to be what VR was made for. It is something where you have to create to get something back out of it but once you start you won't want to stop. You don't have to be an artist, just have some amount of curiosity and off you go. AMAZING!", "timestamp_created": 1478034103, "timestamp_updated": 1478034103, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.544506", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26349486": {"recommendationid": "26349486", "author": {"steamid": "76561198465880027", "num_games_owned": 75, "num_reviews": 9, "playtime_forever": 2473, "playtime_last_two_weeks": 0, "last_played": 1511418994}, "language": "schinese", "review": "I love this game，I can build my dream house here。\n如果你喜欢模拟建造类的游戏，那就绝对不可错过！\n你可以随意组合任意物品出来~并且还能添加动画，其他的一些功能，比如射击物体，触发等等非常值得玩！可以召集小伙伴们来一起打造一个世界！\nI Love this game!\n\n如果可以的话能添加中文就好了！\nwe need chinese", "timestamp_created": 1477982526, "timestamp_updated": 1511417265, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26336531": {"recommendationid": "26336531", "author": {"steamid": "76561197993929670", "num_games_owned": 841, "num_reviews": 26, "playtime_forever": 1066, "playtime_last_two_weeks": 0, "last_played": 1507838701}, "language": "english", "review": "Just...great...\n\nFor such a simplistic looking game on the surface, it definitely has alot of depth to it!\n\nOnly played a few hours at the time of this review, and I have to say this is the best building/creative game on the Vive right now, and probably won't be beaten easily!\nYou can literally build anything you can think of. It also features a simple yet powerful scripting tool to change and manipulate what you build.\n\n\nThe Dev seems to be very involved with the community and is willing to look into our suggestions on additions to the game.\n\nHighly recommend!\n", "timestamp_created": 1477922591, "timestamp_updated": 1477922591, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26321122": {"recommendationid": "26321122", "author": {"steamid": "76561198053421886", "num_games_owned": 116, "num_reviews": 3, "playtime_forever": 278, "playtime_last_two_weeks": 0, "last_played": 1478547471}, "language": "english", "review": "This may actually be my first review on steam but I felt compelled to write one. This is an amazing game/sandbox, the freedom you have to create and do so many different things is incredible. Im a huge fan of this and could really see myself getting lost here for hours. To me this is what VR should be all about. Great job.", "timestamp_created": 1477849841, "timestamp_updated": 1477849841, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26316357": {"recommendationid": "26316357", "author": {"steamid": "76561198042913113", "num_games_owned": 453, "num_reviews": 208, "playtime_forever": 112, "playtime_last_two_weeks": 0, "last_played": 1478879177}, "language": "english", "review": "One moment, I'm brand new in the world. I quickly figure out how to touch things like my super rings, and bring myself to another area that had a (1) on it. I assumed it meant there was a person there...\n\nI assumed right.\n\nAfter a few minutes talking to the guy in there (Who was really patient and helpful), I was putting a face in my face hole, a body in my body hole, and other parts of my body to make up my whole. \n\nThese parts were initially provided to me from the guy who was in that area with me, and as thankful as I was, as I started to figure out more about how to make shapes and object, my true persona began to materialize in my head.\n\nI knew what I wanted to be, and nothing could stop me from becoming my destined being. \n\nI quietly used my super ring to transport myself to my own world, a world that created itself upon my first starting the game. \n\nHere, I quickly got to work making myself a head, some arms, and a rather cool body.\n\nAfter sticking them all together, and seeing myself in the mirror, I knew I was complete. \n\nFinally, my dream of becoming a mantis was reached. \n\nThe thing with this game is, it's just so fantastic. This is to VR what Minecraft is to PC. \n\nYou get into the game, fiddle around with things, and before you know it, you're creating worlds and objects, alone or with anyone else playing the game at the same time.\n\nIt really is an amazing experience. \n\nAnyone who owns the Vive, NEEDS this game.", "timestamp_created": 1477836609, "timestamp_updated": 1477836609, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.564940", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26283954": {"recommendationid": "26283954", "author": {"steamid": "76561198015427804", "num_games_owned": 219, "num_reviews": 2, "playtime_forever": 826, "playtime_last_two_weeks": 0, "last_played": 1504937002}, "language": "english", "review": "Excellent beginning to a possibly massive community of worlds. Quick learning curve and your up and programming your own objects and worlds in no time! Awesome community and a ton of ingenuity... worth every penny!", "timestamp_created": 1477723063, "timestamp_updated": 1477723063, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26236577": {"recommendationid": "26236577", "author": {"steamid": "76561198000135680", "num_games_owned": 486, "num_reviews": 5, "playtime_forever": 154, "playtime_last_two_weeks": 0, "last_played": 1477587820}, "language": "english", "review": "I've only played for above an hour, but the potential for this game is huge.\nIt will really tap into that urge to create your own worlds in the way you want, and then bring your friends into it to just hang out.\n\nAlso, I sat for a few minutes with a random dude and watched some youtube on the big screen, it was quite awkward but at the same time it was pretty goddamn amazing. \nNow i don't have to invite hobos up to my apartment anymore!", "timestamp_created": 1477515411, "timestamp_updated": 1477515411, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.525547", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26235533": {"recommendationid": "26235533", "author": {"steamid": "76561198017007749", "num_games_owned": 250, "num_reviews": 43, "playtime_forever": 1038, "playtime_last_two_weeks": 0, "last_played": 1496600214}, "language": "english", "review": "I've only tried this for 1 hour and already I'm immersed and planning what to build. A castle? Battle arena? A store?! Anything really... Anyland is made in such a way that there is so much possibility from simple to complex objects to animation. The controls are pretty intuitive and easy to learn. I highly recommend spending the time and watching the tutorials on youtube first all the way through or you might get a bit frustrated. Graphics wise, I think it hits the spot for that style of building.  Menu's could use a little work to be more user friendly but it's more about learning them as they are pretty powerful the way they are, just takes getting used to. I can see Anyland expanding into something rather large as VR grows.", "timestamp_created": 1477510288, "timestamp_updated": 1477510288, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26225691": {"recommendationid": "26225691", "author": {"steamid": "76561197984634886", "num_games_owned": 141, "num_reviews": 1, "playtime_forever": 331, "playtime_last_two_weeks": 0, "last_played": 1477882093}, "language": "english", "review": "I've never reviewed anything on Steam before but this game is SO GOOD, I had to actually write one up for this gem. Absolutely incredible game. Overwhelmingly deep, creative and completely amazing to play and create stuff in. The in game scripting is so simple yet very powerful! I am considering calling out of work for the rest of the week to play this non-stop. 10/10", "timestamp_created": 1477456309, "timestamp_updated": 1477456309, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.523333", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26224869": {"recommendationid": "26224869", "author": {"steamid": "76561198042347689", "num_games_owned": 129, "num_reviews": 5, "playtime_forever": 1187, "playtime_last_two_weeks": 0, "last_played": 1512944932}, "language": "english", "review": "You can program a gun to mount to your arm. This game's sick. Haha.", "timestamp_created": 1477450006, "timestamp_updated": 1477450006, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26223138": {"recommendationid": "26223138", "author": {"steamid": "76561198009898780", "num_games_owned": 199, "num_reviews": 3, "playtime_forever": 558, "playtime_last_two_weeks": 0, "last_played": 1501423931}, "language": "english", "review": "This could quite easily pick up as fast as a certain other creative game that came out that had voxels...\n\nRight now the Dev is aware that there are three things that need to be added and then... the imagination is litterally the limit.\n\nThis is what I call a \"Gold\" early access title aka: Dev is active, gives feedback and updates are regular\n\nThe three things to add (IMO are):\n\nSubtractive creation: Right now you can only add in primitives not use any kind of subtraction. \nScaling creation: Being able to resize yourself or the finshed object would allow you to build a small house and make it life sized and not have to build a life sized house :P\nGrouping: Right now you can work with one primitive at a time and 1 axis at a time, ideally I would like to be able to scale all 3 axis uniformaly (triggers + dom hand grip?) and also to select multiple parts of the creation and scale them as well\n\nIf those get added then holy christ this game can be ANYTHING\n\nSomeone has already made a lazer arena...", "timestamp_created": 1477439654, "timestamp_updated": 1477439654, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26214110": {"recommendationid": "26214110", "author": {"steamid": "76561197969404091", "num_games_owned": 368, "num_reviews": 17, "playtime_forever": 862, "playtime_last_two_weeks": 0, "last_played": 1499219170}, "language": "english", "review": "Mind blowing. This is the cutting edge of VR creation in VR with other people!", "timestamp_created": 1477400751, "timestamp_updated": 1477400751, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26203710": {"recommendationid": "26203710", "author": {"steamid": "76561198073184663", "num_games_owned": 121, "num_reviews": 6, "playtime_forever": 21511, "playtime_last_two_weeks": 62, "last_played": 1515186101}, "language": "german", "review": "Dieses Spiel ist mit Abstand das beste Spiel für VR das ich bis jetzt finden konnte. Es bietet viele Möglichkeiten Gegenstände und den eigenen Körper zu kreieren und mit Extras auszustatten. Bis jetzt gibt es noch nicht so viele Spieler aber man merkt das stetig neue hinzukommen.\n\nObwohl nur 2 Entwickler an dem Spiel arbeiten, merkt man das an dem Spiel gearbeitet wird. Wenn Bugs gemeldet werden, werden sie manchmal sogar häufig noch am selben Tag behoben.", "timestamp_created": 1477340842, "timestamp_updated": 1511463614, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26201263": {"recommendationid": "26201263", "author": {"steamid": "76561198008118629", "num_games_owned": 148, "num_reviews": 2, "playtime_forever": 1924, "playtime_last_two_weeks": 0, "last_played": 1514602667}, "language": "english", "review": "This game is super fun. It is brand new and already has lots of fun stuff to see. You can create anything you can imagine. GET THIS GAME!", "timestamp_created": 1477329887, "timestamp_updated": 1477329887, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.501754", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26193772": {"recommendationid": "26193772", "author": {"steamid": "76561198127344514", "num_games_owned": 42, "num_reviews": 4, "playtime_forever": 42648, "playtime_last_two_weeks": 1611, "last_played": 1516331557}, "language": "english", "review": "This game is so underrated, more people need to see it! I've spent countless hours playing this game with my friends. I love sandbox games, so this game really called to me. You can make anything you want, animate it, make it play sounds, make it a weapon, you can do ANYTHING. I would reccomend this to anyone!", "timestamp_created": 1477284264, "timestamp_updated": 1477284264, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.520392", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "26184281": {"recommendationid": "26184281", "author": {"steamid": "76561198046284473", "num_games_owned": 159, "num_reviews": 15, "playtime_forever": 2683, "playtime_last_two_weeks": 0, "last_played": 1506976816}, "language": "english", "review": "Pierre is it worth it?\n\nYes, yes it is worth all the money. (IF you are creative)", "timestamp_created": 1477236367, "timestamp_updated": 1477236367, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26170667": {"recommendationid": "26170667", "author": {"steamid": "76561197999733691", "num_games_owned": 87, "num_reviews": 1, "playtime_forever": 3065, "playtime_last_two_weeks": 0, "last_played": 1511233133}, "language": "english", "review": "Before this game the most I ever played a vr game in one sitting was about an hour and a half, then I got this game and havent been able to stop. Please buy this game.", "timestamp_created": 1477169562, "timestamp_updated": 1477169562, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26160326": {"recommendationid": "26160326", "author": {"steamid": "76561198027185073", "num_games_owned": 300, "num_reviews": 1, "playtime_forever": 13986, "playtime_last_two_weeks": 0, "last_played": 1512188178}, "language": "english", "review": "This has got to be the best VR game I have played. Everything is user created, literally everything. Some people talk about how the graphics don't look the best but that is just the style of the game, don't know what to tell ya. I have not played any other game but this for the past week because it is so addicting. The social aspect is also amazing, being able to hang out and just build what ever is on your mind with other people. Everyone is very friendly and I love the community. Phillip, a developer, is also very active and is always willing to listen to your suggestion. You're missing out on a lot if you have not tried this game yet. If you are confused when you first start, just find someone in another area, they will help you out in a heart beat.", "timestamp_created": 1477129936, "timestamp_updated": 1477129936, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.558282", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26151019": {"recommendationid": "26151019", "author": {"steamid": "76561197962163349", "num_games_owned": 74, "num_reviews": 5, "playtime_forever": 4690, "playtime_last_two_weeks": 0, "last_played": 1487556470}, "language": "english", "review": "Outstanding game,  Its only limited by imagination!  Great game and great helpfull players!\n\nI started a Discord for people to get help and talk about the game, Join https://discord.gg/NhqN2C7", "timestamp_created": 1477079059, "timestamp_updated": 1477079059, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.500000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26147263": {"recommendationid": "26147263", "author": {"steamid": "76561197972167639", "num_games_owned": 242, "num_reviews": 2, "playtime_forever": 18566, "playtime_last_two_weeks": 0, "last_played": 1512508040}, "language": "english", "review": "Do you like to create? Do you like animating? Do you like simple scripting? Want to do it all in shared or private spaces? In VR? \nBuy this game! \nWhile there are some bugs (most of which can be fixed by logging. Takes literally 5secs), the Devs are great. Bug fixes almost every day as well as new features. They are are active testing/helping in game as well as the forums.\nI'm having a blast with the game and I've barely scratched the surface of what is possible. Also the community is great and helpful.\n", "timestamp_created": 1477064856, "timestamp_updated": 1477064856, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26145643": {"recommendationid": "26145643", "author": {"steamid": "76561197971812938", "num_games_owned": 318, "num_reviews": 37, "playtime_forever": 461, "playtime_last_two_weeks": 0, "last_played": 1483842007}, "language": "english", "review": "Anyland is Friggin fun! Good job! It may be scary at first but as i saw someone say.. Anyland is as hard as YOU want it to be.!\n\n", "timestamp_created": 1477058540, "timestamp_updated": 1477058540, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.477941", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26144146": {"recommendationid": "26144146", "author": {"steamid": "76561198059881245", "num_games_owned": 50, "num_reviews": 2, "playtime_forever": 931, "playtime_last_two_weeks": 0, "last_played": 1509492868}, "language": "english", "review": "Anyland is an amazing social creative enviroment where you can build items and worlds and share your creationsI Its like a VR Little Big Planet! I cant wait to get back in and play Anyland, meet more people, and learn how to build more things. \n", "timestamp_created": 1477051764, "timestamp_updated": 1477051764, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26137821": {"recommendationid": "26137821", "author": {"steamid": "76561198229628556", "num_games_owned": 72, "num_reviews": 38, "playtime_forever": 728, "playtime_last_two_weeks": 0, "last_played": 1476677468}, "language": "spanish", "review": "super recomendado, las posibilidades de este juego son grandes ya de por si  asi como esta es muy entretenido y una vez que empiezas a construir se va el tiempo rapidisimo hehe dejo un gameplay del  juego saludos!!\n\nhttps://www.youtube.com/watch?v=5RB9tu2jp1A", "timestamp_created": 1477010493, "timestamp_updated": 1477010493, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26115385": {"recommendationid": "26115385", "author": {"steamid": "76561198003431668", "num_games_owned": 286, "num_reviews": 2, "playtime_forever": 1105, "playtime_last_two_weeks": 0, "last_played": 1478327438}, "language": "english", "review": "Do you like 3D design? Programming? VR? Then this is the game for you.\nPros:\nDesign in a 3D space with simple and easy to use controls.\nProgramming and animating an object is exceedingly easy to learn. (I taught my roommate with no programming experience in only a few minutes)\nCreate your own worlds that others can build in and explore (if you let them)\nMultiplayer is smooth and lag is non-existant\n\nCons:\nplenty of bugs (it came out only a week and a half ago)\nlimited 3D models to choose from", "timestamp_created": 1476885769, "timestamp_updated": 1476885769, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26101655": {"recommendationid": "26101655", "author": {"steamid": "76561197970055167", "num_games_owned": 337, "num_reviews": 21, "playtime_forever": 652, "playtime_last_two_weeks": 0, "last_played": 1477712125}, "language": "english", "review": "Hi Fellow VR Gamers! \n\nA friend of mine found this game and sent it to me yesterday.\nI decided to give it a try and I am SO glad I did! \n\nThis game completely blew me away! \nSome of you might join, build a couple of things, get bored and leave. \nThere is no doubt that not everyone will find as much fun in this as I have. (and hope to continue do to)\n\nBut for those with imagination and creativity it is an AMAZING toolbox of possibilities! \n\nCONTROLS\nThe controls are simple and intuitive. There is a slight learning curve when it comes to scipting but ill get back to that. \n\nFrom the moment I realized that I had to create the entire area, floor, and all I was hooked. In about an hour I had a full forest created with tall trees, pond with fish and my own smoldering camp fire. (Check it out at Cajuns Retreat)\n\nI have so many idea of wonderful creations and environments that I would like to try. \n\nSCRIPTING\nThe scripting is deceptivally powerfull leting you make everythinf from working guns, moving mechanical objects to moving NPCs. It's just a blast to play with. \n\nSOCIAL \nThe social aspect of this game is really cool! I had 10 visitors to my area in the first couple of hours. Everyone was nice, many even helped me with tricks they discovered. Great fun! \n\nI HIGHLY recommend this game to anyone that liked tilt brush and is looking for hours of fun.\n", "timestamp_created": 1476801100, "timestamp_updated": 1476801100, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.521593", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26080863": {"recommendationid": "26080863", "author": {"steamid": "76561198084373744", "num_games_owned": 1257, "num_reviews": 251, "playtime_forever": 17, "playtime_last_two_weeks": 0, "last_played": 1476430360}, "language": "schinese", "review": "如果你对这个游戏感兴趣，不妨先看看我的视频(video):\nhttp://v.youku.com/v_show/id_XMTc2MDM2NzAxNg==.html\n此视频：04：55开始\n\n这个游戏没有中文的确有些上手困难。但不妨碍这个游戏的优秀，他是那种创造性的游戏，什么都没有。\n什么都是由你去创造，你还可以去别人家看看，别人的区域看看。只要你发挥脑洞，任何东西都能造出来\n适合创造力强的！\n\n每天都会录制VR游戏视频，喜欢的话可以订阅哦\nsteam毕竟是一个要花钱的平台，所以我希望用我的视频让大家能更好的了解每一个游戏\n最后，祝大家游戏越快哦~", "timestamp_created": 1476669988, "timestamp_updated": 1476669988, "voted_up": true, "votes_up": 19, "votes_funny": 3, "weighted_vote_score": "0.694253", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26078766": {"recommendationid": "26078766", "author": {"steamid": "76561197970884244", "num_games_owned": 75, "num_reviews": 3, "playtime_forever": 31, "playtime_last_two_weeks": 0, "last_played": 1476649009}, "language": "english", "review": "really fun to play with other people. Creat your own look and place to hang with friends.", "timestamp_created": 1476656579, "timestamp_updated": 1476656579, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26068371": {"recommendationid": "26068371", "author": {"steamid": "76561198050124001", "num_games_owned": 663, "num_reviews": 2, "playtime_forever": 842, "playtime_last_two_weeks": 0, "last_played": 1487342869}, "language": "english", "review": "This is without question my favorite VR game. I can't believe how awesome it is. Trying to figure out how to make things, and sharing them with others is just amazing. I've never been this immersed in VR before.", "timestamp_created": 1476620495, "timestamp_updated": 1476620495, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26066073": {"recommendationid": "26066073", "author": {"steamid": "76561198001126658", "num_games_owned": 278, "num_reviews": 11, "playtime_forever": 1969, "playtime_last_two_weeks": 0, "last_played": 1505492072}, "language": "english", "review": "There are no premade things in this game.\n\nEvery single thing you ever see was made by players and that works extremely well in VR, because with your hands you can shape very easily compared to a mouse or a controller.\n\nThe scripting is actually quite powerful and people have made anything from animated glowing butterflies to complex stuff like a cannon that has to be loaded with gunpowder first before firing, or a fully animated gun that looks like a paid asset from the unity store (but it was built with the ingame tools! By players! Without living VR!)\n\nEven if you're not the creative guy, join this just to hang out, collect stuff and explore and maybe you'll find your inspiration to make amazing things with the help of other guys.\n\nIf you are creative and maybe even know the basics of programming, you'll absolutely love this game and I can't wait to see what you're going to invent!\n\nJust look at how many hours people spent in this game. It is truly incredible", "timestamp_created": 1476611636, "timestamp_updated": 1476611636, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.496575", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26064033": {"recommendationid": "26064033", "author": {"steamid": "76561198078570259", "num_games_owned": 321, "num_reviews": 10, "playtime_forever": 61389, "playtime_last_two_weeks": 3554, "last_played": 1516352932}, "language": "english", "review": "I cannot describe how good this game is.\nI have lost so many hours of sleep in the world.\n\nThe developers are amazing.\nPhilipp, whom is a saint, has, within mere hours, added features I, and others, have requested into the game.\n\nThe community is great.\nI know most of the people on Anyland better than I know anyone in my family.\nEverything in game is made by the players. No matter how ugly something may seem, there is a certain beauty to the fact that some living human has made it. This game is marvelous.\n\nBelow are some lists. I shall update these as needed.\n\nThe things I have made;\n-Weapons from Warframe: (Azima, Sobek, Galatine, Tetra)\n-Tools: (PortalGun from Portal, Grenade, Holy Hand Grenade, Exploding Birds, Nuke, Mininukes, Frying Pan with flippable eggs, Grenade launcher)\n-Party items: (Disco Ball, Lasers, Smoke Machine, Dance Floor, Glow sticks)\nWorlds I have made;\n-Nicolas Cages Home: (A sanctuary from a surrounding wasteland, complete with a waterfall and cave house.)\n-CTF: (Capture the flag. Me and a guy named OP created a CTF map together.\n-Nic Wardrobe: (The inside of my wardrobe which is accessed from a wardrobe in my home. Stores all my bodies for later equipal.)", "timestamp_created": 1476602768, "timestamp_updated": 1484565751, "voted_up": true, "votes_up": 5, "votes_funny": 3, "weighted_vote_score": "0.503817", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26060954": {"recommendationid": "26060954", "author": {"steamid": "76561198020001143", "num_games_owned": 237, "num_reviews": 2, "playtime_forever": 946, "playtime_last_two_weeks": 0, "last_played": 1509511378}, "language": "english", "review": "I've only played a couple hours so far, but I've made an avatar for myself, have started working on my first area, and have learned the basics of scripting.  \n\nThe learning curve is not bad, but it's worth watching a quick tutorial to learn the button layout.  After you've gotten the basics figured out go onto the forums and you should be able to find someone who's advertising their space.  I found a hamburger head dude who's built this candy land place.  Very creative guy and he's got some mini games in his place.  He was the one to show me the basics of the scripting system. \n\nI feel like this is the beginning of something really neat.  This is the first time since I've had my headset, that I've really felt that I wasn't isolated in VR.", "timestamp_created": 1476586373, "timestamp_updated": 1476586373, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26031898": {"recommendationid": "26031898", "author": {"steamid": "76561198018019086", "num_games_owned": 125, "num_reviews": 9, "playtime_forever": 1866, "playtime_last_two_weeks": 0, "last_played": 1476850766}, "language": "english", "review": "This \"Game\" is incredible. if you can think it, you can create it. The community is very pleasant and helpful. Creation is addictive and you will find yourself thinking of ideas faster than you can create them after a short while!\n\nlove it.", "timestamp_created": 1476463396, "timestamp_updated": 1476463396, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26023576": {"recommendationid": "26023576", "author": {"steamid": "76561198047129000", "num_games_owned": 135, "num_reviews": 6, "playtime_forever": 3276, "playtime_last_two_weeks": 0, "last_played": 1514591351}, "language": "english", "review": "This game is super addictive and is only limited to your creativity. Very interactive editing while chatting with friends and a  helpful community. Community is top notch!! The developers are very involved in updating. Met with one of the Devs multiple times in game in which he answered all of my questions and noted my suggestions. \n\nThe game is creative, fun, social and a must have for Vive owners!!\n\nBuy it and I will see you in Anyland!!!!", "timestamp_created": 1476420058, "timestamp_updated": 1476420058, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.458141", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26018003": {"recommendationid": "26018003", "author": {"steamid": "76561197974854004", "num_games_owned": 296, "num_reviews": 17, "playtime_forever": 12938, "playtime_last_two_weeks": 0, "last_played": 1507786493}, "language": "english", "review": "This game is mind blowing ...So much you can do....So many pals popping in....For everyone who wants a huge VR game that you can play for hours and hours this is it.First one to make my vive controlers blink red going dead.This is a first step into learning how games work and what scripting is and how it is used to create effects in games.Lets see what your mind can come up with..its a blank slate with your name on it!", "timestamp_created": 1476388031, "timestamp_updated": 1476388031, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26006845": {"recommendationid": "26006845", "author": {"steamid": "76561198329318751", "num_games_owned": 72, "num_reviews": 8, "playtime_forever": 58240, "playtime_last_two_weeks": 681, "last_played": 1516381110}, "language": "english", "review": "Possibly the most addictive, creative and fun thing I have done in VR yet!\n\nWorth every penny, you don't play on this... you go there, you make a home, friends and anything your imagination wants!\n\nGraphics Monkey", "timestamp_created": 1476325388, "timestamp_updated": 1476325388, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.523857", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26006512": {"recommendationid": "26006512", "author": {"steamid": "76561198116686376", "num_games_owned": 242, "num_reviews": 2, "playtime_forever": 240, "playtime_last_two_weeks": 0, "last_played": 1489298828}, "language": "english", "review": "Probably my favorite VR game, it has so much potential and is extremely addicting and entertaining. These are the types of games that VR needs for it to explode and become more and more popular. I will continue to play this game because of the amount of fun you can have and them ore you play it, the more fun it is because of the amount fo stuff you can create. The devs are constantly updating it and one of the devs Phillip even joins and creates his own creations and gives out tips to the noobs. If you like games that maek you release your creativity, then you will fall in love with it. You don't even need to be creative because youcan talk to other people and have fun with other people. I give this game a 10/10 rating, and would defininatly recommend this game to everyone and would definatly spend the 12$ needed.", "timestamp_created": 1476323039, "timestamp_updated": 1476323039, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25978372": {"recommendationid": "25978372", "author": {"steamid": "76561197970315395", "num_games_owned": 167, "num_reviews": 21, "playtime_forever": 676, "playtime_last_two_weeks": 0, "last_played": 1497990354}, "language": "english", "review": "Been playing for 7.5 hours now.\n\nThe things that people create such as environments, things and avatars are no short of amazing and you can visit any area that other people have create an join in on building on it further!\n\nIt's incredible how easy, fast and intuitive it is to create anything in this game - and not only that, but you can \"become\" the thing that you create by just putting the things on your own \"body\" in the game and other people can see that as \"you\".\n\nAnd to top it off, the built-in scripting system makes it easy to attach interactivity to anything in this game - want to shoot lazers from your arms? Just create it, script it and attach it to your arm and PEW PEW - it just works!\n\nI just can't wait to see what people will create in this game, in theory you could create a life-size replica of the Eifel Tower complete with elevators, fenses, lights and everything - and people can then visit it!\n\n10/10 Addicted.", "timestamp_created": 1476169150, "timestamp_updated": 1476169254, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25970185": {"recommendationid": "25970185", "author": {"steamid": "76561198040614430", "num_games_owned": 243, "num_reviews": 1, "playtime_forever": 1543, "playtime_last_two_weeks": 25, "last_played": 1515502356}, "language": "french", "review": "Ce jeu est fou! Des possibilités folles et un coté social qui apporte avec lui un envie de crée des choses et de les montrer aux autres!! Et crée un environement en vr, naviguer dedans c'est top! Et visité les voisins c est cool!Surtout cela apporte plein d'idées!\n\nbref foncez! en plus je cherches des personnes avec qui jouer donc ajouter moi!\n", "timestamp_created": 1476123368, "timestamp_updated": 1476123368, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25968501": {"recommendationid": "25968501", "author": {"steamid": "76561198261284792", "num_games_owned": 27, "num_reviews": 1, "playtime_forever": 1129, "playtime_last_two_weeks": 0, "last_played": 1495308001}, "language": "english", "review": "been stuck in dead end virtual worlds all my life. this seems to be that hole in the screen to freedom.......\njust starting to learn to build , seems very user friendly.\n\n", "timestamp_created": 1476116967, "timestamp_updated": 1476116967, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25968201": {"recommendationid": "25968201", "author": {"steamid": "76561198001165810", "num_games_owned": 378, "num_reviews": 140, "playtime_forever": 162, "playtime_last_two_weeks": 0, "last_played": 1508607078}, "language": "english", "review": "Fantastic fun.  Kind of a mix between Minecraft /Second Life/Landmark in VR. Easy to get started, but also possible to build complex stuff with scripting. Scripting is very simple, does not need to know anything about programming to use it. People have built working cinemas, music instruments, mini-games and more with this already. Build your own world, travel to worlds built by other players, or build together.\n\nOnly thing missing is an \"Undo\" button for when I mess something up :)", "timestamp_created": 1476115820, "timestamp_updated": 1476115968, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.542056", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25964366": {"recommendationid": "25964366", "author": {"steamid": "76561197984158053", "num_games_owned": 616, "num_reviews": 6, "playtime_forever": 1371, "playtime_last_two_weeks": 0, "last_played": 1484963329}, "language": "english", "review": "Best vr game! Joined game...had absolutely no idea what to do...joined room with other people...soon i was doing awesome stuff with help of other people :D This game is getting better and better with more people joining all the time! Highly recomended for everyone!", "timestamp_created": 1476100240, "timestamp_updated": 1476100240, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25961172": {"recommendationid": "25961172", "author": {"steamid": "76561197960776066", "num_games_owned": 1017, "num_reviews": 2, "playtime_forever": 1420, "playtime_last_two_weeks": 0, "last_played": 1507427437}, "language": "english", "review": "This has been the most incredible experience. Similar to MOOs of old, the dev has figured out a way for users to create their own content with simple but powerful tools. The interface felt strange to me at first but after learning the way that the Anyland universe is built I was able to really get into the swing of things. Be patient, ask for help and help others - it's been an incredible community so far. I promise you'll find yourself walking around during your day thinking of things you want to go back into Anyland to create. Super responsive developer gives me high hopes for the future!", "timestamp_created": 1476078411, "timestamp_updated": 1476078411, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25957789": {"recommendationid": "25957789", "author": {"steamid": "76561197971728046", "num_games_owned": 128, "num_reviews": 7, "playtime_forever": 242, "playtime_last_two_weeks": 0, "last_played": 1488010480}, "language": "english", "review": "The most comprehensive minecraft social experience I've tried. I would highly recommend. I haven't played long enough to determine the game's weaknesses, but so far it's simply mind-blowing and has been worth the price tag already.", "timestamp_created": 1476056760, "timestamp_updated": 1476056760, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25952931": {"recommendationid": "25952931", "author": {"steamid": "76561198122657925", "num_games_owned": 257, "num_reviews": 8, "playtime_forever": 1008, "playtime_last_two_weeks": 0, "last_played": 1482042047}, "language": "english", "review": "This is less of a game and more of an experience in imagination.  The sandbox principles are simple and intuitive.  Sculpting in 3d with variable lighting and effects.  This game is amazing in its current state, I cant wait to see where it goes from here.  Visiting other people and their creations is sublime.  So many interesting things being built daily and you can customize your avatar to unbelevable heights.  \nThis game is somewhere between Fantastic Contraption and Mine craft.  You get a palette with numerous shapes that you can manipulate and change scale, size, color, particle effects, sounds, animations, you name it!  The possiblities are literally, limitless.  \nEvery second you are reading these reviews means less time you are spending creating something incredible.  :)", "timestamp_created": 1476037086, "timestamp_updated": 1476037086, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.520392", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25951148": {"recommendationid": "25951148", "author": {"steamid": "76561197992523182", "num_games_owned": 312, "num_reviews": 33, "playtime_forever": 10129, "playtime_last_two_weeks": 44, "last_played": 1516306610}, "language": "english", "review": "This game is a wonderful sandbox well worth asking price.. you can make anything you can imagine and visit other peoples creations.. right now this is a small community but it will grow and there will be a dedicated die hard fans base.. very neat, buy it", "timestamp_created": 1476031595, "timestamp_updated": 1476031595, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25949546": {"recommendationid": "25949546", "author": {"steamid": "76561197981209197", "num_games_owned": 440, "num_reviews": 18, "playtime_forever": 2615, "playtime_last_two_weeks": 13, "last_played": 1515620792}, "language": "english", "review": "First VR game I played 4 hours straight. There's so much to create and to do. Worth my money, that's for sure!", "timestamp_created": 1476026558, "timestamp_updated": 1476026558, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.496575", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25945737": {"recommendationid": "25945737", "author": {"steamid": "76561197982869557", "num_games_owned": 256, "num_reviews": 56, "playtime_forever": 31089, "playtime_last_two_weeks": 0, "last_played": 1514002217}, "language": "english", "review": "Best VR social space yet! Like 'rec room' and 'modbox' put together. Create worlds, visit other people's worlds, build anything, ad lights, emitters, and script interactions, and make you own avatar body.\n\nBy far the best VR game I have; I will be going to this every chance I get.\n\nEDIT: I built the world called \"Anywhere\" which is a hub world with portals to other worlds so look me up when you get this game and I can help you out :)", "timestamp_created": 1476014077, "timestamp_updated": 1482567939, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.379143", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25937221": {"recommendationid": "25937221", "author": {"steamid": "76561197973254029", "num_games_owned": 465, "num_reviews": 3, "playtime_forever": 3847, "playtime_last_two_weeks": 0, "last_played": 1500524333}, "language": "english", "review": "This game is janky (in the funnest way) and super great.  It's really.. my dream game right now for VR.  Make anything using primitive shapes, become the things you make by sticking them into yourself, build your own world, teleport to other worlds that people make and talk to people while you do it.  It's wonderful.", "timestamp_created": 1475974140, "timestamp_updated": 1475974140, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25934110": {"recommendationid": "25934110", "author": {"steamid": "76561198070758393", "num_games_owned": 109, "num_reviews": 3, "playtime_forever": 822, "playtime_last_two_weeks": 8, "last_played": 1515200917}, "language": "english", "review": "I've been a Manyland veteran for quite some time now... It's obvious I'd buy Anyland, too.\nI absolutely LOVE Manyland and it's open world, allowing you to create whatever you wish.. It's even helped me create some cool characters!\n\nBut Anyland.. Oh hoh hoh, Anyland...\n\nThis universe is much more complex and fascinating, still something to capture your eye everywhere you go... It's beautiful.\nWhen I bought this, I didn't even HAVE a HTC Vive! I couldn't wait.\n\nAnyland was the MAIN REASON I got/I'm getting a HTC Vive, actually!\nWell done Phil & Scott, my parents lost/'ll lose £750 from it. WORTH. EVERY. PENNY.\n\n\nAnyone who sees this and is questioning whether or not to buy this game, STOP QUESTIONING AND BUY IT.\n\nYou'll thank me...\n\n..And I thank Philipp Lenssen & Scott Lowe.\n\n-Doneydew & Xau", "timestamp_created": 1475961221, "timestamp_updated": 1480233699, "voted_up": true, "votes_up": 4, "votes_funny": 5, "weighted_vote_score": "0.500000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25933200": {"recommendationid": "25933200", "author": {"steamid": "76561197967435709", "num_games_owned": 111, "num_reviews": 5, "playtime_forever": 381, "playtime_last_two_weeks": 0, "last_played": 1477707204}, "language": "english", "review": "This game is sweet.  Create anything you want and even script it.  It is more like a \"Multiplayer Simplified Computer Animation and Modeling Software\".  I wish steam would let me give it more than 1 thumb up.", "timestamp_created": 1475957967, "timestamp_updated": 1475957967, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25927177": {"recommendationid": "25927177", "author": {"steamid": "76561197999021953", "num_games_owned": 206, "num_reviews": 40, "playtime_forever": 1911, "playtime_last_two_weeks": 0, "last_played": 1515008064}, "language": "english", "review": "This game is really cool. You can build anything you want, but the coolest part is seeing other people building, being able to talk with them, and being able to explore what they made. The community is great and it is crazy being able to see people you are talking to as if you are actually there.\n\nIn my first game a guy gave me a gun and took me to his laser tag arena and we played laser tag while ducking and hiding behind these walls he made.", "timestamp_created": 1475939362, "timestamp_updated": 1475939362, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25925783": {"recommendationid": "25925783", "author": {"steamid": "76561198090529902", "num_games_owned": 151, "num_reviews": 12, "playtime_forever": 7987, "playtime_last_two_weeks": 0, "last_played": 1512430589}, "language": "english", "review": "ive been waiting a long to for a game like this thank you sooo much devsa", "timestamp_created": 1475935031, "timestamp_updated": 1475935031, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.533377", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25921005": {"recommendationid": "25921005", "author": {"steamid": "76561198025891973", "num_games_owned": 690, "num_reviews": 47, "playtime_forever": 1825, "playtime_last_two_weeks": 0, "last_played": 1506002286}, "language": "german", "review": "10/10 and endless features!!\nI can do what i want and that with an awesome Community.\nThis is basicly a mix of garrys mod and second life - without paywalls!", "timestamp_created": 1475918623, "timestamp_updated": 1475918623, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.527749", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25919789": {"recommendationid": "25919789", "author": {"steamid": "76561198301541977", "num_games_owned": 464, "num_reviews": 122, "playtime_forever": 241, "playtime_last_two_weeks": 0, "last_played": 1490688204}, "language": "schinese", "review": "非常有趣的一个沙盒类VR应用，看起来简陋，实际上可塑性相当强大，对艺术细胞要求也不高，能做出很多东西。\n\n看大家的测评，游戏时间大多都在几个小时甚至十小时以上，对于一个刚出来的抢先体验版VR应用，相当少见，可想而知的有多耐玩，当然这其中一部分时间是花在了学习操作和探索其他人的房间上。", "timestamp_created": 1475913211, "timestamp_updated": 1475913211, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.561753", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25911470": {"recommendationid": "25911470", "author": {"steamid": "76561197974304359", "num_games_owned": 44, "num_reviews": 16, "playtime_forever": 381, "playtime_last_two_weeks": 0, "last_played": 1481390031}, "language": "english", "review": "Brilliant! Look forward to many hours of exploring this vr world. Also spoke with Phillip whilst in the game, one of the developers! Nice guy, and he gave me a few tips.", "timestamp_created": 1475872969, "timestamp_updated": 1475873093, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.520548", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25911167": {"recommendationid": "25911167", "author": {"steamid": "76561198041521165", "num_games_owned": 89, "num_reviews": 3, "playtime_forever": 8063, "playtime_last_two_weeks": 0, "last_played": 1512759708}, "language": "english", "review": "This is what you've been waiting for.  The creating and editing is well thought out and smooth, once you follow a few simple tutorials, you'll be able to make anything you'd like.  The social aspect is incredible, you can make your own objects and use them as your avatar body, which is really really cool.  This has been one of the best experiences with the Vive so far, i will spend countless hours getting lost in the infinite creativity that this game provides.", "timestamp_created": 1475871905, "timestamp_updated": 1475871905, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.517128", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25910885": {"recommendationid": "25910885", "author": {"steamid": "76561198041026461", "num_games_owned": 145, "num_reviews": 2, "playtime_forever": 852, "playtime_last_two_weeks": 0, "last_played": 1497682039}, "language": "english", "review": "I own about 40 VR games and this is the one that made buying the VIVE worth it. My first session was over 4 hours, I could just not put it down. Throughout creating my own little world, people kept stopping by and sharing creations, swapping tips and tricks, and exploring together. I'm looking forward to updates, but this is already so much fun in it's current state.", "timestamp_created": 1475870984, "timestamp_updated": 1475870984, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.624939", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25910694": {"recommendationid": "25910694", "author": {"steamid": "76561198046735073", "num_games_owned": 273, "num_reviews": 6, "playtime_forever": 2293, "playtime_last_two_weeks": 0, "last_played": 1504566190}, "language": "english", "review": "Why are not more people on this game? Its a very simplistic game but theres hours of building fun and even more messing around with friends or even making new friends. Its a second life style of game but more simplistic.", "timestamp_created": 1475870336, "timestamp_updated": 1475870336, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25899162": {"recommendationid": "25899162", "author": {"steamid": "76561197998478588", "num_games_owned": 416, "num_reviews": 24, "playtime_forever": 1748, "playtime_last_two_weeks": 0, "last_played": 1491971132}, "language": "english", "review": "This is by far my favorite VR game to date and I have a few (100+). I only have one play session so far but to be able to get lost in the game for 4.5 hours and not even scratch the surface is great!", "timestamp_created": 1475827826, "timestamp_updated": 1475827826, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.577465", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25894388": {"recommendationid": "25894388", "author": {"steamid": "76561197989449898", "num_games_owned": 493, "num_reviews": 46, "playtime_forever": 2197, "playtime_last_two_weeks": 0, "last_played": 1506376335}, "language": "english", "review": "Awesome!!!", "timestamp_created": 1475802167, "timestamp_updated": 1475802167, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.444801", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25891798": {"recommendationid": "25891798", "author": {"steamid": "76561198024052381", "num_games_owned": 117, "num_reviews": 10, "playtime_forever": 90, "playtime_last_two_weeks": 0, "last_played": 1477779326}, "language": "english", "review": "Very well thought out creative sandbox chat environment. Easily and extensively customizable from gravity, ambient lighting. I love how virtually any user created item can be an avatar. Colorful and fun!", "timestamp_created": 1475787711, "timestamp_updated": 1475787711, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25890977": {"recommendationid": "25890977", "author": {"steamid": "76561198319563899", "num_games_owned": 101, "num_reviews": 12, "playtime_forever": 741, "playtime_last_two_weeks": 0, "last_played": 1506279484}, "language": "czech", "review": "Konečně možnost tvořit si ve VR svět svoboději - již ne jen z kostek.", "timestamp_created": 1475784024, "timestamp_updated": 1475784024, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25886399": {"recommendationid": "25886399", "author": {"steamid": "76561197983030739", "num_games_owned": 76, "num_reviews": 7, "playtime_forever": 6586, "playtime_last_two_weeks": 0, "last_played": 1502035440}, "language": "english", "review": "Anyland is addictive to say the least. \n\nBut it only becomes addictive with friends joining up, by friends I mean people like YOU and people joining up to play Anyland together. \n\n[b]The good and the bad:[/b]\n\nYou don´t need to have any 3D modeling experience to play in Anyland, once you get a grip on the controllers and their many functions, you´ll be building tons of stuff in minutes - yes minutes - because it doesn´t take long to build stuff, in fact you only use so called mesh primitives to build your houses, games, characters, avatars, chat areas, figures, cars, guns, signs, mountains and whatever you have on your mind to build. \n\nIt may look simplistic at first, but once you realize you can build endless things and combine them into new tings - and do this live with friends watching and building together with you while you mess around, tell a few jokes or so, things soon become hilarious as you laugh at each others avatars and creations. Don´t expect this to be a professional modeling tool, it is NOT a modeling tool. It´s kind of like super-primitive version of Blender and Sketchup that meets Rec-Room + Bigscreen Beta playback (youtube etc.) if you couldn´t modify the models - but with chat added, multiplayer and the possibility to script your own games with those items you created combining primitive objects together.\n\nIf you know the game www.manyland.com, then technically this is a 3D version of that game, but more or less in the beginning stages of its evolution. Expect this game to become at least as polished as Manyland is when the time comes, and also remember - YOU are a part of building the worlds in here, thats half the fun - the rest of the fun is meeting everyone! \n\nThis is an early quickly done review since it´s brand new and just released, I will add another or expand on this one later on. See you in Anyland!\n\n**Update**\n\nThis game is so addictive I may never leave for real life again. Real life is overrated anyway.", "timestamp_created": 1475767743, "timestamp_updated": 1480035668, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.613124", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25884184": {"recommendationid": "25884184", "author": {"steamid": "76561198102289998", "num_games_owned": 96, "num_reviews": 6, "playtime_forever": 493, "playtime_last_two_weeks": 0, "last_played": 1476726885}, "language": "english", "review": "This game is AWESOME! You can make anything what you want : buildings, your own avatar, guns, areas, music instruments,  cinemas where you can look Youtube videos. With your friends that will be very fun game. You can also animate and give sounds to your creations. \"Scripting\" (when you make animations) is very easy and the devs have done it very well.\nI think you can also make some small games, when you are making area. \nGame is worth for the money.", "timestamp_created": 1475757833, "timestamp_updated": 1475757833, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.538631", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39486952": {"recommendationid": "39486952", "author": {"steamid": "76561198256569981", "num_games_owned": 17, "num_reviews": 2, "playtime_forever": 16732, "playtime_last_two_weeks": 1073, "last_played": 1516322739}, "language": "english", "review": "This is a great game where you can create anything if you have determination. I made secondary rings, a body based off the sister manyland, and plenty of other things like whole worlds and smart hubs. If you like sandbox style games, this is a game for you. \nIf you like to explore, this game may be a bit less enjoyable for you, but nevertheless fun. The only downside is if you don't have a VR headset, you can only explore, no creation. (and us VR players see you as peasants)\n\nGUCCI GAME MUST GET", "timestamp_created": 1516464479, "timestamp_updated": 1516464479, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40965589": {"recommendationid": "40965589", "author": {"steamid": "76561198087766280", "num_games_owned": 198, "num_reviews": 2, "playtime_forever": 4342, "playtime_last_two_weeks": 663, "last_played": 1521764235}, "language": "english", "review": "There are a lot of games out there that say you can do anything, but I think this is the only game I've found where you actually can. You can make and do anything you want, it doesn't matter how long it takes to make or how complex it is, you can do A N Y T H I N G. So far this is my most played and favorite vr game, I hope more people start playing this amazing game. \n\n10/10", "timestamp_created": 1521676796, "timestamp_updated": 1521676796, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40932975": {"recommendationid": "40932975", "author": {"steamid": "76561198020314608", "num_games_owned": 261, "num_reviews": 25, "playtime_forever": 23017, "playtime_last_two_weeks": 2191, "last_played": 1521762395}, "language": "english", "review": "This game is just to cool and way to fun to pass up. If you have vr, PLEASE do yourself a favor and come check it out.", "timestamp_created": 1521523652, "timestamp_updated": 1521523652, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40859754": {"recommendationid": "40859754", "author": {"steamid": "76561198168848502", "num_games_owned": 62, "num_reviews": 6, "playtime_forever": 2661, "playtime_last_two_weeks": 1240, "last_played": 1521390148}, "language": "english", "review": "Probably one of the best games I have ever found with an equally as wonderful community and the best dev ever", "timestamp_created": 1521242230, "timestamp_updated": 1521242230, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40727174": {"recommendationid": "40727174", "author": {"steamid": "76561198336555523", "num_games_owned": 35, "num_reviews": 4, "playtime_forever": 861, "playtime_last_two_weeks": 49, "last_played": 1521485689}, "language": "english", "review": "Really Bad game. I have GTX 1080 and I7 with 4x 4.5 ghz. The game is laggy as fuck. Never saw such a bullshit.", "timestamp_created": 1520729720, "timestamp_updated": 1520729720, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476779", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40510505": {"recommendationid": "40510505", "author": {"steamid": "76561198093598957", "num_games_owned": 44, "num_reviews": 5, "playtime_forever": 19958, "playtime_last_two_weeks": 353, "last_played": 1521668466}, "language": "english", "review": "My favorite game in VR so far ! Made so many friends than my real life !!! A MUST HAVE.", "timestamp_created": 1520000811, "timestamp_updated": 1520000811, "voted_up": true, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "40381054": {"recommendationid": "40381054", "author": {"steamid": "76561198008360046", "num_games_owned": 149, "num_reviews": 60, "playtime_forever": 367, "playtime_last_two_weeks": 0, "last_played": 1515537146}, "language": "english", "review": "Amazing game, dead community.", "timestamp_created": 1519546888, "timestamp_updated": 1519546888, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.454545", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "40371354": {"recommendationid": "40371354", "author": {"steamid": "76561198180609107", "num_games_owned": 14, "num_reviews": 4, "playtime_forever": 214, "playtime_last_two_weeks": 173, "last_played": 1521739609}, "language": "english", "review": "The game was fustrating at first, but after I had a little bit of help from the creator himself, I was back and running once again, Tip, if your having some issues building, look at the back of the creation menu and enable snapping, that way it will be on the ground. I sometimes use this because my hands are not very precise and are a little shakey, but blame my 2 disorders. The game is very fun to be in. I have seen very good creations. 10/10!", "timestamp_created": 1519514151, "timestamp_updated": 1521770768, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.415094", "comment_count": "5", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39928585": {"recommendationid": "39928585", "author": {"steamid": "76561197974721811", "num_games_owned": 273, "num_reviews": 2, "playtime_forever": 29902, "playtime_last_two_weeks": 1278, "last_played": 1521759657}, "language": "english", "review": "As people have said, there is a bit of a learning curve, true. But there are plenty of tutorial videos on youtube made by the devs and fellow users, and there's generally always people around who are more than willing to help should you ask. The best advice I can give other than checking it out for  yourself is, don't judge a book by it's cover... but if you insist on doing so, check out the community page and some of the screenshots in there, there's some pretty cool stuff and it's 100% user made.", "timestamp_created": 1518091806, "timestamp_updated": 1518091806, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39827668": {"recommendationid": "39827668", "author": {"steamid": "76561198072296789", "num_games_owned": 850, "num_reviews": 187, "playtime_forever": 68, "playtime_last_two_weeks": 0, "last_played": 1517579070}, "language": "german", "review": "Hi\nDafür das es kostenlos ist echt gut , nur leider verstehe ich nicht das wesendliche was im video auch nicht wirklich erklärt wurde:  wie man bereits gebaute Objecte sich auf sein brett abspeichern kann um es in seiner weld wieder Hinstellt.... also wer das weis bitte melden !\nwäre lieb danke ^^\n\nsonst gebe ich dem hier daum hoch auch wegen den möglichkeiten !", "timestamp_created": 1517696090, "timestamp_updated": 1517696090, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.506505", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39741064": {"recommendationid": "39741064", "author": {"steamid": "76561198151299325", "num_games_owned": 51, "num_reviews": 2, "playtime_forever": 1120, "playtime_last_two_weeks": 0, "last_played": 1517777741}, "language": "english", "review": "love the game guys wish i had more time to play", "timestamp_created": 1517375821, "timestamp_updated": 1517375821, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39695898": {"recommendationid": "39695898", "author": {"steamid": "76561198072669239", "num_games_owned": 60, "num_reviews": 28, "playtime_forever": 499, "playtime_last_two_weeks": 68, "last_played": 1521338489}, "language": "english", "review": "I love exploring people creations but I am really sad I don't have a VR to make my own world", "timestamp_created": 1517185833, "timestamp_updated": 1517185833, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 196, "total_negative": 9, "total_reviews": 205}}
