{"reviews": {"39447493": {"recommendationid": "39447493", "author": {"steamid": "76561198068555915", "num_games_owned": 81, "num_reviews": 3, "playtime_forever": 28, "playtime_last_two_weeks": 28, "last_played": 1516317228}, "language": "english", "review": "Great game/app, well polished, easy to use & you can include your own music to the actual training - it calculates the beat and you train to it. If you want to get moving or if you just want to have fun then don't hesitate to buy this.", "timestamp_created": 1516318326, "timestamp_updated": 1516318326, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39435106": {"recommendationid": "39435106", "author": {"steamid": "76561198003030375", "num_games_owned": 2227, "num_reviews": 338, "playtime_forever": 187, "playtime_last_two_weeks": 187, "last_played": 1516319188}, "language": "english", "review": "BOXVR:\n~~~~~~  \n\nFitness has been a hot topic for as long as I can remember, either keeping bodies in shape or getting them into shape. Let me throw my hat in the ring . . . as a young frog, I used to be super fit, playing soccer at least four times a week (training), plus a full game on the weekend. Then I discovered cooking and fine wines in my mid-twenties, and since then I have accumulated a little bit of fat on my belly. Yeah, I am overweight! This year (2018), I am bringing back my fitness with a daily trip to the gym. Can I fit in some BOXVR as part of my daily routine?\n\nBOXVR is a VR Boxing game where you can take several workout sessions to eliminate as many calories as possible in the comfort of your own home.\n\nFirst, you’ll need to put your height and weight into the system. Then, you’ll be prompted to go to the main menu where you’ll see a board with your statistics on the left, telling you how many workouts you’ve done, how many calories you’ve burnt, and your percentage of hits.  The rest of the board will give you several other workout options and a tutorial. You can select workouts designed by the developers, try to exercise as long as you can with the survive mode, or train with your own favourite soundtracks. \n\nI was really excited the designed workouts. There are 17 available to you, choosing between beginner, power, speed, endurance or super endurance. The workout times vary from 5 to 37 minutes. You also have four locations in which to pursue your training: The New York gym, a graveyard, a dark tunnel and a festive winter holiday place. \n\nThe gameplay is absolutely sublime; balls of different colours will come at you at varying speeds, coordinated with music. Some balls will have an arrow, either on a side or underneath, which indicate from which direction you need to hit them, and with which hand.  So get ready to punch, jab and give your best uppercuts! You will have to block incoming objects, as well as squatting and ducking overhead bars.  The other aspect I like about BOXVR is the leader board, which will definitely push you do a good workout in order to grab the top spot, if that’s your motivation. Plus, hitting a ball with more intensity will get you more points.  Keep up your hitting streak and you’ll earn extra multiplier points.  There’s plenty to challenge you and have a great workout!\n\nPersonally, I find this game very fluid; I tried several workouts, including the endurance, and I was buggered and dripping with sweat by the end of it! The funny part is that my 65 year-old mother gave it a go and thoroughly enjoyed the experience. Then my wife hijacked my computer for a little try.  Fifty minutes later, her checks were bright red - we decided to have a session once a day as part of our daily routine. Yes, BOXVR will give you a seriously good workout! You can even set a daily goal of how many calories you wish to burn.\n\nGraphically, the game is fabulous and the soundtrack is really cool and upbeat; you can train with your own music too.  The developers are going to release more workouts, which will be fab!  One thing I would like to see is more locations; maybe in China, for example, hitting dragon heads.\n\nPositives:\n~~~~~~~ \n\n-\tGreat graphics\n-\tGreat soundtrack\n-\tSeveral workout modes (beginner, speed, power, endurance)\n-\tTrain with your own music\n-\tYou’ll burn plenty of calories\n\nNegatives:\n~~~~~~~~ \n\n-\tNo achievements or trading cards as yet\n-\tI’ll love to see more locations with new themes\n\nWant a good workout to burn serious calories? Become a student of Sam and Jonno. I’ll be seeing them daily from now on!\n\n8/10\n\nKey provided by developer/publisher for review purposes. Any opinions expressed are entirely my own!\n\n[url=https://www.zeepond.com/reviews][b]EPIC “THE CPT FROGGY” REVIEWS UP NOW ON ZEEPOND, THE HOME OF THE ALMIGHTY FROG![/b][/url]\n\n[url=http://steamcommunity.com/groups/thecptfroggyclub#curation][b]FOLLOW THE CPT FROGGY CURATOR PAGE HERE[/b][/url]\n\n[url=https://www.youtube.com/channel/UCZchpsMdA2hDYJKZgOPdo_w?view_as=subscriber][b]SUBSCRIBE TO THE CPT FROGGY YOUTUBE CHANNEL[/b][/url]\n", "timestamp_created": 1516278657, "timestamp_updated": 1516278657, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.629110", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "39430901": {"recommendationid": "39430901", "author": {"steamid": "76561198064907064", "num_games_owned": 283, "num_reviews": 18, "playtime_forever": 31, "playtime_last_two_weeks": 31, "last_played": 1516117472}, "language": "english", "review": "[h1]Let us get fit[/h1]\n\n[b]Disclaimer[/b] \nFirst of all I got this product for free from the developer(s), nevertheless I will review it honestly.\n\nMy current room-scale set-up is 1.5x2.5m, and I am not as much affected by motion sickness (anymore).\n\nFurthermore I am no Fitness-Instructor, therefore I cannot professionally judge how effective this method is to get fit.\n\n[b]Overview[/b]\nYou have several modes you can choose from like Survival (you have a number of life's and try to get a high-score), Fitness-program (as told by the Dev's actually created by real Fitness-Instructors) and your own workout (with your own music).\n\nIt is really addictive to play this game but please take the first info-screen you get presented with on start-up seriously and mind your body and not overdo it.\n\nPersonally I love the Workout with my own music on which it creates a challenge automatically.\n\nYou will not only perform different hits on the target (front, side, upper-cut, block) but you also need to evade obstacles coming up by crouching or tilting your body to the side.\n\n[b]Rating[/b]\n9/10 for regular Gamers\n10/10 for those who want to prepare for a 220M$ fight :)\n\n[b]The highlights[/b]\n[list]\n[*] Addictive gameplay\n[*] Many modes to choose from\n[*] Different Sceneries\n[*] Good graphics\n[*] Ability to create workout with your playlist\n[/list]\n\n[b]The lowlights[/b]\n[list]\n[*] Not all features implemented yet (Early Access title)\n[/list]\n\n[b]Multiplayer[/b]\nNo! (EarlyAccess)\nBut you have online Leader-boards\n\n[b]Mods[/b]\nNo! (EarlyAccess)\n\n[b]Motion Sickness[/b]\nSince you are standing in one spot it will not cause any nausea\n\n[b]Microtransactions/DLC[/b]\nNo! (EarlyAccess)\n\n[b]Summary[/b]\nAs I tested this one the first time I could barely stop.\n!!Please do yourself the favour and stop once you feel exhausted, as advised.!!\n\nIt is fun to do this kind of workout for short sessions a day, listening to your favourite music while moving your body is addictive. I am looking forward to how this game develops during the course of the Early Access but it feels like a complete experience already.\n\nSo if you would like to do something similar to a real-workout this might be the game for you and absolutely worth the price.\n\nI might update this review after I got more experience playing it, so stay tuned.\n\n\n[b]Xium as curator[/b]\nPlease check my curator profile to find other reviews and follow if you like:\nhttp://store.steampowered.com/curator/31700185-Swiss-Gaming-Collective-%28VR-Fl/", "timestamp_created": 1516260654, "timestamp_updated": 1516260654, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "39406583": {"recommendationid": "39406583", "author": {"steamid": "76561198354373861", "num_games_owned": 46, "num_reviews": 1, "playtime_forever": 80, "playtime_last_two_weeks": 24, "last_played": 1515967578}, "language": "english", "review": "This game makes working out fun. Hate squats? You will naturally do them without thinking twice when a giant log is flying at your head.", "timestamp_created": 1516168617, "timestamp_updated": 1516168617, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "39404920": {"recommendationid": "39404920", "author": {"steamid": "76561198073125915", "num_games_owned": 121, "num_reviews": 5, "playtime_forever": 44, "playtime_last_two_weeks": 32, "last_played": 1516160498}, "language": "english", "review": "This game is brilliant!  Honestly.  Just did one of the Power workouts, scored in the top 100 :)  Kept playing after for like 15 minutes and was having sooo much fun!  Sweat a bucket load, but this one game I will play constantly.  And I highly recommend if you need cardio in your life!  If in the future they connect with Spotify or something and you can connect the bpm's.... would be awesome", "timestamp_created": 1516160799, "timestamp_updated": 1516160799, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39391823": {"recommendationid": "39391823", "author": {"steamid": "76561198052145756", "num_games_owned": 9, "num_reviews": 1, "playtime_forever": 477, "playtime_last_two_weeks": 477, "last_played": 1516370499}, "language": "english", "review": "Absolutely great", "timestamp_created": 1516115590, "timestamp_updated": 1516115590, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39387007": {"recommendationid": "39387007", "author": {"steamid": "76561198014680926", "num_games_owned": 297, "num_reviews": 1, "playtime_forever": 28, "playtime_last_two_weeks": 28, "last_played": 1516018825}, "language": "romanian", "review": "Excelent!!!", "timestamp_created": 1516100673, "timestamp_updated": 1516100673, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39355557": {"recommendationid": "39355557", "author": {"steamid": "76561198038074697", "num_games_owned": 10, "num_reviews": 3, "playtime_forever": 433, "playtime_last_two_weeks": 151, "last_played": 1516370639}, "language": "koreana", "review": "이 게임의 장점은 너무 많으니 단점을 좀 적겠습니다.\n1. 최적화 문제 - 다른 더 복잡한 게임도 버벅임이 별로 없는데 비해서 고정된 장소에서 풍선만 날아오는 데도 버벅임이 있네요.\n2. 판정문제 -실제 복싱하듯이 주먹을 지르면 판정이 박한데 반해 주먹을 세로로 세우고 찍듯이 치면깔짝깔짝해도 판정이 들어갑니다. 훅도 마찬가지로 실제 훅을 치듯이 하기보다는 고양이 앞발 날리듯 깔짝깔짝해야 판정이 들어갑니다. 실제대로 하면 펀치가 풍선을 뚫고 지나가는 경우가 너무 많아요서바이벌의 경우 실제 복싱처럼하면 2레벨이 최고나 손을 가슴에 모으고 앞에 말한 것처럼 주먹을 세우고 크게 움직이지 않으면 20레벨도 문제 없습니다.\n3. 기록문제 - mp3를 가지고 하는 트레이닝이나 서바이벌 게임을 한시간을 했는데도 실제 운동시간은 0분이네요", "timestamp_created": 1515987058, "timestamp_updated": 1515987058, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39338977": {"recommendationid": "39338977", "author": {"steamid": "76561198153695625", "num_games_owned": 78, "num_reviews": 8, "playtime_forever": 27, "playtime_last_two_weeks": 27, "last_played": 1515955331}, "language": "english", "review": "Great game. For some reason I can't select the tutorial. It needs some stability and controllers improvement. Sometimes the game freeze for 1 or 2 seconds. Also, sometimes I hit the targets but it doesn't count them.", "timestamp_created": 1515938337, "timestamp_updated": 1515955499, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39317832": {"recommendationid": "39317832", "author": {"steamid": "76561198348012973", "num_games_owned": 6, "num_reviews": 1, "playtime_forever": 6, "playtime_last_two_weeks": 6, "last_played": 1515871106}, "language": "english", "review": "Very cool! I was hoping to do the tutorial but it didn't work when I clicked on it from the menu. Did one of the beginner workouts instead. Then I realized that some of the things I was supposed to hit were supposed to be crosses... I'm hoping that once the bug for the tutorial is fixed, it'll clarify my confusion. :)", "timestamp_created": 1515871302, "timestamp_updated": 1515871302, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39309053": {"recommendationid": "39309053", "author": {"steamid": "76561197966734004", "num_games_owned": 369, "num_reviews": 12, "playtime_forever": 113, "playtime_last_two_weeks": 113, "last_played": 1516142280}, "language": "english", "review": "I was expecting to be underwhelmed by this title... and instead, it has now replaced all my other music/exercise apps as my go-to.\n\nThe incluson of uppercut / jump / etc. really sold me on it, and the \"feel\" of the accuracy you need as well as the game's wonderful ability to amp up and down the music (being fair to recovery times)... makes this a real results driver.\n\nAre you totally unfit?  Get this.  In a few weeks, I imagine you'll see results.  I got to meet the London devs in the high-rise on South Bank and those guys were equally as cool.\n\nMy one bugbear was the lack of a friends comparison page (partity with simillar games) and the tactile feedback through my transducer seems to needs  bit of tweaking from their side.  Otherwise, I'm very positive about the whole thing.\n\nhttps://www.youtube.com/watch?v=Wd6LT3gqjgQ\n\nDefinitely deserves a go and I think it will become a staple for you on VR exercise night.  Cheers!", "timestamp_created": 1515850688, "timestamp_updated": 1515850688, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "39267491": {"recommendationid": "39267491", "author": {"steamid": "76561197976313504", "num_games_owned": 760, "num_reviews": 139, "playtime_forever": 52, "playtime_last_two_weeks": 14, "last_played": 1515618759}, "language": "english", "review": "I'm into rhythm games (already own Audioshield and Holodance, and used to play DDR at the arcades), but I specifically bought BoxVR for the workout aspect, which it delivers on.\n\nHolodance is my go-to rhythm game, but the difference is that in Holodance (and Audioshield) you \"catch\" notes, whereas in BoxVR, you need to actively \"hit\" them.\n\nOverall very polished, and even though it still needs some improvement, like not just having circles come at you for different types of hits (left hooks and right hooks are almost identical, for example; blocks aren't differentiated well enough from regular hits) but I didn't have any problem with unregistered hits, which I think has since been fixed from just before (or maybe just after) I bought it.", "timestamp_created": 1515710980, "timestamp_updated": 1515710980, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39196386": {"recommendationid": "39196386", "author": {"steamid": "76561197992297747", "num_games_owned": 47, "num_reviews": 1, "playtime_forever": 391, "playtime_last_two_weeks": 194, "last_played": 1515896469}, "language": "english", "review": "Given that this product is still early access, BoxVR makes it VERY obvious that the game is incompleted at this time. Although it's a great work out when you're in the rhythm,however the faulty hit registration, awkward screen centering, off-beat music and the lack of variety in music really makes it frustrating to want to come back..\n\nThe hit registration is especially bad, as there are no indicators as to where the punch can be drawn to. \n\nThe forced left/right stance change is annoying as well and can really mess up your rhythm and even hurt yourself if you're not used to moving/dodging on your opposite stance.\n\nOverall, I don't think this product is worth the price tag yet. Once they figure out how to synchronise the music properly and fix their hit registration, along with a greater variety of music, I think I might give this a 5/5.. for now, 2/5", "timestamp_created": 1515461532, "timestamp_updated": 1515461532, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.400000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "39177086": {"recommendationid": "39177086", "author": {"steamid": "76561198060312193", "num_games_owned": 37, "num_reviews": 1, "playtime_forever": 418, "playtime_last_two_weeks": 348, "last_played": 1516373953}, "language": "tchinese", "review": "很棒的音樂節奏運動遊戲，可以達到很好的健身效果，不過仍有幾點想建議\n\n1. 自選歌曲選單再每次遊玩結束都會跳到目錄最上層，一直重選目錄有點煩。\n2. 自選歌曲沒有卡路里累加計算，無法直接知道總共消耗了多少熱量。\n3. 歌曲到達尾聲的時候，拳套仍然持續出現。", "timestamp_created": 1515404410, "timestamp_updated": 1515404410, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39169360": {"recommendationid": "39169360", "author": {"steamid": "76561198255181714", "num_games_owned": 58, "num_reviews": 3, "playtime_forever": 258, "playtime_last_two_weeks": 258, "last_played": 1515890167}, "language": "english", "review": "wow just wow", "timestamp_created": 1515374177, "timestamp_updated": 1515374177, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39167243": {"recommendationid": "39167243", "author": {"steamid": "76561197967459214", "num_games_owned": 497, "num_reviews": 25, "playtime_forever": 289, "playtime_last_two_weeks": 93, "last_played": 1515779278}, "language": "english", "review": "This is a superb idea and works really well. It has become part of my main daily exercise routine. The devs are very active and continuously monitor and respond to feedback and ideas, incorporating the better ones on a regular basis. A big thumbs up from me.", "timestamp_created": 1515367185, "timestamp_updated": 1515367185, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39120676": {"recommendationid": "39120676", "author": {"steamid": "76561197994468856", "num_games_owned": 101, "num_reviews": 4, "playtime_forever": 316, "playtime_last_two_weeks": 316, "last_played": 1516300961}, "language": "english", "review": "Genuinely gets you sweaty and your heart rate up (23 minute session, avg 158 HR, 175 peak).  Calorie tracking is roughly on par with what an APP with HR says (give or take 20%). Your headset linear will get sweaty (consider extra liners)\n\nGood fun in its own right and decidely more appealing than going to the gym (been there, done that, never again).  Remains to be seen (new owner) if this manages to keep me coming back.    \n\nThe punch tracking precision (on an oculus w touch) is good but not perfect - sometimes it feels like I got the punch right, but missed anyway, so here's to hoping it's just an early access defect.\n\nBasic stats tracking - could benefit from a session log (so you can compare performance between sessions)", "timestamp_created": 1515251053, "timestamp_updated": 1515251053, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39092487": {"recommendationid": "39092487", "author": {"steamid": "76561197970566253", "num_games_owned": 197, "num_reviews": 2, "playtime_forever": 261, "playtime_last_two_weeks": 24, "last_played": 1515268393}, "language": "english", "review": "This is becoming one of my favorite games of the year VR or non. Really good workout and fun. One of the few forms of exercise I actually find enjoyable. This and The Thrill of the Fight are pretty much must buys for anyone looking to get a VR workout. No cons, worth the full price.", "timestamp_created": 1515177285, "timestamp_updated": 1515177285, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39090626": {"recommendationid": "39090626", "author": {"steamid": "76561198186009928", "num_games_owned": 30, "num_reviews": 1, "playtime_forever": 1529, "playtime_last_two_weeks": 1138, "last_played": 1516287467}, "language": "english", "review": "This is THE BEST workout game I've ever played.  My wife, who never wants to exercise or play any game, gets addicted to this game as well.  I think adding a function to allow us create more than one profile in the game would help if there are more than one person in the family trying to play.", "timestamp_created": 1515173437, "timestamp_updated": 1515173437, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39090101": {"recommendationid": "39090101", "author": {"steamid": "76561197961361063", "num_games_owned": 90, "num_reviews": 6, "playtime_forever": 374, "playtime_last_two_weeks": 149, "last_played": 1515963044}, "language": "english", "review": "Fantastic!!\n\nI wont go into details because tere are many reviews already but suffice to say it's one of the best 'Rythm' games in VR you could play. (IMO)\n\nI tried the BETA branch (5 Jan) and it ruined it for me, made it way to easy so reverted back to the normal vers. I know folks were complaning about the uppercuts being too hard, they just require more practice and better timing. \n\nI'm new to the game and I can hit 95% of them on hard lvl.\n\n\nBeta branch made it possible to hit the Uppercuts with jabs FFS!!\n\nAnyway.\n\n10/10", "timestamp_created": 1515172366, "timestamp_updated": 1515172366, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39073685": {"recommendationid": "39073685", "author": {"steamid": "76561197993240457", "num_games_owned": 239, "num_reviews": 5, "playtime_forever": 213, "playtime_last_two_weeks": 84, "last_played": 1515282705}, "language": "english", "review": "In the 1.7 hours that I've played this game, I've been more frustrated than anything else. The hit detection in this game is way, way off. If I use the beta patch as others have described in the forums, hitting hooks and uppercuts are incredibly difficult to hit consistently, while normal punches are a breeze. On the normal patch, normal punches are impossible to hit and hooks and uppercuts are easier. Either way the game is unplayable for me at the moment. If they can fix their hit detection, this will be a great game. Until you've heard otherwise though, stay away.", "timestamp_created": 1515130226, "timestamp_updated": 1515132905, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1516149164, "developer_response": "Hi Devyn,\n\nWe released an updated hit detection mechanism last Friday. The feedback  from several users has been that it has fixed the experience for them. Please let us know if you see an improvement. \n\nThanks"}, "39069964": {"recommendationid": "39069964", "author": {"steamid": "76561198796793312", "num_games_owned": 8, "num_reviews": 1, "playtime_forever": 93, "playtime_last_two_weeks": 48, "last_played": 1515691415}, "language": "english", "review": "The game was great, but the calorie counter is inaccurate and it takes long to load your own songs, though this could be because I downloaded this game to my hard drive and not the ssd.", "timestamp_created": 1515118512, "timestamp_updated": 1515118512, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39065075": {"recommendationid": "39065075", "author": {"steamid": "76561197967073271", "num_games_owned": 182, "num_reviews": 4, "playtime_forever": 34, "playtime_last_two_weeks": 0, "last_played": 1514997693}, "language": "english", "review": "I got a little bit worried from reading some of the reviews. I thought the tracking would be annoying but I can honestly say that's not the case. I'm not sure what the person was doing who felt they had issues with the tracking, because it's pretty simple: you input your height, weight and then you keep your fists close to body. I also thought it would be kinda easy to just get away with my movement in the sense that it won't register upper cuts etc, but that's not the case either. I suppose the only downside is that you need music on your computer, which is something I haven't had in years. Some integration with either YouTube or Spotify would be cool. I hope that the developers keep this game updated and fresh!\n\nI highly recommend this to anyone who wants to try and get into shape while having some fun in VR. It really makes you sweat and man does my badonkadonk hurt from all the dodging!", "timestamp_created": 1515105324, "timestamp_updated": 1515105324, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39058702": {"recommendationid": "39058702", "author": {"steamid": "76561197992457637", "num_games_owned": 112, "num_reviews": 5, "playtime_forever": 170, "playtime_last_two_weeks": 64, "last_played": 1515434992}, "language": "english", "review": "Best VR workout to date, lots of fun and an active developer!", "timestamp_created": 1515092329, "timestamp_updated": 1515092329, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39054871": {"recommendationid": "39054871", "author": {"steamid": "76561198120729286", "num_games_owned": 121, "num_reviews": 2, "playtime_forever": 24, "playtime_last_two_weeks": 9, "last_played": 1515256550}, "language": "english", "review": "great for training to kill your enemies", "timestamp_created": 1515085170, "timestamp_updated": 1515085170, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525862", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39031358": {"recommendationid": "39031358", "author": {"steamid": "76561197970459072", "num_games_owned": 154, "num_reviews": 21, "playtime_forever": 74, "playtime_last_two_weeks": 55, "last_played": 1515274880}, "language": "english", "review": "This game is amazing. I was having such a good time halfway through the first round I started laughing- it actually feels like dancing. I played until my legs got wobbly. I am glad I found a form of cardio I really enjoy other than cycling- I absolutely hate treadmills and elipticals. Plus you can add your own songs, so I added a whole bunch of rythmic trance music and it never gets old.\n\nThis reminds me of tricking a baby into eating babyfood by pretending it's an airplane. You don't even realize you're working out.", "timestamp_created": 1515026434, "timestamp_updated": 1515026434, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38998284": {"recommendationid": "38998284", "author": {"steamid": "76561198030357529", "num_games_owned": 469, "num_reviews": 25, "playtime_forever": 79, "playtime_last_two_weeks": 24, "last_played": 1516303366}, "language": "english", "review": "this game is different than Audioshield because its all about boxing move and gives good cardio exercise.", "timestamp_created": 1514951971, "timestamp_updated": 1514951971, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38976495": {"recommendationid": "38976495", "author": {"steamid": "76561197990845163", "num_games_owned": 269, "num_reviews": 1, "playtime_forever": 754, "playtime_last_two_weeks": 273, "last_played": 1516305690}, "language": "english", "review": "Great fitness game, and a convenient alternative to running during winter time. \nIt´s fun, i like the music and it´s part of my regular sports activity now.\nEspecially the endurance modes are really worth it.\nIf they would support spotify in the future it would be even more perfect.\nI hope they can make it happen:).", "timestamp_created": 1514905743, "timestamp_updated": 1514922209, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38921558": {"recommendationid": "38921558", "author": {"steamid": "76561198048815443", "num_games_owned": 3128, "num_reviews": 5, "playtime_forever": 297, "playtime_last_two_weeks": 75, "last_played": 1516193192}, "language": "koreana", "review": "따로 헬스장 다닐 필요가 없음...", "timestamp_created": 1514773104, "timestamp_updated": 1514773104, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.571643", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38889107": {"recommendationid": "38889107", "author": {"steamid": "76561197993579918", "num_games_owned": 268, "num_reviews": 5, "playtime_forever": 822, "playtime_last_two_weeks": 364, "last_played": 1516321736}, "language": "english", "review": "Best workout you'll get in VR. Also addictive and fun with the halloween level.", "timestamp_created": 1514697284, "timestamp_updated": 1514697284, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38888706": {"recommendationid": "38888706", "author": {"steamid": "76561198028060797", "num_games_owned": 3, "num_reviews": 1, "playtime_forever": 281, "playtime_last_two_weeks": 33, "last_played": 1515809612}, "language": "english", "review": "Like a mix between DDR and guitar hero, if you are looking for a rhythm game that provides some diversity from just jabbing then this delivers. Definitely recommended on WMR such as the lenovo explorer. Training with own songs is an awesome addition as well. Hoping there will be more training enviornments and a training schedule would be a nice addition so that I don't always go around picking random workouts to do. Definitely recommended.", "timestamp_created": 1514696236, "timestamp_updated": 1514696236, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38872555": {"recommendationid": "38872555", "author": {"steamid": "76561198041926143", "num_games_owned": 145, "num_reviews": 10, "playtime_forever": 138, "playtime_last_two_weeks": 0, "last_played": 1515041827}, "language": "english", "review": "Such a good fitness app. It’s replaced my boring fitness routine. I’d love vive tracker foot support so I can kick targets too!  Also, a setting to make the gloves feel more realistic to my hands would be great. Thrill of the fight does this well.  BoxVR makes me feel like I’m poking with gloves on an imaginary stick vs wearing gloves.", "timestamp_created": 1514661496, "timestamp_updated": 1514661496, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38846317": {"recommendationid": "38846317", "author": {"steamid": "76561197965920625", "num_games_owned": 98, "num_reviews": 10, "playtime_forever": 391, "playtime_last_two_weeks": 137, "last_played": 1515499464}, "language": "koreana", "review": "펀치 뿐 아니라 스쿼트, 닷지 등을 통해 하체도 함께 운동시켜주는 게임.\n정해진 Work out 갯수가 많지 않아서 단조롭다고 볼수도 있겠으나\n\n음악 파일을 선택하면 알아서 비트를 따 펀치 노트를 만들어줘서 편하다.\n다만 가장 어려운 Hard 난이도를 선택해도 사람에 따라 만족하지 못할\n가능성이 높다고 본다.\n\n펀치 위치가 일정한 것은 장점일 수도, 단점일 수도 있겠으나\n개인적으로는 장점이라 보고 있으며 아쉬운 점은 간혹 펀치 판정이\n[특히 어퍼컷에 대해] 너무 야박한 경우가 있어 맥빠지곤 한다는 것이다.\n\n전반적으로 추천하는 제품이다.", "timestamp_created": 1514609496, "timestamp_updated": 1514609730, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38833122": {"recommendationid": "38833122", "author": {"steamid": "76561197996627654", "num_games_owned": 139, "num_reviews": 11, "playtime_forever": 97, "playtime_last_two_weeks": 61, "last_played": 1515943965}, "language": "english", "review": "Played for like 15 minutes and its instantly amazing!  This is a must-have for anyone who has VR and wants exercise, or enjoys music games, period.", "timestamp_created": 1514579506, "timestamp_updated": 1514579506, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "38805685": {"recommendationid": "38805685", "author": {"steamid": "76561198261326172", "num_games_owned": 18, "num_reviews": 1, "playtime_forever": 1495, "playtime_last_two_weeks": 1003, "last_played": 1516314079}, "language": "english", "review": "Wow, A lot of fun and such a workout.  Great Cardio.\n\nI wish that we could save profiles.   My wife and I need to change settings for height and weight all the time.   Plus I would like to save Play lists rather than have to pick them each time after my wife has been on there.\n\nLooking forward to more, and hope that hand and feet sensors are on the roadmap for more added goodness.", "timestamp_created": 1514521330, "timestamp_updated": 1514521330, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38796823": {"recommendationid": "38796823", "author": {"steamid": "76561198063697990", "num_games_owned": 65, "num_reviews": 1, "playtime_forever": 75, "playtime_last_two_weeks": 8, "last_played": 1515191105}, "language": "english", "review": "I have a lot of games on Steam.  I’ve never felt a need to write a review for any of them but I absolutely had to write one for this game.  I think this is the first time I’ve had this much fun exercising!  I have a wii and PlayStation Move which were fun but adding VR takes it to a whole new level!  I would like to see more environments.  I think the spooky environment is my favorite so far.  Maybe I’m missing it but I would like to be able to add other family members instead of them using my profile.  I can definitely see myself using this regularly and for that I thank the developers for making a game that an out of shape mother of 2 can really enjoy!", "timestamp_created": 1514499129, "timestamp_updated": 1514499129, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38787520": {"recommendationid": "38787520", "author": {"steamid": "76561197971554985", "num_games_owned": 402, "num_reviews": 1, "playtime_forever": 254, "playtime_last_two_weeks": 100, "last_played": 1515605460}, "language": "english", "review": "The devs were kind enough to gift me a copy of this game for free and I am really thankful for it. \n\nNow for the review, this game really works at getting your heart pumping. In fact so well that I started to wear a sweatband on my head when playing so that I dont get the vr headset foam all sweaty after a session.\n\nThe game has a few premade workouts in various categories all ranging in length and intensity, but for me the real star of the game is the endless mode where you try to survive as long as possible and playing to your own music in the game. Just dont make a mistake like me and put too many songs on the playlist because if you dont finish it wont save your score and stats.\n\nThe best part of the game is how fast it seems to make the time go by while playing; before you know it 30 mins have gone by but it only seems like 5 or 10. Its also incredibly rewarding when playing on harder difficulties and big strings of all the types of punches get mixed together with blocking and you just get totally overwhelmed, but after a little time playing you just \"get into the zone\" and are able to hit the patterns without even thinking about it.\n\n", "timestamp_created": 1514481482, "timestamp_updated": 1514481482, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "38742090": {"recommendationid": "38742090", "author": {"steamid": "76561198258478154", "num_games_owned": 74, "num_reviews": 9, "playtime_forever": 157, "playtime_last_two_weeks": 18, "last_played": 1515693459}, "language": "german", "review": "Ein wirklich gutes Spiel!\nErst dankt man, das kann nicht anstrengend sein, nach 3 min wird einem dann aber doch ganz schön warm!\nFür dieses Spiel macht das 2. Ersatzpolster der Vive Sinn :)!", "timestamp_created": 1514388469, "timestamp_updated": 1514388469, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38732491": {"recommendationid": "38732491", "author": {"steamid": "76561198066805759", "num_games_owned": 47, "num_reviews": 2, "playtime_forever": 258, "playtime_last_two_weeks": 0, "last_played": 1514756697}, "language": "english", "review": "Its a great game that really challenge you body. Easy to learn and extremely fun. Now if all fat kids in school had access to this i think we would see some serious drop i kgs. \n\nThe only thing I miss is to have a setting where you can see all arrows. Sometimes you dont want to think, just hit, and then I find myself missing balls because i hit with the wrong hand. Was it green right, was it gren left? Yeah, id like to have the option or mode that removes that.", "timestamp_created": 1514370487, "timestamp_updated": 1514370487, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38718655": {"recommendationid": "38718655", "author": {"steamid": "76561197984164283", "num_games_owned": 161, "num_reviews": 3, "playtime_forever": 414, "playtime_last_two_weeks": 48, "last_played": 1515898689}, "language": "english", "review": "If you are looking for a good vr excercise experience, BOXVR is one of the best on the market. BOXVR has completly changed my entire perspective on vr and now I am primarily using it to get a good workout in since I am so busy with school. I really look forward to what they add over the early access experience, but what is there now is completely worth the price.", "timestamp_created": 1514336375, "timestamp_updated": 1514336375, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38716501": {"recommendationid": "38716501", "author": {"steamid": "76561197968852463", "num_games_owned": 346, "num_reviews": 3, "playtime_forever": 64, "playtime_last_two_weeks": 0, "last_played": 1514744283}, "language": "english", "review": "This game is great !! Plays awesome on Oculus RIFT !!!\nI wanted to purchase a fitness game to go along with my new Fitbit; this is the game right here.  It's quick, intense, good music and most importantly FUN !!  I've tried other \"fitness\" games, but none are as fun as BOXVR\n\nI plan on playing this 15 or so minutes a day for my quick workouts.  Highly recommended !!", "timestamp_created": 1514331308, "timestamp_updated": 1514331349, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38711207": {"recommendationid": "38711207", "author": {"steamid": "76561198026038239", "num_games_owned": 25, "num_reviews": 5, "playtime_forever": 227, "playtime_last_two_weeks": 32, "last_played": 1516135027}, "language": "english", "review": "I know my playtime is low but thats only because I pulled a leg muscle trying to squat in endurance mode and now it hurts to walk. \n\n\n10/10 would pull my leg muscle again", "timestamp_created": 1514320955, "timestamp_updated": 1514320955, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38676527": {"recommendationid": "38676527", "author": {"steamid": "76561197998244318", "num_games_owned": 485, "num_reviews": 2, "playtime_forever": 283, "playtime_last_two_weeks": 123, "last_played": 1516235372}, "language": "english", "review": "I wish there was a \"lukewarm\" option because I don't strongly dislike this game, but in the current state I certainly can't say I like it. I want to say first up that spent some time on the forums and I think the devs are top notch. I have little doubt that this game will be worth purchasing down the road because the devs seem to be very active in the community and I think they're really working hard to make the game better. \n\nThat said, in the current form I find this game a lot more frustrating than fun. The biggest reason is that the hit detection is extremely poor in my experience. While it's possible that there's some issue with my setup (3 sensor Rift), I've had no issues with any other games. Maybe I just suck, but it's very difficult to tell what the source of the issue is because there is no feedback to allow you to improve. I see that this is listed as one of the dev goals; if properly implemented that could go a long way in improving the game. \n\nIt still stands that right now, a frustrating number of jab and cross orbs simply go right through your boxing glove. After a bunch of experimentation I found that using slow, swiping gestures resulted in the best game performance, but it doesn't result in much of a workout and it also doesn't feel very satisfying. Oddly I had no problems with the uppercuts or hooks -when I missed I felt like it was my own fault. The dodge and duck mechanics go totally the other way, being so absurdly forgiving that a slight dip of a few inches is enough to clear the obstacle. \n\nSo basically I can either try to punch hard and fast and have 80% of the orbs go right through my gloves, or do easy swipes and lazy dodges and get a pretty good score. \n\nThe other problem I have with the game isn't really early access related, and may be more of a long term problem. Compared to other workout games I've played (thinking mainly of Soundboxing and Holopoint here), BoxVR is just kind of boring. While the variety of punch types is awesome and the uppercuts and hooks feel great, still the punches all land at the same place and other than changing your stance a few times during a song and doing a few very forgiving squats you're not really moving around much. Also, compared to other rhythm VR games, even the fastest workout speeds are pretty slow.  \n\nThe end result to me is that it feels like you're doing a somewhat enjoyable but bland workout while wearing a headset. Soundboxing (with a decent beatmap) is a total blast of a game which just incidentally results in an amazing workout – you're using the whole width and height of your room and punching at a frantic rate. Holopoint as well feels so much more dynamic than just standing in the center of your room looking forward, punching at the same height and doing the odd half-assed squat. \n\nPros: Great devs - Punch types and inclusion of dodges add variety \n\nCons: Poor hit detection – Little spatial movement – Bland workouts – Little musical variety – Comparatively ineffective workout – Inaccurate calorie counter\n\nSummary – If this was the only VR workout game in existence, I would recommend it. As it is, there are multiple options that are better workouts, more fun and cheaper.", "timestamp_created": 1514244292, "timestamp_updated": 1514244292, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.571057", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38655494": {"recommendationid": "38655494", "author": {"steamid": "76561197978886249", "num_games_owned": 632, "num_reviews": 11, "playtime_forever": 132, "playtime_last_two_weeks": 0, "last_played": 1514651822}, "language": "japanese", "review": "　シンプルに表現するならば、良く出来たボクシングタイプのVRエクササイズタイトルである。\n　ボクシングは詳しくないので、表現が間違っていたら申し訳ないが、飛んでくるオーブとバーに対して、左右のストレート、フック、アッパーと、ウェービング、ダッキングを行ってプレイする。\n　何種類か用意されているコースを選択してプレイでき、譜面にもよるだろうがかなりの汗をかける。\n　そして、何と言っても自分で用意したサウンドファイルにも対応できる上に、曲を分析してある程度リズムに合った譜面を生み出してくれるので、自分で用意した曲でもリズムに乗せてくれる点が特に素晴らしい(その代償として自分で用意した曲の場合、一曲登録毎にある程度の分析待機時間が必要となる)。\n　VRエクササイズタイトルとして、個人的にオススメできる作品である。", "timestamp_created": 1514203290, "timestamp_updated": 1514203290, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.565217", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38644590": {"recommendationid": "38644590", "author": {"steamid": "76561198041516844", "num_games_owned": 311, "num_reviews": 7, "playtime_forever": 80, "playtime_last_two_weeks": 8, "last_played": 1515311959}, "language": "english", "review": "You must buy this. An amazing workout game. I played for an hour straight, the moment I started playing I was hooked.\nThe work outs they have set up are well spaced out between short warm ups to long hard work outs. Work at your own pace with different difficulties. They added the ability to play to your own music. I can not wait to see where this games goes. This game may not have the best graphics and some songs I uploaded didnt match the tempo that I was punching but set those small things aside and its worth the purchase. There is a learning curve, you have to be ontop of those balls as they fly to you or else youll swing too early or too late. Keep hitting strong and youll burn fat in no time.", "timestamp_created": 1514174045, "timestamp_updated": 1514174045, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38640575": {"recommendationid": "38640575", "author": {"steamid": "76561198304364124", "num_games_owned": 10, "num_reviews": 3, "playtime_forever": 124, "playtime_last_two_weeks": 60, "last_played": 1516250106}, "language": "english", "review": "A true early access game. Pretty barebones and weak on the graphics, BUT I will still recommend it. As someone who hates cardio, and at the same time does moderate weight lifting daily, the game has me sweating like a pig whenever I play it. It also gives a shoulder workout.\n\nWhat I would love to see in the game:\n1) More tracks\n2) Better environments\n3) Better way to select your own music. My library is currently on a different drive, and I couldn't figure out how to navigate to it.\n4) I use Rift, and when I make a fist, the gloves don't really show any visual feedback. Would be nice to have it.\n5) Improved visuals\n\nThe game also always tries to start with some parameters and steam keep prompting me if I want to allow it. This isn't visible when starting the game in your headset, so at first I thought the game just wasnt' working for me. It also got flagged by Avast antivirus and it deleted the executable. I had to add it as an exception to be able to play. I've never seen this before, very strange.", "timestamp_created": 1514160797, "timestamp_updated": 1514160797, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38638109": {"recommendationid": "38638109", "author": {"steamid": "76561198202124958", "num_games_owned": 190, "num_reviews": 10, "playtime_forever": 289, "playtime_last_two_weeks": 136, "last_played": 1516131541}, "language": "english", "review": "It does what it says it does. What more can you ask? It combines fun with exercise, and of those I've tried it is the best workout, and sound game. This is the kind of thing vr needs to be used for!", "timestamp_created": 1514153747, "timestamp_updated": 1514153747, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "38618851": {"recommendationid": "38618851", "author": {"steamid": "76561198280728131", "num_games_owned": 48, "num_reviews": 4, "playtime_forever": 1356, "playtime_last_two_weeks": 54, "last_played": 1516027102}, "language": "koreana", "review": "vr을 잘 샀구나 생각하게 만든 게임\n최근 업데이트는 너무 좋았다!\n", "timestamp_created": 1514116358, "timestamp_updated": 1514116358, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38608831": {"recommendationid": "38608831", "author": {"steamid": "76561197987631978", "num_games_owned": 172, "num_reviews": 1, "playtime_forever": 209, "playtime_last_two_weeks": 110, "last_played": 1515798724}, "language": "koreana", "review": "vr 게임중에서 운동효과는 최고임 재밌고 매우 잘만들어진 게임", "timestamp_created": 1514095687, "timestamp_updated": 1514095687, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38575546": {"recommendationid": "38575546", "author": {"steamid": "76561198191117025", "num_games_owned": 26, "num_reviews": 5, "playtime_forever": 511, "playtime_last_two_weeks": 202, "last_played": 1516035069}, "language": "koreana", "review": "진짜 좋은 게임 같습니다. 지칠때까지 지루하지도 않고 운동효과도 좋은데다가 자신이 원하는 음악을 들으며 그 음악에 맞추어 요소들이 뭉쳐진 트랙이 하나 나오죠. 정말 마음에 듭니다.", "timestamp_created": 1514032064, "timestamp_updated": 1514032064, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38521709": {"recommendationid": "38521709", "author": {"steamid": "76561197966093130", "num_games_owned": 158, "num_reviews": 12, "playtime_forever": 381, "playtime_last_two_weeks": 0, "last_played": 1515135098}, "language": "english", "review": "Currently the best fitness VR app.", "timestamp_created": 1513929294, "timestamp_updated": 1513929294, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38516618": {"recommendationid": "38516618", "author": {"steamid": "76561198006690931", "num_games_owned": 89, "num_reviews": 40, "playtime_forever": 251, "playtime_last_two_weeks": 91, "last_played": 1515637131}, "language": "english", "review": "I really enjoy this game.\n\nThe beat mapping works pretty well in terms of tempo of your songs and on some of them it really is in tune with the rhythm. It's impressive since I really love hip hop and I wouldn't consider Migos, Kanye West, Gucci Mane, and other rappers like that to be the main music that Vive/Rift owners listen to. So the other alternative Soundboxing may not have the songs I like mapped out to box to (I haven't tried it because I typically see pop music or EDM in the gameplay and I don't like that type of music at all). Well in BoxVR I don't need to worry about it.\n\nBoxVR has it's own algorithm that maps out your beats like Audioshield. Audioshield is enjoyable, but doesn't quite have the same effect as BoxVR since I really enjoying punching more than moving my hands around with the shields. Not to diss either game since I think they are both great, and I own both of them.\n\nAnyways, this is a good game for a quick work out or to just punch dance your rage out to your favorite songs! I really am glad I purchased this. From a 25 minute session I already am sore the next day in my shoulders and from the squats, not a ton, but I work in a cubicle and am not too active so it's actually a fun way for me to get some light cardio workout while listening to songs I enjoy!\n\nGreat work devs! Can't wait for more content and updates!", "timestamp_created": 1513918252, "timestamp_updated": 1514578928, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.614035", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38515527": {"recommendationid": "38515527", "author": {"steamid": "76561198001480579", "num_games_owned": 89, "num_reviews": 1, "playtime_forever": 175, "playtime_last_two_weeks": 0, "last_played": 1514407341}, "language": "english", "review": "This game is extremely fun. Bought it on the Christmas sale and I definitely feel like I spent my money well on this so far.\n\nPros:\n- Lots of fun\n- Great workout for arms and even legs with the duck/dodge.\n- Decent music if you like House/techno/dub music although they obviously are indie dev so don't have big label names for music.\n\nCons:\n- Still a bit glitchy, can't recentre myself.\n- Height is misleading - thought it was my height but really it is height of incoming balls/objects to hit.\n- Still needs more content and can't wait for more content to come in.\n- Jumping part seems a bit weird, no one can jump that high.\n\nRecommendations:\nCustom user made levels that can be downloaded from steam work shop would be awesome. Fix some of the small bigs that can be annoying. Sometimes hitting incoming objects doesn't seem correct. Fix adjustment of centre so it works for Windows MR.", "timestamp_created": 1513915848, "timestamp_updated": 1513915848, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38513022": {"recommendationid": "38513022", "author": {"steamid": "76561198134296746", "num_games_owned": 142, "num_reviews": 3, "playtime_forever": 167, "playtime_last_two_weeks": 45, "last_played": 1515622917}, "language": "english", "review": "It's simple. \nThis is the best music vr game that I have played", "timestamp_created": 1513909961, "timestamp_updated": 1513909961, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38512878": {"recommendationid": "38512878", "author": {"steamid": "76561198383825387", "num_games_owned": 1, "num_reviews": 1, "playtime_forever": 135, "playtime_last_two_weeks": 0, "last_played": 1514293461}, "language": "schinese", "review": "作为一个中国玩家、活了三十几年,买的第一个游戏,所以请给力\n游戏还不错,歌再多点\nAs a Chinese game player, live more than 30 years, the first game to buy, so please awesome \nThe game is good and the song is a bit more", "timestamp_created": 1513909655, "timestamp_updated": 1513909655, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.472441", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38504725": {"recommendationid": "38504725", "author": {"steamid": "76561198376820898", "num_games_owned": 229, "num_reviews": 33, "playtime_forever": 78, "playtime_last_two_weeks": 10, "last_played": 1515859225}, "language": "english", "review": "Wow, This is Way Better than I Expected! This is Very Well Made! I Feel Like I am Training for a Fight! Magnificent!\n \nThings I Like:\n- The Graphics are Beautiful! Crisp & Clear\n- The Music is Awesome! Note: Goes Very Well with what you're doing also I noticed you can add your own Music! Awesome!~\n- The Game... better said, This Fitness Program is Very Well Made!\n   Note: You Really do get a Work Out! \n  ''They Knew what they were doing when they made this...''\n- It Made Working Out A Very Fun thing to do...I will Work Out! More Often Now! For Sure!\n- Price! \n   Note: I bought it while it ''On Sale'' But, After Trying it Out! I Would Pay Full Price! It Really is that Good! \n\nThings I Disliked:\n- I Really Don't Have ''Any'' This is a Very Well Made Program! \n\nOverall: \n  I just Try'd it out for the First Time! and After doing the Tutorial and playing 3 sessions I am actually pretty Tired! \n What Blown me away was the Feeling I get while Working Out in this Program I Feel like I am Training for a Fight! \nThe Layout feels Professional like you Hired your Own Personnal Trainier and You Transform your VR Space in to a VR GYM! I Suggest and Recommend you pick this up for your Fitness Needs... ''Cancel your Gym Membership'' & Save your Money! This Fitness Program is Magnificent! I Will Be Coming Back to this Alot! So Therefore, I Feel it is Worth The Money Spent! \n    \n", "timestamp_created": 1513891672, "timestamp_updated": 1513891672, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.573944", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38495259": {"recommendationid": "38495259", "author": {"steamid": "76561197973243135", "num_games_owned": 150, "num_reviews": 1, "playtime_forever": 645, "playtime_last_two_weeks": 86, "last_played": 1516295330}, "language": "english", "review": "BoxVR has quickly become my favorite VR \"game\". \n\nI've put \"game\" in quotes, because BoxVR is really a VR workout, and not a \"game\". While there are game-like aspects (e.g. high score list, etc.), it's emphasis is on giving you a great cardio workout. And it does that.\n\nBut, that's not to say that it isn't fun. It is fun. There is something incredibly satisfying about hitting the targets and seeing them burst into a spray of neon color. Getting into a good rhythm and powering my way through the routines gives me an incredible rush of positive energy.\n\nAs for the quality of the workout, you'll find that you get out of it what you put in. Some knowledge of actual boxing (or martial arts) is probably required to really enjoy this and get the most out of it. You don't need to be Sugar Ray Leonard, but If you don't already know how to throw a proper punch, BoxVR may not appeal to you. As of this writing, BoxVR doesn't teach you how to box or throw  punches. The short tutorial is helpful, but it won't serve to teach a complete beginner.\n\nOne criticism of the current state of BoxVR is that the \"calorie\" counter is ... aspirational, at best. By which I mean that if you put 100% effort and proper form and power into each punch, then the calories displayed in the game may be somewhat accurate. It's possible, however, to do the routines \"lightly\" and simply touch the targets and still get points. In that case, you will not be burning anywhere near the number of calories displayed. The displayed calories are therefore misleading, and I wish the developers would be even more clear that the calorie count is a rough estimate of an optimal workout and not an accurate measure of what you personally are achieving in a given workout (they do have a blanket statement to that effect in the fine print at the start of the game).\n\nAs I write this, BoxVR is still in early access, and there are regular updates coming from the developers as they add new features and make changes. I've found a few hiccups in the game: some odd behavior and a glitch here and there. That said, the developers appear (at the time of this writing) to be very responsive and seem to care about making their product better.\n\nIf you have some experience with boxing (or cardio boxing, or martial arts, or what have you) and are looking for a fun workout, then you could do far worse that give BoxVR at try.\n\n\n", "timestamp_created": 1513873562, "timestamp_updated": 1513873562, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.531915", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38468017": {"recommendationid": "38468017", "author": {"steamid": "76561197987797023", "num_games_owned": 1522, "num_reviews": 5, "playtime_forever": 136, "playtime_last_two_weeks": 15, "last_played": 1515886575}, "language": "english", "review": "I was looking for a more active workout compared to Audioshield which has been my go to for a while, but I never felt like it was really doing anything.\n\nI've done a few 15 minute sessions of this so far, and I really can only make it 15 minutes in my current shape.\n\nIt feels like a great cardio workout, and while the calorie burn counts are probably exaggerated, my muscles the next day definitely felt the burn.\n\nDefinitely a good choice for a VR workout, though I don't think it lends itself as well to just playing music as games devoted to that like Audioshield and Holodance.", "timestamp_created": 1513805220, "timestamp_updated": 1513805220, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38435149": {"recommendationid": "38435149", "author": {"steamid": "76561198345667092", "num_games_owned": 29, "num_reviews": 18, "playtime_forever": 75, "playtime_last_two_weeks": 11, "last_played": 1515562280}, "language": "english", "review": "So, I love rhytm games and I love the workout you get from them. I've only put in a short session so far, and let me tell you, this thing is designed to kick your ass as gradually as possible. I highly recommend this game. There's a neat calorie burn count, and the game is highly intuitive. There's basically an instruction on screen for everything you need to do. It's obvious that working out was the main goal here. The built in tracks are pretty good, too! Really fun to punch and duck to these tracks. I can't wait to try some of my own music and see how that all syncs up. \n\nBoxing glove tracking can be a bit of a pain, but you can adjust this in the menu. There are times I swear I hit the orbs, but it clocked as a miss. I'm still new to the game, so it's very likely me being a noob. Height and weight measurements are taken at the start of the game, which is great because it feels like the workouts are really personalized that way. \n\nThis will work your arms, chest, legs, core, and plenty of cardio. Maybe more, but I haven't gotten that far yet. I would be playing more right now if I wasn't so damn tired lol.", "timestamp_created": 1513706118, "timestamp_updated": 1513706118, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38380753": {"recommendationid": "38380753", "author": {"steamid": "76561198008067028", "num_games_owned": 468, "num_reviews": 118, "playtime_forever": 678, "playtime_last_two_weeks": 201, "last_played": 1516296235}, "language": "german", "review": "Audioshield als schweißtreibender Boxsport. Momentan noch Early Access/Beta aber das Hauptgameplay funktioniert: Bälle weghauen, sich ducken und schwitzen. \n\nEntweder mit eigener Musik mögliche - dann allerdings keine Kalorienanzeige\noder\nvon Trainern erstellte Workout mit spartanischem Kalorien zählen\nMomentan wird einfach hochgerechnet, es gibt keine Berechnung wie viel man wirklich \"verbraucht\" hat.\n\nDennoch im Sale zu empfehlen.", "timestamp_created": 1513528599, "timestamp_updated": 1513528599, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38377365": {"recommendationid": "38377365", "author": {"steamid": "76561198040976033", "num_games_owned": 339, "num_reviews": 11, "playtime_forever": 898, "playtime_last_two_weeks": 417, "last_played": 1516149623}, "language": "english", "review": "Over the last couple of years, I have lost over 75 pounds by eating right and excersicing. Over the last couple of months I've gotten a bit lazy and unmotivated. While I still do some cardio a few times a week, I'm just not motivated to go down to the basement; I think all that is about to change. I just tried out BOXVR and man, it was a great workout! This is going to be part of my daily routine! I'll most likely start and end my day with this! Great job FitXR!", "timestamp_created": 1513519277, "timestamp_updated": 1513519277, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.538462", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38356518": {"recommendationid": "38356518", "author": {"steamid": "76561198027752986", "num_games_owned": 248, "num_reviews": 68, "playtime_forever": 40, "playtime_last_two_weeks": 0, "last_played": 1514154419}, "language": "english", "review": "Really good!", "timestamp_created": 1513447657, "timestamp_updated": 1513447657, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.491870", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38335285": {"recommendationid": "38335285", "author": {"steamid": "76561198309713233", "num_games_owned": 98, "num_reviews": 7, "playtime_forever": 359, "playtime_last_two_weeks": 25, "last_played": 1515288536}, "language": "english", "review": "38 minutes of play through the most difficult short levels: 329 active calories (according to my watch). Heartrate average: 133 BPM. \n\nAwesome workout game. Super polished. Only issue I have (big one for a fitness game) is that there aren't any super-intense workouts. There are definitely some intense/inspired choreography in some songs, but they don't last very long. \n\nWould be great to include some 15-20 minute HIIT workouts that go between moderate to insanity; fast combos, loads of squats and dodges. Even jumps would be great. \n\nCan easily see this being the standard for VR workouts when it caters to all fitness levels -- not just beginners/intermediate.", "timestamp_created": 1513375565, "timestamp_updated": 1513375565, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38312661": {"recommendationid": "38312661", "author": {"steamid": "76561198047652816", "num_games_owned": 49, "num_reviews": 7, "playtime_forever": 1490, "playtime_last_two_weeks": 0, "last_played": 1514121135}, "language": "english", "review": "This is a great piece of software. \n  Im kinda getting old :) 50, its been at least 20 years since i stepped into a dojo or ring. Im about 10 kilos overweight smoke and have been sitting on my arse playing video games for 2 decades +.\n I absolutly love this. Vr has been good for me as far as getting me of my butt and this game makes it even better as it gets me moving, sweating even...alot :P .\n Hit boxs seem very accurate and if you try to keep proper form you get a good cardio workout. \n If playing games for a little fitness is your goal you should play this. It wont turn you into Ali but it will help eye hand co-ordination and general fitness and if you try to keep form i cant see how it wouldnt be good for actual boxers.", "timestamp_created": 1513296518, "timestamp_updated": 1513297283, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38307593": {"recommendationid": "38307593", "author": {"steamid": "76561198001620820", "num_games_owned": 339, "num_reviews": 8, "playtime_forever": 205, "playtime_last_two_weeks": 0, "last_played": 1513391199}, "language": "english", "review": "This game is very well done for EA.  The music is good, locations are nice and it's good exercise.  I can't wait for a finished product.\n\nA few recommendations to the developers if they are watching steam comments:\n1.  Most games I play will force audio to the locus speakers.  The game will play sound out of the system default which in my case are my regular speakers.\n2.  The start screen shows my total calories and everything as a total. Being able to see weekly and especially daily would be useful.  Especially what I've done for the day since I want to setup daily goals.\n\nThank you for a great game, I'm looking forward to additional features.", "timestamp_created": 1513278739, "timestamp_updated": 1513278739, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38299819": {"recommendationid": "38299819", "author": {"steamid": "76561197998413290", "num_games_owned": 123, "num_reviews": 6, "playtime_forever": 780, "playtime_last_two_weeks": 96, "last_played": 1516015879}, "language": "english", "review": "I first really liked this and just thought it was me having a bit bad timing. Then i found out that it's impossible to sync things. Which is rather important in a rythm game, thus i will not recommend this anymore.\n\nDevs: When using rigidbody's Set continous dynamic on one thing and just dynamic on the other object in a collision and do further reading on how you make things not phase through eachother. \n\nSecondly, make sure to check the \"static\" checkbox on each non-movable object. It's weird that the game has tiny lag issues and this is just one of the things that could be the case. I'm on a GTX 1080 TI, Fallout 4 VR didn't lag so neither should this. \n\nKeep on trying to make the gameplay smoother, i have enjoyed this game untill the sync issue got to anoying for me. I just wanna play it without theese issues since everything else is amazingly fun!", "timestamp_created": 1513253391, "timestamp_updated": 1514059456, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38295101": {"recommendationid": "38295101", "author": {"steamid": "76561197970925841", "num_games_owned": 1336, "num_reviews": 2, "playtime_forever": 236, "playtime_last_two_weeks": 86, "last_played": 1516170853}, "language": "english", "review": "Great game, great workout.  Love the recent additions of playing your own songs, and survival mode.  Super fun, and highly recommended if you enjoy boxing as a workout.", "timestamp_created": 1513230424, "timestamp_updated": 1513230424, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38255548": {"recommendationid": "38255548", "author": {"steamid": "76561198038143233", "num_games_owned": 492, "num_reviews": 21, "playtime_forever": 144, "playtime_last_two_weeks": 13, "last_played": 1515333914}, "language": "english", "review": "Of all the VR rhythm games, if you are using VR for fitness then you need this one the most.", "timestamp_created": 1513080994, "timestamp_updated": 1513080994, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38204102": {"recommendationid": "38204102", "author": {"steamid": "76561197992713283", "num_games_owned": 55, "num_reviews": 1, "playtime_forever": 108, "playtime_last_two_weeks": 26, "last_played": 1515250131}, "language": "koreana", "review": "시간과 칼로리에 맞춘 운동량 설정 가능하고 내 폴더의 mp3를 넣어서 좋아하는 곡으로 운동하는 것도 가능합니다. 타격판정이 약간 엄격해서 대충 맞추면 안되고 어느정도 강하게 때려야만 인정되기 때문에 운동효과면에서 상당히 괜찮아요. 사운드복싱과 비교해서\n 이쪽은 더 복싱 느낌에 가깝게 운동할 수 있습니다.", "timestamp_created": 1512895677, "timestamp_updated": 1512904841, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38060224": {"recommendationid": "38060224", "author": {"steamid": "76561198069834146", "num_games_owned": 45, "num_reviews": 13, "playtime_forever": 703, "playtime_last_two_weeks": 21, "last_played": 1515497235}, "language": "english", "review": "Super for a workout, however have some minor bugs. Definitely need more development effort\nEven with that said, it's the best active VR game I have", "timestamp_created": 1512404367, "timestamp_updated": 1512404367, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38023628": {"recommendationid": "38023628", "author": {"steamid": "76561198059896039", "num_games_owned": 175, "num_reviews": 19, "playtime_forever": 191, "playtime_last_two_weeks": 0, "last_played": 1514954514}, "language": "english", "review": "Great workouts!", "timestamp_created": 1512278776, "timestamp_updated": 1512278776, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38005522": {"recommendationid": "38005522", "author": {"steamid": "76561198079076633", "num_games_owned": 140, "num_reviews": 3, "playtime_forever": 131, "playtime_last_two_weeks": 0, "last_played": 1512236420}, "language": "english", "review": "I give it... A solid 3 out of 5. Good, but as it is early access, room for improvement.\n\n1. Straight punches and uppercuts work fine, as does blocking. But hooks... Are BAD. I can consistenly hit everything but hooks, right or left. In fact, when I DO hit them, it's more like I'm doing an awkward sideways uppercut.\n\n2. Constantly resets to my computer's root directory when picking music even if I've just finished a song. Not fun to keep navagating to my music folders every single time I want to change tunes.\n\n3. No Jump in the tutorial or in game. There's a score segment for it, but all I've ever seen is duck and dodge. Though what really surprised me is that this game is VERY good at accommodating for a short height. Woohoo!\n\n4. Beatmapping is good and solid, better than other rhythm games I've played. (though some were free, i'll admit)\n\nAll in all, a pretty sick workout. Gets me pumped and I really do feel the burn.", "timestamp_created": 1512225788, "timestamp_updated": 1512225788, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "37979545": {"recommendationid": "37979545", "author": {"steamid": "76561198010847418", "num_games_owned": 455, "num_reviews": 1, "playtime_forever": 8, "playtime_last_two_weeks": 0, "last_played": 1508340216}, "language": "english", "review": "Hands down one of my favorite VR titles. its a blast working out jamming to your favorite music", "timestamp_created": 1512143524, "timestamp_updated": 1512143524, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.491870", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "37969325": {"recommendationid": "37969325", "author": {"steamid": "76561198297356599", "num_games_owned": 58, "num_reviews": 17, "playtime_forever": 207, "playtime_last_two_weeks": 61, "last_played": 1516076013}, "language": "english", "review": "I only played BoxVR for few short sessions but I'm hooked! I burned a few hundred calories and was sweating bullets by the end of my first session. I discovered you can add your own music to create your own levels and I know this is a game I'll be adding to my daily workout regimen! Such value, such fun! \n\nRating: A+++!\n\nedit: As of 1/2/2018, this game is getting even better! The devs have added additional content including a calorie counter for custom playlists as well as various new UI elements. \n\nAlso, there's a new \"Winter Wonderland\" environment. I did a 6-minute song and burned close to 200 calories, resulting in me sweating bullets. I love this game and highly recommend it!", "timestamp_created": 1512107393, "timestamp_updated": 1514944514, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37913469": {"recommendationid": "37913469", "author": {"steamid": "76561197961230266", "num_games_owned": 329, "num_reviews": 2, "playtime_forever": 171, "playtime_last_two_weeks": 46, "last_played": 1515806186}, "language": "english", "review": "The most fun I've had working out, probably ever!\n\nBeing able to use your own music is awesome and the sets it generates from the music are just as fun as the included music.\n\nIt would be great if it could play Youtube videos much like Audioshield.\nIt would also be great if you could give it a frequency to swap stances to keep your legs more active.\n\nAll in all, really solid first impression!", "timestamp_created": 1511907733, "timestamp_updated": 1511907733, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37885388": {"recommendationid": "37885388", "author": {"steamid": "76561198096412999", "num_games_owned": 270, "num_reviews": 120, "playtime_forever": 21, "playtime_last_two_weeks": 0, "last_played": 1509641162}, "language": "english", "review": "2 Minute Video Review → https://youtu.be/bRGRluMZUwM\n\nUnbreakable VR Runner is cheaper and a lot of fun, it's true.\nBut BOXVR has the most professional feel. After playing this I feel as though I've met with a personal trainer.\nFor a VR workout it's hard to beat.", "timestamp_created": 1511879217, "timestamp_updated": 1511879217, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.486751", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "37880031": {"recommendationid": "37880031", "author": {"steamid": "76561198013812373", "num_games_owned": 1258, "num_reviews": 15, "playtime_forever": 167, "playtime_last_two_weeks": 0, "last_played": 1513182096}, "language": "english", "review": "Who said gaming is an unhealthy hobby? BoxVR is easy to use and lots of fun. The music is great, the variety of moves and punches is just perfect and the different exercises are really nice. If you want to take it slow, there's a workout plan for that but if you want to tackle the 25 minute endurance sessions, go for it! \n\nI don't really like exercising but BoxVR (more than other rhythm/exercise apps) makes it a blast. I could see myself using this three or four times a week, easy. \n\nNow I'll just have to buy a couple of different VR covers because this game is making my VR headset reek of manly boxing sweat!", "timestamp_created": 1511875443, "timestamp_updated": 1511875443, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37825923": {"recommendationid": "37825923", "author": {"steamid": "76561197970143338", "num_games_owned": 312, "num_reviews": 1, "playtime_forever": 19, "playtime_last_two_weeks": 0, "last_played": 1511815495}, "language": "english", "review": "I will say, in this game's favour, it has a LOT of potential. In barely 20 minutes of play I could really feel the strain it put on my chest. I get a sense that the people behind it know what they are doing. Although the calorie counter seems a little... optimistic? Put another way, if I were really burning that many calories I'd have the BMI of a stick insect. (...wistful sigh)\n\nAlso, I am an idiot, so take my feedback with a pinch of salt... this is an Early Access title so there's scope for change, and there's lots of positive reviews as well... etc etc.\n\nThat said, out of the box this game breaks one of the most simple rules of game development: don't needlessly frustrate the user!!\n\nThe premise is to exercise by hitting orbs in particular fashion, but the gameplay is very unrewarding because unless you do precisely what the game wants you to, the orbs phase right through your fists... And what it wants isn't clear! The biggest offenders were hitting the orbs from the sides. Uppercuts seem to work fairly well. \n\nThis is game development 101!!! If I hit the orb... I HIT THE ORB!! Argh. By all means deduct points, or tell me my technique is wrong/isn't hard enough/etc etc... but REGISTER that I hit the orb and give me the feedback through the controller!! Don't phase it through my angry, flailing limbs like I became a ghost for 200 milliseconds. Straight punches work perfectly for instance, even if you lazily extend your fist and wait for the orb to blithely plow into it.\n\nI survived about 20 minutes, with a break in between to test Audioshield and confirm that yes, that is way, WAY better for a workout and a million times less frustrating, and then take my arm weights off to see if them slowing down my punches was causing the hits not to count. But it wasn't! Yep... if you're trying to be like Piccolo from Dragonball Z training with hundreds of pounds of weights on your body, you can keep on doing what you're doing, it isn't affecting your gameplay here, it seems.\n\nI varied the speed, to no avail. I varied the timing, to no avail. I tried adjusting the glove position relative to my controllers to ensure I really hit the orbs squarely on the side (THAT is a cool feature, I like that) but to no avail. Bewildered, I began to question my sanity. I even tried looking at videos of blokes punching things to make sure I even understood what a proper hook was. Do I just not know how to punch stuff in the side? Should I have punched more stuff in the past? Fought more people throughout life? Maybe I could've tried to be angrier as a teenager, I don't know.\n\nAnd then, as I reuminated over my newfound relatively nonviolent regrets of the past, I found the answer. The terrible, awful answer. It seems I have more success \"slapping\" the orbs. \n\nThat's right... punch, duck, punch, uppercut, UNMANLY EFFEMINATE SLAPPING, punch, duck, punch... \n\nIf I didn't feel silly before, I certainly did when I realised that was the only way to *partially* increase the chances of scoring a hit. I mean I don't mind if they do want me to slap dat but they should've said so, don't make it sound all fighty and awesome.\n\nIn short: If you're used to Audioshield, this is not for you. It's VERY frustrating to play. Stick with Audioshield, pick an aggressive song on Elite difficulty, and try not to die by the end of it. If you've never played Audioshield and want to get reaaaally good at slapping things, this game is right up your street.", "timestamp_created": 1511817964, "timestamp_updated": 1511820002, "voted_up": false, "votes_up": 5, "votes_funny": 4, "weighted_vote_score": "0.572519", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37682733": {"recommendationid": "37682733", "author": {"steamid": "76561198009540780", "num_games_owned": 131, "num_reviews": 4, "playtime_forever": 156, "playtime_last_two_weeks": 0, "last_played": 1514309763}, "language": "german", "review": "Ein wirklich Klasse Spiel um ein wenig Sport im Eigenheim zu treiben....nach 30min BoxVR war ich gut am schwitzen und es macht wirklich Spass.\n\nMan kann auch wie bei Audioshield seine eigene Musik abspielen lassen und zum Takt Boxen. Die Original Musik (House) passt aber auch gut dazu.", "timestamp_created": 1511710170, "timestamp_updated": 1511710170, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37544351": {"recommendationid": "37544351", "author": {"steamid": "76561198155953403", "num_games_owned": 45, "num_reviews": 4, "playtime_forever": 1204, "playtime_last_two_weeks": 3, "last_played": 1516041943}, "language": "spanish", "review": "muy bueno para practicar deporte, en este caso boxeo, es muy ameno y divertido, recomentado", "timestamp_created": 1511625022, "timestamp_updated": 1511625022, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37237401": {"recommendationid": "37237401", "author": {"steamid": "76561197972851337", "num_games_owned": 1048, "num_reviews": 51, "playtime_forever": 65, "playtime_last_two_weeks": 0, "last_played": 1511698222}, "language": "english", "review": "For some VR is a means of improving social contact. Others want to feel immersed. Pretend to be a war hero. A cyber ninja. For some it's about weight loss.\n\nWeight loss? Yes, weight loss. See: During VR gameplay you move your body a lot. Wether it's steps or other physical movements, you tend to burn a lot of calories. There is even a case of someone losing more than 50 pounds playing a VR game. So losing weight and VR comes hand-in-hand. But of course these games aren't really focused on cardio.\n\nThat's where BOXVR comes in. \n\nUnlike other games, this game (well, fitness program might be a better fit) has been made with real fitness instructors aboard the advisory train. It's aim? Get your cardio going and shed some weight while you're at it.\n\nThe gameplay is simple. You punch, dodge and block incoming balls to the beat of your own music. \n\nYou hit them straight forward, you do uppercuts and sidejabs. Sometimes you'll have to put your arms up to dodge, sometimes you'll be squatting. It's very simple to pick-up-and-play. But the thing is: You're continously moving. The great thing about BOXVR is that you actually have to throw in some weight with your punches. You don't just touch the balls, no. You need to actually exercise and punch. The squats add to the workout so by the end of a session your whole body will have had some work. \n\nIncoming projectiles are generated based on your own music. That's right, you can load-up your own music straight into the game and it'll use it to custom-tailor a workout to the beats of your own music. You can choose from 3 difficulties: Easy, Medium and Hard. I, personally, recommend hard. It'll keep you moving continously and after 30 minutes I definitely felt a little bit sore in my arms and I was sweating like crazy. A sweatband comes highly recommended. You don't want your foam to soak up your sweet due to hygienic reasons. \n\nDuring a workout the game gives you a score (it's really fun trying to beat your own scores!), the amount of calories burned, time left and your current hit streak. It's simplistic yet: this game requires nothing more than the basic information. Calories burned are taken from calculations based on your height and weight which you input into the game. I kinda feel like the game overshoots a little with how many calories you burn, but that's understandable considering you don't need measurement hardware for the game to function. \n\nOf course, with the game still being in Early Access, there are some bugs here 'n there. For example: I think the calories-burned tracker kinda overshoots a little bit. Sometimes the game won't track burned calories in songs you've loaded in. Everything else functions perfectly. All the punch hits are detected instantly and flawlessly. The graphics are alright, the motions are great and fluid. The UI easy to use. \n\nAll in all: I don't see BOXVR as a game. I see it more as a cardio workout. Want to lose some weight? Go for it. Want to stay in shape/keep your cardio up? Go for it!\n\nI know I'll be throwing that gym membership out the window for sure. ;)", "timestamp_created": 1511484220, "timestamp_updated": 1512260528, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36681113": {"recommendationid": "36681113", "author": {"steamid": "76561198096392601", "num_games_owned": 19, "num_reviews": 4, "playtime_forever": 1710, "playtime_last_two_weeks": 178, "last_played": 1516335265}, "language": "schinese", "review": "Burn, burn, burn.", "timestamp_created": 1511289692, "timestamp_updated": 1511289692, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36603735": {"recommendationid": "36603735", "author": {"steamid": "76561198046109809", "num_games_owned": 264, "num_reviews": 6, "playtime_forever": 1208, "playtime_last_two_weeks": 0, "last_played": 1513453095}, "language": "english", "review": "So, I have to wholeheartedly recommend this, because this is actually going to keep me working out because it's a hell of a lot funner than regular exercise. There's a few things I would like to see improved though:\n\n- The UI has some annoying issues:\n        - if you select, say, the Power 4 training, which you have to move the carousel over for, you can't move it back after you finish the song, it's stuck there until you restart,\n        - if you need to scroll down in the file browser, and you come back after you finish a song, it'll scroll farther every time until you can't select folders in the middle anymore, you have to restart to fix it.\n        - when it's analysing your music, the UI elements don't update to the new track unless you go to another screen and come back\n\n\n- You should be able to select your music folder so you don't have to completely navigate to it everytime, and you should be able to favourite songs so you don't have to navigate to them everytime as well.\n- The beat detection on some songs is pretty terrible. You need songs that have a strong bassline, and don't change tempo.\n- Being able to make custom workout tracks, and upload them to the workshop (like Intralism) would make this game perfect, in my opinion. The beats that are autogenerated don't always match up with the music how you want them to, and they get boring and repetitive after a while.", "timestamp_created": 1511029506, "timestamp_updated": 1511029545, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.552239", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36550741": {"recommendationid": "36550741", "author": {"steamid": "76561198028358390", "num_games_owned": 160, "num_reviews": 18, "playtime_forever": 233, "playtime_last_two_weeks": 0, "last_played": 1512105394}, "language": "english", "review": "Just got my ass kicked by a game. First for everything.\nIf you're looking to lose weight, this game may just change your life.", "timestamp_created": 1510838390, "timestamp_updated": 1510838390, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36547276": {"recommendationid": "36547276", "author": {"steamid": "76561198116319450", "num_games_owned": 183, "num_reviews": 2, "playtime_forever": 1168, "playtime_last_two_weeks": 28, "last_played": 1515929178}, "language": "english", "review": "The game is great! I've been playing every day since I got it! Definitely recommend. Please increase speed by at least 2-3 times. The game is now too easy.", "timestamp_created": 1510822196, "timestamp_updated": 1510822196, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36541035": {"recommendationid": "36541035", "author": {"steamid": "76561197989952569", "num_games_owned": 414, "num_reviews": 16, "playtime_forever": 132, "playtime_last_two_weeks": 0, "last_played": 1511191178}, "language": "english", "review": "Just got this game and already love it! If you're a fan of Audio Shield, and could also use some motivating workout time; this is a great buy at $20.", "timestamp_created": 1510787929, "timestamp_updated": 1510787929, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36286286": {"recommendationid": "36286286", "author": {"steamid": "76561197991066786", "num_games_owned": 157, "num_reviews": 2, "playtime_forever": 74, "playtime_last_two_weeks": 0, "last_played": 1513379719}, "language": "english", "review": "Its a good VR workout. About my only critisms I have, are that there is a lot of repetition in the workouts. It gave me 6 ducking mechanics in a row and the rest periods occur to quickly. But overall a good experience.", "timestamp_created": 1509849007, "timestamp_updated": 1509849007, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36194511": {"recommendationid": "36194511", "author": {"steamid": "76561198001306869", "num_games_owned": 198, "num_reviews": 7, "playtime_forever": 112, "playtime_last_two_weeks": 0, "last_played": 1509978237}, "language": "german", "review": "Das ist der ober Hammer. Mach mega spass und man trainiert auch noch beim zocken. Zumal man auch seine eigene Musik einspielen kann. Daumen hoch. Super Kauf.\n\n", "timestamp_created": 1509549785, "timestamp_updated": 1509549785, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36192055": {"recommendationid": "36192055", "author": {"steamid": "76561197971433895", "num_games_owned": 927, "num_reviews": 154, "playtime_forever": 16, "playtime_last_two_weeks": 0, "last_played": 1509541804}, "language": "tchinese", "review": "算是非常專業的燃脂拳擊有氧VR    雖然有趣度不比跟NPC對打的其他拳擊VR遊戲\n但是動作上要求的橫鉤拳 上鉤拳 都有要求 配合閃避\n還可以加入自己的歌單  加上數據計算你消耗的熱量\n\n算是蠻專業的VR拳擊遊戲!~\n\n希望可以增加多點要素還有判定希望稍微大一點不然容易打MISS (希望設定成可調整讓不同level的玩家都能享受到這款遊戲樂趣)", "timestamp_created": 1509543878, "timestamp_updated": 1509543878, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.505173", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36149061": {"recommendationid": "36149061", "author": {"steamid": "76561198033580827", "num_games_owned": 65, "num_reviews": 2, "playtime_forever": 709, "playtime_last_two_weeks": 0, "last_played": 1513155469}, "language": "english", "review": "Great VR fitness game which has now become part of my main fitness routine. Gameplay is fun, implements plenty of variation and workouts. The developer is very responsive which is great to see in an early access game. Would definitely recommend to anyone looking to burn some calories.", "timestamp_created": 1509392758, "timestamp_updated": 1509392758, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36119541": {"recommendationid": "36119541", "author": {"steamid": "76561197978591687", "num_games_owned": 45, "num_reviews": 1, "playtime_forever": 443, "playtime_last_two_weeks": 0, "last_played": 1513347432}, "language": "english", "review": "Makes for a very good and fun workout, and so far I've only done the 5 min. ones.\nGoing for one of the longer endurance workouts tomorrow, guess I should have ordered that VR replacement cover for the Rift, it's gonna get soaked :)\n\nVery nice way you implemented the glove/controller alignment, this way I'd wager everybody can get the fit they like.", "timestamp_created": 1509300789, "timestamp_updated": 1509300789, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36088168": {"recommendationid": "36088168", "author": {"steamid": "76561198066590240", "num_games_owned": 1217, "num_reviews": 436, "playtime_forever": 79, "playtime_last_two_weeks": 0, "last_played": 1513497906}, "language": "english", "review": "This is bar none, the best workout VR game.  Not sure I would call it a rhythm game as it's very light on the rhythm part.  The in-game music is okay and the workouts made for that are on beat.  However, when you use your own music, it's really more of a workout, while you're listening to your music.  And that's okay, in fact, it's more than okay.\n\nThat's because the workouts are amazing.  And they can be tuned to your level of fitness.  If you are completely out of shape, then the beginner courses will get your heart pumping.  If you're already in decent shape, then you can select the harder difficulties.  You can do specific timed workouts or you can go for endurance (workout til you drop).  You can select your own tunes and the game will make a workout that matches the musical intensity, if not the beats exactly.  \n\nThe game will either do left stance or right stance (boxing stances) and you'll jab, hook, upppercut, block, duck down, or weave.  Timing is everything and combos of ducking while blocking to immediately uppercut to another duck ups the intensity.  The three environments are nothing special and the graphics are simple.  But it gets the job done.  This is a VR workout game done to be as fun/immersive as possible with tunes, not a music rhtyhm game in the traditional sense.  \n\nRate 8/10 worth every penny, beats going to the gym, excellent cardio workout ... just wish more footwork drills were involved and more environments \n\n[spoiler] I got to punch stuff hard while listenting to Tool, 'nuff said [/spoiler]", "timestamp_created": 1509219297, "timestamp_updated": 1509219297, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.615178", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36046423": {"recommendationid": "36046423", "author": {"steamid": "76561198195899585", "num_games_owned": 168, "num_reviews": 2, "playtime_forever": 704, "playtime_last_two_weeks": 0, "last_played": 1509113484}, "language": "tchinese", "review": "我認為這是目前VR遊戲中最專業的運動遊戲，可以計算消耗熱量，也有各種不同訓練模式。\n最重要的是開發者有在持續修正各種BUG及新增功能。幾乎每天都會開來運動一下。好評！\n\nI think this is the best professional VR sports game.  \nYou can know how much calories consumed, and have different training mode.\nThe most important is that developer keep fix BUG and add new features.", "timestamp_created": 1509115919, "timestamp_updated": 1509115919, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36000512": {"recommendationid": "36000512", "author": {"steamid": "76561198421689777", "num_games_owned": 9, "num_reviews": 3, "playtime_forever": 3751, "playtime_last_two_weeks": 629, "last_played": 1516384937}, "language": "english", "review": "I Initially reviewed this game after one play session when I bought it a month or so ago. It wowed me at the time and I was mega excited about it but I've now had the game a month so thought an updated review would be appropriate. Well first off I have to say this game has plenty of staying power. I had bought this alongside several other fitness type games to get me into shape and this, far and away is the most addictive and compelling. I have now put in 25 hours and haven't missed a day's training since I bought it, averaging 45 minutes a night. My fitness has hugely improved, I have a flat stomach now and I've even started doing push ups and pull ups after workouts as it's got me fired up to train! The gameplay is simple but compelliing, and works the whole body. Power workouts give you lots of squats and leg work, Speed workouts are great fun allowing you throw dozens up fast combinations and really get into a fitness zone training like you're Floyd Mayweather. Endurance mixes the two styles and extends the workouts to between 20 and 35 minutes. Some of the workouts are short but it literally takes about 10 seconds to transition from the end of one workout to starting a new one so don't avoid them, and they are timed well giving you a chance to wipe the sweat from your headset before you dive into the next one. In all I one hundred percent recommend this game!", "timestamp_created": 1508979499, "timestamp_updated": 1511278600, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.543568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35977772": {"recommendationid": "35977772", "author": {"steamid": "76561198044524399", "num_games_owned": 147, "num_reviews": 4, "playtime_forever": 244, "playtime_last_two_weeks": 0, "last_played": 1515098007}, "language": "english", "review": "Time flies playing this, devs are super active and is the best \"game\" out there in its style on the market.", "timestamp_created": 1508891169, "timestamp_updated": 1508891220, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35953304": {"recommendationid": "35953304", "author": {"steamid": "76561198153646418", "num_games_owned": 204, "num_reviews": 3, "playtime_forever": 45, "playtime_last_two_weeks": 0, "last_played": 1513050307}, "language": "english", "review": "It's a fun game of having a shadow boxing type of workout while feeling like a game similar to audio surf.", "timestamp_created": 1508791462, "timestamp_updated": 1508791462, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "35952237": {"recommendationid": "35952237", "author": {"steamid": "76561197970355981", "num_games_owned": 809, "num_reviews": 6, "playtime_forever": 309, "playtime_last_two_weeks": 74, "last_played": 1516192950}, "language": "english", "review": "So far this is by far the best workout game I have played! \n\nThe each set is designed perfectly with the music and is very satisfing to box through. Importantly this game the original music is really, really good, but if it's not to your taste you can use your own and the beat detection is the best I have seen in VR. \n\nThere are many different workouts of differing length which means that it fit into my workout if I want to mix it with other games or concentrate on endurance.\n\nWholeheartedly recccomend it!\n\nTo the Devs two minor requests: 1 - Is it possible to make a playlist of songs for a longer workout? 2 - When there's a break between songs could we get a timedown so it's possible to grab a drink?\n\nTa!\n\n", "timestamp_created": 1508787712, "timestamp_updated": 1508787712, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.525547", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "35938336": {"recommendationid": "35938336", "author": {"steamid": "76561198055539574", "num_games_owned": 89, "num_reviews": 2, "playtime_forever": 122, "playtime_last_two_weeks": 8, "last_played": 1515267171}, "language": "english", "review": "BOXVR is one of the best workout games I've ever seen. Unlike other fitness games, it's legitimately fun and actually feels like a game. I used the power workout, and it absolutely wrecked my thighs with all the ducking - I couldn't walk properly for a few days afterwards.\n\nThis game is even better to play when friends are watching. Watching the person in the headset fighting and ducking always spawns lots of cheers and excitement. It's even better when you have that go-hard friend, or the amateur boxer, taking it a bit too seriously. Recommended for anyone interested in a workout that doesn't feel like a chore!\n\n", "timestamp_created": 1508737526, "timestamp_updated": 1508737526, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "35904513": {"recommendationid": "35904513", "author": {"steamid": "76561197996679866", "num_games_owned": 575, "num_reviews": 14, "playtime_forever": 855, "playtime_last_two_weeks": 93, "last_played": 1516292808}, "language": "english", "review": "Great physical exercise game, devs recently improved it a lot so I can wholly recommend it.\n\nDon't expect a dance game, even if the sequences kind of follow the music. The main goal is to do good exercises.\nThe variety of moves is very nice, which compensate that target positions are quite monotonous.\nTiming and speed required to validate bubble hit from the sides (uppercuts and hooks) are quite difficult to pull off. It can be frustrating at times, but a satisfying challenge.\n\nAs often with this kind of games, the small number of body tracked points leave some leeway to cut corners. Sometimes I have a tendency to optimize my movements to get better scores, but I enjoy more doing proper moves (better exercise). So maybe watch out for that.", "timestamp_created": 1508625758, "timestamp_updated": 1508625813, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35892196": {"recommendationid": "35892196", "author": {"steamid": "76561198006523187", "num_games_owned": 43, "num_reviews": 2, "playtime_forever": 2496, "playtime_last_two_weeks": 58, "last_played": 1516287500}, "language": "english", "review": "Great responsiveness from the devs, and the game (workout) keeps getting better and better. Two thumbs up!", "timestamp_created": 1508594700, "timestamp_updated": 1508594700, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35831075": {"recommendationid": "35831075", "author": {"steamid": "76561198001181233", "num_games_owned": 502, "num_reviews": 2, "playtime_forever": 704, "playtime_last_two_weeks": 7, "last_played": 1515758790}, "language": "english", "review": "My partner and I have each lost 10+ pounds using this game.  Highly recommended.", "timestamp_created": 1508381193, "timestamp_updated": 1508381193, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.501887", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35765306": {"recommendationid": "35765306", "author": {"steamid": "76561197972017291", "num_games_owned": 38, "num_reviews": 14, "playtime_forever": 463, "playtime_last_two_weeks": 0, "last_played": 1513015303}, "language": "english", "review": "Thanks for adding the possibility of adding your own music files.\nGreat work-out program.", "timestamp_created": 1508130149, "timestamp_updated": 1508130149, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35710424": {"recommendationid": "35710424", "author": {"steamid": "76561197965470088", "num_games_owned": 372, "num_reviews": 49, "playtime_forever": 352, "playtime_last_two_weeks": 0, "last_played": 1508958224}, "language": "english", "review": "This is a fantastic little gem of a VR game. I've always wanted VR for the physical aspect it would bring to gaming. \n\nThis game does a fantastic job of making a little calories burn a blast to do. \n\nCan't wait to see what else they bring to this title as it moves further in development. \n\nIf you watch the trailer, and think that would be fun to do a quick session of each night. \nThen buy now! This is even the first VR experience my wife comes back to play!", "timestamp_created": 1507964203, "timestamp_updated": 1507964203, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35621425": {"recommendationid": "35621425", "author": {"steamid": "76561198058768677", "num_games_owned": 36, "num_reviews": 1, "playtime_forever": 832, "playtime_last_two_weeks": 0, "last_played": 1513279394}, "language": "english", "review": "The game is great. I love night mode. Only thing i can say is i have trouble with upper cuts. they dont seem to track well. I have to do werid upper cut movomeant to get them to hit. But over all love it and would buy it 10 times over.\n\nedit: they lisen to comments and work on game. upper cuts are now flawless and work, every thing works smooth. also there new harder work out modes are even more fun then ever. this game just gets better and better. I have no idea how they could update this game any more to make it any better. But i am excited for every update they come up with.", "timestamp_created": 1507653983, "timestamp_updated": 1511059238, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35510602": {"recommendationid": "35510602", "author": {"steamid": "76561197960542261", "num_games_owned": 470, "num_reviews": 10, "playtime_forever": 37, "playtime_last_two_weeks": 0, "last_played": 1507258748}, "language": "english", "review": "I have audioshield, fastest fist and thrill of the fight. They're all great in their own right. BoxVR is the game most tailored towards getting a workout with some solid form. It's great fun with a lot of potential.\n\nThat said, there is plenty of room for improvement. Right now, you can only change the angle of your gloves in one plane, so that your virtual gloves are bent upwards if your real arms are sticking straight forward in thumbs up position. We just need a rotation setting for thumbward and pinky-side adjustment.\n\nI'd also appreciate some more challenging workouts. I know this is tailored toward having a consistent and easy to follow routine, but having true challenge would make this experience so much more \n\nFinally, I understand this is outside the scope of the game, but picking our own music would be much appreicated. Sound boxing and audioshield do it pretty well. BoxVR has some great mechanics so I hope these developers can do it too.", "timestamp_created": 1507269500, "timestamp_updated": 1507269500, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "35430932": {"recommendationid": "35430932", "author": {"steamid": "76561198077989234", "num_games_owned": 32, "num_reviews": 2, "playtime_forever": 632, "playtime_last_two_weeks": 0, "last_played": 1512544982}, "language": "english", "review": "Yep, this is a real workout that'll leave you in a puddle of sweat and make your face sponge nasty!\nGreat stuff and improving.\nThanks", "timestamp_created": 1506988090, "timestamp_updated": 1506988090, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35283905": {"recommendationid": "35283905", "author": {"steamid": "76561198307923058", "num_games_owned": 80, "num_reviews": 53, "playtime_forever": 47, "playtime_last_two_weeks": 0, "last_played": 1506605305}, "language": "tchinese", "review": "喜歡運動流汗的可以玩這款\n我覺得做得很好\n很有挑戰性與趣味性\n值得推薦", "timestamp_created": 1506665238, "timestamp_updated": 1506665238, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34766249": {"recommendationid": "34766249", "author": {"steamid": "76561198033111227", "num_games_owned": 734, "num_reviews": 73, "playtime_forever": 67, "playtime_last_two_weeks": 0, "last_played": 1504805612}, "language": "english", "review": "Just simply amazing! Speed for me to build upper body muscles and sometimes power to balance lower and upper muscles and stamina, and power for my GF to have an all around burner!\n\nFeel so much more comfident with this than any crowded gym!", "timestamp_created": 1504653631, "timestamp_updated": 1504653631, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.436397", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34722530": {"recommendationid": "34722530", "author": {"steamid": "76561198046786757", "num_games_owned": 42, "num_reviews": 2, "playtime_forever": 2918, "playtime_last_two_weeks": 18, "last_played": 1515378945}, "language": "english", "review": "This game is fun, the workouts are good, calorie counts are nearly accurate (about 5% high from measurements taken with a HR monitor), BUT after running them a few times they're really repetitive so I cannot recommend this game until the other modes are added.\n\nI felt a bit duped when I first got the game since from the video it looked like they were already functional, and it's been over a month now and they're still not added. Hopefully the devs get on this instead of making more repetitive trailers showing features that don't yet exist. \n\nGreat concept but it needs finishing.\n\nEDIT: After spending much more time on this game and seeing how active the decs are, I would recommend, just understand it's not perfect yet.", "timestamp_created": 1504476233, "timestamp_updated": 1507674984, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34242610": {"recommendationid": "34242610", "author": {"steamid": "76561197996347183", "num_games_owned": 84, "num_reviews": 3, "playtime_forever": 138, "playtime_last_two_weeks": 0, "last_played": 1512779035}, "language": "english", "review": "Its the best workout game, i have another games for exercise but this is far away the best.", "timestamp_created": 1502741395, "timestamp_updated": 1502741395, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.585323", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33995238": {"recommendationid": "33995238", "author": {"steamid": "76561198010436095", "num_games_owned": 32, "num_reviews": 3, "playtime_forever": 448, "playtime_last_two_weeks": 0, "last_played": 1511595843}, "language": "schinese", "review": "请问跳跃动作是怎么做的呢？我跳起来还是没有用，还是出错。希望能出简体中文的字幕。给点提示动作，让大家更规范的去运动。", "timestamp_created": 1501774151, "timestamp_updated": 1501774151, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33954990": {"recommendationid": "33954990", "author": {"steamid": "76561198011484287", "num_games_owned": 312, "num_reviews": 5, "playtime_forever": 228, "playtime_last_two_weeks": 0, "last_played": 1501596168}, "language": "english", "review": "So this game is great as a workout, but if you are here looking for a rymth game you can turn away now, this \"game\" is not very \"gamey\" right now, it is meant as a workout routine in VR and that is exactly what it is.\n\nCheck out the full video-review here!  [url=https://youtu.be/MUD412UiRhM] Youtube-Link [/url]", "timestamp_created": 1501612935, "timestamp_updated": 1501612935, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.529783", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "33945001": {"recommendationid": "33945001", "author": {"steamid": "76561198004717442", "num_games_owned": 21, "num_reviews": 1, "playtime_forever": 711, "playtime_last_two_weeks": 0, "last_played": 1511687152}, "language": "schinese", "review": "这游戏爽到爆啊！挥汗如雨的，节奏爽快的。", "timestamp_created": 1501577958, "timestamp_updated": 1501577958, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33650782": {"recommendationid": "33650782", "author": {"steamid": "76561198329163766", "num_games_owned": 97, "num_reviews": 56, "playtime_forever": 2775, "playtime_last_two_weeks": 53, "last_played": 1516285386}, "language": "english", "review": "I have Audioshield, Soundboxing, HoloD.. so I was hesitant to purchase this title at first...boy, was I wrong about this game...Now, this is my daily routine...I do Endurance x 2 (900kcal) and I have excuse for Dunkin' Donuts..\n\nThis is a real workout...must try for all those out of shape obese game players out there...this is high intensity boxing....after just short 5 min...I am all covered in sweat..If you own a Vive this is a must. Working out used to be tedious...now working out is fun...thanks to BOXVR..\n\nWith all the sweating from the program...I sure hope the headset is water proof..\n\nNew Update::Now available to play with your own music files...it was a blast!!!!!\nWith all these features added the game at this price is a bargain...\n\n.", "timestamp_created": 1500468645, "timestamp_updated": 1508643024, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.584644", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33086831": {"recommendationid": "33086831", "author": {"steamid": "76561198024634982", "num_games_owned": 94, "num_reviews": 5, "playtime_forever": 98, "playtime_last_two_weeks": 0, "last_played": 1510509866}, "language": "schinese", "review": "这游戏这么不起眼吗？简直爽到爆", "timestamp_created": 1498920613, "timestamp_updated": 1498920613, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33080344": {"recommendationid": "33080344", "author": {"steamid": "76561198043078693", "num_games_owned": 79, "num_reviews": 1, "playtime_forever": 822, "playtime_last_two_weeks": 46, "last_played": 1516296788}, "language": "german", "review": "Ich dachte mir, warum soll ich soviel Geld für ein Early Access Spiel ausgeben... und ich bin froh darum.\n\nObwohl es nur 5 verschieden Programme gibt, macht es einfach nur Spaß. Die verschiedenen Programme gepaart mit coole House bzw. Elektro Musik spornt mich jeden Tag eine Runde zu spielen. Und wenn ich seh, dass ich so in einer halben Stunde ca 900 kcal verbrannt habe, ist die Motivation umso größer, das Spiel wieder zu spielen.\n\nDie boxhandschuhe und die aufliegenden Bälle zu Boxen, sei es gerade aus oder von der Seite bzw. von unten sind sehr präzise. \n\nUnd die Programmierer sind dran die Bugs auszubessern, Ideen umzusetzen oder kleine schönheitsfehler zu bereinigen.\n\nIch werde weiterhin spielen und freue mich rießig auf zukünftige Updates.\n\nPS: seit ich den htc vive deluxe Audio strap habe, fällt auch kein problem mehr mit den schnellen Bewegungen an. Auch die angelegten Kopfhörer sind praktischer als die mitgelieferten inear Kopfhörer, die immer wieder gerne bei mir rausfallen.", "timestamp_created": 1498909802, "timestamp_updated": 1498909802, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32769352": {"recommendationid": "32769352", "author": {"steamid": "76561198024945223", "num_games_owned": 50, "num_reviews": 1, "playtime_forever": 499, "playtime_last_two_weeks": 0, "last_played": 1510594281}, "language": "english", "review": "Really great exercise and fun too!!\n\nWould be great if you could store multiple profiles in the system to make it easier for people to switch around.  My wife and I both tried this today but we had change the settings each time.", "timestamp_created": 1498392686, "timestamp_updated": 1498392811, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32607094": {"recommendationid": "32607094", "author": {"steamid": "76561198064250869", "num_games_owned": 471, "num_reviews": 27, "playtime_forever": 11, "playtime_last_two_weeks": 0, "last_played": 1498007287}, "language": "english", "review": "First I have tried several boxing games and this one is by far the most accurate and fun to play. I tried a couple of the works outs aand really like, no I know just how out of shape I am, but hey thats what VR is for movement. This is def a keeper and will continue to play, cool music, need to look if can change. To play your own music would be awesome.", "timestamp_created": 1498009281, "timestamp_updated": 1498009281, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32567571": {"recommendationid": "32567571", "author": {"steamid": "76561198386250824", "num_games_owned": 16, "num_reviews": 3, "playtime_forever": 881, "playtime_last_two_weeks": 0, "last_played": 1510400372}, "language": "english", "review": "This is what I have been waiting for upper body exercise, in the real world I cycle a lot, two ten miler's a day but i could'nt find a decent upper body workout on VR but this BOXVR hits the spot, good music is very important as it adds incentive so now I have a good balanced daily routine, keep the good work up Guys....", "timestamp_created": 1497884653, "timestamp_updated": 1497884653, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.505427", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32543604": {"recommendationid": "32543604", "author": {"steamid": "76561197964636851", "num_games_owned": 1971, "num_reviews": 50, "playtime_forever": 46, "playtime_last_two_weeks": 5, "last_played": 1515528387}, "language": "english", "review": "Out of all the boxing or \"work out\" type VR games there are out right now, this has got to be the best one.  Though I wish you could import your own songs to it,  but it's EA so maybe sometime in the future?\n\nEither way, get boxing gloves and some zip ties, tie the controllers to the gloves, play this for a few hours a day, and Boom, workout complete.", "timestamp_created": 1497805833, "timestamp_updated": 1497805833, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32488096": {"recommendationid": "32488096", "author": {"steamid": "76561198127119056", "num_games_owned": 67, "num_reviews": 11, "playtime_forever": 30, "playtime_last_two_weeks": 0, "last_played": 1504661294}, "language": "english", "review": "7 out of 10.\n\nGreat visuals, simple yet intuitive interface. Great works.\n\nLacking in content, only a handful of routines to play. I really hope they add more routines soon. I will update this review when that happens.\n\n\n", "timestamp_created": 1497654336, "timestamp_updated": 1497654336, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32487430": {"recommendationid": "32487430", "author": {"steamid": "76561197969911551", "num_games_owned": 355, "num_reviews": 23, "playtime_forever": 152, "playtime_last_two_weeks": 6, "last_played": 1516147961}, "language": "english", "review": "UltraSweat Creator Deluxe Edition ★★★★★★", "timestamp_created": 1497652204, "timestamp_updated": 1497652204, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32467252": {"recommendationid": "32467252", "author": {"steamid": "76561198000571694", "num_games_owned": 2194, "num_reviews": 5, "playtime_forever": 100, "playtime_last_two_weeks": 0, "last_played": 1508116272}, "language": "english", "review": "Pretty good workout.  The ducking, hooks, and upper cut really set it apart from other vr boxing exercise games.  The only thing missing is the plyometric i.e. jumping.  Perhaps if that can be added as the advanced mode, that will make the workout even more effective.", "timestamp_created": 1497600164, "timestamp_updated": 1497600164, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503194", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32463516": {"recommendationid": "32463516", "author": {"steamid": "76561197963773699", "num_games_owned": 60, "num_reviews": 2, "playtime_forever": 77, "playtime_last_two_weeks": 0, "last_played": 1497790991}, "language": "english", "review": "Wow!  Writing this as my currently trying to dry from sweating so much.  VR and games like this are exactly what I need to exercise.  It makes it fun enough that I actually want to do it.  It also requires so much concentration and immerses you that you are able to push yourself further because you are distracted from how tired you are getting.  I highly recommend this and can't wait for it to get even better!", "timestamp_created": 1497588451, "timestamp_updated": 1497588451, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503058", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32427937": {"recommendationid": "32427937", "author": {"steamid": "76561197970060162", "num_games_owned": 127, "num_reviews": 2, "playtime_forever": 2338, "playtime_last_two_weeks": 220, "last_played": 1516036225}, "language": "german", "review": "English Google translation below:\n\n\nSuper !\n\nNach 12 Minuten war ich fix & fertig =)\n\nIch kann mir aber gut vorstellen das wenn man BoxVR regelmäßig nuzt, sich recht schnell ein Fitnessfortschritt einstellt.\n\n\nWas mir noch fehlt:\n\nEin Modus der Anfänger langsam (über Wochen) an das Training herranführt und so eine stetige Verbesserung der Leistung ermöglicht.\n\nWeiter Modi für Fortgeschrittene \n\nEbenso wäre eine Uhr nicht schlecht, welche die restliche Zeit des Workouts anzeigt.\n\n--------------------------------------------------------\n\nGoogle translation:\n\n\nExcellent!\n\nAfter 12 minutes I was fixed & finished =)\n\nBut I can well imagine that if you use boxVR regularly, a fitness progress is fast.\n\n\nWas still missing me:\n\nA mode of the beginners (over weeks) to the training lead and thus a steady improvement of the achievement.\n\nAdvanced modes for advanced users\n\nLikewise, a clock would not be bad, which indicates the remaining time of the workout.", "timestamp_created": 1497513003, "timestamp_updated": 1497588914, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.502712", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32421917": {"recommendationid": "32421917", "author": {"steamid": "76561197996304815", "num_games_owned": 104, "num_reviews": 1, "playtime_forever": 301, "playtime_last_two_weeks": 0, "last_played": 1513556966}, "language": "english", "review": "This is the workout game I've been looking for! I have tried most of them, and BOXVR is the first game that really brings all the different gameplay types together for a full-body workout. \n\nIt's early access so a few features aren't enabled yet, but there's a good number of programs to go through. The graphics are clean and ran smoothly. Each program has different instrumental electronic music with a good beat. \n\nI can't wait to see how this game progresses. As-is I think it's an excellent purchase.", "timestamp_created": 1497491815, "timestamp_updated": 1497491815, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32421778": {"recommendationid": "32421778", "author": {"steamid": "76561198065826822", "num_games_owned": 540, "num_reviews": 27, "playtime_forever": 1023, "playtime_last_two_weeks": 35, "last_played": 1516376958}, "language": "english", "review": "8/10 \nhop than a day, it  will rise 9.5/10\n\nGood games, good fitness.\n\nMore paced, more fun and more fitness than audioshield.\nA bit less fun than Soundboxing, some beatmap are really great. \n \nIf the developpers work well, would be a great game. Maybe they can look at the wonderful work  of Ericflo on Soundboxing.\n\nit's more classic fitness than Soundboxing.\nYou have direct punch left and rigth, hook left and right, uppercut left and right, jump, duck, squat. It works fine.\nThe punch come at the same height (you could configure your hieght).\n\nFor the moment, no possibilty to adjust gloves (15 june 2017) and it s not a natural position but it works fine. You have just to punch with enough strenght and time. With practice, it 's better but at beginning it's less fun than a soundboxxing, alittle bit more frustrating\nI wait for personnal musci and beatmap ownmake.\n\nI hope for more liberty of movement. for the moment, you have to stand like a real boxer, stance roght and left. the stance are good and maybe the concept will not give me the liberty that i hope. But feel like a real boxer stance is great.\nHope that the next work out of professional fitness coach will be wonderful and intense\n\n\nPay attention to your supersampling, with one too high , it will slow down the orb because of fireworks... And orbs come a bit wrongfitting with music.\n\nThe music is average good. it works fine. I'm sure that will be improved soon.... i hope :D\n\nGo buy it if you want VR Fitness with real coach work. Breathe, Punch, Rest, retry", "timestamp_created": 1497491069, "timestamp_updated": 1497491165, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32416004": {"recommendationid": "32416004", "author": {"steamid": "76561198020445786", "num_games_owned": 825, "num_reviews": 137, "playtime_forever": 468, "playtime_last_two_weeks": 0, "last_played": 1506705334}, "language": "english", "review": "8 out of 10\n\nI'm really keen on using VR for fitness and BOXVR is a total winner for me. I'm really enjoying the different excercises, It's sort of like Audioshield with punching. BOXVR has different routines to support speed, power, and endurance. During a session it includes breaks and swapping stances. And each segment of the session is a different sequence of punches and dodging. It feels really well balanced.\n\nThe game feels really good already and there's loads of untapped scope for adding more variety to the exercises, the greyed out sections shows this is already planned on the roadmap.\n\nMy Steam library is packed with a number of high intensity VR games, but they aren't specifically designed for fitness training but they get you tired pretty quickly. BOXVR is better than those, the pacing keeps you working hard but not to exhaustion.", "timestamp_created": 1497465462, "timestamp_updated": 1497465585, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.617851", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39471648": {"recommendationid": "39471648", "author": {"steamid": "76561198021766012", "num_games_owned": 261, "num_reviews": 11, "playtime_forever": 22, "playtime_last_two_weeks": 22, "last_played": 1516406961}, "language": "english", "review": "Workouts felt natural even to this SHORTY 👩 It's punches, leans, squats, rest period all pro level here❗️ Spooky 👻 Enviroment was my FAVE 🦇", "timestamp_created": 1516411397, "timestamp_updated": 1516411397, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.514286", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "39585359": {"recommendationid": "39585359", "author": {"steamid": "76561198015194045", "num_games_owned": 115, "num_reviews": 2, "playtime_forever": 161, "playtime_last_two_weeks": 161, "last_played": 1516813119}, "language": "english", "review": "The first time I had any experience with motion control boxing was with Wii Sports, and that was a fantastic start to the OBVIOUS utilization of hand controls in a hand to hand combat game.  This game adds on that base idea with superior visuals, an excellent (albeit short) soundtrack, and brings back that idea of getting your ass off the couch and immersing yourself in a full body gaming experience.  I'd like to see this being used more in the future as an in-home workout routine because as it stands, it is a missed opportunity that this game grabs on to and does not dissapoint.", "timestamp_created": 1516813398, "timestamp_updated": 1516813398, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39570286": {"recommendationid": "39570286", "author": {"steamid": "76561197967148777", "num_games_owned": 2333, "num_reviews": 8, "playtime_forever": 205, "playtime_last_two_weeks": 205, "last_played": 1516859738}, "language": "english", "review": "Easily the most fun I've had in any workout game. If you like the rhythm gameplay of Guitar Hero/Rock Band and don't mind punching stuff, you'll enjoy this one. You might want to try wearing a sweatband or getting a cover for the headset padding though, because you will break a sweat in this game.\n\nOne gripe is there's no easy daily calorie count in the data view - it's there, but it's part of a graph of your all-time calorie burn and it's hard to read (unless I'm missing something). I generally don't give a damn about how many calories I've burned over the entire time I've used an app or workout machine - I only care about that day's count. So hopefully that's a feature they'll add. Steam Workshop support would also be great - I'd love to model environments and targets for this thing.\n\nI usually avoid early access games, but I'm glad I took a chance on this one.", "timestamp_created": 1516755560, "timestamp_updated": 1516755780, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39538751": {"recommendationid": "39538751", "author": {"steamid": "76561198005493306", "num_games_owned": 62, "num_reviews": 3, "playtime_forever": 126, "playtime_last_two_weeks": 126, "last_played": 1516777893}, "language": "czech", "review": "Hru jsem zakoupil za 19 euro - absolutně nefunguje !!!!! na VR - jen na monitoru - zbytek se ve VR do nekonečna načítá - grafická karta 1080  - všechny ostatní hry okamžitě fungují jen ne tento vrbox - nedoporučuji !!!!", "timestamp_created": 1516639957, "timestamp_updated": 1516639957, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40965440": {"recommendationid": "40965440", "author": {"steamid": "76561197970815456", "num_games_owned": 233, "num_reviews": 7, "playtime_forever": 1252, "playtime_last_two_weeks": 0, "last_played": 1520088031}, "language": "english", "review": "After months of following and playing this game, I'm pretty much out. \n\nThe dev seems to have no idea with what they are doing over core fundamentals of the game like hit detection. They fix it, they break it, they fix it, they break it, they fundamentally change it so that it is broken. It leads to a very unsatisfying and frustrating experience. This used to be my number 1 workout game, and now I don't even want to touch it.", "timestamp_created": 1521675887, "timestamp_updated": 1521675887, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40951196": {"recommendationid": "40951196", "author": {"steamid": "76561197962889372", "num_games_owned": 235, "num_reviews": 7, "playtime_forever": 166, "playtime_last_two_weeks": 166, "last_played": 1521718722}, "language": "english", "review": "Everyone else is right, this is a very fun excercise/rhythm game and to the people who complained about music note inaccuracy I didn't experience that issue but I did make an effort to pick songs with a consistent BPM and time signature but after over 20 songs they were all pretty accurate", "timestamp_created": 1521610318, "timestamp_updated": 1521610318, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40905214": {"recommendationid": "40905214", "author": {"steamid": "76561198058089392", "num_games_owned": 124, "num_reviews": 6, "playtime_forever": 774, "playtime_last_two_weeks": 774, "last_played": 1521748903}, "language": "english", "review": "Awesome game and a hell of a workout! Lost nearly 5 pounds within the first 2 weeks of playing. My only wish list is to be able to enter your height/weight for a more acurate calorie tracking.", "timestamp_created": 1521398838, "timestamp_updated": 1521398838, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40889354": {"recommendationid": "40889354", "author": {"steamid": "76561198203116254", "num_games_owned": 97, "num_reviews": 13, "playtime_forever": 384, "playtime_last_two_weeks": 384, "last_played": 1521692846}, "language": "english", "review": "If you're like me, a lazy sack of shit, and you're looking for something to get you active since working out sucks...this game is for you.\n\nThe hit detection is on point, the music is good, and it really gets me sweating!  Engaging workouts, easy interface, I find myself playing this for 30 minutes and the time just flew by.  My foam was soaked.\n\n10/10, would wake up unable to move again.", "timestamp_created": 1521348052, "timestamp_updated": 1521348102, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40861037": {"recommendationid": "40861037", "author": {"steamid": "76561198289016901", "num_games_owned": 15, "num_reviews": 1, "playtime_forever": 1914, "playtime_last_two_weeks": 1145, "last_played": 1521746679}, "language": "english", "review": "Great workout. Very impressed. I have already lost 10 lbs and a few inches from my waist.", "timestamp_created": 1521248189, "timestamp_updated": 1521248189, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40859112": {"recommendationid": "40859112", "author": {"steamid": "76561198063415664", "num_games_owned": 158, "num_reviews": 5, "playtime_forever": 48, "playtime_last_two_weeks": 48, "last_played": 1521591180}, "language": "english", "review": "My first impression of this game was pretty bad. The rhythm seemed off, I was unimpressed that it couldn't find my personal music and use it and I found the in game music boring and repetitive. However, first impressions are rarely correct. During my first playthrough I tried it in the Spooky Graveyard map and... Well... It seemed tacky and annoying. Today I played again using the other three maps and have found the responsiveness does seem to be better in the less tacky maps. The music is still repetitive but I found the game fun. I was able to hit the balls in time most of the time and when I didn't I knew it was me and not the game. Unlike the first time I played I actually enjoyed myself and worked up a pretty good sweat. So, yeah, it's a good game, but if you're like me and your first impression of it was bad I recommend trying the other maps and some other workouts. It gets better.", "timestamp_created": 1521239757, "timestamp_updated": 1521596824, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40807531": {"recommendationid": "40807531", "author": {"steamid": "76561198000029350", "num_games_owned": 218, "num_reviews": 7, "playtime_forever": 78, "playtime_last_two_weeks": 78, "last_played": 1521378573}, "language": "turkish", "review": "Robo Recall'dan sonra çıkmış en iyi vr oyunlarından biri. Harika bir oyun, kan ter içinde kalıyorsunuz, harika bir spor oyunu.. Kesinlikle, vr'ı olan alsın, oynasın, muhteşem. \n\nAntremana başlamadan önce : \n\n1. Spor ayakkabı giyin. \n2. Kontrolcüleri bileğinize iyice bağlayın. \n3. Biraz ısının oyundan önce..", "timestamp_created": 1521030487, "timestamp_updated": 1521030487, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40807012": {"recommendationid": "40807012", "author": {"steamid": "76561197974522156", "num_games_owned": 2914, "num_reviews": 458, "playtime_forever": 15, "playtime_last_two_weeks": 15, "last_played": 1521012145}, "language": "english", "review": "[h1] Attention Fat fucks of the VR world[/h1]\n\nYour time is up.\n\nExcellent work out.", "timestamp_created": 1521028364, "timestamp_updated": 1521034422, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.403412", "comment_count": "3", "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40785829": {"recommendationid": "40785829", "author": {"steamid": "76561198151917061", "num_games_owned": 30, "num_reviews": 1, "playtime_forever": 490, "playtime_last_two_weeks": 170, "last_played": 1521505166}, "language": "hungarian", "review": "Nagyon ajánlom a játékot.\nAki egy jó VR Fitness game-et keres, akkor ez  a megfelelő.", "timestamp_created": 1520943602, "timestamp_updated": 1520943602, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40767841": {"recommendationid": "40767841", "author": {"steamid": "76561198063547363", "num_games_owned": 233, "num_reviews": 2, "playtime_forever": 377, "playtime_last_two_weeks": 377, "last_played": 1521717805}, "language": "english", "review": "Decent\n", "timestamp_created": 1520871158, "timestamp_updated": 1520871158, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.467033", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40728051": {"recommendationid": "40728051", "author": {"steamid": "76561198369203888", "num_games_owned": 9, "num_reviews": 1, "playtime_forever": 504, "playtime_last_two_weeks": 504, "last_played": 1521685471}, "language": "english", "review": "This is an amazing game! This is what VR was made for, best VR experiance I've had so far.\n\nOnly suggestion would be to add the ability to create multiple profiles.  As I would like to track my own calories even when others want to try out the game.", "timestamp_created": 1520732897, "timestamp_updated": 1520732897, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525862", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40711773": {"recommendationid": "40711773", "author": {"steamid": "76561198414119863", "num_games_owned": 39, "num_reviews": 8, "playtime_forever": 423, "playtime_last_two_weeks": 423, "last_played": 1521738817}, "language": "english", "review": "Love this. fun  and exhausting workout would be great to have it have a mulitplayer option added.", "timestamp_created": 1520689292, "timestamp_updated": 1520689292, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40697956": {"recommendationid": "40697956", "author": {"steamid": "76561198078121936", "num_games_owned": 90, "num_reviews": 7, "playtime_forever": 105, "playtime_last_two_weeks": 105, "last_played": 1521297051}, "language": "polish", "review": "Rozjebalem monitor i ryj staremu, ale spoko bo mam drugi...", "timestamp_created": 1520646656, "timestamp_updated": 1520646656, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40686961": {"recommendationid": "40686961", "author": {"steamid": "76561197963710021", "num_games_owned": 488, "num_reviews": 2, "playtime_forever": 45, "playtime_last_two_weeks": 45, "last_played": 1521512059}, "language": "english", "review": "I'm very impressed with this so far.  I've played 5 of the beginner levels and had to wipe down after.  I really like how there are daily goals, I'll be checking in every day to hit that goal for sure.", "timestamp_created": 1520613208, "timestamp_updated": 1520613208, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "40637255": {"recommendationid": "40637255", "author": {"steamid": "76561198154045227", "num_games_owned": 255, "num_reviews": 7, "playtime_forever": 929, "playtime_last_two_weeks": 41, "last_played": 1521369786}, "language": "spanish", "review": "Buen juego para hacer algo de ejercicio, aunque no creo que lo vaya a jugar en verano con las gafas puestas.\n\nLe vendría bien más entrenamientos, y que las tablas de clasificación fueran por entrenamiento, en vez de por categorías.\n\nTiene un modo para utilizar tus canciones, pero lo poco que he probado no termina de convencerme, y hago los entrenamientos que vienen de serie.", "timestamp_created": 1520450260, "timestamp_updated": 1520450260, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40576369": {"recommendationid": "40576369", "author": {"steamid": "76561198097950532", "num_games_owned": 772, "num_reviews": 79, "playtime_forever": 1591, "playtime_last_two_weeks": 688, "last_played": 1521651373}, "language": "english", "review": "Love it.. all sweaty now.. may need new face foam in the future.. *catches breath* still love it", "timestamp_created": 1520212455, "timestamp_updated": 1520212455, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40573730": {"recommendationid": "40573730", "author": {"steamid": "76561198030567262", "num_games_owned": 55, "num_reviews": 13, "playtime_forever": 357, "playtime_last_two_weeks": 41, "last_played": 1521557109}, "language": "english", "review": "A fantastic physical training ! I would really enjoy more sessions, and a better visibility when one have to change position. Especially in the snow level where it's hard to notice indications.", "timestamp_created": 1520201169, "timestamp_updated": 1520201169, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40554506": {"recommendationid": "40554506", "author": {"steamid": "76561198058834043", "num_games_owned": 296, "num_reviews": 46, "playtime_forever": 674, "playtime_last_two_weeks": 490, "last_played": 1521724968}, "language": "english", "review": "EDIT:\nOK, a little background first. I am overweight because I hate exercise. 101 KG (or 220 pounds, somewhere in there) and about 177 CM or 5'10. For years I have looked for an exercise I could stick with and I never found one. Since I was a kid I always thought maybe VR would be my solution. I thought only then I could get into it. You know what? I was right. In the last two or three weeks I have put 9 hours, roughly, into this game. I love this game so much I bought every similar game I could find: Soundboxing, Holodance, Thrill of the Fight, Gorn, etc. They're all great games but I pretty much spend all my time in BoxVR.\n\nWhy? I'm so glad you asked!\nFirst of all, the game is brightly colored and has excellent graphics that fit the aesthetic and give you a sense of life and vitality that our real world gyms with their stagnant colors and ugly designs cannot give you. You can choose from 4 arenas, and the devs have confirmed in the forums (where they post and answer virtually any questions EVERY DAMN DAY) that more arenas, custom workouts, and content is coming. A public beta just went out yesterday that made it so now when you load your MP3s into the game to generate workouts automatically (a feature which works surprisingly well and is my go-to mode of play), you can save a playlist. A small but necessary QoL enhancement. They post updates just about every week!\n\nAnother thing: When I first started I posted some comments on the forums saying \"Sometimes during certain songs the beats come at you so fast that it's physically impossible to hit them\". Well, that may be true for songs with a super high BPM, but after just a few weeks of using the program just about every day, I feel embarrassed for ever expressing that sentiment. You get good QUICK! And it feels so rewarding toget a huge combo of like 200 or 300 or a perfect song on Hard mode.\n\nMake sure you use proper form for your squats, dodges, and the different kinds of punches to maximize your workout and avoid straining yourself unnecessarily!\n\nSUMMARY: If you have VR this is literally the only program you need to make it worth your investment. No joke. Buy this game.\n\n\nORIGINAL REVIEW: If you have any VR setup for PC, you must get this game. It comes with preloaded exercises but more importantly, you can upload your own MP3 files and it'll analyze them and create an exercise routine based on the song. I HAVE NEVER HAD MORE FUN EXERCISING OR EVEN PLAYING VIDEO GAMES OF ANY KIND IN RECENT MEMORY. Get this game, buy it full price, support the devs.", "timestamp_created": 1520145088, "timestamp_updated": 1521365562, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.560000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40526924": {"recommendationid": "40526924", "author": {"steamid": "76561198259036004", "num_games_owned": 43, "num_reviews": 7, "playtime_forever": 277, "playtime_last_two_weeks": 0, "last_played": 1520324316}, "language": "schinese", "review": "VR最好的减肥游戏之一", "timestamp_created": 1520057050, "timestamp_updated": 1520057050, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40524768": {"recommendationid": "40524768", "author": {"steamid": "76561198036524600", "num_games_owned": 279, "num_reviews": 27, "playtime_forever": 391, "playtime_last_two_weeks": 190, "last_played": 1521715808}, "language": "english", "review": "I'm lazy as one can be... Well I'm covered in sweat, my legs are numb but I wan't to play more, loads more! You wan't to get in shape while having fun? Stop looking these reviews, scroll up and buy the game already!", "timestamp_created": 1520047967, "timestamp_updated": 1520056756, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.547325", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40508381": {"recommendationid": "40508381", "author": {"steamid": "76561198145887550", "num_games_owned": 262, "num_reviews": 67, "playtime_forever": 159, "playtime_last_two_weeks": 25, "last_played": 1520924893}, "language": "schinese", "review": "减肥利器，拳击训练，音乐节奏游戏，找他就对了", "timestamp_created": 1519994216, "timestamp_updated": 1519994216, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40455041": {"recommendationid": "40455041", "author": {"steamid": "76561198013542584", "num_games_owned": 72, "num_reviews": 2, "playtime_forever": 61, "playtime_last_two_weeks": 5, "last_played": 1521000431}, "language": "english", "review": "Awesome way to workout with the Vive! The only reason i stop playing is because my vive gets too sweaty", "timestamp_created": 1519800033, "timestamp_updated": 1519800033, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40443609": {"recommendationid": "40443609", "author": {"steamid": "76561198128773818", "num_games_owned": 14, "num_reviews": 1, "playtime_forever": 1635, "playtime_last_two_weeks": 446, "last_played": 1521572894}, "language": "english", "review": "Love this game , I just wish there were more stages and more preset work outs !", "timestamp_created": 1519755162, "timestamp_updated": 1519755162, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40439190": {"recommendationid": "40439190", "author": {"steamid": "76561197983951132", "num_games_owned": 272, "num_reviews": 25, "playtime_forever": 23, "playtime_last_two_weeks": 0, "last_played": 1519662011}, "language": "german", "review": "Weder Daumen hoch, noch Daumen runter...\nWie Guitar Hero, nur mit Boxhandschuhen.\nLeider keine Streaming Musik verwendbar.\nWenn das geht, hole ich es mir vielleicht wieder.", "timestamp_created": 1519742301, "timestamp_updated": 1519742301, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40436350": {"recommendationid": "40436350", "author": {"steamid": "76561198030699290", "num_games_owned": 113, "num_reviews": 1, "playtime_forever": 199, "playtime_last_two_weeks": 94, "last_played": 1521634331}, "language": "english", "review": "Excersise has never been so fun. Who needs a gym membership?", "timestamp_created": 1519733097, "timestamp_updated": 1519733097, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40422600": {"recommendationid": "40422600", "author": {"steamid": "76561198039362025", "num_games_owned": 520, "num_reviews": 67, "playtime_forever": 90, "playtime_last_two_weeks": 0, "last_played": 1520370734}, "language": "english", "review": "had to get glasses cleaner/wipes for lens fog and sweat.  reduces soundboxing to a party game.", "timestamp_created": 1519674289, "timestamp_updated": 1519780233, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40407911": {"recommendationid": "40407911", "author": {"steamid": "76561198037578675", "num_games_owned": 162, "num_reviews": 4, "playtime_forever": 239, "playtime_last_two_weeks": 109, "last_played": 1521614226}, "language": "english", "review": "I am honestly surprised. I really didn't expect this game to be as precise nor as sweat inducing as it was. I picked this game up on a whim earlier just to try it out. Wow. It is not only addictingly fun but I am currently sitting in a pile of my own sweat. I am someone who exercises almost everyday at the gym and am have a very high cardiovascular fitness level and this game kicked my butt good. I see now why this game won the vr fitness award because it deserves it. I actually plan on supplementing my work outs with this game during the week. j\n\nLong story short, you want a good fitness game with a great soundtrack and excellent controls? Get this game.\n\nYou wont regret it.", "timestamp_created": 1519624878, "timestamp_updated": 1519624878, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40407574": {"recommendationid": "40407574", "author": {"steamid": "76561197970466389", "num_games_owned": 368, "num_reviews": 32, "playtime_forever": 188, "playtime_last_two_weeks": 61, "last_played": 1521521950}, "language": "english", "review": "Pros: Its very fun and addiciting, can use your own music to pump you up, and it has a calorie counter\nCons: I accidently punched my cat, now it runs away when I play.", "timestamp_created": 1519623220, "timestamp_updated": 1519623220, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40291548": {"recommendationid": "40291548", "author": {"steamid": "76561198067328199", "num_games_owned": 190, "num_reviews": 1, "playtime_forever": 377, "playtime_last_two_weeks": 84, "last_played": 1521326022}, "language": "english", "review": "I don't normally review products or games, but BoxVR is worth the time. \n\nI personally am not a fan of working out mainly because, for me, running on a tred or track is super boring. My dislike for running got so bad that I actually got out from the military because I didn't like my entire career success or failure resting on how fast I could run. After repeated overseas deployments my run got slower and slower and my stress before testing and working out higher and higher. After I got out I was so happy to not have that stress I just didn't do anything. Bottom line: I don't like cardio.\n\nThat was until BoxVR. I bought it on a whim after seeing an auto-play video ad on some site (maybe I shouldn't mention that because that style of advertising is super annoying) The tutorials got me hooked and the pre-made workouts kept me coming back for more. The work out with your own music feature is the iceing on the cake. The song profiling technology seems to work very well with the techno-classical music I have tried it with. \n\nUnlike every other workout I have expericed prior to this, the time just zooms by. An intense (by my standards anyway) 15-30 minute workout seems to be over before it starts. \n\nPros:\n- Pre-built workouts seem well timed and the music pretty good\n- The audio profiling tech seems to produce well sync'd workouts\n\nSuggestions\n- If the technology supports it, it would be nice to have a feeback summary on if you are performing the various punches with the right \"form\"\n- More statistics on as much as possible would be awesome\n\nThanks for a great product!", "timestamp_created": 1519273516, "timestamp_updated": 1519273516, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40288673": {"recommendationid": "40288673", "author": {"steamid": "76561198027899295", "num_games_owned": 26, "num_reviews": 3, "playtime_forever": 183, "playtime_last_two_weeks": 0, "last_played": 1520315791}, "language": "ukrainian", "review": "Guys who making this game i just want to thak you for this great game-workout. I love you, this is awesome! First time I write a review on the game that I am in love from the first run. Please dont stop and move on . Thanks again for your work! =)", "timestamp_created": 1519260349, "timestamp_updated": 1519260349, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40286593": {"recommendationid": "40286593", "author": {"steamid": "76561198047260438", "num_games_owned": 39, "num_reviews": 3, "playtime_forever": 313, "playtime_last_two_weeks": 3, "last_played": 1521503988}, "language": "japanese", "review": "お勧め。極端な出不精の為、家から一歩も出ずに運動してスカッとする事を目的に購入。\n当初は1ラウンドも出来なかったが、最近は10分以上できるようになった。ただし汗だくだ。\n5年以上駆け足もしなかったのだから仕方ないが。\n\n飛んでくるボールに指示した方向からパンチを当て、障害物を避ける。それだけのゲーム。\nしかし、リズムに合わせて動いたり、それぞれの動きの成功率が出るために楽しさが増す。\nまた、簡単な統計が出るようになっているので、それもまた励みの一つになる。\n好きな曲のMP3を持っていれば、それに合せたステージも作ってくれる。\n三日坊主にならず、3週間以上長持ちしているのはシンプルだからだろう。\n\n2月17日のアップデートに伴い、今まで一定だった算出カロリーが動きに沿ったものになった。\n当てるだけなら低く、素早く力を込めれば高いカロリーが出る。\nこれでまた一つ楽しめる要素が増えた。\n", "timestamp_created": 1519250894, "timestamp_updated": 1519250894, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40269233": {"recommendationid": "40269233", "author": {"steamid": "76561198033977097", "num_games_owned": 280, "num_reviews": 1, "playtime_forever": 80, "playtime_last_two_weeks": 0, "last_played": 1519709225}, "language": "german", "review": "Wegen solcher Spiele liebe ich VR. Sehr schweißtreibend, sehr motivierend und trotz Early Access Status schon ein ordentlicher Funktionsumfang.\n\nDas Spiel eignet sich für Spieler, die entweder Audio-Games à la Guitar Hero oder Audioshield mögen oder nach einer Möglichkeit suchen, sich vollkommen auszupowern. \n\nDas Spielprinzip ist simpel: Man schlägt, untermalt und im Takt von Musik, nach farbigen Bällen und kombiniert dies mit Bewegungen, beispielsweise Squats. Akkurate Schläge und Bewegungen führen zu einer höheren Punktzahl. \n\nDas Spiel bietet unterschiedliche Modi, wie vorgefertigte Workouts, Endlosspiel sowie Workouts zu eigener, via MP3 eingespielter, Musik. \n\nEinziger Kritikpunkt: Trotz vermeintlich (vielleicht liegt es auch an meiner Schlagtechnik?!) korrekter Schläge werden die Bälle nicht immer korrekt getroffen, insbesondere bei Bällen von der Seite. \n\nAnsonsten kann ich das Spiel aber auch schon im jetzigen Stadium empfehlen und freue mich auf weitere Neuerungen!", "timestamp_created": 1519193266, "timestamp_updated": 1519193266, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40198574": {"recommendationid": "40198574", "author": {"steamid": "76561197970329288", "num_games_owned": 1817, "num_reviews": 978, "playtime_forever": 53, "playtime_last_two_weeks": 0, "last_played": 1518973972}, "language": "english", "review": "My 1st impressions video:\nhttps://www.youtube.com/watch?v=OItP0Y0OGfw\n\nMy Thoughts:\nA really cool workout and rhythm game that shows you stats like calories burned etc and it lets you use your own music playlists.", "timestamp_created": 1518974076, "timestamp_updated": 1518974076, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.462662", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "40189877": {"recommendationid": "40189877", "author": {"steamid": "76561197968687331", "num_games_owned": 73, "num_reviews": 1, "playtime_forever": 961, "playtime_last_two_weeks": 75, "last_played": 1521659215}, "language": "english", "review": "I love this fitness app! I use it every day if I can and I think it’s only getting better! \n\nAll the other VR programmes I bought, are now gathering virtual dust!", "timestamp_created": 1518956432, "timestamp_updated": 1518956432, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40175039": {"recommendationid": "40175039", "author": {"steamid": "76561197964468487", "num_games_owned": 495, "num_reviews": 18, "playtime_forever": 370, "playtime_last_two_weeks": 32, "last_played": 1521239490}, "language": "english", "review": "Nice game if you are looking for a quick cardio workout. \n\nThe developers seem active in improving the game.  Haven't had the title long, but so far it has been steadily improved, and some flaws have already been fixed.  You can use your own music, but being able to calculate beat maps for a large group of files and saving the beat maps needs to be added.  As it stands now (2/17/18), you have to add the songs in game, wait for the beat map generation (albeit a fairly short minute wait), and then you can use the song.", "timestamp_created": 1518914223, "timestamp_updated": 1518914223, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.565724", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40156531": {"recommendationid": "40156531", "author": {"steamid": "76561198015178422", "num_games_owned": 628, "num_reviews": 34, "playtime_forever": 474, "playtime_last_two_weeks": 0, "last_played": 1520141137}, "language": "japanese", "review": "お勧め作品。買い。\n\nVRで久々に数時間ぶっ通しでプレイした。\n正真正銘のVRボクササイズゲーム。\n\nASと同様に自分が持っている曲を使用できるためノリノリでプレイできる。\n曲のサビ部分に来ると気持ちよくパンチできるため爽快感がASやSBと全く違う。\n\nViveを持っている人には是非やってもらいたい。", "timestamp_created": 1518873148, "timestamp_updated": 1518873148, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.563492", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40136366": {"recommendationid": "40136366", "author": {"steamid": "76561198008002180", "num_games_owned": 339, "num_reviews": 9, "playtime_forever": 178, "playtime_last_two_weeks": 27, "last_played": 1521382459}, "language": "english", "review": "Awesome. One of the few VR games that are both physically exhausting AND fun to play. Only thing that's missing in my opinion is perhaps some kind of spotify integration.", "timestamp_created": 1518812972, "timestamp_updated": 1518812972, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.584906", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40029689": {"recommendationid": "40029689", "author": {"steamid": "76561198323017047", "num_games_owned": 45, "num_reviews": 1, "playtime_forever": 230, "playtime_last_two_weeks": 0, "last_played": 1518803281}, "language": "english", "review": "ONE WORD - AWESOME! Best VR experience to date.", "timestamp_created": 1518460811, "timestamp_updated": 1518460811, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "40007103": {"recommendationid": "40007103", "author": {"steamid": "76561198025647757", "num_games_owned": 36, "num_reviews": 1, "playtime_forever": 1725, "playtime_last_two_weeks": 387, "last_played": 1521576238}, "language": "german", "review": "Perfekt um seinen lahmen Hintern zu bewegen... ;)\nMit der Steambox auf TV streamen und alle können zuschauen und sich so gegenseitig motivieren.\n\nWas noch schön wäre, wenn es Avatare geben würde, so das mehrere Personen nacheinander spielen könnten und die Settings der Größen, Gewichte und bevorzugte Handschuhhaltung gespeichert werden könnten. \n\nSo würden die Spinde im Menuraum einen richtig guten Sinn machen ;)", "timestamp_created": 1518369815, "timestamp_updated": 1518369815, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39968506": {"recommendationid": "39968506", "author": {"steamid": "76561197966918652", "num_games_owned": 260, "num_reviews": 49, "playtime_forever": 74, "playtime_last_two_weeks": 0, "last_played": 1518751917}, "language": "english", "review": "I totally went from Flab to Fab!  Isn't that how all workout ads start?  I hope I did that right.\n\nANYWAY... This game was crazy fun.  It's a music based workout game!  Everybody loves those.  Think DDR, in VR, but instead of using your feet, you're using your arms.  According to the game I burned about 500 calories in about 15 minutes.  Considering that I was sore AF for the next 4 days after playing... I believe it!\n\nThe music was fun.  I liked it a lot actually.  The graphics are simple but effective.  The gameplay is challenging and designed to be so.  Solid 9/10 game here.  The only reason it didn't get 10/10 is because I can't figure out one damn jump or not jump.. The arrow says up and ... whatever.  Check out my video below to see what I mean.  :)\n\nSide note.  I'm a Steam Curator for VR games and Steam offered this game to me for free.  Glad I took it.\n\nYT Vid:  https://youtu.be/uAwMNo_gIdc\nCurator Page:  http://store.steampowered.com/curator/29354222/", "timestamp_created": 1518237317, "timestamp_updated": 1518237317, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "39933130": {"recommendationid": "39933130", "author": {"steamid": "76561198190583595", "num_games_owned": 76, "num_reviews": 2, "playtime_forever": 81, "playtime_last_two_weeks": 0, "last_played": 1518433832}, "language": "koreana", "review": "진심 운동이 되는 VR게임이고 지금까지 구매했던 VR게임중에제일 유익한 게임이네요.", "timestamp_created": 1518106516, "timestamp_updated": 1518106516, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39918292": {"recommendationid": "39918292", "author": {"steamid": "76561198040502252", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 3264, "playtime_last_two_weeks": 959, "last_played": 1521495938}, "language": "english", "review": "Really nice game.", "timestamp_created": 1518043747, "timestamp_updated": 1518043747, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39916984": {"recommendationid": "39916984", "author": {"steamid": "76561198418155277", "num_games_owned": 64, "num_reviews": 8, "playtime_forever": 48, "playtime_last_two_weeks": 0, "last_played": 1513712569}, "language": "english", "review": "Surprisingly addicting! I did quite a bit of kickboxing back in the day so I personally really enjoyed this experience, and it felt quite badass to be honest. Being able to use your own music is freaking awesome, and the mechanics in general are just on point. Love it.", "timestamp_created": 1518038244, "timestamp_updated": 1518038244, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "39893742": {"recommendationid": "39893742", "author": {"steamid": "76561198078066707", "num_games_owned": 35, "num_reviews": 3, "playtime_forever": 497, "playtime_last_two_weeks": 8, "last_played": 1521484328}, "language": "english", "review": "11/10. Would love to feel tired and sweaty again after a good workout!\n\nThe actual review:\n=============\nLove, love, love this game! I am REALLY impressed at the features and implementations that FitXR has added. My main thing that I like is how responsive the developers are to the community. Have a feature request, let the developers know on the appropriate thread. Have a bug that you've noticed (keeping in mind that this game is in early access), tell the developers! At the time of writing, the developer response time is also VERY quick. I like how the community's ideas, problems, and opinions are being taken into account unlike a very good portion of all other games.\n\nAll in all, this is THE GAME to play if you want to lose pounds, feel great, and enjoy listening to your own music. I haven't tried out any other modes than the training mode, but I like how they are using REAL fitness coaches' input for the other modes. THIS IS WHAT VR WAS MADE FOR!!!", "timestamp_created": 1517943739, "timestamp_updated": 1517943739, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39892979": {"recommendationid": "39892979", "author": {"steamid": "76561198169215221", "num_games_owned": 147, "num_reviews": 11, "playtime_forever": 290, "playtime_last_two_weeks": 0, "last_played": 1517977200}, "language": "english", "review": "I very much reccommend this game for both workouts, and if you like an active rythm game to music you can choose. I use it for an added cardio workout to my usual workout routine, and it's the most enjoyable way to do that!\n\nMy reccommendations would be to:\n````````````````````````````````````````````````````\n - Make your own music tracks have more intricate punching patterns, as I feel it's the same thing no matter the song chosen, and is too easy even on the chosen hard difficulty. This makes me just play the harder pre-made workouts and listen to my own music on the side so I can get the intesity of the workout with my own music.\n\n - Let you move your middle position of the play area where you want, like the games that get you to move by dragging yourself around. I have the smallest possible room-scale area and the optimal punching space is a little too far forward to my liking, but this is a tiny detail at best.\n\n - Add more genres of ingame music workouts. There's only house and ONE \"rock\" option that still sounds like a techno song, so there's not much variety of ingame music, and as I said when you choose your music it's too easy, so that gets rid of the difficulty of the pre-made workouts that have the one genre of music.\n\nTHAT'S IT, that's the only 3 things I myself have noticed I don't like 100% about it, but those are only VERY tiny annoyances at best, and do not hinder my playing experience enough to care. I really can't think of any serious problems with the game as it covers anything you'd want in a game like. this. Your own music workouts, PERFECT hand positioning to your liking, variety of workouts on a large scale of intensity, and a decent variety of play areas/levels that keeps growing.\n\nFinal note is that I love how this has been updated frequently and has VERY much improved since I first got BOX VR. So much has improved.\n\nAs someone who is HUGE on VR stuff I highly reccommend this game/workout tool.\n\nSolid 8/10.", "timestamp_created": 1517941249, "timestamp_updated": 1517941249, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39876465": {"recommendationid": "39876465", "author": {"steamid": "76561198160415493", "num_games_owned": 125, "num_reviews": 13, "playtime_forever": 110, "playtime_last_two_weeks": 0, "last_played": 1520203139}, "language": "english", "review": "Best exercise app for VR, IMO. Needs a bit more content, but it being updated regularly. Reccomended.", "timestamp_created": 1517871749, "timestamp_updated": 1517871749, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39868822": {"recommendationid": "39868822", "author": {"steamid": "76561198347192961", "num_games_owned": 28, "num_reviews": 8, "playtime_forever": 126, "playtime_last_two_weeks": 23, "last_played": 1520956291}, "language": "german", "review": "Tanz wie ein Schmetterling und stich wie eine Biene :) Super genial", "timestamp_created": 1517846701, "timestamp_updated": 1517846701, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39842120": {"recommendationid": "39842120", "author": {"steamid": "76561197966704610", "num_games_owned": 160, "num_reviews": 3, "playtime_forever": 413, "playtime_last_two_weeks": 0, "last_played": 1519996471}, "language": "english", "review": "Love this game.  Its good fun but it also makes your break a sweat.  I did an hour session today and I felt as tired as I am after a 30 minute run, that was mixing it between both endurance, power and speed programs.  It would be nice if there was more upbeat music, some of the music is great, has an awesome beat which I find gets you more into it and makes you work harder I find.  Other music is ok but not an engaging to a workout so I find myself also unknowingly not working as hard.  Few extra workouts would be good and maybe some dodging things to add into the mix.  I'd give this a 5/5 for its early access state but if this was the final release I would go for 4/5 just because of the things above and the occasional bug here and there.  Please keep of developing this game its really very good.", "timestamp_created": 1517749174, "timestamp_updated": 1517749174, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39824570": {"recommendationid": "39824570", "author": {"steamid": "76561198799317528", "num_games_owned": 6, "num_reviews": 3, "playtime_forever": 160, "playtime_last_two_weeks": 0, "last_played": 1518890060}, "language": "english", "review": "Recommend, great work out, you can make it even tougher on yourself depending on if you really put max effort into each punch and dodge quickly and with somewhat exaggerated movements.  Can even jog in place to make it extra tough.  My HR was high and I was sore the next day.  It kept me motivated because it so engaging and I like the music.  Buy it!", "timestamp_created": 1517687516, "timestamp_updated": 1517687516, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39824094": {"recommendationid": "39824094", "author": {"steamid": "76561197970789189", "num_games_owned": 200, "num_reviews": 7, "playtime_forever": 263, "playtime_last_two_weeks": 12, "last_played": 1521271098}, "language": "german", "review": "Super ...schon erstaunlich ,wie schweißtreibend spielen sein kann.Ich dacht noch so:\" na ja ,kann man ja mal zu Hause vorführen,is ja \"nur\" Bällchen haun ...\" ...nach 10 Minuten braucht ick n Sauerstoffzelt!! \nSehr einfach gestrickt ,aber verlangt einem doch ganz schön was ab.\nklare Kaufempfehlung!!", "timestamp_created": 1517686364, "timestamp_updated": 1517686364, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39783702": {"recommendationid": "39783702", "author": {"steamid": "76561197971103467", "num_games_owned": 584, "num_reviews": 9, "playtime_forever": 254, "playtime_last_two_weeks": 0, "last_played": 1518405296}, "language": "english", "review": "A solid workout and fantastiuc rhythm game.\n\nThe first time I played this game it kicked my but. I was breathing heavy, I had ahard time keeping up and I guinely wasn't very good. It probably didn't help that I immediately started off by playing my own music. A week later and I'm able to keep up fairly well with a lot of the faster songs, amd working my way through the built in workouts, which are very well made, and feel much more able to breath. My endurance has definitely increased and I find myself wanting to play more and more, even if I'm tired or aching from the last session. I often find myself thinking \"man this song would be really fun to play in boxvr\" and then can't wait to get home and try it. I also find myself dancing around a lot more when I play instead of just standing there and punching to the beat.\n\nIf you are looking for something fun to encourage you to be a little more active and push yourself this game is a fantastic buy.", "timestamp_created": 1517549270, "timestamp_updated": 1517549270, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39761058": {"recommendationid": "39761058", "author": {"steamid": "76561198191570154", "num_games_owned": 193, "num_reviews": 7, "playtime_forever": 787, "playtime_last_two_weeks": 0, "last_played": 1517042543}, "language": "schinese", "review": "很不错的游戏，用来健身很棒，很有感觉，希望能多一点音乐", "timestamp_created": 1517459227, "timestamp_updated": 1517459227, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39760628": {"recommendationid": "39760628", "author": {"steamid": "76561198025400295", "num_games_owned": 194, "num_reviews": 22, "playtime_forever": 1461, "playtime_last_two_weeks": 476, "last_played": 1521687741}, "language": "english", "review": "I now know the joy of working out to the beat of my favorite weeb music\n\nTHE FUTURE IS NOW \n\n[h1]  HERE WE GO GOOD TO GO NEPUTUNU HERE WE GO GOOD TO GO NEPUTUNU HERE WE GO GOOD TO GO NEPUTUNU HERE WE GO GOOD TO GO NEPUTUNU HERE WE GO GOOD TO GO NEPUTUNU HERE WE GO GOOD TO GO NEPUTUNU HERE WE GO GOOD TO GO NEPUTUNU HERE WE GO GOOD TO GO NEPUTUNU HERE WE GO GOOD TO GO NEPUTUNU HERE WE GO GOOD TO GO NEPUTUNU [/h1]", "timestamp_created": 1517456991, "timestamp_updated": 1517457043, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39760477": {"recommendationid": "39760477", "author": {"steamid": "76561198241852756", "num_games_owned": 164, "num_reviews": 21, "playtime_forever": 955, "playtime_last_two_weeks": 0, "last_played": 1518496713}, "language": "english", "review": "This is an incredible game, with the plus of making me active.  I've been waiting for something as fun as this, that can also be intense enough to be a workout.  This is the first time that I'm looking forward to exercising!", "timestamp_created": 1517456237, "timestamp_updated": 1517456237, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39742695": {"recommendationid": "39742695", "author": {"steamid": "76561198049554232", "num_games_owned": 942, "num_reviews": 1, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1520304976}, "language": "english", "review": "I love martial arts. I love rhythm games. I love VR. BOXVR was basically made for me. While the early access version is a little lacking in environments, workouts, and songs, it shows a lot of promise--and frankly, I love playing it in its current unfinished state, so anything else is icing on the cake.\n\nOne thing: its calorie count runs about 10% high for me, according to my heart rate monitor and Endomondo. Not too bad, but keep it in mind. That said, 250 calories in 11 minutes is still pretty darn good (actual count, not the BOXVR estimation).", "timestamp_created": 1517385055, "timestamp_updated": 1517385055, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39722926": {"recommendationid": "39722926", "author": {"steamid": "76561198802236306", "num_games_owned": 7, "num_reviews": 1, "playtime_forever": 54, "playtime_last_two_weeks": 0, "last_played": 1516523632}, "language": "japanese", "review": "ちゃんとエクササイズになります。\n10分もプレイすれば汗ばみますので、そのつもりで。\n", "timestamp_created": 1517303273, "timestamp_updated": 1517303273, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39673378": {"recommendationid": "39673378", "author": {"steamid": "76561198038325138", "num_games_owned": 200, "num_reviews": 2, "playtime_forever": 74, "playtime_last_two_weeks": 0, "last_played": 1518584184}, "language": "english", "review": "I gotta say, I was pretty skeptical about this when I first saw it. \"A fun looking VR game, that gives you a workout? Impossible! Working out can't be fun, and there is no way you can effectively do it in a video game!\" Thats what I thought before I tried it out, and let me tell you, I couldn't have been more wrong. \n\nI just got done playing my first half hour in this game, and I jumped straight into the harder workouts thinking it would be super easy, and man was I wrong. I worked up a sweat in about 10 minutes, and I loved it. I've never had a VR game actually make me sweat like that, or wear me out so quickly. I feel like I just got back from the gym after just 30 minutes. Not only that, but it is so much freaking fun. \n\nThe included music pumps you up, but if that isn't for you, you have the ability to play your own music which the game will build a workout from. It also cheers you on in a sense by giving you encourageing messages when you hit a hard combo. \n\nIf you are at all skeptical about this game like I was, do yourself a huge favor and buy it. It is worth every penny.\n\n\n\n", "timestamp_created": 1517117011, "timestamp_updated": 1517117011, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39669117": {"recommendationid": "39669117", "author": {"steamid": "76561197979327824", "num_games_owned": 78, "num_reviews": 2, "playtime_forever": 382, "playtime_last_two_weeks": 0, "last_played": 1518368969}, "language": "german", "review": "Definitiv das beste Spiel um Fit zu werden oder abzunehmen etc.\n\nMacht riesen Spass!", "timestamp_created": 1517099457, "timestamp_updated": 1517099457, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39668386": {"recommendationid": "39668386", "author": {"steamid": "76561198070054592", "num_games_owned": 53, "num_reviews": 1, "playtime_forever": 259, "playtime_last_two_weeks": 0, "last_played": 1519276831}, "language": "english", "review": "Only thing i don't like is the switching stances, there should be an option to pick what stance you wanna play in, as well as a both option. Everything else, A+ definite buy.", "timestamp_created": 1517096858, "timestamp_updated": 1517096858, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39662073": {"recommendationid": "39662073", "author": {"steamid": "76561198136421655", "num_games_owned": 366, "num_reviews": 105, "playtime_forever": 218, "playtime_last_two_weeks": 0, "last_played": 1518607571}, "language": "english", "review": "So far I have to give this thumbs up.  \nhttps://www.youtube.com/watch?v=vhdArjgJTd4\nThe techniques are very simple, the music is good and when combined they make for a good workout and that is exactly what this is, there is no game, no other distraction just a workout (there is a score leader board too).\n\n== RECOMMENDATIONS ==\n- Profiles.\n- Warm-Up.\n- Make more use of high & low orbs (watch my review).\n- Make more effort to accurately track calories (check intensity).\n- Sometimes positive message get in the way!  Adjust or replace with audio.\n- Change positive messages to audio congrats? DLC perhaps Language specific.\n- Option for bigger bubbles for less accurate people.\n- More exercises (harder) without knee bending (for those with poor knees).\n- Challenge mode, where your score is compared to the #1 on leaderboard.\n- For longer exercises a sweat break, these headset get hot and sweat stings!\n- Extra Challenge where there are wider punching zones..step left to get the ones on left etc...\n- When in rest (mid workout) show how long there is to rest...time for sweatbreak or water?\n- Knee to hand movement?\n- Use thumbstick buttons for main menu...stop accidental clicks.\n\n\n== PRO ==\n- Looks good.\n- Audio is Good.\n- Design is Good.\n- Workouts are fun and enough to make you sweat (beginner’s mode v.easy).\n- Caters for all fitness levels.\n- You can play your own music.\n- Tracks data quite well, lots of info available...Accuracy, score, calories, # of workouts.\n- Works one side of body then the other side.\n\n== CON ==\n- No way to have profiles, kind of catered for just 1 player.\n- Not many workouts.\n- Playing own audio does not match the rhythm.\n- Potential for injury as very active (not really a con just a FYI).\n- The combos are sometimes unnatural - L.Jab/L.cross followed by a L.Uppercut does not flow well.\n- I feel that none of the workouts have really utilised the potential this game has...yet\n- No Steam workshop (for workout combos for a specific song).\n- Calories are not accurate.\n\n\n== FULL REVIEW ==\nThere is a small number of pre-designed workouts (approx. 10-12) and they progress in speed and required effort pretty well.\n\nIn each workout there are colour coded floating orbs and you will perform, jabs, uppercuts, crosses and also have to squat and avoid horizontal bars.\n\nThere are also a number of locations; the main gym is my personal choice but there is a Christmas themed version too which plays slightly diff with actual presents occasionally coming at you (no idea how to deal with those).\n\nThe game tracks quite a bit of information, calories burnt (not sure if accurate) sessions completed and your score; there is a leader board of highest scores.  It is not clear atm what constitutes a max score, perhaps a combination of power/effort per punch and accuracy?\n\nYou do need good balance for this game, the speed and effort put in can at times throw you off your footing and with a headset on it makes it a little harder to recalibrate yourself.\n\nSometimes I do feel the workouts are in-time to music, sometimes they are not, or are just off.  Playing with your own music though the game does not match the beat, which is a bit of a shame and a missed opportunity IMHO (there are other similar games which do).\n\nThe only real gripes I have with the game are that some combinations don't feel right or natural. Left jab followed by a left uppercut causes a strange sensation in my arm; there is a break of natural flow when that happens.  It is as though someone sat at a PC and just selected a punch from a list of available punches without really trying it out first.\n\nFinally my only other concern is...will it get repetitive? With such a small number of exercises available I feel that things will become mundane too quickly.  Steam workshop would be the obvious solution (although audio might hinder this/could upload a workout for `x` song and you have to provide the song I guess) \n\nIs worth the money, my gut instinct is that it will be, only time will tell.", "timestamp_created": 1517078707, "timestamp_updated": 1517566400, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503496", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39629126": {"recommendationid": "39629126", "author": {"steamid": "76561197968549641", "num_games_owned": 55, "num_reviews": 5, "playtime_forever": 1097, "playtime_last_two_weeks": 71, "last_played": 1521300189}, "language": "english", "review": "Absolute great workout for me, this is what I looked for! Perfect focus on the workout from professionals and it's fun, what is necessary to continue on regular basis. Absolute recommended for ppl who want to have a daily easy workout with fun/motivation. You can select 3 minutes workout as well as 43 minutes - it's up to you.", "timestamp_created": 1516975776, "timestamp_updated": 1516975776, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39627822": {"recommendationid": "39627822", "author": {"steamid": "76561197994030688", "num_games_owned": 29, "num_reviews": 2, "playtime_forever": 310, "playtime_last_two_weeks": 0, "last_played": 1520455619}, "language": "english", "review": "Immediately after downloading this game, I played it until I could barely stand. Great fun, great workout. Definitely get a sweat cover for your headset; this would also likely be a good opportunity for the developers to advertise a complementary product.\n\nA few things that could be improved:\n-Quit to menu confirmation --> I quit to menu ~20 minutes into a 25 minute workout by mistake, making me sad.\n-More guidance on appropriate stance\n-Better beat-matching with personal music; it's not bad, but not quite there either\n-Multiple user profiles", "timestamp_created": 1516971765, "timestamp_updated": 1516971765, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39624892": {"recommendationid": "39624892", "author": {"steamid": "76561198018195459", "num_games_owned": 148, "num_reviews": 13, "playtime_forever": 366, "playtime_last_two_weeks": 0, "last_played": 1517153876}, "language": "english", "review": "I have been really enjoying this. v.0.12.6589 made it substantially better than when I first purchased it in December. The one thing I hope is on the roadmap is adding some variety to the locations.", "timestamp_created": 1516960017, "timestamp_updated": 1516960017, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 186, "total_negative": 8, "total_reviews": 194}}
