{"reviews": {"39467333": {"recommendationid": "39467333", "author": {"steamid": "76561198022859655", "num_games_owned": 69, "num_reviews": 2, "playtime_forever": 3765, "playtime_last_two_weeks": 3592, "last_played": 1516482205}, "language": "english", "review": "Really good command simulation and wargame. I love all of the communiques you get from subordinates that you have to make decisions on. I know there is an \"Easy Mode\" switch, but I wish there were a few more mechanical ways to modify the AI side other than softer winters and less paperwork. Something like, AI unit Strength:\n150%\n125%\n100%\n75%\n50%\n25%\n\nAll-around a great game!", "timestamp_created": 1516395685, "timestamp_updated": 1516395685, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39220674": {"recommendationid": "39220674", "author": {"steamid": "76561198232209448", "num_games_owned": 63, "num_reviews": 27, "playtime_forever": 384, "playtime_last_two_weeks": 0, "last_played": 1514742838}, "language": "english", "review": "Nah, sorry, terrible game. Mini politcal game is interestiing but doesn't make up for the broken main game. Map size/hex size too small so encirclements are virtually impossible.  Made all the right moves, moved nothing 1st turn. 0 realism as far as historicity is concerned. Save your money. Gary Grigsby's War In The East is better, although I don't really see the appeal of that game either. Just a grindfest. I used to like Gary Grigsby. Now he makes crap games. Slitherine might have some good titles but this one isn't one of them.", "timestamp_created": 1515546447, "timestamp_updated": 1515546447, "voted_up": false, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.501333", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38323327": {"recommendationid": "38323327", "author": {"steamid": "76561198094817878", "num_games_owned": 9, "num_reviews": 2, "playtime_forever": 11368, "playtime_last_two_weeks": 2528, "last_played": 1516482358}, "language": "english", "review": "Great game. The whole experience is immersive and satisfying. The only problem I faced is that  it gets overwhelming at times.", "timestamp_created": 1513341681, "timestamp_updated": 1513341681, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501916", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37495942": {"recommendationid": "37495942", "author": {"steamid": "76561197990394288", "num_games_owned": 89, "num_reviews": 10, "playtime_forever": 5650, "playtime_last_two_weeks": 1889, "last_played": 1516518067}, "language": "english", "review": "This game is absolutely fantastic, I've played tons of it at a friend's place and I absolutely love how it combines grognard strategy with dynamic settings and events, including \"cards\" to play and including a full fledged weather model. Each game is different and new, yet true to history and plausible, and this game completely deserves high recognition.", "timestamp_created": 1511605052, "timestamp_updated": 1511605052, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.548715", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37211072": {"recommendationid": "37211072", "author": {"steamid": "76561197999514210", "num_games_owned": 226, "num_reviews": 2, "playtime_forever": 654, "playtime_last_two_weeks": 0, "last_played": 1511550177}, "language": "english", "review": "Immersive campaign", "timestamp_created": 1511473061, "timestamp_updated": 1511473061, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501916", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37207938": {"recommendationid": "37207938", "author": {"steamid": "76561198265058831", "num_games_owned": 60, "num_reviews": 5, "playtime_forever": 10, "playtime_last_two_weeks": 0, "last_played": 1511471172}, "language": "english", "review": "Feels clunky when moving around and the controls are very complicated. Other than that cool idea and nice game.", "timestamp_created": 1511472117, "timestamp_updated": 1511472117, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.498084", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36126165": {"recommendationid": "36126165", "author": {"steamid": "76561198024430563", "num_games_owned": 71, "num_reviews": 3, "playtime_forever": 3366, "playtime_last_two_weeks": 0, "last_played": 1513375433}, "language": "english", "review": "Its a keeper for sure.", "timestamp_created": 1509317456, "timestamp_updated": 1509317456, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501916", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35955991": {"recommendationid": "35955991", "author": {"steamid": "76561198067189007", "num_games_owned": 314, "num_reviews": 29, "playtime_forever": 1348, "playtime_last_two_weeks": 0, "last_played": 1508082600}, "language": "english", "review": "I bought this game after Decisive Campaigns Blitzkrieg. \n\nAnd although I certainly recommend it, to me, differently from most reviews here, I must say that I liked the previous game better. One of the changes I strongly dislike is the impossibility of totally resetting the initial positions and force organisation, that is, the strategic planning of the campaign. That's my favourite part of most wargames, as the actual execution of the plans established by others (historical) feels more like a puzzle or just a playthrough. \n\nAlso, the fact that the AI doesn´t play by the same rules as the player is something I dislike too. I prefered the supply system in Decisive Campaigns Blitzkrieg, as the one in Barbarossa pretty much prevents the sweeping advances and wide encirclements one associates with early war Germans and that, afaik, happened in real Barbarossa. \n\nSpace is tightly covered by the soviets and one has to grind through the units to get some small encirclements. Of course supplies were an issue. And the soviets fought hard. But the huge victories achieved by Germany in these early stages of the war in the eastern front were precisely due to the wide open spaces their mobile forces could exploit. Disappointingly, that's something I felt much better modeled in Decisive Campaigns Blitzkrieg than in Barbarossa, although in my understanding it should have been something much stronger in the russian plains than in France.\n\nAlas, this title is still great. I just wanted to give a different perspective, as reviews are almost unanimously positive and I guess there are some other wargamers that'd have similar preferences to my own and should be interested in the critique.", "timestamp_created": 1508803192, "timestamp_updated": 1508803192, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.539632", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35317320": {"recommendationid": "35317320", "author": {"steamid": "76561198102021408", "num_games_owned": 226, "num_reviews": 25, "playtime_forever": 1333, "playtime_last_two_weeks": 0, "last_played": 1506908906}, "language": "english", "review": "excellent game. 51 positive reviews out of 52 says it all. \n\nhistorical immersive easy to learn...fun!\n\nhighly recommended \n", "timestamp_created": 1506731881, "timestamp_updated": 1506731881, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.581625", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35186792": {"recommendationid": "35186792", "author": {"steamid": "76561198015017512", "num_games_owned": 95, "num_reviews": 35, "playtime_forever": 6770, "playtime_last_two_weeks": 0, "last_played": 1513442283}, "language": "english", "review": "I bought this game not realising how magnificent this game is and I hope you have the same experience. I like to complete a game before writing a review but 90 hours in and with my game hours the third highest of all of my games (next to Motorsport Manager as 2 and Pike and Shot Campaigns as 1), I feel happy in making this review. Simply: If there was an award for the “Best Ever wargame made for PC”, I think this would win it hands down.  This is the best WW2 strategy and tactics simulator you will get your hands on (and yes, even looking at you Gary Grigsby).  I don’t choose my words lightly but when you have a wargame that gets 100% positive reviews it makes you sit up and take notice of why it’s so good. Everything is as near to perfect a you will find in a wargame:\n1 – The roleplaying element is perfect, unique for this type of game and what sets it apart from Gary Grigsby games. Instead of shoving counters around a map, I actually AM the general in command, I have my superiors to keep happy, colleagues of similar rank and subordinates. In this game you don’t just push around counters but you have to care about people (or not). Decisions can include whether to help with propaganda efforts, whether to join the Fuhrer’s party (I didn’t realise until now that most officers are Antis).  You can turn off “moral” decisions, but if not, you’ll have to choose whether to help or hinder the SS completing “special tasks” and you will be considered for war crime trials at the end.  Overall, there’s about 10<15 people to interact with and keep happy.  Making them unhappy will give significant penalties e.g. Artillery won’t show up, maintenance is more “expensive”, Air Support less effective, etc. etc.\n2 – The Grand Campaign simulation for WW2 has finally been simplified without losing detail (again, looking at Gary Grigsby here – you are FAR better starting with this game or transitioning into this system from Gary Grigsby, as I did).  Tutorial is via video in game and you will need to watch them twice to understand the game (perhaps an hour+ effort).  You’ll also panic when first seeing the interface – “why can’t I move my army” “how do I make basic decisions”. Before you realise: The first turn is a decision turn only and all troops have 0 Action Points turn one, and each decision does indeed have around 5 screens per decision (1 to make the decision, 1 to provide a historical background (how many games provide this historical backround?), the rest being view points from affected parties to help you decide a decision).  Although a lot of screen shots show NATO symbols you can play with a more graphical interface (which I do) to instantly see if a Regiment is Infantry or Panzer. Movement and Attacking is so simple – click a hot key and move, or choose troops to attack.  Don’t over-stack hexes and keep watch on a units Morale and Cohesion.  If it gets too low you can play a “card” to rest them.\n3 – The card system is a fantastic idea.  Cards are used to control which units have “command focus” (i.e. leaders bonus), how to use air support (very happy air support is represented by cards in this game, and you simply choose where Army Group North/Centre/South airfields are based), to rest units, to deploy artillery or where to deploy reinforcements, etc.  Each card has a Political Point (PP) cost and you need to spend PP on either cards or the roleplaying decisions (of which there could be perhaps 6<15 per turn). You get extra PP for each decision you have to deal with and each city you take.  Your relations dictate how expensive an action is to take in PP cost – if you have poor relations with a front leader, don’t expect decisions on that front to be “cheap”.  I love the tutorial where the designer says “play and forget”.  i.e. simply play the cards once and that bonus will continue to be provided until an event means it cannot or you choose to change which unit receives the bonus. \n4 – The AI is very good and a big challenge (you can change difficultly settings to suit).  It will form defensive lines, complete counter-attacks, withdraw at some points. It’s never easy to get towards the objectives, but highly worth spending your time pondering over things.  Luckily, you do have intelligence reports (should you choose to read them) that will help in gauging a threat in a certain area by giving limited oversight into the fog of war.  In fact, you get a LOT of great reporting in this game (but you DON’T have to be a bean counter and read it all to play this game).\n5 – The logistics and weather are simulated VERY well. Logistics is via Train and Truck and you have a limited number of both that will automatically move around (don’t permanently lose trucks/trains – else you’re in BIG trouble!!! Keep them well MAINTAINED).  The player can affect efficiency and wear/tear – don’t make your trucks run more than 10 hex to a Panzer HQ else they will wear out and spend more oil than the oil being delivered.  In this respect, oil is a HUGE and critical problem.  Your supplies are extremely tight and running a Panzer Group in “Blitzkrieg” posture (gaining attacking bonuses) uses A LOT of fuel. Often my North and South groups ran out of fuel.  If you are out of fuel, you simply cannot move mechanized vehicles – Panzers, etc.    It gets very hard and restricted to say the least (and when you move your “Forward Supply Base” supplies of oil are NOT delivered at all for one turn – you must use stored oil, that’s IF you have it). Trains will get supplies to your “Forward Supply Base” but your engineering staff will need to convert the track to German gauge first (again, an automatic element which depends on the decision cards you take, relationships and whether it is physically possible to extend the track – is it in enemy territory or not). I have seen mud represented which slows movement up, terrain has an effect on battles by operating troop types at x% effectiveness (shown in the clear display screen if you hover over the terrarin type in the top centre).\n6 – The graphics/charts are clean and neat, not cluttered at all.  There’s a HUGE number of statistics in this game for people who like to see detail, but you don’t need to read it all.  You can see amount of kills, equipment in use, very detailed battle reports for each engagement, detailed Order of Battle, Daily Reports, reports on most tired units, lowest morale, etc.  \n7 – The game measures you /5 in all areas such as Strategy/Tactics/Relationships/Ethics, etc. – all are important.  Tactics are hugely important in this game, you really do want to make sure you attack at the right time with the right units else poor planning will be punished harshly (you make end up with units being disciplined and receiving permanent negative bonuses rather than awards for a great performance).\n8 – Supplies and replacements are challenging to manage.  You need supplies at the divisional level (e.g. Ammo, etc.) to mount offensive battles, but resources are very limited. So, you can accept the default distribution of supplies, or, toggle supplies to be received by each unit (micromanagement). The same is true of “replacements” to reinforce the units.  You CAN micromanage, or choose to ignore that aspect without a “huge” effect. \nThere’s just “a lot” in this game, but it’s presented in a clean and simple way.  If you fancy getting this game because you are interested in WW2 grand strategy and tactical games (on a huge scale) I would 100% say get this today, give it a go for 2 hours, and once you “get it” and its mechanics, you won’t look back (you will need to re-start the campaign a few times to get the hang of this).  The designer is not just any designer but a master of his genre, very much like Sid Meier is a master of business and strategy games.  When you get a passionate master who works on something, you know the end result is going to be very special indeed.  Congratulations on this masterpiece!\nMy rating – 10/10 100% Must Buy", "timestamp_created": 1506274900, "timestamp_updated": 1506274900, "voted_up": true, "votes_up": 25, "votes_funny": 0, "weighted_vote_score": "0.743821", "comment_count": "11", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33560104": {"recommendationid": "33560104", "author": {"steamid": "76561198018366608", "num_games_owned": 405, "num_reviews": 14, "playtime_forever": 83370, "playtime_last_two_weeks": 0, "last_played": 1500126326}, "language": "english", "review": "Very good game. A must for a wargamer. High replayability. \nAs a negative aspects:\n\n- I like to have absolute control over logistics, like trains and trucks not depending on random decisions. I like micromanagement to decide where and when I want to push into enemy as hard as possible.\n- I like to have absolute control over air force, not having air power into an abstract layer and limited to automatic support or specific logistic missions.\n- I found this game extremely depending on random, not only combat results, also decissions results, partisans attacks, everything. But worst it's that decisions would appear randomly too. This negates the player the ability to have absolute control over the battlefield.", "timestamp_created": 1500127295, "timestamp_updated": 1500127336, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.497192", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33536519": {"recommendationid": "33536519", "author": {"steamid": "76561198076800204", "num_games_owned": 125, "num_reviews": 9, "playtime_forever": 4794, "playtime_last_two_weeks": 0, "last_played": 1502459416}, "language": "english", "review": "When I was a kid in the 90s, I remember reading about a game called \"road to moscow\".  It was going to be the leap forward in wargames.  Put you in command, where your division and corp commanders wouldn't do exactly what you wanted, and where you weren't a god moving 100's of counters around a map.\n\nThat game, was way too much for the systems of the 90's and I never got to play it, but I always have been hoping someone would be able to build it.  This game is as close to that as I can imagine.  It is more than a wargame, it is a general simulator, and I cannot recommend it enough.  \n\nPlease support great games like this one.  (and no I don't have anything to do with the publisher or designer, just want to see more games like this made!)", "timestamp_created": 1500040883, "timestamp_updated": 1500040883, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.551146", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33511969": {"recommendationid": "33511969", "author": {"steamid": "76561198006899983", "num_games_owned": 263, "num_reviews": 18, "playtime_forever": 3580, "playtime_last_two_weeks": 0, "last_played": 1502646949}, "language": "english", "review": "This is kinda maybe the best wargame on PC right now. It needs some time to hook you, so be patient. When its rolling it kinda like to replay real barbarossa in person. You will regret decisions, ask why Leeb cant agree with you and why, why dont Panzergrpoups move - only to find that running  war is not only pushing counters, but managing between superiors and subordinates, arguing with supply department, dealing with political obstacles and watching all your plans get ruined.", "timestamp_created": 1499979604, "timestamp_updated": 1499979604, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.543684", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31530826": {"recommendationid": "31530826", "author": {"steamid": "76561198047740800", "num_games_owned": 56, "num_reviews": 4, "playtime_forever": 2199, "playtime_last_two_weeks": 0, "last_played": 1493837648}, "language": "polish", "review": "Bardzo dobra gra. Polecam!", "timestamp_created": 1493843223, "timestamp_updated": 1493843223, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502653", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31497690": {"recommendationid": "31497690", "author": {"steamid": "76561198004615000", "num_games_owned": 135, "num_reviews": 28, "playtime_forever": 2960, "playtime_last_two_weeks": 0, "last_played": 1502864862}, "language": "english", "review": "Best Eastern front there is out there... It beats Gary Grigsby's War in the East for me only because of the role playing feature. It adds so much more immersion and a feel of actually fighting a war.  \n\nOf course, War in the East has more depth into it but anyway.  If you bother to look at review, its because you know you might like it, and im here to tell you, you WILL like it.", "timestamp_created": 1493686536, "timestamp_updated": 1493686536, "voted_up": true, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.606325", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30981501": {"recommendationid": "30981501", "author": {"steamid": "76561198006621268", "num_games_owned": 170, "num_reviews": 27, "playtime_forever": 4970, "playtime_last_two_weeks": 0, "last_played": 1507979651}, "language": "english", "review": "A grand strategy masterpiece.", "timestamp_created": 1491494641, "timestamp_updated": 1491494641, "voted_up": true, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.550695", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30478299": {"recommendationid": "30478299", "author": {"steamid": "76561198022296391", "num_games_owned": 141, "num_reviews": 61, "playtime_forever": 1398, "playtime_last_two_weeks": 0, "last_played": 1494118630}, "language": "english", "review": "I love this game.  It's everything I've been missing since HOI3 decided to take a left turn and dump their echelon battle system for a UEIV style combat system.  The detail in this game is astounding, but what is more impressive is how they put it into a UI that is so simple to get after a few starts.  And, what's intimidating is that this is a challenging game at it's \"normal\" or lowest AI setting....I wonder how it's going to shred me when I start increasing that?  It's a great beer and pretzel game when you have a snow storm or a boring weekend day game.  I love the whole game, and if you like strategy, I would pick it up...if any of you want to try out the multiplayer with me, just give me a buzz....", "timestamp_created": 1489348224, "timestamp_updated": 1489348224, "voted_up": true, "votes_up": 9, "votes_funny": 1, "weighted_vote_score": "0.551064", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29885959": {"recommendationid": "29885959", "author": {"steamid": "76561198002138675", "num_games_owned": 179, "num_reviews": 4, "playtime_forever": 1341, "playtime_last_two_weeks": 0, "last_played": 1490923683}, "language": "english", "review": "Hey, Steam people! \n\nDo you believe wargames should consist of more than just grinding chits against each other?\nDo you want to disabuse yourself of myths about the Axis/Soviet armies during the Great Patriotic War/Operation Barbarossa/the invasion of the Soviet Union?\nDo you like the idea of screaming FUCK YOU, HITLER! when he changes your final objectives right under your nose?\nDo you enjoy getting into arguments about the superiority of trains over trucks (or vice versa, I'm not going to judge)?\n\nIf you said yes, then get this game. It's great fun, especially with another player.", "timestamp_created": 1486944711, "timestamp_updated": 1486944711, "voted_up": true, "votes_up": 18, "votes_funny": 2, "weighted_vote_score": "0.664847", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29871302": {"recommendationid": "29871302", "author": {"steamid": "76561198007341546", "num_games_owned": 35, "num_reviews": 1, "playtime_forever": 34039, "playtime_last_two_weeks": 0, "last_played": 1500643375}, "language": "english", "review": "I have been playing wargames for nearly 20 years. Both on board and on the PC. I seriously believe this is the best PC-Wargame I have come across in all that time! Any serious wargamer should get a copy of this absolutely fabulous game!\n\nIt has a nice emphasis on command & control, logistics and fog of war. All these things that are so often forgotten in wargames... I really don't understand why this game isnt even more popular than it is. As far as I am concerned it's a hidden gem!", "timestamp_created": 1486901335, "timestamp_updated": 1486901335, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.615832", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29018946": {"recommendationid": "29018946", "author": {"steamid": "76561198000185672", "num_games_owned": 380, "num_reviews": 14, "playtime_forever": 2890, "playtime_last_two_weeks": 0, "last_played": 1497805742}, "language": "english", "review": "I would say this is one of the most underrated war games of all times.  \n\nYes, this is a real war game, not Call of Duty or some such thing, in that it focuses on the difficulty of command.  You are part of the command chain, and upsetting your superiors, or even subordinates, can derail your campaign just as easily as picking the wrong units, locations and time to attack.\n\nAnd, unlike much of the other stuff out there, the AI is very competent.\n\nOverall, a fantastic game, that is unfortunately way underrated.", "timestamp_created": 1483568431, "timestamp_updated": 1483568431, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.526784", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "28981654": {"recommendationid": "28981654", "author": {"steamid": "76561197970863127", "num_games_owned": 451, "num_reviews": 2, "playtime_forever": 2026, "playtime_last_two_weeks": 0, "last_played": 1483761938}, "language": "english", "review": "As other have said Decisive Campaigns: Bararossa offers new and fresh additions to traditional hex based wargaming on the Eastern Front. The systems that I find the most engaging and enjoyable are the abstracted but still complex supply system as well as the political point system. \n\nAs turns go by I find myself checking back over the logistics logs, making sure I am not losing supply columns at a dangerous rate. You also have to properly set in motion advances of supply bases with slow downs on the front. Otherwise assaults are halted due to lack of fuel.\n\nThe other system that makes the game more than just hex wargaming is the political point system. As a result of completeing objectives and making starting choices related to Operation Barbarossa the player is given a wide array of choices to take. You will normally not have the points to make all  the choices you would like and as a result strategic thinking is required. What is more important? Rolling the Suppply FOB closer to the front or altering the Airbase in support of Army Group North?\n\nIf it were not for the political system and logistics requirements I believe I would have already easily bulldozed through Moscow. Instead I am on my 3rd play through, the 1st since i activated my key on Steam, with the best chances for victory yet. In the past logistics and mis-mananged choices have created impossible scenarios where I refused to rest armies and stretched supply lines to the point of breaking.\n\nI cannot recommend this game enough. A great title!", "timestamp_created": 1483463496, "timestamp_updated": 1483463496, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.548166", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "28776064": {"recommendationid": "28776064", "author": {"steamid": "76561197972141782", "num_games_owned": 141, "num_reviews": 3, "playtime_forever": 6849, "playtime_last_two_weeks": 0, "last_played": 1484448702}, "language": "english", "review": "Strikes an excellent balance between detail and playability, a challenge for any eastern front game. On top of that, the layering in of political and personal elements is a masterstroke which raises this game above its peers. The variety between campaigns is enough to keep replays interesting, but not so much as to feel random or ahistorical. Convincingly immerses the player in the atmosphere of high command, and from the German perspective, captures the nature of a campaign that begins as unstoppable, begins fraying at the edges, and gradually goes to hell from logistical disasters, weather snafus, political infighting, and the Nazis just being total jerks.\n\nSpeaking of which, another major innovation of this game is that it \"goes there\" regarding the ideology behind the war. Dilemmas regarding \"incidents\" and \"POW food rations\" touch upon themes that, while uncomfortable, nonetheless played a central role in the historical operation. As a result the game feels much more immersive, realistic, and morally interesting than the usual sanitized simulations of this war.\n\nCan you keep the invasion on the rails past the first winter? However it turns out you'll get a juicy debriefing full of stats and narratives, including the results of your very own war crimes trial. After my first playthrough I was moved to read a lot more history on the subject and learned a great deal, even after all these years of being a wargaming grognard.\n\nDon't worry about the price. You'll get your money's worth.", "timestamp_created": 1482981367, "timestamp_updated": 1484442051, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.503279", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28464597": {"recommendationid": "28464597", "author": {"steamid": "76561198034826180", "num_games_owned": 585, "num_reviews": 8, "playtime_forever": 27, "playtime_last_two_weeks": 0, "last_played": 1482978401}, "language": "english", "review": "Great game - challenging and with a lot of replay value - now we need expansions until 1946 ;-D", "timestamp_created": 1482141584, "timestamp_updated": 1482141584, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.568367", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28367808": {"recommendationid": "28367808", "author": {"steamid": "76561197970593560", "num_games_owned": 205, "num_reviews": 5, "playtime_forever": 3583, "playtime_last_two_weeks": 0, "last_played": 1493585860}, "language": "english", "review": "Best wwii strategy game i have ever bought. I play Wite too but for me dcb is more realistic because the cards give much more a feeling to act like a leader. The decisions you must made are not only where you move your divisions/ armys - you must play on the right time the best cards. dcb feels more like a strategy/ rts game - really really great game mechanic. Hope there will be come a sequel.", "timestamp_created": 1481754460, "timestamp_updated": 1481754460, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.518148", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27626073": {"recommendationid": "27626073", "author": {"steamid": "76561198010379575", "num_games_owned": 1180, "num_reviews": 8, "playtime_forever": 5159, "playtime_last_two_weeks": 11, "last_played": 1515779171}, "language": "russian", "review": "У нас было 3 Группы Армий, 181 дивизия, 5 воздушных флотов, пара десятков бригад и целое множество союзников всех сортов и расцветок, а также Гудериан, Манштейн, пачка авиационных асов, Фюрер и тяжёлые осадные орудия. Не то, что бы это был необходимый запас для вторжения. Но если начал вторгаться, становится трудно остановиться. Единственное что вызывало у меня опасение - это Фюрер. Нет ничего более беспомощного, безответственного и испорченного, чем человек зацикленный на ПМВ. Я знал, что рано или поздно он возглавит ОКХ", "timestamp_created": 1480152945, "timestamp_updated": 1480152945, "voted_up": true, "votes_up": 9, "votes_funny": 16, "weighted_vote_score": "0.547632", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26825691": {"recommendationid": "26825691", "author": {"steamid": "76561198030922203", "num_games_owned": 598, "num_reviews": 2, "playtime_forever": 12087, "playtime_last_two_weeks": 0, "last_played": 1511613043}, "language": "polish", "review": "Wyjątkowe połączenie rpg i oldschoolowej, heksowej strategii i jedyna gra strategiczna w której relacje międzyludzkie są równie ważne co aspekt militarny. Jak to w przypadku gier wojennych, nie da się do niej podejść z marszu i grać skutecznie. Wymaga zainwestowania sporej ilości czasu ale warta każdej minuty.", "timestamp_created": 1479929936, "timestamp_updated": 1479929936, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.551225", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26730879": {"recommendationid": "26730879", "author": {"steamid": "76561198019717971", "num_games_owned": 494, "num_reviews": 3, "playtime_forever": 2253, "playtime_last_two_weeks": 0, "last_played": 1480426414}, "language": "spanish", "review": "Un gran wargame. Muy original en su planteamiento con la importancia que tiene la toma de decisiones y los eventos que van surgiendo, que además le dan un pequeño toque estratégico, más allá de que el juego sea un operacional.\nAunque sólo haya una campaña, las posibilidades de rejugarlo son muchas. Hay que darle muchas vueltas a las decisiones de todo tipo que vas tomando.\nEl juego presenta toneladas de información de forma muy original, aunque aquí viene la única crítica: vendría bien que esa información se puediese desplegar (además de como está) más gráficamente, al estilo de los Panzer Campaigns, por ejemplo, en elq ue pidieras resaltar todas las unidades fatigadas o con baja integridad al mismo tiempo.\nEl manual es una joya. Muy detallado y con un montón de ejemplos. \nResumen: un juegazo. Muy recomendable para quienes quieran un wargame serio y muy distinto a los demás wargames (los anteriores Decisive Campaigns incluídos).", "timestamp_created": 1479735645, "timestamp_updated": 1479735645, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.537973", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26697510": {"recommendationid": "26697510", "author": {"steamid": "76561197970556104", "num_games_owned": 61, "num_reviews": 2, "playtime_forever": 5965, "playtime_last_two_weeks": 0, "last_played": 1513028850}, "language": "english", "review": "couple of days to pick up all the gameplay, but very addictive once you have the basics learnt.\nHave one crash on windows 10 no idea why, but thats after playing for over a week with no problems.\n\nPrice seems a little high, but you have lots of  gameplay thats going to last you.", "timestamp_created": 1479582638, "timestamp_updated": 1479582638, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26345325": {"recommendationid": "26345325", "author": {"steamid": "76561197963225118", "num_games_owned": 105, "num_reviews": 1, "playtime_forever": 9721, "playtime_last_two_weeks": 0, "last_played": 1477267765}, "language": "english", "review": "This is a superb operational level wargame that does an excellent job of capturing the feel of Operation Barbarossa from the viewpoint of a general. This is by and far my favorite operational game. It is not without its flaws, but I find those easy to overlook since it ultimately fills its niche so well.\n\nPlay this game if you enjoy focusing on manuever and supply while ignoring resource production and unit micromanagement. Unlike grand strategy games, the number of tanks and men at your disposal are largely fixed. And unlike  tactical level games, combat is taken care of by a detailed simulation.\n\nI had been searching for an enjoyable operational level game when I finally came across DC: Barbarossa. Other games in this niche range from accessible yet cartoonish (Panzer Corps) to serious but micromanagement heavy(War in the East). In the middle lies Command Ops, but that is a game that is light on important decisions for a player to make. And then I finally played Decisive Campaigns. Sitting in the driver's seat was neither boring nor a chore for me- it was exciting! DC lands in the middle of the spectrum, with just the right amount of choices each turn. \n\nThis said, the serious aspects of the game get in the way of accessibility. The interface leaves a lot to be desired. Simple moves can involve awkward sequences of keyboard presses and mouse clicks. Important information is often found buried in a sea of paperwork or on-screen stats. The game plays a bit slow as a result.\n\nThe other weakness in the game is the Russian campaign. While the German side is lovingly crafted, the Russian side lacks the same attention to detail. That said, the German campaign provides more than enough playtime on it's own.\n\nAll in all, I highly recommend this game if you're a hardcore fan of wargames. You will be especially pleased if you're specifically looking to play an operational level game- within the niche, DC: Barbarossa is simply the best of the class.", "timestamp_created": 1477955677, "timestamp_updated": 1477955677, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.587148", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26184555": {"recommendationid": "26184555", "author": {"steamid": "76561198053820749", "num_games_owned": 218, "num_reviews": 2, "playtime_forever": 1007, "playtime_last_two_weeks": 0, "last_played": 1514039373}, "language": "finnish", "review": "Quite simply the best strategic/operational-level wargame on the market today! I own and play WitW, WitE, WitP and several other grand strategy titles. Although the Grigsby-games have more detail this game just beats them with its clear and accessible mechanics and quite comfortable level of micromanagement. Highly recommended!", "timestamp_created": 1477237342, "timestamp_updated": 1477237342, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26178471": {"recommendationid": "26178471", "author": {"steamid": "76561198008627082", "num_games_owned": 172, "num_reviews": 30, "playtime_forever": 5009, "playtime_last_two_weeks": 0, "last_played": 1493225327}, "language": "english", "review": "The game is the third installment of the Decisive Campaign series, and it is definitely the best one. \n\nThe game is using traditional hex turn based wargame strategy system with division level units to be controlled on a map that cover the eastern front of WW2. \n\nThe main thing that make the game really distinguishable among many other similar strategy game is the RPG elements that have been added to the game, the elements are not just there for flavor and immersion, they are adding a whole layer of strategic decisions and operational thinking. \n\nThe gameplay is very deep, and has excellent representation of controlling the high command of either the German or Soviet armies with high fidelity in almost all historical aspects of Operation Barbarossa from supply lines, weather condition and army organization to the details of each armies commanders and their relation to you as player in a high command. \n\nThe cards system and the utilization of political points also make a lot of interesting but hard decision that you should choose in each turn, such as: where I should fortify, which army should be reorganized, which city to be garrisoned first and which commander should be shot and replaced, and many more, and the best thing when you see your action result on the next turn and how that changed the whole strategy on the map on your army.\n\nThe AI of the game is excellent. However, the beauty of this game (or any wargame) is to be played with human opponent through the revolutionary Slitherine PBEM++ system, try it and you will never want to play against AI again. \n\nI highly recommend this game to anyone who is into WW2 strategy game on operational level, this game and GG: War in the East are the best available on steam right now, if you do not own any of them, you are doing wrong (I am looking at you Hearts of Iron fans).", "timestamp_created": 1477212105, "timestamp_updated": 1477226791, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.526379", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26170661": {"recommendationid": "26170661", "author": {"steamid": "76561198012952660", "num_games_owned": 360, "num_reviews": 45, "playtime_forever": 4084, "playtime_last_two_weeks": 921, "last_played": 1516472674}, "language": "english", "review": "First, let's get one thing out of the way : this is a wonderful wargame, right up there in my personal pantheon of strategy games with Flashpoint campaigns : Red Storm, and Unity of Command.\nWhat really sets it apart from anything else I know, is the sheer boldness of its premises : integrate roleplaying and historical reality in the gameplay in order to give it a unique feeling. If you've ever tried to imagined what it must have felt like to take sweeping decisions, juggling between army theaters, then this is the best I've ever seen and played.\nThe AI, even in easy mode, will definitely punish every mistake.\nIf I had to highlight a single flaw of the game, it would be the victory conditions' assessment : as Germany, by early September I got Moscow under control for 5 turns and Leningrad under control for 2 turns, and the game stopped (due to Moscow being held for 5 turns, which I expected), but I ended up getting a draw (with a slight advantage to the Soviets); frankly speaking, I'm sure I would have quietly held all three of the German's objectives by early October, so an option to let the player continue playing wwould have been great.", "timestamp_created": 1477169540, "timestamp_updated": 1477169581, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.528786", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25485891": {"recommendationid": "25485891", "author": {"steamid": "76561198032776165", "num_games_owned": 456, "num_reviews": 66, "playtime_forever": 401, "playtime_last_two_weeks": 0, "last_played": 1473268431}, "language": "english", "review": "Summary - One of the best strategy games about the Operation Barbarossa (although there are not many), although it is not easy to master, and definitely not a casual game. It's hard to compare it with Gary Grigsby's game which is actually detailed to single rifles pieces of equipment, and overall is quite different. I won't be comparing it to John Tiller's games as those concentrate on a slightly different scale. \n\nInstead of simple pros and cons I'm going to review it bit by bit.\n\n\n1. Decisions and relationships\n\nWithout this, this game would have been a rather generic strategy game, and I surely wouldn't really recommend it. With all those decisions, tough choices to make (join the Nazi party or not, support Hitler's plans or do something reasonable instead). Also, most of the choices make someone like you more and someone dislike you, which means that it sometimes wise to pick to less beneficial option just to maintain a good relationship with someone.\n\nI also like that your character has a background - some of the leaders and commanders may like you more or less due to your character's actions in the past. Those whom you supported or impressed will like you, and those with whom you disagreed won't. The depiction of the human element really shines. \n\nBefore the game's release I hoped that perhaps you could really be the commander of the whole eastern front - to command through orders and directives instead of moving individual units around like everywhere else. Unfortunately, I was mistaken. \n\n\n2. Little touches\n\nThere are many little touches here and there - Franz Halder's diary (you play as him) or a soldier's diary that is influenced by your action - the soldier can be a hero, survive or die based on you action. Through his eyes you can really see many different shades of the war, and most of them dark.\n\n\n3. Reports\n\nI really like the system of all those reports - including weather reports, supply reports and many other summaries. It really makes you feel like you have aide-de-camps to help you grasp the situation around you.\n\n\n4. Depth and realism\n\nThis is where the game does not shine in my opinion. \n\nFirst of all, equipment. It is very simplified and lacks many different pieces of equipment. Even something as big as Panzer 38(t). This is no Gary Grigsby's War in the East. Combat is simplified compared to GG's and it is hard to compare the two. \n\nThere are no Corps HQs which I don't like at all - in GG's game I disliked that there are no division commanders, but here you won't even get to see Manstein as corps commander. Just army commanders for you. Point for GG again.\n\nSmaller units are not well represented in the game apart from siege guns. \n\n\n5. Graphics \n\nThey're not bad, although I don't really care about them. I still play John Tiller's games and those are quite dated in that regard. Gameplay is what matters in grognard strategy.\n\n\n6. AI\n\nIt is quite capable. Not as capable as a human opponent, but it can provide some challenge. \n\n\n7. Russian side\n\nWithout all those plotting and decision-making, I don't really like it. Stalin's paranoia is not enough to make it unique and immersive. \n\n\n8. Length\n\nThe game covers just the Barbarossa which makes it a bit short compared to Gary Grigsby's, but the time is more immersive because of all the decisions and different events unfolding around you. \n\n\nSummary: The game is good mainly because of its unique decision/relationship system which really puts you in the shoes of the military commander, but its combat system is quite forgettable and rather generic. If you don't want decisions and just want to concentrate on fighting the enemy, try Gary Grigsby's War in the East or one of very deep John Tiller's games. Overall, despite all that, I'll still recommend it.", "timestamp_created": 1473720176, "timestamp_updated": 1473720536, "voted_up": true, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.721173", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "25210799": {"recommendationid": "25210799", "author": {"steamid": "76561198024417685", "num_games_owned": 511, "num_reviews": 100, "playtime_forever": 57671, "playtime_last_two_weeks": 275, "last_played": 1516523411}, "language": "english", "review": "[h1]Decisive Campaigns Series[/h1]\n\n[i]I recommend very warmly this turn based little gem strategy game at operational command level with a very good intuitive interface&gameplay mechanics not overly convoluted , for those who want a greater challenge&have free time to spend - and also a more detailed historical background regarding the units in combat - the description on the game page is very accurate from my POV - 10/10 !\n\n[u]NOTE[/u] : \"major\" changes between DC2 and DC3 are highlighted in the manual - so be sure to check that first - the strong point being enhanced chain of command interactions/decisons !\n\nSide note - i preferred DC: CB for the greater flexibility and micromanagement allowed on the battlefield - ex: separate artillery/air support units +  the possibility to assign divisions to other HQ ![/i]", "timestamp_created": 1472404607, "timestamp_updated": 1472453494, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.516000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24921865": {"recommendationid": "24921865", "author": {"steamid": "76561198031072009", "num_games_owned": 67, "num_reviews": 5, "playtime_forever": 2513, "playtime_last_two_weeks": 0, "last_played": 1497049522}, "language": "english", "review": "The Dark Souls of wargaming. I managed to take and hold Moscow and destroyed about 200 russian divisions and still lost. I had winter preparations too.  Very challenging game, much to my liking. The russian AI is tough as nails, however the german one is not quite up to par. Play as germans singleplayer or if you do PBEM you can do the russian side.", "timestamp_created": 1471213405, "timestamp_updated": 1471285211, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24635675": {"recommendationid": "24635675", "author": {"steamid": "76561198114083520", "num_games_owned": 24, "num_reviews": 5, "playtime_forever": 18604, "playtime_last_two_weeks": 0, "last_played": 1469545885}, "language": "french", "review": "excellent jeu matrix forever !", "timestamp_created": 1469978476, "timestamp_updated": 1469978476, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24316156": {"recommendationid": "24316156", "author": {"steamid": "76561198062232099", "num_games_owned": 5111, "num_reviews": 285, "playtime_forever": 132, "playtime_last_two_weeks": 0, "last_played": 1462466764}, "language": "english", "review": "Decisive Campaigns may just become the single greatest historically important World War II based strategy game franchise ever developed. The amount of depth, complexity and adherence to he facts and statistics is simply astounding. Of great importance, of course, is just how much the game allows you the freedom to divert from the historical facts and play missions on a ‘what if’ basis for those who desire and do complete the game as authentically as possible. Along with the great Barbarossa campaign being available on Steam are the fantastic Case Blue and The Blitzkrieg from Warsaw to Paris.\n\nThere is no way that my own play time within the game does the game justice. I genuinely believe that the over ten hours that I have played this game is only scratching the very surface of what the game is capable of. I feel that there are hundreds if not thousands of hours of potential game play available within the game. I believe that the amount of playtime you need to put into the game counts against critics at large reviewing this game in the manner in which it thoroughly deserves. You’re going to struggle to find professional reviewers who can afford to drop a couple of hundred hours into the game needed to do so. It’s one of very few games on Steam where those who have poured tens of hours of play into the game feel that they have done enough to properly review it. I believes that this shows the amount of care and love that they have for the game and its developers but also how much work the development team poured into making this one of the truly great strategy games – video game or otherwise.\n\nStrengths that I have already discovered within the game are the sheer amount of customization you can create within a single mission let alone playing throughout the entire campaign. They are literally endless and each change can change how the game is played in monumental ways. It’s not just change this for minimal effect type things. It is really full on. Obviously this means that your game type, style and strategy will undoubtedly  vary dependent upon the style of game you are after.  Political decisions and effects profoundly effect the status of the game. The choice of whether you play by the code of the Geneva Convention and have a clean war compared to a dirty war also pushes the boundaries of the game one way or the other, etc. the list goes on.\n\nThere is a focus on the relationships and the historical figures within the game unlike many strategy-based games that I have ever played. This is almost the perfect game for a student of the war. You’re going to learn an enormous amount on some of the most important players in global political history through the playing of the game. If you have a thirst for historical knowledge then this will be a real boon for you and easily justifies the full retail costing of the game – and the other games within the title.\n\nI want to also suggest that the tutorial videos that were intelligently designed and clearly spoken are some of the best tutorial videos that I have ever watched in my life. They are a real blessing for the game as they will educate even the most naive of new players how to play the game and what is expected of the player. This is something that not many video games do well and to see such a niche title do it so perfectly is a real god send. You need to watch the videos even if you’re familiar with the type of game this is and dare I suggest even more so. It will alleviate so much of the potential frustration that you will have otherwise.\n\nThis may be the one time that I’m not even disappointed that the game lacks achievements or trading cards. They just do not matter to the target audience of this game. The only thing that I can remotely criticize the game on and it does take away some of its accessibility is the learning curve. It is a steep one. One of the steepest that I have come across. It has a tendency of making games with notorious learning curves such as Europa Universalis appear like child’s play in comparison and this is even with the fantastic tutorial videos. However, allow me to assure you that the more that I play the more I know that the learning curve will be one worth enduring with.\n\nI think that I will close on this note. Decisive Campaigns is the first franchise that is focused on World War II that I have ever felt truly comfortable playing. My father lost his hearing in the war serving for Australia and if not for an American doctor he would have died at the scene. Instead they saved his life and some thirty five or so years later I was conceived. So World War II has always been a topic of great trepidation for me. However, I love the way in which this game presents everything in such a manner that it makes me want to learn everything about it. It is simply superb and if you have any interest at all in the war it is something that you must have.\n\nFor similar reviews and our popular giveaways (including hardware) please check out [url=http://www.steamified.com]Steamified.com[/url]\n", "timestamp_created": 1468508981, "timestamp_updated": 1468508981, "voted_up": true, "votes_up": 23, "votes_funny": 1, "weighted_vote_score": "0.687491", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24098355": {"recommendationid": "24098355", "author": {"steamid": "76561198001364809", "num_games_owned": 34, "num_reviews": 2, "playtime_forever": 795, "playtime_last_two_weeks": 0, "last_played": 1511119617}, "language": "english", "review": "The A.I. in this game is a real jewel. And the decision layer added is real clever. I really can't add any more then other positive comments. You won't be disappointed by the game play", "timestamp_created": 1467683841, "timestamp_updated": 1467683841, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.544715", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24041917": {"recommendationid": "24041917", "author": {"steamid": "76561197985161073", "num_games_owned": 283, "num_reviews": 6, "playtime_forever": 4683, "playtime_last_two_weeks": 0, "last_played": 1514497048}, "language": "finnish", "review": "Perhaps the best hex based strategy game currently available. The game is complex enough to be interesting but not unmanageable monster. There are also new innovations to the genre. Recommended.", "timestamp_created": 1467535880, "timestamp_updated": 1467535880, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23258776": {"recommendationid": "23258776", "author": {"steamid": "76561197966628956", "num_games_owned": 382, "num_reviews": 11, "playtime_forever": 5280, "playtime_last_two_weeks": 0, "last_played": 1502141831}, "language": "english", "review": "simply sensational. Demy turned me on to the series and mostly liking anything SLitherene puts out I tried it.\nBeen mostly rolling as Stalin and playing PBEM++ game with DEm currently. this game once you get the basics continues to draw me in , the depth is amazing . I FEEL AS THOUGH i HAVE  reallY only scratched the surface ,BEST PART SO FAR for me has been  the operational aspects of the sim \n when playing as COmmie I find myself trying to sort out armies and get them lined up correctly is emense fun, can really grasp that feeling of being desaparte and trying to be diciplined at the same time,\nI would recommend this game flat out if you like the OST front get this gaME , \nmade me pick up about 6 books minimum and dust them off to read all over again the struggle at the Kickoff June 22nd 1941, \nI have played +60 hours \n, I got lucky and SLith sent me ... get this a 38% discount for being a slith member for 12 years... anyways i got the game direct from them and realized later  that gave me free steam key ,\n I had tried before to write review but at the time I did not have the steam key ,  this game is LEgit---> lovin IT", "timestamp_created": 1464463302, "timestamp_updated": 1464463302, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.506173", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22930679": {"recommendationid": "22930679", "author": {"steamid": "76561198006391828", "num_games_owned": 92, "num_reviews": 12, "playtime_forever": 6771, "playtime_last_two_weeks": 0, "last_played": 1464220888}, "language": "english", "review": "I am a grand strategy junkie. I love world military history and am a master of Hoi 1,2 &3. I also have played ck2, panzer corps and other games in the multitudes of genres to death. I have stayed away from these Decisive Campaigns because of what I perceived as a limited scope. I said to myself, I don't want to just fight to paris or just to fight the eastern front then have the game be over. This kept me away for years from these types of games and damn I've been cheating myself. \n\nThis game is the perfect mix of strategy, tactical combat and role playing. It is a an excellent addition to any fan of military history, strategy, tactics or lovers of the turn based game. What is so very unique is the multitude of decisions you get to make as the overall commander of operation Barbarosa. I can not stress enough the journey you get to make as both officers above and below you haggle, beg, demand and interfere with how you execute the war. While these games have been around awhile, they are relatively new to steam and this is absolutely a fresh take on ww2 that I'd like to see more of......what this game does absolutely better then another other is put you in the generals chair. \n\nAs far as specific mechanics go.....the learning curve is actually very reasonable as far as strategy games go. Inside the game are 14 approximiately 2-2:30 tutorial videos explaining the mechanics and it is clear, concise and all relevant material. The game has a huge manual is thats your thing but you don't need it, after the videos, play one turn, get the reports from your next turn and it all falls into place.\n\nAnother thing i was concerned with was replay value, this value is different to each person but to me it does that job in two ways. You can play as stalin and control the soviets, which is excellent and because of how each side had to wage the war you really get 2 games in one. Another way they make it replayable is by having some very important option buttons for your game, you can choose to play historial or a more fluid game with more possibilities. You can also choose to have geneva convention rules apply or more realistically where they arent being followed. I applaud them for the historical context and the choices you have to make as commander. \n\nthe tactical game is easy to learn yet mastering it is going to be on your individual ability to handle not only combat, but logistics and juggling priorties since you are in overall command of all 3 theatres or army groups north, south, and center.\n\nIf you like strategy, tactics, turn based gameplay i highly recommend this. If you are a beginner or veteran war gamer that wants a deeper, richer and more immersive experience I highly recommend this game. Feel free to ask me any questions I'm happy to share my thoughts with like minded gamers.", "timestamp_created": 1463077067, "timestamp_updated": 1463077067, "voted_up": true, "votes_up": 41, "votes_funny": 2, "weighted_vote_score": "0.769508", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22915298": {"recommendationid": "22915298", "author": {"steamid": "76561197970274310", "num_games_owned": 233, "num_reviews": 3, "playtime_forever": 10841, "playtime_last_two_weeks": 0, "last_played": 1504466479}, "language": "dutch", "review": "What a gem! This is the first eastern front hex wargame that doesn't enforce minute accuracy with that large number of units. And this is the first eastern front hex game that keeps me wondering why I haven't defeated them yet. They keep on coming with new, even stronger, regiments. After reading the history book it looks like I perform as expected. Oh, oh, losing?", "timestamp_created": 1462991642, "timestamp_updated": 1462991642, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22830114": {"recommendationid": "22830114", "author": {"steamid": "76561197997812576", "num_games_owned": 586, "num_reviews": 11, "playtime_forever": 93, "playtime_last_two_weeks": 0, "last_played": 1492003157}, "language": "english", "review": "\"The premier gateway operational wargame for S&M couples!\" [URL=http://grogheads.com/forums/index.php?topic=15498.0]The Grogheads AAR[/url]\n\n(Disclaimer: no actual S&M couples at the link above.)\n\n(Ignore my Steam time: I've been playing since just after release, as the AAR will show.)", "timestamp_created": 1462556305, "timestamp_updated": 1491746997, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.456311", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22803516": {"recommendationid": "22803516", "author": {"steamid": "76561197998167405", "num_games_owned": 385, "num_reviews": 63, "playtime_forever": 10173, "playtime_last_two_weeks": 0, "last_played": 1498489476}, "language": "english", "review": "Decisive Campaigns: Barbarossa\nDon't know if i should do a review this early into the game,but when you think about it,does it really matter when ive made up my mind already!?.I only bought this game yesterday morning,but its still on in the background along with a stack(x10)of youtube tutorials'thrown'onto the Tv.Now i seriously struggle with HoI3(Hearts of iron)and it really frustrates me so that i can't play it!!.So you can see i was a little worried to begin with,but this just passed as quick,as i started to shove my units around the'board',this game is totally playable from the off,which im happy to say.The built in tutorials,theres quite a few watch them all before you play is my \"Tip Of The Day\",some of them ive played a number of times already and ill probally visit them again too,they are just the right length not boring or too technical,i sat and watched all of them in one go.You will learn stuff that would fly past you otherwise unnoticed.\n Im going to keep this review short mainly because of the samll amount of hours ive put in,read more reviews if your still not sure,this is NOT HoI thankfully.This is ooozing with stats+info so if you like that then...The GFX are even passable i mean a few more explosions etc and maybe a little movement with the icons ont he top of the counters would have been nicer,but i understand that you dont need top notch graphics for TBS,but i have seen recently i think on matrix games think it was Order of Battles newest title correct me if im wrong,has nice effects as each units makes its moves.\n Only one gripe(See Edit at bottom) and thats just been spotted on the Tutorial video playing behind me is showing a swastika on its german flags which is totally fine by me,and mine only has Nato or politiically correct counters!;) Maybe this tutorial was shot in beta?CoH did this a few years back and it was disapointing.Leave them in even if its for realisms sake,and they look much better too,apart from that the game is awesome and beyond my expectations in the end,going to get the Case blue next 100%,itching to get it now,but as steams summer sale is coming up i might be able to hold on a few more weeks for the % but idk for sure.Seeing as im getting back into hexwar games,played PG to death back in its day,who didnt?,this game is is along the same lines but with so much more included,i was torn between thisDC:B or Gary Grisbys as they both look very similar indeed and after doing my homework i chose to buy this.\n You won't be disapointed if you love Hexwar Games with a bit more than the average,and Perfect if your an Infomation slut!?,it's got stats galore!...great game so far...and it was a nice bonus to get the 20%off £6.00 is a nice discount.-EDIT:My Game now has the rather nice \"Classic\"counters which you can find in that LINK below from Philippe_at_bay.My Counters now have Lovely Artwork on them,this game really is a little Gem.You can modify the pants off it!:)>>If you like this Review and like me went and bought the Game use that link below and it will take you to the Hub where youc an get all sorts of Files to shape the Game how YOU like it!.Enjoy.EDIT:(Since i have managed to put back the original Flags,thats twice now,so i make steam now not update ANY of my games.Im happy this game lets you do this,after we are all adults here and its fine in the UK.This is becoming such that now im making it a point to not purchase world war two games that are with PC symbols,after all how can you tell they are germans?You can't,because with  out symbols they could just as well be Hungarians or even Romanians.Leave the things alone.Fair play to the guys at VR games.:) I will continue to buy your Games.21/11/2016", "timestamp_created": 1462410673, "timestamp_updated": 1479705219, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.571689", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22796677": {"recommendationid": "22796677", "author": {"steamid": "76561198058113636", "num_games_owned": 42, "num_reviews": 1, "playtime_forever": 4550, "playtime_last_two_weeks": 0, "last_played": 1512511182}, "language": "english", "review": "This game is a winner. The last few years no other wargame managed to suck me in like this. Either they were too much on the easy side or to complex. This one is exactly right. The feeling you get managing the Ostfront is unparalelled.\n\nFirst there's the basic hex wargame. I don't have to manage each and every little artillery regiment, special unit or air wing. It's all on the divisional level with a fair amount of abstraction. This makes the game playable. No micromanagement slugfest here.\n\nNote: It's still a hex counter wargame, so complexity is rather high if you're used to RTS games or Risk or something like that. Learning and knowing unit stats, supply behavior and action point costs is a must. Good thing: the guys made help videos, accessible in the game. Grab a beer, coffee or whatever else and take some time watching them - else I predict frustration.\n\nSecond we have the political meta game. This is such a nice, well done thing - I can't praise it high enough. See the tears in my eyes? These are tears of joy. The meta game is what sucked me in. I feel as if I'm actually in a chain of command. I feel that my decisions matter. That's awesome. Having to manage my political  relations with Generals, my Chief of Staff, Hitler, bloated Goering and many others is what makes the game stand miles above any wargame I played in the last 25 years.\n\nI am in my second game vs the AI, turn 3. This turn I mainly brought my armies in position, Army Group Centers and Army Group Norths Panzer Groups stand ready to encircle large contigents of soviet troops next turn. I can't wait to do see my glorious plans come to life. Once I played 2-3 games vs the AI I will look for human enemies. Just you wait! :)\n\nSo, enough talk. You like wargames? You like WW2? You like making hard decisions? You are able to concentrate and read text? You like the feeling of being a commander in the biggest war in history?\n\nGet the game, it's worth every penny - a labor of love. Support your independent wargame developer.", "timestamp_created": 1462379902, "timestamp_updated": 1462379902, "voted_up": true, "votes_up": 41, "votes_funny": 2, "weighted_vote_score": "0.798601", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22793318": {"recommendationid": "22793318", "author": {"steamid": "76561198002523795", "num_games_owned": 315, "num_reviews": 16, "playtime_forever": 1905, "playtime_last_two_weeks": 0, "last_played": 1507203591}, "language": "koreana", "review": "말이 필요없는 최고의 하드코어 턴제 군사전략게임\n\n이 장르의 게임에서 최고를 뽑으라 하면 독보적으로 War in the east 가 꼽히고는 했는데, 이 작품이 나오고 나서 순위가 바뀌었다!\n\n\n독일로 하면 동부전선 최고사령관, 소련으로 하면 스탈린을 체험할 수 있다.\n\n턴마다 행해지는 플레이어의 결정에 따라 부하들과 상급부대 지휘관들의 태도 및 전선의 전략적 상황이 변하게된다.\n\n목표를 어떻게 두느냐, 장기전이냐 단기전이냐, 전쟁범죄에 엄격하느냐 협조하느냐, 등등 실제 지휘관이라면 겪었을 수많은 결정사항을 처리해야한다.\n\n\n한턴 한턴 정상적으로 해 나아간다면, 턴당 30분에서 90분의 시간은 들어가는 하드코어한 게임이다.\n\n디시전들은 서류업무를 통해 이루어지며, 한턴이 지날 때 마다 수북하게 쌓이는 보고서와 요청서들은 고급지휘관의 전쟁이란 무엇인지 알게 해준다.", "timestamp_created": 1462367107, "timestamp_updated": 1462367107, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.565217", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22792737": {"recommendationid": "22792737", "author": {"steamid": "76561197996140314", "num_games_owned": 147, "num_reviews": 11, "playtime_forever": 2527, "playtime_last_two_weeks": 0, "last_played": 1464259851}, "language": "english", "review": "Quick note to let you know what I think of this game.\n\nOnly for those who like turn based strategy on a pretty large scale. AI is good, quality of the initial release is also good. There's currently a 20% discount on Steam for this title.\n\nI'm happy with my purchase.", "timestamp_created": 1462364271, "timestamp_updated": 1462364271, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.495170", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22784851": {"recommendationid": "22784851", "author": {"steamid": "76561197992175965", "num_games_owned": 1109, "num_reviews": 158, "playtime_forever": 390, "playtime_last_two_weeks": 0, "last_played": 1462228699}, "language": "english", "review": "There isn't much I can't say that has been preached to death in these reviews, so I'll just say this:\nProbably one of the more unique and refreshing wargames I've played in ages. Strong role-playing mechanics that make for some interesting decisions and a political system that kept me playing for a solid 6 hours straight without coming up for air. While I'm no where near finishing my first campaign, I can safely say this game deserves at least a glance from strategy gamers... whether they are fans of wargames or not. Plus you get to play as both the German Chief of Staff or as Stalin himself, both campaigns are completely different and offer a differing perspective of the Eastern Front.\n\nGameplay Footage: \nhttps://www.youtube.com/watch?v=p7F1IcyQbxg", "timestamp_created": 1462313348, "timestamp_updated": 1462313348, "voted_up": true, "votes_up": 16, "votes_funny": 4, "weighted_vote_score": "0.591174", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22783177": {"recommendationid": "22783177", "author": {"steamid": "76561198100608621", "num_games_owned": 218, "num_reviews": 9, "playtime_forever": 635, "playtime_last_two_weeks": 0, "last_played": 1462419579}, "language": "english", "review": "A simplified Hearts of Iron, with sole focus (as the title tells you) on the Eastern front.\n\nSimple game, but complex enough to keep you engaged. I found myself staring at the map for half an hour before committing troops, something that I haven't done in grand strategy titles.  \n\nI attempted to solve the German error of logistics and had superb trucks and railways. Unfortunately, the campaign was fought to a standstill on the East Front on the Volga. No end in sight, and the Finnish were routed and occupied.\n\nI could not liberate them, and was heartbroken that my Finnish allies were destroyed, so I opted for a restart.\n\nI also enjoyed the option to have diary attachments. It made me a bit sad to see ol' Hugo killed, as well as the entries of real life officers.\n\nI believe this will replace my obession with Europa Univeralis four, I can't wait to conquer those filthy bolsheviks. \n\n\n", "timestamp_created": 1462304956, "timestamp_updated": 1462304956, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.474944", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22772643": {"recommendationid": "22772643", "author": {"steamid": "76561197976327138", "num_games_owned": 382, "num_reviews": 87, "playtime_forever": 6898, "playtime_last_two_weeks": 0, "last_played": 1462584153}, "language": "english", "review": "This game really gives you the feeling of being on the general staff.  Quite the accomplishment and not really much else like it.  The feeling fo pushing papers around is great, and it is nice to see some new ideas in wargaming.\n\nReally enjoying my first campaign, though I don't think it will end well.", "timestamp_created": 1462252041, "timestamp_updated": 1462252041, "voted_up": true, "votes_up": 20, "votes_funny": 3, "weighted_vote_score": "0.678079", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22759722": {"recommendationid": "22759722", "author": {"steamid": "76561198014177540", "num_games_owned": 300, "num_reviews": 25, "playtime_forever": 846, "playtime_last_two_weeks": 0, "last_played": 1462683782}, "language": "english", "review": "Delightfully easy to learn and play.  The dynamics of the command system they have developed makes for an incredible experience.   Runs beautifully and while you can feel a strong engine underneath, the game is surprisingly easy to play.  Love it, congrats to the developers on this incredible game and I cannot recommend it enough!", "timestamp_created": 1462186991, "timestamp_updated": 1462186991, "voted_up": true, "votes_up": 13, "votes_funny": 2, "weighted_vote_score": "0.569293", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22743787": {"recommendationid": "22743787", "author": {"steamid": "76561197976571139", "num_games_owned": 515, "num_reviews": 2, "playtime_forever": 2626, "playtime_last_two_weeks": 0, "last_played": 1489810780}, "language": "english", "review": "Strikes a good middle ground between light strategy games and monsters like Gary Grigsby's War in the East.\n\nThe tutorial videos included in the in-game help teach you everything you need to know, and are a welcome addition. I suspect newbies to the genre will find this one of the more accessible titles around, though you will still need to do a lot of micromanaging and the sheer amount of units that you need to individually control may be intimidating. Smaller introductory scenarios, maybe limiting you to the role of an army group commander for a single theater (eg. north, central, south) would be a welcome addition.\n\nThe logistics system is one of the most intuitive I've encountered in an operational level wargame. All of the information is straightforward and easily accessible. If you don't have enough fuel, it's easy to pull up information about why. Other than that, veteran grognards won't find much of note in the battle system to write home about. But that's OK, it sticks to a formula and does it well enough. The AI is competent and a worthy challenge. It seems easy at first, but wait...\n\nWhat differentiates this game from other wargames is the decision and staff system; you need to negotiate and compromise to achieve your objectives. I've not actually seen anything like this done properly before, and it's very cool! For example, one of the significant issues that arises is how to proceed with converting Soviet railway lines to be compatible with your German trains. Going for the the \"I don't care, do it was fast as possible\" approach will likely put your supply officers off side and make them less likely to support you in future, while opening you to other potential problems like train breakdowns, partisan attacks, etc. But slowing down to install signals and water towers, provide proper security, etc. will irritate some of your army officers, who want those supplies *now*. And when they don't get enough supplies, they'll be reluctant to push as far as they possibly can. \n\nAnd don't forget Hitler, trying to micromanage everything you do... \n\nAnother interesting aspect to this decision system is that a toggle option in the menu can enable or disable controversial material (disabled by default so as not to cause offence). It's handled intelligently, without glorifying atrocities. It adds an interesting ethical dilemma, though - do you spend significant political capital trying to stop Himmler's Einsatzgruppen, or not bother and focus on winning the war instead, using that political capital on other things? I appreciate that the development team decided not to ignore this; most wargames do. It's an interesting challenge trying to be the good guy fighting on the side of the bad guys.\n\nIn summary, this game makes you feel like you're an actual general as opposed to \"Army God\" (with the caveat that you can turn off all of the above, and play like a traditional wargame if you choose). This aspect alone makes it quite a clever game, and a unique take on what was possibly the most brutal conflict in history. \n\nDefinitely recommended for genre fans looking for a somewhat different take on the formula.", "timestamp_created": 1462112566, "timestamp_updated": 1462112857, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.547550", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22735959": {"recommendationid": "22735959", "author": {"steamid": "76561198018460505", "num_games_owned": 517, "num_reviews": 62, "playtime_forever": 2216, "playtime_last_two_weeks": 5, "last_played": 1515542306}, "language": "english", "review": "An extremely refreshing addition to the Slitherine Catalogue. Have you ever wanted to make your own decisions in WW2's eastern front? Maybe even defying the fuhrer himself to further your own Military goals? This is the game for you! \n\nhttps://www.youtube.com/watch?v=V0sDiBn6jW4", "timestamp_created": 1462076821, "timestamp_updated": 1462076821, "voted_up": true, "votes_up": 30, "votes_funny": 2, "weighted_vote_score": "0.582485", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22735213": {"recommendationid": "22735213", "author": {"steamid": "76561197983012152", "num_games_owned": 360, "num_reviews": 8, "playtime_forever": 62, "playtime_last_two_weeks": 0, "last_played": 1462246933}, "language": "english", "review": "I have owned this game since it's first release at Matrix Games, I transferred it to Steam today.Simply amazing,this game has many options that let you defy the same linear game that most Russo-German strategic world war two games follow. You get to choose, A-LOT of variables that are very nice, giving  the player their choice as to tweaking many options as to how the actual campaign is fought, definitely granting a WIDE historical, and ahistorical scope, that defiantly does not follow the handcuffs of history as a simulation! The High Commander RPG will consume you, or if you want just combat it can all be done in the options menu!", "timestamp_created": 1462072546, "timestamp_updated": 1462238868, "voted_up": true, "votes_up": 18, "votes_funny": 2, "weighted_vote_score": "0.578185", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22734742": {"recommendationid": "22734742", "author": {"steamid": "76561197983120702", "num_games_owned": 530, "num_reviews": 8, "playtime_forever": 222, "playtime_last_two_weeks": 0, "last_played": 1462936751}, "language": "english", "review": "If you're looking for a tactical/strategic game, you may want to try Panzer Corps, which has a nice expansion into the Eastern Front. This game puts you in the shoes of Col. Gen. Franz Halder, who was the Operational Chief of Staff for the Eastern Operations, as such, you will have to manage multiple resources (oil, rail tracks, trucks, etc.), political demands and military egos, both above you and below you. Your superiors and subordinates will always look up to you and your decisions will affect their relationship with you, which in turn may affect the operational aspects of the Barbarossa Campaign. The game comes with a nice video tutorial available in the main screen and you may refer to it if a point remains obstruse. Overall, a nice game, but only for those who don't look for Michael Bay's style \"War bling\".", "timestamp_created": 1462070001, "timestamp_updated": 1462070001, "voted_up": true, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.522357", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22726185": {"recommendationid": "22726185", "author": {"steamid": "76561197999613929", "num_games_owned": 297, "num_reviews": 150, "playtime_forever": 336, "playtime_last_two_weeks": 0, "last_played": 1461965729}, "language": "english", "review": "Soo... I've dithered a lot on if i SHOULD review this title as it's clearly a game with a very specific audience that doesn't really mesh well with the overall gameplay idea's [removed: most people] I look for in a Grand Strategy turn based game.\n\nedit:\nWhen i think \"Grand Strategy\" and where this game \"missed\" the mark for me that i came in expecting a mix between Europa Universalis 4 and Total War.  A solid PC title set in WW2. Instead i got a Solid WW2 set in a poor PC experience.\n\nYou can watch the full video  here:\nhttps://www.youtube.com/watch?v=I3uBCzxv3F4\n\nTextual:\nAs always, a short summary can never compare to a full video review - as such please watch the video for the best possible impression of the game.\n\nSo this covers Germany's attack into Russia during the spring of '41. The title offers a full campaign playable from both sides with a few modifiers for the various options so you can customize your experience. From Historical, to more and less detailed decisions.\n\nFrom a historical standpoint, this game is AMAZING - and thats where people come from when they like this game... And i cant complain at all about their multiplayer method for turn based a-synced play. The level of detail and nuance in every decision you make,every piece of information available, every parameter from available supply trains, terrain, weather, political standings and so on and so forth... it's absolutely phenomenal. \n\n..BUT.\nAs a PC Game overall, i feel it's REALLY weak.\nthe sound & graphics are beyond weak. they are limited, sub par and have had no upgrade that i could find compare to their other titles. Which is also where my final critique is from...\n\nAs a full priced release, the game offer no new improvement to the PC release, offers no rebindable keys, not even the option to change resolution, has no actual full screen mode and also has a tenacious dislike for constraining the mouse to window. \n\nOverall, i can ONLY recommend the title if you REALLY want the historical accuracy, methodical planning of each move and detailed units... but if you want a good PC gaming experience, a in dept RTS game or any deviation of from the campaign...\n\nThis isn't anywhere close to it. and for the third game in the series, having no improving to any technical system that i've found is a damnable.", "timestamp_created": 1462034236, "timestamp_updated": 1462397376, "voted_up": false, "votes_up": 51, "votes_funny": 8, "weighted_vote_score": "0.368651", "comment_count": "12", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22722154": {"recommendationid": "22722154", "author": {"steamid": "76561198007172969", "num_games_owned": 468, "num_reviews": 14, "playtime_forever": 182, "playtime_last_two_weeks": 0, "last_played": 1462019929}, "language": "german", "review": "Was es ist:\n\nDiese Kritik bezieht sich auf meine Erlebnisse auf deutscher Seite. An die russische Fraktion habe ich mich noch nicht herangetraut. Meine Spielzeit umfasst wesentlich mehr Stunden. Ich habe das Spiel vor einigen Monden bei Matrix erworben. \n \nEin rundenbasiertes Strategiespiel im WW II auf „Theatre“ (Kriegsschauplatz Ostfront 1941 Sommer – 1942 Frühjahr) Ebene. \nDas Spielfeld ist aufgeteilt in Hexfelder. Gespielt wird mit Heeresgruppen und Armeen. Kleinste zu befehlende Einheit ist die Division (ca. 6000 – 9000 Mann).\nZu spielende Fraktionen: Wehrmacht und Rote Armee. Angegliedert sind noch finnische, rumänische, italienische, ungarische … Einheiten. \nSpieldauer: Zu bewältigen sind ca. 50 Spielzüge, die jeweils 4 Tage simulieren. Für einen Spielzug benötige ich meistens 20 – 30 Minuten. Der Gegnerspielzug wird auf meinem 4Kern irgendwas PC in ca. 2-3Minuten berechnet.\n\nWas in diesem Spiel nicht enthalten ist:\n\n-\tDiplomatie\n-\tWirtschaftsimulation (Hearts of Iron z.B.)\n-\tSpionagemanagement \n-\tEinheitenbau \n-\tTaktische Kämpfe (sie werden ohne Möglichkeit einzugreifen berechnet)\n\nVon der Komplexität der Inhalte und der Vielseitigkeit des Regelwerkes (wieviel muss ich lernen, wissen und verstehen um zu begreifen was ich da tue) ist es deutlichst über Panzer General, leicht über Hearts of iron und deutlich unter Gary Grigbys War in the east angesiedelt. Es ist meines Erachtens weniger Komplex in seiner Bedienung und in seinen strategischen Möglichkeiten als Decisive Campaigns: Fall Blau. \nABER: Die Auswirkungen jeder Entscheidung sind so gravierend, dass jeder Zug ähnlich dem klassischen Schachspiel bedacht werden muss. Ein Runden wegklicken ala Civilization ist nicht möglich. \nDer Schwierigkeitsgrad für Menschen mit meinen kognitiven Möglichkeiten ist enorm, lässt sich aber anpassen. \nWas ist neu, wodurch hebt sich dieses Strategiespiel von anderen ab?\n\nKönnen Sie sich an ein Strategiespiel erinnern, in dem Sie eine positive Beziehung zu Adolf Hitler aufbauen konnten und dafür vom Spiel nicht bestraft wurden? Ich nicht. Und das ist grundsätzlich auch sehr gut so. Worüber spreche ich hier?\nSie spielen Franz Halder, operativer Chef des Generalstabes des Oberkommando der Wehrmacht und verantwortlich für den Erfolg oder Misserfolg des Überfalls auf die Sowjetunion, namentlich bekannt als Operation Barbarossa. \nOder sie spielen Stalin persönlich als oberster Befehlshaber der sowjetischen Truppen. \nVor Beginn eines jeden Spielzuges werden Ihnen Ereignisse in Briefform dargebracht, die Ihnen Entscheidungen abverlangen. Gehen wir ethisch in die vollen:\nEin Herr Himmler (Chef der SS) schreibt Ihnen und bittet um Ihre uneingeschränkte Unterstützung für gewisse Säuberungsaktionen hinter der Front die russische Zivilbevölkerung betreffend. Der Führer hätte sich dahingehend ja klar bei der Einsatzbesprechung geäußert. Wie werden Sie antworten? ........... Ich erzähle Herrn Himmler immer wieder, er möchte mich mal am Hintern …. und sollte es zu späteren Zeitpunkt ein Kriegsgericht geben werde ich gegen ihn aussagen. \nDiese Antwort kostet mich enorm viele Politikpunkte. PP´s sind die Währung die ich einsetzen muss um Entscheidungen zu „bezahlen“. Sie werden niemals genug PP`s auf ihrem Konto haben um nach dem zehnten Zug noch alle Entscheidungen treffen zu können. Ein General des Nachschubs wird dann sauer, weil sie sich nicht dafür einsetzen, dass er seinen Fuhrpark an Lastwagen für die Heeresgruppe Nord nicht komplett überholen kann. Göring ist allerdings happy, weil sie nicht genug PP`s hatten um eine Umverteilung von Treibstoff von der Luftwaffe zur 2. Panzergruppe zu erwirken. Sie fallen doch tatsächlich in der Achtung Brauchitsch´s weil sie keine Zeit hatten ihm ein Geburtstagsgeschenk zu kaufen.\n \nDie Spielmechanik:\n\nIn welcher Weise sich ihre Divisionen an der Front schlagen, wie schnell ihre Panzergruppen nach Osten vorstoßen oder wie qualitativ hochwertig die Kampfnahunterstützung der ach so glorreichen Luftwaffe sein wird, hängt von den Entscheidungen ab, die Sie morgens am Schreibtisch in der Korrespondenz mit anderen Funktionsträgern des gesamten Wehrmachtsapparates treffen. Ihr Adjutant im Generalstab wird sie zur Weißglut bringen. Denn der wird Entscheidungen treffen, wenn sie ihre PP`s aufgebraucht haben oder sparen für wirklich wichtige Entscheidungen. Und er versagt auf ganzer Linie, dieses linientreue Nazi-Duckmäuser-Ar….. .\n\nFazit:\n\nDiese Form der Vernetzung ethischer Entscheidungen, Büroarbeit und Hardcore-Strategie (unterer Schwierigkeitsgrad) habe ich so vorher noch in keinem Spiel gefunden. Eine Mischung aus Lindenstraße, Kindergarten und Operationszentrale. Wenn Sie an den Ereignissen auf ganz hoher Ebene im WW II interessiert sind legen Sie sich dieses Meisterwerk zu. Bitte seien sich aber der Subjektivität meiner Person bewusst. Aber Rezessionen von z.B. Armchair General sind ähnlich gut ausgefallen.\n\n8/10\n \nEin Wort zur Shoah (Holocaust) in diesem Spiel:\n\nAls linker antirassischtischer Sozialpädagoge mit sechs Jahren Dienstzeit in Heer und Marine kann ich es nur schwer aushalten, wenn über manche Dinge nicht gesprochen wird. Erst einmal wichtig: Der Mord an Millionen Juden, Homosexuellen, Sinti, Roma und anderen damaligen Staatsfeinden findet im Spiel keine Erwähnung. Das ist gut. Ich möchte beim Spielen Spaß haben. Möchte ich mich über tatsächliche Gegebenheiten informieren besuche ich einen Hörsaal oder lese ein Buch. Daher haben zwar Kriegsverbrechen und auch die NSDAP und sogar eine „Arbeitsbeziehung des Protagonisten (Franz Halder) zu Adolf Hitler in das Spiel Einzug gefunden, aber die notwendige und letzte Grenze wurde nicht überschritten. Ich hätte mir zu dieser Thematik allerdings ein paar Worte der Verfasser im 400 Seiten umfassenden Handbuch gewünscht.", "timestamp_created": 1462020048, "timestamp_updated": 1462020048, "voted_up": true, "votes_up": 51, "votes_funny": 1, "weighted_vote_score": "0.772530", "comment_count": "3", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22719826": {"recommendationid": "22719826", "author": {"steamid": "76561197970938766", "num_games_owned": 168, "num_reviews": 2, "playtime_forever": 117, "playtime_last_two_weeks": 0, "last_played": 1512221034}, "language": "italian", "review": "[b]ATTENZIONE Il numero di ore di gioco di steam non corrisponde a quanto ho gicato effettivamente in quanto ho la versione matrix games che è uscita 6 mesi prima rispetto a quella di steam [/b]\n\nE' il terzo capitolo della serie Decisive Campaigns, ma si differenzia moltissimo dai precedenti.\n\nLo dico subito, il MIGLIOR WARGAME mai fatto.\nMi sbilancio così tanto perché i gusti possono variare, ma questo gioco è senza dubbio il perfetto anello di congiunzione tra un gioco strategico user friendly e i mostri sacri da grognard, oltre ad aver aggiunto degli elementi innovativi mai visti prima.\nL'obiettivo del gioco quindi è quello di divertire e non simulare. Quindi pur essendo complesso nella gestione d'insieme, non ha la profondità dei Gary Grisby, che non sono dei giochi ma piuttosto dei simulatori per appassionati (il loro obiettivo è simulare, il divertimento è in secondo piano, chi li compra cerca la fedeltà 1 a 1, non un videogame in senso stretto). \nEcco, con questo Barbarossa rimaniamo nel campo dei videogame, il gameplay esiste per divertire (occhio che si parla comunque di un gioco che è più simulativo del 99% dei giochi strategici).\nQuesta premessa per dire che pur essendo un Wargame....rimane comunque userfriendly, un po' smussato nelle meccaniche....insomma quei giochi che tanto mi piacciono che sono \"facili\" da comprendere ma difficilissimi da padroneggiare.\n\nSiamo davanti ad un CAPOLAVORO.\nIl gioco ripercorre l'operazione Barbarossa (non l'intera campagna di russia). Per inquadrarlo bene, l'operazione progettata dai tedeschi volta alla caduta della russia PRIMA dell'inverno. L'obiettivo dei tedeschi è completare il piano originario, quello dei russi far capitare quello che storicamente è successo. Quindi l'arco temporale preso in considerazione dal gioco è il giugno 1941 fino al febbraio 1942.\n\nNon voglio focalizzarmi sul gameplay strategico in senso stretto, che in linea di massima è quello classico di un wargame, con tutta la gesione logistica, ma con l'aggiunta di alcune carte \"bonus\" che facilitano aspetti che nei veri wargame richiederebbero ore di studio.\n\nCosa introduce di nuovo ?\nLe decisioni politiche.\nPensate alle grandi battaglie della WW2 e alle discussioni da \"conquistatori da poltrona\" che ogni tanto si sentono, se avessero fatto, se non avessero attaccato, che scemi che non hanno pensato all'inverno, perché non hanno tenuto conto di questa problematica ecc.... \nInsomma i grandi errori della WW2 li conosciamo benissimo, ma perché sono stati commessi ? I tedeschi pensavano veramente che non avrebbe fatto freddo ? ....o i russi a inizio battaglia, tenendo la posizione fino all'ultimo uomo, pensavano realmente di fermare un nemico molto più organizzato ? Non era meglio arretrare e riorganizzarsi e minimizzare le perdite iniziali ? Per i tedeschi non era meglio iniziare la campagna di russia un paio di mesi prima ? La strategia della blitzkrieg così efficace perché non è stata sfruttata al meglio ? Perché il piano iniziale era quello di prendere Leningrado e tutta la parte ricca della russia e poi improvvisamente si è deciso di puntare su Mosca?...e l'anno dopo invece su stalingrado ? Tutte queste modifiche cosa hanno comportato ?\n\nCi siamo mai chiesi PERCHE' LORO hanno fatto questi errori...e preso quindi decisioni così avventate ? Solo per colpa del \"nein nein nein nein nein di baffetto con la mano sbattuta sul tavolo ?\nLa risposta sono le decisioni politiche....spesso una decisione sbagliata sul piano strategico risolve una situazione politica...\n\nNei videogiochi si gestiscono imperi ed eserciti come se fossimo degli dei della battaglia dove tutti ci ascoltano e ci assecondano alla perfezione, ma nella realtà non succede  così, nemmeno nei regimi più totalitari (come lo erano quello nazista e quello sovietico).\n\nQuindi il gioco non si limita a mettere davanti al giocatore decisione puramente strategiche e gestire la questione bellica, ma dovremo gestire e spesso assecondare tutti i capoccia dell'apparato politico.\n\nDescriverò più nel dettaglio i tedeschi, ma sappiate che giocare coi russi cambia totalmente il gameplay e le regole, come se fossero due razze totalmente differenti di un RTS...(altro elemento che lo differenzia da un \"vero\" wargame)\n\nCoi tedeschi si impersona Franz Halder (il più grande trollone della storia...si è preso due anni di carcere al processo di Norimberga, se ne prendono di più se si ruba in panetteria). Ad ogni modo nei suoi panni si deve gestire l'operazione barbarossa. Ad inizio gioco avremo un'importante decisione da prendere, assecondare il piano di Hitler, assecondare chi vuole andare dritto su Mosca, oppure pieno controllo all'apparato militare senza rompimenti di coglioni ? \n\nQueste decisioni comportano delle conseguenze, ovviamente più si fa felice baffetto e meno ci sono le possibilità di essere destituiti, ma bisogna seguire il suo percorso. \nMeno si segue baffetto e più è probabile che capitano cose brutte, ma si può pianificare strategie senza ingerenze dall'alto...(ma sperate che i vostri piani di battaglia proseguano alla perfezione...). \n\nQuesto però è solo la punta dell'iceberg, avremo a che fare con tutta la catena di comando dai superiori (abbandonareil posto di comando per andare a fare il giuramento hitleriano ?...rallentare un'operazione perché goebbels vuole un bel video di propaganda ?...strizzare l'occhio più ai fanatici piuttosto che a quelli con idee più moderate ?... Che faccio, insisto con Hitler nel chiedere l'equipaggiamento invernale ? A cosa serve l'equipaggiamento invernale se i piani prevedono la vittoria per l'inizio di novembre ? Gli dico che il piano che stiamo seguendo è una merda ?)\n\n...e poi ci sono i vecchi...i grandi generali che seguono i tre fronti, che vengono da idee della WW1, mi daranno mano libera per la blitzkrieg, o per loro è troppo moderna ed è meglio puntare sulla fanteria ? Se riduco i rifornimenti alla luftwaffe per dare una maggiore spinta ai panzergruppe, Gering si incazza e mi mette il muso ? \nContinuo a dare più risorse ad un fronte meno importante solo per avere l'appoggio di un generale o li destino a punti più critici, col rischio che i generali mi mettano il muso e mi vengano bocciate le strategie che hanno reso famosi i nazi...?  \nLe truppe sono stremate, ma chi lo dice ad hitler che c'è bisogno di una settimana di stop ? ....oppure dopo essersi dannati a pianificare un attacco decisivo...arriva un dispaccio dall'alto...Hitler ora dice di puntare dritti su Mosca, ogni altra missione è revocata...\nInsomma una FIGATA...\nCoi russi invece è tutto diverso, si impersona direttamente Stalin e bisogna fare i conti con la paranoia di essere rovesciato, man mano che i nazi avanzano, aumenta il livello di paranoia....magari quel generale tanto bravo che sta facendo bene il compito, forse è il caso di segarlo, forse domani mi vorrà sostituire...magari è anche il caso di incentivare la voglia dei soldati di resistere fino all'ultimo uomo per difendere la madre patria...oppure devo scendere a patti e richiamare in servizio gente che aveva già il biglietto per la siberia...\nMa non mi voglio più dilungare...metteteci un comparto grafico gradevole (per un wargame), i diari dei vari personaggi che avanzano con il proseguire della battaglia...decisioni morali circa i crimini di guerra...e il gioco è fatto...UN CAPOLAVORO", "timestamp_created": 1462010530, "timestamp_updated": 1462010530, "voted_up": true, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.686610", "comment_count": "4", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22708525": {"recommendationid": "22708525", "author": {"steamid": "76561198034128939", "num_games_owned": 742, "num_reviews": 22, "playtime_forever": 11889, "playtime_last_two_weeks": 0, "last_played": 1497238281}, "language": "english", "review": "This game simulates the invasion of the Soviet Union from June 22nd, 1941 until the end of January 1942. The Germans code-named the invasion Operation Barbarossa and their intent was to defeat the Soviet Union before winter. Anyone who knows a bit of history knows how that worked out...\n\nAs the German player you are placed in the role of Franz Halder, the Chief of Staff of the eastern Theatre of Operations. You are not Hitler - you are not even the highest ranking German officer! This is VERY important to game play as you navigate a myriad of relationships with superiors (including der Fuhrer) and subordinates (Army Group commanders) who EACH have a bias in favour of (or against) you and an overall \"relationship\" level with you (from say Terrible to Superb and everything in between). This relationship network is variable from game-to-game.\n\nOn the Soviet side, you play as the big guy, Stalin, and get a larger measure of control than Halder, but you are paranoid! If things start to go wrong on the front (losing territory) you have a \"paranoid episode\" and start executing commanders who you perceive to be a threat to you! Needless to say, this grinds the whole Soviet command and control apparatus to a halt for a few days.\n\nAt its core, DC:Barbarossa is a hex and counter wargame but the role-playing aspect outlined above makes this game unbelievably immersive and interesting to play. Casual players will not like having to move and attack with hundreds of divisions while managing supply etc... but for grognards this is no problem. It takes about 30 minutes to do a turn so this is not a \"twitch-fest\". The game is more streamlined than monster games like those of Gary Grigsby, however.\n\nI have played exclusively against human opponents, but according to the forums, 90% of people play against the AI and many have a LOT of trouble winning even against lower levels of difficulty! As a human-human struggle, this is BY FAR the best computer wargame experience I have ever had in over 40 years of board wargaming and computer gaming back to the C64 days.\n\nThe designers are actively tuning the game balance and supporting the fan base's requests for new features but they are also turning their thoughts to a new game using this engine. This is great news.\n\nIf any of this is remotely intriguing for you, check this game out!\n\nNOTE: I have several dozen PBEM games completed and hundreds of hours of play prior to the Steam release today!", "timestamp_created": 1461952751, "timestamp_updated": 1461960203, "voted_up": true, "votes_up": 36, "votes_funny": 7, "weighted_vote_score": "0.558485", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22706469": {"recommendationid": "22706469", "author": {"steamid": "76561198009584330", "num_games_owned": 140, "num_reviews": 12, "playtime_forever": 46, "playtime_last_two_weeks": 0, "last_played": 1501102726}, "language": "english", "review": "bought it when it came out. have 100 + hours--maybe closer to 200 messing around\nwith it.\n\nDCB has an initial 'wow' factor that wears off the more you play it. the game has a\nway locking your options in like don't screw with hitler the first turn etc etc.\n\nyou get one scenario that starts with barbarossa and ends in February 42. that's it.\n\ni have to admit it looks better at $39.00.\n\nthe germans are the most interesting side to play by far and if you don't have the\nrussians way down by October then...well you might as well start over. probably\naren't coming back and i bet, based on my experiences that there are a lot...i mean\nA LOT of do overs because most of the time you are walking on eggshells trying\nto remind yourself you aren't a truck dispatcher for EXXON MOBIL. now that might\nappeal to some but it takes some getting used to. a learning curve, not like the\nexcellent Command simulation but still a nice read of the manual will help a lot.\nplus the in game tutorials are excellent. there is a ton of info and its all germane\nto your success/failure. watch all the video you can stand.\n\ni could go on...but i think its one of those games you will not be satisfied until\nyou buy it yourself and check it out. it will itch until you have on your computer\nand then shortly thereafter will make you wonder why it the world you paid $39\nbucks. well just remember i paid $49. you can laugh at me all you want. \n\ni would you give you my copy in a second but that wouldn't be nice and i'm nice.\nso buy it and let me know what you think.\n\ni guess i could talk about the cards, the decisions, attempts to keep people happy\nthe weather and those damn siege guns but i won't. probably ticked off enough\nfans already.\n\nin the end, i'm still going to recommend it. i think everyone needs to play it...err\nbuy it. will make me feel better\n\n", "timestamp_created": 1461944826, "timestamp_updated": 1461944826, "voted_up": true, "votes_up": 16, "votes_funny": 15, "weighted_vote_score": "0.265947", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22705147": {"recommendationid": "22705147", "author": {"steamid": "76561198117221161", "num_games_owned": 245, "num_reviews": 15, "playtime_forever": 2630, "playtime_last_two_weeks": 9, "last_played": 1515782276}, "language": "english", "review": "Decisive Campaigns: Barbarossa covers the initial German invasion of the Soviet Union in 1941 and paints a unique picture of what goes into conducting a successful military operation.  It can be played solitaire or against a human opponent, and sports some of the strongest AI in the industry.\n\nThe game combines an easy-to-play but very deep turn-based divisional scale wargame with an extended role-play of command management.  This combination creates a brilliant and unique game system that is as important and revolutionary as the invention of card driven games for board wargames.  After playing Decisive Campaigns: Barbarossa you will never look at another wargame in quite the same way, because without the role-playing command layer something very important will be missing.  \n\nThe German player has to slalom around cranky colleagues, unruly subordinates, and irrational superiors while conducting a demanding military campaign that threatens to come unravelled if you run out of fuel or if too many of your trucks or panzers break down.  The Soviet player gets to be Stalin, wrestling with ineffective subordinates and growing paranoia while trying to keep the military situation from falling apart. \n\nThe game is not an orgy of micromanagement.  Many things appear to be handled abstractly, but appearences can be deceiving. The game focuses on the important decisions an overall theater commander must make and their influence on short-term combat operations. \n\nAnyone who has ever worked in a large organization has at some point taken a proposal to senior management for approval. You may already know the executive who has to sign off on the proposal, and you scan his face while he reads it hoping for advance warning on what is going through his mind. You listen carefully to his questions, trying to understand his thought process. You answer even more carefully, trying to steer him into your way of thinking. And to your delight, the questions that he come back at you with tell you that he is thinking about the proposal the way you want him to. When he summarizes the issues and the decision he has to make, you know that he fully understands why he needs to sign off. And then the unfathomable happens: he turns you down.\n\nDecisive Campaigns: Barbarossa played from the German side puts you into the role of that senior manager. You are constantly being asked to make decisions or delegate the choices to a subordinate, which amounts to pretty much the same thing. It is often painfully clear what the intellectually correct choice should be, and you repeatedly find yourself compelled to make a poor choice, or even the worst choice, with full understanding of what the unpleasant consequences are likely to be. \n\nAny action you take is likely to upset someone. Antagonize a subordinate and he'll be slow to carry out your orders, which won't do wonders for your next performance review. Annoy your peers and your fuel allocation will get diverted to Western Europe, or your supply trucks won't get repaired when they break down. Anger your superiors and count yourself lucky if all that happens is early retirement. Anything you do or don't do comes at a political cost, and you rarely have enough political capital stored up to do what absolutely needs to get done, let alone what you really want to do. So you perform a heart-breaking triage on the decisions you have to make, repeatedly making bad choices so as not to upset the apple cart because you need to keep your political powder dry for the big fight over that one thing you think you absolutely need.\n\nMake no mistake, this is a wargame. There's a big detailed map, with lots of units to move around and lots of places for them to go. But you're playing as theater commander. You sit there looking longingly at the map, thinking of all the brilliant maneuvers you could make and all the clever things you could do, if only you could get your subordinates to follow orders. And then you remember your inbox. It's a big inbox.\n\nSo why do you have to read through all those reports instead of focusing on moving your troops around ? You could delegate to your staff, and you can even ignore your inbox entirely. Many commanders throughout history have done precisely that. But it's part of your job, and sooner or later not understanding fuel consumption, railroad track gauges, and broken down trucks will bite you in the ankle, especially when the weather is starting to freeze over and your troops haven't been supplied with winter coats. \n\nPlayed from the Soviet side the game presents you with a different but equally challenging set of problems. You have to figure out how to get a brain-dead, incompetent, and terrified officer corps to do something (anything) while navigating around Stalin's episodes of paranoia. Less than ten years before the game begins the functional part of the Soviet officer corps had been purged, and the consequences of that purge are still very much in evidence in 1941. You survive in the Red Army by towing the party line and not being too prominent or conspicuous: showing too much competence or initiative was a one-way ticket to Lubyanka prison or the Gulag. In that environment, the natural inclination of a Red Army general with any hope of life expectancy is to do nothing. When he isn't descending into paranoia, Stalin can nudge the Red Army into action by dispatching Zhukov or Khrushchev to keep things under control or restore order. When playing the game from the Soviet side a player will find himself in a constant war with inertia.\n\nPlaying from either side you have the option to remove the management exercise layer from the game before it begins, and what you'll be left with is an engaging division-level wargame in the style of its predecessors in the series, Decisive Campaigns: Blitzkrieg Warsaw to Paris and Decisive Campaigns: Case Blue. But playing with the management layer turned on elevates Decisive Campaigns: Barbarossa to a unique experience that demonstrates at a visceral level that there's a lot more to being a good general than just making the right moves.", "timestamp_created": 1461939794, "timestamp_updated": 1461943493, "voted_up": true, "votes_up": 150, "votes_funny": 8, "weighted_vote_score": "0.768928", "comment_count": "3", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 59, "total_negative": 2, "total_reviews": 61}}
