{"reviews": {"38906066": {"recommendationid": "38906066", "author": {"steamid": "76561198044217886", "num_games_owned": 3716, "num_reviews": 92, "playtime_forever": 331, "playtime_last_two_weeks": 0, "last_played": 1514222332}, "language": "english", "review": "I love a good Shoot'em Up but this one falls short by a mile.", "timestamp_created": 1514735838, "timestamp_updated": 1514735838, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.467836", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38700833": {"recommendationid": "38700833", "author": {"steamid": "76561198072142271", "num_games_owned": 126, "num_reviews": 8, "playtime_forever": 1618, "playtime_last_two_weeks": 0, "last_played": 1506419784}, "language": "english", "review": "If you happen to have played Irisu Syndrome by the same developer, this one can be described as Irisu meets Touhou, without any scary surprises.\n\nOtherwise, to explain it simply, it's a vertical bullet hell shooting game with an empashis on bullet canceling. You can shoot only one bullet at a time, and while it does clear enemy fire as well as damage them, relying only on that is going to get you killed fast. Instead, you can shoot the colored shapes that appear throughout the level at a steady pace and try to make them bounce against each other: the block will soon explode and destroy anything in its area of effect. Each time the block you shot bumps into another one of the same shape and color, it will cause the second one to explode too, as well as increasing the power and radius of the blast.\nThat means that rather than squeezing through minuscule openings, you're encouraged to make use of the puzzle-like system to find the perfect moment and angle to hit the blocks and stop the bullets before they even reach you at all. This easy to understand core mechanic remains unchanged for the whole game, but never gets boring as you start to master it and find new ways to save yourself from a difficult spot. The two characters play similarly, with their normal shot being the biggest change: Kairi shoots a bullet that travels to the end of the screen and back, while Satsuki has a short range shot with much higer knockback and creates bigger explosions.\n\nAnother important difference from other shmups is that this one doesn't have extra lives or power-ups. Instead, you have a health bar, that can be occasionally replenished by picking up health items, and there is [b] no mercy invincibility[/b] at all, so you can't just let yourself hit it to pass a pattern. You do however have the traditional smart bombs for emergency situations.\n\nBosses work like Touhou, with the added bonus that some of their attacks are optional and come in the forms of \"duels\": if you play well enough, the boss coughs up a little red blob, and picking it up initiates an additional pattern. These create \ngreat opportunities for high-scorers, while beginners can easily ignore them with no repercussion.\n\nThe game has 5 main stages, which do get progressively more challenging but are easier than what you'd find in most \"pure\" STGs, and an extra 6th stage which ramps the difficulty up to eleven. If you're going for completion, be ready to have your patience tested. There is also a survival mode where you can try to endure the enemy assault for as long as you can, and a absurdly difficult \"hard mode\", that is thankfull not required for anything.\nBeating the game should take from 2 to 6 hours depending on your skill level and dedication, while clearing it 100% will extend the longevity quite a bit (took me more than 20 hours to manage everything, just to give you an idea, although to be fair I'm not a master player).\n\nInterestingly, despite being a shoot-em-up, a visible amount of care went into the backstory, which you can unlock little by little by collecting the achievements. It's not the main focus of the game, but it's nice to have a sembiance of plot that is not just a complete excuse to shoot things down, and it's a nice rewards for those willing to go the extra mile.\n\nAs for the technical side: enemy mobs are pretty much all variations of the same design, sadly, but the character and bosses' portraits are much more detailed and good-looking. The soundtrack is also easy on the ears and goes perfectly with the flow of the game, especially during the later levels.\nI didn't encounter any notable bug, and can confirm PS3 and PS4 controllers both work fine.\n\n[b]Summary[/b]:\n+ Unique gameplay concept\n+ Interesting lore and backstory\n+ Good OST\n+/-  Challenging.\n-  Slightly lazy mobs design and behaviour. Visual effects could also be a bit better.\n-  Relatively short if you don't care about completion.\nA breath of fresh air in the genre, and a completely unique shoot 'em up that any fan of the genre should be able to enjoy.", "timestamp_created": 1514302092, "timestamp_updated": 1514302092, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38647612": {"recommendationid": "38647612", "author": {"steamid": "76561198169757717", "num_games_owned": 141, "num_reviews": 18, "playtime_forever": 213, "playtime_last_two_weeks": 8, "last_played": 1515841348}, "language": "english", "review": "The game isn't as difficult as most danmaku games but the puzzle aspect in the mix makes the game feel so fun and rewarding. If you're a seasoned danmaku player expecting a difficult challenge in terms of dodging, look somewhere else but if you're expecting a fresh new take on danmaku games that are just as rewarding, this game is a must buy.", "timestamp_created": 1514183312, "timestamp_updated": 1514185231, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37640446": {"recommendationid": "37640446", "author": {"steamid": "76561198095339107", "num_games_owned": 39, "num_reviews": 19, "playtime_forever": 1148, "playtime_last_two_weeks": 0, "last_played": 1514036824}, "language": "schinese", "review": "th1精神续作（并不）\n音乐真棒啊\n第四关第五关是解谜，注意了\n打第四关的时候应该也注意到了，如果击破中间的壳（？）的话，会散开黑色的雾，也就是说你解谜失败了\n同理第五关", "timestamp_created": 1511687730, "timestamp_updated": 1511687730, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36999915": {"recommendationid": "36999915", "author": {"steamid": "76561198104962644", "num_games_owned": 81, "num_reviews": 1, "playtime_forever": 1526, "playtime_last_two_weeks": 0, "last_played": 1513427227}, "language": "japanese", "review": "シンプルで楽しい爆発パズル物理アクションゲームの名の通り、一見STGのようで実際はパズルの要素が強いです。はじめはルールを理解するのが大変ですが、慣れてくるとブロックを連鎖爆発させて点数を稼ぐ快感に酔いしれることができます。ランダム性がほぼないので、STGが苦手な人でもパターンを構築すればクリアできるんじゃないかと思います（6面は除く）\n\nまた、実績を取得することで徐々に明らかになっていく世界観や、素敵なBGMとシンクロした演出など、細かいところで魅力が光る作品です。サントラは超おすすめ。", "timestamp_created": 1511430665, "timestamp_updated": 1511430665, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36343216": {"recommendationid": "36343216", "author": {"steamid": "76561198125767680", "num_games_owned": 39, "num_reviews": 39, "playtime_forever": 262, "playtime_last_two_weeks": 0, "last_played": 1510062049}, "language": "japanese", "review": "面白かった！音楽良かった！以上！\n", "timestamp_created": 1510062419, "timestamp_updated": 1510062419, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36101497": {"recommendationid": "36101497", "author": {"steamid": "76561198094453893", "num_games_owned": 196, "num_reviews": 36, "playtime_forever": 437, "playtime_last_two_weeks": 0, "last_played": 1509381359}, "language": "schinese", "review": "第三关打了好几次才过去，游戏有一定难度。音乐好评。这个是十分有趣的游戏", "timestamp_created": 1509259882, "timestamp_updated": 1509259882, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36095564": {"recommendationid": "36095564", "author": {"steamid": "76561198060744858", "num_games_owned": 83, "num_reviews": 1, "playtime_forever": 231, "playtime_last_two_weeks": 0, "last_played": 1509196737}, "language": "english", "review": "Great game. I love the music, and the levels are pretty intense. I can't count how many times the entire screen was suddenly flooded with objects that could kill me in only a split moment with not much time to react. The bosses are especially intense, and keep you fighting for your life just to survive. The story on the side is interesting, but I think my favorite part of this game is the music personally. None the less, it's a cheap game, and a fun time passer at that. Certainly well worth the discounted price I got it for.", "timestamp_created": 1509241035, "timestamp_updated": 1509241035, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35909890": {"recommendationid": "35909890", "author": {"steamid": "76561198166571500", "num_games_owned": 69, "num_reviews": 6, "playtime_forever": 130, "playtime_last_two_weeks": 0, "last_played": 1513985520}, "language": "japanese", "review": "フリー版を所有していましたが、steam版も購入いたしました。\n単発の弾丸を画面上に向けて撃つゲームですが、\n時に画面を埋め尽くすような「弾幕」が発生し、\nいわゆる「ボム」もありますが敵を撃つ為にわざと被弾してすり抜けるプレイも\nやり方としてございます。\n進化したスペースインベーダーとも、私には解釈する事が出来ます。\nどの地点で撃って、どう避けるか。\n精密操作とその場の機転、面白いゲームだと判定します。\n純和風の雰囲気ながら、どことなく切ない映像と音楽。\nあなたの人生に、このようなミニゲームをそっと、いかがでしょうか。\nお勧めいたします。(*^-^*)", "timestamp_created": 1508646358, "timestamp_updated": 1508646358, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35212008": {"recommendationid": "35212008", "author": {"steamid": "76561198273011256", "num_games_owned": 1680, "num_reviews": 185, "playtime_forever": 140, "playtime_last_two_weeks": 0, "last_played": 1506380147}, "language": "spanish", "review": "[h1]Ok...[/h1]\nNo voy a mentir; no le entendi a este jueguito y en parte no me gusto xD\nSin embargo no soy jugadora asidua de bullet hells ni me gustan musho... a grandes rasgos: Es un bullet hell en el cual puedes manejar a 2 personajes con \"skills\" unicas, el juego tiene una mecanica tipo \"puzzler\" en la cual le tienes que pegar a 2 tipos de \"orbes\" para destruir balitas... y ya... llegue a la cuarta stage y de ahi no pase xD\nLa banda sonora es hermosa eso si.\n\n[h1]Resumiendo:[/h1]\nRecomendable si te gustan mucho los bullet hell... la banda sonora esta muy chill c: y pues tiene cierta curva de dificultad bastante buena.\n", "timestamp_created": 1506380116, "timestamp_updated": 1506380116, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34752075": {"recommendationid": "34752075", "author": {"steamid": "76561198179240493", "num_games_owned": 95, "num_reviews": 60, "playtime_forever": 1079, "playtime_last_two_weeks": 0, "last_played": 1504597587}, "language": "schinese", "review": "没想到会有机会接触到这款弹幕射击游戏，之前有玩过东方系列游戏\n对弹幕游戏还算比较懂，其中的一大特色就是包含着解密要素，说是\n解密要素，其实是恰当的打砖块引发连锁得到更高的分数以及过关吧\n\n音乐很不错，含DLC其中的那几首都很好听，循环再循环\n游戏的剧情和场景都不错，说的是主角二人拯救世界的故事\n跟遇到帮助过她们和她们帮助过的有爱的人们，大团圆结局\n\n相比东方系列，没有慢速，键盘手柄操作都不是很适应，花了好久才\n找到的手感，以至于用了很多时间都在如何完成成就上，确实有意思\n\nBoss战富有特色，虽然大招名字有些中二，不过难度还是有的\n4面Boss：打四个角的锁链，破茧成蝶，蝴蝶小姐姐被锁住了\n5面Boss：途中不要击破三个乐器成员，钢琴小姐姐会孤单吧\n6面Boss：注意弹幕，熟悉走位，大招保命，该怂就怂，能稳就赢！\n休闲玩家梦关太难不考虑，全成就知足了，推荐值得一玩(･´ω`･)", "timestamp_created": 1504599819, "timestamp_updated": 1504599819, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.563492", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34429913": {"recommendationid": "34429913", "author": {"steamid": "76561198159557537", "num_games_owned": 58, "num_reviews": 10, "playtime_forever": 390, "playtime_last_two_weeks": 0, "last_played": 1504065353}, "language": "english", "review": "Unexpectedly good and ridiculously underrated, but not without flaws.\n\nThis is a game about clearing bullets off of the screen - this shouldn't be compared to Touhou or any of Cave's shmups, simply because you have a lot more control over the bullet density. The mechanic for clearing bullets off of the screen is simple - you shoot one of the colored blocks and it explodes, clearing bullets. If the colored block hits a similarly colored block, then the explosion is larger, in proportion to how many blocks you hit.\n\nUsually, there's two different colors. The fact that you can choose which colored block to hit opens up a lot of very good mixed strategies for the veteran, which makes the game mechanic significantly more fun than it would be with just one color. There's harder stages with three colors, which has the effect of making things easier if you are very good, and harder if you are not.\n\nThe artistic style is incredibly good. First, the bullet patterns are fresh. Most bullet patterns in most games have the effect of pushing the cautious player down, but the cautious player in this game will sometimes feel himself pushed upwards, which is interesting. You really feel like you're using the entire screen to play very often, which is really good. Second, the art itself, though unpolished a little, is quite beautiful. Last, however, the music is absurdly good - \"bringing you to tears and making you serously consider buying the OST\" good. Perhaps the first thing I thought with respect to the style was that this is the game most US indie gamers wish they could make - a game that is undeniably a piece of art, but without any of the pretentiousness that typically burdens such games.\n\nI must admit that I take issue with three things: first, the second stage is notably harder than most of the rest of the game. This feels incredibly unbalanced. For someone who is good, this will not matter much, but it is not a good thing. I can imagine this being a significant hurdle for someone new. I would have put that particular opening sequence in a later stage, but the burstiness of it definitely fits the character of the second boss.\n\nSecond (spoiler), there does not appear to be indication in-game that you should not destroy the last stage midbosses in order to get the good ending. This is very counterintutive.\n\nThird, there is not a middle difficulty. The unprotected mode feels like \"Hard\" or \"Extra Hard\" mode, while the protected mode feels like \"Easy\" mode.\n\nThe third flaw makes me hesitant to categorically recommend this game - I thus conditionally recommend it. If you're starting out and trying to branch out, the protected mode of this game is a good way to do this. If you're mildly skilled (using Touhou as a yardstick, 1cc'ing most Touhou games on normal being no challenge, but 1cc'ing most Touhou games on hard being a bit beyond you) and you want a sort of challenge, the unprotected mode of this game is definitely a way to go. If you're very skilled, then perhaps spending 8 or so hours admiring the art and bullet patterns is worthwhile.\n\nThe only group of people I must say who should avoid this game are people who have a low, but not very low, level of skill. Unprotected mode will be too hard, and protected mode will be too easy.\n\nGet good, then blow $5 on this game. The experience will be very worth it.", "timestamp_created": 1503463007, "timestamp_updated": 1503463007, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34385749": {"recommendationid": "34385749", "author": {"steamid": "76561198067653526", "num_games_owned": 304, "num_reviews": 94, "playtime_forever": 953, "playtime_last_two_weeks": 0, "last_played": 1510996823}, "language": "english", "review": "danmaku+tetris is actually a pretty amazing combination \n\nalso check out Irisu Syndrome, another amazing game by this dev that isn't on steam unfortunatley", "timestamp_created": 1503279006, "timestamp_updated": 1503279006, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32904269": {"recommendationid": "32904269", "author": {"steamid": "76561198160868511", "num_games_owned": 573, "num_reviews": 357, "playtime_forever": 569, "playtime_last_two_weeks": 0, "last_played": 1498603934}, "language": "english", "review": "A cool Touhou inspired shoot'em up/bullet hell with a couple of very interesting twists.", "timestamp_created": 1498614853, "timestamp_updated": 1498614853, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.596222", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32154905": {"recommendationid": "32154905", "author": {"steamid": "76561198316922408", "num_games_owned": 145, "num_reviews": 11, "playtime_forever": 447, "playtime_last_two_weeks": 0, "last_played": 1514295481}, "language": "schinese", "review": "这游戏太良心啦~ 满分十分的话我给一百万\n\n剧情和场景：你玩的时候心里只有三个字，美美美；闯关模式，解密要素、真BOSS和二周目系统（大概，反正我才打到2-1。\n开心消消乐+台球（这样说也不太对，或许更像花映塚，手动奥特曼，反正是消弹游戏\nspecial：注意要按住x键一会儿松开才能释放\n成就系统：弹幕天邪鬼那种\nreplay系统：标题画面按esc就可以看了，游戏自动存rep\n\n\n非常值得玩，没有任何缺点（第一次觉得没有判定点很浪漫\n\n----------------------\n几小时游玩的评价：\n一周目难度 11（一面到五面不推把，海浬，全卡；沙月+1）\n                 20（一面到六面不推把，同上）\n二周目难度 ??  菜鸡表示2-1滚蛋回家\n无尽模式100层难度 19 （介于初代蜂一周和往生一周之间）\n\n以上为个人观点，参考CAVE系列做出的评难度，不过有一点是公认的：[spoiler]我游戏打得跟shi一样，指点江山还菜得一比[/spoiler]", "timestamp_created": 1496503384, "timestamp_updated": 1498116196, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.599612", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32090620": {"recommendationid": "32090620", "author": {"steamid": "76561198286200379", "num_games_owned": 1521, "num_reviews": 1462, "playtime_forever": 224, "playtime_last_two_weeks": 0, "last_played": 1496252212}, "language": "brazilian", "review": "Jogo muito bom\ncom varios puzzle e explosion\nmuito bom pra  quem gosta de jogo assim\nvale a pena \nrecomendo", "timestamp_created": 1496252258, "timestamp_updated": 1496252258, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.512627", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32056900": {"recommendationid": "32056900", "author": {"steamid": "76561198337842083", "num_games_owned": 91, "num_reviews": 8, "playtime_forever": 112, "playtime_last_two_weeks": 0, "last_played": 1496501468}, "language": "schinese", "review": "打了个4面，除了2面最开始有些丧病之外，其他的倒是没什么太大的阻碍，主要是这游戏玩起来太累了，比普通弹幕游戏累多了。什么？你问我好不好玩？废话么，太特么好玩了！", "timestamp_created": 1496125772, "timestamp_updated": 1496125772, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31577070": {"recommendationid": "31577070", "author": {"steamid": "76561198331777274", "num_games_owned": 3, "num_reviews": 1, "playtime_forever": 2408, "playtime_last_two_weeks": 0, "last_played": 1502393293}, "language": "french", "review": "Good game!", "timestamp_created": 1494064014, "timestamp_updated": 1494064014, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31018522": {"recommendationid": "31018522", "author": {"steamid": "76561198107973832", "num_games_owned": 199, "num_reviews": 8, "playtime_forever": 567, "playtime_last_two_weeks": 0, "last_played": 1490220449}, "language": "english", "review": "Ingenious game that combines a shooting game with puzzle elements. At first it may seem the puzzle element overshadows the shooting game but that's only when the game is teaching you the mechanics in the beginning. Later on it gets demanding and expects you to master both strategic shooting and bullet dodging.\n\nThe main mechanic of the game is sort of a block puzzle. By shooting colored blocks on the backround layer you can push them around. Knock blocks of the same colour into eachother and they explode dealing damage to enemies and bullets. Larger chains deal more damage. If you cancel bullets this way on bosses they take damage. This may sound confusing but the game really shows you through it and in the end the core mechanic is quite simple. The challenge to the player is figuring out how to deal with various situations on the fly. Often times you'll find yourself thinking out when to shoot and figure out a plan while managing your way through bullet curtains. Murasaki encourages you to be smart about your shooting sort of like Ikaruga or old school 80's shmups.\n\nA bullet health system is the other half of the puzzle mechanic. A bullets color matches its health and they are damaged by block explosions or the players shot. It's implemented quite well and makes you choose between shots or the size of block chains to go for. The default character is far better at cancelling bullets (ie. defense) while the other can land bigger attacks off the puzzle blocks. The latter also has to be careful going to the top of its screen as she has little range to shoot downwards. However dont expect to be able to always rely on bullet cancels, on higher health patterns this wont work. Often to get larger block chains for tricky sections you will end up not shooting for extended periods and having to dodge much more.\n\nMurasaki's soundtrack is really amazing, top notch and there's a lot of competition in this genre. The chill music on stages goes well with the puzzle element and boss themes match their intensity. A fair bit of music syncing, especially with the true route of stage 5. Even if you're not a fan of the gameplay itself the music might surprise you.\n\nAfter getting the ending you unlock the 6th extra stage which is far more challenging than anything preceding it. The boss of this stage truly demands some dodging skills and figuring out the tricks of its patterns. If you're not a shmup veteran this stage will likely be a wall, but smart play is still always rewarded so it can be enjoyable to learn shmups in this way.\n\nThe game includes a hard mode for the first 5 stages which makes their difficulty curve match more with the extra stage. The bosses get significantly harder and you need to approach some stage sections more as a puzzle. Stage 6 on normal is still tougher than anything in hard mode. There's also an endless stage that really tests your skill in the puzzle element as you cannot memorize and it keeps on getting tougher.\n\nDefinitely one of the best value for money for STG/shmups on Steam unless you have an aversion to bullet cancelling gimmicks. Murasaki implements its idea well and is a joy to play. Should be refreshing to anyone who thinks shmups are out of innovative ideas. It's worth noting this was first released as a free game, and for that it is quite amazing.", "timestamp_created": 1491661128, "timestamp_updated": 1491661550, "voted_up": true, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.736533", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30960904": {"recommendationid": "30960904", "author": {"steamid": "76561198046268101", "num_games_owned": 196, "num_reviews": 93, "playtime_forever": 390, "playtime_last_two_weeks": 0, "last_played": 1511585685}, "language": "japanese", "review": "一見シューティングゲームながら自機の弾は単発。実際は敵の弾幕を避けながら爆弾でビリヤードをするゲーム。\nBGMがとても独特で良い。ただ効果音やメニューなどは少し寂しい。\nボス戦に特殊条件が付いていることが多いがゲーム内ではほとんど解説されない。ボス戦が異常に短いと思ったら色々試すかググろう。\nフリーゲーム版と内容は変わらないので日本語が読める場合はSteamで購入する意味はあまりない。セール価格でサントラを買うとゲームがもれなく付いてくる。", "timestamp_created": 1491398957, "timestamp_updated": 1511585774, "voted_up": true, "votes_up": 13, "votes_funny": 1, "weighted_vote_score": "0.687843", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 53, "total_negative": 2, "total_reviews": 55}}
