{"reviews": {"38355067": {"recommendationid": "38355067", "author": {"steamid": "76561198043367667", "num_games_owned": 1030, "num_reviews": 147, "playtime_forever": 34, "playtime_last_two_weeks": 0, "last_played": 1513535877}, "language": "english", "review": "This game is 100% pure class and I am quite sure it is the very best fighting games on Steam for its price.", "timestamp_created": 1513443595, "timestamp_updated": 1513443595, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38265047": {"recommendationid": "38265047", "author": {"steamid": "76561198035425814", "num_games_owned": 293, "num_reviews": 5, "playtime_forever": 73, "playtime_last_two_weeks": 0, "last_played": 1513712807}, "language": "english", "review": "The fighting  mechanics are simple but brilliant and very addictive. Each fighter has peculiar moves which leads to many ways and strategies in game.", "timestamp_created": 1513109916, "timestamp_updated": 1513109916, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38233409": {"recommendationid": "38233409", "author": {"steamid": "76561198012975135", "num_games_owned": 497, "num_reviews": 6, "playtime_forever": 13, "playtime_last_two_weeks": 0, "last_played": 1513251502}, "language": "english", "review": "The game seemed cool but without proper controller support it is essentially unplayable. \n\nEDIT: While the issue seems to not be fixed yet, the developer is working to get it fixed and it feels unfair to not recommend the game when it's evident the dev does listen when there are issues, and works to fix them ASAP.", "timestamp_created": 1512994200, "timestamp_updated": 1513245165, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.491489", "comment_count": "12", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "timestamp_dev_responded": 1512999301, "developer_response": "Hi 23238E!\nThe game does have full controller support.\nDo you bother to check this?\nDisable PS4, Xbox, and Generic Gamepad Configuration Support settings in Steam Big Picture controller configuration settings. \nPlease let me know if your controller worked after doing this."}, "38179383": {"recommendationid": "38179383", "author": {"steamid": "76561198098755981", "num_games_owned": 67, "num_reviews": 3, "playtime_forever": 22, "playtime_last_two_weeks": 0, "last_played": 1512824481}, "language": "english", "review": "Nostalgia everywhere!\n\nThis game gave me goosebumps while I remembered all my golden days playing Master System, Mega Drive, Gameboy and other video games.\n\nBut talking about the game... The game is really well polished and balanced. You have one chance to defeat your opponent and mastering the defense, attack and dash timing is essential. At first you can think: \"What the! This character is too easy\", but them you get to play at HARD difficulty and you see that the game is pretty well balanced and hard to master.\n\nAnd oh, the music.... it's just amazing. I actually stayed minutes in the game title screen just to listen to the full song. All of the songs are great, and also the sound effects.\n\nThe graphics are really good. I like the way the developers balanced the high def graphics with the 8 bits. You actually see that the 8 bit was a design choice and the developers have the skills to deliver highly detailed graphics.\n\nThe controls could be better, though. Be able to rebind them would be really cool.\n\nI'm giving an 8.5/10 to this game. Looking forward to see it flourish and new deliveries from these developers.", "timestamp_created": 1512824472, "timestamp_updated": 1512824472, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.491445", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37774652": {"recommendationid": "37774652", "author": {"steamid": "76561198103473794", "num_games_owned": 168, "num_reviews": 1, "playtime_forever": 127, "playtime_last_two_weeks": 0, "last_played": 1511784975}, "language": "brazilian", "review": "(English)\nOne Strike is a 2D fighting game with great gameplay, art, and soundtrack. It has references and elements that the lovers of the 90's fighting games, like Bushido Blade and Samurai Shodown, will really like.\n\nDue to the mechanics of one-hit kill, and also for each character possessing unique abilites, it's essencial to read the oponent's next step to become victorious, turning the battle very cool. The gameplay is also very simple and fluid, making it easy to learn each character's techniques.\n\nIt also has various 1P and 2P modes, like the \"Tournament\" and \"Team Duel\" mode, turning the game more challenging and fun.\n\nIf you like 2D fighting games, One Strike is a highly recommended game!\n\n(Português brasileiro)\nOne Strike é um jogo de luta 2D com uma jogabilidade, arte e trilha sonora excelentes. Possui elementos e referências que farão os amantes de games de luta dos anos 90, como Bushido Blade e Samurai Shodown, gostarem muito.\n\nDevido a mecânica de one-hit kill, e também por cada personagem possuir habilidades únicas, é essencial fazer a leitura do movimento do oponente para sair vitorioso, o que torna a luta muito legal. A jogabilidade também é bem simples e fluida, ficando fácil aprender as técnicas de cada personagem.\n\nTambém contém vários modos para 1P e 2P, como o modo \"Tournament\" e \"Team Duel\", tornando o jogo mais divertido e desafiador.\n\nSe você gosta de jogos de luta 2D, One Strike é um jogo muitíssimo recomendado!", "timestamp_created": 1511785030, "timestamp_updated": 1511785030, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36654192": {"recommendationid": "36654192", "author": {"steamid": "76561198287038981", "num_games_owned": 8, "num_reviews": 2, "playtime_forever": 51, "playtime_last_two_weeks": 0, "last_played": 1511212833}, "language": "english", "review": "This is a nice fun quick game. One Strike surely lives by it's name and you'll be able to play really quick matches. Perfect for playing when you have little time to spare.\n\n\nThe songs and graphics are great.", "timestamp_created": 1511212936, "timestamp_updated": 1511212936, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.491445", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36649962": {"recommendationid": "36649962", "author": {"steamid": "76561198038990893", "num_games_owned": 79, "num_reviews": 5, "playtime_forever": 165, "playtime_last_two_weeks": 0, "last_played": 1511196998}, "language": "english", "review": "This is a very good little indie game! I don't see many indie fighting games, so as a fan of the genre that's a good thing to have. The one-hit mechanic is SUPER cool given the samurai setting, very adequate, you feel the tension in each match, even they being so short (less than 10 seconds many times). \n\nPROS\n- One-hit-kill mechanic that sets this game apart from most else\n- Interesting characters with unique moves and different combat styles\n- Very short matches make up for a unique experience in a fighting game\n- Nice pixelart characters and environments\n- Little indie game to kill time and play with friends\n- Low Pricing\n\nCONS\n- Few characters to play. Probably the developer will add more over time\n- It may get a little repetitive playing against AI for some time, so bring some friends!\n\nDefinetely worth it if you like samurai, fighting games, local co-op, pixelart or if you're just a nice guy who likes to support indie devs. Honestly I have never played a game like this.", "timestamp_created": 1511198540, "timestamp_updated": 1511198540, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.491445", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36648914": {"recommendationid": "36648914", "author": {"steamid": "76561198053573278", "num_games_owned": 165, "num_reviews": 1, "playtime_forever": 109, "playtime_last_two_weeks": 0, "last_played": 1511195179}, "language": "brazilian", "review": "Gostei da proposta do jogo, com uma jogabilidade simples, diferente e desafiador, exigindo muito da habilidade do jogador. Estilos gráficos e músicas relembrando os jogos clássicos.\n\nO que poderia melhorar:\n\n1 - Adicionar um modo história, com um background pra cada personagem,\n2 - Mais fases e personagens;\n\nÓtimo jogo pra desafiar os amigos. Parabéns para a Retro Reacto!!!", "timestamp_created": 1511195213, "timestamp_updated": 1511195213, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.565217", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36581992": {"recommendationid": "36581992", "author": {"steamid": "76561197996086738", "num_games_owned": 871, "num_reviews": 4, "playtime_forever": 68, "playtime_last_two_weeks": 0, "last_played": 1510955258}, "language": "english", "review": "Very fun and addicting. The game might seem simple at first, but the characters can be very complex and lead to multiple strategies. Also there is a nice motivation to play all modes with all character so that you can get all your accolades.", "timestamp_created": 1510956837, "timestamp_updated": 1510956837, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.491445", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36522119": {"recommendationid": "36522119", "author": {"steamid": "76561197994002775", "num_games_owned": 3269, "num_reviews": 657, "playtime_forever": 12, "playtime_last_two_weeks": 0, "last_played": 1510075606}, "language": "english", "review": "In this game, timing is the only thing that matters, timing to move back, to attack\neach character have its own attack move & weapon\neach weapon have its own differences in attack distance, attack speed, ect wich makes the game more challenging to do against ai\ndo this with friends while you are drunk and you'll have a lot of fun trying to be the fastest\nI always imagene how good games with these graphics should have been in the 90s on nes or snes\n\nhttps://www.youtube.com/watch?v=9wUBnjxOWps", "timestamp_created": 1510707386, "timestamp_updated": 1510707386, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.490709", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36511901": {"recommendationid": "36511901", "author": {"steamid": "76561198097418085", "num_games_owned": 62, "num_reviews": 3, "playtime_forever": 76, "playtime_last_two_weeks": 0, "last_played": 1512436910}, "language": "english", "review": "One Strike is a challenging, fun and very balanced game.\n\nI have had the pleasure of seeing this game grow and become this marvel, I am very happy now you can be playing.\n\nAll modes are amazing. With a very good leveling and guaranteed fun, the mechanics of a stroke and end is the most incredible of all, it brings a more tense and interesting atmosphere for the game.\n\nI can guarantee that the game will bring a lot of fun, whether in singleplayer or multiplayer mode.\n\nIf you like challenge and fun, this is one of the best choices you will find here on Steam!", "timestamp_created": 1510668172, "timestamp_updated": 1510668172, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.513959", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36508087": {"recommendationid": "36508087", "author": {"steamid": "76561198245656610", "num_games_owned": 78, "num_reviews": 26, "playtime_forever": 40, "playtime_last_two_weeks": 0, "last_played": 1510650902}, "language": "english", "review": "[h1] What is this game? [h1]\n\nOne Strike is like the old Mortal Kombat its 2D has pixel graphics all its missing are fatalities to make it MK.\n\n[h1] About this game and my opinion about it [h1]\n\nSo the controls on keyboard are pretty messed up atleast for me but luckily this has controller support which suggest you play with since it makes the game easier. The game has 6 characters they have unique moves and you can make a strategie with them if you want. The game will feature trading cards very soon so thats gonna be fun most likely. And you can play with your friends but if you dont have 2 controllers it may be unfair for them or you since it gets pretty hard. The difficulity mesaurements are great the hard mode isnt some extreme stuff its just for people with more skill and the normal is pretty much who played the genre and the easy is who are new to the genre and the style of the game.\nThe game has 4 very interesting mode and i wont go too much into the modes at all. The game doesnt need a story to be honest its good as it is like this. And the soundtrack is most likely the best thing about this game it just fits with the game so good i love the soundtrack they made it really good. And the pixel graphics are amazing as well as the little details on the screen like moving grass and more. And the games reality is quite good its one hit and your down its like real life.\n\n[h1] My rating [h1]\n\nOverall: The game is amazing you should buy it now and recommend this game up so it gets featured on the steam store :D\n\nRating: 7.5/10\n\nBuy this game now.\n\n[quote] This review was submitted for [url=http://steamcommunity.com/groups/gaming_until_end]Gaming Until End[/url], through the generous contribution of [url=http://steamcommunity.com/id/HellCowON]HellCow.[/url] [/quote]", "timestamp_created": 1510651547, "timestamp_updated": 1510651547, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.491445", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36496404": {"recommendationid": "36496404", "author": {"steamid": "76561198135614484", "num_games_owned": 113, "num_reviews": 29, "playtime_forever": 28, "playtime_last_two_weeks": 0, "last_played": 1510594387}, "language": "english", "review": " Co-op mode review https://youtu.be/DDQdw4QmSIw \n\nPros\n- Easy to pick up.\n- Fun and exciting.\n\nCons\n- Game mechanics is too shallow.\n- Fun for awhile, gets old preety fast.\n\nFinal\n- Recommended or buy it during a sale.\n- Skip this game if you want something harder and deeper.", "timestamp_created": 1510595752, "timestamp_updated": 1510595907, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.468424", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36491470": {"recommendationid": "36491470", "author": {"steamid": "76561198138290285", "num_games_owned": 103, "num_reviews": 23, "playtime_forever": 52, "playtime_last_two_weeks": 0, "last_played": 1510574876}, "language": "english", "review": "[h1] One strike, the perfect way to slash op your foes in glorious 8-bit combat. [/h1]\n\nOne strike is wonderful wonderful game about 6 samurai fighting eachoter in ancient japan. This is achieved with a measely 6 buttons to make your character move across the screen, block and slash up your opponents. The name \"One Strike\" comes from the mechanic that once you're hit, you're dead; this makes the game ever more tense as you are trying to down your foes and save your own life. \n\n[b] Introduction [/b] \n\nOne strike is a two dimensional fighter with a one hit, one kill mechanic. Your primary objective is to kill your opponent, this is done by hitting them with whatever weapon your character has; this varies from character making the ways you fight and fight every enemy more thoughtfull and gives the game more depth. All of this is supported by the games amazing soundtrack that puts this game in my book as a \"Good Game\" as i know i will play this game many times because of how much fun i have with it. \n\n[b] Combat [/b]\n\nThis the most important part of a 2D fighting game and it does it very well, not that it's perfect however it is near to perfect. Each character has the ability to: move forward, backward, dash forward and backward, block and attack. The movement, although having different animations, are practically the same for every character. The block and attack are very different, each character has a different weapon, this ranges from a simple sword to a throwable knife with a chain attached to it so it can be pulled back. Each character has their own weapon and utilizes it in their way, one character may use his sword to block directly while the other swings around his staff so fast he blocks enemy attack with them. These blocks last for a few seconds after which you are vulnerable until you press the block key again; this is done on purpose so that someone cannot sit still blocking for the entire match so that the enemy still has a chance to cut your wang off. \n\nAttacking can be done during the times your enemy isn't blocking, this does leave you vulnerable if you do miss and not being able to block instantly makes you think wether you should attack now or later in order to main your enemy. This level of depth is something that i had at first not expected from a game like this, being as this is a one hit one kill system the combat system is not like street fighter where you mash the same button and eventually win. \n\nThe addition that every character has it's own weapon and blocks is also very important, this makes you as a player change the way you play the game according to your character and to your enemy, that means that there are 216 different ways to play the same game; which is pretty impressive. \n\n[b] Soundtrack [/b] \n\nThe soundtrack of this game is also phenomenal, it's fast paced and has an almost japanese theme to it. It's very nice to listen to and it accentuates the great combat of One Strike. I cannot stress enough how important the soundtrack is to this game, it is absolutely amazing and one of the best i have heard in a long time. I find it accelerates a little slow however when it's going it's absolutely wonderful and i feel like a japanese samurai 800 years ago fighting for my life. dashing across the landscape in intense combat. \n\n[b] Gamemodes [/b] \n\nThere are 4 different was to play One Strike, One life; where you have one life and have to beat 5 other characters. Arcade where you have to beat 5 characters however you both have 5 lives. Team deathmatch where you need to beat 5 teams each 3 characters with one life each. and Tournament where 8 characters figh in a tournament grid, so 1v1's until the finale, all these gamemodes can be set on easy, medium or hard which brings me to my next point\n\n[b] Artificial Intelligence [/b]\n\nThe AI in this game is quite good, it knows how to play the game and does so with supprising accuracy, often it was ammusing to see the hard AI fight ittself just because of how good it was. I have heard complaints about the easy AI being too simple however there's a reason it's called \"Easy\" if you want to easily win then that's the gamemode for you. To me only the \"Hard\" bots prove a real challenge that i struggle to beat. \n\n[b] Minor issues [/b] \n\nThere are minor technical problems such as in tournament mode both players being called \"P1\" in the finale etc. These are all very small things that i see other reviewers heavily criticising however this is not a gamebreaking aspect in any way so i'm going to leave it at this because it is not important. \n\n[b] Conclusion [/b] \n\nOne strike is a wonderful game with combat that feels rewarding, the sounds not being overused and nice to listen to; all supported by a masterful soundtrack that i'm still listening to while writing this review. For it's relatively low price this is a game i recommend anyone that likes video games to play; I myself don't like 2D fighters too much and i was able to enjoy it all the same. \n\n[quote] This review was submitted for [url=http://steamcommunity.com/groups/gaming_until_end]Gaming Until End[/url], through the generous contribution of [url=http://steamcommunity.com/id/HellCowON]HellCow.[/url] [/quote]", "timestamp_created": 1510579112, "timestamp_updated": 1510666472, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.511938", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36475383": {"recommendationid": "36475383", "author": {"steamid": "76561198111798207", "num_games_owned": 168, "num_reviews": 25, "playtime_forever": 103, "playtime_last_two_weeks": 0, "last_played": 1510347138}, "language": "brazilian", "review": "One strike é um game de estilo de luta 64 bits bem, desenvolvido e distribuído pela produtora índie: Retro Reactor. \n\nO game segue a linha \"one punch\" são games geralmente de luta estratégica onde apenas um golpe é o suficiente para eliminar o inimigo. \n\nBasicamente o game tem uma linha oriental com 6 personagens completamente únicos que utilizam 4 teclas para ir para frente para trás defender e bater, o maior diferencial do game talvez seja a estrategia de cada personagem.\n\nDependendo de qual personagem usado e qual seu inimigo diferentes técnicas serão usadas, sendo assim você tem 6 personagens e tem de fazer 6 estrategias  logo que terá de lutar contra 6 inimigos completamente diferentes.\n\nO game conta com 4 modos, no 1 você terá de lutar contra os 6 personagens e com um hit você é morto, e seu inimigo também, e sê morrer recomeça o modo. No modo árcade é um melhor de 5 onde quem ganhar 5 rouns primeiro ganha, você terá de lutar contra todos da mesma forma, modos torneio e multiplayer local todos já conhecem desse gênero.\n\nNo fim One Strike é um game muito bom e divertido porém que não rende muitas horas de gameplay e 11 reais não é nenhum pouco justo levando em consideração a simplicidade. Em uma promoção a partir de 8 reais o game vale bem a pena ainda mais sê você quiser uma jogatina local com seus amigos.\n\nGráfico: 20/20 É um gráfico bem quadradão que da uma imersão aos anos 90, que ainda assim consegue ser muito atraente e ter até mesmo levantamento de poeira em alguns golpes. \n\nHistoria: 0/20 Nulo a proposta do game não trás historia mas sim a falta de back graund para os personagens faz falta.\n   \nJogabilidade: 18/20 Quase perfeita e exclusiva para cada um dos personagens porem o botão de defesa é defeituoso.\n\nAmbientação: 18/20 muito legal porem pouca existem muito poucos senários mas os que existem são muito bem feitos.\n\nGameplay: 15/20 O game é bem divertido mas falta balanceamento de personagens.\n\nTOTAL: 71\n\nRecomendado para todos, mas lembrando em promoção 11 reias não vale a pena a partir de 8 é bem recomendável.\n\nAdendos:\n\n1- O game foi recebido de graça \n\n2- O game foi jogado no PC\n\n3- Está é a quinta sexta apôs sua reforma \n\nMais analises? então entre aqui: https://matilhacorp.blogspot.com.br/", "timestamp_created": 1510508266, "timestamp_updated": 1510508266, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.583333", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36446364": {"recommendationid": "36446364", "author": {"steamid": "76561198143704207", "num_games_owned": 127, "num_reviews": 16, "playtime_forever": 255, "playtime_last_two_weeks": 0, "last_played": 1510406630}, "language": "english", "review": "One Strike is a great example of one-day games. Gameplay is pleasant, and the graphics do not irritate the eyes, the music is suitable, and in appearance - a good game. But there is no distinctive features to make the game stand out against the background of others. This is a two-dimensional fighting game in the setting of medieval Japan with pixel graphics and retro aestetics. In total, the game has 6 characters, several arenas and game modes.\n\nIn such indie games, in a limited budget, it is important to maintain a balance in the graphics - to make a unique design and fit into a low budget for development. Unfortunately, only the result of the fact that the developers saved money. Sprites are made so-so, and on the backs of only plain-looking dull pixel art. Artists fighters are also very strange, we have the same retro aesthetics, so why make the interface of the main menu and the choice of the character pixel, and the background and sprites of the characters to draw the usual? Arenas are not something that would be ugly, but you could do better - at least the overall composition should be built according to the rules, not at your discretion. I also did not like the dim color palette, you can add a little brightness to the colors and contrast. And so, basically - the usual pixel indie-graphics, nothing new.\n\nMusic does not convey that atmosphere, but it does well with the ambient function. An incomprehensible Chiptune, or even ordinary tracks recorded in FL Studios using effects - it is not as expressive as you would like.\n\nThe gameplay in the game is the main feature. In total there are 6 characters and 5 game modes. Battles take place on the condition of \"one hit - one kill\", where the enemy and you die from one hit, and it's great - thanks to this condition the game got rid of tiresome fights like in the other fighting games - they pass very quickly and vigorously, you will not get bored here. The simplest control, only 6 buttons, four of which are responsible for control, and the rest are for the block and attack. Accustomed to instantly - there really is nothing to get used to, and it's cool. Each character has his own blocks and attacks, and this results in different tactics for different heroes. The modes \"Tournament\" and \"Local multiplayer\" are incomparable. If with multiplayer on one keyboard everything is clear, then the tournament is something new. Up to 16 players can compete with each other and find out the relationship with the leadership in the tournament grid, it's something new.\n\nA good indie fighting game with the ability to play with friends, a variety of game modes, nice gameplay, and an excellent price - why not play it? Especially, it is clear that the developers tried, although in some aspects the game did not come out very well.\n\n[code] This review was submitted for [url=http://steamcommunity.com/groups/gaming_until_end]Gaming Until End[/url], through the generous contribution of [url=http://steamcommunity.com/id/HellCowON]HellCow.[/url] [/code] \n\n==============================================================\n\nOne Strike - это отличный пример игр-однодневок. И игровой процесс приятный, и графика не нагружает глаза, музыка подходящая, да и по виду - хорошая игра. Но нету никакой изюминки или отличительных свойств, чтобы игра выделялась на фоне других. Это двухмерный файтинг в сеттинге средневековой Японии с пиксельной графикой и закосом под ретро (мы этого ещё никогда не видели, инфа сотка). Всего в игре есть 6 персонажей, несколько арен и игровых режимов.\n\nВ таких инди-играх, в условиях ограниченного бюджета важно соблюсти баланс в графике - сделать уникальный дизайн и уложится в низкий бюджет для разработки. К сожалению, здесь виден только результат того, что на графике сэкономили. Спрайты выполнены так себе, а на задниках только невзрачные тусклые пиксель-арты. Арты бойцов тоже весьма странные, у нас же ретро-эстетика, так зачем делать интерфейс главного меню и выбора персонажа пиксельным, а фон и спрайты персонажей нарисовать обычными? Арены не то что бы некрасивые, но можно было сделать лучше - по крайней мере общую композицию нужно строить по правилам, а не по своему усмотрению. Ещё мне не понравилась тусклая цветовая палитра, можно добавить слегка яркости краскам и контраста. А так, в основном - привычный пиксельный инди-графон, ничего нового.\n\nМузыка не передаёт той атмосферы, но с функцией эмбиента справляется хорошо. Непонятный чиптюн, или даже обычные треки, записанные в FL Studios с использованием эффектов - она не выразительна настолько, насколько хотелось. \n\nГеймплей в игре - это главная особенность. Всего есть 6 персонажей и 5 игровых режимов. Бои проходят по условию \"one hit - one kill\", где противник и вы умираете от одного попадания, и это здорово - благодаря этому условию игра избавилась от утомительных боёв как в других файтингах - они проходят очень быстро и энергично, здесь не заскучаешь. Управление простейшее, всего 6 кнопок, четыре из которых отвечают за управление, а две остальных - за блок и атаку. Привыкание происходит моментально - тут толком не к чему привыкать, и это круто. У каждого персонажа свои блоки и атаки, а из этого вытекают разные тактики боя за разных героев. Режимы \"Турнир\" и \"Локальный мультиплеер\" просто бесподобны. Если с мультиплеером на одной клавиатуре всё понятно, то турнир - это что-то новенькое. До 16 игроков могут соревноваться друг с другом и выяснять отношения посредством лидерства в турнирной сетке, это что-то новенькое.\n\nХороший инди-файтинг с возможностью играть с друзьями, разнообразием игровых режимов, приятным геймплеем, и отличной ценой - почему бы и не поиграть? Тем более, видно, что разработчики старались, хоть и в некоторых аспектах игра вышла не очень.\n\n[code] Этот обзор предоставлен для [url=http://steamcommunity.com/groups/gaming_until_end]Gaming Until End[/url], посредством большого вклада [url=http://steamcommunity.com/id/HellCowON]HellCow.[/url] [/code]", "timestamp_created": 1510414856, "timestamp_updated": 1510414856, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.519841", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36438079": {"recommendationid": "36438079", "author": {"steamid": "76561197989338446", "num_games_owned": 105, "num_reviews": 3, "playtime_forever": 12, "playtime_last_two_weeks": 0, "last_played": 1509737914}, "language": "brazilian", "review": "Por que eu recomendo One Strike?\n\n1- Estilo gráfico old School. Dá até gosto de jogar em telas menores. Animações fluidas desta pixel art. \n2 - controles simples  (o que não quer dizer que o jogo seja fácil. Há uma curva rápida de aprendiZagem, mas que traz boa diversão principalmente quando o player 2 é seu amigo. \n3 - Caracterisitco jogo de luta. \n4 - Som e efeitos não deixam a desejar. \n5 - Personagens bem construídos arte linda na seleção dos mesmos.\n6 - dá pra usar teclado e joystic \n7 - Processamento leve\n\nO que pode melhorar? \n\n1 - Ter mais fases \n2 - Modo história com cutscenes \n3 - outros idiomas (pelo menos o português), mas não atrapalha em nada no jogo \n", "timestamp_created": 1510391839, "timestamp_updated": 1510391839, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36428585": {"recommendationid": "36428585", "author": {"steamid": "76561198121699512", "num_games_owned": 37, "num_reviews": 8, "playtime_forever": 39, "playtime_last_two_weeks": 0, "last_played": 1510351632}, "language": "english", "review": "It's an amazing tribute to old school fight games!\n\nThe strongest points of One Strike are the fact of each duel is a mini heart attack at the end, the weight of animations and the screenshake create a very good mood when you cut some necks or strip a belly off! The music and SFX are dramatic and the pixel art graphics are beautiful!\n\nEach character has a very particular way of fight, wich is great cause you have to try a lot of different tatics to win.\n\nThis game has a very cool mood into the samurai way-of-life!", "timestamp_created": 1510352184, "timestamp_updated": 1510352184, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36381739": {"recommendationid": "36381739", "author": {"steamid": "76561198119208591", "num_games_owned": 187, "num_reviews": 12, "playtime_forever": 300, "playtime_last_two_weeks": 0, "last_played": 1514825641}, "language": "english", "review": "Edits will be on the bottom.\n\nThis game is oddly charming. This might have to do with the fact that the game's pixel art and normal art combined with its smooth gameplay and enticing soundtrack is rather well done. As far as I can tell, there isn't many bugs and I haven't tried out all the modes yet, but from the base game alone, I can tell it's very well done. I have achieved all modes of the One Life except for Very Hard which I haven't unlocked, so I'll base this opinion on those quirks alone. Every character is balanced in a specific way. The first one, The Swordsman, (I couldn't really get their names as the font is really hard to look at,) is basic enough to learn the game with. He has a guard that is activated with H and an attack that swings outward with G. He can also dash backwards and forwards with the T and Y keys respectively. I personally like The Chain Swinger as she has zero guarding, but can easily attack targets from a distance with her G attack and can swing faster in close quarters if she is that close with her H attack. It's not too bad of a game as it reminds me of others such as DropKick and Mortal Kombat. It is simplistic enough that it isn't too hard and not too easy. It's balanced just right to where you feel a sense of accomplishment when you make a finishing blow on a target and don't feel annoyed as much when you lose.\n\nPros:\n-The gameplay is well done. No character feels out of place here. Each have their own strengths and weaknesses that make them strong against certain targets and weaker against others.\n-The pixel art is very good for the time. It is reminiscence of older japanese cultures as what I picked up was that all the characters in the game use a specific type of japanese weapon. While I may not know the specifics of the swords, I do know that the last character, The Sai Wielder, uses double sais in her tactics which I believe was used in old japanese lore.\n-The soundtrack and sounds are all approriate for its timeperiod. They don't sound completely off and instead enchance the game's overall appearance making you feel like you are fighting others somewhere in older Japan.\n\nCons:\n-I found a weird bug that happens specifically with The Sai Wielder. If she dies and the opponent dashes to her before the revenge and other buttons appear, she can glide across the ground back to the other side. This isn't too deterimental as it doesn't happen a lot, but I found it odd that it happens at all.\n-Another wonky thing I found is that the hitboxes for some abilities are rather...quirky, I guess. For example, if you use Sai Wielder's Attack just before The Chain Swinger uses her G attack, you can get the hitboxes rather unresponsive to an attack to the Chain Swinger unless you dash into her again and attack. This is also a weird bug that occurs, but I have no idea how it works. It also happens really frequently, but it's activated by player response to AI reactions. It's not too bad, but I've had a few times where the attack should of hit her and it goes right through. I'm not sure if it's even truly a bug either, it might just be how the Sai Wielder is played.\n-The controls take some time to adapting to. I don't like that you can't change them because I only used a keyboard to play the game as it was all I had. It's just weird, that's all.\n\nOverall: I'd give it a solid 7/10 or 8/10.\n\nComments: The game works well with what it has. Although there are some random bugs that may occur, they don't detract too much from the presentation overall. The gameplay, soundtrack, and pixel art all work well and together they make a charming game that doesn't require too much from the player.\n\n[code] This review was submitted for [url=http://steamcommunity.com/groups/gaming_until_end]Gaming Until End[/url], through the generous contribution of [url=http://steamcommunity.com/id/HellCowON]HellCow.[/url] [/code]\n\nEdit to the current review: Found another bug, but it's only purely visual. Somehow, on the final tournament battle, you end up with two 1P. The battle is the same as it should be from how it looks on the tournament screen normally, but when it says who is fighting who next, that shows up instead of your actual opponent. I'll see if the glitch happens in other modes other than easy in tournament. This will happen even if your opponent is the same as you. A similar glitch that happens is if you are in the final stages of the tournament and then quit, the profiles from the last match that would of happened get overlayed with the profiles from the current match. Specifically, this seems to do with the other glitch of the 1P getting overlayed with the actual opponent. This also happens even if a CPU wins and takes your place as the opponent. The person on the right is always refferred to as Player 1 even though Player 1 can't even be over in that bracket. I found another such glitch that happens if a CPU wins. If they win, their profile gets overlayed with where they were in the last tournament. So you might end up with a Staff Wielder background combined with a Swordswoman foreground. Luckily, this only happens in the first round as the background of the previous winner stays there and only the foreground moves up.", "timestamp_created": 1510168932, "timestamp_updated": 1510243247, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36353419": {"recommendationid": "36353419", "author": {"steamid": "76561198025287227", "num_games_owned": 328, "num_reviews": 17, "playtime_forever": 97, "playtime_last_two_weeks": 0, "last_played": 1510090286}, "language": "english", "review": "(The below video is of my FIRST first impressions of the gameplay, the review after more time spent with it follows)\n\nhttps://youtu.be/WJHWQtyeRLg\n\nA novel one on one fighter in the vein of Bushido Blade, Dive Kick and Nidhogg where the key to victory is not with insane complex combos or special moves but with quick timing and anticipating your opponent's own moves because as the title implies, it only takes ONE STRIKE to down a combatant.\n\nWhile it appears relatively simple on the surface, each fighter has their own unqiue movements and attacks, making for a variety of match ups and thus strategies. In the mold of \"easy to learn, hard to master\", it actually makes it a sell for both casual and hardcore players as multiplayer with friends can easily add as much depth as you are prepared to give it in return. Full disclosure, I was only able to play a sizable amount of the single player only, yet the appeal of verses mode is clear.\n\nAgainst the AI, it did provide a good challenge, with multiple difficulties and modes including arcade and tournaments. While there is a great variety to each fighter in terms of both movement and attacks, adding further to different strategies, I did find some easier to play as than others. In one case not only was I able to stream roll through arcade with ease, when the AI played as the same character, they also did the same to me. As a result, I do question some balance. Granted, there may perhaps be a strategy to it but when the AI also struggles I am left wondering. However this is far from a deal breaker, rather something I personally noticed in single player at the time.\n\nThe presentation is an interesting mix of 8-bit graphics yet 16-32-bit music that will not be for everyone but I'll argue it is fitting with the simple but effective gameplay and overall charming style. There is also very well hand drawn art that somewhat clashes with the pixels but it does add character to each fighter. Despite the pixelated visuals, there is variety and distinct colour, with really only a couple of level and character combination blending a tad more than the rest. The music though is pretty stand out and nails the vibe it is going for, a particular point of praise!\n\nOverall, it does effectively combine an retro-presentation with well crafted timing-based fighting gameplay, making it perfect for enoyable bursts and no doubt more fun with friends, potentially with even more depth and length. At a very low price point, I would recommend trying it for yourself and supporting this developer.\n\nGreat stuff!", "timestamp_created": 1510093486, "timestamp_updated": 1510094971, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36350641": {"recommendationid": "36350641", "author": {"steamid": "76561198135347976", "num_games_owned": 46, "num_reviews": 22, "playtime_forever": 36, "playtime_last_two_weeks": 0, "last_played": 1510119503}, "language": "english", "review": "[quote] This review is submitted for [url=http://steamcommunity.com/groups/gaming_until_end]Gaming Until End[/url], through the generous contribution of [url=http://steamcommunity.com/id/HellCowON]HellCow.[/url] [/quote] \n\n[h1][b]General Idea:[/b][/h1] \nHyyaaaaaaah!! One Strike is for those who question the laws and physics in a game. You've probably asked yourself and the devs, \"Why didn't he die in one hit?\", \"Why wasn't he killed in one shot?\", well this game answers your questions. You will now regret asking those stupid questions and love this game where you too, get the fun of getting your opponent in ONE STRIKE. Co op is available too so if you want to make your siblings cry, this is the best opportunity.\n\n[h1][b]Gameplay:[/b][/h1]\nThe game offers 4 modes for Single player which are, The Only Life, Arcade, Team duel and Tournament. For Co op mode there are only 3 modes excluding The Only Life. Each modes are explained in detail while selecting them. Six Warriors with each of different abilities and fighting style are to be chosen before selecting any mode of the game.\n\n[h1][b]Graphics:[/b][/h1]\nThe graphics are good. I didn't mean Ultra graphics and AAA game good, I meant 2D graphics good. They are certainly not ugly. The background scenarios are great too. What more could be expected from a 2D game with pixelated graphics?\n\n[h1][b]Bugs and Glitches:[/b][/h1]\nThis game is free of those nuisance. The game runs perfectly fine and no lags or crashes are caused at any part of the gameplay whatsoever.\n\n[h1][b]Developers:[/b][/h1]\nThe developers have done a great job at building this game, making it look good and coming up with this idea. The end result has been a success and will continue to be.\n\n[h1][b]Total average and final notes:[/b][/h1]\n[h1][i]For a 2D game, pixelated graphics, free of bugs and glitches, offers co op, six warriors I say why not just rate it [u]6/10[/u]? Because I can.[/i][/h1]", "timestamp_created": 1510084162, "timestamp_updated": 1510084162, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.494835", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36350328": {"recommendationid": "36350328", "author": {"steamid": "76561198139573573", "num_games_owned": 1016, "num_reviews": 11, "playtime_forever": 13, "playtime_last_two_weeks": 0, "last_played": 1510072255}, "language": "spanish", "review": "IS A GOOD GAME", "timestamp_created": 1510083229, "timestamp_updated": 1510083229, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36349271": {"recommendationid": "36349271", "author": {"steamid": "76561198174847595", "num_games_owned": 533, "num_reviews": 27, "playtime_forever": 63, "playtime_last_two_weeks": 0, "last_played": 1510265899}, "language": "english", "review": "[h1]One Strike[/h1]\n\nOne strike is a 2D 8-bit Fighting game and it follows the foundation of a lot of earlier fighting games. Although I like the artstyle they have gone for, I much prefer an artstyle such as Streetfighter 2.\nThe concept of ‘One Strike’ is that if you are struck once, you’re out.\nAn update came out today (7th November 2017) which fixed a lot of bugs I had before the update, so good on the developers for sorting some issues out as soon as possible.\n\n[b]Positives:[/b]\n[list]\n[*]Character selection is good, there are six characters to chose from, each character has their own weapon and their own skills which can be used for a different play style when you’re facing the opponent, making the game have a lot of replay value.\n[*]4 different difficulties (Easy, Medium, Hard and Very Hard), making the A.I of the other player a lot smarter so therefore you have to adapt to the enemy and their playstyle in order to win.\n[*]There are 4 game modes for [i]’Single Player[/i] which are very fun in their own right and can add a lot of content for the players.\n[*]Multiple areas in which you can fight in, giving a nice aesthetic environment every time.\n[*]The concept of getting struck once and you’re out is fascinating, makes it that more tense and forces you to become better at the game.\n[*]Versus mode that allows you to play with a friend and fight one another to come out victorious to bring in that competitive edge.\n[*]When selecting the characters, they have their 2D pixel blank face and then they have their artwork on the left hand side which are well drawn for each character and you can tell what kind of character they are just by the image.\n[*]Using a gamepad has made the controls feel a lot smoother and a lot more fluid when I am facing my opponents. It worked for my XboxOne controller, not sure on the Xbox360 controller.\n[/list]\n\n[b] Negatives: [/b]\n[i]Anything with a strike through it means the developer has dealt with the issue.[/i]\n[list]\n[*][strike]Seems to be an issue when you want [i]’Revenge’[/i] as the button not seem to work, I clicked it multiple times but it didn’t do anything and this caused me to go back to the character selection.[/strike]\n[*]In the tournament game mode, you are made to watch the ‘COMP’ fight and this is very boring without an option to skip that fight.\n[*]Also in the tournament game mode, at the last fight, it had gotten the faces wrong when it was saying who was in the final. So this could be an issue which could be fixed.\n[*]The font is extremely hard to read, I could barely read the names of the characters you could select.\n[*]Sometimes the music would start over when I chose a specific game mode which was unexpected as I thought it would carry on.\n[*][strike]Steam achievements do not unlock, this could be a problem for people who go for achievements and want game completion.[/strike]\n[/list]\n\n[b]Conclusion:[/b]\nFor the price of £3.99, it's definitely worth buying. I'm sure to get more hours out of this game as I feel like it has challenged me to beat it on the hardest difficulty and it is a lot of fun.\n\n[code] This review was submitted for [url=http://steamcommunity.com/groups/gaming_until_end]Gaming Until End[/url], through the generous contribution of [url=http://steamcommunity.com/id/HellCowON]HellCow.[/url] [/code]", "timestamp_created": 1510079982, "timestamp_updated": 1510080138, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.559748", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36341863": {"recommendationid": "36341863", "author": {"steamid": "76561198016096893", "num_games_owned": 7021, "num_reviews": 1098, "playtime_forever": 138, "playtime_last_two_weeks": 0, "last_played": 1509895783}, "language": "russian", "review": "Динамичный файтинг в стиле олдскульных, восьмибитных игр.\nВ игре самые быстрые схватки, какие мне приходилось встречать. В этой игре не придется избивать соперника до посинения, тут убиваем одним ударом! Поэтому схватки тут редко длятся больше минуты. \nПорадовала детальная анимация убийств. Крови и насилия в игре хватает.\nВ игре множество режимов от дуэли до турниров. Можно играть одному или соревноваться с друзьями (игра поддерживает локальный мультиплеер).\nБойцов шесть. Они отличаются внешне и ударами. Если где-то не получается пройти очередную схватку, то можно сменить персонажа и сложность игры и попробовать снова.\nОтличный файтинг для любителей олдскула. Динамичный, разнообразный и кровавый.\n", "timestamp_created": 1510057946, "timestamp_updated": 1510057946, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.400831", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36337608": {"recommendationid": "36337608", "author": {"steamid": "76561198272374716", "num_games_owned": 7059, "num_reviews": 885, "playtime_forever": 281, "playtime_last_two_weeks": 0, "last_played": 1510033415}, "language": "russian", "review": "[h1]«One Strike»[/h1]\n2D Fighting в стиле ретро. Сражаемся на живописных аренах средневековой Японии.\nГеймплей:\nhttps://www.youtube.com/watch?v=oDOYMev1nT4\n\nНа выбор 6 бойцов, каждый со своими особенными приемами. Управление на шести кнопках: движение влево и вправо + отскок вперед и назад + удар + блок. У некоторых персонажей отскоки могут наносить повреждения врагу, а у других нет, а у некоторых даже блок наносит повреждения! Поэтому приемы у всех особенные, а стиль боя разительно отличается.\n\nМатчи почти мгновенные. Игра недаром называется «Один удар». Тут один точный удар - ты труп! У бойцов нет полосок жизней, они сразу отправляет на тот свет. Тут нет добиваний, зажимов и фаталити! Можно лишь отскакивать и ставить блоки. Есть режим, в котором большее количество жизней, но это не меняет геймплея. Вы умираете от одного удара, и сразу происходит рестарт матча без выхода в меню, как в режимах с одной жизнью.\n\n«One Strike» поддерживает локальный мультиплеер. Не имея под рукой контроллера можно сыграть вдвоем на одной клавиатуре! Это огромный плюс.\n\nПри простой, пиксельной графике присутствует качественная анимация персонажей и арен. Выглядит игра хорошо. Персонажи и окружение порадуют любителей азиатской культуры.\n\n[u] Вы можете почитать другие отзывы и подписаться на наших кураторов. Добро пожаловать! [/u] \n[url=http://store.steampowered.com/curator/25737869/] 5 minutes of game [/url]", "timestamp_created": 1510039427, "timestamp_updated": 1510039427, "voted_up": true, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.669617", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36331267": {"recommendationid": "36331267", "author": {"steamid": "76561197996681866", "num_games_owned": 345, "num_reviews": 77, "playtime_forever": 54, "playtime_last_two_weeks": 0, "last_played": 1510006960}, "language": "english", "review": "One Strike, and you’re out! That’s basically the gist of the game; any and every attack will kill you in one hit. Time to test your 2D reflexes.\n\n[h1]Positive:[/h1]\n[list]\n[*]I quite like that there are few controls. Each character gets two attacks and dashes (backwards and forwards). While this might sound dull, it actually works well considering that it only takes one hit for you to kill/die. Basically, you need to be creative and very precise with your timing to win (kind of fits well with the samurai theme, don’t you think?).\n[*]Diversity comes in the form of 6 playable characters and different game modes (the game modes are very similar though). It’s nice that the characters all have different attacks and styles. It’s also fantastic that a versus mode is included. However, I’m a little concerned about character balance. Since this is a one-shot-kill kind of game, I consider a longer range to be a huge advantage. As the game currently stands, I find that there are very few tools to help short range characters deal with a longer range.\n[*]The music takes me back to old fighting games. Perhaps the music in One Strike isn’t as memorable, but it’s quite good.\n[/list]\n\n[h1]Negative:[/h1]\n[list]\n[*]It kind of bothers me that the character’s faces are blank in battle. I don’t mind that the background/characters are plain, but I feel like the main characters should look more detailed; at least a face! I also don’t like the white outline.\n[*]The easy difficulty is far too easy in “The Only Life” mode. You can literally rush in and the bots won’t react at all.\n[*]I find that 5 lives is a bit much per opponent (in the Arcade mode). It would be nice if there was an option to choose how many lives you want (perhaps 2-5 lives? fewer lives = higher risk to gameover).\n[*]The victory screen is quite plain. It’s basically a summary of the game modes you’ve won (I think this should be accessible from the main menu). I’d like to see some kind of congratulations/winner screen, like most retro games have.\n[*]I encountered a few bugs:\n[olist]\n[*]I can’t seem to pause sometimes; especially in versus mode.\n[*]Sometimes when I click on “Revenge”, nothing happens.\n[*]Not sure if this is a bug, but I can’t go back to the menu when I’m in the character select screen. This should really be possible.\n[*]Even though there is a mouse pointer in the menu, you can’t actually use the mouse to select anything.\n[*]For some reason the game doesn’t recognize my controller. On the store page it says the game has full controller support, so I’m not sure what the issue is. I tried other games with my controller and it worked fine.\n[*]Achievements don't unlock. \n[/olist]\n[/list]\n\n[h1]Conclusion:[/h1]\nI could easily spend a few hours playing One Strike with a friend. It’s a simple to learn, difficult to master kind of game, so anyone can pick it up. Versus mode is definitely the highlight of One Strike (I’m less interested in playing the single player mode). \nThis game is new, so I suspect that the developers are still weeding out the bugs and optimizing it. Most of the negative points that I’ve listed down can easily be fixed, so they don’t carry much weight... [b]YET[/b]. This game is not for everyone, but I’m certain that many will enjoy it very much. \n\n[table]\n[tr]\n[th]If you enjoyed this review please follow me on my [url=http://store.steampowered.com/curator/26827738-%27b-Reviews/?appid=241930]curator page[/url] and [url=http://steamcommunity.com/groups/breviews]group[/url]. Your time and support is greatly appreciated![/th]\n[/tr]\n[/table]\n\n[code]This review was submitted for [url=http://steamcommunity.com/groups/gaming_until_end ]Gaming Until End[/url], through the generous contribution of [url=http://steamcommunity.com/id/HellCowON]HellCow.[/url] [/code]", "timestamp_created": 1510007123, "timestamp_updated": 1513863745, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.617616", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36326945": {"recommendationid": "36326945", "author": {"steamid": "76561198133794614", "num_games_owned": 1118, "num_reviews": 18, "playtime_forever": 34, "playtime_last_two_weeks": 0, "last_played": 1509991172}, "language": "italian", "review": "[quote][h1][b][u]EN[/u][/b][/h1]\n\n[h1]Intro[/h1]\n\n\"One Strike\" is a 2D fighting game set in Japan at the time of the samurai.\n\n[h1]Gameplay[/h1]\n\nIn the game we can use a character of 6 available. Each of them will have different attacks.\nIn \"One Strike\" we can try out two different game modes, a singleplayer and a 1v1 where you can challenge a friend with the same keyboard.\nIn Singleplayer mode, you can play different sub-game modes\n[list]\n[*]\"The Only Life\" in which you have only one life available and you have to beat 5 enemies,\n[*]\"Arcade\" where we will have 5 lives for each fight,\n[*]\"Team duel\" where we can control 3 different warriors and each of them will have 5 lives,\n[*]\"Tournament\" where we will have one chance to reach the highest place in the tournament.\n[/list]\n[h1]Graphic & Audio[/h1]\n\nYou can not choose the graphic option from the main screen because you can only set it to \"Fantastic\".\nThe audio is not editable either from the main screen or from the game itself.\nThe font used in \"One Strike\" is questionable since some words are understood only after careful observation.\n\n[h1]Commands[/h1]\n\nThe commands are simple but they can only be understood after several attempts:\n[list]\n[*] A e D = move\n[*] G = defend\n[*] H = attack\n[/list]\nInstead, the commands that are used to control character 2 are on the numeric pad:\n[list]\n[*] 5 e 6 = move\n[*] 3 = defend\n[*] 2 = attack\n[/list]\n[h1]Summary[/h1]\n \n[b]Pro[/b]\n[list]\n[*] It remembers the old fighting games of the '80s\n[*] Lot of game modes\n[/list]\n[b]Cons[/b]\n[list]\n[*] Unclear font\n[*] No graphic and audio options\n[*] Unclear commands\n[/list]\n[h1]Final Vote[/h1]\n \nWould I recommend this game? No, they should at least change the font and add some audio settings.\n\n[b]Toxic's Vote: ★★½✰✰[/b]\n\n[/quote]\n[quote][h1][b][u]IT[/u][/b][/h1]\n \n[h1]Introduzione[/h1]\n\n\"One Strike\" è un gioco 2D picchiaduro ambientato in Giappone all'epoca dei samurai.\n\n[h1]Gameplay[/h1]\n\nNel gioco potremo impersonare un personaggio tra 6 a disposizione. Ognuno di essi avrà attacchi diversi.\nIn \"One Strike\" potremo cimentarci in due diverse modalità, una singleplayer e una 1v1 in cui potrete sfidare un vostro amico con la stessa tastiera.\nNella modalità Singleplayer potrete giocare diverse sotto-modalità\n[list]\n[*]\"The Only Life\" in cui avrete a disposizione una sola vita e dovrete battere 5 nemici,\n[*]\"Arcade\" in cui avremo 5 vite per ogni combattimento,\n[*]\"Team duel\" in cui potremo controllare 3 guerrieri diversi e ognuno di essi avrà 5 vite,\n[*]\"Tournament\" in cui avremo una sola possibilità per raggiungere il posto più alto nel torneo.\n[/list]\n[h1]Grafica e Audio[/h1]\n\nDalla schermata iniziale non si può scegliere l'opzione grafica in quanto si può settare solo su \"Fantastic\".\nL'audio non è modificabile né dalla schermata iniziale né dal gioco stesso.\nIl font usato in \"One Strike\" è discutibile in quanto alcune parole si capiscono solo dopo un'attenta osservazione.\n\n[h1]Comandi[/h1]\n\nI comandi sono semplici ma si riescono a capire solo dopo diversi tentativi:\n[list]\n[*] A e D per spostarci\n[*] G per parare\n[*] H per attaccare\n[/list]\nI comandi che invece vengono usati per controllare il personaggio 2 invece sono sul tastierino numerico:\n[list]\n[*] 5 e 6 per spostarci\n[*] 3 per parare\n[*] 2 per attaccare\n[/list]\n[h1]Riassunto[/h1]\n \n[b]Pro[/b]\n[list]\n[*] Ricorda i vecchi picchiaduro anni '80\n[*] Numerose modalità\n[/list]\n[b]Contro[/b]\n[list]\n[*] Font non molto chiaro\n[*] Niente opzioni grafiche o audio\n[*] Comandi non molto intuitivi\n[/list]\n[h1]Voto Finale[/h1]\n \nConsiglierei questo gioco? Ni, dovrebbero almeno cambiare il font e aggiungere qualche impostazione audio.\nFaccio che consigliarlo sperando che mi ascoltino anche perchè è appena stato rilasciato.\n\n[b]Toxic's Vote: ★★½✰✰[/b]\n[/quote]\n[code] This review was submitted for [url=http://steamcommunity.com/groups/gaming_until_end]Gaming Until End[/url], through the generous contribution of [url=http://steamcommunity.com/id/HellCowON]HellCow.[/url] [/code]", "timestamp_created": 1509991372, "timestamp_updated": 1510515844, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.490323", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36323224": {"recommendationid": "36323224", "author": {"steamid": "76561198082118649", "num_games_owned": 4013, "num_reviews": 213, "playtime_forever": 127, "playtime_last_two_weeks": 0, "last_played": 1509978679}, "language": "russian", "review": "One Strike 8 -bit ный файтинг в стиле ретро с яркими и живописными фонами  в средневековой  Японии, выбераем бойца и пробиваемся через всех апонентов к олимпу славы - все просто)", "timestamp_created": 1509979661, "timestamp_updated": 1509979661, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.566860", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36317134": {"recommendationid": "36317134", "author": {"steamid": "76561198040641431", "num_games_owned": 565, "num_reviews": 37, "playtime_forever": 19, "playtime_last_two_weeks": 0, "last_played": 1509955533}, "language": "english", "review": "One strike is similar to that of Samurai Showdown.  You are given 6 characters.  Each with their own weapon and fighting style.\n\nI tried both the team mode, the arcade and the one life modes just to see what they did.\n\nThe game is fairly simple.  You have two variety of attacks and depending on who you use, those attacks vary between offense and a few that are defense.\n\nSo let me put out the scores.\n\nFor visual graphics I give the game a 6.0 because it does have backgrounds though the faces in both the models on the fighting portion, and in the background are fairly pixelated with zero facial features for the most part, save for a beard. The clothing designs are semi-stylish but again there is a fair bit of pixelizing.\n\nFor the music, the simplistic scores are pleasing to the ears and they represent the game well.  I give the music a 9 out of 10. \n\nThe fighters:   The fighters at least on the full menu show actual visualization of their faces.   But that is not what you see once you start the matches.  you see blank faces.  The fighting moves and styles are somewhat interesting and so i give the fighters a score of 7 out of 10.\n\nThe game mechanics in terms of keyboard controls are a little..... strange.    For example, my mouse did not work in the game's menu or fighting area at all. I had to use my keyboard.  And I did. i was using  the arrow keys for left/right, but i was using G and H for the attacks.   Which was a little weird but I got used to it relatively fast.  The game controls get a fair 7.0 from me because even if they are a little odd, you can still casually play the game.\n\nThe overall fun factor stands at a solid 7.0.   I had some fun the first time around but after a short while I found my attention for enjoying this game waneing a little.  I would have liked more characters, maybe a few facial details besides the beard and clothing to identify better with the characters.  \n\nI would recommend this game to a friend, and I will say this.  The game is so casual in and of itself, that pretty much everybody from little kids to adults can play it with relative ease.\n\n[quote] This review was submitted for [url=http://steamcommunity.com/groups/gaming_until_end]Gaming Until End[/url], through the generous contribution of [url=http://steamcommunity.com/id/HellCowON]HellCow.[/url] [/quote]", "timestamp_created": 1509956695, "timestamp_updated": 1509956695, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.491620", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36310145": {"recommendationid": "36310145", "author": {"steamid": "76561198105083226", "num_games_owned": 167, "num_reviews": 15, "playtime_forever": 25, "playtime_last_two_weeks": 0, "last_played": 1509920316}, "language": "english", "review": "TL;DR: If you like the simple fun of a game like Dive Kick and wouldn't mind more of that same pure simplistic fun, this game is exactly what your looking for. This game does a great job of making you want to get into deeper fighting games and you'll come to appreciate it as the gateway drug/game to more complex fighting games, just as Dive Kick is considered.\n\nPros:\n-Simple Controls\n-Local multiplayer is always a plus\n-Different characters have enough difference to them, to make you find a one tailored for your gameplay style\n-CPU is an actual challenge to fight\n-Teaches basic fighting game tactics \n\nCons:\n-No configurable keybindings\n\n\nOne Strike, joins Dive Kick perfectly on the list of games that builds the bridge for causal gamers seeking to go from games like those to heavier fighting games like Street Fighter, King of Fighters, or even Mortal Kombat. These games need to be praised more but honestly maybe these games are the unsung heroes of the genre because with these game are literally the gateway drug/game into fighting games for casual gamers. Fighting games these days are filled with systems and set-ups that many people including myself don't care to invest in, honestly its just to complected or intimidating. One Strike and Dive Kick goes back to the roots of what makes these games fun, by simplifying that tense moment in a match where both players are on edge and one hit can end it all.\n\nStory/Gameplay: No story, but i can tell this is just a simple old school idea of an Japanese warriors tournament. There are different modes for solo and local VS, and even an local tournament mode. One mode (Arcade) specifically gives each fighter 5 hit-points (its still 1 Hit-point kill per round) after losing all 5 you will lose the match.\n\n-The combat is simple and fast paced just the same as dive kick. You can move left or right (No jumping in this game), and two buttons for attack or block, and two for dodge forward or back. Now the special thing here is that each button triggers a distinct style of move for each character, for example for one character a dodging backwards might be a simple backstep but for another its a swift retreating attacking. With this the game becomes more than just a simple wait to attack game because your while you are worried about taking the first strike, your also worried about whiffing (Missing an attack) and whether its on purpose or not. If you play on harder difficulty you'll see the CPU whiffing on purpose alot to trick you into attacking and they will punish you for it. \n\nControls- The controls are simple but i do wish you could configure the keyboard bindings. I also tried to connect my controller to this game (In the options it states there is controller configurations) but i just couldn't get it working at all.\n\nVisuals: The pixel art is well done but I'm not going to lie, I would love to see a great game like this have a more detailed art style. The fighting Arenas are artistically well done, my favorite is the cliffs above the sea-level.\n\nSound: The music is unbelievably good, like crazy catchy. The chippy tunes reminds me of music from games like Street Fighter 2. They really pull you into the fights and gets you hype.\n\nConclusion: I gotta admit I love this game, because an non-fgc gamer such as myself can be taught fighting game tactics like whiffing, countering, and canceling without realizing it, that's what games like One Strike and Dive Kick does; it teaches you fighting game basics. After a while you'll what to play a game with even more complex fighting game tactics to learn more.\n\n[quote] This review was submitted for [url=http://steamcommunity.com/groups/gaming_until_end]Gaming Until End[/url], through the generous contribution of [url=http://steamcommunity.com/id/HellCowON]HellCow.[/url] [/quote]", "timestamp_created": 1509921724, "timestamp_updated": 1509933613, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36309056": {"recommendationid": "36309056", "author": {"steamid": "76561198158618292", "num_games_owned": 529, "num_reviews": 41, "playtime_forever": 28, "playtime_last_two_weeks": 0, "last_played": 1509915418}, "language": "english", "review": "[h1]One Strike[/h1]\nWe find a 2D game with a retro and 8 bits style with the mechanics that the first to hurt the opponent is the winner. In the story we get into various characters of medieval Japan with the intention of become the best warrior.\n\n[b]Pros: [/b]-A wide variety of characters to choose from.\n-Each character differs from the others by their weapons and fighting styles.\n-There are a lot of scenarios where battles take place.\n-Some scenarios have effects that make you put more in it, like the winter scene where snowflakes fall from the sky.\n- Collection system of your victories called '' Accolade '', is a tree where your victories are shown in all modes, difficulties and characters.\n-A simple control and easy to understand.\n-A HUD, artwork and beautiful setting with many details that give it that oriental touch.\n-An extensive amount of game modes: 2 main game modes, single player and versus. The singleplayer mode is divided into 4 (The only life, Aracade, Team duel and Tournament) and the versus mode is divided into 3 (Arcade, Team duel and Tournament).\n-The system of choice of characters team duel mode is very well achieved, so they will make you remember old fighting games.\n-The One Touch One Death system manages to make fast and simple games.\n\n[b]Neutral: [/b]-A simple background story but that gives you enough to have a role.\n\n[b]Cons:[/b] -The characters have only one suit and this does not change unless you are against it.\n-Many difference between the difficulties, the '' Easy '' is very easy, the '' Normal '' is difficult and the '' Hard '' is impossible. (This obviously is going to be noticed less with practice).\n-It has some bugs, like the tournament mode, in this same when you reach the final in the box of who fights against whom, your character appears against your character (p1 vs p1) instead of your character against the machine (p1 vs com).\n\nIn the end, is a game that will give you a lot of hours of fun to complete it 100%, and for only $ 5 worth much more than the price that have. Game completely recommended.\n\n                                                                          [h1]FINAL SCORE: 8,5[/h1]\n\n[quote] This review was submitted for [url=http://steamcommunity.com/groups/gaming_until_end]Gaming Until End[/url], through the generous contribution of [url=http://steamcommunity.com/id/HellCowON]HellCow.[/url] [/quote]", "timestamp_created": 1509917744, "timestamp_updated": 1513090860, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.543568", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36302326": {"recommendationid": "36302326", "author": {"steamid": "76561198157541763", "num_games_owned": 86, "num_reviews": 10, "playtime_forever": 10, "playtime_last_two_weeks": 0, "last_played": 1509897924}, "language": "french", "review": "One Strike is a 2D fighting game with retro pixellated graphics. You incarnate one of the 6 available fighters and make your way through Japan in medieval time. Defeat your ennemies to become the best warrior! Different game modes are available : a singleplayer mode (AI) and a local multiplayer mode to play with friends. The game also features a great bunch of achievements which grow up the lifetime a bit more! Playing with a controller is very recommended.\n\n[h1]Graphics/Soundtrack[/h1]\nOne Strike has 8-bit retro graphics, which means it is \"very pixellated\". They are not very detailled, however, the game looks very nice. The colors are well chosen and create a real harmony. The soundtrack is great! It's between asian music and arcade games music. Very catchy to me.\n\n[h1]Positive points : Why is it fun?[/h1]\nTrying to become the master is very satisfying and it gets addictive very fast! Also, having the choice between 6 heroes with different abilities is a cool feature. Playing with friends is even more fun. Games are short, one hit only is needed to kill your opponent.\n\n[h1]Negative points[/h1]\nThe menus aren't very intuitive... Also, I couldn't read the texts very well in the menus, because of the pixellated theme. Not clear at all. Too many symbols but not enough informations, too bad... Also, the controls aren't well thought, and you'll have to change them in the little console when you launch the game (\"input\" section). BUT you can play with a controller, and it will be perfect. The game is actually meant to be played with a controller.\n\n[h1]Lifetime/Worth it?[/h1]\nThe lifetime of this game is decent, even though I guess you can get bored pretty fast. Anyways, you could always get back on it after a few weeks and have fun again! Now is it worth it? Totally. 5 bucks for that much fun is absolutely OK! Go ahead.\n\n[h1]Conclusion[/h1]\nIf you want a cheap 2D fight game, to have fun with your friends, or to feel like a great japanese warrior... You found it! One Strike is very entertaining and addictive. Definitely worth its price! Play with a controller for a great experience.\n\n[code] This review was submitted for [url=http://steamcommunity.com/groups/gaming_until_end]Gaming Until End[/url], through the generous contribution of [url=http://steamcommunity.com/id/HellCowON]HellCow.[/url] [/code]", "timestamp_created": 1509898699, "timestamp_updated": 1510094590, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36285730": {"recommendationid": "36285730", "author": {"steamid": "76561198122243627", "num_games_owned": 64, "num_reviews": 2, "playtime_forever": 55, "playtime_last_two_weeks": 0, "last_played": 1509843984}, "language": "brazilian", "review": "Quer uma experiência excelente que exigem rápidos reflexos, timing preciso e muita habilidade? Então esse é o jogo certo para vocês!\n\nOne strike traz uma quantidade excelente de lutadores para lutarem em um sistema de one hit kill, onde o menor descuido pode custar a sua vida. Após quase uma hora de jogatina pude ver o quão incrível esse jogo é, os personagens são distintos e se adaptam aos mais variados tipos de jogadores, desde os mais ofensivos até os mais defensivos.\n\nA mecânica do jogo é interessante e pode trazer uma diversão incrível por um bom tempo, e é mais divertido ainda jogar esse jogo com um amigo através do modo multiplayer.\n\nEsse jogo realmente vale um 10/10. recomendadíssimo", "timestamp_created": 1509846902, "timestamp_updated": 1509846902, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.565217", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36274257": {"recommendationid": "36274257", "author": {"steamid": "76561198063990714", "num_games_owned": 205, "num_reviews": 61, "playtime_forever": 64, "playtime_last_two_weeks": 0, "last_played": 1510182570}, "language": "english", "review": "played the game and Actually enjoyed it took me back to when games were basic and fun a few moves and a little\nskill was all it took to beat a game like this\nthere are 6  characters to choose from and the online mode is available which i recommended \none life mode is a lot of fun rage inducing basically 1 life  1 hit kill or be killed (play on medium difficulty hard is way to hard)\nbackgrounds are pixelated goodness and the music perfect for the game not annoying at all.\nas I say in the pros and cons bit plays with PS4 controller not all games do so thats great to see :)\nI recommend this game and I hope theres more to come mode wise and character wise\n\n\nPROS\nNot a bad looking game backgrounds are polygon and look really colourful in a good way blocky 2D style art \ntough game easy to very hard\nI played first with keyboard the switched tio PS4 controller it worked great \nthe game itself is easy to get into \nI think adding more characters  and moves will  improve it the characters are pretty decent so far\nand add balance\nlooks like  bushido blade and yie ar kung fu really gives the game an old school vibe\n\nCons\ntoo few characters\ncharacters need more moves IMO\nneeds online multiplayer (it will hopefully be included asap)\nA.I is kickass and will punish you if your not aggressive enough so dont be chicken :)\n\nhttps://www.youtube.com/watch?v=5vLkkQ366fQ&t=25s", "timestamp_created": 1509812746, "timestamp_updated": 1509820345, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36253524": {"recommendationid": "36253524", "author": {"steamid": "76561198009351367", "num_games_owned": 288, "num_reviews": 20, "playtime_forever": 245, "playtime_last_two_weeks": 0, "last_played": 1509710639}, "language": "english", "review": "Oh SWEET RNGesus. I thought Shigatari was bad..\n\n5 minutes with this game was ALL I needed to make up my mind. After getting sh!t-canned 3 times in a row by my own doppleganger I was like: \"OH BIDGE ITS OHHHHN!\" I was not about to get Cupheaded by pixel art!\n\n\n\nThis game offers you bite sized chunks of Nintendo HARD.\n\nThen when you do manage to beat ONE of the difficulties with ONE of the characters it shows you all the versions you have yet to clear. A video game version of frat hazing and I love it. Thank you sir! May I have another?\n\n\n\nThis game would be excellent as a party game. If some enterprising body configured a way to control it with a pair of airmouse controls this would give 1-2 Switch a run for its money.", "timestamp_created": 1509747522, "timestamp_updated": 1509747522, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.541667", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 7, "review_score_desc": "Positive", "total_positive": 35, "total_negative": 0, "total_reviews": 35}}
