{"query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 194, "total_negative": 5, "total_reviews": 199}, "reviews": {"38927206": {"recommendationid": "38927206", "author": {"steamid": "76561198043382329", "num_games_owned": 231, "num_reviews": 37, "playtime_forever": 297, "playtime_last_two_weeks": 297, "last_played": 1514804456}, "language": "english", "review": "It's a fresh experience from what i'm use to.\nThe mouse feels a little weird, there is a large mouse acceleration that i cannot find a way to remove. I also found out you have to go to ESC+options+input profile and create a profile to lower sens and remove smoothing.\n\nthe game seems limited to 60 FPS, which isn't a problem for most but i do have a 144hz screen, its acceptable but i would greatly like an FPS uncap- or at least to 144 \n\nIt's just good for what it is", "timestamp_created": 1514791223, "timestamp_updated": 1514792280, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38926001": {"recommendationid": "38926001", "author": {"steamid": "76561198254044228", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 101, "playtime_last_two_weeks": 101, "last_played": 1514788155}, "language": "english", "review": "I don't have many PC hours yet, but I've been following since it was first announced for PC, and it was/is one of the best indie, even games, that i've found on the 360 marketplace. With the growth since I found it on the 360 marketplace, I know it will also grow here (more so than 360), it may even grow to be (imo) minecraft's competition. Don't judge this game by its images. It may have started as a \"miecraft clone\" as people would call it (even though the voxel based survival is more of a genre), but it has grown to its own personality.", "timestamp_created": 1514787412, "timestamp_updated": 1514787412, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38913336": {"recommendationid": "38913336", "author": {"steamid": "76561198379963527", "num_games_owned": 1, "num_reviews": 1, "playtime_forever": 3261, "playtime_last_two_weeks": 3261, "last_played": 1514764377}, "language": "english", "review": "Howdy.\n\nI've played the game on 360 since 2013 and been on it at least once a week ever since. What strikes me most about this game is the community. They're all just so friendly. \n\nAdvantages\n- Community\n- Scripts\n- Creative Tools\n- No limits to what you can do\n- Price (value for money)\n\nDis-advantages\n- A bit buggy and slow but it's early access", "timestamp_created": 1514750985, "timestamp_updated": 1514750985, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38912954": {"recommendationid": "38912954", "author": {"steamid": "76561198074195807", "num_games_owned": 406, "num_reviews": 16, "playtime_forever": 102, "playtime_last_two_weeks": 102, "last_played": 1514813273}, "language": "english", "review": "I freaked out when I found this in my discovery queue. I almost forgot this game. Didn't hear any release dates or plans, assumed it was dropped until I saw it and immidiately threw £7.19 at the store to get it. \n\nUsed to play this game on the Xbox 360 Acade and it has changed so much for the better. Huge fan of the new skills, enemies and all round new addition. Sadly, when I played it at first (Time after posting this review) It didn't have Dig Deep mode. Only cons to this game Is the UI feels way too small/annoying and complex to deal with, the mouse was extremely janky to start of with after spending a good 5 minutes tweaking the controls. I'll take a lot of the cons as it's an early access game (Time of writing this) and I can't wait to see what it forms into. Keep up the good work. Can't wait to get back into this game.", "timestamp_created": 1514750127, "timestamp_updated": 1514750127, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38909591": {"recommendationid": "38909591", "author": {"steamid": "76561198289180737", "num_games_owned": 8, "num_reviews": 4, "playtime_forever": 690, "playtime_last_two_weeks": 690, "last_played": 1514757942}, "language": "english", "review": "First i just want to say, if you buy this game thinking its another trash minecraft clone, you are mistaken. This game is in my oppinion better than minecraft with many many more fetures. Dig deep isnt in the game at the time of typing this but when it is added, there is no doubt in my mind i will spend 40+ hours on one world. I already have 10 on survival, which is fun too. It has a leveling system where you cant use certain items if you dont have a high enough level. In conclusion, dont let the blockey look steer you away. It is much more than another minecraft clone.", "timestamp_created": 1514742983, "timestamp_updated": 1514742983, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38891053": {"recommendationid": "38891053", "author": {"steamid": "76561198235539448", "num_games_owned": 41, "num_reviews": 1, "playtime_forever": 1985, "playtime_last_two_weeks": 1985, "last_played": 1514794389}, "language": "english", "review": "the best open world sand box game out there that allows your creativity to have no limits. This is the only sandbox I have ever played that you can script your own story and change the game how you want to.", "timestamp_created": 1514702838, "timestamp_updated": 1514702838, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38871549": {"recommendationid": "38871549", "author": {"steamid": "76561198031525462", "num_games_owned": 47, "num_reviews": 4, "playtime_forever": 947, "playtime_last_two_weeks": 948, "last_played": 1514799696}, "language": "english", "review": "My favorite block game off all time, from a creative standpoint it’s worlds better than Minecraft or any other block game I’ve ever played. With so many creative features (and more to come) the possibilities of what you can create are endless. And with the release of this PC version, there are even more tools and features (such as scripting) and a larger variety of blocks/objects to use for even better and more immersive creations. Put so many hours into this game with my friends on the Xbox 360, and I’m probably going to here on the PC as well, especially once multiplayer is released. For a few years now I “retired” from block games, feeling that I’ve exhausted myself from the genre UNTIL I found out this game was being released on PC. This game alone has brought me back to a genre of game I told myself I’d never play again. That’s how good Total Miner is.\n\nIf you in any way, shape, or form like block games, or just like being creative, get this game. Absolutely worth the price and it’s from a reliable developer who’s very passionate about the development of the game and has been for years. If you purchased this game when it was released on the 360 like I did, and have seen it progress the way it has over the years, you would know that it’s from a developer who cares deeply about the game and the desires of it’s players. As of right now, the updates since launch have been continuous.\n\n10/10 will continue wasting my life and disappointing my parents for years to come.", "timestamp_created": 1514659821, "timestamp_updated": 1514660898, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38867736": {"recommendationid": "38867736", "author": {"steamid": "76561198355864741", "num_games_owned": 20, "num_reviews": 2, "playtime_forever": 267, "playtime_last_two_weeks": 267, "last_played": 1514669159}, "language": "english", "review": "This game is one of the best 360 games i have ever played. It has a great community, awesome modes, and is imo much better than minecraft. Im hoping they fix the multiplayer sonn, because i cant wait to have the same experiences as i had all those years ago.", "timestamp_created": 1514653340, "timestamp_updated": 1514653340, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38848302": {"recommendationid": "38848302", "author": {"steamid": "76561198086369934", "num_games_owned": 36, "num_reviews": 4, "playtime_forever": 13, "playtime_last_two_weeks": 13, "last_played": 1514349436}, "language": "english", "review": "Pure nostalgia trip. I remember playing this game years ago when it first came out on Xbox Indie store.\n\nI do not call this game a clone. It is so much more entertaining & has so much more content to mess around with!\n\nI am so glad I finally get to relive those days! I highly recommend even for new players!", "timestamp_created": 1514614725, "timestamp_updated": 1514614725, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "38846593": {"recommendationid": "38846593", "author": {"steamid": "76561198120988790", "num_games_owned": 83, "num_reviews": 7, "playtime_forever": 596, "playtime_last_two_weeks": 596, "last_played": 1514761152}, "language": "english", "review": "The game is very buggy and messy, and could really use alot of work with controls and huds.\n\nThe base game is very fun and I enjoy the xbox version a whole lot. \nI will update this review more but for now its a cheap and fun game for me.", "timestamp_created": 1514610271, "timestamp_updated": 1514610271, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523651", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38839025": {"recommendationid": "38839025", "author": {"steamid": "76561198134686338", "num_games_owned": 7, "num_reviews": 1, "playtime_forever": 2272, "playtime_last_two_weeks": 2272, "last_played": 1514591804}, "language": "english", "review": "Not gonna lie, this is kind of a rocky start. Left out the best feature that I enjoyed the most, which is Dig Deep. I do appreciate that Dig Deep is being put 1st before multiplayer. This game has a great fan base and tons of people to ask for help. I love that you can make your own type of game and you can take advantage of scripts to do all the nerdy things you could ever dream of. NPCs can now move around and aren't just standing still. As of now, this game is alright, the menu isn't my favorite but you can get used to it. I like that if you prefer the old menu, you can go back over to it. Not a great reviewer, but this is my opinion. Can't wait for new updates and the day when Dig Deep is released.", "timestamp_created": 1514591181, "timestamp_updated": 1514591181, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38833858": {"recommendationid": "38833858", "author": {"steamid": "76561198274752122", "num_games_owned": 68, "num_reviews": 6, "playtime_forever": 41, "playtime_last_two_weeks": 41, "last_played": 1514580584}, "language": "english", "review": "Still the same as the one from xbox, however, there is a lot missing which i am assuming is going to be added in the future as the game is in early access. Also, the menu navigation is a bit awkward to use so i think that could be changed. Apart from that, the same game as the one from xbox and is still good. I'm probably going to wait before playing this game more as it still needs more work to be done to make it like the original.", "timestamp_created": 1514580826, "timestamp_updated": 1514580826, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38825332": {"recommendationid": "38825332", "author": {"steamid": "76561198800050756", "num_games_owned": 3, "num_reviews": 2, "playtime_forever": 40, "playtime_last_two_weeks": 40, "last_played": 1514565818}, "language": "english", "review": "total miner was one of the best games on 360 by far, most of us have been waiting for it to come to steam for a very long time and it's finally here. obviously still needs some work as its in early stages but when it's complete i would recommend everyone to try it and see if they like it, personally I really enjoy playing it and will continue to support it.", "timestamp_created": 1514565982, "timestamp_updated": 1514565982, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38825213": {"recommendationid": "38825213", "author": {"steamid": "76561198067326844", "num_games_owned": 165, "num_reviews": 6, "playtime_forever": 837, "playtime_last_two_weeks": 837, "last_played": 1514660914}, "language": "english", "review": "This game shaped my childhood when it first came out on the xbox 360. For years I've wanted to play it on the computer and have been keeping up to date on the progress since it got greenlit. \nNostalgia aside, this game is constantly being updated and gets closer to perfection every time it does. To put you in perspective, this game was orginally a small world with an almost infinite supply of surprises beneath the ground. Now it's a full blown rpg. \nWhile on the surface it looks like another shameless minecraft rip off, I can safely say that this masterpiece never has felt or played like minecraft. Because of Craig's (The Creator) dedication to the game it achived much more than minecraft has through updates. Minecraft may have come first in creation, but there are many features that Total Miner had before minecraft, for example Duel Weilding, Ingame blocks used for scripting, Multiple types of stone, customized flatworlds, hightlimit reaching the 1000s, llamas/alpacas, a craft menu and ways to find new recepies, and more that I can't think of off the top of my head because of how different the games play. \nAs well as features that minecraft eventually got after Total Miner, because this game doesn't need to keep that \"minecrafty feel\" that most devs who work on updating Minecraft often refer to, there are many features that make the world in Total Miner feel more real. These are things such as layers of rock the lower you get which you can't mine until you've gotten strong enough tools, an optional skill system that will unlock items so making the game feel more progressive, shops that you can use to buy and sell items, trees that come in all shapes and sizes, many role playing items that allow you to do things like fly, an insane amount of creatures that roam the world at night, making it almost impossible to survive without propper protection, marker blocks that you can use in creative which work like a sort of world edit to remove/build large areas quickly, I seriously can go on about the vastness of this game but instead I ask you to play it for yourself.\nRight now it's very clearly in early access when you play, although for everything I've already said I truly belive that this game will soon be flawless.", "timestamp_created": 1514565820, "timestamp_updated": 1514565820, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38807578": {"recommendationid": "38807578", "author": {"steamid": "76561198183894701", "num_games_owned": 115, "num_reviews": 33, "playtime_forever": 94, "playtime_last_two_weeks": 94, "last_played": 1514533496}, "language": "english", "review": "i wish u put up dig deep and multiplayer that all i need and really confused about new menu lol and great work lol i remember i play this alot and then they stop update xbox 360 rip", "timestamp_created": 1514526685, "timestamp_updated": 1514526742, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.426784", "comment_count": 0, "steam_purchase": true, "received_for_free": true, "written_during_early_access": true}, "38806871": {"recommendationid": "38806871", "author": {"steamid": "76561198313037225", "num_games_owned": 10, "num_reviews": 1, "playtime_forever": 180, "playtime_last_two_weeks": 180, "last_played": 1514527412}, "language": "english", "review": "This Game is AMAZING. Its has bugs, like all early access games, but other than that its a 10/10", "timestamp_created": 1514524610, "timestamp_updated": 1514524610, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38801610": {"recommendationid": "38801610", "author": {"steamid": "76561198066258960", "num_games_owned": 118, "num_reviews": 10, "playtime_forever": 6, "playtime_last_two_weeks": 6, "last_played": 1514687514}, "language": "english", "review": "best minecraft mod on the market", "timestamp_created": 1514510534, "timestamp_updated": 1514510534, "voted_up": true, "votes_up": 3, "votes_funny": 3, "weighted_vote_score": "0.501608", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38796076": {"recommendationid": "38796076", "author": {"steamid": "76561197983236884", "num_games_owned": 52, "num_reviews": 2, "playtime_forever": 1536, "playtime_last_two_weeks": 1536, "last_played": 1514503213}, "language": "english", "review": "This is a great sandbox game, I'm not going to say it's bad because it's not. Sometimes the game does lag for the first minute when I load up my map, after that it is as smooth as a Glass ball.\n\n\n\nThe Survival is pretty fun, on easy mode you can enable shops for purchases, but if you're naturual then enable Normal mode for no shops, but if you're hardcore then enable Legendary for stronger enemies so you can see what real peril feels like. You can double jump if you want to reach higher spots, and can climb up the 3rd block if you time it right.\n\nDigdeep is not in the game yet, but it's a mode where you find blueprints and wisdom scrolls so you don't start off with everything craftable. It's a very fun gamemode, also there are layers of hell.\n\nCreative, you can use scripts to create easy to access shops with custom menus, create boss fights, advanced parkour levels, and many more. You can also save your best builds with a clipboard, also you can enable skills and finite for people in your map when multiplayer comes.\n\nI think it's worth the money if you have no problem spending $10 on an indie game. I'm getting lots of play value from it, and if you like sandbox games with easy scripting then you'd like this.", "timestamp_created": 1514497512, "timestamp_updated": 1514497539, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38791254": {"recommendationid": "38791254", "author": {"steamid": "76561198132780275", "num_games_owned": 50, "num_reviews": 2, "playtime_forever": 46, "playtime_last_two_weeks": 46, "last_played": 1514519554}, "language": "english", "review": "The nostalgia for this game is so fucking real. I remember spending weeks playing this game with my friends, doing Dig Deep over and over, trying to get the grenade launcher at the Nexus. Truly a great game, and will be apart of my childhood forever. Highly recommend.", "timestamp_created": 1514488323, "timestamp_updated": 1514488323, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38775555": {"recommendationid": "38775555", "author": {"steamid": "76561198153734280", "num_games_owned": 20, "num_reviews": 6, "playtime_forever": 16, "playtime_last_two_weeks": 16, "last_played": 1514410492}, "language": "english", "review": "This game was great on xbox and on pc its just as good even tho iv only played half hour i can tell its going to be great on pc compaired to xbox., just hope devs can make multiplayer much better mp experiance than xbox. my xbox gt was braveyoungrebel if you remember me or my worlds aka /Hardtime/Drug runner/Deathsewer. hit me up on steam.", "timestamp_created": 1514459090, "timestamp_updated": 1514459090, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38767897": {"recommendationid": "38767897", "author": {"steamid": "76561198099359211", "num_games_owned": 150, "num_reviews": 13, "playtime_forever": 6, "playtime_last_two_weeks": 6, "last_played": 1514439112}, "language": "english", "review": "Sad to see Dig Deep isn't currently available. I would love to see an option similar to CastleMiner Z's in which it reverts the game to the classic Xbox Live Indie Games version. Would truly recommend if Dig Deep was available, but im recommending now just because I hope this review gets outdated and it does release.", "timestamp_created": 1514439119, "timestamp_updated": 1514439119, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38765415": {"recommendationid": "38765415", "author": {"steamid": "76561198125928461", "num_games_owned": 20, "num_reviews": 1, "playtime_forever": 47, "playtime_last_two_weeks": 47, "last_played": 1514604296}, "language": "english", "review": "So happy this came on the pc. I played this game on the xbox 360 all the time. I cant wait untill multiplayer is added :D\n", "timestamp_created": 1514432995, "timestamp_updated": 1514432995, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38764590": {"recommendationid": "38764590", "author": {"steamid": "76561198183863901", "num_games_owned": 15, "num_reviews": 2, "playtime_forever": 17, "playtime_last_two_weeks": 17, "last_played": 1514399699}, "language": "english", "review": "Playing this for over 6 years from the beginning of this games 360 release, and I am still in love with this game. All those good times makes me shed a tear, I'm glad this is on PC now so I can enjoy it even longer.", "timestamp_created": 1514431129, "timestamp_updated": 1514431129, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38764458": {"recommendationid": "38764458", "author": {"steamid": "76561198055548758", "num_games_owned": 75, "num_reviews": 38, "playtime_forever": 1334, "playtime_last_two_weeks": 1334, "last_played": 1514707206}, "language": "english", "review": "[h1] The Review [/h1]\nThis game plays EXACTLY how i remember on XB360. Despite the game has bugs and being in EA this game is completly playable upon download. There are kinks in the game but its too be expected with being a port and an EA game. Bear with them since now they are selling it at 10$ rather than 3$ like on XBLIG they will make revenue to bring better content. \n\ndef a 10/10 for a powerful Game for having fun and tool for making games within a game. Best Voxel game out there to compete against MC, especially for being on steam only\n\n[h1] The Nostolgia [/h1]\n\nI've been with this game since XBLIG 1.1 wayy before graphical over hauls, way before you stopped spawing on a basalt 3x6 platform with two shops on it,way before the spiders got a graphical over haul and wayy before the day night cycle. back when the map seeds 666 existed for the devil, 2400 existed for night time maps and back in the time when this game was drab but fun to watch develop and be next to. after all that who-ha, came the big update, UPDATE 1.5! the multiplayer update! My friend ryan didnt really like voxel crafting games so it took some convincing to get him on it, and i convertied him into a total miner lover. Those were my good ol days. Making hardcore maps with a castle, then a business and made apartments for people who joined the server often, made a working economy that worked it self out and mining business that took off actually where we provided the blocks and stuff that people didnt wanna take the time to do so they could craft in exchange for coin. every thing was so damn fun. they came 1.6-1.8 where the changed the map lay outs, added the 3 bioms, added more MOBS like the indian (pre-1.8) and zombies, then came the djinns, trolls, orcs, the devil , (post 1.8). This game has massive nostolgia with my friends n i on being the most fun, retarded, edgy, 2spooky4mi game at times. I really do thank @StudioForge for bringing this game to PC and trucking through all odds to make it an Early Access game. \n\nSincerely;\n  Jhopp, Your die hard fan since 1.1\n\nCANT WAIT FOR THE SECOND RELEASE OF MULTIPLAYERRRR LOL", "timestamp_created": 1514430865, "timestamp_updated": 1514632922, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38763482": {"recommendationid": "38763482", "author": {"steamid": "76561198194568898", "num_games_owned": 29, "num_reviews": 4, "playtime_forever": 20, "playtime_last_two_weeks": 20, "last_played": 1514358738}, "language": "english", "review": "One of the best Xbox 360 Games coming to Steam, What could go wrong? So far, nothing is wrong with the game. Same graphics that I remember, same nostalgic feel. This game is cheaper and better than minecraft in many different ways.\n- More freedom of Map making\n- More Blocks\n- Better Progression\n- More Weapons\n- More Tools\n\nDig Deep is one of Total Miner's best features where you find blueprints and dig to bedrock (TAKES A LONG TIME). Caves have earthquakes and this was the only gamemode I would play as a kid. If you're looking for a game like minecraft but with a lot more to its progression, total miner is the game for you.\n\nNOTE: DIG DEEP IS NOT CURRENTLY OUT, I WOULD ADVISE YOU TO WISHLIST THE GAME AND BUY IT WHEN DIG DEEP OR MULTIPLAYER IS AVAILABLE.\n\nPLEASE SHARE THIS GAME TO ALL OF YOUR FRIENDS AND TELL THEM TO DO THE SAME!", "timestamp_created": 1514428809, "timestamp_updated": 1514428809, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38760329": {"recommendationid": "38760329", "author": {"steamid": "76561198122798607", "num_games_owned": 112, "num_reviews": 6, "playtime_forever": 91, "playtime_last_two_weeks": 91, "last_played": 1514421665}, "language": "english", "review": "If the developer can update to the patch it had on Xbox 360 with multiplayer then this is one of the best games I have ever played.", "timestamp_created": 1514421731, "timestamp_updated": 1514421731, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.476190", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38759267": {"recommendationid": "38759267", "author": {"steamid": "76561198079994410", "num_games_owned": 222, "num_reviews": 11, "playtime_forever": 6, "playtime_last_two_weeks": 6, "last_played": 1514419059}, "language": "english", "review": "Very good game a must buy no bugs at this time runs fine looking forward for a multiplayer update", "timestamp_created": 1514419266, "timestamp_updated": 1514419266, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38758354": {"recommendationid": "38758354", "author": {"steamid": "76561198071858132", "num_games_owned": 202, "num_reviews": 1, "playtime_forever": 948, "playtime_last_two_weeks": 948, "last_played": 1514415761}, "language": "english", "review": "Other reviews sum it up rather well. It is a voxel/survival game similar to minecraft but with much more to offer. With more gamemodes coming out soon and an active development team, I fully recommend it; however, it is early access, and it has crashed on me a few times with various losses of progress. The loss is remedied by a frequent auto-save feature for now, but it could be irritating having to relaunch the game from time to time.", "timestamp_created": 1514417336, "timestamp_updated": 1514417336, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38747855": {"recommendationid": "38747855", "author": {"steamid": "76561198202222784", "num_games_owned": 64, "num_reviews": 2, "playtime_forever": 122, "playtime_last_two_weeks": 122, "last_played": 1514436904}, "language": "english", "review": "My childhood game.\nStill great and my favorite.", "timestamp_created": 1514398448, "timestamp_updated": 1514398448, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38745992": {"recommendationid": "38745992", "author": {"steamid": "76561198156747259", "num_games_owned": 57, "num_reviews": 1, "playtime_forever": 135, "playtime_last_two_weeks": 135, "last_played": 1514399024}, "language": "japanese", "review": "昔に箱○版でプレイした事がありましたが、それがsteamにリリースされたと聞き、いてもたってもいられずに購入しました。\n※ちなみにこのレビューは、バージョンがv2.6.210(2017/12/28)、操作はキーボード、使用OSはWindows7 64bit版、このような環境でプレイしたものとなっています。いずれかの点に相違がある場合、レビュー通りの動作をしない可能性があります。\n\n●どういったゲームなのか？\n「total miner」は、サンドボックスゲーム、いわゆる「minecraft」のオマージュ作品です。そして本ゲームの主な目的は、『ただひたすら地下に掘り進む』という事です。\n(正直、やったのがかなり昔のバージョン & 完全クリアはしていないので一概には言えませんが・・・)\n「minecraft」だったら序盤に石のツルハシ１丁作って、あとはそれだけで岩盤まで簡単に辿り着けますが、「total miner」はそう簡単には行きません。まず、石ブロックの種類がとても多く、地下深くなるにつれて各々の石ブロックの硬度が高くなっていきます。当然、それでは序盤の石のツルハシで掘り進むには際限があると言う事です。そこで、掘り進める事ができるギリギリの地層に生成される石ブロックや鉱石で新たにツルハシを作り、更に地下深くを目指していく、というのが主体のゲームです。\nもちろん、その石ブロックや鉱石が簡単に手に入るようなヤワなゲームではなく、モンスターや洞窟の崩落などのプレイヤーの採掘を阻むモノも存在し、作れるツルハシ・アイテムと言うのもとても数多く、やり応えは十分にあるゲームだと思います。\n\n●いざプレイ！　・・・しかし (キーボードでは) 驚くほどの操作性の悪さ\n期待を膨らませつついざプレイしようと思ったのですが、なぜかタイトル画面から抜け出せず・・・。 \"Press any key\" と表示されているのですが、何を入力しても受け付けてくれません。適当に色々入力してる内に気付きましたが、どうやらsteamのオーバーレイを表示させるとタイトルメニューに進めるようです。(デフォルトで、 Shift +  Tab キーを押して出てくる画面です)まあバグですよね。\nそして次にオプションでFOVやマウス感度を設定しようとしましたが、なぜかいくらクリックしても目盛が動きません・・・。色々入力している内、どうやらキーボードの矢印キーだと設定できる事に気づきました。バグ。\n最後にキーコンを設定しようとしましたが、クリックしてからキーを入力しても、何故か設定ができません・・・。おまけにキー設定の画面から抜けられなくなりました・・・。色々と入力しましたが、これだけはどうしようもなく、止む無く再起動を迫られました。重大なバグです。\n・・・このように、正直、現バージョンではキーボードでまともにプレイする事が出来ないです。とくにオプション関連があまりに酷すぎだと思います。恐らく箱○コントローラでやれば何の問題が無いのでしょうか？レビューで不評が１つだけだったので、プレイ環境次第では通常にプレイできるモノなのだと思われます。\n\n●結論\nキーボードでプレイするなら、アップデートを待ちましょう。\n箱○コントローラでやるなら、箱○でやりましょう。おしり。", "timestamp_created": 1514395115, "timestamp_updated": 1514395208, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.447674", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38745397": {"recommendationid": "38745397", "author": {"steamid": "76561198153156891", "num_games_owned": 16, "num_reviews": 2, "playtime_forever": 609, "playtime_last_two_weeks": 609, "last_played": 1514555864}, "language": "english", "review": "10 / 10 but needs more content", "timestamp_created": 1514394009, "timestamp_updated": 1514394009, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38734071": {"recommendationid": "38734071", "author": {"steamid": "76561198093042492", "num_games_owned": 226, "num_reviews": 27, "playtime_forever": 54, "playtime_last_two_weeks": 54, "last_played": 1514049302}, "language": "english", "review": "Really good port from the Xbox 360! Can't wait until the next updates!", "timestamp_created": 1514373989, "timestamp_updated": 1514373989, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38726590": {"recommendationid": "38726590", "author": {"steamid": "76561198124161338", "num_games_owned": 78, "num_reviews": 2, "playtime_forever": 164, "playtime_last_two_weeks": 164, "last_played": 1514590643}, "language": "english", "review": "I absolutey love this game. I've played this since it was on the 360 and waited for the PC realease. Now i can have this forever.", "timestamp_created": 1514356588, "timestamp_updated": 1514356588, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38721337": {"recommendationid": "38721337", "author": {"steamid": "76561197994077944", "num_games_owned": 79, "num_reviews": 9, "playtime_forever": 475, "playtime_last_two_weeks": 475, "last_played": 1514348882}, "language": "english", "review": "Been Waiting for a PC release for years!", "timestamp_created": 1514343267, "timestamp_updated": 1514343267, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38719268": {"recommendationid": "38719268", "author": {"steamid": "76561198152888449", "num_games_owned": 48, "num_reviews": 4, "playtime_forever": 463, "playtime_last_two_weeks": 463, "last_played": 1514394292}, "language": "english", "review": "Played this game for years. Can't wait to play it for even more on my computer.", "timestamp_created": 1514337971, "timestamp_updated": 1514337971, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38714486": {"recommendationid": "38714486", "author": {"steamid": "76561198212168393", "num_games_owned": 46, "num_reviews": 2, "playtime_forever": 193, "playtime_last_two_weeks": 193, "last_played": 1514748564}, "language": "english", "review": "It's not minecraft, that's for sure. But for a ten dollar price tag, it's a pretty good experience", "timestamp_created": 1514326987, "timestamp_updated": 1514326987, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38711058": {"recommendationid": "38711058", "author": {"steamid": "76561198341189134", "num_games_owned": 4, "num_reviews": 3, "playtime_forever": 88, "playtime_last_two_weeks": 88, "last_played": 1514394401}, "language": "english", "review": "LOVE THIS Game", "timestamp_created": 1514320695, "timestamp_updated": 1514320695, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.463320", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38710472": {"recommendationid": "38710472", "author": {"steamid": "76561198384001218", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 18, "playtime_last_two_weeks": 18, "last_played": 1514319862}, "language": "english", "review": "add multplayer", "timestamp_created": 1514319603, "timestamp_updated": 1514319603, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.481090", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38706358": {"recommendationid": "38706358", "author": {"steamid": "76561198080748452", "num_games_owned": 125, "num_reviews": 2, "playtime_forever": 1621, "playtime_last_two_weeks": 1621, "last_played": 1514702490}, "language": "english", "review": "I'm not going to make one of those 10,000 word reviews and act like I'm the god of this game and I know everything. \nWhat I do know, is that the developer cares about this game, and he only answers to himself, so any decisions for the game will be out of his own will, not the will of some big corporation. \nThis game is very early access, there will be plenty bugs, and features that just outright don't work.\nThe reason this game is even out right now is because the developer knows that his fanbase wanted to play this game instead of waiting for another 3 months before it's reasonably stable (we've waited like 3-5 years for this game to come to pc) so don't complain about the bugs unless you are trying to help.\n\n\nTL;DR \nThis game will be buggy, but in time it will be greater than ever, with limitless potential for growth due to an appreciative developer.", "timestamp_created": 1514312250, "timestamp_updated": 1514312250, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38699468": {"recommendationid": "38699468", "author": {"steamid": "76561198178400970", "num_games_owned": 39, "num_reviews": 5, "playtime_forever": 180, "playtime_last_two_weeks": 180, "last_played": 1514299439}, "language": "german", "review": "Es ist zwar noch in der Beta aber es ist wie auf der XBOX 360 super und sehr spaßig", "timestamp_created": 1514299860, "timestamp_updated": 1514299860, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38691643": {"recommendationid": "38691643", "author": {"steamid": "76561198115655792", "num_games_owned": 63, "num_reviews": 13, "playtime_forever": 28, "playtime_last_two_weeks": 28, "last_played": 1514436210}, "language": "english", "review": "HEY KIDS! SICK, TIRED AND FUCKING PISSED AT MINECRAFT?\n\nTHEN YOU SHOULD PLAY THIS FUCKING KNOCKOFF!\n\n\"Why should I play this?\" you may ask?\nWell its simple!\n\nIts actually calming and you dont have take peoples shit!\n\"But this isnt online, isnt the playing online with friends the point of a good community?\"\nOh please! Thats how Minecraft got ruined in the first place, you probably dont even have real friends anyway!\n\nIt doesnt have shit music! Its actually calming and not 32 bit shit!\n\"But C418 is good musician tho.\"\nFuck your taste in music!\n\nIt runs smoother than Minecraft!\n\"Thats because everything is small.\"\nJust like your dick!\n\nIts potential is productive!\n\"But Minecraft is always adding more stuff.\"\nYes! But lets not forget its ruining your favorite stuff!\n\nThe community is perfect!\n\"But its small, and isnt really well known.\"\nYou've been hanging around assholes too much.\n\n10/10\nTaking my passive agression out on poor helpless animals.\n", "timestamp_created": 1514284230, "timestamp_updated": 1514284230, "voted_up": true, "votes_up": 0, "votes_funny": 7, "weighted_vote_score": "0.334850", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38688896": {"recommendationid": "38688896", "author": {"steamid": "76561198067345339", "num_games_owned": 63, "num_reviews": 5, "playtime_forever": 653, "playtime_last_two_weeks": 653, "last_played": 1514526130}, "language": "english", "review": "Other than a few broken controls, lag spikes and occasional crashing, the game is almost solid; it's just missing some features. Consider that one guy has been making this game for six years now.", "timestamp_created": 1514277400, "timestamp_updated": 1514277400, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.487116", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38683714": {"recommendationid": "38683714", "author": {"steamid": "76561198123842562", "num_games_owned": 94, "num_reviews": 11, "playtime_forever": 54, "playtime_last_two_weeks": 54, "last_played": 1514660411}, "language": "english", "review": "Minecraft RPG but better", "timestamp_created": 1514263243, "timestamp_updated": 1514263243, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.521580", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38681815": {"recommendationid": "38681815", "author": {"steamid": "76561198263342776", "num_games_owned": 30, "num_reviews": 10, "playtime_forever": 1471, "playtime_last_two_weeks": 1471, "last_played": 1514790048}, "language": "english", "review": "Bro this is my childhood in the xbox 360 i played this game since beta or 1.6 i played until the xbox one came in\n\nfuckin hell you made my childhood again", "timestamp_created": 1514258116, "timestamp_updated": 1514258116, "voted_up": true, "votes_up": 27, "votes_funny": 2, "weighted_vote_score": "0.672605", "comment_count": "6", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38679059": {"recommendationid": "38679059", "author": {"steamid": "76561198035145729", "num_games_owned": 102, "num_reviews": 1, "playtime_forever": 122, "playtime_last_two_weeks": 122, "last_played": 1514485402}, "language": "english", "review": "Great game underated", "timestamp_created": 1514250900, "timestamp_updated": 1514250900, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.466440", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38678581": {"recommendationid": "38678581", "author": {"steamid": "76561198301672437", "num_games_owned": 26, "num_reviews": 1, "playtime_forever": 274, "playtime_last_two_weeks": 274, "last_played": 1514271118}, "language": "english", "review": "heeeeeeeyyyyy... that's pretty good", "timestamp_created": 1514249630, "timestamp_updated": 1514249630, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.466693", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38675618": {"recommendationid": "38675618", "author": {"steamid": "76561198054433365", "num_games_owned": 122, "num_reviews": 6, "playtime_forever": 9, "playtime_last_two_weeks": 9, "last_played": 1514241750}, "language": "english", "review": "I love this game, played this in my Xbox 360 days in 2012+. The developer has been working on this port for YEARS. It does feel Minecraft-esque, however it does have it's own charm. A Dig Deep mode(missing from the game currently due to bugs), blueprint finding,in game block shops, and mobs/player models made of blocks found available in game. Once this game's multiplayer is in full force I believe this game will blow up a lot more with fun mini-communities. Definitely worth a second look at, especially with the \"Minecraft\" lenses off.", "timestamp_created": 1514242163, "timestamp_updated": 1514242163, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.544747", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38673176": {"recommendationid": "38673176", "author": {"steamid": "76561198042701643", "num_games_owned": 266, "num_reviews": 29, "playtime_forever": 180, "playtime_last_two_weeks": 180, "last_played": 1514467004}, "language": "english", "review": "UPDATED -  added specs and video - deleted all comments - just to explain clearly and tidy things up\n\nRecorded at 1920 x 1080 (the same as i stream)\n\nSpecs-\n\ni5 - 440s Quad 2.8 Ghz (3.10 Turbo)\nM11AD\n8 GIG DDR 3\nZotac GTX 1060 3 GIG\nWindows 10 64 Home\nDX 11 (12 compatable) \n\nVideo review -  https://youtu.be/gEhuyeU7ZFA\n\n(copied from my *Why i love this game* thread in the discussions forum)\n\nWhy i love this game - \n\nThe MC clone i have been waiting for - we can level up, we can modify our xp... its hard to die (health auto regens) mobs *enimes* appear to be *peaceful* (they will not attack unless you do) - cows actually fight back and don't just run - building/mining mechanics are very easy to use (old MC players will know what to do, new players won't have too much trouble either)\n\nWhat could be improved upon - \n\nGFX (GFX look like minecraft PRE-ALPHA - the texture packs don't seem to add much either)\nOPTIMIZATION! - *Edited* it was user error, i have realised that some games don't like OBS unless the game is open first - stream is perfect now\nA TUTORIAL - a tutorial would be nice (especially how to use the editing/modding/dev tools)\n\nCurrently i think the full price is more than worth it, just please DEV... PLEASE keep this game updated and fix the optimization... (I say this only because it used to be on 360 and you have had a number of years to optimize it already - this is the only REAL negative i have)\n\nFor the fact of streaming i would give it a poor 3/10 [8/10 - please note OPTIMIZATION! Edit]\n\nFor the fact of the game itself and what it is trying to do, i give it a solid 8/10\n\nProduct received from a gift (Cheers Kenkade 4)", "timestamp_created": 1514237022, "timestamp_updated": 1514487566, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.451920", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "38672956": {"recommendationid": "38672956", "author": {"steamid": "76561198101348088", "num_games_owned": 145, "num_reviews": 49, "playtime_forever": 24, "playtime_last_two_weeks": 24, "last_played": 1514203761}, "language": "english", "review": "This is the best indie i ever played on Xbox. Such an fun experience, with friends and multiplayer players. I used to make so many challenge maps on Xbox which some was big hits in the community. I will deffiently be bringing back my maps to this pc port! I have spent so many hours on this game and I can safely say it's 100% worth it. Recommend to all!!!", "timestamp_created": 1514236534, "timestamp_updated": 1514236534, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.496014", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38668589": {"recommendationid": "38668589", "author": {"steamid": "76561198052386772", "num_games_owned": 49, "num_reviews": 8, "playtime_forever": 27, "playtime_last_two_weeks": 27, "last_played": 1514414167}, "language": "english", "review": "Why should you buy total miner as opposed to any other block crafting game? Simply because it's better. \n\nTotal Miner is a game that originally came out on Xbox arcade, and sold quite a few copies. The game has your usual standard survival modes, creative modes, and it's very own skill system that carries across games. But where the game REALLY shines is in the creative potential of the players. \n\nIn Total Miner you can copy/paste your builds, save them and bring them to other worlds, download other people's creations, flood fill and delete and all kinds of other creative tools built into the game itself. Hands down one of the best creative building toolsets in any of the block game genre. \n\nBut it doesn't stop there, there's also a robust scripting system built into the game. Create moving platforms, secret doors, make a boss mob, create spawns, make your own hailstorm staff for players to get, make scripted dungeons the possibilites are endless. \n\nBut wait, there's more. Craig has been working on creating a quest system for NPCs to actually talk to you and have things to say about quests in a dialogue tree. \n\nBUT WAIT, THERE'S EVEN MORE. With the unique pixel system you can create your own furniture and unique pixel decor.\n\nI can't wait to see what the community does with this game.  Also ignore the lack of play time, I have hundreds of hours clocked into xbox version.", "timestamp_created": 1514227912, "timestamp_updated": 1514227912, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.496014", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38668251": {"recommendationid": "38668251", "author": {"steamid": "76561198000865538", "num_games_owned": 86, "num_reviews": 7, "playtime_forever": 209, "playtime_last_two_weeks": 209, "last_played": 1514535897}, "language": "english", "review": "Total Miner: Forge started out on the Xbox 360 to fill the Minecraft-shaped void in players' hearts before Minecraft Xbox 360 was released. Since then, it went on to become one of the best-selling games on the Xbox Live Indie Games service, which has since been shut down.\n\nBut in the modern gaming landscape... where is Total Miner's place? Most folks won't remember its legacy, and will likely bomb the game as a result. But I wouldn't say it deserves to be relegated to the piles of shovelware clones, because Total Miner [b]was[/b] a legitimate response to a need.\n\nSo who is this PC release for? Likely, fans of the original. It's an homage, a continuation, a preservation effort. To me, it's a love letter. To bygone days of my early teen years, spent in awe of the freedom this game allowed me, to the countless lost hours, to the formative effect it had on my interests. This game is to me what Minecraft was to people on the PC platform when it first hit it big.\n\nBut a lot of folks wouldn't know that by looking at it. It's lacking in animation. It's clunky, it's not very good looking. But it's robust, it's got layered progression, it's got that sense of adventure that it had back in 2012.\n\nSo where does the 2017 re-release of Total Miner belong in today's gaming landscape?\n\nEasy.\n\nMy heart.", "timestamp_created": 1514227305, "timestamp_updated": 1514227305, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38664720": {"recommendationid": "38664720", "author": {"steamid": "76561198119734369", "num_games_owned": 44, "num_reviews": 10, "playtime_forever": 6, "playtime_last_two_weeks": 6, "last_played": 1514058109}, "language": "english", "review": "This game has serious potential.", "timestamp_created": 1514220787, "timestamp_updated": 1514226276, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500878", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38659973": {"recommendationid": "38659973", "author": {"steamid": "76561198090943091", "num_games_owned": 89, "num_reviews": 4, "playtime_forever": 16, "playtime_last_two_weeks": 16, "last_played": 1514182006}, "language": "english", "review": "This Game brings back many memories of the xbox 360 indie days, Cant wait for Dig deep mode, multiplayer, AND FUTURE UPDATES! \n\nDeffinetly a great game for the price.", "timestamp_created": 1514212160, "timestamp_updated": 1514212160, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38658457": {"recommendationid": "38658457", "author": {"steamid": "76561198045264831", "num_games_owned": 314, "num_reviews": 41, "playtime_forever": 6, "playtime_last_two_weeks": 6, "last_played": 1514209413}, "language": "english", "review": "It actually has more features and actually doesn't look like a giant money grab like other mining games", "timestamp_created": 1514209478, "timestamp_updated": 1514209478, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.549736", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38653716": {"recommendationid": "38653716", "author": {"steamid": "76561198191132375", "num_games_owned": 74, "num_reviews": 9, "playtime_forever": 7949, "playtime_last_two_weeks": 7949, "last_played": 1514755697}, "language": "english", "review": "I played it for a bit\n\nKind of like minecraft.. But good", "timestamp_created": 1514199278, "timestamp_updated": 1514199278, "voted_up": true, "votes_up": 1, "votes_funny": 4, "weighted_vote_score": "0.469963", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38648347": {"recommendationid": "38648347", "author": {"steamid": "76561198073445338", "num_games_owned": 107, "num_reviews": 2, "playtime_forever": 340, "playtime_last_two_weeks": 340, "last_played": 1514499855}, "language": "english", "review": "Was great on the 360 and is looking to be an amazing PC game with so much potential!", "timestamp_created": 1514185677, "timestamp_updated": 1514185677, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38641816": {"recommendationid": "38641816", "author": {"steamid": "76561198084425554", "num_games_owned": 123, "num_reviews": 6, "playtime_forever": 309, "playtime_last_two_weeks": 309, "last_played": 1514508750}, "language": "english", "review": "I'm so happy to see total miner on pc finally I bought as soon as I saw it was on steam and it's great even as it is in early access. the only thing I don't really like though is that the new menus are stylized like \"no man's sky\" menus and I don't really like that", "timestamp_created": 1514164808, "timestamp_updated": 1514164808, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38641623": {"recommendationid": "38641623", "author": {"steamid": "76561198044160560", "num_games_owned": 292, "num_reviews": 23, "playtime_forever": 58, "playtime_last_two_weeks": 58, "last_played": 1514183433}, "language": "english", "review": "Just found out about this game, can't wait to see more of it :)", "timestamp_created": 1514164098, "timestamp_updated": 1514164098, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38640605": {"recommendationid": "38640605", "author": {"steamid": "76561198197694717", "num_games_owned": 13, "num_reviews": 1, "playtime_forever": 67, "playtime_last_two_weeks": 67, "last_played": 1514610025}, "language": "english", "review": "I have played countless hours on the Xbox 360 version of the game. And yes, it's similar to Minecraft with a huge emphasis on building. The creative mode system in this game really shows the countless possibilities that this game has in store. The Survival Mode is lacking on both the PC and Xbox 360 version, but I don't mind that. I know the PC version has more yet to come, but I am quite impressed at what the PC version has to offer. Don't let the fact that this is similar to Minecraft deter you from trying out a wonderful game.", "timestamp_created": 1514160924, "timestamp_updated": 1514160924, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38639691": {"recommendationid": "38639691", "author": {"steamid": "76561198047714841", "num_games_owned": 153, "num_reviews": 7, "playtime_forever": 20, "playtime_last_two_weeks": 20, "last_played": 1514157080}, "language": "english", "review": "AN OLD CLASSIC RETURNS.......", "timestamp_created": 1514157964, "timestamp_updated": 1514157964, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.533966", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "38638946": {"recommendationid": "38638946", "author": {"steamid": "76561198350116083", "num_games_owned": 13, "num_reviews": 1, "playtime_forever": 19, "playtime_last_two_weeks": 19, "last_played": 1514103183}, "language": "english", "review": "my only gripe is that dig deep isnt out yet.", "timestamp_created": 1514155963, "timestamp_updated": 1514155963, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.564635", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38638911": {"recommendationid": "38638911", "author": {"steamid": "76561198241948972", "num_games_owned": 60, "num_reviews": 4, "playtime_forever": 2282, "playtime_last_two_weeks": 2282, "last_played": 1514651535}, "language": "english", "review": "Good game", "timestamp_created": 1514155869, "timestamp_updated": 1514155869, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38635258": {"recommendationid": "38635258", "author": {"steamid": "76561198337440697", "num_games_owned": 11, "num_reviews": 1, "playtime_forever": 531, "playtime_last_two_weeks": 531, "last_played": 1514682984}, "language": "english", "review": "pretty awesome, its great for early access!", "timestamp_created": 1514146940, "timestamp_updated": 1514146940, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38633165": {"recommendationid": "38633165", "author": {"steamid": "76561198065540469", "num_games_owned": 32, "num_reviews": 6, "playtime_forever": 47, "playtime_last_two_weeks": 47, "last_played": 1514144896}, "language": "english", "review": "Often updates.", "timestamp_created": 1514142612, "timestamp_updated": 1514142612, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38631905": {"recommendationid": "38631905", "author": {"steamid": "76561198242493640", "num_games_owned": 15, "num_reviews": 1, "playtime_forever": 42, "playtime_last_two_weeks": 42, "last_played": 1514398599}, "language": "english", "review": "I played this game on the X-box before minecraft and in it's infant stages all the way till now and it has always been a amazing game I hold this game in high regard but you have to be patient because he is all alone doing this game but he does not let down in his updates even though they are loug periods apart but over all I love this game and I highly recommended this game", "timestamp_created": 1514140052, "timestamp_updated": 1514140052, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38631254": {"recommendationid": "38631254", "author": {"steamid": "76561198139046077", "num_games_owned": 72, "num_reviews": 34, "playtime_forever": 13, "playtime_last_two_weeks": 13, "last_played": 1514138557}, "language": "english", "review": "Too buggy for release, hardly playable in its current state. I know the game is in early access but this is unacceptable. I am also very disappointed that dig deep is not included at the moment as I loved playing it on Xbox 360. Great game but a rubbish PC port, I will try it again in a month or two and change my review if enough progress has been made,\n\nI`m still going to recommend the game as I know how good it is from Xbox 360, I just can`t recommend buying it right now as it is too buggy and unfinished.\n\nAlso a note to the developer, just get rid of the new menu system. It is horrible and nobody likes it, the old one was much better. If it aint broke, don`t fix it.", "timestamp_created": 1514138722, "timestamp_updated": 1514138976, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.495495", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38629718": {"recommendationid": "38629718", "author": {"steamid": "76561198065684726", "num_games_owned": 148, "num_reviews": 97, "playtime_forever": 139, "playtime_last_two_weeks": 139, "last_played": 1514225052}, "language": "english", "review": "Nostalgia from the Xbox 360 version. \n\nUsed to play this before Minecraft came out on the Xbox, but in many ways this was still better. A quality deal at 240 microsoft points, and still good at £6.11\n\nWorth a buy", "timestamp_created": 1514135703, "timestamp_updated": 1514135703, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38629021": {"recommendationid": "38629021", "author": {"steamid": "76561198082863304", "num_games_owned": 20, "num_reviews": 2, "playtime_forever": 198, "playtime_last_two_weeks": 198, "last_played": 1514228214}, "language": "english", "review": "This game, if updated, will be one of the best $10 you ever spend without a doubt. Once it gets up to where it was on Xbox back in the day I will have no problem with saying that it is the best PC block survival game. With hours upon hours of fun and adventure and with there always being something new to do in it, the game will prove to be a huge occupier of time and a lovely investment. I have been waiting on this game to release on PC for almost 3 years now and I am not disappointed. Although, if the devs do read this, I have one or two pieces of criticism. Only constructive, nothing huge though :)\n\n[list]\n    [*] Please add a controls page, or if there is one, place it somewhere in the games opions menu. It would make it much easier to find and make playing the game with a mouse and keyboard, a much more fulfilling experience\n\n    [*]When you open any menu using the new UI (Love it by the way), the mouse's starting position is near the top of the screen. This can prove to be a little disoreniting to players, at least it was for me. So possibly set the mouse's start position to the middle of the screen\n\n    [*]A mouse sensitivity slider would be lovely. \n[/list]\n\n", "timestamp_created": 1514134448, "timestamp_updated": 1514134448, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38625973": {"recommendationid": "38625973", "author": {"steamid": "76561198002553595", "num_games_owned": 38, "num_reviews": 3, "playtime_forever": 383, "playtime_last_two_weeks": 383, "last_played": 1514414668}, "language": "english", "review": "I know people will complain about 'another Minecraft clone', but that's largely dismissing what has been done to this game to make it a quality and unique iteration. The scripting and mods will put it over the top. Yes mods in MC fixed a lot of what was missing or wrong, but this brings it without the baggage. If you are a voxel fan, I would definitely pick it up. If you haven't played MC in a long while like me, just start here and don't look back.", "timestamp_created": 1514128711, "timestamp_updated": 1514128711, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38623922": {"recommendationid": "38623922", "author": {"steamid": "76561198199681329", "num_games_owned": 93, "num_reviews": 1, "playtime_forever": 86, "playtime_last_two_weeks": 86, "last_played": 1514635869}, "language": "english", "review": "Im going to say my honest opinions on the PC port on this game so hopefully some things can be fixed/work in a better way\n\nI've been playing Total Miner since 2012 and i love the game. I love it because i loved making maps and hosting them and to see people playing on a map i put time and effort into. I've been through days where challenge maps were popular to skilling maps now currently deathmatch maps. I also liked the challenges to do and in return you got an NPC.\n\nsuggestions:\nMe personally i dont like the new menu and im glad there is a feature to switch to the old menu in the game but i hate it because you have keep clicking it everytime you go to the menu. I think it would be great if it stayed on the old menu until you changed it back yourself instead of having to change it everytime you go to the menus. I would also love it if the shops went back to the old menu aswell. Another suggestion is a way to bind \"T\" or \"/\" as the text button instead of going to the menu all the time. I would also like a controls section in the menu so you can customise your controls because some people might not be happy with the default controls. Im not to sure if you can do this but i would be awesome to let people transfer their xbox 360 worlds over to PC.\n\nThings i like:\nIts still the good old total miner i love! I like how there is controller support for people who prefer using a controller. I like how you can atleast change your menu back to the old one. I like hoe the game runs i've ran into no crashes and everything runs fine i haven't had any random FPS drops or framerate issues. I love the addition of mod support! Even though there is no mods right now, there will defenitly be in the future/\n\nShould you buy it?????\nIf you love building maps and playing survival alone and just want to play this game because its awesome, you should get it, its just like the 360 version but without dig deep or multiplayer yet. But if you are the kind of person to explore online worlds, host online worlds, play survival with friends, play dig deep and/or try to unlock avatars, if i was you i would wait and buy this game later on when these features have been added.\n\nI feel like if the devs dont totally abondon this game like some other early access games and get it out of early access, this game might get some attention again like itt did in 2011/12.", "timestamp_created": 1514125144, "timestamp_updated": 1514125144, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.567270", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38622149": {"recommendationid": "38622149", "author": {"steamid": "76561197994097323", "num_games_owned": 178, "num_reviews": 20, "playtime_forever": 25, "playtime_last_two_weeks": 25, "last_played": 1514057775}, "language": "english", "review": "F I N A L L Y. \n\nBefore you cast this off as a Minecraft clone, though that was its original intention way back when, this game brings more to the table. Scripting, RPG elements such a skills and levelled mobs, and the PC port's UI is looking great. Can't wait to see this come out of Early Access. Haven't had much time to play since Christmas, but I easily have well over hundreds of hours on the 360 and I can't wait to do it again.", "timestamp_created": 1514122105, "timestamp_updated": 1514122105, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38620967": {"recommendationid": "38620967", "author": {"steamid": "76561198196266875", "num_games_owned": 58, "num_reviews": 2, "playtime_forever": 1972, "playtime_last_two_weeks": 1972, "last_played": 1514648582}, "language": "english", "review": "At first it may look taunting... But trust me, play it for a couple of days, learn how to script, learn all of the creative tools and this game will surely become a decade long addiction.", "timestamp_created": 1514120232, "timestamp_updated": 1514120232, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38618949": {"recommendationid": "38618949", "author": {"steamid": "76561198054620757", "num_games_owned": 193, "num_reviews": 20, "playtime_forever": 15, "playtime_last_two_weeks": 15, "last_played": 1514116413}, "language": "japanese", "review": "簡単に言うと、操作性の悪いマイクラ。", "timestamp_created": 1514116544, "timestamp_updated": 1514116544, "voted_up": false, "votes_up": 1, "votes_funny": 2, "weighted_vote_score": "0.252671", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38618447": {"recommendationid": "38618447", "author": {"steamid": "76561198112480301", "num_games_owned": 48, "num_reviews": 5, "playtime_forever": 1667, "playtime_last_two_weeks": 1667, "last_played": 1514663856}, "language": "english", "review": "Amazing game waited a long time but it was worth the wait loved this on  the xbox 360 so to be able to play it again on steam brougth back some notalgia for me 10/10 reccomended\nhats of Craig.", "timestamp_created": 1514115606, "timestamp_updated": 1514115606, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38618175": {"recommendationid": "38618175", "author": {"steamid": "76561198063582635", "num_games_owned": 364, "num_reviews": 42, "playtime_forever": 148, "playtime_last_two_weeks": 148, "last_played": 1514264585}, "language": "english", "review": "It's finally here!\nIn the time we had to wait, from the greenlighting a lot has happened, a long time went by\nbut it's here!\nTHis game is fantastic, I played the shit outta this game on the 360 and I'm excited to see one of my favourite 360 games slither it's fantastic way onto the PC\nI don't even know how to explain this game, it's great.\nGrab it.\n\nOHOHOH\nNo multiplayer YET, it's coming\nThe Flagship mode 'Dig Deep' is missing from the release version due to massive issues that Craig didn't want to force on us.\nthanks Craig", "timestamp_created": 1514115092, "timestamp_updated": 1514115092, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.474453", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38616590": {"recommendationid": "38616590", "author": {"steamid": "76561198056597308", "num_games_owned": 59, "num_reviews": 2, "playtime_forever": 207, "playtime_last_two_weeks": 207, "last_played": 1514111183}, "language": "english", "review": "This isn't skyrim, sadly no spasmic ragdolls.\n\nThere are, in my experience, no bugs... yet...", "timestamp_created": 1514112028, "timestamp_updated": 1514112028, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.543677", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38616129": {"recommendationid": "38616129", "author": {"steamid": "76561198154822360", "num_games_owned": 86, "num_reviews": 4, "playtime_forever": 59, "playtime_last_two_weeks": 59, "last_played": 1514362442}, "language": "english", "review": "It has been a great game ever since its release long ago on xbox.", "timestamp_created": 1514111007, "timestamp_updated": 1514111007, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38613461": {"recommendationid": "38613461", "author": {"steamid": "76561198069182268", "num_games_owned": 178, "num_reviews": 7, "playtime_forever": 20, "playtime_last_two_weeks": 20, "last_played": 1514160052}, "language": "english", "review": "This is by far the most nostalgic game i've played during my teenage years, so to be playing this game on my computer years later without hardware or software limitations has me feeling like life is care-free again. I re-bought this game on my computer to both support the creators and re-live my life as someone who hides from responsabilities and enjoys the current life they're apart of. Thank you for all your guys' efforts in releasing this game very much", "timestamp_created": 1514105572, "timestamp_updated": 1514105572, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38609164": {"recommendationid": "38609164", "author": {"steamid": "76561198152921774", "num_games_owned": 21, "num_reviews": 1, "playtime_forever": 97, "playtime_last_two_weeks": 97, "last_played": 1514327364}, "language": "english", "review": "Definately meets the nostalgia i had back in the day on the 360. Definately can't wait for the multi-player.", "timestamp_created": 1514096557, "timestamp_updated": 1514096557, "voted_up": true, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.636939", "comment_count": 0, "steam_purchase": true, "received_for_free": true, "written_during_early_access": true}, "38607799": {"recommendationid": "38607799", "author": {"steamid": "76561198024221300", "num_games_owned": 252, "num_reviews": 7, "playtime_forever": 26, "playtime_last_two_weeks": 26, "last_played": 1514093993}, "language": "english", "review": "Ok people you may think this is a minecraft clone thats bad but its far from being a clone its more then that. I played this way back on the 360 and i would play this more then minecraft. The game has in game coding thats very simple to learn you could litterly make that runescape clone youve allways wanted to make using it. The game on PC is far from complete but has all the features of the 360 version just without multiplayer but when multiplayer comes you will see far better game modes made using its code system that you never thought were possible.", "timestamp_created": 1514092960, "timestamp_updated": 1514092960, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.474453", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38607550": {"recommendationid": "38607550", "author": {"steamid": "76561198093803830", "num_games_owned": 52, "num_reviews": 2, "playtime_forever": 146, "playtime_last_two_weeks": 146, "last_played": 1514514969}, "language": "english", "review": "I'm going to be honest with you guys, I bought this game through the Steam app while in the bathroom.\n\nYes that's right, This game was so great on the Xbox 360, that when I found out it was finally released on the PC I pulled out the credit card right then and there, and got it.\n\nYou will not be disappointed. Buy this game.", "timestamp_created": 1514092320, "timestamp_updated": 1514092320, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38606649": {"recommendationid": "38606649", "author": {"steamid": "76561198180137270", "num_games_owned": 51, "num_reviews": 2, "playtime_forever": 10, "playtime_last_two_weeks": 10, "last_played": 1514596043}, "language": "english", "review": "The game is amazing, nosalgic and just overall an amazing game that i have many memories of. Although in its current state, i would not reccomend buying the game, it is just too confined curently.", "timestamp_created": 1514090003, "timestamp_updated": 1514090003, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38606142": {"recommendationid": "38606142", "author": {"steamid": "76561198081203543", "num_games_owned": 46, "num_reviews": 1, "playtime_forever": 136, "playtime_last_two_weeks": 136, "last_played": 1514451934}, "language": "english", "review": "This Review is based upon the polished version from the Xbox 360, and does NOT take into account any bugs or the lack of multiplayer in this current iteration of Total Miner Forge.  I played 2000+ hours on Xbox.\nTotal Miner Forge is one of my all-time favorite games, if not, my favorite.  \nI’m not a big creative guy, but as far as I’ve played, the creative tools are powerful and easy to use, and the selection of blocks far surpass other games in the same genre.  \nThe primary adventure game types (survival or dig deep) have given me some of the most exhilarating experiences I’ve ever had in my life in gaming.  It sounds odd, since this is an indie game with pretty much just a single guy working on the thick of it.  But the music, the mechanics, and the late nights spent trying just to get to the next layer or rock layer all blended together to make a great experience.  \nDig Deep goes thousands of blocks down through harder and harder rock types and provide endless caves to explore and loot to find.  There’s also an economy system in the adventure game types, which sounded off-putting at first, but once I played it for a while, I felt that it was necessary.  It increases the pace of the adventure without compromising the feel of it.  You could return from your long days in the deep mines with a large haul of gold doubloons and gems.  It draws strong influences from Runescape, such as skills, an economy, and technology.  \nIn my opinion, however: \nIf you’re a creative junky, this game is great alone and with friends.  \nIf you’re a survival junky, this game is not fun alone, but with friends, I can guarantee you will love it.  \nIt’s just my opinion, remember, take it with a grain of salt!\n", "timestamp_created": 1514088688, "timestamp_updated": 1514088688, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38605822": {"recommendationid": "38605822", "author": {"steamid": "76561198039927690", "num_games_owned": 231, "num_reviews": 3, "playtime_forever": 219, "playtime_last_two_weeks": 219, "last_played": 1514097668}, "language": "english", "review": "I forgot how many years ago I backed this game because it was my favorite indie game on the 360. Glad to see it finally on PC. YEET", "timestamp_created": 1514087843, "timestamp_updated": 1514087843, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38605650": {"recommendationid": "38605650", "author": {"steamid": "76561198098773046", "num_games_owned": 30, "num_reviews": 1, "playtime_forever": 42, "playtime_last_two_weeks": 42, "last_played": 1514274275}, "language": "english", "review": "This was me and my friends favorite indie game by far on the 360 so to see it on PC makes us happy to be able to play it again.", "timestamp_created": 1514087433, "timestamp_updated": 1514087433, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38605095": {"recommendationid": "38605095", "author": {"steamid": "76561198114655608", "num_games_owned": 1124, "num_reviews": 5, "playtime_forever": 241, "playtime_last_two_weeks": 241, "last_played": 1514424893}, "language": "english", "review": "I spent years waiting for this to come to PC, and I can say for the most part things were carried over nicely. But as of right now, there is no multiplayer, no deep dig, and I had a few bugs trying to get it running at 1080p as well. Some button prompts are still for the Xbox 360 controller, and because of this some features like the map is completely unusable. Still though, for what is here it is fun. In fact, the survival mode actually has far more features than the last time I played it. The new UI for the PC is quite nice, and it hints at built in mod support and scripts, which should make for some interesting multiplayer worlds once people far more creative than me get their hands on them. \n\nNow, people may ask: \"Why should I play this when I have minecraft?\"\n\nWell, the simple answer is this game isn't much like minecraft outside of creative. As Fortress Craft Evolved is automation machine management simulator in the vein of Factorio, Total Miner is an exploration game in the vein of Terraria. While the gamplay is inarguably not as smooth as either Minecraft, the game simply has a lot going for it to make up for that. A real sense of progression, a market economy shop system, skill progression, and much, much more. If you want to simply write this off as a Minecraft clone that's fine, but you'd only be doing yourself a diservice by ignoring what I'm sure, once complete, will be a fantastic experience. \n\nAs of now though, I would say unless you're a hardcore fan wait a few months until the game is feature and bug complete to pick it up.", "timestamp_created": 1514086039, "timestamp_updated": 1514086039, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.594300", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38605048": {"recommendationid": "38605048", "author": {"steamid": "76561198119511428", "num_games_owned": 107, "num_reviews": 8, "playtime_forever": 92, "playtime_last_two_weeks": 92, "last_played": 1514251550}, "language": "english", "review": "this is literally the best game\nthat has ever been made.\n\ni used to play this on the xbox 360, best indie game.", "timestamp_created": 1514085933, "timestamp_updated": 1514085933, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.492308", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38603799": {"recommendationid": "38603799", "author": {"steamid": "76561198114145035", "num_games_owned": 18, "num_reviews": 1, "playtime_forever": 370, "playtime_last_two_weeks": 370, "last_played": 1514350783}, "language": "english", "review": "Thank you so much for getting this on PC. People on the fence about this game let me tell you it is not minecraft. This game is so much better in my opinion. Just read through what this game has in its release. And the dev is involved with the community and is pretty dang good about getting updates done. Looking forward to when multiplayer and Dig Deep gets done.", "timestamp_created": 1514082568, "timestamp_updated": 1514082568, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38603773": {"recommendationid": "38603773", "author": {"steamid": "76561198334232738", "num_games_owned": 8, "num_reviews": 1, "playtime_forever": 321, "playtime_last_two_weeks": 321, "last_played": 1514258537}, "language": "english", "review": "I totally recommend people to get this game because of how the console version was amazing. I remember first playing this when it was release and it was much better than minecraft because there was more stuff you can do and then after update 1.8 they added script whih opened a whole new type of content to the game which made people build RPGs, Deathmatches, and many more map ideas. I rate this 10/10. there may still be some bugs there and again but remember this is early access.", "timestamp_created": 1514082521, "timestamp_updated": 1514082521, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38602977": {"recommendationid": "38602977", "author": {"steamid": "76561198229655396", "num_games_owned": 44, "num_reviews": 15, "playtime_forever": 188, "playtime_last_two_weeks": 188, "last_played": 1514151526}, "language": "english", "review": "My childhood, Thx, I can't I need to buy it ahhhhh yes I need it. best game ever 10/10 IGN Screw it best ever better than any game!", "timestamp_created": 1514080383, "timestamp_updated": 1514080383, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38602592": {"recommendationid": "38602592", "author": {"steamid": "76561198342018159", "num_games_owned": 17, "num_reviews": 1, "playtime_forever": 758, "playtime_last_two_weeks": 758, "last_played": 1514152783}, "language": "english", "review": "Thank God for winter break, now I have 3 uninterrupted weeks to play the fuck out of this game.", "timestamp_created": 1514079391, "timestamp_updated": 1514079391, "voted_up": true, "votes_up": 7, "votes_funny": 2, "weighted_vote_score": "0.539175", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38601957": {"recommendationid": "38601957", "author": {"steamid": "76561198113664600", "num_games_owned": 27, "num_reviews": 2, "playtime_forever": 196, "playtime_last_two_weeks": 196, "last_played": 1514483910}, "language": "english", "review": "Great game. Played it on the Xbox 360 for hours on end. Can't wait for multiplayer.", "timestamp_created": 1514077801, "timestamp_updated": 1514077801, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38601018": {"recommendationid": "38601018", "author": {"steamid": "76561198277235303", "num_games_owned": 14, "num_reviews": 2, "playtime_forever": 755, "playtime_last_two_weeks": 757, "last_played": 1514675305}, "language": "english", "review": "This game is the best. It's a lot of fun. It gets looked down as a clone but really, it's not. It's a very unique game and has its own system. I can't wait till multiplayer and Dig Deep comes out! I used to play this all the time on my 360, by myself, with friends, and with my family. Everyone that has played with me enjoys the game. There are a lot of things to explore! Creative Mode is very fun and easy to use and you can make a lot of fun things happen with scripting. This game was my childhood, and I'm having a lot of fun again. The only reason I'll use my laptop again is because of this game. Best indie game, hands down!", "timestamp_created": 1514075216, "timestamp_updated": 1514075216, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.493088", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38600113": {"recommendationid": "38600113", "author": {"steamid": "76561198110620793", "num_games_owned": 93, "num_reviews": 2, "playtime_forever": 14, "playtime_last_two_weeks": 14, "last_played": 1514072987}, "language": "english", "review": "Staring 2018 off right", "timestamp_created": 1514072988, "timestamp_updated": 1514072988, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38599955": {"recommendationid": "38599955", "author": {"steamid": "76561198073034390", "num_games_owned": 268, "num_reviews": 19, "playtime_forever": 140, "playtime_last_two_weeks": 140, "last_played": 1514060271}, "language": "english", "review": "8.5/10 - as of its day one release. \n\nOh man, the nostolgia that comes from playing this game. \n\nWhen I found out that this game was coming to PC I was thrilled and concerned at the same time. This game is known for a insanely long development cycle and it shows even within the community. 1.8 on the Xbox took a serious amount of time to get done. Nonetheless, this game is amazing port to PC and has for me personally been highly anticipated. \n\nPros:\n+This is by far your best minecraft clone \n+More indepth features than similar games\n+Community is a quite positive community\n+Consistent development\n+From what I've seen day one it is a stable release. \n+Mods\n+Scripting\n+Texture mods built into the game\n\nCons:\n-Devlopment cycle is long.. really long. (This may be changed due to the different systems that are in place from microsoft to steam.)\n-Minecraft clone \n\n\nSummary:\nIf you enjoy Minecraft, you will enjoy Total Miner as this game incorporates some of what Minecraft has to offer but with its own flavor. The game itself its ok to look at but gets enhanced by the texture mods that are actually built into the game along with the dedicated supportive community that it has. The development cycles while they are long and can be frustrating to some people are quite expansive on the changes and improvments. Again for example,  the 1.8 update on the xbox took years to complete but in the end the game was not the game that it originally derived from. I am glad Studio Forge was dedicated on giving thier community what they desperately asked for a port that we all can enjoy.   \n", "timestamp_created": 1514072589, "timestamp_updated": 1514072589, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.516908", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38598650": {"recommendationid": "38598650", "author": {"steamid": "76561198275485230", "num_games_owned": 22, "num_reviews": 1, "playtime_forever": 202, "playtime_last_two_weeks": 202, "last_played": 1514147046}, "language": "english", "review": "The game is almost exactly like how it was on Xbox 360, Even thought there's alot of Items and block missing, it's still very playable, even if there's various glitches or bugs that can be seen,\nand it's kinda funny to see the enemies fighting each others for no reason at all\nBut there's something really annoying in the pause menu, the scrolling system is totally bad\n\nI recommand this game if peoples loves Minecraft and survival\n", "timestamp_created": 1514069651, "timestamp_updated": 1514069651, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.497925", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38598639": {"recommendationid": "38598639", "author": {"steamid": "76561198069103560", "num_games_owned": 304, "num_reviews": 5, "playtime_forever": 86, "playtime_last_two_weeks": 86, "last_played": 1514506361}, "language": "english", "review": "It was one of the best indie games on the 360 and now,it's on PC.Buy it,you won't regret it.", "timestamp_created": 1514069638, "timestamp_updated": 1514069638, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38597862": {"recommendationid": "38597862", "author": {"steamid": "76561198316890876", "num_games_owned": 27, "num_reviews": 1, "playtime_forever": 8, "playtime_last_two_weeks": 8, "last_played": 1514067857}, "language": "english", "review": "I love this game, but I think the menu needs to be worked on. I also think the controls need worked on. Instead of having just scrollwheel, there needs to be a scrollwheeldown and a scrollwheelup. Other than that I love this game and can't wait for the full game and multiplayer.", "timestamp_created": 1514068146, "timestamp_updated": 1514068146, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38596853": {"recommendationid": "38596853", "author": {"steamid": "76561198282270520", "num_games_owned": 56, "num_reviews": 1, "playtime_forever": 4220, "playtime_last_two_weeks": 4220, "last_played": 1514699882}, "language": "english", "review": "11/10\nThis game has been with me back in 2011 when it first released.\nThe community is wonderful, the game is wonderful, and the developer, Craig, is wonderful!\nMost people would look at this game first glance and say it's a minecraft ripoff, but if you ever play the game fully, or get a chance to see community creations, you'll see it's more than that, some people, including myself, like to label it as a game engine, because it is... has a built in scripting language, and also it allows usage of mods!\nI can't wait for what the future has for this game!", "timestamp_created": 1514066097, "timestamp_updated": 1514066097, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38596844": {"recommendationid": "38596844", "author": {"steamid": "76561198164919879", "num_games_owned": 11, "num_reviews": 3, "playtime_forever": 2634, "playtime_last_two_weeks": 26, "last_played": 1514091031}, "language": "english", "review": "Pure Freedom", "timestamp_created": 1514066085, "timestamp_updated": 1514066085, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "38596474": {"recommendationid": "38596474", "author": {"steamid": "76561198080804256", "num_games_owned": 71, "num_reviews": 10, "playtime_forever": 868, "playtime_last_two_weeks": 868, "last_played": 1514333515}, "language": "english", "review": "10/10. This game was so fun to play on Xbox 360 and it's even better on PC. I 150% recommend this game to anyone who's looking for a fun and exciting yet relaxing game.", "timestamp_created": 1514065315, "timestamp_updated": 1514065315, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523622", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38595866": {"recommendationid": "38595866", "author": {"steamid": "76561198285147943", "num_games_owned": 63, "num_reviews": 2, "playtime_forever": 1075, "playtime_last_two_weeks": 1079, "last_played": 1514689696}, "language": "english", "review": "as this game is new there are alot of things wrong its crashed within the first 30s of playing but affter that its working fine and yes its like the xbox ver but its still fun to play and more updates are on the way i love it its still better then minecraft", "timestamp_created": 1514064181, "timestamp_updated": 1514064181, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501920", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38594824": {"recommendationid": "38594824", "author": {"steamid": "76561198137515792", "num_games_owned": 103, "num_reviews": 2, "playtime_forever": 8712, "playtime_last_two_weeks": 56, "last_played": 1514619005}, "language": "english", "review": "Excellent sandbox game with tons of power in the hands of the player. This game's creative tools were designed to substitute unintuitive game design from other genre leaders. Things like mass clear/fill options, custom spawn points and player zones, and infinitely customizable scripts and texture packs are all included in the base game. \n\nAs of right now the game is limited to just solo play, but as soon as multiplayer releases the replayability and sense of wonder and discovery will never end. It didn't on xbox and certainly won't on PC.\n\nAlso the developer Craig is a really stand up guy and takes a very active role in reaching out to the community to see what they think about features and patches.", "timestamp_created": 1514062244, "timestamp_updated": 1514062244, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.478107", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "38594424": {"recommendationid": "38594424", "author": {"steamid": "76561198107685394", "num_games_owned": 31, "num_reviews": 1, "playtime_forever": 421, "playtime_last_two_weeks": 421, "last_played": 1514546154}, "language": "english", "review": "Total Miner has been in my life since 2011, I grew up on it. Now, since that it is on PC, it makes me very happy to see it being worked on across the community of Total Miner. To me, it is better than Minecraft, and has so much to do. Even with it being early access, I would so recommend buying it, even though there is no multiplayer (yet).\n\nI enjoy the skills you have to level up to become stronger, and be able to do more things, with the ability to disable it of course. I remember competing to try to be the highest defense or mining level on the skill leaderboards. Now that it's here and when it becomes multiplayer, I will compete with others on the skill boards.\n\nAlso, with the script blocks, I enjoyed creating a \"Prison\" type of server in this game, where you mine to increase how much money you make, and to get better tools and fight others in lower levels of the mines. Now I can recreate that with more space to add even more mines. \n\n10/10 So Recommend to anyone.", "timestamp_created": 1514061510, "timestamp_updated": 1514061510, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501920", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38593260": {"recommendationid": "38593260", "author": {"steamid": "76561198065988490", "num_games_owned": 210, "num_reviews": 4, "playtime_forever": 536, "playtime_last_two_weeks": 536, "last_played": 1514055857}, "language": "english", "review": "Total Miner is more than just a Minecraft clone. It brings unique aspects in such as the shop, and the Dig Deep gametype which forces you to find blueprints to advance. Total Miner is a lot of fun with friends, and you can do a lot in the world if you work together. Roleplaying is quite easy in this game due to the economy system. I definitely recommend this game to anyone, even for full price.", "timestamp_created": 1514059435, "timestamp_updated": 1514059435, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.525552", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38591825": {"recommendationid": "38591825", "author": {"steamid": "76561198184214910", "num_games_owned": 30, "num_reviews": 1, "playtime_forever": 1308, "playtime_last_two_weeks": 1308, "last_played": 1514579795}, "language": "english", "review": "Fantastic game, can't wait for the full version!", "timestamp_created": 1514056926, "timestamp_updated": 1514056926, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501920", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38590494": {"recommendationid": "38590494", "author": {"steamid": "76561198035090998", "num_games_owned": 15, "num_reviews": 2, "playtime_forever": 224, "playtime_last_two_weeks": 224, "last_played": 1514686205}, "language": "english", "review": "This Xbox 360 indie game classic has been one of my favorites. I've played this game since the  year it debuted in 2011 and seen it grow along with other fellow players. So obviously I'm just as excited for a PC release since the indie games program/support on Xbox 360 has ended not too long ago.\nTotal Miner pretty much has almost all base features besides mutiplayer or digdeep mode, but other than that it feels just as I played it on the 360 except that it runs a lot more better.\n\nHere's what to expect performance wise\n-Super fast loading times\n-GLORIOUS FPS\n-MOAR PARTICLES\n-Wayyyyyy shorter waiting time for land/buildings to pop in\n-Smooth scripting performance\n-Higher resolution support\n\nAlso the new menu design is pretty neat, it's nice to have items all organized. For the veterans who love the old menu style, yes there's an option for that thankfully.\n\nAll in all Total Miner is a decent indie game that I'd recommend for those who are looking to bring out their imagination and create complex worlds in voxel form. With many customization options, scripting capabillities, a variety of items, and powerful creative tools, you can create fantastic worlds whether it'd be an RPG, horror map, art showcase, massive cities, challenges etc.", "timestamp_created": 1514054799, "timestamp_updated": 1514054890, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.501920", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38590444": {"recommendationid": "38590444", "author": {"steamid": "76561198162995434", "num_games_owned": 146, "num_reviews": 13, "playtime_forever": 542, "playtime_last_two_weeks": 542, "last_played": 1514363704}, "language": "english", "review": "Love this game", "timestamp_created": 1514054731, "timestamp_updated": 1514054731, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.501920", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38590373": {"recommendationid": "38590373", "author": {"steamid": "76561198158523447", "num_games_owned": 58, "num_reviews": 2, "playtime_forever": 165, "playtime_last_two_weeks": 165, "last_played": 1514435383}, "language": "english", "review": "This game brings back memeries of the olden days of total miner on xbox. When minecraft wasn't a thing yet this game stood the test of time and still hold out its popularity. The game itself has features that minecraft doesn't come by default. The features of scripts is too confusing for me yet i might not learn it but give this game a try.", "timestamp_created": 1514054593, "timestamp_updated": 1514054593, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.501920", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38589854": {"recommendationid": "38589854", "author": {"steamid": "76561198271793696", "num_games_owned": 145, "num_reviews": 6, "playtime_forever": 39, "playtime_last_two_weeks": 39, "last_played": 1514064469}, "language": "english", "review": "[h1] Much Better On Xbox 360 [/h1]\n\nI was looking for games to use and abuse the steam winter sale and randomly come across this game. I felt so nolgastic as this was the game I would play when I didn't have a PC nor a potato of a laptop so I couldn't play Minecraft. When this game released on the 360 Minecraft was getting increasingly popular but wasn't available on console yet. This game was a fantasic subsitute. I haven't played much of the PC version yet so I am going to base this review of what I have played and my past expierence on the 360.\n\nFirstly, the cons. Dig Deep is not available yet but will be included in a future update. Being honest I can not remember what that is, therefore not very bothered. The controls are extremely awkward in my opinion so you have to do a lot of tweaking in the menus. Which are also very awkward. When you move your cursor the menu moves postion which is just not needed and is a terrible feature. Don't know if it does that with a controller. Biggest con, no multiplayer yet, multiplayer was the best thing about the game on console. You could play many different challenge maps and see what the community had built, therefore, annoying that is not included as of yet.\n\nNow, the postives. If you like a creative sandbox games, the creative mode is great for you. Despite a lack of blocks at the moment, there is a block called a \"Marker\". It allows you to quickly clear or fill areas which means building is much quicker than on Minecraft. You can also spawn NPC's. On console I am pretty sure they stay still but for those making a city it's nice to have people in shops etc. \n\nBear in mind this game is in early access. It is very nolgastic for me and the community that plays it. Should get better and if you don't buy it now, it is worth keeping an eye on.", "timestamp_created": 1514053716, "timestamp_updated": 1514053716, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.525552", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38589653": {"recommendationid": "38589653", "author": {"steamid": "76561198131768032", "num_games_owned": 10, "num_reviews": 1, "playtime_forever": 26, "playtime_last_two_weeks": 26, "last_played": 1514118633}, "language": "english", "review": "Great game. Has come a long way since 2011. Makes me glad the world didn't end in 2012. But still no bears, God Dammit. 9 steps forward, one step back", "timestamp_created": 1514053335, "timestamp_updated": 1514053335, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38589266": {"recommendationid": "38589266", "author": {"steamid": "76561198130286506", "num_games_owned": 24, "num_reviews": 5, "playtime_forever": 417, "playtime_last_two_weeks": 417, "last_played": 1514324547}, "language": "english", "review": "IT'S FINALLY HERE (° ͜ʖ°)", "timestamp_created": 1514052740, "timestamp_updated": 1514052740, "voted_up": true, "votes_up": 11, "votes_funny": 3, "weighted_vote_score": "0.559904", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38588077": {"recommendationid": "38588077", "author": {"steamid": "76561198150234447", "num_games_owned": 119, "num_reviews": 7, "playtime_forever": 109, "playtime_last_two_weeks": 109, "last_played": 1514216995}, "language": "english", "review": "Just how I remember it on the xbox 360, can't wait to see what the updates bring to us.", "timestamp_created": 1514050886, "timestamp_updated": 1514050886, "voted_up": true, "votes_up": 21, "votes_funny": 1, "weighted_vote_score": "0.631559", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38587905": {"recommendationid": "38587905", "author": {"steamid": "76561198066132907", "num_games_owned": 225, "num_reviews": 2, "playtime_forever": 152, "playtime_last_two_weeks": 152, "last_played": 1514391200}, "language": "english", "review": "Its about time the PC port got here. Even if it still isnt totally finished yet.\n\nHonestly I wish I didnt have such rose tinted glasses for this game. Absolutely loved playing this back on the 360. My friends and I spent countlesss nights one this game before minecraft dropped on the system. And even when that happend, we would continually jump back and forth between the games because there was just so much that seperated the games from each other.\n\nHowever, it has been years since I last played the game and certainly a lot has changed already. But since its still such in early access and missing a lot of features at the moment, I find it very hard to reccomend to anyone outside of the community that is already there for the game. However when the train gets rolling again and its back in full steam, I will glady spread this gem among friends.", "timestamp_created": 1514050638, "timestamp_updated": 1514050638, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.531479", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38587318": {"recommendationid": "38587318", "author": {"steamid": "76561198119593857", "num_games_owned": 96, "num_reviews": 1, "playtime_forever": 238, "playtime_last_two_weeks": 238, "last_played": 1514232558}, "language": "english", "review": "This game is great already for being early access, I played this game on the 360 when it came out and i can say that since then it has gone a long way. the game right now is good and its missing some of its key functions. but being a early access game you can expect it to be better later on.", "timestamp_created": 1514049688, "timestamp_updated": 1514049688, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38586506": {"recommendationid": "38586506", "author": {"steamid": "76561198140711708", "num_games_owned": 53, "num_reviews": 7, "playtime_forever": 981, "playtime_last_two_weeks": 981, "last_played": 1514489785}, "language": "english", "review": "Been with this game since release in 2011...\nJust the best game ever.", "timestamp_created": 1514048370, "timestamp_updated": 1514048370, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38586165": {"recommendationid": "38586165", "author": {"steamid": "76561198146983597", "num_games_owned": 77, "num_reviews": 54, "playtime_forever": 1155, "playtime_last_two_weeks": 1155, "last_played": 1514752076}, "language": "french", "review": "... méyeur jeu sandbox jamé crée\n\n\n\n", "timestamp_created": 1514047856, "timestamp_updated": 1514047856, "voted_up": true, "votes_up": 1, "votes_funny": 5, "weighted_vote_score": "0.374208", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38585939": {"recommendationid": "38585939", "author": {"steamid": "76561198353306178", "num_games_owned": 14, "num_reviews": 11, "playtime_forever": 462, "playtime_last_two_weeks": 462, "last_played": 1514217517}, "language": "english", "review": "Going to start on my challenge map.", "timestamp_created": 1514047499, "timestamp_updated": 1514047499, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38585203": {"recommendationid": "38585203", "author": {"steamid": "76561198042396044", "num_games_owned": 412, "num_reviews": 8, "playtime_forever": 17, "playtime_last_two_weeks": 17, "last_played": 1514045626}, "language": "english", "review": "I played a lot of this back on my 360 years ago, and it was basically the go to Minecraft-like game before Minecraft was put on consoles. Too be completely honest, I didnt even buy this to play it. I just bought it out of respect for the game and devs.\nHowever, I did play a little bit and I can say that the game runs like soggy diapers, M+KB controls are weird, and the world doesnt load half of the time. None of this really bothers me because, again, I didn't really buy the game to play it.\nHowever I still recommend it. It's janky, dumb, and reallly buggy, but its a lot of fun with friends and did some really cool things for it's time that Minecraft still has yet to do/will never do.\n\nOh, and the old spider sounds are still gone. Thank God.", "timestamp_created": 1514046440, "timestamp_updated": 1514046440, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.491620", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38584517": {"recommendationid": "38584517", "author": {"steamid": "76561198171489987", "num_games_owned": 80, "num_reviews": 9, "playtime_forever": 5, "playtime_last_two_weeks": 5, "last_played": 1514045369}, "language": "english", "review": "Best game ever made.", "timestamp_created": 1514045454, "timestamp_updated": 1514045454, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.480000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38583614": {"recommendationid": "38583614", "author": {"steamid": "76561198150754658", "num_games_owned": 30, "num_reviews": 5, "playtime_forever": 28, "playtime_last_two_weeks": 28, "last_played": 1514043937}, "language": "english", "review": "Brings me back to the XBOX 360 days.", "timestamp_created": 1514044025, "timestamp_updated": 1514044025, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38583082": {"recommendationid": "38583082", "author": {"steamid": "76561198264252198", "num_games_owned": 25, "num_reviews": 1, "playtime_forever": 8, "playtime_last_two_weeks": 8, "last_played": 1514043107}, "language": "english", "review": "Can i have an estimate until how many days it will take to have multiplayer", "timestamp_created": 1514043234, "timestamp_updated": 1514043234, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.479680", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38583061": {"recommendationid": "38583061", "author": {"steamid": "76561198063229662", "num_games_owned": 169, "num_reviews": 2, "playtime_forever": 48, "playtime_last_two_weeks": 48, "last_played": 1514504416}, "language": "french", "review": "J'attendais sa venue sur PC avec impatience! J'ai retrouvé la même ambiance que sur la console mais en 1000 fois mieux!\nSuper cadeau à offrir et à recevoir!", "timestamp_created": 1514043198, "timestamp_updated": 1514043198, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38582206": {"recommendationid": "38582206", "author": {"steamid": "76561198271765833", "num_games_owned": 8, "num_reviews": 1, "playtime_forever": 6690, "playtime_last_two_weeks": 6690, "last_played": 1514740935}, "language": "english", "review": "Great start so far, just needs multiplayer ASAP, then I would play way more!", "timestamp_created": 1514042032, "timestamp_updated": 1514042032, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38582036": {"recommendationid": "38582036", "author": {"steamid": "76561198075787251", "num_games_owned": 143, "num_reviews": 38, "playtime_forever": 134, "playtime_last_two_weeks": 134, "last_played": 1514315504}, "language": "english", "review": "It's a great game, but in its current state on steam it is BARELY, if that, playable. If you are a fan of the game or think it's worth a try buy it, but if you want a functional full game, wait until it's further along and multiplayer is out. For me I can't even play it right now, my favorite game mode isn't even available yet (dig deep).", "timestamp_created": 1514041787, "timestamp_updated": 1514041787, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.488131", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38581506": {"recommendationid": "38581506", "author": {"steamid": "76561198123395653", "num_games_owned": 162, "num_reviews": 14, "playtime_forever": 47, "playtime_last_two_weeks": 47, "last_played": 1514162778}, "language": "english", "review": "I'm so fucking happy this gem finally hit PC. Back on Xbox 360, alot of people played this game as a substitute since we never thought we'd see Minecraft on the 360 and honestly? After having played both, I can definitely tell you that Total Miner isn't just some poor man's substitute for Minecraft, nah. Instead, it's it own game and that's one of the things that makes it so special. What's really cool is it has a shop system and overall more RPG elements and now you're telling me this is even gonna have mod support? Absolutely amazing. I think everyone who hasn't or has played Minecraft should definitely try this out to see what I mean.\n\nSidenote: The spiders will give you PTSD", "timestamp_created": 1514040960, "timestamp_updated": 1514040960, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.480000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38581037": {"recommendationid": "38581037", "author": {"steamid": "76561198398752272", "num_games_owned": 31, "num_reviews": 15, "playtime_forever": 1677, "playtime_last_two_weeks": 1677, "last_played": 1514643492}, "language": "english", "review": "Total Miner is a great game!\n\nPros:\nHundreds of items.\nBuilt in scripting.\nIt allows you to create RPGs!\nFour different fun to play modes.\nGreat community.\nConstant updates.\nMany other features that make this a great game.\n\nCons:\nNone.\n\nRemember this is still new to PC as i write this review, make sure to report any bugs, this helps the developers fix them.", "timestamp_created": 1514040249, "timestamp_updated": 1514040249, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.487700", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38579861": {"recommendationid": "38579861", "author": {"steamid": "76561198371161425", "num_games_owned": 15, "num_reviews": 5, "playtime_forever": 1251, "playtime_last_two_weeks": 1251, "last_played": 1514750575}, "language": "english", "review": "Yeah boiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiii", "timestamp_created": 1514038532, "timestamp_updated": 1514038532, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.459519", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38578586": {"recommendationid": "38578586", "author": {"steamid": "76561198274305847", "num_games_owned": 36, "num_reviews": 2, "playtime_forever": 563, "playtime_last_two_weeks": 563, "last_played": 1514693625}, "language": "english", "review": "Seems great :), been playing Total Miner for many years, I've noticed there's a tiny amount of input lag (nothing too major, but its same with controller on right thumbstick), also the craft bench, if you use controller and press RT it registers as A (unlike on 360 where it just scrolls a section", "timestamp_created": 1514036601, "timestamp_updated": 1514036658, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38577064": {"recommendationid": "38577064", "author": {"steamid": "76561198132390897", "num_games_owned": 160, "num_reviews": 8, "playtime_forever": 499, "playtime_last_two_weeks": 499, "last_played": 1514534595}, "language": "english", "review": "10/10 add dig deep and multiplayer before i die", "timestamp_created": 1514034346, "timestamp_updated": 1514034346, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38576105": {"recommendationid": "38576105", "author": {"steamid": "76561198203863176", "num_games_owned": 12, "num_reviews": 2, "playtime_forever": 48, "playtime_last_two_weeks": 48, "last_played": 1514099285}, "language": "english", "review": "If u played it on the 360, u will love this.\nSadly there is no multiplayer and dig deep in this early access yet.\nGreat game either ways:)\nNeed my Elven Bow and Ten League Boots....", "timestamp_created": 1514032899, "timestamp_updated": 1514032899, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38575844": {"recommendationid": "38575844", "author": {"steamid": "76561198312727107", "num_games_owned": 23, "num_reviews": 3, "playtime_forever": 3508, "playtime_last_two_weeks": 3508, "last_played": 1514390164}, "language": "english", "review": "This is hands down the best game i have ever played through out my time playing games! I am so thankfull that it has been released for pc and i cant wait for multiplayer!", "timestamp_created": 1514032486, "timestamp_updated": 1514032486, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38575615": {"recommendationid": "38575615", "author": {"steamid": "76561198117975774", "num_games_owned": 44, "num_reviews": 2, "playtime_forever": 158, "playtime_last_two_weeks": 158, "last_played": 1514704472}, "language": "english", "review": "This game is good for a very early access release. When Dig Deep is added to the game, and contextual things are fixed (Some avatars description for unlocking them still require you to do something over \"Xbox Live\"), I think it will become a much more playable game. Also the mouse movement needs a little work, so I resorted to my xbox controller, but that wouldn't be too bad to improve.", "timestamp_created": 1514032140, "timestamp_updated": 1514032140, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38574733": {"recommendationid": "38574733", "author": {"steamid": "76561198296043876", "num_games_owned": 35, "num_reviews": 6, "playtime_forever": 174, "playtime_last_two_weeks": 174, "last_played": 1514394642}, "language": "english", "review": "The memorys from years ago playing this game with my friends and buidling tiny houses then turning that into giant citys with markets and joining amazing servers with 100 block high images of zues i will never forget please let this game be on steam i beg and keep it going :D\n", "timestamp_created": 1514030711, "timestamp_updated": 1514030711, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.503931", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38574330": {"recommendationid": "38574330", "author": {"steamid": "76561198110503307", "num_games_owned": 37, "num_reviews": 2, "playtime_forever": 953, "playtime_last_two_weeks": 953, "last_played": 1514240793}, "language": "english", "review": "Amazing game, played it for countless hours on the Xbox 360 and had a huge multiplayer server which lots of people enjoyed every day. Definetely worth a shot, the scripting system allows for a lot of diversity with custom maps and minigames such as hunger games. Worth the wait and the money!", "timestamp_created": 1514030048, "timestamp_updated": 1514030048, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38574263": {"recommendationid": "38574263", "author": {"steamid": "76561198086507191", "num_games_owned": 256, "num_reviews": 13, "playtime_forever": 241, "playtime_last_two_weeks": 241, "last_played": 1514755373}, "language": "english", "review": "Great game from my middle school days on Xbox", "timestamp_created": 1514029924, "timestamp_updated": 1514029924, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38573474": {"recommendationid": "38573474", "author": {"steamid": "76561198354221331", "num_games_owned": 24, "num_reviews": 1, "playtime_forever": 861, "playtime_last_two_weeks": 861, "last_played": 1514260963}, "language": "english", "review": "The game has most of the features that it had on the 360, and the unadded ones are in the works, not to mention there are a few bugs; it is early access afterall. I still think that the game is worth its price, especially with the first-week sale.", "timestamp_created": 1514028643, "timestamp_updated": 1514028643, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38573198": {"recommendationid": "38573198", "author": {"steamid": "76561198062127738", "num_games_owned": 323, "num_reviews": 13, "playtime_forever": 61, "playtime_last_two_weeks": 61, "last_played": 1514489114}, "language": "english", "review": "I played this game on the 360 before minecraft. Playing minecraft after was a step down for me. That being said, i cannot recommend this game in its current early access state so do wait for some updates.", "timestamp_created": 1514028193, "timestamp_updated": 1514028193, "voted_up": true, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.546370", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38572796": {"recommendationid": "38572796", "author": {"steamid": "76561198119762110", "num_games_owned": 129, "num_reviews": 5, "playtime_forever": 89, "playtime_last_two_weeks": 89, "last_played": 1514170570}, "language": "english", "review": "Disclaimer:\nThe last time I played this game was on a 360 in 2013-2014 so my views on the current version of the game could be biased towards earlier versions of the game. \n\nWith that said, however, this game still holds a really special place with me and I would recommend this game without a doubt. Glad to see it finally on PC!", "timestamp_created": 1514027454, "timestamp_updated": 1514027454, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38572480": {"recommendationid": "38572480", "author": {"steamid": "76561198107961644", "num_games_owned": 30, "num_reviews": 2, "playtime_forever": 179, "playtime_last_two_weeks": 179, "last_played": 1514061196}, "language": "english", "review": "One of the best indie games. Nostalgia factor is off the charts as this game was literally the most fun game to play with friends on the 360. 10/10.", "timestamp_created": 1514026929, "timestamp_updated": 1514026929, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.563406", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38571904": {"recommendationid": "38571904", "author": {"steamid": "76561198055672922", "num_games_owned": 111, "num_reviews": 18, "playtime_forever": 23, "playtime_last_two_weeks": 23, "last_played": 1514025925}, "language": "english", "review": "I'm already like 3 seconds in and I've already witnessed it's greatness.", "timestamp_created": 1514025983, "timestamp_updated": 1514025990, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38571768": {"recommendationid": "38571768", "author": {"steamid": "76561198210944639", "num_games_owned": 53, "num_reviews": 3, "playtime_forever": 47, "playtime_last_two_weeks": 47, "last_played": 1514025358}, "language": "english", "review": "Simply a classic.\n\nI had played this on the Xbox 360 for hours, but having it on the pc is so much nicer.\nFor a classic the game is great just like how it was on the Xbox.\n\nFor those looking for a great old game which will have lots of involvement with the devs, this is easily the game. Especially when multiplayer is released, it will make it 10x better.\n\n------------------------------------------------------------------------------------------------------------------------------\n\nBut there are some bugs and stuff, this is probably due to porting it from xbox. As when in interfaces there are always controller keybinds there instead of keyboard keybinds which leaves me stuck in the interface.\n\nI dont remember the enemys at night attacking each other, but its fun to watch them attack each other and sweep the loot off the ground. Mainly its just interfaces as they seem to switch from old ones to new ones. And when in the settings mode for graphics and scripts and things it seems to like to move when doing it which is a pain.\n\nBut great game and a good game comes with bugs so im not to bothered :)", "timestamp_created": 1514025753, "timestamp_updated": 1514025753, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38571488": {"recommendationid": "38571488", "author": {"steamid": "76561198129098150", "num_games_owned": 438, "num_reviews": 15, "playtime_forever": 112, "playtime_last_two_weeks": 112, "last_played": 1514092955}, "language": "english", "review": "Total Miner: (Forge) \n12/23/2017\n\nTotal Miner has been an original Xbox Live Indie Game since 2011, and has actually been around from before Minecraft was released for the consoles, starting with the Xbox 360.\n\nAt $3, this was the second highest rated XBLIG Title of All time, and they even discounted it on Release week when it coincided with the Steam Winter Sale.\n\nTotal Miner is overall a very good game in itself, if you enjoy RPG's, simplistic graphics, Minecraft type games such as Terraria or others, and it does well on making its own mark.\n\nWith a different art style, its own texture packs built in (which was a difference from Console Minecraft at the time),\ninteresting dual wielding features \n(which are significantly better then the way Minecraft is trying to introduce it as of the later updates)\nand the concept of collecting item Blueprints in the Dig Deep mode to get as deep as possible, along with all the player models, earned skins through Achievements in game, other ores and mobs and Obsidian teleporters, just stuff that made Total Miner stand out differently from not only Minecraft but all the other awful \nMinecraft type games that were coming out to leech on the success, such as Castleminer and all that nonsense.\n\nThis game was my childhood, I got it when it came out on Xbox 360 when I had such a weak early 2000's PC, that it couldn't run Minecraft above 10fps, and to this day I'll still play it.\n\n(In case anyone is wondering on release day, Dig Deep Mode is not Available yet\nMultiplayer will be added later on\nand to get 1080p Fullscreen you must go in game first, then turn it all on in Graphics settings)\n\nTL;DR\nIf you like Minecraft-style games, Indie games, don't want to spend full price on MC, knew about this game or XBLIG before and/or just like the fact that its run through Steam, I recommend buying this game.\n\nHappy Mining", "timestamp_created": 1514025231, "timestamp_updated": 1514025668, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38571259": {"recommendationid": "38571259", "author": {"steamid": "76561197973834043", "num_games_owned": 78, "num_reviews": 9, "playtime_forever": 141, "playtime_last_two_weeks": 141, "last_played": 1514059749}, "language": "english", "review": "Good nostalgic game.", "timestamp_created": 1514024792, "timestamp_updated": 1514024792, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.456897", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38570403": {"recommendationid": "38570403", "author": {"steamid": "76561198058133189", "num_games_owned": 68, "num_reviews": 3, "playtime_forever": 104, "playtime_last_two_weeks": 104, "last_played": 1514089719}, "language": "spanish", "review": "Si te gusta farmear te recomiendo este juego.", "timestamp_created": 1514023231, "timestamp_updated": 1514023231, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.416667", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38570128": {"recommendationid": "38570128", "author": {"steamid": "76561198082978996", "num_games_owned": 107, "num_reviews": 10, "playtime_forever": 347, "playtime_last_two_weeks": 347, "last_played": 1514311167}, "language": "english", "review": "Total Miner. Ahhh what can I say about good Ol' TM?\n\nWell back in 2011/early 2012 I was told by my friends \"Pick up this game! it's great!\" So I picked up the game! It was great!\n\n5 Years later I find myself coming across this stunning game again, with it's large selection of blocks and variety, features and skins. This  game is not just another copy of Minecraft, no no, this game is it's own entity with it's own style, spirit and soul. \n\nPros:\nLarge variety of blocks and items to choose from\n3 unique gamemodes, Creative, Survival and Dig Deep\nA world depth of 3000!!!\nFully customizable A.I dialogue trees\nTons of skins\nAmazing creative tools such as flood, copy, paste, trees and more!\n\n\nCons:\nNo momentum system for movement\nA few wee bugs here and there\nNon infinite worlds\n\nIn all this games Pros definitely outweigh the cons!\n\nI reccomend this as a product that will have you playing for HOURS upon end", "timestamp_created": 1514022756, "timestamp_updated": 1514022756, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38569973": {"recommendationid": "38569973", "author": {"steamid": "76561198167643590", "num_games_owned": 107, "num_reviews": 3, "playtime_forever": 817, "playtime_last_two_weeks": 817, "last_played": 1514182206}, "language": "english", "review": "This is my favorite game from the xbox live indie game store. Been a fan since 2011. I've been waiting for this game to come out on PC for months. Was definitely worth the wait. Theres still a few bugs and lack of co-op and dig deep mode in the port, but nothing that you can't wait a couple of weeks for. Overall this is a great game and I highly recommend for the sale price.", "timestamp_created": 1514022490, "timestamp_updated": 1514022521, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38569910": {"recommendationid": "38569910", "author": {"steamid": "76561198150996552", "num_games_owned": 27, "num_reviews": 7, "playtime_forever": 754, "playtime_last_two_weeks": 754, "last_played": 1514282245}, "language": "english", "review": "Played this on 360 and loved it. Controls are a bit weird currently and multiplayer is still being made but still gud gaem.", "timestamp_created": 1514022348, "timestamp_updated": 1514022348, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38569651": {"recommendationid": "38569651", "author": {"steamid": "76561198088477180", "num_games_owned": 27, "num_reviews": 1, "playtime_forever": 218, "playtime_last_two_weeks": 218, "last_played": 1514089466}, "language": "english", "review": "Now I can finally start my ideas for creations in this game. Wheres mods?", "timestamp_created": 1514021888, "timestamp_updated": 1514021888, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38569594": {"recommendationid": "38569594", "author": {"steamid": "76561198044404930", "num_games_owned": 52, "num_reviews": 1, "playtime_forever": 176, "playtime_last_two_weeks": 176, "last_played": 1514239261}, "language": "french", "review": "Un des meilleurs jeux du genre, issu d'un portage (le jeu était de base sur Xbox), c'est vraiment un très bon jeu ! A acheter les yeux fermé", "timestamp_created": 1514021792, "timestamp_updated": 1514021792, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.478261", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38569507": {"recommendationid": "38569507", "author": {"steamid": "76561198040829297", "num_games_owned": 291, "num_reviews": 25, "playtime_forever": 97, "playtime_last_two_weeks": 97, "last_played": 1514460197}, "language": "english", "review": "I recommend the game right now so you can try it out your self and you can get your opinion on it. right now I am going to give my full honest opinion\n\nFirst, off I am not going to be biased what so ever yes I played the game when it was out on the 360 but that does not change a thing.\n\nPros: \n- Game is out on pc\n- Fun to play\n- You can mod it\n- there is a community that loves this game\n- the game is going to have big plans \n\nCons:\n- it still says some Xbox controls when you are only using a keyboard only\n- interface it hard to get at first\n- has bugs (In Early Access)\n\nThat was my review of total miner and I will update my review for each update have a good one :D", "timestamp_created": 1514021649, "timestamp_updated": 1514275912, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.464602", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38569426": {"recommendationid": "38569426", "author": {"steamid": "76561198079368221", "num_games_owned": 126, "num_reviews": 4, "playtime_forever": 12, "playtime_last_two_weeks": 12, "last_played": 1514021507}, "language": "english", "review": "Ive been waiting so long for this game, i was playing this years ago back when this was on Xbox360 and this was the minecraft in the day when there was no minecraft, i made so many friends and played so many hours and now i can get all that nostalgic feels back again <3", "timestamp_created": 1514021523, "timestamp_updated": 1514021523, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38569294": {"recommendationid": "38569294", "author": {"steamid": "76561197982397462", "num_games_owned": 261, "num_reviews": 15, "playtime_forever": 297, "playtime_last_two_weeks": 297, "last_played": 1514074998}, "language": "english", "review": "Great game and music", "timestamp_created": 1514021278, "timestamp_updated": 1514021278, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38569239": {"recommendationid": "38569239", "author": {"steamid": "76561198096047498", "num_games_owned": 17, "num_reviews": 1, "playtime_forever": 62, "playtime_last_two_weeks": 62, "last_played": 1514115545}, "language": "english", "review": "Just got the game. Got 2 copies one for my friend, one for me. Keep up the good work. Can't wait for multiplayer to be released. Would recommend this game!!", "timestamp_created": 1514021182, "timestamp_updated": 1514021182, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38569026": {"recommendationid": "38569026", "author": {"steamid": "76561198167561273", "num_games_owned": 79, "num_reviews": 9, "playtime_forever": 21, "playtime_last_two_weeks": 21, "last_played": 1514020378}, "language": "english", "review": "First review. Total Miner was all I played for quite a while on Xbox 360. While this current EA version of the game doesn't live up to how the original felt, I have high hopes for the future of this game. My review current stands as positive, but let's see how things go from here. We waited forever and the time has come. Let's go bois!", "timestamp_created": 1514020755, "timestamp_updated": 1514020755, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38569023": {"recommendationid": "38569023", "author": {"steamid": "76561198053422627", "num_games_owned": 1081, "num_reviews": 316, "playtime_forever": 73, "playtime_last_two_weeks": 73, "last_played": 1514070526}, "language": "english", "review": "Very early impressions...\n\nEasily worth the money to any fan of these Minecraft kind of games.  \n\nYes, it looks very similar to Minecraft.  Yes it is trying to profit on the success of Minecraft.  But early first play the first hour it launched in early access showed me two things.. it runs really well, it has tons of options and things to craft meaning it will allow you to create almost unlimited things.. limited only by your imagination.  It also looks to offer a lot of cool things you just can't build in Minecraft without a bunch of mods installed.\n\nBut here is the reasons to buy it..\n1) It's 1/3rd the price of Minecraft\n2) It's on Steam which means when it goes online multiplayer you'll have all of Steams friend features linked to this game\n3) Mod support and the ability to script your own mini games, bosses, and content is VERY tasty!\n4) Enemies spawn at night, and each have their own enemies, watch different creatures fight each other and then you can sneak up and take out the injured winner!  Super cool!\n5) It runs well and has a TON of options and features even its first hour of early access launch\n\nHere are some reasons to hold off..\n1) It doesn't yet support online or co-op play of any kind at early access launch\n2) It may not be original enough to even support your $10, especially if you already own Minecraft\n\nAll in all though, it looks like a great new Minecraft for Steam and seems to run very well with my first quick play test.  I can't see any reason why this wouldn't be well worth its price tag to any fan of these kinda games.\n\nHighly recommended, the price is amazing for what it looks to offer.", "timestamp_created": 1514020749, "timestamp_updated": 1514070849, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.515454", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38568980": {"recommendationid": "38568980", "author": {"steamid": "76561198100773215", "num_games_owned": 1210, "num_reviews": 3, "playtime_forever": 188, "playtime_last_two_weeks": 188, "last_played": 1514134860}, "language": "english", "review": "Amazing as always! Can't wait for dig deep!", "timestamp_created": 1514020660, "timestamp_updated": 1514020660, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38568726": {"recommendationid": "38568726", "author": {"steamid": "76561197963487148", "num_games_owned": 20, "num_reviews": 1, "playtime_forever": 5308, "playtime_last_two_weeks": 5308, "last_played": 1514716421}, "language": "english", "review": "Concidering hardly anyone has left a review yet i guess i'll leave one.\n\nWell, where do i start? I've been playing this game since 2011, this game was basically my childhood. Amazing community, many memories and so many friends made. After waiting 2 years or so for this game i can cofirm it was worth the wait, even though the game may have a few bugs you cannot complain for an Early Access Game. If you are reading this wondering if you should buy it, what are you waiting for? I'm sure you will not be disapointed. \n\n10/10 Recommended.\n\nCallum.", "timestamp_created": 1514020206, "timestamp_updated": 1514062447, "voted_up": true, "votes_up": 26, "votes_funny": 2, "weighted_vote_score": "0.624159", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38568414": {"recommendationid": "38568414", "author": {"steamid": "76561198080205172", "num_games_owned": 200, "num_reviews": 21, "playtime_forever": 10, "playtime_last_two_weeks": 10, "last_played": 1514061840}, "language": "english", "review": "Really good PC port of a classic xbox indie game", "timestamp_created": 1514019659, "timestamp_updated": 1514019659, "voted_up": true, "votes_up": 17, "votes_funny": 1, "weighted_vote_score": "0.567633", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38568396": {"recommendationid": "38568396", "author": {"steamid": "76561198058036163", "num_games_owned": 75, "num_reviews": 2, "playtime_forever": 182, "playtime_last_two_weeks": 182, "last_played": 1514080241}, "language": "english", "review": "G.O.A.T", "timestamp_created": 1514019635, "timestamp_updated": 1514019635, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.490848", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "38568114": {"recommendationid": "38568114", "author": {"steamid": "76561198036093822", "num_games_owned": 182, "num_reviews": 1, "playtime_forever": 103, "playtime_last_two_weeks": 103, "last_played": 1514166790}, "language": "english", "review": "Killed nothing but cows <3 love it", "timestamp_created": 1514019135, "timestamp_updated": 1514019135, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38568050": {"recommendationid": "38568050", "author": {"steamid": "76561198069724608", "num_games_owned": 157, "num_reviews": 3, "playtime_forever": 1246, "playtime_last_two_weeks": 921, "last_played": 1514796957}, "language": "english", "review": "I've played this game since it was an indie game back on the Xbox 360, back before even that version had multiplayer. I originally played it because it was the only console version of Minecraft that was any good at the time. Over time it evolved into more than just a minecraft clone, but into a game where you can make your own games if you wanted to. It's a fantastic game, and it's not a minecraft clone anymore. It's more of a voxel RPG where you have plenty of freedom in what you do with the game itself, without needing any additional mods to make your experience complete. It's got a whole internal coding type of thing called scripting which is incredibly powerful. The creative tools make building grand structures a breeze, and the ability to copy/paste and save builds in game is incredibly useful.", "timestamp_created": 1514019013, "timestamp_updated": 1514019013, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.580888", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "38568006": {"recommendationid": "38568006", "author": {"steamid": "76561198191732631", "num_games_owned": 207, "num_reviews": 2, "playtime_forever": 1724, "playtime_last_two_weeks": 491, "last_played": 1514685297}, "language": "english", "review": "Total Miner was one of the best games on the 360 by far. Which considering it was an indie game costing less than £2/$3 is an amazing feat by itself. Now I get to enjoy it in all its glory on the PC. Without the hardware limitations of the 360 or the restrictions placed on indie games by XBLIG. The developer/s are always listening and open to any ideas which may improve the game and the community is one of the best i've had the pleasure of belonging to.\n\nThe survival mode on it's own is a match for any voxel based game available with plenty to do and get killed by. The creative mode with its markers & script based system far surpasses any other voxel based game and the dig deep mode brings something completely new to the whole genre.\n\nIf you are a fan of the voxel based genre yet yearn for something different, then this is the game for you. I wouldn't hesitate to recommend this game to anyone and i'm looking forward to all the updates to come.", "timestamp_created": 1514018944, "timestamp_updated": 1514018944, "voted_up": true, "votes_up": 64, "votes_funny": 0, "weighted_vote_score": "0.759063", "comment_count": "5", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "38567619": {"recommendationid": "38567619", "author": {"steamid": "76561198006983212", "num_games_owned": 117, "num_reviews": 5, "playtime_forever": 4089, "playtime_last_two_weeks": 1882, "last_played": 1514745241}, "language": "english", "review": "Best indie game I have ever played, love it!", "timestamp_created": 1514018241, "timestamp_updated": 1514018241, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.512051", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "39392147": {"recommendationid": "39392147", "author": {"steamid": "76561198202690522", "num_games_owned": 126, "num_reviews": 19, "playtime_forever": 337, "playtime_last_two_weeks": 337, "last_played": 1516216632}, "language": "english", "review": "my childhood right here mine craft cant even play it bores the fuck outta me this shit could play for hours gg keep up the good work", "timestamp_created": 1516116440, "timestamp_updated": 1516116440, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.474138", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39390131": {"recommendationid": "39390131", "author": {"steamid": "76561198086883260", "num_games_owned": 83, "num_reviews": 18, "playtime_forever": 154, "playtime_last_two_weeks": 154, "last_played": 1516155845}, "language": "english", "review": "Great game! I loved playing this on 360 back in the day. I probably sunk more hours into this than I ever have on Minecraft. I'm glad that this recently dropped on Steam because now they can continue to work on it. \n\nFor you newcomers? Wait for Dig Deep mode to drop. That is most likely where you will spend most of your time. It's the same as Survival but has a better shine to it. \n\nWhat do I mean by \"better shine\"? Well it's really in the name. In Dig Deep the world is thousands of blocks deep. This is compensated by layered tiers with increasingly better mats to find. The cave systems are amazing, and finding blueprints is the most satisfying thing you will do in this gamemode aside from getting higher level tools etc..\n\nAnywho, I have had my say on this, and I hope this review briefly sums up the hidden gem of this game. (Don't even get me started on the Creative aspect, that is for another time XD)", "timestamp_created": 1516110951, "timestamp_updated": 1516111016, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39352839": {"recommendationid": "39352839", "author": {"steamid": "76561198300716266", "num_games_owned": 12, "num_reviews": 3, "playtime_forever": 1224, "playtime_last_two_weeks": 1024, "last_played": 1516122903}, "language": "english", "review": "Total miner is back baby!\n\nFor a long time i have been saddened to the fact that Total miner was dead on the Xbox 360, and when i heard about the Pc port i was astonished! However the wait for the date was long and grueling at best but getting snipets every few months always suprised us on how good it looks. Anyways enough blabbering.\n\nThis game is amazing and even better than before with brand new enhancements like a higher res, 60 fps and infinite worlds. It brings so much to the table, Survival (while simple) is still good fun and creative is at its best. I cannot wait until Dig deep and steam achievments come out!\n\nHowever i must say that if your buying this just now as im writing this i'd research into what your getting as Multiplayer isnt out yet unfortunatly and dig deep isnt either. I must say to the people who dispise this game right now is that it is early access and just came out give it a break!\n\nOverall in my top 5 best games", "timestamp_created": 1515975875, "timestamp_updated": 1515975875, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39331099": {"recommendationid": "39331099", "author": {"steamid": "76561198164170817", "num_games_owned": 46, "num_reviews": 1, "playtime_forever": 337, "playtime_last_two_weeks": 262, "last_played": 1516074775}, "language": "english", "review": "Honestly Im one of the older players and i used to do so much with this game its honestly has the bes gameplay i've seen and is so worth buying i'm happy that it has come to the pc after all this time", "timestamp_created": 1515914325, "timestamp_updated": 1515914325, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39324938": {"recommendationid": "39324938", "author": {"steamid": "76561198199322543", "num_games_owned": 45, "num_reviews": 4, "playtime_forever": 476, "playtime_last_two_weeks": 238, "last_played": 1516039699}, "language": "english", "review": "When I started playing this game back in 2012, I was a complete noob. I had a great friend help me with all sorts (Making money, getting good fast, etc) and me and him played all of the time on his Dig Deep world where we had gotten to the 2nd  Underworld area. We had full Titanium armour, a bunch of chests full of Sledgehammers (Due to the spider-kill Sledgehammer drop when reaching Bedrock), stacks of money, all sorts of stuff. Sadly, back in 2015, he went Black. He wasn't online when I went online (Usually he would msg me and we would play nearly daily) as he normally would be. I wonder what happened to him for months before I converted over to PC completely.  I messaged him about this, but he was not online. As soon as this game came out for PC, I got hit with an immense amount of nostalgia. I dedicate this purchase to my good friend, the one who helped me with everything in this game, the friend who forgave any fumbles on this game. I won't forget you.", "timestamp_created": 1515891459, "timestamp_updated": 1515891459, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.583333", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39320863": {"recommendationid": "39320863", "author": {"steamid": "76561198071590299", "num_games_owned": 228, "num_reviews": 9, "playtime_forever": 9, "playtime_last_two_weeks": 9, "last_played": 1515877691}, "language": "english", "review": "I loved this game back in the day and for this reason it pains me to be so negative about it, while survival works just fine the controls in creative aren't user friendly and it shows this game wasn't intended for keyboard and mouse. Although I do have a controller and when I tried it the controls were far easier to understand, but this is a pc game and shouldn't need a controller to function as intended.\n\nAlso for a game that was £2 on xbox and is almost £8 here it seems overpriced, although I understand things have been added and granted I haven't got far on survival I got this for the creative aspect, and creative seems to be a dissapointment comparted to the simplicity of the xbox version, I understand scripts and RPG aspects have been added and I think thats great, but it shouldn't come at the cost of user friendliness.\n\nI think this game has allot of potential, and I think the main reason I dislike whats happened to this game is I was expecting the experience I originally had on xbox, seeing as its the same game and all, but clinging onto nostalgia is most likely the worst thing I can do here when the game is going in the direction of more of a game maker of sorts, So I really don't think this is a bad game, it's just not what I was expecting and if you are expecting the same experience you had 6 years ago, you may end up dissapointed too.\n\nI am going to keep an eye on this though, because I hope so much to enjoy it again like I did years ago.", "timestamp_created": 1515878811, "timestamp_updated": 1515879458, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.401460", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39319306": {"recommendationid": "39319306", "author": {"steamid": "76561198219991419", "num_games_owned": 11, "num_reviews": 3, "playtime_forever": 103, "playtime_last_two_weeks": 103, "last_played": 1515975756}, "language": "english", "review": "Really amazing game, brings back a lot of childhood memories from playing this on the Xbox 360. Knowing the fact that it is an early access game, it is off to a bit of a rocky start, and that's okay, it is an overall nice game, but there are a few things I would consider adding in or keep from the 360 version.\n\n-Keep in the old menu, It's nice and it suits it more than the newer one, I got confused pretty fast with it.\n-With the menu, maybe consider adding in a mouse sensitivity option. When I was playing it was a little harder to navigate because the mouse was either too fast or too slow.\n-I don't know if this is just me, but when I entered the game, I saw no option to put the game itself on fullscreen.\n-This may be in a future update, but the red dots on the compass bar on the top was really nice, maybe add that in.\n-Keep the character unlocking thing were you need to do specific tasks to unlock those characters.\n-I can't wait for Dig Deep, that was one of my favorite gamemodes in Total Miner Forge.\n-Maybe add in a way to collect crafted materials faster, trying to get wood planks from 50+ wood is slow and can get annoying pretty fast.\n-Multiplayer should be a MUST. So many people loved multiplayer on the Xbox 360 version, including me, so I HIGHLY RECOMMEND adding it in the future.\n\nOverall, this game is really great, but considering the amount of bugs that they still need to work on, I would consider waiting to purchase it until it's in a more stable state, but for bringing back so many childhood memories, It's worth the purchase. 10/10 Studio Forge, You guys are doing great!", "timestamp_created": 1515874851, "timestamp_updated": 1515874851, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39318906": {"recommendationid": "39318906", "author": {"steamid": "76561198276956703", "num_games_owned": 79, "num_reviews": 1, "playtime_forever": 238, "playtime_last_two_weeks": 238, "last_played": 1516079201}, "language": "english", "review": "Such a fun game i use to play back in the indie game days. been waitng on this for a couple years now and its better than ever", "timestamp_created": 1515873857, "timestamp_updated": 1515873857, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39281077": {"recommendationid": "39281077", "author": {"steamid": "76561197980092367", "num_games_owned": 59, "num_reviews": 5, "playtime_forever": 37, "playtime_last_two_weeks": 31, "last_played": 1515852579}, "language": "english", "review": "This game is my childhood i played this game when i first found out the game even exist and actually played it it was lots of fun on xbox 360 and i still play it but im hoping for online multiplayer for pc hopefully soon but this game is fantastic and i think you should get it and play it for yourself unless you play it on xbox 360 love this game and adore it.", "timestamp_created": 1515765011, "timestamp_updated": 1515765011, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39280213": {"recommendationid": "39280213", "author": {"steamid": "76561198314610729", "num_games_owned": 19, "num_reviews": 2, "playtime_forever": 39, "playtime_last_two_weeks": 15, "last_played": 1515544808}, "language": "english", "review": "Good stuff", "timestamp_created": 1515762456, "timestamp_updated": 1515762456, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39267682": {"recommendationid": "39267682", "author": {"steamid": "76561198152622549", "num_games_owned": 40, "num_reviews": 2, "playtime_forever": 244, "playtime_last_two_weeks": 235, "last_played": 1515625576}, "language": "english", "review": "before minecraft even came to the xbox360, 12 year old me wanted a good substitute. a buddy of mine showed me this game and i fell in love. take minecraft but with more mobs, items, and blocks and combine it with the skills from runescape. eversince i heard it was coming to steam i flipped out. i was so happy. now i get to play it all over again, and hopfully with the friends i played it with then once multiplayer comes back into the game. cant wait for mp and dig deep mode. 12?10. i love this game more than my childhood.", "timestamp_created": 1515711639, "timestamp_updated": 1515711639, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39219216": {"recommendationid": "39219216", "author": {"steamid": "76561198067307232", "num_games_owned": 143, "num_reviews": 17, "playtime_forever": 51, "playtime_last_two_weeks": 51, "last_played": 1515539918}, "language": "english", "review": "this game was literally sex on xbox360 literally OG minecraft for console and now that in came to pc i've been dying to play the game and its very unfinished atm. theres no multiplayer except local, all characters are unlocked, dig deep is not unlocked, only thing to is play survival by yourself.", "timestamp_created": 1515540104, "timestamp_updated": 1515540104, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.496780", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39197541": {"recommendationid": "39197541", "author": {"steamid": "76561198125136110", "num_games_owned": 24, "num_reviews": 1, "playtime_forever": 3992, "playtime_last_two_weeks": 1924, "last_played": 1516079257}, "language": "english", "review": "Best game you can get in my opinion. It's a open world game that you can make scripts, mods, zones, and more. Theres no way to not find something to do on this game.", "timestamp_created": 1515465906, "timestamp_updated": 1515465906, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.518815", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39186984": {"recommendationid": "39186984", "author": {"steamid": "76561198442927345", "num_games_owned": 37, "num_reviews": 7, "playtime_forever": 73, "playtime_last_two_weeks": 8, "last_played": 1515278930}, "language": "english", "review": "I loved this game when I was a kid, me and my friends would stay up all night playing this game like its all we could do. I have yet to play the PC version a lot, I'm still waiting for a few updates as the mouse seems to be extremely sensitive on the Y axis for me. It's worth the money for all the nostalgic feelings you'll have if you used to play this on 360.", "timestamp_created": 1515432660, "timestamp_updated": 1515432660, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.496780", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39160258": {"recommendationid": "39160258", "author": {"steamid": "76561198011156966", "num_games_owned": 117, "num_reviews": 5, "playtime_forever": 30, "playtime_last_two_weeks": 30, "last_played": 1515189528}, "language": "english", "review": "Childhood memories right here.", "timestamp_created": 1515349882, "timestamp_updated": 1515349882, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.542259", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39155997": {"recommendationid": "39155997", "author": {"steamid": "76561198255131097", "num_games_owned": 19, "num_reviews": 6, "playtime_forever": 198, "playtime_last_two_weeks": 10, "last_played": 1515344533}, "language": "english", "review": "Best game I've ever played back on 360, love the nostalgic feel of the game. I can't wait until Dig Deep/Multiplayer is introduced.", "timestamp_created": 1515340862, "timestamp_updated": 1515340862, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.473269", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39150739": {"recommendationid": "39150739", "author": {"steamid": "76561198273353601", "num_games_owned": 15, "num_reviews": 14, "playtime_forever": 38, "playtime_last_two_weeks": 0, "last_played": 1514083686}, "language": "english", "review": "Needs a little more work done and waiting for multiplayer but other than that its great. A Minecraft clone thats better than Minecraft.", "timestamp_created": 1515329579, "timestamp_updated": 1515329579, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.496780", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39128810": {"recommendationid": "39128810", "author": {"steamid": "76561198359965986", "num_games_owned": 51, "num_reviews": 9, "playtime_forever": 45, "playtime_last_two_weeks": 45, "last_played": 1516105949}, "language": "english", "review": "Well I know its good but there seems to be alot of bugs the reason i know it is good because ive played on my xbox 360 i also hate the bluescreen at launch thing please fix that!", "timestamp_created": 1515267442, "timestamp_updated": 1515267442, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.496780", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39101613": {"recommendationid": "39101613", "author": {"steamid": "76561198199003625", "num_games_owned": 36, "num_reviews": 11, "playtime_forever": 8, "playtime_last_two_weeks": 0, "last_played": 1514273313}, "language": "english", "review": "i love this game", "timestamp_created": 1515198514, "timestamp_updated": 1515198514, "voted_up": false, "votes_up": 6, "votes_funny": 16, "weighted_vote_score": "0.210012", "comment_count": "12", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39101021": {"recommendationid": "39101021", "author": {"steamid": "76561198271817448", "num_games_owned": 304, "num_reviews": 12, "playtime_forever": 9, "playtime_last_two_weeks": 3, "last_played": 1515196762}, "language": "english", "review": "While I do like Total Miner and I'm glad to see it in PC, I wouldn't buy it now due to missing features, bugs, and strange controller-based control settings (mouse accel, limited turning speed, etc). Not gonna give a negative recommendation so as to not hurt the game's rating. Just keep an eye on the updates and buy when you think the time is right.", "timestamp_created": 1515196892, "timestamp_updated": 1515196892, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.548206", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39092410": {"recommendationid": "39092410", "author": {"steamid": "76561198250442068", "num_games_owned": 23, "num_reviews": 2, "playtime_forever": 190, "playtime_last_two_weeks": 190, "last_played": 1515682041}, "language": "english", "review": "I remember when i played this on \"xbox360\" But still i think this is better than \"Minecraft\" Becouse you can do more than in minecraft.  but still i have to say this is still like say unfinished or it feels like it but dont listen me its my opinion. \n- there is no multiplayare YET\n- i dosent regognize my controller...         R.I.P", "timestamp_created": 1515177125, "timestamp_updated": 1515177125, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.496780", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39075637": {"recommendationid": "39075637", "author": {"steamid": "76561198238716384", "num_games_owned": 9, "num_reviews": 2, "playtime_forever": 2988, "playtime_last_two_weeks": 2988, "last_played": 1515739849}, "language": "english", "review": "YES! IT'S BACK! I've been waiting for so long!  A good start for a first realease but it hasnt been totally transfered to PC yet, but its still in its early stages.  The pause menu design is amazing but doesnt match with the main menu. Thats all the info i can give.", "timestamp_created": 1515136865, "timestamp_updated": 1515136865, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39067306": {"recommendationid": "39067306", "author": {"steamid": "76561198161817821", "num_games_owned": 29, "num_reviews": 16, "playtime_forever": 137, "playtime_last_two_weeks": 137, "last_played": 1515280867}, "language": "english", "review": "I played this game when it orginally first came out on xbox 360. This is a nostalgia trip for me. i am veteran of this game. This game was 85% of my life for awhile. But until they come back out with dig deep on PC, i am no veteran. Because thats all i played. Trust me, this game is worth the money.\nEveryone compares it to minecraft, i honestly like this game more than minecraft. This game is much different and has much more to do overall. The feel is different, at least to me. I am glad the creator of this game decided to come out with it on PC. As he can probably do much more improving and updating to it. He seems to be updating quite frequently, so thats good. So if you are having doubts of buying this, buy it. because once dig deep comes back, im gonna end up pouring my life into it again.\nI personally want to thank the developer for releasing it on PC. This game was honestly one of my favorite games in my collection. I will glady wait for dig deep to come back out because of that.", "timestamp_created": 1515110687, "timestamp_updated": 1515111028, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39038739": {"recommendationid": "39038739", "author": {"steamid": "76561198055599204", "num_games_owned": 80, "num_reviews": 3, "playtime_forever": 20, "playtime_last_two_weeks": 0, "last_played": 1514928258}, "language": "french", "review": "Trop cher pour un jeux comme celui-ci sur 360 je l'ai payer 1$. il est bien comme petit jeux mais je sais pas si le mode multijoueur va être mis mais pour le moment c'est pas top top mais je mets un oui pareille car j'ai hâte de voir ce qui va être ajouter dans les prochaine mise a jours", "timestamp_created": 1515048154, "timestamp_updated": 1515048154, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39006038": {"recommendationid": "39006038", "author": {"steamid": "76561198029094651", "num_games_owned": 268, "num_reviews": 4, "playtime_forever": 156, "playtime_last_two_weeks": 110, "last_played": 1514978950}, "language": "english", "review": "I remember stumbling accross this on my 360 and then showing it to my best friend.It ended up being such a huge part of our hangouts just because we were able to to use two controllers for split screen but man it's so good to see total miner make it's way on to steam i mean sure it has a while to go but  with work from the devs it'll turn out just great.So if you were to ask me is it worth $10 i would say yes", "timestamp_created": 1514975071, "timestamp_updated": 1514975071, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38999473": {"recommendationid": "38999473", "author": {"steamid": "76561198060344775", "num_games_owned": 663, "num_reviews": 7, "playtime_forever": 134, "playtime_last_two_weeks": 21, "last_played": 1515977327}, "language": "english", "review": "I have followed this game since it was on the XBL indie game market and I am proud to see how much it has grown since then. \n\n------------THIS GAME IS NOT A MINECRAFT CLONE DESPITE WHAT PEOPLE THINK------------\n\nyes it maybe a block based sandbox like minecraft but it is far from it, TotalMiner has its own XP system where you have to do certain tasks in order to level up strength, stamina, and many other abilities. Failing to do so will not allow you to progress in the game with the XP system active. They also have the basic survial and creative modes that other block based games have, so you are probably thinking \"why should i purchase this game if its only selling point is a XP system?\"\n\nwell the XP system is only the tip of the iceberg my friend, TotalMiner has its own unique mode (ON THE WAY SHORTLY) called DigDeep. Dig Deep mode is kind of like your standard block game but with a twist. You have to mine the earth layer by layer finding certain ores to progress to the next layer and also discover blueprints to get better equipment\n\nOverall I Highly Recommend this game to anybody looking for a casual cheap infinte adventure. With a price tag of $9.99 the game is worth a buy \n\nAS OF 01/02/2018 ONLINE MULTIPLAYER IS NOT IMPLIMENTED BUT THE DEV IS GOING TO ADD IT EVENTUALLY", "timestamp_created": 1514955434, "timestamp_updated": 1514975566, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.529073", "comment_count": "14", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38991961": {"recommendationid": "38991961", "author": {"steamid": "76561198062554437", "num_games_owned": 48, "num_reviews": 1, "playtime_forever": 54, "playtime_last_two_weeks": 48, "last_played": 1515638356}, "language": "english", "review": "Because I first bought this game in 2011 on XBLIG, I feel I am obligated to relive one of my childhood games by buying it on steam. I honestly thought this would never happen, but here we are in 2018, it has been revived and brought to PC. However, after spending $8 on the game, I'm pretty disappointed that the only gamemode that I play, Dig Deep, isn't available yet. So I won't play until it does get released. \n\nCraig (or whoever develops the game now) has been dedicated to this one game for many years now, and I would be glad to wait a few more weeks until Dig Deep is finished, but I wish he would have had it finshed when the game released. It's just another game that has to be released with bugs and incomplete features. Again, I love this game, but it shouldn't have been released incomplete.", "timestamp_created": 1514934961, "timestamp_updated": 1514934961, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38991358": {"recommendationid": "38991358", "author": {"steamid": "76561198146022960", "num_games_owned": 354, "num_reviews": 1, "playtime_forever": 15, "playtime_last_two_weeks": 7, "last_played": 1515870187}, "language": "english", "review": "All I can say is... Fucking FINALY", "timestamp_created": 1514933658, "timestamp_updated": 1514933658, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38988092": {"recommendationid": "38988092", "author": {"steamid": "76561198361905776", "num_games_owned": 33, "num_reviews": 2, "playtime_forever": 2711, "playtime_last_two_weeks": 547, "last_played": 1515729089}, "language": "english", "review": "Its great!\n", "timestamp_created": 1514926701, "timestamp_updated": 1514926701, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39445227": {"recommendationid": "39445227", "author": {"steamid": "76561198020558964", "num_games_owned": 24, "num_reviews": 1, "playtime_forever": 1122, "playtime_last_two_weeks": 749, "last_played": 1515717176}, "language": "english", "review": "I really enjoyed playing this on the Xbox 360 it's nice to see that can play on the PC as well but of course it's still in early access and of course no dig deep I hope this will come soon because I miss playing that part", "timestamp_created": 1516309519, "timestamp_updated": 1516309519, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39524796": {"recommendationid": "39524796", "author": {"steamid": "76561198113256726", "num_games_owned": 62, "num_reviews": 13, "playtime_forever": 17, "playtime_last_two_weeks": 17, "last_played": 1516583828}, "language": "english", "review": "Controls are as of now, hardly friendly for PC and I'd suggest playing the console version until the full version comes out when they either change the controls to be more like other PC games or just introduce a controls menu. (I've been searching the menu and haven't found one yet.)", "timestamp_created": 1516582937, "timestamp_updated": 1516582937, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39524203": {"recommendationid": "39524203", "author": {"steamid": "76561198068857124", "num_games_owned": 274, "num_reviews": 46, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1514774825}, "language": "english", "review": "Cant wait for Dig deep.", "timestamp_created": 1516580412, "timestamp_updated": 1516580412, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39488396": {"recommendationid": "39488396", "author": {"steamid": "76561198402219990", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 41, "playtime_last_two_weeks": 41, "last_played": 1516136607}, "language": "french", "review": "z", "timestamp_created": 1516468306, "timestamp_updated": 1516468306, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39488059": {"recommendationid": "39488059", "author": {"steamid": "76561198103072330", "num_games_owned": 18, "num_reviews": 8, "playtime_forever": 960, "playtime_last_two_weeks": 960, "last_played": 1516583485}, "language": "english", "review": "(Please Note that I am not saying this to label the game, I am just saying what it feels like to play it from my POV) Total Miner is a much like Minecraft, but in my opinion, BETTER! It still has some tweaks to fix and potential, but I do believe this game can become something amazing. I see this game linking with the Consle players so the community isn't seperated by PC and Consle people.\n\nCreative mode can let a person expand on not only creativity, but scripts and coding. This can make for an excellent way to build adventure worlds, or interactive worlds.\n\nSurvival can give a very different experiance. If you enable skills, it gives that vibe that Skyrim and Minecraft had a baby. Disabling skills can give a smooth normal survival feel and make players rely on items they craft and find with their own skills.\n\nThe items span very far and give a unique feel to the game as you aren't limited to just Iron and Diamonds. You can play defensively, offensively, or ranged.\n\nThe mobs are intresting. Each of them having their own levels. All of them spawn if skills are disabled. Enabling skills can make the mobs scale with you in level, making it so you won't die by a diablo on your first night.\n\nAll in all, 10/10 IGN and I r8 8/8 m8! Can't wait to see what the full version has in store!", "timestamp_created": 1516467510, "timestamp_updated": 1516496191, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525862", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39471275": {"recommendationid": "39471275", "author": {"steamid": "76561198142565230", "num_games_owned": 86, "num_reviews": 2, "playtime_forever": 3357, "playtime_last_two_weeks": 1655, "last_played": 1516051446}, "language": "english", "review": "Great game, loads of potential. Needs a bit more work for completion but the devs are good and reliable.\nCurrently does not have multiplayer, some of the UI is a bit buggy but nothing game breaking.\nWould recommend for returning players and future server builders. As for casual players, currently there is survival which is fun, but casual players will be satisfied once multiplayer is added. \n\n\n", "timestamp_created": 1516409830, "timestamp_updated": 1516409830, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39592356": {"recommendationid": "39592356", "author": {"steamid": "76561198080615320", "num_games_owned": 124, "num_reviews": 18, "playtime_forever": 30, "playtime_last_two_weeks": 0, "last_played": 1515074226}, "language": "english", "review": "Bought this game because of nostalgia but was quite disappointed to find out that dig deep wasn't currently in the game, i am happy to have found out that dig deep will be re released soon :)", "timestamp_created": 1516836072, "timestamp_updated": 1516836072, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39542098": {"recommendationid": "39542098", "author": {"steamid": "76561198345029886", "num_games_owned": 6, "num_reviews": 1, "playtime_forever": 809, "playtime_last_two_weeks": 741, "last_played": 1516778923}, "language": "english", "review": "This was my all time favorite game on xbox 360 but now its on PC! Wow, greatness is alive in the world of Total Miner and always will. The game is missing some things among the release but as it goes on it will be a for sure great game and may even get better along the way. A must try game for sure! Thank you to the devs and maker of the game for release! [If Your Reading This And Have A Ehh-ish PC My PC Sucks And It Runs Almost Perfectly With Tiny-Tiny To No Lag!]", "timestamp_created": 1516650449, "timestamp_updated": 1516650449, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}}}
