{"reviews": {"38839377": {"recommendationid": "38839377", "author": {"steamid": "76561197991486832", "num_games_owned": 202, "num_reviews": 8, "playtime_forever": 214, "playtime_last_two_weeks": 0, "last_played": 1514591365}, "language": "english", "review": "Excellent writing, both for the dialogues and the narration.\nFull voice over with an okay cast (the performances vary a lot depending on the character).\nNot so great art.\nMultiple endings for a bit of extra replayability (even though the true ending is pretty obvious), for a total of ~3h of gameplay.\n\nPick it during a sale if you're into murder mistery VNs.", "timestamp_created": 1514591952, "timestamp_updated": 1514633552, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38818508": {"recommendationid": "38818508", "author": {"steamid": "76561198257567267", "num_games_owned": 268, "num_reviews": 42, "playtime_forever": 141, "playtime_last_two_weeks": 10, "last_played": 1515491836}, "language": "english", "review": "Horatio’s my man, don’t be dissin’ him now, aight? Coolest dude I ever met.", "timestamp_created": 1514553933, "timestamp_updated": 1514553933, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35197078": {"recommendationid": "35197078", "author": {"steamid": "76561198077111323", "num_games_owned": 97, "num_reviews": 8, "playtime_forever": 178, "playtime_last_two_weeks": 0, "last_played": 1506317425}, "language": "english", "review": "A cast of characters invited to a secluded old mansion for reasons unknown other than an unexpected announcement. Haven't I heard this story somewhere before?\n\nYou play as Miss Fortune - 9 times a widow and as crafty as she is suspicious, it'll be your job to scour the mansion for clues when someone is murdered. What I love about this premise, is that you don't really care if justice is done, you just want to make sure no one pins the murder on you. I do think this concept could have been explored more as it is somewhat unique and exciting to an old genre... perhaps Miss Fortune will have to have another adventure for that one, as I don't think its explored to it's full potential in this one.\n\nI have to admit, the setting and premise for the story are often overdone within the mystery genre; however, sometimes when you write in a genre you write about what you know....and hoo boy, do mystery novel lovers know this setting. That being said, the game is enjoyable and I found it nice to use the \"pacing\" button to let the characters speak, and then just enjoy the delivery of the lines. The voice acting was particularly entertaining, and it paired nicely with the unobtrusive ambient music.\n\nI also couldn't help but feel that there was a little more planned for the story, and parts of it sort of wrapped up in the end. Something I struggled with was that the strength of the relationships of some of the characters. For example: [spoiler] A certain character is obviously very much in love with another, and I felt it was only given that they fancied them. [/spoiler] Despite that, I was still able to solve the mystery.\n\nOverall good writing, awesome voice acting, a little short, but an enjoyable evening of mystery with gems of innovation.", "timestamp_created": 1506318719, "timestamp_updated": 1506319895, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34513805": {"recommendationid": "34513805", "author": {"steamid": "76561198007902424", "num_games_owned": 99, "num_reviews": 4, "playtime_forever": 164, "playtime_last_two_weeks": 0, "last_played": 1503778061}, "language": "english", "review": "MMM has voice acting which is nice for a budget visual novel. Some of the voices get kind of grating, but I have a feeling that may be intentional. Similarly, the art for some of the characters could be a little better. Examining rooms can be difficult compared to other mystery games. I really enjoyed the main character; she's sassy and has voice acting that is done well. I'd like to see her show up in more Miss Adventures- er, misadventures!\n\nI enjoyed it overall. It's really short, but at this price point I can't complain! It's worth a play.", "timestamp_created": 1503779868, "timestamp_updated": 1503779868, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33700014": {"recommendationid": "33700014", "author": {"steamid": "76561197994002775", "num_games_owned": 3279, "num_reviews": 657, "playtime_forever": 42, "playtime_last_two_weeks": 0, "last_played": 1493765066}, "language": "english", "review": "You are at a private party when suddenly somebody gets murdered in there\nits your job to unmask this killer\nthere is an autoplay option wich makes u enjoy the game more by sitting back and relax, but u need to make choices to in order to point out a suspect\n\nhttps://www.youtube.com/watch?v=dLFz-q7L77E", "timestamp_created": 1500653699, "timestamp_updated": 1500653699, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.423058", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33191817": {"recommendationid": "33191817", "author": {"steamid": "76561198127194782", "num_games_owned": 147, "num_reviews": 2, "playtime_forever": 175, "playtime_last_two_weeks": 0, "last_played": 1498763744}, "language": "english", "review": "A great little game. Short but sweet.", "timestamp_created": 1499100348, "timestamp_updated": 1499100348, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.465559", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33135917": {"recommendationid": "33135917", "author": {"steamid": "76561198015278081", "num_games_owned": 1708, "num_reviews": 41, "playtime_forever": 780, "playtime_last_two_weeks": 0, "last_played": 1499007674}, "language": "english", "review": "Such a well executed game.\n\nIt's a classic \"whodunnit\" game with a simple yet intriguing mystery and cast of characters. There's light exploration and a reasonable amount of conversation option to keep the game short and well paced.\n\nWhat really make this game shine is the fabricated stories Miss Fortune can come out with. You'll often have to pick an answer to a question/mystery and hilarity may ensues. This is especially true in Chapter 3, when you have to announce who the killer is and why/how he did it.\n\nAll characters lines in the game are voice acted and it's really well done. I hope we'll see more of Miss Fortune (or Sir Prince) in the future.\n\nI really enjoyed this game, so go ahead and try it if you're into murder mysteries, there's even a demo available.", "timestamp_created": 1499008249, "timestamp_updated": 1499008249, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33098995": {"recommendationid": "33098995", "author": {"steamid": "76561198067234710", "num_games_owned": 223, "num_reviews": 4, "playtime_forever": 101, "playtime_last_two_weeks": 0, "last_played": 1498886732}, "language": "english", "review": "A quick and fun murder mystery VN with a few design flaws but entertaining characters. \n\nThe high point was definitely the cast, with Miss Fortune in particular having a number of lines that made me crack a smile at her dramatic and cynical comments. The script is good, and I was impressed that the entire game was voiced (and voiced well!). Each character had their own distinctive personality, mannerisms, and motives, which made the multiple endings -one for each potential killer- seem reasonable. I also loved that everyone had their own color scheme, since it reminded me of the iconic house party murder mystery game: Clue.\n\nThere were a few things I did not love about the gameplay, mostly with regard to skipping or redundancies. It was somewhat annoying that moving from room to room always had an unskippable panning shot of the room before you could interact with anything, and an option to skip dialogue you had heard previously would be nice. Additionally, interactables in the room were sometimes hard to find or repeated (did we really need the tables in the dining halls to have multiple click points when they all said the same thing?), especially in the dim lighting.\n\nOverall, I was entertained and would recommend it if you like snappy dialogue and murder mysteries that have a bit of humor to them. The price is a little high considering you can get all the endings by reloading a save from just before the accusation phase, but honestly I've paid more for games I've enjoyed less. I would definitely play another mystery featuring Miss Fortune, she was so hilariously mean.", "timestamp_created": 1498939247, "timestamp_updated": 1498939247, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33005651": {"recommendationid": "33005651", "author": {"steamid": "76561198227820840", "num_games_owned": 51, "num_reviews": 7, "playtime_forever": 171, "playtime_last_two_weeks": 0, "last_played": 1498833562}, "language": "english", "review": "A very \"mysterious\" little game. It can be a little confusing and difficult if you don't keep your eyes open! I didn't expect the voice acting but it made everything even better! Overall a very good game! :3 \nWould recommend if you have a little detective inside you, in the need of a small murder case!", "timestamp_created": 1498763576, "timestamp_updated": 1498763576, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32303811": {"recommendationid": "32303811", "author": {"steamid": "76561198315775997", "num_games_owned": 3, "num_reviews": 1, "playtime_forever": 346, "playtime_last_two_weeks": 0, "last_played": 1498355988}, "language": "english", "review": "MMM is a point-and-click adventure centered around solving the murder of an enigmatic man. As the cast attempts to solve the mystery, a clock ticks down marking the time until the arrival of the police...\n\nThe presence of the timer definitely made the game tenser, but I often found myself skipping through the text quickly to finish collecting everything before time ran out. Thankfully, there is the option to disable the timer which allows you to absorb the atmosphere better. The characters are voiced well, and I was delighted to hear the wit of Miss Fortune, her interactions with the high-class Comtessa, and the banter with the rest of the cast.\n\nIt was a bit hard to suspend my disbelief at times. The clash of old and new technology felt jarring, and Lia felt out of place, being the only technically inclined person in a very old-fashioned setting. She was able to casually hack the phone company records to figure out who called the house, and would have preferred to hack their private emails if she needed extra information. Technical capability seemed to fluctuate as Miss Fortune seems clueless about wiring and electronics, yet she immediately identifies the timer device and implies that she was able to wire one up in school.\n\nThe gameplay was a bit clunky from time to time. Although the backgrounds were clear and conveyed the atmosphere well, some of the interact-able objects were a bit hard to distinguish from the background, further compounded by the fact that you can rotate 360 degrees. Transitioning between rooms takes a bit of time, especially when you go between rooms frequently. When replaying the game to achieve all the endings, I found myself wishing for an auto-skip feature. However, it was nice that the controls were explained clearly and concisely at the very start of the game.\n\nThe artstyle was charming, and each character is given a unique color for contrast. I'm not sure what's up with Comtessa's right hand, though. Perhaps she's an amputee from the elbow down.\n\nThe highlight of the game is definitely chapter 3, where you can blame anyone and justify it. If you mess up and have the tables turned on you, the game gives you some clues, some of which are misleading. These small hints are beautifully executed.\n\nDespite criticizing aspects of the game, I would recommend this game to anyone that enjoys adventure mystery games. The price is justified for this short (~2 hours) but sweet experience and look forward to any similar titles developed by Foolish Mortals in the future.", "timestamp_created": 1497048695, "timestamp_updated": 1497048695, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.655794", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32233504": {"recommendationid": "32233504", "author": {"steamid": "76561198020361477", "num_games_owned": 126, "num_reviews": 3, "playtime_forever": 39, "playtime_last_two_weeks": 0, "last_played": 1495685296}, "language": "english", "review": "A wonderful little game with intriguing characters.  Give it a try!", "timestamp_created": 1496816149, "timestamp_updated": 1496816149, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.419895", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32142227": {"recommendationid": "32142227", "author": {"steamid": "76561198019273919", "num_games_owned": 59, "num_reviews": 1, "playtime_forever": 384, "playtime_last_two_weeks": 0, "last_played": 1496455157}, "language": "english", "review": "A well written, entertaining game.  For me one of the most enjoyable bits, besides puzzling out the true ending, were the absurd flashbacks of events that never could have happened that can occur when you make an erroneous accusation.   The plausibility of the \"false\" endings were quite clever, and I enjoyed never being sure if I had gotten it right or not.  A short play, but definitely worth half the price of a movie.  Could be a fun game to play with a small group of friends for a night of entertainment.", "timestamp_created": 1496455548, "timestamp_updated": 1496455548, "voted_up": true, "votes_up": 21, "votes_funny": 0, "weighted_vote_score": "0.750116", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32095356": {"recommendationid": "32095356", "author": {"steamid": "76561198037390512", "num_games_owned": 114, "num_reviews": 4, "playtime_forever": 254, "playtime_last_two_weeks": 0, "last_played": 1496267810}, "language": "italian", "review": "giochetto coinvolgente, personaggi convincenti , difficoltà un pò ambigua con un pizzico di fortuna un po di occhio e tanto tempo si finisce senza problemi al 100%,  il problema sarà la rigiocabilità una volta finito tutto... è breve ci vorra del tempo per dimenticare. lo consiglio a chi si affaccia per la prima al volta al genere investigativo e ovviamente a chi piace vedere gli anime sarà come una serie di 8 puntate", "timestamp_created": 1496268686, "timestamp_updated": 1496268686, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.509804", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32027590": {"recommendationid": "32027590", "author": {"steamid": "76561197990347787", "num_games_owned": 469, "num_reviews": 45, "playtime_forever": 18, "playtime_last_two_weeks": 0, "last_played": 1496000428}, "language": "french", "review": "Warning: Ham Level Over 9000\nLes sprites font un peu tâche  ̶a̶v̶e̶c̶ ̶l̶e̶ ̶d̶é̶c̶o̶r̶  tout court\nLe mystère et les persos ne sont pas très intéressants, par contre la déduction finale qui s'adapte à chaque suspect est bien pensée", "timestamp_created": 1496000533, "timestamp_updated": 1496000533, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.534884", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31988190": {"recommendationid": "31988190", "author": {"steamid": "76561198283913700", "num_games_owned": 12, "num_reviews": 1, "playtime_forever": 530, "playtime_last_two_weeks": 0, "last_played": 1496799396}, "language": "english", "review": "*Full disclosure: I know the developers and play-tested the game. However, I think this review will still be helpful, because I can provide the perspective of someone who's spent a lot of time thinking about and playing MMM.*\n\nYou should play this game...\n-if you are curious about the interactive novel genre; this is a short and inexpensive game to help you \"test the waters\"\n-if you are already a fan of interactive novels; you will likely appreciate the unique features of this game\n-because the dialogue is engaging (and often funny), voiced well, and led by Miss Fortune's dry wit and sarcastic remarks\n-because the multiple endings stem from the fact that [spoiler]plausible murder accusations can be made against any character[/spoiler]\n-(this requires much more clever scripting than simple decision trees like \"who do you date?\" or \"who do you kill?\")\n\nYou should not play this game...\n-if you do not like interactive novels; it's mostly reading/watching/decisions, with some minor exploratory segments\n-if you are an action-oriented or impatient player; there are no genuine decisions until the second chapter\n-if you are easily frustrated; it's a bit tricky to [spoiler]find everything you need to access the true ending[/spoiler]\n\nOverall, if you are able to approach this game as an immersive evening of mystery, I think you will enjoy it. Give yourself a good chunk of time when you first get started, think about what's going on, listen to the voice acting, and think of the first ending you find as \"your ending\". \n\nNote: I would also recommend playing without the optional time limit for the second chapter. In my experience, the game is more fun if you take time to listen to all the voice acting and don't have to worry about getting stuck not finding something important before you have to accuse somebody. You can always time yourself (the limit is [spoiler]1 hour 15 minutes[/spoiler]) to see if you would have been ready before the time was up anyway.", "timestamp_created": 1495859213, "timestamp_updated": 1495859213, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.576923", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31816667": {"recommendationid": "31816667", "author": {"steamid": "76561198028287259", "num_games_owned": 2545, "num_reviews": 194, "playtime_forever": 158, "playtime_last_two_weeks": 0, "last_played": 1494368902}, "language": "brazilian", "review": "Tá difícil competir.", "timestamp_created": 1495085449, "timestamp_updated": 1495085449, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31728317": {"recommendationid": "31728317", "author": {"steamid": "76561197993698819", "num_games_owned": 266, "num_reviews": 1, "playtime_forever": 166, "playtime_last_two_weeks": 0, "last_played": 1493478079}, "language": "english", "review": "This game is well written has a good mystery and each line has voice acting which is done well, I would recommend this to any fans of murder mystery stories", "timestamp_created": 1494693644, "timestamp_updated": 1494693644, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.448585", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31715149": {"recommendationid": "31715149", "author": {"steamid": "76561198014986597", "num_games_owned": 286, "num_reviews": 9, "playtime_forever": 135, "playtime_last_two_weeks": 0, "last_played": 1494648226}, "language": "english", "review": "Pretty good read, finished the game in about 2 hours.\nShort and simple game, the cg environments and the sprites aren't that good but the voice acting is decent.\nThe best part about the game is the denouement. You can blame anyone, supporting your claims with evidence that you find and twisting the narrative of the murder's events as needed. It was fun screwing everybody over.\nWorth a buy if you are looking for short mystery vn to read for one evening.\n\nAlso Miss Fortune is pretty cute. Definitely waifu material.", "timestamp_created": 1494647373, "timestamp_updated": 1494648306, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.497942", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31670416": {"recommendationid": "31670416", "author": {"steamid": "76561198158852731", "num_games_owned": 170, "num_reviews": 23, "playtime_forever": 163, "playtime_last_two_weeks": 0, "last_played": 1494442929}, "language": "german", "review": "Colles Spiel mit genialer Story. leider etwas sehr sprachlastig, aber am Abend im Bett mit dem Laptop super! \nDie Sprachausgabe ist jedoch exellent und man hört gerne zu. Artwork ist auch sehr hübsch anzusehen. \nSehr zu empfehlen!", "timestamp_created": 1494441449, "timestamp_updated": 1494441546, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31572638": {"recommendationid": "31572638", "author": {"steamid": "76561198283832325", "num_games_owned": 120, "num_reviews": 43, "playtime_forever": 227, "playtime_last_two_weeks": 0, "last_played": 1494369108}, "language": "english", "review": "This visual novel has too things working for it right away. The voice acting is great and each character sounds like a real person. The second is the timer that appears once someone is murdered. You have to make quick decisions in order to find out what is going on. I would like to see more adventurers with Miss Fortune.\nhttps://youtu.be/I0RKb2trnrs", "timestamp_created": 1494044281, "timestamp_updated": 1494044281, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.503926", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31538987": {"recommendationid": "31538987", "author": {"steamid": "76561198213359933", "num_games_owned": 52, "num_reviews": 21, "playtime_forever": 289, "playtime_last_two_weeks": 0, "last_played": 1493887765}, "language": "english", "review": "A pretty-looking game with a good story but I wished it went a bit deeper, lasted longer and had more info on Miss Fortune and the other characters. I did not want to follow the other achievements in place of the true route as I felt sympathy for a couple of them. I think with more depth in story and characterisation, more money could be charged for an incredible game.", "timestamp_created": 1493894216, "timestamp_updated": 1493894216, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.517045", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31522660": {"recommendationid": "31522660", "author": {"steamid": "76561198095204875", "num_games_owned": 146, "num_reviews": 19, "playtime_forever": 205, "playtime_last_two_weeks": 0, "last_played": 1494009849}, "language": "japanese", "review": "よくあるADVです。\n登場人物は７人と少なめ。\n解決までにタイムリミットがあるのが特徴です。\nでもフルボイスなので、聴いていると時間が足らないです。\n正直、タイムリミットはなくても良かったと思います。\n全3章で、2-3時間で終わります。\n実績を全部取っても4時間もかからないです。\nまあ安いので、特に不満もないです。\nPVだと、時代が分かりにくいですが、\n現代の話で、ホラー要素などはありません。\n本当に普通のADVで、ほかに言葉はないですが、\n値段分は楽しめます。\n", "timestamp_created": 1493812486, "timestamp_updated": 1493812486, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.573284", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31520076": {"recommendationid": "31520076", "author": {"steamid": "76561198042764519", "num_games_owned": 493, "num_reviews": 15, "playtime_forever": 265, "playtime_last_two_weeks": 0, "last_played": 1494067536}, "language": "english", "review": "Miss Fortune, widowed 9 times so far, attends a little get together of mostly strangers. Unfortunately, during the proceedings, their host is murdered, and she finds herself being framed for the murder. It's now up to you to search the locations, question the other characters, and either find the true culprit or lay the blame somewhere else, before the police arrive.\n\nThe handful of locations can all be searched for clues, but this is where things go a little wrong. All background graphics use a washed out style where individual items are hard to distinguish from each other. That would work fine if their sole purpose was to be backgrounds, but it becomes problematic when you have to search through them. While the hotspots are adequately sized, there is rarely anything to really distinguish them from the rest of the blurry background. It doesn't really help that the locations can be side scrolled for an even larger area to sweep your pointer over in the search of a new hotspot. Reaching the end and finding out that you missed a crucial item is painful, as you do not want to go through the bother of mousing over all the locations again.\n\nMeanwhile, interrogating the other charactres is largely delightful, due to good writing and mostly solid voice acting. Character sprites are overall well done, with enough different poses and expressions to keep things from getting too stale. While it is by no means a large game, it's still impressive that the entire thing is voice acted, and aside from one voice actress' delivery, I was impressed by the quality. There is a bit of intriguing world building going on, but it's really only hinted at, which is a shame, because it could have gone a long way towards explaining the vastly different accents of the characters. As it is, the accents come across more as an attempt to distinguish the characters from each other, which I believe could have been done more elegantly than forcing a foreign accent on certain characters.\n\nSo, is the murder mystery clever and hard to crack? Not really. As long as you find all those darn hotspots, Miss Fortune does rather well in solving most of the mystery herself. You are required to make a few crucial decisions and present evidence, but your character may reach conclusions based on that evidence that you hadn't quite figured out yourself. Regardless, the true culprit and method of murder is not that hard to figure out. Therefore, it is a rather pleasant surprise that you can reach different endings by framing each character for the murder, building up a false case against them. This is actually where most of the fun comes from.\n\nWhile the engine (unity) is adequate for the task, one thing that's really missing is a skip function. Going though the game again is laborious when you have to click your way through the initial dialogue. Thankfully, the save system automatically saves to different files, and there are a few auto saves to help you jump to key places, but a true skip function would have been appreciated.\n\nIn conclusion, for the price being asked, this is a good, but short murder mystery, marred by poor location searching, but impressive for its dialogue and voice acting. I imagine that with one character's delivery being re-recorded, you could sell this as an audio drama at the same price, but here you get an interesting little mystery game as well.", "timestamp_created": 1493798799, "timestamp_updated": 1493798799, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.721177", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31518038": {"recommendationid": "31518038", "author": {"steamid": "76561198009037942", "num_games_owned": 358, "num_reviews": 59, "playtime_forever": 242, "playtime_last_two_weeks": 0, "last_played": 1493713554}, "language": "english", "review": "#TeamHeratio\n\nThis is a new take for me from a visual novel stand point, it was put together with great effort and it really shows from each character and voice for every line so far, its pulling me deeper and deeper into wanting to play more, and I will get to the bottom of this mystery if its the last thing... well probably not the LAST thing I do.\n\nWith great rendered scenes done in what seems like big screenshots, to moving mouths they tried to make sure every nook and cranny was grabbing your attention. I am quite enjoying myself, \nThis was my experience from it and it contains no spoilers as I made sure to stop before anything got in too deep.\n\nMiss fortune is the name, and it is the same as the game!\nAnd this was my experience (NO SPOILERS)\nhttps://www.youtube.com/watch?v=yJY7lqJak2s", "timestamp_created": 1493786122, "timestamp_updated": 1493786122, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.465655", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31517104": {"recommendationid": "31517104", "author": {"steamid": "76561198036252937", "num_games_owned": 33, "num_reviews": 2, "playtime_forever": 359, "playtime_last_two_weeks": 0, "last_played": 1493777204}, "language": "english", "review": "I'm a fan of both mysteries and visual novels, so this game was right up my alley. I really liked the way the mystery was designed such that you can contort the evidence to support you in accusing any of your fellow suspects, leading to multiple unique endings. But if you dig deep enough, you can find the one true solution that ties all the clues together in a completely satisfying manner. I also appreciated the way the interface, art, music, and voice acting contributed to the atmosphere of the game.", "timestamp_created": 1493780021, "timestamp_updated": 1493780021, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.584755", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31507680": {"recommendationid": "31507680", "author": {"steamid": "76561198329547499", "num_games_owned": 88, "num_reviews": 2, "playtime_forever": 192, "playtime_last_two_weeks": 0, "last_played": 1493733322}, "language": "french", "review": "Cette nouvelle est réelement bien réalisée , non pas seulement l'histoire mais aussi les voix (anglaises) qui sont quasiment parfaites. Le seul élément qui m'a quelque peu déçu c'est bien le style graphique mais ce n'est que subjectif.\nL'histoire semble banale , passe partout mais une foix le premier chapitre terminée et le compte a rebours lancé vous ne pourrez pas échaper au jeu.\nVous pouvez voir le premier chapitre ici https://www.youtube.com/watch?v=kT0V3VJ4mF0& au cas ou vous hesiteriez à dépenser vos 5€.\nJe vous le conseille et j'éspère que cette experiece ne vous laissera pas indifferent.", "timestamp_created": 1493737373, "timestamp_updated": 1493739258, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31501410": {"recommendationid": "31501410", "author": {"steamid": "76561198018686466", "num_games_owned": 524, "num_reviews": 89, "playtime_forever": 442, "playtime_last_two_weeks": 0, "last_played": 1502170005}, "language": "english", "review": "Love it so far. Good story, nice artwork, great voice acting, and clean interface. The user interface impressed me in particular since it feels like so many point&click / visual novel games always seem to get something basic wrong that makes gameplay annoying; however, this game nails all of that perfectly with every option I want being available and things working exactly how I hope/expect them to work.", "timestamp_created": 1493709146, "timestamp_updated": 1493709146, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.474732", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31500803": {"recommendationid": "31500803", "author": {"steamid": "76561198059920869", "num_games_owned": 23, "num_reviews": 2, "playtime_forever": 51, "playtime_last_two_weeks": 0, "last_played": 1494014273}, "language": "english", "review": "This is my first visual novel game. It is definately worth adding to your collection. I have been working my way through it with my wife and we both enjoy it very much.", "timestamp_created": 1493705295, "timestamp_updated": 1493705295, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.453403", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31497116": {"recommendationid": "31497116", "author": {"steamid": "76561198078792352", "num_games_owned": 21, "num_reviews": 1, "playtime_forever": 186, "playtime_last_two_weeks": 0, "last_played": 1493681436}, "language": "english", "review": "This visual novel was refreshing in many, many ways. You can tell that a lot of hard work was put into this! Where do I start? The voice-acting is absolutely fantastic and very professional sounding. I mention this because I find a lot of visual novels' voice-acting is very lacking, but not this one TRUST ME. Every character is brilliant in design and sound, contrasting one another beautifully. The condescending and poison-tipped tongued Miss Fortune, the bulky and simple-minded Clops, the snarky and clever Lia, the sweet and pleasant Sherice, the goofy and silly Horatio and then the mysterious and suave Prince Titanico. I like the fact I could choose who I wanted to put the blame on for the crime. The writing and dialogue is great too and managed to get quite a few laughs/giggles out of me. A very high-quality visual novel that I highly recommend!", "timestamp_created": 1493683071, "timestamp_updated": 1493683071, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.546184", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 7, "review_score_desc": "Positive", "total_positive": 29, "total_negative": 0, "total_reviews": 29}}
