{"reviews": {"39275110": {"recommendationid": "39275110", "author": {"steamid": "76561198035629825", "num_games_owned": 298, "num_reviews": 5, "playtime_forever": 108, "playtime_last_two_weeks": 108, "last_played": 1515820309}, "language": "english", "review": "Sure, I'm reviewing this game after playing it for less than an hour. BUT! It is already one of my favorite games. It is so simple, repetitive, and downright addicting. I will go to work tomorrow seeing circles. And the soundtrack just keeps it pumping. One caveat: the control scheme takes some getting used to. I really have to think about which direction will move me which way, which adds complexity especially in the Circle Affinity mode. I appreciate the option between whether I want to play a structured platformer which forgives mistakes (Circa Infinity mode) and a progressively difficult arcade game with instadeath (Circle Affinity mode).\n\nOverall, I appreciate this aesthetic, and it is a game I want people to watch me play.", "timestamp_created": 1515742723, "timestamp_updated": 1515742723, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39170986": {"recommendationid": "39170986", "author": {"steamid": "76561198192153734", "num_games_owned": 29, "num_reviews": 9, "playtime_forever": 128, "playtime_last_two_weeks": 128, "last_played": 1516224362}, "language": "english", "review": "Headache the game", "timestamp_created": 1515380206, "timestamp_updated": 1515380206, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39166750": {"recommendationid": "39166750", "author": {"steamid": "76561198070486995", "num_games_owned": 153, "num_reviews": 7, "playtime_forever": 170, "playtime_last_two_weeks": 152, "last_played": 1515585313}, "language": "english", "review": "Great soundtrack. Really cool artstyle. Perfect mix of challenging and fun. Honestly don't know how this isn't more popular. Bought this on sale, but I would've payed full price. My only complaint is the menu was weird to get used to, but I kind of like it now. Played this offline a lot.", "timestamp_created": 1515365721, "timestamp_updated": 1515365721, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39096289": {"recommendationid": "39096289", "author": {"steamid": "76561197987500240", "num_games_owned": 649, "num_reviews": 26, "playtime_forever": 12, "playtime_last_two_weeks": 0, "last_played": 1513988903}, "language": "english", "review": "Simple and well executed concept. Easily one you can get lost in, as each new twist and wrinkle to the previous formula changes up the metagame further in fun ways.", "timestamp_created": 1515185148, "timestamp_updated": 1515185148, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38972777": {"recommendationid": "38972777", "author": {"steamid": "76561198316766264", "num_games_owned": 23, "num_reviews": 29, "playtime_forever": 10, "playtime_last_two_weeks": 0, "last_played": 1514590839}, "language": "english", "review": "seriously I can't even navigate the game menu dude what the hell", "timestamp_created": 1514898858, "timestamp_updated": 1514898858, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38597432": {"recommendationid": "38597432", "author": {"steamid": "76561197998123612", "num_games_owned": 276, "num_reviews": 6, "playtime_forever": 324, "playtime_last_two_weeks": 0, "last_played": 1494111127}, "language": "english", "review": "The more I think about it, the more I realize this is one of my favorite games ever. The art style, the music, and the simple concept that gets so difficult so quicky, but is so satisfying when you do complete a level you've been trying to master. If you enjoyed any part of the preview video, this game is well worth the $$ and your time.", "timestamp_created": 1514067247, "timestamp_updated": 1514067247, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.522472", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38519530": {"recommendationid": "38519530", "author": {"steamid": "76561198016747572", "num_games_owned": 213, "num_reviews": 57, "playtime_forever": 540, "playtime_last_two_weeks": 0, "last_played": 1514558492}, "language": "japanese", "review": "■オススメな人：トリップ系パズル・難易度の高いアクションパズルが好きな人向け\n\n■どんなゲーム？\n\n10面ごとにボスでﾜｰﾙﾄﾞをクリアしていくアクションゲーム\n操作：左右とスペースで白い円の外側を跳ねて円に飛び込み\n　　　黒い円の内側へともぐりこんで行く\n　　　最後のシマシマボールに飛びこめば面クリアとなる\n　　　円上をぐるぐる廻る操作という点以外は２Ｄのジャンプアクションともいえる\n敵キャラ：基本白だと無害、赤の相手に触れると前の円に戻される\n　　　　　特徴的な形で動作の違いを読み取り、ルートを考えて行く\n　　　　　既存の敵キャラにトゲがつくと同ラインにいる間走りだしたりするなど\n　　　　　要素が追加される面もある\nボスキャラ：独自の攻撃パターン、ダメージを与える方法を持つ\n　　　　　　やられると最初からだが攻撃必要回数は少なめ\n視覚：序盤は白と赤と黒で目がチカチカしそうだが実際には自分がいるラインに注視しておけば問題ない。後半ではオレンジとブルーの色替え要素や、動き回る敵の合間のタイミングを\nはかるのに目が疲れるかもしれない。だが、なによりもエンディングの画面が一番やばいので\nプレイは可能な範囲。\n　　　それよりもライン上を動き回る敵の隙間を縫って次の円へと進むタイミングを計るのに苦労するだろう\n難易度：１～２面は簡単で、新キャラが出るたびに何も無い円＝簡易チェックポイント、落ち着ける場所が\n　　　　用意されていたりと段階を踏みやすいつくりになっている\n　　　　ひたすら動き回りながらアクションをする面と\n　　　　円をいったりきたりして敵の配置を調整したり待ち構えたりする面もある\n　　　　後半では、色換え要素やサークルの移動で敵のラインがかわったりなど\n　　　初見でのクリアはだんだんと難しくなる。\n　　　特に、手順を覚えておかないと戻された際に\n　　やっかいなことになるタイプである。\n音楽：トリップ系で、ガンガンいければのめりこめる感じとなっている\nストーリー：意味ありげな感じで演出され、言語依存もないので味付け程度\nエンドレスモード：時間制限つきでどんどんと次の輪へと進んで行くモード。\n経験地的なものでモードは開放されるもよう\n色が変わってほとんどみえなくなったりなど目に厳しいモード", "timestamp_created": 1513924630, "timestamp_updated": 1514560356, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38449015": {"recommendationid": "38449015", "author": {"steamid": "76561198049018800", "num_games_owned": 160, "num_reviews": 24, "playtime_forever": 440, "playtime_last_two_weeks": 0, "last_played": 1506664602}, "language": "english", "review": "You are Hamit Kamplar, the most successful door-to-door salesman in northwest Iowa. \n\nWhile presenting \"The Lawnmower Opportunity\" at the annual Tri-State Sales Convention, you see a familiar figure rise from his seat. \n\n\"I have a question,\" says the man.\n\n\"Well, I'm going to have Q&A at the end, but sure if it's quick, Dinthel.\"\n\n\"Thank you. And yes, I am Dinthel Chanberg, everyone. My question is: would you like to buy these tennis shoes?\"\n\n\"Uh, haha? I don't underst-\"\n\n\"It is difficult to run in wingtips,\" Dinthel explains, gesturing at your feet. He takes a deep breath and raises his hands up. \"Demon Circle Blaze!\"\n\nLight shoots out from the ground with a high-pitched hum. From the stage, you can see a ring completely surrounds yourself and the audience.\n\nA woman shrieks and you look in that direction. She's standing on the ring. Her head expands, engulfing her torso and arms. The ring begins to rotate and sink into the ground. You can see her body still trembling and morphing as she falls out of sight.\n\n\"Customer number 1!\" Dinthel shouts. \"Demon Circle Blaze!\"\n\nAnother ring appears and all those within it suffer the same fate.\n\nThe horror continues until there are just three people left.\n\n\"Phew,\" Dinthel says, wiping his brow with a silk handkerchief. \"Now on to business. Hamit. Hello? Yes, you, Hamit. Look here. Would you like to buy these tennis shoes?\"\n\nYou had stood silently, mouth agape until now. You shake your head. \"Wh- why, what, wh--\"\n\n\"Yes,\" Dinthel interrupts. \"I understand you have many questions, Hamit. But what I want to know is if you would like to buy these tennis shoes. They look to be your size.\"\n\nYou don't know what Dinthel is after, but you feel it would be unwise to refuse his offer outright. \"S- sure...\"\n\n\"Fantastic,\" Dinthel says, tossing them toward you. \"Then we have a deal. Don't wait, put them on. How are they?\"\n\nYou change into the shoes and walk around a bit. \"They fit. They feel great,\" you report. You're not lying. They truly are the best shoes you've ever worn. \"Um, so how much are they?\"\n\nDinthel smiles. \"Your soul.\"\n\nYou fall and everything goes black.\n\n-----------------------------------------------------\n\n[h1] Pros [/h1]\n+ Hard, but not overly frustrating\nYou will die a lot. But the penalty for dying is low; you're simply knocked back to the previous circle.\nAlso, stages have a few \"save points\". These are circles where you cannot die and thus cannot get knocked back further.\n\n+ Varied gameplay\nThe game stays (mostly) fresh with several kinds of enemies and mechanics.\n\n+ Great narrative and characters\nI really liked Dinthel.\n\n+ Circle Affinity: an additional, endless mode where you go as many circles deep as you can on one life.\nThe game provides a few different stages with goals for how deep to get.\n\n\n[h1] Cons [/h1]\n- The menu UI is unclear. The first time I played, I started playing the Circle Affinity mode instead of the original game.\n\n- A little bit too long and repetitive.\nDespite the good variance, the game does still drag, especially in the last worlds. If you edited out  maybe 15%, the overall game would have been better.\n\n- No voice acting! \n\n- Ending is a bit abstract. I had come to really care for the characters and wanted more closure.", "timestamp_created": 1513758100, "timestamp_updated": 1513885319, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.547740", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38197818": {"recommendationid": "38197818", "author": {"steamid": "76561198253086852", "num_games_owned": 37, "num_reviews": 4, "playtime_forever": 90, "playtime_last_two_weeks": 0, "last_played": 1512886852}, "language": "english", "review": "now that's the bruddas", "timestamp_created": 1512873720, "timestamp_updated": 1512873720, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.429331", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37583780": {"recommendationid": "37583780", "author": {"steamid": "76561197994751517", "num_games_owned": 1828, "num_reviews": 6, "playtime_forever": 401, "playtime_last_two_weeks": 0, "last_played": 1511723670}, "language": "english", "review": "I could best describe it as a really challenging puzzle platformer. Every level starts you on the outside of a circle where you must enter a \"door\" so you can get on the inside layer of the circle before jumping to the next circle, repeating these steps ad finitum until you reach the core. The first step is getting used to the controls (really simple you can only go left or right and jump) and then getting used to never losing your character out of your sight while you are drowned in a barrage of layers. Every level the game keeps introducing new challenges in your way, the circles start moving, new type of enemies and a few diabolical surprises. Trust me you will die a lot, especially if like me you started with the idea of perfecting all the levels (I have now long abandoned such foolish dream)\nThe game demands all of your attention at all times. Each time you make a mistake, you are set back a circle without much of a pause, so if you fail to remain calm you may start chaining mistakes and get sent way way back. You better clean those tears cause there is only one way to the end, it's persevering.\nOnce you manage to reach the third world, oh boy, the game not only will require all of your dexterity and concentration, it will find your determination still lacking and will now demand you grow a third eye if you wish to be worthy of his challenge !\nStill sweating, once you surpass the third world, maybe you'll go back to the first few levels to get some achievements and you'll wonder how could you ever have thought theses introductory levels to be hard in the past !\n\nIt's one the hardest game i've played in my life, one of the few that made me give up numerous times. (I still need to finish world 4 and I don't think my mind can cope with the literal nightmare that probably awaits my soul in world 5) But it never felt unfair, you just need to get a grip and never lose hope !\nThe game looks great and is mesmerizing just to look at (but really try to not get lost in there).\nAlso they added for free, a stressful (but really fun !) infinite mode cleverly named Circle Affinity, that I keep coming back to.\nAnd let's not forget the beautiful but haunting soundtrack that completes this singular package.\n\nStorywise i'm pretty sure the game is about depression, but for me Circa Inifnity is a dazzling descent into the hearth of madness.", "timestamp_created": 1511643934, "timestamp_updated": 1511646372, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.583333", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37511647": {"recommendationid": "37511647", "author": {"steamid": "76561198238955008", "num_games_owned": 37, "num_reviews": 2, "playtime_forever": 815, "playtime_last_two_weeks": 0, "last_played": 1503343912}, "language": "english", "review": "This game is split in two parts:\n\n - challenges that are equal parts puzzle and dexterity\n - an infinite mode in which the puzzle aspect is less present and the focus lies on dexterity and reaction time\n\nBoth modes are well fleshed out and very enjoyable. Both modes also have a lot of replayability: the infinite mode for obvious reasons, but the challenges as well, in trying to improve completion time.\n    The graphics and soundtrack of this game are very energetic. \n    The gameplay is fresh, interesting and, though simple in concept, very difficult. If it suffers, it is because there is too much going on at once sometimes.", "timestamp_created": 1511611777, "timestamp_updated": 1511611777, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.524268", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37294654": {"recommendationid": "37294654", "author": {"steamid": "76561198199186301", "num_games_owned": 381, "num_reviews": 5, "playtime_forever": 782, "playtime_last_two_weeks": 0, "last_played": 1511842525}, "language": "english", "review": "At first glance Circa Infinity apears an overly simple, quirky, genreless, indy game. Within the first couple levels it becomes so... so much more. Simply eloquent this game is a non-traditional hand-eye platformer of godlen era proportions that is not just mentally demanding but an erudite work of art remeniscent of a bygone era of inovation and injenuity. \n\nSuch simple gimmicks, it is amazing that this has not been done before outside of old school atari paddles; and with such cleverly designed levels requiring more problem solving than hardcore platforming (of which it requires in spades as well) coupled with an exilerating sound track it is surprising more folks have not jumped onto this game. At the writing of this review less than 8,000 people own this game, and in all honesty I hope above all else this becomes a sleeper game of cult propoertions. It most definitely transcends and expands genres that are sorely under developed and deserves a lot more exposure than it has gotten until now.\n\nThis game is laudable on so many levels, and I for one cannot recomend it highly enough\n\nIn full disclosure, I wrote this review hastilly for the Steam nominations Badge, but i have every intention of coming back and editing this to be an actually useful review giving this game more of the time it deserves.\n\nAlso of note it is on sale on steam at the moment, and an extra sale on the humble site", "timestamp_created": 1511515005, "timestamp_updated": 1511576913, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36860536": {"recommendationid": "36860536", "author": {"steamid": "76561198148918936", "num_games_owned": 167, "num_reviews": 5, "playtime_forever": 286, "playtime_last_two_weeks": 0, "last_played": 1511395578}, "language": "spanish", "review": "Gameplay sencillo pero dificil de dominar, es decir, solo tienes que correr dentro o fuera de la circunferencia que es el escenario, mientras evitas/brincas a los \"enemigos\" y saltas a la siguiente circunferencia! Facil?   HA!  10 niveles por capitulo de locura circular y cada jefe es una pasada de LSD, pero la cereza del pastel es que tiene un soundtrack fuera de este mundo, decididamente deberias darle una oportunidad! frustracion asegurada!   calificacion: \"!#$%@ / 10", "timestamp_created": 1511394391, "timestamp_updated": 1511395699, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36791797": {"recommendationid": "36791797", "author": {"steamid": "76561198006889794", "num_games_owned": 528, "num_reviews": 7, "playtime_forever": 777, "playtime_last_two_weeks": 0, "last_played": 1480225265}, "language": "english", "review": "Fun, unique, bizzare, and mindbending. Each chapter I reached added a new wrinkle into the formula, stacked on the previous one that made me terrified of how my attention was being split to account for a new threat, yet again. Pretty good for speedrunners too, if you're capable of handling it!\n\nAlso it's simply trippy as heck, so that's nice too.", "timestamp_created": 1511383171, "timestamp_updated": 1511383171, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36392328": {"recommendationid": "36392328", "author": {"steamid": "76561198025188158", "num_games_owned": 263, "num_reviews": 154, "playtime_forever": 270, "playtime_last_two_weeks": 0, "last_played": 1512878102}, "language": "english", "review": "This game isn't particularly long but man it feels like it's going long, in a good way? \nIt's soundtrack is its biggest draw I'd say. It's very good. \nIt starts out simple but the difficulty definitely ramps up and introduces new concepts pretty smoothly, albeit maybe with more padding feeling. Bosses are also particularly brutal and unforgiving. \n\nThere's also a 2nd mode of play which is a 1 touch kill gauntlet. \n", "timestamp_created": 1510217511, "timestamp_updated": 1510217511, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36289858": {"recommendationid": "36289858", "author": {"steamid": "76561198261513956", "num_games_owned": 63, "num_reviews": 1, "playtime_forever": 161, "playtime_last_two_weeks": 0, "last_played": 1510656834}, "language": "english", "review": "If you like arcade style games, have $5 and can get 1 steam game, make it this one. This game is astonishing. The soundtrack is perfect, great art style, and an awesome difficulty progression. Music 10/10, gameplay 10/10, sound effects 9/10, and artstyle 10/10. This game even has a demo version for free, so if you're not sure whether or not you would like it, try it!", "timestamp_created": 1509862409, "timestamp_updated": 1509862409, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36060261": {"recommendationid": "36060261", "author": {"steamid": "76561198043346855", "num_games_owned": 266, "num_reviews": 339, "playtime_forever": 473, "playtime_last_two_weeks": 25, "last_played": 1516422098}, "language": "english", "review": "Circa Infinity will trick you, kick you while you're down, and laugh.\n\nIt's too complicated for its own good.  It's anger-inducing.  It'll make you wallow in frustration as you're forced upon mistakes to replay difficult levels you just solved - levels you might just also mess up and further set yourself back.\n\nYet, its intensely sensual art and unique premise make it all worth another go.  From an artistic standpoint, Circa Infinity is simply phenomenal.  It's not afraid to surprise and take risks.  It has something to say, and its briliance will make your jaw drop to the floor.\n\nIn all ways, Circa Infinity intends to be brain-melting.  It does exactly that.", "timestamp_created": 1509149427, "timestamp_updated": 1513485663, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.475732", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35491718": {"recommendationid": "35491718", "author": {"steamid": "76561198125716857", "num_games_owned": 151, "num_reviews": 22, "playtime_forever": 75, "playtime_last_two_weeks": 0, "last_played": 1509873261}, "language": "russian", "review": "Мои глаза горят\nну... и пукан тоже\nвери сложно особенно с 3ей части, где нужно управлять двумя персноажами\nВсе что нужно для прохождения этой игры это иметь чувство к таймингу\nЕсли собираетесь делать ачивки то игра для вас превратится в [spoiler]с[/spoiler]сущий ад\nА так игра очень греет стул \n[spoiler]Очки на -10 пожалуйста[/spoiler]", "timestamp_created": 1507199987, "timestamp_updated": 1507200292, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.525862", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35367859": {"recommendationid": "35367859", "author": {"steamid": "76561198066948652", "num_games_owned": 75, "num_reviews": 5, "playtime_forever": 107, "playtime_last_two_weeks": 0, "last_played": 1498700012}, "language": "english", "review": "I haven't finished this game yet since I'm busy with school, work, and other games. However, it's a steal. Generally speaking the meta for most Indie games I've seen is all about [genre] remix, remix, remix. There's absolutely nothing wrong with that, but this is why Circa Infinity really stands out. While definitely a platformer, it has this effect of feeling like you've gone from playing in Cartesian Coordinates to Polar Coordinates. The delight in this is that your skills from years of platformers will translate, but you will find yourself utilizing them in unique ways. \n\nYou may experience these types of feelings: where/when you'd normally be focused on positioning, you'll have to focus on timing; when/where you'd emphasize timing, you actually had to emphasize positioning. Etc. The classic feeling of breezing to grappling to breezing to grappling is here as always but again, the cirular/sinusoidal nature of the game gives a new spin on this.\n\nCirca Infinity contains \"Postmodern\" themes in a form more pure than other games and the soundtrack is quite pleasent. If you enjoy novelty, this is a solid pick. Cheers", "timestamp_created": 1506842377, "timestamp_updated": 1506842377, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35280320": {"recommendationid": "35280320", "author": {"steamid": "76561198038027462", "num_games_owned": 118, "num_reviews": 31, "playtime_forever": 288, "playtime_last_two_weeks": 0, "last_played": 1506639978}, "language": "english", "review": "I wouldn't call this game a bad game, but it lacks something that I'm unable to identify. There's just no incentive to play the game. It can be challenging if you so choose (going for no death and going as quickly as possible), but the fact that you can stop at any given time to think about the next segment builds no tension. It's not a puzzle game, you're not forced to a certain rythm like in Super Hexagon, and the game is not as mechanically challenging as a Super Meat Boy. The music is also chill, which is pretty underwhelming for a game of this genre because it's not stimulating you to push yourself. All in all, there's just nothing exciting to do, and I find myself leaving the game just 10 minutes after opening it.", "timestamp_created": 1506653608, "timestamp_updated": 1506653608, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.513111", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35067961": {"recommendationid": "35067961", "author": {"steamid": "76561198044992765", "num_games_owned": 35, "num_reviews": 55, "playtime_forever": 67, "playtime_last_two_weeks": 0, "last_played": 1505838938}, "language": "koreana", "review": "재미는 있는데 너무 어렵다...\n스테이지가 원형이다 보니 왼쪽 오른쪽 방향이 헷갈리는 경우가 많다.\n\n또 적에 한번 닿으면 이전 플랫폼으로 튕겨나가는 방식이라 한번 말리면 하염없이 밀려나간다.\n무한 반복으로 어찌어찌 해내곤 있지만 스테이지 깰 때마다 피곤해져서 오래는 못하겠네ㅠㅠ", "timestamp_created": 1505838995, "timestamp_updated": 1505911372, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35018255": {"recommendationid": "35018255", "author": {"steamid": "76561198132934934", "num_games_owned": 8, "num_reviews": 3, "playtime_forever": 58, "playtime_last_two_weeks": 0, "last_played": 1505569002}, "language": "koreana", "review": "zzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz", "timestamp_created": 1505638884, "timestamp_updated": 1505638884, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.452675", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34827409": {"recommendationid": "34827409", "author": {"steamid": "76561198107268555", "num_games_owned": 29, "num_reviews": 7, "playtime_forever": 169, "playtime_last_two_weeks": 0, "last_played": 1507648850}, "language": "english", "review": "This game is not bad. It's not fun, but it's not supposed to be. It's a spiraling descent into madness and depression while battling the demons of your own heart and working towards inner peace. It's gameplay feels exactly like depression does, and it's amazing. But it's not fun.\n\nYou want fun, you need to go somewhere else. If you want to play something that's challenging and very good at pushing into your emotions? Play this.", "timestamp_created": 1504924176, "timestamp_updated": 1504924176, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.469557", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34819688": {"recommendationid": "34819688", "author": {"steamid": "76561198070632823", "num_games_owned": 45, "num_reviews": 9, "playtime_forever": 144, "playtime_last_two_weeks": 0, "last_played": 1511535137}, "language": "spanish", "review": "Excelente! Artisticamente y desde la jugabilidad un 10. La curva de dificultad es suave pero siempre para arriba proponiendote entre nivel y nivel nuevas mecánicas y forzandote a superarte a vos mismo.\n\nRecomendadisimo", "timestamp_created": 1504893206, "timestamp_updated": 1504893206, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34523916": {"recommendationid": "34523916", "author": {"steamid": "76561198030175687", "num_games_owned": 51, "num_reviews": 9, "playtime_forever": 34, "playtime_last_two_weeks": 0, "last_played": 1503820561}, "language": "koreana", "review": "TEST UR BRAIN", "timestamp_created": 1503822286, "timestamp_updated": 1503822286, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34207432": {"recommendationid": "34207432", "author": {"steamid": "76561198010556014", "num_games_owned": 197, "num_reviews": 14, "playtime_forever": 208, "playtime_last_two_weeks": 0, "last_played": 1501774782}, "language": "english", "review": "If you liked Super Hexagon, you won't necessarily like this. Super Hexagon's rotation controls were fine because the game was simple and once you got the hang of them you could reach any level of mastery if you pushed yourself far enough. This game is different because you don't just have to focus on the confusing controls, but also the enemies that are pressuring you to act AND in later levels the wedges also start moving around making it very difficult to focus on everything at the same time. I'm not even halfway through the game and it's becoming increasingly frustrating, it's not a game you can play casually (after the second world). It takes dedication just to complete a level, and hours on top of that to finish it in time to get all the achievements.\n\nThe achievements all feel contrived, they're all formulaic and mundane (finish world X in Y time and repeat for all worlds) not rewarding or intuitive at all.\n\nThe game does have it's good points, the controls are fluid, and the sound effects and music are especially suited to a game like this. Everything feels, looks, and sounds snappy, but that's all undermined by the fake difficulty. I can't even imagine how nightmarish the end-game levels are. It would be okay if they ramped up the difficulty slowly but instead they introduce a new mechanic and then combine them with previous mechanics which makes the game too hard too fast. It's a nice little game, but I have basically zero incentive to finish it, and I completed Super Meat Boy 100% so I know what makes a good challenge.", "timestamp_created": 1502605887, "timestamp_updated": 1502605887, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.539372", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33994761": {"recommendationid": "33994761", "author": {"steamid": "76561198163208829", "num_games_owned": 31, "num_reviews": 2, "playtime_forever": 10, "playtime_last_two_weeks": 0, "last_played": 1498994604}, "language": "schinese", "review": "不推荐\n就单单从预告片中来看，Circa Infinity本应该是不错的游戏，颇有风格的配乐再加上一点操作难度，可以让人沉迷进游戏的节奏中。 但当我开始游玩后，很无聊 。\n游戏本身的配乐很不错，可我无法使自己头脑中的节奏和配音融合在一起。游戏本身也并没有太大的挑战性（可能因为我玩的太短），感觉就像在强迫自己解一道写过多次题目。我没有感受到应该会有的欣喜或者愉悦。\n或许这是我本人的问题，但这个游戏毫无疑问与我的预想偏差很大，所以，不推荐 。", "timestamp_created": 1501772792, "timestamp_updated": 1501772838, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33947757": {"recommendationid": "33947757", "author": {"steamid": "76561198131179023", "num_games_owned": 142, "num_reviews": 10, "playtime_forever": 130, "playtime_last_two_weeks": 0, "last_played": 1502203271}, "language": "koreana", "review": "ㄹㅇ 개어렵다 멀티태스킹 능력 극한에 피지컬도 필요 근데 솔직히 좀 재밌게 하는중", "timestamp_created": 1501589060, "timestamp_updated": 1501589060, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33838533": {"recommendationid": "33838533", "author": {"steamid": "76561198019848791", "num_games_owned": 349, "num_reviews": 70, "playtime_forever": 39, "playtime_last_two_weeks": 0, "last_played": 1501179936}, "language": "english", "review": "Up until after the first boss, this game is fantastic! Then it's boring afterwards.", "timestamp_created": 1501180028, "timestamp_updated": 1501180028, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.368987", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33461047": {"recommendationid": "33461047", "author": {"steamid": "76561198089221552", "num_games_owned": 477, "num_reviews": 7, "playtime_forever": 78, "playtime_last_two_weeks": 0, "last_played": 1502515159}, "language": "spanish", "review": "Uno de esos cabrones con una mecánica extremadamente simple y que te tienen preparadas mil y una jugarretas para matarte y sacarte de quicio. Impecable diseño, banda sonora de quitarse el sombrero. MUY recomendado.", "timestamp_created": 1499794290, "timestamp_updated": 1499794290, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33318005": {"recommendationid": "33318005", "author": {"steamid": "76561197997335747", "num_games_owned": 350, "num_reviews": 34, "playtime_forever": 100, "playtime_last_two_weeks": 0, "last_played": 1499314333}, "language": "english", "review": "I'm all for minimalist games that can just take one idea and run with it.  In Circa Infinity you venture through layers of circles each offering incremental challenges.  Simply run, jump, and dodge your way through each new challenge as you quickly progress deeper and deeper.  This is very much an arcade style game focusing mostly on high-scores and survival.  As the difficulty ramps up it becomes quite a thrilling experience forcing you to make split second decisions.  Speaking honestly Circa Infinity isn't setting out to reinvent the wheel but it is does manage to spin a new yarn.  Alright, gibberish idioms aside I'll try to make sense of this game.\n\nThe gameplay sits at the very core of this experience.  You sometimes play as a man, women, or both running around these large circles.  Starting outside the circles you have to get in through a gate at which point you then proceed to run around the inside.  Inside is a floating ball that will take you to the outside of the next circle pushing the last circle out to towards the corners of your screen.  Its makes a lot more sense once you see it but for now just imagine Alice falling down the rabbit hole.  Of course this wouldn't be much of a game without obstacles in your path, at which point monsters come into the picture.\n\nThere are a number of beasts trying to block you from completing your objective.  Actually many of them aren't trying to hard as they just sit around crying or hover without moving.  It will be up to you to jump or roll as necessary to progress.  Eventually you'll encounter more menacing threats such as creatures that chase you around or block our path entirely.  Although colliding with a monster only bumps you back one zone this game is so fast-paced that it is easy chain one mistake after another and end up a handful of zones back.  However, once you feel comfortable with a level and can be fun to go back to either improve your time or try to pass the stage with less deaths.\n\nThe minimalist visuals make it much easier to keep track of everything happening on screen at any one time.  You'll only have three or so colors on screen making it easy to distinguish where everything is at any given moment.  This is all super important because it can be very disorienting to keep track of what is your left and right when running around on a round plane.  Thankfully the music is very soothing and will help calm your nerves in what can be quite an intense game.  The sound-effects also fit very nicely and really have a pleasant pop to them.\n\nHow much you'll like this game will really depend on the type of gamer you are.  If you want a challenge and you enjoy pushing yourself to perfection then I believe this will be right up your alley.  Even if thats not really your thing there is a lot to admire about this unique concept and its clever art design.  However, this is a really tough game and after about a hour and half I was feeling like I was ready to move on.  I enjoyed the time I spent playing Circa Infinity but I was starting to hit that ceiling of difficulty where the challenge was becoming less fun and more of a chore.  That all being said this is a rather inexpensive game it does need a big host of hours to get your worth out of it.", "timestamp_created": 1499361615, "timestamp_updated": 1499361615, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.558406", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33173110": {"recommendationid": "33173110", "author": {"steamid": "76561197994506141", "num_games_owned": 380, "num_reviews": 2, "playtime_forever": 58, "playtime_last_two_weeks": 0, "last_played": 1499068800}, "language": "english", "review": "Very good game. One of the most original I've seen in a while. The controls are very good, feels like you are in complete control the entire time and that any mistake is solely to blame on yourself, which is surprising because sometimes platformers like this where you switch directions while being upsidedown can feel wrong or unresponsive. I am the type of person to refuse to play a game if it is slightly unresponsive or if the controls are not well suited for the game, this game is very responsive and the controls work perfectly for it.\n\nThe soundtrack is also very good and fits the mood of the game. The bosses are also very well designed (that I've seen so far, this game was so good I felt the need to review it just to help it out right away), as are the enemies, both mechanic wise and how their design reflects their mechanics in the game. The game lends itself to speed running as well, with achievements for it, if you're into that.", "timestamp_created": 1499069465, "timestamp_updated": 1499069465, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32999245": {"recommendationid": "32999245", "author": {"steamid": "76561198090203455", "num_games_owned": 29, "num_reviews": 26, "playtime_forever": 286, "playtime_last_two_weeks": 0, "last_played": 1498811098}, "language": "english", "review": "Circa Infinity's gameplay happens within a bunch of circles. Within each circle, you are faced with a bunch of enemies/obstacles to overcome in order to advance to the next circle. Simple, right? NOPE.\nThis game gets absolutely challenging as you go (especially if you're gunning for the no deaths achievement). It will constantly introduce increasingly difficult enemies that you have to avoid as you progress, as well as throw sections with different types of enemies. Conquering each section will feel deeply satisfying once you figure it out.\nThe bosses are rather creative in how you defeat them, and are even more challenging than the rest of the game.\nThere's also a fun arcade mode where you try to survive an endless gauntlet of enemies, which will give you something to do once you finish the main game.\nThe game is not without flaws, however. The controls certainly have a learning curve to them, and will make playing more difficult than it already is if you don't get used to it. And sometimes, your jumps won't be enough to get you into the next section of the stage, which can lead to potentially infuriating deaths.\nAll in all, I think pros outweigh cons here. If you're looking for a real challenge, this game is for you.", "timestamp_created": 1498754719, "timestamp_updated": 1498754719, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32979279": {"recommendationid": "32979279", "author": {"steamid": "76561198356039916", "num_games_owned": 148, "num_reviews": 14, "playtime_forever": 604, "playtime_last_two_weeks": 0, "last_played": 1509787921}, "language": "koreana", "review": "나의 방향감각, 기억력, 멀티태스킹, 반응속도 등의 두뇌회전이 얼마나 구린가 일깨워주는 하드코어한 게임. 간단한 그래픽과 사운드트랙도 마음에 든다.", "timestamp_created": 1498724430, "timestamp_updated": 1498808071, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32962896": {"recommendationid": "32962896", "author": {"steamid": "76561198054846316", "num_games_owned": 199, "num_reviews": 11, "playtime_forever": 94, "playtime_last_two_weeks": 0, "last_played": 1484155902}, "language": "english", "review": "What a stunning, mesmerizing trip this is. The hypnotic visuals and pumping soundtrack really push this one above and beyond its simple premise and the controls are tight and well telegraphed, if that makes any sense: the sound and visual cues are really clear and punchy. Good thing there was a demo to give me that great first impression. I'm pretty pish at it, getting frustrated in the later levels as it gets mind bending-ly complex as they start to stack every element they’ve slowly got you used to over the course of the early levels on top of each other: it becomes a bit of a pat your head and rub your belly kinda thing and quite nerve racking. Don’t let that scare you away from experiencing it though; it’s a really impressive stylish game. The extra endless modes are great too, including the one that has you as two mirrored characters at once.", "timestamp_created": 1498690849, "timestamp_updated": 1498690849, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.703460", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32814539": {"recommendationid": "32814539", "author": {"steamid": "76561198293004290", "num_games_owned": 710, "num_reviews": 39, "playtime_forever": 231, "playtime_last_two_weeks": 0, "last_played": 1498983903}, "language": "koreana", "review": "재밌습니다", "timestamp_created": 1498483087, "timestamp_updated": 1498483087, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32191726": {"recommendationid": "32191726", "author": {"steamid": "76561198241200804", "num_games_owned": 478, "num_reviews": 30, "playtime_forever": 123, "playtime_last_two_weeks": 0, "last_played": 1477616045}, "language": "english", "review": "                     this game I will\n              beat                        never\n      never                                       beat\n will                                                       this\nI                                                                  game                                                                    \n game                                                     will\n       this                                             never\n            beat                                 beat\n                   never will I game this", "timestamp_created": 1496638698, "timestamp_updated": 1496638698, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.380566", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31931746": {"recommendationid": "31931746", "author": {"steamid": "76561198077956482", "num_games_owned": 182, "num_reviews": 24, "playtime_forever": 42, "playtime_last_two_weeks": 0, "last_played": 1505924681}, "language": "english", "review": "That's a p e n i s", "timestamp_created": 1495619686, "timestamp_updated": 1495619686, "voted_up": true, "votes_up": 9, "votes_funny": 5, "weighted_vote_score": "0.386144", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31653205": {"recommendationid": "31653205", "author": {"steamid": "76561198029125872", "num_games_owned": 91, "num_reviews": 16, "playtime_forever": 541, "playtime_last_two_weeks": 0, "last_played": 1495947716}, "language": "english", "review": "Very unique circle based puzzle game. As a person who appreciates indie games, I gotta recommend this one. It becomes fairly difficult towards the end, and the ending scene is [b]quite[/b] visually stimulating. Oh yeah, the BGM is very nice as well, and very unique.", "timestamp_created": 1494359281, "timestamp_updated": 1495947599, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31530569": {"recommendationid": "31530569", "author": {"steamid": "76561198104636639", "num_games_owned": 70, "num_reviews": 14, "playtime_forever": 23, "playtime_last_two_weeks": 0, "last_played": 1493842046}, "language": "english", "review": "My nerves never hated anything so much", "timestamp_created": 1493842090, "timestamp_updated": 1493842090, "voted_up": false, "votes_up": 3, "votes_funny": 6, "weighted_vote_score": "0.277003", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31512720": {"recommendationid": "31512720", "author": {"steamid": "76561198024759929", "num_games_owned": 452, "num_reviews": 7, "playtime_forever": 424, "playtime_last_two_weeks": 0, "last_played": 1497540338}, "language": "brazilian", "review": "Jogo de Puzzle Sensacional", "timestamp_created": 1493755854, "timestamp_updated": 1493755854, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31429671": {"recommendationid": "31429671", "author": {"steamid": "76561198005833311", "num_games_owned": 786, "num_reviews": 79, "playtime_forever": 92, "playtime_last_two_weeks": 0, "last_played": 1493684149}, "language": "schinese", "review": "玩着玩着就把自己绕晕了，好游戏，但是不适合残疾人玩（没错，我怀疑是不是手不好使了）", "timestamp_created": 1493433692, "timestamp_updated": 1493433692, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31403052": {"recommendationid": "31403052", "author": {"steamid": "76561197986235953", "num_games_owned": 472, "num_reviews": 26, "playtime_forever": 34, "playtime_last_two_weeks": 0, "last_played": 1501249861}, "language": "spanish", "review": "Una obra de arte, digna de reconocimiento,la cual tenia que estar expuesta en el mejor museo", "timestamp_created": 1493330955, "timestamp_updated": 1493330955, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31227583": {"recommendationid": "31227583", "author": {"steamid": "76561198272043742", "num_games_owned": 56, "num_reviews": 13, "playtime_forever": 61, "playtime_last_two_weeks": 0, "last_played": 1484350310}, "language": "english", "review": "I've never played a circular platformer before. This is one of the most challenging games an old-school, precision-based gamer can ever wish for! Wierd and wonderful artwork; hours of entertainment. Worth whatever price you may pay.", "timestamp_created": 1492556712, "timestamp_updated": 1492556712, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30145689": {"recommendationid": "30145689", "author": {"steamid": "76561198097034446", "num_games_owned": 80, "num_reviews": 5, "playtime_forever": 463, "playtime_last_two_weeks": 0, "last_played": 1513410333}, "language": "schinese", "review": "玩到第五大关，总结一下，\n就是长颈鹿我cmn，\n再说一遍，长颈鹿我cmn，\n每次都看穿了套路，正要过关，\n就突然冲出来一只长颈鹿！！\n", "timestamp_created": 1487956189, "timestamp_updated": 1487956189, "voted_up": true, "votes_up": 5, "votes_funny": 3, "weighted_vote_score": "0.511979", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30055562": {"recommendationid": "30055562", "author": {"steamid": "76561198063941308", "num_games_owned": 300, "num_reviews": 76, "playtime_forever": 474, "playtime_last_two_weeks": 0, "last_played": 1495319262}, "language": "english", "review": "[h1] One word for each aspect of this game.\t[/h1]\n\nStory - Minimalistic.\nCharacters - Mystifying.\nGameplay - Perfect.\nImmersion - Riveting.\nEnvironment - Stimulating.\nGraphics - Pixel.\nSound - Fantastic.\nMusic - Incredible.\n\nOverall - Impeccable.", "timestamp_created": 1487590609, "timestamp_updated": 1487669619, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.626761", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30049291": {"recommendationid": "30049291", "author": {"steamid": "76561198228732548", "num_games_owned": 81, "num_reviews": 1, "playtime_forever": 557, "playtime_last_two_weeks": 0, "last_played": 1488146267}, "language": "english", "review": "I thought there were only Seven Circles in Hell.", "timestamp_created": 1487558985, "timestamp_updated": 1487558985, "voted_up": true, "votes_up": 5, "votes_funny": 13, "weighted_vote_score": "0.556777", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29737285": {"recommendationid": "29737285", "author": {"steamid": "76561198114410155", "num_games_owned": 32, "num_reviews": 1, "playtime_forever": 370, "playtime_last_two_weeks": 0, "last_played": 1484977783}, "language": "koreana", "review": "그래픽보고 산 게임. 분명 호불호는 갈리겠지만 저로서는 굉장히 좋네요. 게임성도 괜찮음.", "timestamp_created": 1486370102, "timestamp_updated": 1486370102, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525862", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29722524": {"recommendationid": "29722524", "author": {"steamid": "76561198054531127", "num_games_owned": 109, "num_reviews": 26, "playtime_forever": 74, "playtime_last_two_weeks": 0, "last_played": 1505315128}, "language": "english", "review": "a very weird and unique game. platformer at its core. but you must be extremely well versed in precision jumping, to have a fighting chance. other than that the art style and graphics are pixel art (beautiful if i may add) , the music is amazing . and you should buy this game for you or a friend of yours who likes these kind of games ;).", "timestamp_created": 1486311304, "timestamp_updated": 1486311304, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.533786", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29612561": {"recommendationid": "29612561", "author": {"steamid": "76561198181058953", "num_games_owned": 145, "num_reviews": 27, "playtime_forever": 8, "playtime_last_two_weeks": 0, "last_played": 1485804337}, "language": "german", "review": "Konzentration angesagt :)", "timestamp_created": 1485891016, "timestamp_updated": 1485891016, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29438855": {"recommendationid": "29438855", "author": {"steamid": "76561198106311219", "num_games_owned": 732, "num_reviews": 6, "playtime_forever": 367, "playtime_last_two_weeks": 0, "last_played": 1508848642}, "language": "schinese", "review": "通关大概用了4个小时，最开始是看谜之声的直播时候看到的这款游戏，[strike]然而他玩了10分钟就放弃了[/strike]。\n看宣传片觉得玩这个游戏会很晕，自己上手玩的时候发现其实还好。大部分关卡只要找对规律就可以通过，少数关卡需要一定的手速。\n一共五大关，每大关有十小关，每个小关里难度都是循序渐进的，操作小人躲避怪物进入圆环的中心就是游戏的目标，总体关卡数还是挺多的。每次死亡的时候会倒退一圈，这种时候一定要耐住性子，按照之前的规律再走一遍即可通过，每一个小关里都有几圈是绝对安全的，以防你从最后一圈掉回第一圈。BOSS战设计的很巧妙，有一种让人眼前一亮的感觉。\n音乐方面配合着怪物的旋转意外的带感，还是挺好听的。\n剧情方面似乎是两个人通过重重磨难，终于突破了无尽环绕的束缚最后在一起了。[spoiler] 万万没想到打这个还要被喂狗粮[/spoiler]\n总体下来还是很推荐的，可以趁打折入手。", "timestamp_created": 1485160080, "timestamp_updated": 1485238075, "voted_up": true, "votes_up": 21, "votes_funny": 3, "weighted_vote_score": "0.758370", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29220753": {"recommendationid": "29220753", "author": {"steamid": "76561198257818182", "num_games_owned": 13, "num_reviews": 6, "playtime_forever": 28, "playtime_last_two_weeks": 0, "last_played": 1499506822}, "language": "english", "review": "NICE BGM!!!!", "timestamp_created": 1484302193, "timestamp_updated": 1484302193, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29195560": {"recommendationid": "29195560", "author": {"steamid": "76561198062603596", "num_games_owned": 268, "num_reviews": 47, "playtime_forever": 18, "playtime_last_two_weeks": 0, "last_played": 1484188670}, "language": "english", "review": "Yeah yeah, hardcore Super Hexagon player here, this game is also awesome, but listen, put some f††† labels in the menu, I shouldn't have no idea what I'm doing just because they need their menu to be all hipster and uninformative. And no I will not give this game a passing review until I can read and understand the menu at first glance. I'm so sick of this snobby indie dev crap.", "timestamp_created": 1484188901, "timestamp_updated": 1484188901, "voted_up": false, "votes_up": 22, "votes_funny": 3, "weighted_vote_score": "0.330879", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28990364": {"recommendationid": "28990364", "author": {"steamid": "76561198013593872", "num_games_owned": 142, "num_reviews": 1, "playtime_forever": 303, "playtime_last_two_weeks": 0, "last_played": 1483765677}, "language": "english", "review": "One of the most interesting puzzle platformers that I've played. trippy and mid-bending visuals that are constantly making you think, coupled with amazing head-bopping music makes Circa Infinity one of my favourite puzzle games to come out in a while. Beginning with simple concepts that quickly grow into complex puzzles makes this game a definite gem.", "timestamp_created": 1483484624, "timestamp_updated": 1483484624, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28983670": {"recommendationid": "28983670", "author": {"steamid": "76561198102375971", "num_games_owned": 59, "num_reviews": 13, "playtime_forever": 387, "playtime_last_two_weeks": 0, "last_played": 1510264375}, "language": "english", "review": "A trippy game that tests your concentration and ability to adapt on the go. The soundtrack is amazing keeping you even more involved.", "timestamp_created": 1483468139, "timestamp_updated": 1483468139, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28961594": {"recommendationid": "28961594", "author": {"steamid": "76561198112421246", "num_games_owned": 53, "num_reviews": 25, "playtime_forever": 390, "playtime_last_two_weeks": 0, "last_played": 1483403178}, "language": "spanish", "review": "Me alegro de que haya salido a la luz este juego tan especial.\n+ No es un juego de pensar demasiado, más bien de tener reflejos, estar atento y tomar las decisiones necesarias en el momento apropiado. Aun así, habrá veces en las que sí que hay que pararse a pensar.\n+ Está muy bien acabado y sin apenas bugs.\n+ Las fotos y el tráiler lo cuentan todo, pero no es aburrido. Al contrario, es desafiante y cada vez más complicado, con unas mecánicas retorcidas y unos logros muy hardcore.\n+ Tiene un modo arcade psicodélico adictivo, aunque sin una leaderboard mundial. \n+ Los bosses, de lo mejor del juego. La música también está bien.\n- Hay momentos en los que ves todo tu progreso romperse en pedazos y tienes que volver a empezar. Puede llegar a ser un poco frustrante, aunque volver a intentarlo es tan fácil y tentador que acaba enganchando.\n- Se me ha borrado todo el progreso cuando estaba en el nivel 5.9 (el penúltimo). Me temo que no volveré a abrir el juego en mucho tiempo...", "timestamp_created": 1483404442, "timestamp_updated": 1483807221, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28927973": {"recommendationid": "28927973", "author": {"steamid": "76561198037000967", "num_games_owned": 154, "num_reviews": 17, "playtime_forever": 214, "playtime_last_two_weeks": 0, "last_played": 1511389795}, "language": "brazilian", "review": "Como assim um jogo de plataforma circular? É mais fácil entender o conceito jogando do que lendo, mas vou tentar. Em cada fase você começa do lado de fora de um círculo e, movendo-se apenas para esquerda ou direita, deve passar para a parte interna desse círculo e depois pular para um outro círculo menor. Assim que você consegue, esse círculo se espande e outro aparece dentro dele, para onde você deve ir. Entre essas \"camadas\" há vários tipos de capetinhas vermelhos que te matam ao te tocar.\n\nConforme você vai avançando pela fase, os círculos vão se acumulando nas bordas da tela e você ainda consegue ver todos os capetinhas que estavam nele. O efeito é muito louco, parecido com olhar um caleidoscópio.\n\nQuando você acha que dominou a mecânica do jogo, ele joga novas regras na sua cara, te obrigando a controlar dois personagens ao mesmo tempo, que ainda por cima ficam em lados opostos da tela! Seus olhos ficam iguais ao de um camaleão e te dá a forte sensação de que é preciso mais de um cérebro para jogar bem [i]Circa Infinity[/i].\n\nSério, esse jogo exige tanta coordenação visual e motora que podia ser aplicado nas provas do Detran. Não sei se terei capacidade de zerar, mas recomendo a experiência.", "timestamp_created": 1483332674, "timestamp_updated": 1483332674, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28814828": {"recommendationid": "28814828", "author": {"steamid": "76561198143518277", "num_games_owned": 131, "num_reviews": 27, "playtime_forever": 90, "playtime_last_two_weeks": 0, "last_played": 1483511502}, "language": "schinese", "review": "自super meat boy之后，我再一次感受到了被手残支配的恐惧\n顺便 音乐无比洗脑啊\n\n[spoiler] 遗憾的是 在被虐了一个多小时之后 我选择了退款 对不起 orz [/spoiler]", "timestamp_created": 1483069122, "timestamp_updated": 1483540486, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28786519": {"recommendationid": "28786519", "author": {"steamid": "76561198057764083", "num_games_owned": 1002, "num_reviews": 79, "playtime_forever": 369, "playtime_last_two_weeks": 32, "last_played": 1515688019}, "language": "koreana", "review": "예술적이다\n\n게임플레이, 비주얼, 연출, 음악 모두\n\n다만 이 게임 특유의 색깔과 개성은 호불호가 갈릴 듯하다.\n\n그치만 난 좋다. 개인적으로 애착이 가는 게임.\n\n★", "timestamp_created": 1483010234, "timestamp_updated": 1515190289, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28755593": {"recommendationid": "28755593", "author": {"steamid": "76561198176139119", "num_games_owned": 92, "num_reviews": 28, "playtime_forever": 334, "playtime_last_two_weeks": 0, "last_played": 1502702800}, "language": "english", "review": "It's good. It's fun. But gotta warn ya, this game gets INSANE later on. Aside from me raging a lot, i like it!", "timestamp_created": 1482939369, "timestamp_updated": 1482939369, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28700342": {"recommendationid": "28700342", "author": {"steamid": "76561198324475892", "num_games_owned": 79, "num_reviews": 4, "playtime_forever": 709, "playtime_last_two_weeks": 0, "last_played": 1483018653}, "language": "schinese", "review": "设定很新颖的动作类游戏\n操作只需要四个键（←，→，↑/↓/空格/回车键任选其一，esc召唤菜单）却能满足手残玩家，普通act爱好者，以及资深[strike]抖m[/strike]玩家不同层次的需求\n游戏大致分为两块：故事模式和街机模式\n故事模式中敌人布置是固定的，无时间限制；街机模式的图是随机生成的，每一圈都有时间限制。\n故事模式一共55关，设计得很精巧（特别是后半部分，很多关卡都需要仔细观察）而且在每一关（boss战除外）都设了一些安全圈作为检查点[strike]以降低挫败感[/strike]。不过，还是有一些关卡能让你体会到那种 石头就快要推到山顶的时候结果突然让人踹了一脚滚回山脚下的想说一句吗卖批的冲动。\n对于普通玩家，能通关已经是功德圆满；对于mania，通了关，还有疯狂受苦的街机模式以及丧心病狂的成就系统（\n如果你只是路过想尝个新鲜，即便像我这种老年人操作，花上十个小时也够通关了；\n如果你是像素act厨，哈，还看什么来虐手吧\n我 练 功 发 自 真 心（键盘 卒", "timestamp_created": 1482818086, "timestamp_updated": 1482818579, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28640604": {"recommendationid": "28640604", "author": {"steamid": "76561198094588180", "num_games_owned": 69, "num_reviews": 3, "playtime_forever": 591, "playtime_last_two_weeks": 0, "last_played": 1501009293}, "language": "english", "review": ">take Super Hexagon\n>replace hexagons with circles\nAnd that's how Circa Infinity was made.", "timestamp_created": 1482686531, "timestamp_updated": 1482686531, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28598069": {"recommendationid": "28598069", "author": {"steamid": "76561197980156403", "num_games_owned": 1125, "num_reviews": 99, "playtime_forever": 237, "playtime_last_two_weeks": 0, "last_played": 1483141178}, "language": "english", "review": "A very good game, but way too frustrating for me. I won't give it a negative review, though I also won't rate it as I usually do because I simply don't have the skill necessary to complete the game. ?/10 Maybe some day when my hand-eye coordination has improved I'll come back.", "timestamp_created": 1482591697, "timestamp_updated": 1482591697, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28513777": {"recommendationid": "28513777", "author": {"steamid": "76561198081940363", "num_games_owned": 215, "num_reviews": 61, "playtime_forever": 261, "playtime_last_two_weeks": 0, "last_played": 1512187003}, "language": "english", "review": "its AMAZING!!!\none of the most difficult (fyi never played dark souls) and most intelligent games out there! \nits a completely new genre of gaming and you really have to focus to win because there are so many moving parts and enemys in each dimention that can attack you in their own way that makes the game that much difficulter!\nyou may need a atleast good computer for this because of all the animations running at once but seriosly, PLAY IT!\ni do suggest playing the demo first, just to be sure you want to get the game.\ni cant stop playing this game!", "timestamp_created": 1482346979, "timestamp_updated": 1482346979, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497288", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27890823": {"recommendationid": "27890823", "author": {"steamid": "76561198000853896", "num_games_owned": 1790, "num_reviews": 5, "playtime_forever": 399, "playtime_last_two_weeks": 0, "last_played": 1472120909}, "language": "spanish", "review": "Una experiencia única. Los dos primeros mundos demuestran que CI es bueno; del 3ro en adelante, que es excelente. Difícil, pero no es frustrante.", "timestamp_created": 1480284116, "timestamp_updated": 1480284116, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.543568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27755013": {"recommendationid": "27755013", "author": {"steamid": "76561198036612393", "num_games_owned": 253, "num_reviews": 21, "playtime_forever": 742, "playtime_last_two_weeks": 0, "last_played": 1504401373}, "language": "schinese", "review": "总结：好玩且耐玩\n如同trailer中演示的一样，\n玩家操控的角色并没有特殊能力\n四个方向键即可完成一切操作\n左右键可以控制玩家\n顺时针/逆时针移动（可在设置中反转）\n上键跳跃\n下键进入下一层以及短暂贴地滑行\n操作简单并不意味乐趣的缺失\n相反，Circa InFinity在引导玩家循序渐进\n认识新种类的敌人时做的非常出色\n易上手难精通，后期关卡的鬼畜程度完全可以满足抖M玩家的需求\n配合魔性的BGM（建议购买反正打折也不贵）\n是一款老少皆宜[spoiler]谁玩谁吐血[/spoiler]的佳作\n\n优点：\n+简洁的画风\n++简单的操作\n+无剧情无需汉化\n++++炒鸡带感的BGM\n+++很有创意的boss战\n+价格合理[spoiler]“折扣后”[/spoiler]\n缺点\n--中度精神污染[spoiler]“circle affinity属于重度精神污染”[/spoiler]\n---后期难度较高\n-这么一款好游戏玩的人真少（笑）\n\n8.5/10 \nwould play circle affinity again", "timestamp_created": 1480207776, "timestamp_updated": 1480207776, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27289483": {"recommendationid": "27289483", "author": {"steamid": "76561198097774298", "num_games_owned": 273, "num_reviews": 2, "playtime_forever": 681, "playtime_last_two_weeks": 0, "last_played": 1480015459}, "language": "brazilian", "review": "apenas meu cerebro que esta derretendo", "timestamp_created": 1480015487, "timestamp_updated": 1480015487, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26965482": {"recommendationid": "26965482", "author": {"steamid": "76561197970513026", "num_games_owned": 623, "num_reviews": 11, "playtime_forever": 2621, "playtime_last_two_weeks": 0, "last_played": 1486926918}, "language": "english", "review": "Without a doubt, one of the hardest games I have ever tried to finish. The achievements are incredibly tough, the game itself is unbelievably smart, and the timing and mechanics are addictive.\n\n10/10 would have seizures again.", "timestamp_created": 1479948320, "timestamp_updated": 1479948320, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26882425": {"recommendationid": "26882425", "author": {"steamid": "76561198009802063", "num_games_owned": 2527, "num_reviews": 70, "playtime_forever": 121, "playtime_last_two_weeks": 0, "last_played": 1473125766}, "language": "english", "review": "This game actually managed to rewire my brain. \n\nThe first time I played it, I felt a certain madness. A wild, hysterical madness. A glorious, exciting, thrilling madness. A \"help my brain is leaking out of my ears\" madness. And I saw circles everywhere. EVERYWHERE. After I stopped, circles, circles, circles. Black and white and red all over. \n\nAnd the next time I played it, that didn't happen. And it never did again.", "timestamp_created": 1479935073, "timestamp_updated": 1479935073, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.504898", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26679011": {"recommendationid": "26679011", "author": {"steamid": "76561198041108401", "num_games_owned": 449, "num_reviews": 109, "playtime_forever": 264, "playtime_last_two_weeks": 0, "last_played": 1479417267}, "language": "english", "review": "Mindbending puzzle and reaction platformer. Some levels are really tough!", "timestamp_created": 1479503244, "timestamp_updated": 1479503244, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26371113": {"recommendationid": "26371113", "author": {"steamid": "76561198109225772", "num_games_owned": 143, "num_reviews": 17, "playtime_forever": 157, "playtime_last_two_weeks": 0, "last_played": 1487942236}, "language": "schinese", "review": "人生中难得的略晕2D体验\n这个游戏难度挺大，反应系苦手请自觉回避\n还有这游戏不需要中文还算是个优点\n很适合作为操作类玩家的试金石\n\n", "timestamp_created": 1478084862, "timestamp_updated": 1478084862, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26369303": {"recommendationid": "26369303", "author": {"steamid": "76561198176071243", "num_games_owned": 44, "num_reviews": 2, "playtime_forever": 51, "playtime_last_two_weeks": 0, "last_played": 1479058195}, "language": "english", "review": "Terrible game to play when you're hung-over!\nYou can tell from my achievements that I've put in a lot more time than Steam has recorded.\nThis game belongs on hand-held and I would buy it a second time if ported to console.", "timestamp_created": 1478073886, "timestamp_updated": 1478073886, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26343856": {"recommendationid": "26343856", "author": {"steamid": "76561198074979904", "num_games_owned": 70, "num_reviews": 10, "playtime_forever": 50, "playtime_last_two_weeks": 0, "last_played": 1478390333}, "language": "english", "review": "This is pure arcade gold! Original, addictive, and just plain insane. The mechanics are great and made your head work in ways most games do not. The simplicity of design belies a challenge that lies precisely in the unorthodox way the world moves... or swirls. I knew from the get go that this one will stay in my library and rob me of many an hour. Looking forward to future works by the developers! Highly recommended!", "timestamp_created": 1477949260, "timestamp_updated": 1477949260, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26083844": {"recommendationid": "26083844", "author": {"steamid": "76561198009599219", "num_games_owned": 359, "num_reviews": 27, "playtime_forever": 1018, "playtime_last_two_weeks": 0, "last_played": 1484756117}, "language": "schinese", "review": "[h1] 本篇致力于写一篇不一样的评测，因为这款游戏的内涵不容埋没。\t[/h1]\n\n我是上个月才看到这游戏，看了几张截图，就明白这游戏注定意味着什么，赶紧付了全款，并在接下来的半个月时间，每天与自己的一个佛教信徒朋友定时探讨。直到这个月我终于通了关，整理清楚半个多月来的心得笔记，就来到了这里。\n先就游戏性体验说上几句：\n\n+游戏难度：如果有玩家在手机端玩过这游戏，会发现电脑版真是良心……在手机上我最多打到3.9关。手机版的游戏速度比电脑版快太多，更要命的是按钮设置太别扭，这两点任何一点都很致命。而电脑版从开始到最终关，游戏速度都很平衡，只要不是太心急，都能过关。（至于眼晕不晕的问题，在后面的部分我会详细说明）\n-游戏手感：对手柄摇杆的支持很作死，如果你用摇杆你会死的最快……所以只能用手柄的左、右键来控制人物移动了，从这点上来说，跟手机版也没啥区别了啊……\n-游戏BMG：这是最令我疑惑的一点。我在手机端玩的时候，每关都有好听的音乐。而在STEAM上，我只能听到人物音效，但是绝对听不到背景音乐！我从头打到尾，没有任何一关让我听到背景音乐！不论我怎么找设置选项，事实上原声OST我也有买了，但是我就是在游戏中没有听到任何一首音乐！不知道别的玩家是不是也是这样？\n-游戏成就：罢了，这辈子是不用指望全成就了…………相信开挂变速齿轮减8倍速外加强迫症严重者一定能够达到。至于我嘛，我就在角落里蹲十分钟泪目一会儿就算了。\n\n[b] 【正文部分待更新】\t[/b]", "timestamp_created": 1476694934, "timestamp_updated": 1476694934, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.535928", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25957654": {"recommendationid": "25957654", "author": {"steamid": "76561198019692071", "num_games_owned": 170, "num_reviews": 5, "playtime_forever": 233, "playtime_last_two_weeks": 0, "last_played": 1480338568}, "language": "english", "review": "My brain is in intense pain from playing this, and I love it!", "timestamp_created": 1476056104, "timestamp_updated": 1476056104, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.497100", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25930244": {"recommendationid": "25930244", "author": {"steamid": "76561198036422626", "num_games_owned": 100, "num_reviews": 3, "playtime_forever": 406, "playtime_last_two_weeks": 0, "last_played": 1490419249}, "language": "english", "review": "One of the best puzzle games I've ever played.  Original gameplay, extremely challenging and visually beautiful.  Really glad I purchased this game.", "timestamp_created": 1475948409, "timestamp_updated": 1475948409, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.497512", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25703947": {"recommendationid": "25703947", "author": {"steamid": "76561198004565666", "num_games_owned": 203, "num_reviews": 102, "playtime_forever": 331, "playtime_last_two_weeks": 0, "last_played": 1474821652}, "language": "english", "review": "This game does everything that a platformer puzzle game should. It takes a unique concept, and milks it for every ounce of gameplay potential it's worth. It is fast paced but filled with a good mix of tricky puzzles and tricky timing/platforming. It does a very good job of constantly adding (very creative) twists onto the central concept and ramping up the complexity until the last few levels are exceedingly complicated.\n\nAs for length, it's longer than I expected it to be. There's five chapters of equal length and I fully expected it to be out of ideas and end after chapter 4, and it would have still felt like a complete game by the end of chapter 3. And many of the acheivements could be considered to be additional bonus puzzles in themselves (ie \"find a level in this chapter that's possible only running in one direction\"), giving it a bit of extra replayability.\n\nOverall, good game. Would recommend to anyone who likes creative puzzles and unique concepts.", "timestamp_created": 1474856986, "timestamp_updated": 1474856986, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25700162": {"recommendationid": "25700162", "author": {"steamid": "76561198108084243", "num_games_owned": 215, "num_reviews": 31, "playtime_forever": 1501, "playtime_last_two_weeks": 0, "last_played": 1495482802}, "language": "english", "review": "Since I bought this game, I haven't played much of anything else. It's an addicting and difficult puzzle/action game which requires fast reactions and a lot of patience. Every new Act provides a whole new way to play the game while retaining it's core gameplay. This game is also great for speedrunning. A highly recommended game.", "timestamp_created": 1474836721, "timestamp_updated": 1474836721, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25542382": {"recommendationid": "25542382", "author": {"steamid": "76561198087643472", "num_games_owned": 37, "num_reviews": 3, "playtime_forever": 560, "playtime_last_two_weeks": 0, "last_played": 1505075190}, "language": "english", "review": "it hurts", "timestamp_created": 1474099235, "timestamp_updated": 1474099235, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25514635": {"recommendationid": "25514635", "author": {"steamid": "76561198084104417", "num_games_owned": 352, "num_reviews": 5, "playtime_forever": 224, "playtime_last_two_weeks": 0, "last_played": 1474145400}, "language": "english", "review": "it...kills me.. over and over and over again.... pretty sure this is lowkey dark souls 3", "timestamp_created": 1473961425, "timestamp_updated": 1473961425, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.461538", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25463943": {"recommendationid": "25463943", "author": {"steamid": "76561198030390870", "num_games_owned": 206, "num_reviews": 30, "playtime_forever": 309, "playtime_last_two_weeks": 0, "last_played": 1480099135}, "language": "schinese", "review": "其实游戏本身不难，只要冷静下来思考，并且有条不紊的行动，那么一切问题都能迎刃而解…\n\n主要难点在于\n\n当你想冷静思考的时候突然钻出来一个光头\n当你想冷静行动的时候突然发现另一边撞墙了\n当你想冷静思考的时候bgm和怪物特别魔性的抖动于是你也跟着一起抖动所以撞死了\n\n所以说，这是一个锻炼心性的修行类小游戏。\n值得一玩", "timestamp_created": 1473605654, "timestamp_updated": 1473605654, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25092444": {"recommendationid": "25092444", "author": {"steamid": "76561198145641243", "num_games_owned": 635, "num_reviews": 22, "playtime_forever": 114, "playtime_last_two_weeks": 0, "last_played": 1472059481}, "language": "schinese", "review": "After playing for an hour, finally got into act iii.\nIt's quite fun and thrilling when you are playing act i since you are completely new to the game.\nThe beats are quite cool and present a quite intense atmosphere.\nAfter getting used to the game, it became a little bit boring in the middle of act ii, but still the boss fight is amazing so you won't be bored too much.\nAnd when diving into act iii, it's kind of a whole new level since you have two guys spinning around at the same time so you got more to pay attention to.\nOverally speaking, quite a mini game providing survival mode aside from story(?) mode.\n\n+ intense game play\n+ overall well designed stage rythem and amazing boss fight\n+ cool beats\n+ simple mechanics makes it easy to grap on\n\n- monster illustration's a little bit simple, not quite likable as hero and heroine\n- some middle levels a little bit predictable and boring\n\ntotal points:8/10\n\nPS. I really enjoyed boss fights a lot, really a pity it doesn't have boss rush mode", "timestamp_created": 1471964433, "timestamp_updated": 1471964433, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.528302", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25024960": {"recommendationid": "25024960", "author": {"steamid": "76561197979741653", "num_games_owned": 571, "num_reviews": 85, "playtime_forever": 350, "playtime_last_two_weeks": 0, "last_played": 1471762807}, "language": "english", "review": "\nCirca Infinity is a very unique puzzle platformer. Usual platforms are straight, or at most some kind of slope. Here it's concentric circles and it's insane.\n\nYou enter a new circle from the bottom. You go to the right. You enter the next circle from the top. You go to the right... No. Your character is going left. Right and left are actually counter-clockwise and clockwise, which creates confusion over and over again when the brain is still used to consider that the button to the right should always move the character in that direction. Also, jump is actually some sort of slide when the character is not yet in the inner circle... Reacting the right way on short notice is really difficult. Difficult but fun, with the cool music and visuals. The first two worlds are a treat.\n\nHowever, the next worlds lost me. Two characters are controlled at the same time, and it's just too hard to follow (suddenly much more a puzzle than a platformer) while not flowing as well as when it was only one character. It's like constantly being tethered to something fragile and annoying.\n\nBut before it came to that point, I really had a good time, and found the level design excellent (there are both series of levels, and an infinite mode). The game teaches you what each enemy does before spicing things up or mixing with other enemies, and it makes sure that you understood by placing them in a smart way several times and making you go back one circle upon death. Some circles are devoid of obstacles and can't kill you, they effectively act as subtle checkpoints or safe havens that prevents you from being ousted back to the beginning of that inferno.\n\nIn conclusion, despite some elements that put me off, it's a good few hours fun for anyone into unique or hardcore platformers.\n\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=747913887", "timestamp_created": 1471663114, "timestamp_updated": 1471663114, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.556803", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24893896": {"recommendationid": "24893896", "author": {"steamid": "76561198028729157", "num_games_owned": 254, "num_reviews": 8, "playtime_forever": 34, "playtime_last_two_weeks": 0, "last_played": 1479592653}, "language": "english", "review": "Trippy.", "timestamp_created": 1471117822, "timestamp_updated": 1471117822, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.450408", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24890102": {"recommendationid": "24890102", "author": {"steamid": "76561198106814416", "num_games_owned": 705, "num_reviews": 16, "playtime_forever": 8, "playtime_last_two_weeks": 0, "last_played": 1471107987}, "language": "french", "review": "Sous ses allures rustiques, Circa Infinity est un excellent jeu de plateforme nerveux dans lequel le joueur apprend à maîtriser lentement mais surement les mécanique de gameplay. Le level design se renouvelle sans cesse avec intelligence malgré les limitations apparentes du concept, et permet de progresser sans s'ennuyer, le tout sur une chouette bande son.\n\nLe test complet sur IndieMag.fr : [url=https://www.indiemag.fr/tests/circa-infinity-plateformer-dadresse-nerveux-original]Test complet[/url]\n\n(J'ai joué à une version DRM-Free pendant plusieurs heures. J'ai finalement acheté la version Steam parce que je voulais poster mon évaluation et que le jeu est vraiment cool :) J'ai joué le minimum sur Steam pour pouvoir publier.)", "timestamp_created": 1471108147, "timestamp_updated": 1471108147, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502712", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "24888252": {"recommendationid": "24888252", "author": {"steamid": "76561198039806827", "num_games_owned": 310, "num_reviews": 13, "playtime_forever": 2214, "playtime_last_two_weeks": 0, "last_played": 1489923135}, "language": "english", "review": "Jump, evade, get to the goal. That's a basically the game. It's difficult first, but you get a lot of tries and you fingers will adapt. So, just don't give up and you will make progress.\n\nWhat makes the game great is the style and the visuals. It's how it twists your visual processing to work in non-standard geometriy, something that the visual part of your brain was never evolved to process. Yet, it somehow works, and after an hour you get into it. The geometry starts to make intuitive sense and you feel how you can master this strange circular shape.", "timestamp_created": 1471103792, "timestamp_updated": 1471166625, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24866060": {"recommendationid": "24866060", "author": {"steamid": "76561197974287070", "num_games_owned": 255, "num_reviews": 4, "playtime_forever": 18, "playtime_last_two_weeks": 0, "last_played": 1473624833}, "language": "english", "review": "Totally addictive, with an interesting twist on platforming.", "timestamp_created": 1471048684, "timestamp_updated": 1471048684, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24772271": {"recommendationid": "24772271", "author": {"steamid": "76561197967608196", "num_games_owned": 460, "num_reviews": 87, "playtime_forever": 1319, "playtime_last_two_weeks": 0, "last_played": 1511068149}, "language": "english", "review": "Mind-bendingly difficult hybrid of a puzzle game and a single-line platformer.\n\nVery well done.  The ending is dumb though.", "timestamp_created": 1470637066, "timestamp_updated": 1470637066, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24766157": {"recommendationid": "24766157", "author": {"steamid": "76561198083568932", "num_games_owned": 166, "num_reviews": 86, "playtime_forever": 521, "playtime_last_two_weeks": 0, "last_played": 1502840093}, "language": "english", "review": "circa infinity is a game about circles. that's it. did you expect something clever?", "timestamp_created": 1470602157, "timestamp_updated": 1470602157, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.497904", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24552333": {"recommendationid": "24552333", "author": {"steamid": "76561198109769383", "num_games_owned": 306, "num_reviews": 13, "playtime_forever": 112, "playtime_last_two_weeks": 0, "last_played": 1472058054}, "language": "english", "review": "Mind Blown!!!", "timestamp_created": 1469609889, "timestamp_updated": 1469609889, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.496824", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24401479": {"recommendationid": "24401479", "author": {"steamid": "76561198198748169", "num_games_owned": 205, "num_reviews": 18, "playtime_forever": 595, "playtime_last_two_weeks": 0, "last_played": 1499864386}, "language": "schinese", "review": "Circa Infinity是一个集瞎眼、烧脑、残手于一体的游戏。\n游戏操作方式正如游戏名称所说的一样简单直白：转圈，躲避怪物，一圈一圈地进入深层到达终点。\n和与之操作方式相类似的Super Hexagon相比，游戏性明显比强了不少，大概是因为拥有了Boss关卡的概念，而且也不会像Super Hexagon玩到后面高难度时“Begin”语音满天飞。\nCirca Infinity还有一个Speedrun模式，看看你完成整个5章（55关）需要多少时间，对于竞速玩家来说这是个不错的挑战。\n\n========= 分割线 =========\n本以为Circa Infinity就这样就没了，后来某次更新竟然还出了一个Circa Affinity游戏模式，惊喜。\n原以为主游戏模式足够瞎眼烧脑残手的了，结果看来是我图样图森破，Circa Affinity游戏模式简直更暴力地上了N层楼，更加完美的呈现了什么叫做瞎眼（附带惊悚音效）。\n我就不描述了，得自己亲身体验，我去做眼保健操去了。\n\n========= 总评 =========\n操作：10/10，操作简单，四个方向键就行\n设计：10/10，主菜单这种设计我很喜欢\n画面：10/10，瞎眼无极限，主模式通关动画简直好看\n音效：10/10，我就是冲着Soundtrack买的这游戏\n\n这大约是我玩过最好的一个残手游戏了！", "timestamp_created": 1468900242, "timestamp_updated": 1468900242, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.575342", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24400816": {"recommendationid": "24400816", "author": {"steamid": "76561198055751007", "num_games_owned": 173, "num_reviews": 27, "playtime_forever": 381, "playtime_last_two_weeks": 0, "last_played": 1468895675}, "language": "english", "review": "Unique concept, upbeat music, messes with your brain and makes you feel good about quickly learning new concepts.", "timestamp_created": 1468895892, "timestamp_updated": 1468895892, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.501089", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24357205": {"recommendationid": "24357205", "author": {"steamid": "76561198104441075", "num_games_owned": 65, "num_reviews": 6, "playtime_forever": 156, "playtime_last_two_weeks": 0, "last_played": 1467458214}, "language": "schinese", "review": "好有意思，玩的我像磕了药一样…………迷幻\nBGM非常好评！！！", "timestamp_created": 1468689807, "timestamp_updated": 1468689807, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24183128": {"recommendationid": "24183128", "author": {"steamid": "76561198045315927", "num_games_owned": 169, "num_reviews": 8, "playtime_forever": 832, "playtime_last_two_weeks": 0, "last_played": 1507309655}, "language": "english", "review": "Incredibly difficult, insanely frustrating and only playable in short doses, yet what a game. The very abstract concept has been meticulously thought through for each level and lovingly decorated with a three-colour aesthetic and great music. Once you get the hang of the gameplay and are in the zone enough to breeze through levels real fast it leaves you feeling rather badass.", "timestamp_created": 1467988145, "timestamp_updated": 1467988145, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.501089", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24169207": {"recommendationid": "24169207", "author": {"steamid": "76561198075982060", "num_games_owned": 1530, "num_reviews": 11, "playtime_forever": 1269, "playtime_last_two_weeks": 0, "last_played": 1515112354}, "language": "english", "review": "This game is the bastard son of VVVVVV and Super Hexagon is brilliant, addictive and charming. And with the latest update (Circle Affinity) is, well, almost infinite.  So, if you like puzzle-plattformers, minimalism, Terry Cavanagh's games, good soundtrancks on your videogames, to die a lot of times, puzzle-bosses, kaleidoscopes,  and/or get dizzy... buy it now and, thank me later. \n\nP.S: It's already on my top of best games ever, i swear it by the old gods and the new.", "timestamp_created": 1467933187, "timestamp_updated": 1467933187, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.501909", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24151594": {"recommendationid": "24151594", "author": {"steamid": "76561198041103800", "num_games_owned": 96, "num_reviews": 3, "playtime_forever": 2472, "playtime_last_two_weeks": 0, "last_played": 1514789876}, "language": "english", "review": "Immaculate.\n\nIn nearly every aspect, Circa Infinity has vastly exceeded my expectations, and sits well near the top of my list of most intelligently designed games I have ever played. A minimalist, puzzle platformer is the last game I would expect to enjoy this immensely amongst a sea of indie titles. I consider the genre to be the equivalent of the FPS of the indie scene: a sort of formulaic attempt to tread ground into the industry, but CI is perhaps the most exhilarating take on a tired template in every aspect of its design. It will consistently challenge your thinking while simultaneously presenting you every tool necessary to complete and appreciate the pieces which meld this wonderful game.\n\nAt its core, CI is commonly described as a circular platformer. In a step far to the left, the game involves no vast worlds, but simply a monochrome series of circles laden with enemies. It begins simply: have your character enter each circle, avoid every monster, and jump inwards to the next circle until you complete the level. Each level is comprised of around 10 circles or so, with every few levels introducing a new mechanic. It remains fairly simplistic through the first of five worlds, bringing in new enemies and covering most of what you'll need to complete the remainder. \n\nCirca Infinity respects your intelligence. If you fail and touch an enemy, the only punishment you receive is that you must return to the previous circle. Rather than simply start the current challenge over, you must re-surmount the former, meaning that consistent missteps can place you back at the start of the level. There are checkpoints in each level every few circles, however, so even as it gets crazier, there are plenty of chains of challenges which are short and allow you to focus on them, as they become quite complex. New worlds bring in major mechanics additions, with the brilliant tutorialisation that never leaves the player confused. I won't go into them, as divulging every mechanic feels akin to spoiling a major plot. Part of CI's joy is discovering how each new world builds off of the rules that you know, and they remain clear, concise, and straightforward. That said, Circa Infinity will force you to think in manners that toss everything you know about games on its head. \n\nSpeaking of plot, the game is entirely devoid of dialogue or narration, and every piece of the story is told through imagery. This is a bold step from the game's early builds, wherein the breakpoints between levels were filled with text explaining the adventure you undertake. I feel the game works far better without it, retaining its minimalist feel and remaining atmospheric in a way that words would only detract from. \n\nAnd nothing lends itself more to the game's atmosphere than the music. God, the music. Easily one of the best game soundtracks I have ever heard, with even the tracks playing between levels reaching unexpected levels of intricacy and power. In a game that feels a lot about going from level to level and jumping between speeding through and thinking out the next series of moves, in only this instance would I recommend taking a break to sit and breathe, as your characters do, and take a listen between stages. The break music from the first world, a track I would normally skip, surprised me as becoming one of my favorite songs in the entire game when I took the time to sit instead of plowing ahead. The music is more than enough of a reward for finishing some of these heinous treks. \n\nIf that package weren't enough, Kenny Sun recently added the game mode: Circle Affinity, which adds a randomized, endless, high-score style romp reminiscent of Super Hexagon. It's not nearly as difficult, but is always fun, and one of the few “get as far as you can” game modes I enjoy. Especially in an age where the sort of play-til-you-drop gameplay has fallen out of favor, CA adds a nice alternative to the pre-designed levels and usual speedrunning romps. Mr. Sun is quite generous in providing for free a game mode which could have easily stood alone for a few bucks. The additions to the soundtrack never hurt either, with some remixes and a few new favorites; I anxiously await its additional release.\n\nOf course, no game is perfect. Circa Infinity is a touch short (which is of course, remedied by CA), and finishing the game felt a tad bittersweet. \nGetting used to knowing which direction you're going in can take some time and will throw you off occasionally, long past the point that you think you've familiarized yourself with it.\nThe color schemes in CA, though there are many to unlock, all seem to have a blending aspect in CA, in where getting past the 25th circle makes it impossible to see where the entry point for the current circle is. Perhaps this was intentional, but it's annoying when you sometimes can't even see your own character in a mode which is designed to be action and timing oriented (remember that CA is a separate mode from the main game).\n\nHowever, all of these gripes are minor. It's a steal at $10, especially, and I'd go ahead and say to buy the soundtrack along with it (available in FLAC 48Khz/24bit for us audioheads, no less!). Due to the lack of coverage the game received, I was hesitant to buy it after discovering it, but bought it, had no regrets, and wished I could give Kenny Sun more of my money. The game deserves it. A perfectly designed experience, fantastic art style and soundtrack, and plenty of reasons to keep playing may very well make Circa Infinity a new favorite for you, as it was for me.", "timestamp_created": 1467875883, "timestamp_updated": 1467918338, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.512373", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24151254": {"recommendationid": "24151254", "author": {"steamid": "76561198011028676", "num_games_owned": 162, "num_reviews": 58, "playtime_forever": 83, "playtime_last_two_weeks": 0, "last_played": 1510446948}, "language": "english", "review": "amazing, unique game with an interesting and abstract story and a great soundtrack. even though it's too fucking hard for me i still love it and the amount i've played up to makes the game worth buying. although i'm sure everyone else will actually beat the game cause i suck", "timestamp_created": 1467874335, "timestamp_updated": 1467874575, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24012987": {"recommendationid": "24012987", "author": {"steamid": "76561198183090293", "num_games_owned": 150, "num_reviews": 21, "playtime_forever": 147, "playtime_last_two_weeks": 0, "last_played": 1486869525}, "language": "schinese", "review": "虽然我没玩这游戏多久，可是我还是要点个赞\n因为这款游戏是我认为的所谓有创意的游戏\n而且从预告片来看\n后面的部分似乎更有意思\ninteresting\n--------------------------------------------\n认真地说：\n+创意\n+阶梯难度\n+配色风格\n-像素低\n-才第一章后半部分已经感觉难度很高了\n\n--------------------------------------------\n8月7日更新评测\n\n最近在韩国把这个游戏离线打通了本体\n有人说这是个操作游戏，这我是不能完全同意的\n有没有发现最近的有些游戏太过于注重操作了\n却失去了一些内涵\n多少次对着古树旋律摔手机\n多少次对着超级食肉男孩摔手柄\n可是只换来下一关，\n更高的难度\n永远过不完的关\n永远我还会回来的~的boss\n\n可是在这个游戏，我永远在期待着下一关\n我知道选择了正确的策略，操作难度可以大大降低\n我也惊叹于一个小小的游戏，简单的规则\n不多的怪物与元素，竟可以让每一关都富有变化\n每一关都需要不同的策略\n更不用说精彩的boss战\n\n提示彩蛋：关卡结束的地方不要动一段时间，人物会爆炸后变红。\n10/10", "timestamp_created": 1467458432, "timestamp_updated": 1470537093, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.583333", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24007435": {"recommendationid": "24007435", "author": {"steamid": "76561198063558874", "num_games_owned": 134, "num_reviews": 15, "playtime_forever": 34, "playtime_last_two_weeks": 0, "last_played": 1467441565}, "language": "schinese", "review": "能构思出这样一个游戏的人大脑会是什么结构的呢？\n\n仅仅80M，但创意绝了。", "timestamp_created": 1467441680, "timestamp_updated": 1467441680, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "4.980100", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23917244": {"recommendationid": "23917244", "author": {"steamid": "76561198073764691", "num_games_owned": 133, "num_reviews": 3, "playtime_forever": 414, "playtime_last_two_weeks": 0, "last_played": 1467184681}, "language": "english", "review": "This game is so brilliant, I don't have words for it. I was mindblown more than a few times during the course of this game, when a new mechanic would click in place and I would just understand how it works in a flash.\n\nOne of the most brilliantly designed and underrated puzzle games I've played. Thank you for this game.", "timestamp_created": 1467184813, "timestamp_updated": 1467184813, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.612208", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23914919": {"recommendationid": "23914919", "author": {"steamid": "76561198099682496", "num_games_owned": 199, "num_reviews": 22, "playtime_forever": 1877, "playtime_last_two_weeks": 0, "last_played": 1498368444}, "language": "schinese", "review": "好玩！魔性！一次不能玩太久！有点虐手！不过过一关特有成就感！", "timestamp_created": 1467175955, "timestamp_updated": 1467175955, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23898882": {"recommendationid": "23898882", "author": {"steamid": "76561198075254501", "num_games_owned": 21, "num_reviews": 3, "playtime_forever": 191, "playtime_last_two_weeks": 0, "last_played": 1472958060}, "language": "english", "review": "They should make a rage quit achievement.", "timestamp_created": 1467133290, "timestamp_updated": 1467133290, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.497189", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23881423": {"recommendationid": "23881423", "author": {"steamid": "76561197977803119", "num_games_owned": 243, "num_reviews": 1, "playtime_forever": 723, "playtime_last_two_weeks": 0, "last_played": 1467083286}, "language": "english", "review": "buy it now so good", "timestamp_created": 1467083734, "timestamp_updated": 1467083734, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.496369", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23865012": {"recommendationid": "23865012", "author": {"steamid": "76561198101630612", "num_games_owned": 27, "num_reviews": 4, "playtime_forever": 260, "playtime_last_two_weeks": 0, "last_played": 1487874833}, "language": "english", "review": "The soundtrack is amazing, the gameplay is very fun.\nThis game should have a level editor, where we can create and share levels for the players.", "timestamp_created": 1467042531, "timestamp_updated": 1467042531, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502508", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23845565": {"recommendationid": "23845565", "author": {"steamid": "76561198052904698", "num_games_owned": 515, "num_reviews": 3, "playtime_forever": 262, "playtime_last_two_weeks": 0, "last_played": 1473194014}, "language": "english", "review": "Excellent game, circular platforming is interesting and fun.  Short and simple, but has a level of complexity that justifies its existance.", "timestamp_created": 1466984163, "timestamp_updated": 1466984163, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500306", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23765005": {"recommendationid": "23765005", "author": {"steamid": "76561198025517505", "num_games_owned": 246, "num_reviews": 1, "playtime_forever": 361, "playtime_last_two_weeks": 0, "last_played": 1466787959}, "language": "english", "review": "I see only circles now", "timestamp_created": 1466792940, "timestamp_updated": 1466792940, "voted_up": true, "votes_up": 2, "votes_funny": 9, "weighted_vote_score": "0.498857", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23725702": {"recommendationid": "23725702", "author": {"steamid": "76561198116831647", "num_games_owned": 64, "num_reviews": 17, "playtime_forever": 371, "playtime_last_two_weeks": 0, "last_played": 1468509781}, "language": "english", "review": "My eyes are flashing black and white.\nMy brain has gone circular.\nMy ears had the time of their live's\nAnd I am still angry that I died thousends of times...\n\nYet I am still playing this brilliant game.", "timestamp_created": 1466685853, "timestamp_updated": 1466685853, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.481447", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23608969": {"recommendationid": "23608969", "author": {"steamid": "76561198050469666", "num_games_owned": 1242, "num_reviews": 49, "playtime_forever": 515, "playtime_last_two_weeks": 0, "last_played": 1506514930}, "language": "koreana", "review": "도전과제가 진짜 개새끼인 갓갓게임\n슈퍼 헥사곤의 뒤를 이을 수 있는 단 하나의 게임\n그러나, 이 말로 하기에는 슈퍼 헥사곤이 너무나도, 너무나도 작아 보인다.\n\n+ 오늘 업데이트(Circle affinity)로 진짜 갓갓갓 게임으로 변했다.\n꼭 사서 하세요.", "timestamp_created": 1466143605, "timestamp_updated": 1466814195, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23485072": {"recommendationid": "23485072", "author": {"steamid": "76561198079615822", "num_games_owned": 254, "num_reviews": 31, "playtime_forever": 354, "playtime_last_two_weeks": 0, "last_played": 1471358248}, "language": "english", "review": "I can`t thank dev`s enough.", "timestamp_created": 1465568740, "timestamp_updated": 1465568740, "voted_up": true, "votes_up": 4, "votes_funny": 3, "weighted_vote_score": "0.449859", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22785972": {"recommendationid": "22785972", "author": {"steamid": "76561198044200947", "num_games_owned": 2463, "num_reviews": 1, "playtime_forever": 807, "playtime_last_two_weeks": 0, "last_played": 1481323278}, "language": "english", "review": "TL;DR: I rarely like platformers and am usually too terrible to play hard games (let alone find the effort worth it when I can), and I loved Circa Infinity. Also the music is phenomenal.\n\nCirca infinity is a certainly a hard game, but not in any conventional manner. Outside of the bosses (which you can trial and error until you get a pattern you find easier), it doesn't really require reflexes per se, or sustained timing. Hitboxes are extremely forgiving, and you can often wait between close enemies for whatever you have to do next. Enemies move predictably, and you have breathing room to plan out your next few moves, which you then execute over several quick seconds in a sigh of relief before repeating the process. It usually alternates segments like these with miniature maze-like puzzle sections you can do at whatever pace you want. Trying to play most levels like in the trailer would be extremely difficult if not impossibly the first time through. \n\nThe game is hard because it makes you manage and respond to multiple streams of information presented on different parts of the screen. It finds new and creative ways to completely screw up your sense of direction, distance, and everything else. You'll run right into a stationary enemy you meant to run away from, or didn't see at all because you were looking at what your other character was doing. No, the game did not trick you somehow. You're just an idiot because you've never done anything like this before.\n\nCan you pat your head and rub your stomach at the same time? How about the reverse? Change the speed of one without changing the other? Reverse directions without missing a beat? Switch between these in varying sequences? Could you learn to do all that gradually? Then you can play this. Those are the types of skills the game uses and it likes to switch things up suddenly. It's disorientingly different and every new level feels like a brick wall until you figure out the timing and order of what it wants. Then, suddenly, it seems very easy and repeatable.\n\nOk, an example. There's an enemy that runs continously around the circle at exactly the speed you do - enter the circle, hold down the movement key, and you're safe. They stop moving when you're in the air, so you have to be careful not to crash into the next one when you land. Then they intoduce a flying enemy that only moves when you're in the air, also at your speed. They put the in the same section of a level, so you have to jump through the air, but not too far. Then they make these enemies move in opposite directions, so you have to run in one direction, then jump in the other then switch back on landing. Then they reverse both of their directions. And then both of these completely disappear in place of enemies that move regardless of what the player is doing because there are newer and crazier gimmicks that keep getting combined in unexpected ways.\n\nYou'll move in pace with slower enemies while dodging others. You'll control two characters on opposite sides. You'll have one enter the circle before the other, so you have to avoid enemies on the inside and outside (in different places) at the same time. You'll have enemies that only appear when one character is closer. You'll run through orbs that change your characters' colors. You'll deal with enemies that can't hurt you depending on which color you are and gates that can be only opened by the right character of the right color.\n\nIt reminds me a lot of a rhythm game (or a bullet hell?) the way you're trying to process and time different patterns at the same time, and the satisfaction is similar. Considering the way the enemies animate to the beat, it's probably intentional.\n\nMy only disappointment with the game is the final boss. It's far easier, shorter, and simpler than the first one let alone all the others. I think the ending sequence was worth it, though.", "timestamp_created": 1462319484, "timestamp_updated": 1462444303, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.592926", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22583274": {"recommendationid": "22583274", "author": {"steamid": "76561198143420766", "num_games_owned": 128, "num_reviews": 4, "playtime_forever": 31, "playtime_last_two_weeks": 0, "last_played": 1459761567}, "language": "schinese", "review": "这款游戏画风超赞ww原声也很好听！！强烈推荐", "timestamp_created": 1461401632, "timestamp_updated": 1461401632, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22336698": {"recommendationid": "22336698", "author": {"steamid": "76561198014327107", "num_games_owned": 209, "num_reviews": 20, "playtime_forever": 68, "playtime_last_two_weeks": 0, "last_played": 1460284540}, "language": "japanese", "review": "よくわからないゲーム\n円になってるステージで敵キャラクターをジャンプで避けて進みステージクリアを目指します。\nジャンプして地面の向きが変わるたびにキャラの向きが反転するため見た目以上に難しい\n\nちょっとした時間で気軽にできるゲームです。", "timestamp_created": 1460285056, "timestamp_updated": 1460285056, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.560293", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22316746": {"recommendationid": "22316746", "author": {"steamid": "76561198028049202", "num_games_owned": 325, "num_reviews": 82, "playtime_forever": 270, "playtime_last_two_weeks": 0, "last_played": 1459968912}, "language": "english", "review": "Fun and mind-blowing runner game with very unique mechanics.\nI feel like I'd have enjoyed it more if it was easier - I gave up on the last chapter.\n\nThe game seems to be very well designed for speedrunning, and I did some of the speedrunning achievements in the first chapter. But I feel any chapters beyond that would be a chore to complete 100%.\n\nSo overall, there's a lot of fun here, it's just a little bit too frustrating.", "timestamp_created": 1460200565, "timestamp_updated": 1460200565, "voted_up": true, "votes_up": 10, "votes_funny": 2, "weighted_vote_score": "0.598832", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22203474": {"recommendationid": "22203474", "author": {"steamid": "76561197991200082", "num_games_owned": 1546, "num_reviews": 55, "playtime_forever": 227, "playtime_last_two_weeks": 0, "last_played": 1498195451}, "language": "english", "review": "This game is incredible. I wish the controls were different, as using left and right to always move counter-clockwise and clockwise can be confusing, but progressing in this game provides you with a real feeling of accomplishment.", "timestamp_created": 1459623910, "timestamp_updated": 1459623910, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.501024", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22172698": {"recommendationid": "22172698", "author": {"steamid": "76561198024985876", "num_games_owned": 288, "num_reviews": 23, "playtime_forever": 485, "playtime_last_two_weeks": 40, "last_played": 1515890389}, "language": "english", "review": "A crazy game bizzare mechanics that will make your head spin, and an interesting story. definitely worth the buy if it's on sale.", "timestamp_created": 1459487294, "timestamp_updated": 1459487294, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22132936": {"recommendationid": "22132936", "author": {"steamid": "76561198272833394", "num_games_owned": 29, "num_reviews": 3, "playtime_forever": 819, "playtime_last_two_weeks": 0, "last_played": 1512294002}, "language": "schinese", "review": "旋转 跳跃 我闭着眼！", "timestamp_created": 1459294169, "timestamp_updated": 1459294169, "voted_up": true, "votes_up": 0, "votes_funny": 2, "weighted_vote_score": "0.468165", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22131051": {"recommendationid": "22131051", "author": {"steamid": "76561198006505023", "num_games_owned": 341, "num_reviews": 13, "playtime_forever": 73, "playtime_last_two_weeks": 0, "last_played": 1459285000}, "language": "english", "review": "It has the \"Spacechem\" property of taking a single game mechanic and being able to ramp its difficulty up to insanity. That said, it's a blindingly good puzzle game.", "timestamp_created": 1459285117, "timestamp_updated": 1459285117, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.570957", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21942245": {"recommendationid": "21942245", "author": {"steamid": "76561198136247140", "num_games_owned": 801, "num_reviews": 55, "playtime_forever": 129, "playtime_last_two_weeks": 1, "last_played": 1515226316}, "language": "koreana", "review": "강렬한 인상과 독특한 센스를 겸비한 플랫포머 퍼즐 액션 게임인 서큘라 인피니티입니다.\n잘짜여진 수십개의 스테이지들은 난이도가 상당하며 죽으면 죽기 직전 자리부터 시작시켜주는 관용이 있지만 \n스테이지별 클리어 시간을 제는데다가 죽어버리면 해당스테이지의 노데스마크를 획득할 수 없는 등 \n도전욕을 자극하는 코어한 요소도 충만합니다.\n\n하지만 이 게임의 진짜는 역시 독특한 감각의 음악과 흡사 석판화를 보는 듯 한 초월적인 센스의 그래픽 \n의외로 박력넘쳐서 굉장히 시원시원한 액션, 어째서인지 설명을 못하겠는데 그냥 소름끼치게 잘 만든 연출 등\n말 그대로 감각적인 요소들을 즐기는 것에 있습니다.\n\n구매를 망설이고 계시는 분들께는 이 게임이 재미를 보장한다고는 말씀 못드리겠지만 \n독특한 경험을 재공해 줄 것은 확신해 드릴 수 있습니다.", "timestamp_created": 1458470051, "timestamp_updated": 1458470051, "voted_up": true, "votes_up": 8, "votes_funny": 2, "weighted_vote_score": "0.644013", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21484305": {"recommendationid": "21484305", "author": {"steamid": "76561197995355816", "num_games_owned": 300, "num_reviews": 34, "playtime_forever": 1229, "playtime_last_two_weeks": 0, "last_played": 1456211715}, "language": "english", "review": "Games as LSD alternatives are nothing new, but [i]Circa Infinity[/i] is in the upper echelon of the category. It remembers that weirdness is not a substitute for discipline, and so tempers its abstract presentation with immaculate level design and a blazing tempo.\n\nFull review:\nhttp://www.darkstation.com/reviews/circa-infinity/", "timestamp_created": 1456523479, "timestamp_updated": 1456523479, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.417970", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21335737": {"recommendationid": "21335737", "author": {"steamid": "76561198091970955", "num_games_owned": 701, "num_reviews": 38, "playtime_forever": 283, "playtime_last_two_weeks": 0, "last_played": 1455960210}, "language": "schinese", "review": "玩起来感觉就是把脑浆拿出来在搅拌机里反复搅拌然后再塞回来，难度相当大，不说了好刺激，我去挂卡了……", "timestamp_created": 1455960362, "timestamp_updated": 1455960546, "voted_up": true, "votes_up": 2, "votes_funny": 3, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21131363": {"recommendationid": "21131363", "author": {"steamid": "76561198165171901", "num_games_owned": 121, "num_reviews": 11, "playtime_forever": 421, "playtime_last_two_weeks": 0, "last_played": 1465671035}, "language": "russian", "review": "Я наиграл в эту игру очень мало, но я уже подумываю о том как буду резать вены или прыгать с 666 этажа", "timestamp_created": 1455210268, "timestamp_updated": 1455210268, "voted_up": true, "votes_up": 3, "votes_funny": 7, "weighted_vote_score": "0.440478", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21048931": {"recommendationid": "21048931", "author": {"steamid": "76561198038582352", "num_games_owned": 249, "num_reviews": 13, "playtime_forever": 530, "playtime_last_two_weeks": 0, "last_played": 1497607330}, "language": "russian", "review": "Хорошая игра с интересной механикой, и крутыми уровнями. Стоит полную цену.", "timestamp_created": 1454928808, "timestamp_updated": 1454928840, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.523680", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21045423": {"recommendationid": "21045423", "author": {"steamid": "76561198042994091", "num_games_owned": 487, "num_reviews": 61, "playtime_forever": 107, "playtime_last_two_weeks": 0, "last_played": 1458515245}, "language": "english", "review": "I love this game almost as much as I hate it.\n", "timestamp_created": 1454912606, "timestamp_updated": 1454912606, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.516432", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21025759": {"recommendationid": "21025759", "author": {"steamid": "76561198117453739", "num_games_owned": 63, "num_reviews": 22, "playtime_forever": 227, "playtime_last_two_weeks": 0, "last_played": 1479573917}, "language": "koreana", "review": "※주의 이게임에는 눈을 3개이상 필요로합니다", "timestamp_created": 1454853936, "timestamp_updated": 1454853936, "voted_up": true, "votes_up": 2, "votes_funny": 7, "weighted_vote_score": "0.500000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21007042": {"recommendationid": "21007042", "author": {"steamid": "76561198040490266", "num_games_owned": 160, "num_reviews": 51, "playtime_forever": 99, "playtime_last_two_weeks": 0, "last_played": 1455508909}, "language": "english", "review": "I can no longer tell the difference between left and right. 10/10", "timestamp_created": 1454791756, "timestamp_updated": 1454905456, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.492611", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21003888": {"recommendationid": "21003888", "author": {"steamid": "76561198136545941", "num_games_owned": 60, "num_reviews": 1, "playtime_forever": 17, "playtime_last_two_weeks": 0, "last_played": 1454783601}, "language": "english", "review": "This game costs WAY too much even with discount.\n\nThe challenge goes up each level...but the gameplay is repetitive and not worth $10 or even $5.\nIt feels like a game that ou would find online and complete in a day.\nIt's fun for the first few plays but not worth the cash.", "timestamp_created": 1454784129, "timestamp_updated": 1454784129, "voted_up": false, "votes_up": 15, "votes_funny": 3, "weighted_vote_score": "0.346021", "comment_count": "6", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20962011": {"recommendationid": "20962011", "author": {"steamid": "76561198159044960", "num_games_owned": 188, "num_reviews": 7, "playtime_forever": 348, "playtime_last_two_weeks": 0, "last_played": 1468511265}, "language": "english", "review": "Even an hour after playing I still see circles\n10/10 would break eyes again", "timestamp_created": 1454645186, "timestamp_updated": 1454645186, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.492611", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20716767": {"recommendationid": "20716767", "author": {"steamid": "76561198069177448", "num_games_owned": 58, "num_reviews": 1, "playtime_forever": 174, "playtime_last_two_weeks": 0, "last_played": 1514772632}, "language": "english", "review": "A very refreshing game that  is totally unique. Circa Infinity has the perfect combination of mechanics, fun, and difficulty.", "timestamp_created": 1453607619, "timestamp_updated": 1453607619, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20549457": {"recommendationid": "20549457", "author": {"steamid": "76561198178252247", "num_games_owned": 70, "num_reviews": 3, "playtime_forever": 268, "playtime_last_two_weeks": 0, "last_played": 1457547724}, "language": "english", "review": "Cognitively enganging, aesthetically stimulating, adrenaline inducing, and seizure causing. I couldn't ask for a more original, fun, and stimulating game! Hours of fun, SO COOL! BUY IT!", "timestamp_created": 1452900083, "timestamp_updated": 1452900083, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20480069": {"recommendationid": "20480069", "author": {"steamid": "76561198071348829", "num_games_owned": 137, "num_reviews": 11, "playtime_forever": 454, "playtime_last_two_weeks": 0, "last_played": 1506275585}, "language": "english", "review": "This game is a metaphor for enlightenment. HIghly innovative, great aesthetic, unique little game. I hope for a sequel!", "timestamp_created": 1452565437, "timestamp_updated": 1452565437, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.492611", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20410059": {"recommendationid": "20410059", "author": {"steamid": "76561198095704053", "num_games_owned": 87, "num_reviews": 1, "playtime_forever": 498, "playtime_last_two_weeks": 0, "last_played": 1468195846}, "language": "english", "review": "Circa Infinity is a hypnotizing puzzle platformer that couples mind bending visuals and level design to create a truly wonderful and unique experience.\n\n\n-Cohesive and Attractive Art Style is engaging and an integral part of each and every level.\n\n-Circa Infinity certaintly becomes difficult in later stages, yet the game introduces new mechanics and level designs at a steady (yet somewhat quick manner) to ease the player into each level. The reasonable difficulty curve creates a satisifying and rewarding experience. \n\n-Achievement System encourages continued play after initial completion.\n\n-The amazing soundtrack by Jack and Jim Fay keeps you engaged and absorbed by the experience. (The purchasable Soundrack includes FLAC and MP3 formats)\n\n\nCirca Infinity is an outstanding experience and I would absolutely recommend it to anyone.This game deserves more attention and is certaintly worth a try. Don't believe me? Give the demo a go.\n\nUPDATE: June 23, 2016\n-A new game mode \"Circa Affinity\" has been added. This game mode is more of the gameplay you know and love with new levels and selectable color palettes. Complete as many levels as you can to unlock more of these colors and new stages. A welcome update for those wanting  gameplay beyond the original levels.", "timestamp_created": 1452302317, "timestamp_updated": 1480288408, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20401121": {"recommendationid": "20401121", "author": {"steamid": "76561197967246067", "num_games_owned": 1281, "num_reviews": 17, "playtime_forever": 410, "playtime_last_two_weeks": 0, "last_played": 1458687129}, "language": "english", "review": "Circa Infinity is simple but elegant and becomes very challenging in later stages. Like an impressionist's take on Super Hexagon.", "timestamp_created": 1452273650, "timestamp_updated": 1494200869, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500225", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20392880": {"recommendationid": "20392880", "author": {"steamid": "76561198061315101", "num_games_owned": 261, "num_reviews": 30, "playtime_forever": 296, "playtime_last_two_weeks": 0, "last_played": 1482784745}, "language": "english", "review": "Hypnotizing music video and challenging game. Awesome looking Bosses, great design and cool soundtrack. And I think there's a story behind all those dream-sequence symbols.", "timestamp_created": 1452244675, "timestamp_updated": 1452244781, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20373245": {"recommendationid": "20373245", "author": {"steamid": "76561198086348543", "num_games_owned": 811, "num_reviews": 12, "playtime_forever": 37, "playtime_last_two_weeks": 0, "last_played": 1451153640}, "language": "english", "review": "a hidden gem that more people need to find", "timestamp_created": 1452170094, "timestamp_updated": 1452170094, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.497904", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20339345": {"recommendationid": "20339345", "author": {"steamid": "76561198045306690", "num_games_owned": 214, "num_reviews": 8, "playtime_forever": 104, "playtime_last_two_weeks": 0, "last_played": 1453424960}, "language": "english", "review": "Fun, addicting, challenging, and a smart take on 2D platforming.  Levels ramp up in difficulty by introducing mechanics in an intuitive way, then testing the player on what they've learned.  Timing based puzzles are aplenty, and you must traverse the spheres using skill and cunning.  \n\nKenny Sun was very smart in his level design.  The game is divided into 5 (maybe 6?) parts.  It gets incredibly hard, but deaths don't feel too punishing.  Dying only takes you back 2 spheres, not to the beginning of the level.  \n\nI'm on part 3 right now.  If you're willing to put the effort into beating the parts, you will be rewarded with amazing new mechanics that will make you say \"Whoa\" out loud.  \n\nEPILEPSY WARNING!  This game might be risky to play for people with epilepsy.  Lots of flashing from black to white.\n\nI highly recommend buying this game.  It's fantastic.", "timestamp_created": 1452044783, "timestamp_updated": 1452044783, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20276116": {"recommendationid": "20276116", "author": {"steamid": "76561198000811052", "num_games_owned": 152, "num_reviews": 6, "playtime_forever": 160, "playtime_last_two_weeks": 0, "last_played": 1498807022}, "language": "english", "review": "A little frickin masterpiece.", "timestamp_created": 1451868481, "timestamp_updated": 1451964200, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.475805", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20223455": {"recommendationid": "20223455", "author": {"steamid": "76561197998759082", "num_games_owned": 1353, "num_reviews": 23, "playtime_forever": 151, "playtime_last_two_weeks": 0, "last_played": 1454430635}, "language": "english", "review": "Unique, mesmerizing, and addicting. It does a great job at easing you in before the difficulty really starts to ramp up.", "timestamp_created": 1451754477, "timestamp_updated": 1451754477, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.509345", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20181817": {"recommendationid": "20181817", "author": {"steamid": "76561198109103623", "num_games_owned": 140, "num_reviews": 2, "playtime_forever": 659, "playtime_last_two_weeks": 0, "last_played": 1514661205}, "language": "english", "review": "Easy to play, hard to master. Awesome soundtrack, awesome gameplay, awesome achievements. \nYour brain will be fighting itself a lot.\ncirca 10/10", "timestamp_created": 1451661278, "timestamp_updated": 1451661278, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.497512", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20145271": {"recommendationid": "20145271", "author": {"steamid": "76561198043554063", "num_games_owned": 121, "num_reviews": 67, "playtime_forever": 145, "playtime_last_two_weeks": 0, "last_played": 1453060559}, "language": "english", "review": "Probably the first game to wedge a spike into my mind, but it's fun and creative.\n\nThis game can be as eyewarping as it looks, testing your ability to multi-task and keep track of different points of view with your eyes and arrow keys all at once.\n\nIt's one of those few games that does difficulty well - it rends you wanting to get past this next single level and you feel accomplished when you manage to do so. Very addicting.\n\nIf you've played Super Hexagon, you might think this looks similar. But if anything, this game is more like the final boss from 140.\n\nThe game does require some quick reflexes sometimes, but it actually has a lot of puzzle, a lot of planning, and a lot spinning the gears in your brain into just the right motion to be able to get past certain parts.\n\nAs opposed to Super Hexagon you get pit stops and checkpoints in between sections of the level so it's much more forgiving.", "timestamp_created": 1451559344, "timestamp_updated": 1453061411, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20082676": {"recommendationid": "20082676", "author": {"steamid": "76561198046365755", "num_games_owned": 314, "num_reviews": 20, "playtime_forever": 83, "playtime_last_two_weeks": 0, "last_played": 1452012471}, "language": "german", "review": "The concept of the game is good, it evoloves greatly throughout the game, but what i appreciate even more are all the artistic choices for that game. The music, the weird sprites, how the colors play a role, the camera movement, sound effects. It all creates such a cool experience.", "timestamp_created": 1451424444, "timestamp_updated": 1451424444, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20072500": {"recommendationid": "20072500", "author": {"steamid": "76561198071564695", "num_games_owned": 392, "num_reviews": 6, "playtime_forever": 339, "playtime_last_two_weeks": 0, "last_played": 1465579413}, "language": "russian", "review": "Уже на третьей стадии управляя двумя персами игра начала вызывать головокружение и тошноту. Что сказать, лучшее средство проблеваться  :^)", "timestamp_created": 1451405080, "timestamp_updated": 1451405080, "voted_up": true, "votes_up": 13, "votes_funny": 13, "weighted_vote_score": "0.531114", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20070160": {"recommendationid": "20070160", "author": {"steamid": "76561198204282676", "num_games_owned": 750, "num_reviews": 82, "playtime_forever": 44, "playtime_last_two_weeks": 0, "last_played": 1451399724}, "language": "schinese", "review": "被制得服服帖帖的高难度游戏。\n主要是眼花缭乱加上手慢脚乱。预告片中演示的后面的关卡貌似会变成两人的世界交汇，同时控制那两个人。。扛不住啊\n\n又是一款会让你萌生砸键盘的欲望的游戏\n艺术风格和音乐都是一等一的洗脑。我就一边死都能一边和着节奏编一段RAP了。。音乐的节奏也很有跳跃感，有时候明明不想跳，跟着节奏就特么跳了。。下次试试BGM替换效果如何，如果有下次的话\n啊。一开始玩ACT1我还好好的。就这种稍微有点点难的游戏。还行吧。\n然后ACT2。我。。。跪地 打滚各种癫狂，都开始说胡话了\nACT3?   我2还没过呢。\n不行了不行了。。认怂\n但是好有趣啊。\n成就也是炫，一命不死通关唉。。谁解个给我看看", "timestamp_created": 1451400564, "timestamp_updated": 1451455201, "voted_up": true, "votes_up": 8, "votes_funny": 4, "weighted_vote_score": "0.622730", "comment_count": "6", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20064886": {"recommendationid": "20064886", "author": {"steamid": "76561198238867546", "num_games_owned": 53, "num_reviews": 10, "playtime_forever": 76, "playtime_last_two_weeks": 0, "last_played": 1455342297}, "language": "english", "review": "There's a reason the reviews are 100% positive.", "timestamp_created": 1451388886, "timestamp_updated": 1451388886, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19904201": {"recommendationid": "19904201", "author": {"steamid": "76561197994397124", "num_games_owned": 1377, "num_reviews": 22, "playtime_forever": 350, "playtime_last_two_weeks": 0, "last_played": 1453644477}, "language": "english", "review": "At first sight, this game seems similar to Super Hexagon because it is based on a vaguely similar simple idea, and has that constant diving \"mise en abyme\" (which is -more or less- under your control in this game).\nBut both games are different in many other ways (mechanics, art style -'though both are minimalistic-, level design and rythm) and this is *definitely* not a ripoff, might be an inspiration, nothing more.\n\nIf you liked Super Hexagon, it is likely you will like this too, because it is the same kind of game.\nIf you don't know or didn't like Super Hexagon, I encourage you to try Circa Infinity demo, which features the entire first world, boss included.\n\nHappy running !", "timestamp_created": 1450956372, "timestamp_updated": 1450957658, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.514359", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "19452382": {"recommendationid": "19452382", "author": {"steamid": "76561198145825888", "num_games_owned": 88, "num_reviews": 7, "playtime_forever": 770, "playtime_last_two_weeks": 4, "last_played": 1515497822}, "language": "english", "review": "tanks 2 dis gaym i need uh new brain", "timestamp_created": 1449120734, "timestamp_updated": 1449120734, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.504940", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18922532": {"recommendationid": "18922532", "author": {"steamid": "76561198043561454", "num_games_owned": 470, "num_reviews": 1, "playtime_forever": 1198, "playtime_last_two_weeks": 0, "last_played": 1468680578}, "language": "english", "review": "Circa Infinity is one of those rare games that utilizes a simple mechanic to explore a philosophical concept though subtext alone. Games like this take advantage of a potential in video games that is all-too-rarely utilized, and this alone makes it worth the download. While the last couple acts might have benefited from more development time to flesh out their original ideas, and the final boss is a bit of a letdown (WAY too easy!), the game more than makes up for it in the shear creativity of its design concepts (also note: the game's other 4 bosses are fantastic!).\n\nThis game borrows play elements from the supurb Ikaruga, and like that game it wears its Eastern influences on its sleeve. But whereas Ikaruga settled for a final boss battle with the Taijitu, the Chinese symbol that depicts the fundamantal polarity of all things in the universe, developer Kenny Sun uses this illustrated metaphor as the backdrop for his entire game. One could look at Circa Infinity as a form of mental gymnastics on the very principles of yang vs. yin, as the game forces you to process an increasing litany of opposing gameplay elements simultaneously (left vs. right, move vs. stop, jump vs. crouch, and of course, Ikaruga's color-matching black vs. white mechanics). At its core, this game is a run-and-dodge platformer in the style of the original Donkey Kong (substitute ambulating devils in the place of rolling barrels); these elements bring a fresh take to this tried-and-true genre. It all can become extremely challenging, at times even seeming to be borderline unfair. It is only when you replay earlier levels and find out how eminently do-able they are do you recognize how sound and skill-based the gameplay truly is.\n\nIn an interesting twist, Sun fuses his Eastern philosophical inspirations with Western religious iconography depicting Hell. To do this, he borrows heavily from the first act of the Divine Comedy (Dante's Inferno), complete with a tearful Satan at the center of a not-quite infinite fractal of mesmorizing concentric circles. The exit-less purgatory, with each door leading into the same room, tonally evokes Jean-Paul Sartre's famous play. The biblically unattired male and female protagonists, always just beyond an arm's reach yet doomed to chase one another for eternity, might well be Adam and Eve. In keeping with the theme of root contrast, the gender difference is depicted by the presence (or absence) of a vertically-oriented pair of cleverly placed (or omitted) pixels where the second Chakra might be. \n\nIn utilizing spiritual symbolism from both hemispheres in a single artistic expression, one gets the sense that Kenny Sun is making a positive statement on globalism. Perhaps he is suggesting that the Devil may have a place on the Dharma Wheel alongside the metaphysically innocent. Or perhaps not! All that really matters is whether or not the game is fun, and whether you feel happy with the money and time you have invested in it when it's over. For $9.99 and 10 hours or so of gameplay (more than double if you add in the remarkably fun speedruns and challenges), I'd say it's both worth it and worthwhile. I look forward to future games from this very promising indie developer, and I hope this game garners enough support to keep him at it.\n\nOne final note: Adam and Eve are simultaneously controlled by the same commands, and in the game's third act, they also interact with the game environment and enemies in the same way. Which character becomes the subject of your default control focus vs. who you let lag behind may say something implicit about your attitude towards gender roles and how you identify with gender yourself. (It would be awesome if the game statistically tracked which character you tend to enter the circles first with!)", "timestamp_created": 1446869814, "timestamp_updated": 1446955093, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.480866", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18751846": {"recommendationid": "18751846", "author": {"steamid": "76561197990036156", "num_games_owned": 301, "num_reviews": 208, "playtime_forever": 58, "playtime_last_two_weeks": 0, "last_played": 1452657762}, "language": "english", "review": "Very well made twitch/speedrun platformer with the unique element of being circular and going into circles within circles to progress through the levels. The design is absolutely flawless and you will quickly get absorbed into the game. The designers realised this too and made it easy to jump from the scores screen to the next level.", "timestamp_created": 1446161304, "timestamp_updated": 1446161304, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.470524", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18572052": {"recommendationid": "18572052", "author": {"steamid": "76561198044546325", "num_games_owned": 184, "num_reviews": 1, "playtime_forever": 75, "playtime_last_two_weeks": 0, "last_played": 1448247353}, "language": "english", "review": "Pew Die Pie had it right - this game is insane, really fun to play, with an awesome soundtrack, and a simple mechanic that it takes to so many places.  It's hard to stop playing.", "timestamp_created": 1445286415, "timestamp_updated": 1445286415, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.495084", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18509147": {"recommendationid": "18509147", "author": {"steamid": "76561197961577743", "num_games_owned": 1422, "num_reviews": 14, "playtime_forever": 215, "playtime_last_two_weeks": 0, "last_played": 1492964102}, "language": "english", "review": "You spin me right round, baby right round \\o/\n\nOriginal \"platformer\" with a very interesting gameplay mechanic. Trapped in a circular world you have to run in circles to get your character(s) to the end of each (sub)level. Easy enough eh? No, not really. There are tons of monsters in each stage trying to prevent you from getting to the end. Even tho you only need 3 buttons to play this game, it seems to get rather difficult later on. To be honest I am only at Part II of V?! (not sure bout that!). I already screamed at the screen several times but always combined with a good laugh. Aint that frustrating, as you can't really die. The game just sets you back to the last subcircle if you fail to complete a circle without getting hit or w/e. I really dig the artstyle/gameplay mechanic & not to forget the amazing soundtrack. I sure see myself coming back to the world of circles again and again, just to get past them all without dying (haha, as if!)\n\nControls are smooth, just as expected with a controller. Can't say anything bout keyboard controls tho.\n\nAll in all I really enjoy this game so far. Glad I gave it a go, even without playing the demo+the trailer just confused the hell out of me. Don't forget to try the demo, you might like it, even if you are not a typical fan of platformers. o/", "timestamp_created": 1445023781, "timestamp_updated": 1445023781, "voted_up": true, "votes_up": 6, "votes_funny": 2, "weighted_vote_score": "0.549233", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18450798": {"recommendationid": "18450798", "author": {"steamid": "76561197993541480", "num_games_owned": 93, "num_reviews": 3, "playtime_forever": 50, "playtime_last_two_weeks": 0, "last_played": 1514935050}, "language": "english", "review": "This game reminds me of my dreams.", "timestamp_created": 1444706921, "timestamp_updated": 1444706921, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500069", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18237789": {"recommendationid": "18237789", "author": {"steamid": "76561197996834152", "num_games_owned": 226, "num_reviews": 2, "playtime_forever": 136, "playtime_last_two_weeks": 0, "last_played": 1474645896}, "language": "english", "review": "Amazing game. It's good to see a game with great level design instead of the endless endless runners. The music is also incredible. Can't recommend enough.", "timestamp_created": 1443459095, "timestamp_updated": 1443459095, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.500069", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18235823": {"recommendationid": "18235823", "author": {"steamid": "76561197968283536", "num_games_owned": 193, "num_reviews": 3, "playtime_forever": 36, "playtime_last_two_weeks": 0, "last_played": 1443488276}, "language": "english", "review": "Circa Inifinity has the basics of a reall solid, tight-controlling platformer but it warps and wraps them into noneuclidean space. You feel yourself getting drawn in by the pulsating circles and music and when you eventually look away, the world seems to pulsate. \n\nA dazzling and hypnotic experience. Unique.", "timestamp_created": 1443449885, "timestamp_updated": 1443449885, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.526045", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18171582": {"recommendationid": "18171582", "author": {"steamid": "76561198062085036", "num_games_owned": 121, "num_reviews": 24, "playtime_forever": 203, "playtime_last_two_weeks": 0, "last_played": 1506280501}, "language": "english", "review": "It's platformer with only three buttons.\nBut god damn hard, fun and beautiful.\nGames using black and white as theme color always gives the feeling of zen.", "timestamp_created": 1443099611, "timestamp_updated": 1443099611, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.503126", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18122278": {"recommendationid": "18122278", "author": {"steamid": "76561197977081885", "num_games_owned": 524, "num_reviews": 368, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1442355937}, "language": "english", "review": "Pudie pie says its good so do I, so wheres my millions??", "timestamp_created": 1442775871, "timestamp_updated": 1442775871, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.493087", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18111085": {"recommendationid": "18111085", "author": {"steamid": "76561198022235943", "num_games_owned": 301, "num_reviews": 4, "playtime_forever": 339, "playtime_last_two_weeks": 0, "last_played": 1443265553}, "language": "japanese", "review": "円の外側からスタートし、特定の場所から内側に入って、更に円の中心近くを回ってる円にジャンプして入るゲーム。\n操作は右左とワンボタンだけです。\n円の外や内に様々な動きをする敵が居てそれに触れるとアウトで、ひとつ前の円に戻されます。\n1.2面あたりは普通のアクションゲームのノリでクリアできますが、3面以降から仕掛けが増えて苦戦し始めます。\n円に沿ってキャラが動くので右左を間違えてしまったり、円の内側と外側も見なければいけないし、\n更に後半は色の要素も出てきますので、脳ががわけわからなくなってしまいました。\n敵の動きは完全にパターンなのと、ステージごとにコンセプトがありますのでそこを掴めればクリアしやすくなります。\n後半は、アクションパズルゲーム化しており、脳みそが辛くなりますがオリジナリティあふれるゲームに仕上がってると思います。", "timestamp_created": 1442723863, "timestamp_updated": 1442723863, "voted_up": true, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.689265", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18093670": {"recommendationid": "18093670", "author": {"steamid": "76561198101731628", "num_games_owned": 48, "num_reviews": 3, "playtime_forever": 89, "playtime_last_two_weeks": 0, "last_played": 1485039647}, "language": "english", "review": "Amazing brain melting gameplay, made me want to punch the screen and smash my keyboard soHARD!\nBut very rewarding after beating the hardest stages. Higly recommended.", "timestamp_created": 1442636062, "timestamp_updated": 1442636062, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.503126", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18077438": {"recommendationid": "18077438", "author": {"steamid": "76561198067937537", "num_games_owned": 2354, "num_reviews": 125, "playtime_forever": 491, "playtime_last_two_weeks": 0, "last_played": 1458443716}, "language": "english", "review": "The problem with a lot of platformers these days is that they are rarely original. Circa Infinity is not one of these platformers.\n\nIn Circa Infinity you control character(s) that are stuck in a circular world. Your objective is to reach the center ring of each level. Unlike other platformers you must use the circular world to your advantage in order to figure out how to progress to the next ring. You will encounter enemies that you will try to avoid. If you hit an enemy you will be sent back to the previous ring and will have to complete that ring again.\n\nI would probably classify Circa Infinity as more of a puzzle platformer than just a platformer. In the later levels you really need to plan out what you are going to do or you will fail. These levels require that you approach them in a certain way or you won't be able to complete them. \n\nI would classify the first three worlds of the game as moderately difficult with the last two worlds being hard. Currently I am still completing levels in the last world. The challenge in Circa Infinity comes from how many things you need to keep track of at any time. In the later levels you will be keeping tracking of two characters as well as many enemies which you have to remember to avoid. At times this can be overwhelming which leads to the difficulty. \n\nI have had a lot of fun with Circa Infinity but I know that the game will not be for everyone. I could see the game making people with motion sickness dizzy. Also if you have trouble keeping track of a bunch of things at the same time you may have some trouble with the game.\n\nOverall Circa Infinity is a very good puzzle platformer that succeeds in doing something new with the genre.\n\nNote: I received a free review copy of Circa Infinity. Other than the free review copy I received no other compensation for the review.\n\n[url=http://www.geekyhobbies.com/circa-infinity-indie-game-review/] Read My Full Review [/url]\n", "timestamp_created": 1442532625, "timestamp_updated": 1442532625, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.540676", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18076880": {"recommendationid": "18076880", "author": {"steamid": "76561198040917152", "num_games_owned": 120, "num_reviews": 1, "playtime_forever": 234, "playtime_last_two_weeks": 0, "last_played": 1456614454}, "language": "english", "review": "Circa Infinity is an extremely fun and challenging puzzle platformer.", "timestamp_created": 1442528698, "timestamp_updated": 1442528698, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500069", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18038143": {"recommendationid": "18038143", "author": {"steamid": "76561198087166222", "num_games_owned": 45, "num_reviews": 1, "playtime_forever": 313, "playtime_last_two_weeks": 0, "last_played": 1463952983}, "language": "english", "review": "You won't look away while you progress. You'll hear nothing but the solid atmospheric upbeat music. You'll make loud noises when you die a lot. But it's fun the entire way through. The best part is the game's surprising evolution. You'll never imagine what part 5 might look like when you're playing part 1. Fundamentally sound puzzle and game design form the cornerstone for an unforgettable game experience.", "timestamp_created": 1442279117, "timestamp_updated": 1442279117, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.501416", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18028046": {"recommendationid": "18028046", "author": {"steamid": "76561198083702133", "num_games_owned": 759, "num_reviews": 55, "playtime_forever": 132, "playtime_last_two_weeks": 0, "last_played": 1488796843}, "language": "german", "review": "https://www.youtube.com/watch?v=mMGSGxHNlLM hier ist meine Review dazu ;)", "timestamp_created": 1442223077, "timestamp_updated": 1442223077, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.502463", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18017099": {"recommendationid": "18017099", "author": {"steamid": "76561198048085449", "num_games_owned": 753, "num_reviews": 206, "playtime_forever": 193, "playtime_last_two_weeks": 0, "last_played": 1441538959}, "language": "english", "review": "https://youtu.be/awEwf-m00a8\n[i]Game:[/i] Circa Infinity\n[i]Genre:[/i] Abstract Platformer\n[i]Developer:[/i] Kenny Sun\n[i]Publisher:[/i] Kenny Sun\n[i][u]Copy supplied by developer[/u][/i]\n\n[b]Circa Infinity[/b] is an abstract platformer developed and published by Kenny Sun.\n\n[h1]GRAPHICS[/h1]\nThe game feels like you are on drugs. The black and white that becomes more colorful the more you play, the circles that keep on rolling, everything makes you feel like you are on acid. While they do look good, there is nothing too spectacular to them.\n\n[h1]GAMEPLAY[/h1]\nThe game is pretty straight-forward: you must jump to enter a circle, and jump again to enter another floating circle. Then you repeat, and repeat, and repeat until you get to the final one and you beat the level. While this might sound repetitive, the more you advance into the game, the more varied the levels get: new enemies, different patterns and the constant fear of getting hit make this a gripping game that will keep you hooked for quiet some time.\n\n[h1]CHALLENGE[/h1]\nAs mentioned, the game is pretty challenging, and the further you get into the game, the more it gets harder, and harder, to the point of being borderline frustrating. However, there are some safe areas in the level that are basically checkpoints in which enemies can't reach you, so you hardly ever need to restart a level from the first circle.\n\n[h1]SOUND[/h1]\nThat soundtrack... Damn, if it is good. Even though it lacks in sound effects, the music is fantastic and exciting, giving a different rythm to each level and losing yourself in the acid trip that you are taking.\n\n[h1]REPLAYABILITY[/h1]\nMultiple achievements and challenges are the only thing that will make you want to complete this game. Otherwise, once you finished a level you will not want to come back to it, especially if it was though as nails.\n\nOverall, if you enjoy platformers and games that closely resemble a drug-induced dream, this game is for you. The gameplay is easy to understand but hard to master, but it still delivers a satisfying experience.\n\n[h1]Story: n/a\nGraphics: 7\nGameplay: 9\nChallenge: 9\nSound: 8.5\nReplayability: 7.5\n\n[b]ENJOYMENT: 8.5\nFRUSTRATION: 7[/b][/h1]\n\nFollow me on Twitter: @nickygra97\n[url=https://www.youtube.com/channel/UC_VuBkttXIrpbrxwfYL_B-w]Subscribe to my channel[/url]\n[url=http://www.facebook.com/EnjoyTheGaming]Like on Facebook[/url]\n[url=http://nickygra.wix.com/enjoythegaming]Check my official website[/url]\n[url=http://steamcommunity.com/groups/EnjoyTheGaming]Join my Steam group[/url]", "timestamp_created": 1442157555, "timestamp_updated": 1442157555, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.497889", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18016408": {"recommendationid": "18016408", "author": {"steamid": "76561198076857470", "num_games_owned": 1355, "num_reviews": 122, "playtime_forever": 227, "playtime_last_two_weeks": 0, "last_played": 1443237815}, "language": "english", "review": "...9/10...", "timestamp_created": 1442154602, "timestamp_updated": 1455421988, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.444580", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "17989300": {"recommendationid": "17989300", "author": {"steamid": "76561197987930658", "num_games_owned": 1682, "num_reviews": 85, "playtime_forever": 19, "playtime_last_two_weeks": 0, "last_played": 1442007020}, "language": "english", "review": "A crazy, out of this world platformer that will have you second guessing everything you do, its out right nuts! Simple colours might be used but this certainly helps with how crazy-filled levels can get and the music is utterly fantastic and great to listen along to while you hop from one area to the next avoiding the various different creatures that get in your way.\n\nhttps://www.youtube.com/watch?v=52emNYOMTmU", "timestamp_created": 1442009807, "timestamp_updated": 1442009807, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.502556", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17986082": {"recommendationid": "17986082", "author": {"steamid": "76561198052333663", "num_games_owned": 339, "num_reviews": 83, "playtime_forever": 186, "playtime_last_two_weeks": 0, "last_played": 1444268541}, "language": "english", "review": "First Impressions Video:\n\nhttps://youtu.be/wTiKU8xIiOA\n\nCirca Infinity is a puzzle platformer game like no other. You play on the inside and the outside of a circle, dodging terrible demons. I was more surprised by this game than i thought I would be. It feels truly unique. It has a great soundtrack, it looks beautiful and mindbending, and the mechanics are phenomenal.\n\nAs of this review I've played through half of the third chapter (out of five). The first was easy (as you may see in the video), but from there it gets much harder. This game is for anyone who wants a game that will make them think, and then cause their brain to catch fire... and maybe explode. Anyways, I was sucked into the game and I would recommend it to anyone.", "timestamp_created": 1441994814, "timestamp_updated": 1441994814, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.493080", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "17986019": {"recommendationid": "17986019", "author": {"steamid": "76561198067151874", "num_games_owned": 3141, "num_reviews": 100, "playtime_forever": 196, "playtime_last_two_weeks": 0, "last_played": 1452079381}, "language": "english", "review": "100% original and awesome game!!\nhttps://www.youtube.com/watch?v=YYKmXfMYn3s", "timestamp_created": 1441994513, "timestamp_updated": 1441994513, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.429421", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17977399": {"recommendationid": "17977399", "author": {"steamid": "76561198142873039", "num_games_owned": 1823, "num_reviews": 36, "playtime_forever": 380, "playtime_last_two_weeks": 0, "last_played": 1467325513}, "language": "english", "review": "once you reached Part ||| - a nice little game gradually becomes a masterpiece", "timestamp_created": 1441937727, "timestamp_updated": 1441937727, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.569924", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "17977351": {"recommendationid": "17977351", "author": {"steamid": "76561197970494320", "num_games_owned": 532, "num_reviews": 9, "playtime_forever": 67, "playtime_last_two_weeks": 0, "last_played": 1443064326}, "language": "english", "review": "There are 2 dimensions- left/right and in/out.  Your goal is to keep diving while avoiding red sprites that vaguely look like devils, angels, and fire.  However getting hit just pushes you back towards the beginning of the level.  This makes a great fast paced, but unstressful experience.\n\nExcellent soundtrack as well!", "timestamp_created": 1441937329, "timestamp_updated": 1441937329, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.520958", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "17977265": {"recommendationid": "17977265", "author": {"steamid": "76561198051138467", "num_games_owned": 92, "num_reviews": 5, "playtime_forever": 136, "playtime_last_two_weeks": 0, "last_played": 1442286715}, "language": "english", "review": "CURSE YOU KENNY SUN, TRULY. \n\nTo everyone else: \nThe game is beautifully designed, incredibly satisfying, and like nothing you've ever played. Try it, you won't regret it. Then tell your friends.", "timestamp_created": 1441936725, "timestamp_updated": 1441936725, "voted_up": true, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.501416", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "17976950": {"recommendationid": "17976950", "author": {"steamid": "76561198115087103", "num_games_owned": 343, "num_reviews": 3, "playtime_forever": 611, "playtime_last_two_weeks": 0, "last_played": 1475426687}, "language": "english", "review": "This game is a good example of what a puzzle/platform game should be.\nIt is not an endless runner as one might think from the captures, but a very clever frantic puzzle jumping hell.\n\nIt begins fairly easy, asking only from you some reflexes while you learn the basics, and then difficulty arise, slamming you in the face.\nIt is well balanced; some bits will nonetheless make you wish you dropped your controller before thinking \"just one more level\".\nThe achievements are well thought -- being what I call \"usefull achievements\" -- requiring from you to play the game with a different approach, making you discover how well the levels are designed (for instance, the \"finish a level going only in one direction without stopping or dying\", or \"finish a level without moving (jumping doesn't count)\").\nThe art style is clever and gorgeous, and the music sets you well in the mood.\n\nOverall, it's a great game, and a gem for speedrunners!\n\nNot sure? Try out the demo, the rest of the game is the same, WAY HARDER.", "timestamp_created": 1441934114, "timestamp_updated": 1441934149, "voted_up": true, "votes_up": 53, "votes_funny": 2, "weighted_vote_score": "0.822631", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17973651": {"recommendationid": "17973651", "author": {"steamid": "76561198038715304", "num_games_owned": 290, "num_reviews": 13, "playtime_forever": 152, "playtime_last_two_weeks": 0, "last_played": 1442587327}, "language": "english", "review": "I absolutely love this game. It has a very simple but striking visual style, an amazing soundtrack and a simple gameplay loop that is built upon. And the game is difficult. Holy hell is this game difficult. You will die many times and slam your head on the table while making angry high pitched noises, but there is nothing that can beat the satisfaction you get from finishing a difficult level.", "timestamp_created": 1441913798, "timestamp_updated": 1441913798, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.501416", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17966011": {"recommendationid": "17966011", "author": {"steamid": "76561198065013357", "num_games_owned": 546, "num_reviews": 17, "playtime_forever": 536, "playtime_last_two_weeks": 0, "last_played": 1466338410}, "language": "english", "review": "Ok, let's be clear: \"Circa Infinity\" is difficult. REALLY difficult. You will die [strike]dozens[/strike] [strike]hundreds[/strike] thousands of times, but everytime your only thought will be \"One more time! I have to try one more time!\" It's a kind of sensation that happens rarely in the magic world of platform games, but when it happens... oh, what a pleasure!", "timestamp_created": 1441868685, "timestamp_updated": 1441957683, "voted_up": true, "votes_up": 12, "votes_funny": 1, "weighted_vote_score": "0.591807", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "17964992": {"recommendationid": "17964992", "author": {"steamid": "76561197988510453", "num_games_owned": 502, "num_reviews": 61, "playtime_forever": 324, "playtime_last_two_weeks": 0, "last_played": 1482447946}, "language": "english", "review": "Really awesome and fun game.  Addictively difficult gameplay, great music, and a unique visual style come together to create an amazing game.", "timestamp_created": 1441858007, "timestamp_updated": 1441858007, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.471497", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "17964918": {"recommendationid": "17964918", "author": {"steamid": "76561198005120097", "num_games_owned": 434, "num_reviews": 29, "playtime_forever": 489, "playtime_last_two_weeks": 0, "last_played": 1453070040}, "language": "english", "review": "[h1]FULL VIDEO REVIEW[/h1] https://youtu.be/Je6nOhQW5sA\n[h1]PROS[/h1]\n[b]++Successfully balances both puzzle and platforming elements equally, resulting in a game requiring both technical skill and critical thinking[/b]\n+Incredibly simplistic but extremely challenging requiring godly levels of focus\n+4-6 Hours minimum if you are skilled with an additional speedrun mode that provides extra replayability\n+Great soundtrack that doesn’t overstep the gameplay\n[h1]CONS[/h1]\n-Level of difficulty makes the game inaccessible to newer gamers or those inexperienced with the platforming genre\n-Lackluster final boss\n\nCirca Infinity is a puzzle platformer that defies expectations with its challenging, mind warping circular levels. Right as you think the game has reached its absolute hardest you are thrown a brand new mechanic that requires you to think twice as hard as you feebly attempt to focus on everything present on screen. While the game is in no doubt challenging, the pace of the game allows you to learn how to interact with its bizarre environment by gradually ramping up the difficulty by providing you consecutive stages of the same enemies but each time adding in another element. If you are into challenging platformers like Super Meat Boy or puzzle games like Portal, I highly recommend that you play Circa Infinity.", "timestamp_created": 1441857267, "timestamp_updated": 1441857694, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.470737", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17960519": {"recommendationid": "17960519", "author": {"steamid": "76561198007089680", "num_games_owned": 132, "num_reviews": 22, "playtime_forever": 75, "playtime_last_two_weeks": 0, "last_played": 1469062300}, "language": "french", "review": "C'est simple, c'est fun, y'a du challenge, mais ça reste faisable. En gros, c'est une petite merveille qui vaut la peine, surtout pour son prix. Si vous voulez un bon jeu difficile, il est fait pour vous !", "timestamp_created": 1441826511, "timestamp_updated": 1510160103, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "17959335": {"recommendationid": "17959335", "author": {"steamid": "76561198076896570", "num_games_owned": 62, "num_reviews": 1, "playtime_forever": 902, "playtime_last_two_weeks": 0, "last_played": 1456764621}, "language": "english", "review": "I'm in love with this game. Its very mindbending and hard. Also the music... Perfect. \nI hope this won't be the only game from Kenny Sun that I've played. \nReally good game, buy it now!", "timestamp_created": 1441820658, "timestamp_updated": 1441820658, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.519242", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "17959199": {"recommendationid": "17959199", "author": {"steamid": "76561198028091020", "num_games_owned": 3008, "num_reviews": 144, "playtime_forever": 248, "playtime_last_two_weeks": 0, "last_played": 1441803023}, "language": "english", "review": "Circa Infinity is a simple, but very challenging game.\nhttps://www.youtube.com/watch?v=PYPZ-tj5J7U\nThe game isn't tough due to cheap tactics, it genuinely needs fast reflexes, thinking on your feet and adapting you strategy according to certain enemies.\n\nThe goal is to find the entrance to the circle you are walking on. Once inside, you must jump into the smaller circle within to progress. Different enemies force you to act differently. Some patrol the ground and require that you jump over them, some fly and need you to walk under them. Some can go in and out of circles, and some move only when you jump.\n\nThere's also the occasional boss to fight, which is a nice break from the regular gameplay.\nThe game's soundtrack is actually really cool, and adds to the intense action going on.\n\nOverall it's very cool, and I suggest you give it a shot if you're into hard games.", "timestamp_created": 1441820167, "timestamp_updated": 1441820167, "voted_up": true, "votes_up": 34, "votes_funny": 3, "weighted_vote_score": "0.609866", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17958311": {"recommendationid": "17958311", "author": {"steamid": "76561198038014830", "num_games_owned": 38, "num_reviews": 1, "playtime_forever": 177, "playtime_last_two_weeks": 0, "last_played": 1461778420}, "language": "english", "review": "This game is amazing. The music, the visuals, the level desgin...all exceptional. If you don't like challenging twitch games, this might not be for you, but if that's your thing, buy this now.", "timestamp_created": 1441816126, "timestamp_updated": 1441816126, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.470767", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17954469": {"recommendationid": "17954469", "author": {"steamid": "76561198093282773", "num_games_owned": 109, "num_reviews": 10, "playtime_forever": 919, "playtime_last_two_weeks": 0, "last_played": 1487904222}, "language": "japanese", "review": "幾重にも重なる円をとらえ、ひたすらその中で回るように駆け巡る\nその円の中で住まう沢山の生き物たちは、それぞれ喜びや悲しみを持っていた\nささやかな狂気をまとうモノクロの空間で響く鮮明な音楽は\nまるでこの世界の表と裏の顔を表しているようだ", "timestamp_created": 1441793608, "timestamp_updated": 1441793608, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.656413", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "17953374": {"recommendationid": "17953374", "author": {"steamid": "76561197967916798", "num_games_owned": 363, "num_reviews": 6, "playtime_forever": 42, "playtime_last_two_weeks": 0, "last_played": 1441784882}, "language": "english", "review": "This game does amazing things to my mind. It starts off nice and slow, but turns utterly insane as you go deeper and deeper into the concentric circles.\n\nAlso, I just love those chinny demons.", "timestamp_created": 1441783760, "timestamp_updated": 1441783760, "voted_up": true, "votes_up": 19, "votes_funny": 5, "weighted_vote_score": "0.546814", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17952249": {"recommendationid": "17952249", "author": {"steamid": "76561197988627086", "num_games_owned": 627, "num_reviews": 2, "playtime_forever": 121, "playtime_last_two_weeks": 0, "last_played": 1441768726}, "language": "english", "review": "Cool game. So mindbending. It smelled my brain.", "timestamp_created": 1441772160, "timestamp_updated": 1441772160, "voted_up": true, "votes_up": 15, "votes_funny": 8, "weighted_vote_score": "0.411246", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 170, "total_negative": 10, "total_reviews": 180}}
