{"reviews": {"39296637": {"recommendationid": "39296637", "author": {"steamid": "76561198016490801", "num_games_owned": 166, "num_reviews": 43, "playtime_forever": 61, "playtime_last_two_weeks": 61, "last_played": 1515871646}, "language": "english", "review": "Nice and well made, still being updated, bretty gud first person shooter. In short, it's like Wolf3D but randomly generated and with more stuff happening. There's a bit of mouse lag which makes aiming at things hard sometimes, it might just be my PC, but I'd suggest adding a way to disable VSync (unless it's already disabled in which case it's probably my fault). Or if you're using Input.GetAxis (I think that's the name) then use Input.GetAxisRaw instead for looking, as it isn't smoothed.\n\nBut what the hell am I saying, there's no way I could make something this kickass in Unity (or anything else for that matter), bravo.\n\nUpdated: VSync can be disabled in the pause menu. All is well.", "timestamp_created": 1515810171, "timestamp_updated": 1515857198, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38568990": {"recommendationid": "38568990", "author": {"steamid": "76561198030673609", "num_games_owned": 894, "num_reviews": 40, "playtime_forever": 27, "playtime_last_two_weeks": 6, "last_played": 1515718123}, "language": "english", "review": "game is good controller issues fixed. with the exception of a bug or something that makes your player move backward on their own the game is relatively polished", "timestamp_created": 1514020675, "timestamp_updated": 1515718382, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.480000", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38112873": {"recommendationid": "38112873", "author": {"steamid": "76561198277984478", "num_games_owned": 374, "num_reviews": 141, "playtime_forever": 14, "playtime_last_two_weeks": 0, "last_played": 1512591608}, "language": "english", "review": "Early Access review - \nTake some 90's DOOM, throw in Rogue-like elements, and voila! \nThat is \"Still Not Dead\" in a nutshell.\n\n( brief video of me doing not-so-good here ) \nhttps://www.youtube.com/watch?v=4QKdFFnqf9s\n\nThe pixels are nice, if you played the Pre-GZ doom era, you know the drill, you cant look up or down, you dont need to - \nthere's a perk/curse system that you choose each level - if you took a perk this level, next level you are only given curses tp pick from.\n\nOr you can forgoe the perks/curse altogether.\nThings such as - increased speed, shoot while running, 5x jumping height, there's alot of different perks/curses.\n\nThe gameplay is VERY fast.\nyou need to kill a certain number of enemies on the map to open a door, and if you take too long- an unkillable DEATH demon comes after you and pretty much gives you a bad time\n\nON the maps you pick up money ( represented by British pounds  £ ) and you can buy items you find, new weapons liek guns, new melee weapons, and special items like barbed wire you can toss around to slow enemies down.\n\nIt's al pretty nostaligc for me, having grown up with games liek DOOM being top of the line x3\n\nRecommended to anyone with a flair for old-school DOOM, roguelites, or stuff liek DEVil Daggers", "timestamp_created": 1512592873, "timestamp_updated": 1512599003, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.471037", "comment_count": "2", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "38109244": {"recommendationid": "38109244", "author": {"steamid": "76561198152230760", "num_games_owned": 58, "num_reviews": 6, "playtime_forever": 517, "playtime_last_two_weeks": 0, "last_played": 1514040199}, "language": "spanish", "review": "Un First-Person-Pixel-Shooter Roguelike como no se ha visto antes.\nEn jugabilidad recuerda al Doom clásico, mientras que gráficamente se inclina más a la nostalgia, a lo retro.\nCon cada actualización este juego va agregando contenido, puliendo su jugabilidad y mejorando el juego en general. Un early access que promete.", "timestamp_created": 1512581609, "timestamp_updated": 1512854211, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "37838660": {"recommendationid": "37838660", "author": {"steamid": "76561197973294047", "num_games_owned": 980, "num_reviews": 1, "playtime_forever": 3655, "playtime_last_two_weeks": 0, "last_played": 1511887605}, "language": "english", "review": "Procedurally generated OG-Doomalike with deliciously absurd and destructive weapons. It's regularly updated and dev is very open to feedback. An absolute steal at this price.", "timestamp_created": 1511829870, "timestamp_updated": 1511829870, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.525862", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37399059": {"recommendationid": "37399059", "author": {"steamid": "76561197961744176", "num_games_owned": 819, "num_reviews": 192, "playtime_forever": 38, "playtime_last_two_weeks": 0, "last_played": 1511565270}, "language": "english", "review": "Not bad for 3 euro.", "timestamp_created": 1511550621, "timestamp_updated": 1511550621, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.512195", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36695779": {"recommendationid": "36695779", "author": {"steamid": "76561198032382434", "num_games_owned": 2342, "num_reviews": 102, "playtime_forever": 39, "playtime_last_two_weeks": 0, "last_played": 1507911045}, "language": "english", "review": "Here are my first impressions:\nhttps://www.youtube.com/watch?v=rDo8y2K9cFc\n\nTruly a fantastic game, I really enjoyed this one. The developer knows what it takes to make a gradually intensifying classic FPS with a modern take on it. Especially if you loved older games like Doom and Quake, this is definitely up there.\nPick it up when you can! I highly recommend it!", "timestamp_created": 1511352431, "timestamp_updated": 1511352431, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "36507475": {"recommendationid": "36507475", "author": {"steamid": "76561198179970505", "num_games_owned": 108, "num_reviews": 7, "playtime_forever": 20, "playtime_last_two_weeks": 0, "last_played": 1501514463}, "language": "english", "review": "BBBBBBBBBBBBAAAAAAAAAAAAAAAAAAAAAAA", "timestamp_created": 1510648011, "timestamp_updated": 1510648011, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.478261", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36331010": {"recommendationid": "36331010", "author": {"steamid": "76561198126291492", "num_games_owned": 92, "num_reviews": 9, "playtime_forever": 133, "playtime_last_two_weeks": 0, "last_played": 1513024826}, "language": "english", "review": "A pixel art first person shooter that reminds you of the classics. The gameplay is very good, fast paced and fun. It's an arcade that will play whenever you feel like shooting something.\n\nI really loved a few aspects of the game. Mainly the curse-blessing system, that's something original and cool.\n\nThe art makes the game even better.\n\nVery recommended.", "timestamp_created": 1510006186, "timestamp_updated": 1511574478, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": "3", "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "35977189": {"recommendationid": "35977189", "author": {"steamid": "76561198167711836", "num_games_owned": 125, "num_reviews": 7, "playtime_forever": 42, "playtime_last_two_weeks": 0, "last_played": 1508889524}, "language": "english", "review": "/v/ booooooooys", "timestamp_created": 1508887922, "timestamp_updated": 1508887922, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.495815", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "35976062": {"recommendationid": "35976062", "author": {"steamid": "76561198032088203", "num_games_owned": 591, "num_reviews": 95, "playtime_forever": 163, "playtime_last_two_weeks": 0, "last_played": 1508880419}, "language": "english", "review": "Still Not Dead is a very solid experience, especially factoring in the price.\n\nhttps://www.youtube.com/watch?v=OQmyXKz9JQ0\n\nPlenty of indie developers try to make retro style games. They can be less time consuming and more straight forward to create in general. The problem with many of them is that retro games often carry over the shortcomings of their era of video games.\n\nThe early first person shooter era of games like DOOM, Wolfenstein and Duke Nukem are well crafted games in terms of aesthetic and design, but most feel janky to move and control by the standards of today.\n\nThe developer of Still Not Dead wisely realizes this and created their game to make use of the aesthetic of retro titles, with the enhancements of today's industry.\n\nMovement in Still Not Dead is smooth and responsive, there are no slow downs and the game feels frantic. You move quickly but enemies do as well. The jumping mechanic adds a bit of extra layer of strategy to come encounters if you are able to hop over a fence/low wall.\n\nThe combat is very well crafted. You start with a decent pistol but can also purchase more weapons during the levels. Each weapon packs a ton of punch and is used differently enough that you need to change up your strategies a bit when you get something new. There is also a melee system that has a lot of weight behind it. While limited to one button attacks, each slice and hit with your weapon is very satisfying.\n\nThere is a variety of enemies in the game both melee and ranged focused. Each looks completely different and has it's own attack pattern. Ranged enemies will have different types of attacks and patterns to deal with, while melee enemies, despite all doing close up damage, will also attack in specific ways instead of all of them simply running towards you.\n\nThe levels feature an upgrade/debuff system. Each time you clear a section, you are granted either a bonus or curse, alternating between levels. Most of these are more than just stat buffs with some fundamentally changing how you will have to play the game during that run. Things like less line-of-sight, exploding bullets, randomized weapons and plenty more are welcome additions to the experience.\n\nThe game is a rogue-lite, meant to be played multiple times. The maps are procedurally generated but usually get laid out pretty well. There are certain times where it looked like I could fit through an opening but it ended up being too small. Other than that, no major problems with the levels.\n\nThis is a pretty solid experience, especially for an Early Access game. Already worth the $5.00 price-tag and I'm looking forward to what the release version will be.\n\n\nIf you found this review helpful, feel free to follow my curator page. http://steamcommunity.com/groups/iampattyjack#curation", "timestamp_created": 1508882042, "timestamp_updated": 1508882042, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.509296", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "35635361": {"recommendationid": "35635361", "author": {"steamid": "76561197970563925", "num_games_owned": 924, "num_reviews": 94, "playtime_forever": 45, "playtime_last_two_weeks": 0, "last_played": 1507719052}, "language": "english", "review": "PRETTY PRETTY GOOD \n\nFor $5 can't go wrong.", "timestamp_created": 1507716534, "timestamp_updated": 1507716534, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.645341", "comment_count": "2", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "35620484": {"recommendationid": "35620484", "author": {"steamid": "76561198290515210", "num_games_owned": 34, "num_reviews": 2, "playtime_forever": 1743, "playtime_last_two_weeks": 1, "last_played": 1515532036}, "language": "english", "review": "Really fun game.  No Brainer for old school Doom fanatics.  Active Developer who communicates with community well.  Potential for alot of really cool game features etc. considering the accessibility of the engine.  Good soundtrack.  The Gameplay is good,  Definitely has the framework for a great indie game and is really entertaining in its current state.  The game is borderlining on a Masterpiece when you consider the engine used and the amount of entertainment and replayabillity from a $5 dollar game i reaaly hope the Dev continues to put good updates out.  Also if you like the game spread the word indie developers arent exactly on the tv or steams front page for that matter.  Really impressed by the game and it runs on unity which i usually hate but hey he made it work.  Props!", "timestamp_created": 1507651187, "timestamp_updated": 1507836621, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.549763", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35299203": {"recommendationid": "35299203", "author": {"steamid": "76561198170185075", "num_games_owned": 98, "num_reviews": 2, "playtime_forever": 285, "playtime_last_two_weeks": 0, "last_played": 1508715176}, "language": "english", "review": "Overall good game that's well worth the price and shows lots of potential. I look forward to seeing how it develops.", "timestamp_created": 1506696844, "timestamp_updated": 1506696844, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35208326": {"recommendationid": "35208326", "author": {"steamid": "76561198034232304", "num_games_owned": 344, "num_reviews": 3, "playtime_forever": 1008, "playtime_last_two_weeks": 272, "last_played": 1516218488}, "language": "english", "review": "This early access game is already in a very solid state thanks to the tried and true gameplay of older shooters like the original Doom, as well as a conscientious and compelling game design. \n\nThe controls can feel awkward at first, for instance with the recoil physics and the lack of vertical aiming, but these constraints quickly start to feel natural and end up complimenting the franctic arcady gunplay and enemy design.\n\nA real old-shcool adrenaline inducer, complete with an amazing soundtrack.", "timestamp_created": 1506364628, "timestamp_updated": 1506403983, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34860170": {"recommendationid": "34860170", "author": {"steamid": "76561198081788609", "num_games_owned": 71, "num_reviews": 3, "playtime_forever": 622, "playtime_last_two_weeks": 0, "last_played": 1511779090}, "language": "english", "review": "Another Jim Sterling fanatic here. After seeing him to play this game I finally decided to give it a go and I must say that it was well worth it.\n\nThe player is thrown into Doom-like environment where they must search for food, gold, weapons, items and ammo while fighting against hordes of monsters. Not only that but you only have about two minutes before [strike]Error Sans[/strike] Death starts chasing you. The exits won't open until you've killed a set amount of enemies so you'll better plan your actions accordingly... or rely on a huge amount of dumb luck to not end up dead.\n\nThe unique mechanic of the game is a blessing/curse system. At the beginning of each stage you'll get to choose one blessing (or curse) to either aid your battle or hinder it. You can also risk it by rerolling the blessings/curses (at the cost of losing health) or letting the game choose one for you instead. This not only makes the game more challenging but also gives the game plenty of replay value. The blessings/curses can dramatically change the way you play the game so you won't be having identical playthroughs anytime soon.\n\nFinding different ways to play the game is fun but the game still has some issues. Some weapons are clearly better than the others (I'm looking at you, Hell's Hand) which means depending on the weapons you find you either blaze through the levels with ease or struggle to finish the first stages of your run.\n\nSome blessings/curses can really screw you over without you even noticing. For example, there's a curse that halves the speed of your bullets but it also halves the range of your crossbow. There's a blessing that makes the explosions three times bigger but it also makes kamikaze zombies more likely to hurt you. Learning the pros/cons of each trait will help you plan your runs better, but I still feel like luck plays a huge role in whether you'll succeed or not. (This also applies to finding the right weapons in the stages.)\n\nThere are also some minor bugs left in the game. There was a time when I ran through an exit that was floating above the ground and I had to time my 3x higher jump to get through it. Once I was smacked by a spike ball before I even got placed on a level and had any time to react. Sometimes it's also hard to tell whether there are enemies chasing you but that mainly happens with the zombies who possess little threat and are easy to dispose. The enemies/levels also lack some variety but the developer has promised that more will be coming soon.\n\nOverall, while I have some nitpicks with the game it's still a blast to play. The soundtrack is great and gets you pumped, the game runs without issues (apart from Steam notifications glitching out at times) and seeing the world turn dark when Death appears really fills you with dread. Yes, the game is still in early access but unlike the most \"early access games\" this one actually feels almoust complete. And unlike the most \"early access game \"developers\"\" this one seems to genuinely care about the game and interacting with people without trying to sue the crap out of them. That if anything makes this game stand out from the rest.\n\nI paid 5€ for this game and I felt like I got my money's worth during my first run. I'm truly looking forward to seeing what the complete product will be like. Until then, I'm grabbing whatever gun I can find and go running at demon hordes pretending to be on the quest to avenge my pet rabbit.\n\nGo buy this game. You won't regret it.", "timestamp_created": 1505044851, "timestamp_updated": 1505044851, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.559216", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34706608": {"recommendationid": "34706608", "author": {"steamid": "76561197966527290", "num_games_owned": 2727, "num_reviews": 388, "playtime_forever": 99, "playtime_last_two_weeks": 0, "last_played": 1504140874}, "language": "french", "review": "\"Dans le genre “petit jeu sympathique qu’on oubliera aussi vite qu’on y a joué”, Still not Dead mérite d’être dans le haut du panier. Parce que cette histoire de joueur perdu au milieu de nulle part, dans un monde plein de pixels grossier ou des zombies l’attaque, ne vole pas très haut. Pour se défendre, il y a son arme principale : on shoot de l’ennemi sans pouvoir viser à la souris. Celle-ci ne sert qu’à aller vers la gauche et la droite, à l’ancienne. Une fois un nombre certain d’ennemis tué, il faut se rendre à la sortie avant que la nuit ne tombe et qu’un étrange fantôme vienne nous dévorer.\n\nChaque niveau est alors l’occasion de choisir un malus ou un bonus parmi trois tirés au hazard. Il faut avouer que ces perks sont assez amusantes la plupart du temps, vous forçant à jouer avec des armes aléatoires ou sans aucune arme à distance par exemple. Globalement, Still not Dead est un jeu clairement amusant un petit temps et pour lequel il est difficile de ressentir sincèrement du dégoût ou de l’ennui. Il est juste ultra quelconque et vite répétitif, très amateur et facilement oubliable. Encore en Early Access, le jeu risqué tout de même de ne pas être furieusement plus motivant à la sortie. On se contentera du peu qu’il propose actuellement.\"\n\nD'autres critiques : http://www.gamesidestory.com/2017/08/31/rapides-critiques-aout-2017/", "timestamp_created": 1504429841, "timestamp_updated": 1504429841, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.543568", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "34703112": {"recommendationid": "34703112", "author": {"steamid": "76561198146391412", "num_games_owned": 54, "num_reviews": 8, "playtime_forever": 213, "playtime_last_two_weeks": 0, "last_played": 1504539644}, "language": "english", "review": "tbh this is a masterpiece. you MUST PLAY THIS.", "timestamp_created": 1504416514, "timestamp_updated": 1504416514, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "2", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "34675003": {"recommendationid": "34675003", "author": {"steamid": "76561198093451378", "num_games_owned": 104, "num_reviews": 27, "playtime_forever": 190, "playtime_last_two_weeks": 0, "last_played": 1510795036}, "language": "english", "review": "For a $5 game, I was pleasantly surprised. This game is an interesting idea which, while a bit lackluster at the moment, is great because it explores a mechanic that it seems most other games in the indie genre have simply placed onto their games as more of a gentle push to the objective rather than a threat. That mechanic is the \"time limit mechanic\". To put it simply, after a certain increment of time (short enough that you'd be able to put a suit on provided that you don't have to redo anything, but that's about as long as it gets [actually probably around 3 minutes from a guess]), \"death\" appears, who is a large black skull that will chase you at a speed that the player can barely outrun, and because death does a lot of damage, you know that it's time to haul ass when you see the sky go red. However, you can't just sprint to the nearest exit: you need to kill a set number of enemies before that can happen! So off you go, pumping lead into zombies and floaty skulls and whatnot. That about does it for the core focus of the game. To aid you in your quest to do the aforementioned, you can buy guns using currency which can drop from enemies or is on the ground in large heaps. Usually ammo for guns is limited, so you're going to need to buy ammo as well, meaning you need to keep juggling your priorities. Regardless, if both of these options are unavailable and you've run out of shot, you have a melee attack (and using a certain blessing, can regenerate ammo for your gun). Now, blessings and curses. After each area, you are either given the option of choosing a blessing or a curse in a 1 0 1 0 1 pattern. Blessings, as the name would suggest, aid your quest. Curses disrupt it. I think that's good on a summary. Let's talk pros and cons:\n\n Pros:\n+Shooting is fun.\n+The death mechanic really lays down the heat and forces the player to act fast.\n+Blessings and curses usually (more on it) distinctly help your game or negatively impact them. They're not just pointless descriptions that seem to have a sort of \"Oh shit what else can I put here\" vibe to them either, they all have a genuine and noticeable impact on the game. Examples: There is a blessing which increases your jump height by 3 times, allowing the player to vault most obstacles. There is a curse which fogs your vision and decreases your view distance, making it difficult to judge the number of enemies surrounding you.\n+Visuals are nice.\n+Music does a splendid job of conveying this sort of stressed out vibe as well as being action packed (I would definitely buy this OST).\n+Environment plays a good role in the game and makes shooting more enjoyable.\n\nCons:\n-Enemy variety is nil. There are only 6 at the moment (but the developer is planning to add more, so be patient).\n-The reference to \"usually\" when talking about the blessing/curse system. It would seem that certain blessings or curses, while they still have a distinct impact on the game, find themselves on the edge of the coin, not on either side. Examples: There is a blessing which makes explosions larger, including ones made by these kamikaze enemies which will hurt you.\nThere is also a curse which remixes your loadout each level, and while my good weapons might have suddenly been replaced with something that has limited ammo and the effectiveness of an electric toothbrush, I have occasionally spawned in with the better weapons in the game while full on ammo.\n-Enemies can be a little retarded. Zombies can be outrun while walking at a snail's pace and they won't hit you, as well as not being able to hit you if you hop onto a fence (I suggest the dev make the zombies move a tad bit faster or have longer reach, as well as being able to slowly vault over or onto a fence that you're standing on).\n-The need to juggle ammo and the need for new weapons is challenging, but ammo is usually more demanding, making the player put all their currency into ammo and never really seeing much of the other guns. This can be remedied by a blessing which makes melee kills give ammo, but it's still a starter-revolver-fest. This could be remedied if on each level there was one free gun.\n-This is a niche complaint, but the font is a bit tacky.\n\nAll in all, it's a good experience, especially for $5 bucks. The gunplay is satisfying and the experience requires that the player be on their toes. I wasn't really expecting something this good from a single dev.\nWhile there are improvements to be made, the final verdict:\n\n78/100\n\nEspecially for $5, the gunplay is satisfying and the experience requires that the player be on their toes.", "timestamp_created": 1504322289, "timestamp_updated": 1504322480, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.552529", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34484457": {"recommendationid": "34484457", "author": {"steamid": "76561198036715107", "num_games_owned": 140, "num_reviews": 2, "playtime_forever": 9, "playtime_last_two_weeks": 0, "last_played": 1503677323}, "language": "english", "review": "Pretty good game even if its not my type.\n", "timestamp_created": 1503676844, "timestamp_updated": 1503676844, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.527559", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "34469226": {"recommendationid": "34469226", "author": {"steamid": "76561198007507154", "num_games_owned": 131, "num_reviews": 4, "playtime_forever": 34, "playtime_last_two_weeks": 0, "last_played": 1508794608}, "language": "english", "review": "Good fun time, challenging and varied enough to warrant coming back periodically.  A few unusual and welcome ideas, such as the alternating buffs/nerfs for each levels, and Rogue-lite elements including in-level upgrades costing loot - forcing you to make quick choices in the middle of a level, often in the midsts of a fight!\n\nFor the price it's a good fun time, filling in spare 20 minutes here and there.  Nothing remarkable, but perfectly playable and fun to do so, and different enough from similar games to warrant keeping one's library.\n\nIt's had enough updates already to give hope that more will be forthcoming to further flesh it out.  It's the only Early Access title I've so far bought and I'm therefore pleased to say it puts me in the surprising position of having a 100% success rate with EA :)\n\n(I'm also pleasantly surprised to find the in-game currency is £ - I can't remember the last time I saw a game do that, maybe not since the days of the Spectrum :) )", "timestamp_created": 1503614251, "timestamp_updated": 1503614251, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34409809": {"recommendationid": "34409809", "author": {"steamid": "76561198030934761", "num_games_owned": 120, "num_reviews": 5, "playtime_forever": 193, "playtime_last_two_weeks": 0, "last_played": 1503977908}, "language": "english", "review": "An excellent game for those looking for a serious challenge.  Definitely worth the price.", "timestamp_created": 1503384379, "timestamp_updated": 1503384379, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34255105": {"recommendationid": "34255105", "author": {"steamid": "76561198021143434", "num_games_owned": 143, "num_reviews": 1, "playtime_forever": 50, "playtime_last_two_weeks": 0, "last_played": 1501453074}, "language": "english", "review": "Game is really enjoyable, the gameplay feels smooth, I really like playing it. Dev seems pretty active and caring, which makes me feel positive about the future of the game :) Recommended :)", "timestamp_created": 1502800257, "timestamp_updated": 1502800257, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34241033": {"recommendationid": "34241033", "author": {"steamid": "76561198006802050", "num_games_owned": 179, "num_reviews": 4, "playtime_forever": 59, "playtime_last_two_weeks": 0, "last_played": 1502918184}, "language": "english", "review": "Honestly before last update the game was kinda shit, but now it's kinda cool and dare I say... fun? Needs more gore though.\nAlso, OP, you inspire me to make my own game, if you can do this, I can do this too.", "timestamp_created": 1502735758, "timestamp_updated": 1502735758, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "34164054": {"recommendationid": "34164054", "author": {"steamid": "76561198124449156", "num_games_owned": 168, "num_reviews": 42, "playtime_forever": 20, "playtime_last_two_weeks": 0, "last_played": 1502271901}, "language": "russian", "review": "Still Not Dead. Игра, которые вызвала у меня смешанные чувства. В ней очень много спорных аспектов, но все же могу сказать, что Still Not Dead имеет место быть и вполне играбельна. Давайте же поэтапно разберем данный инди-продукт\n\n1) Гемплей. Он очень прост, понятен и доступен каждому геймеру, которые желает просто расслабиться и убить время на банальные \"пострелушки\" с ордами нечисти. И это хорошо, потому что у каждого человека должна быть игра, которая позволит ему не напрягать лишние извилины и снять напряжение. Здесь я ставлю определенно +\n\n2)Сюжет. Если хорошенько прикинуть, то его, в принципе, нет: ходи, стреляй, патроны и пушки собирай, а как экран становится красным беги к ближайшему выходу и ты прошел уровень. Но с каждым уровнем сложность набирает обороты, нечисть становится сильнее и как правило играть становится посложнее, но потом ты понимаешь, что красный экран появляется со времени и поэтому нет нужды расстреливать толпы зомби, т.е. прибывание на уровне зависит не от кол-ва убитых тобою врагов, а от времени, которое ты провел на уровне. \n\n3) Скиллы. Это действительно хороший плюс. Здесь есть положительные и отрицательные скиллы. Сначала тебе дают один положительный перк, а потом отрицательный причем на твой выбор (1 из 3), создавая этаким образом своеобразный баланс. Лично мне это понравилось\n\n4) Оружие. Обидно, что его немного, а некоторое и вовсе бесполезно. Например огнемет. Лично я не нашел в нем смысла. Тут, простите, -\n\n5) Графика. Меня всегда радуют проекты в 8-битной графики со спрайтовыми рисунками. Они мне напоминают мое детство. Правда музыка, какая-то... неприятная или даже скорее неподходящая. Поэтому тут спорно\n\nПодводя итог, я хочу сказать, что данный продукт вполне играбелен. Он позволяет расслабиться и отключить на некоторое время твой перегруженный мозг. А также данную игру можно купить своему младшему братишке или сынишке и  быть уверенным, что он ничего там не накосячит в отличие от более высокоуровневых игр. Что насчет цены... Покупайте по скидке и все будет нормально", "timestamp_created": 1502441576, "timestamp_updated": 1502441722, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.563719", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "34090074": {"recommendationid": "34090074", "author": {"steamid": "76561197971128743", "num_games_owned": 160, "num_reviews": 1, "playtime_forever": 222, "playtime_last_two_weeks": 0, "last_played": 1508695727}, "language": "english", "review": "I saw Jim Sterling play this game and decided to buy it. It is a fun little game with a lot of potential. I like the weapon selection, the blessing/curse mechanic, and the soundtrack (although a little repetitive right now). The death chase in the end of each stage is also a nice idea (reminds me of Descent somehow). Looking forward to future updates and eventually the full game, which hopefully will have more content and variation. Some sort of narrative would not be bad either.", "timestamp_created": 1502141530, "timestamp_updated": 1502141530, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.497568", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34086262": {"recommendationid": "34086262", "author": {"steamid": "76561198053951901", "num_games_owned": 93, "num_reviews": 19, "playtime_forever": 142, "playtime_last_two_weeks": 0, "last_played": 1502542577}, "language": "english", "review": "Saw this game showcased on Jim Sterling's YT channel. Glad I bought it becase it's fun as hell! When it comes to the blessings and curses, there's a lot more you could do but all in all it's a great game. And it's powered by Unity. This game is one of few that really showcase the good side of Unity.", "timestamp_created": 1502127768, "timestamp_updated": 1502127768, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.497568", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33960465": {"recommendationid": "33960465", "author": {"steamid": "76561198028361135", "num_games_owned": 115, "num_reviews": 19, "playtime_forever": 605, "playtime_last_two_weeks": 0, "last_played": 1502939139}, "language": "english", "review": "This game is shaping up to be something great. Definitely one of the few Early Access games I could recommend getting. It's only 5 dollars, come on and get it.", "timestamp_created": 1501633350, "timestamp_updated": 1501633350, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.497925", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33955555": {"recommendationid": "33955555", "author": {"steamid": "76561198041458503", "num_games_owned": 194, "num_reviews": 3, "playtime_forever": 173, "playtime_last_two_weeks": 0, "last_played": 1504452844}, "language": "english", "review": "It's a fun retro fps rougelike. Awesome soundtrack & the oldschool sound effects are pretty good too.\n", "timestamp_created": 1501614627, "timestamp_updated": 1501614627, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.473984", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33940578": {"recommendationid": "33940578", "author": {"steamid": "76561198088244026", "num_games_owned": 90, "num_reviews": 3, "playtime_forever": 448, "playtime_last_two_weeks": 23, "last_played": 1516304308}, "language": "english", "review": "Really fun! Could use more content (lacking a little on blessings and curses) , but it's an awesome game to play with a podcast or something running in the background and I really  want to see more updates for this game", "timestamp_created": 1501555342, "timestamp_updated": 1501555342, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.497568", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33913977": {"recommendationid": "33913977", "author": {"steamid": "76561198001649556", "num_games_owned": 178, "num_reviews": 23, "playtime_forever": 90, "playtime_last_two_weeks": 0, "last_played": 1507164060}, "language": "english", "review": "Still Not Dead is a kind of arena-ish Doom throwback that plops you in the middle of procedurally generated maps full of assorted baddies that want to kill you. Your task: kill them, take their loot, eat their vegetables, buy bullets and better weapons, and make for the exit before Death arrives to offer you a sample of this new cookie recipe he's been working on. Between levels you receive either a blessing (a small buff or helpful effect) or curse (a small nerf or harmful effect) alternately. It's a cool system, though I mostly find myself letting the game select at random in exchange for extra cash. Once I can manage to survive longer than 2 or 3 levels this will probably amount to something, right now they represent fairly minor tweaks.\n\nMovement is smooth and desperately fast, allowing use of environment to evade the hordes. Learn to love your jumpable walls, and the precise timing to mash 'E' so you can buy ammo without breaking stride. There's a primitive \"radar\" map in the lower corner to help orient yourself and lead you to objectives, which you'll need because otherwise there's not a whole lot of detail to steer by. \n\nGraphics consist of these funky, retro sprites (or at least they're styled as such). Enemy and item designs aren't hugely detailed, but they are very distinct and read well from a distance. My personal favorite's the giant spiders with inverted crosses. In-game sound is bare-bones but excellent—enemies have their own audio cues to let you know when something's gnawing on your junk, and the soundtrack captures both the era this game's referencing and the frantic nature of play.\n\nNot sure if this can realistically be called roguelite—so far I've seen no inkling of progression from one run to the next, which is something I'd expect from the genre. Rest of the elements are there though—permadeath, map randomization, etc. Maybe progression's coming, this is early access after all.\n\nSo yeah. 5 bucks for a nice little panic-inducing manic FPS. Count me in. Looking forward to see what this guy does with it.", "timestamp_created": 1501448557, "timestamp_updated": 1501448557, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.559357", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33907746": {"recommendationid": "33907746", "author": {"steamid": "76561198017382078", "num_games_owned": 644, "num_reviews": 73, "playtime_forever": 14, "playtime_last_two_weeks": 0, "last_played": 1502836092}, "language": "english", "review": "saw this on jim sterling's page, had to buy it.\n\ndeveloper cares about the game, as you can see in the comments.\n\ngame is pretty fun, pretty hard, though. i find myself dying before i can really get into it properly.\n\npretty fast-paced. lots of action. always modifying gameplay to give you a challenge.", "timestamp_created": 1501429616, "timestamp_updated": 1502885625, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.521383", "comment_count": "9", "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "33906902": {"recommendationid": "33906902", "author": {"steamid": "76561198026433202", "num_games_owned": 357, "num_reviews": 8, "playtime_forever": 23, "playtime_last_two_weeks": 0, "last_played": 1501480667}, "language": "english", "review": "Game is quite fun in short bursts. absolutely love the soundtrack", "timestamp_created": 1501427281, "timestamp_updated": 1501427281, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.497568", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33900822": {"recommendationid": "33900822", "author": {"steamid": "76561198165498311", "num_games_owned": 267, "num_reviews": 3, "playtime_forever": 229, "playtime_last_two_weeks": 0, "last_played": 1503466695}, "language": "english", "review": "Killing Floor + Rise of the Triad = this", "timestamp_created": 1501407608, "timestamp_updated": 1501407608, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.443929", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33896034": {"recommendationid": "33896034", "author": {"steamid": "76561198088462852", "num_games_owned": 33, "num_reviews": 5, "playtime_forever": 871, "playtime_last_two_weeks": 0, "last_played": 1513885042}, "language": "english", "review": "This is a really fun game for just 5$. it seems like a mix between wolfenstein3D and an arcade game. its already really cool but itd be really nice to see where it goes.\n\nAfter playing the game further, i am now able to get to stage 59 quite easilly but that takes several hours to do and it would be nice to be able to fight the big demon skull as the final boss. for the last hour of my session i was kinda just running around bored. it'd be really cool if at level 40 a super weapon appeared that let you hit the demon skull things. I think this game is very promissing and could expand well.\n\noh or maybe after a certain level, a portal opens up that leads to somewhere that a plot could be told.\n\ni'll try to update this review as the game updates.", "timestamp_created": 1501385866, "timestamp_updated": 1501614261, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.497568", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33697832": {"recommendationid": "33697832", "author": {"steamid": "76561198118588144", "num_games_owned": 65, "num_reviews": 1, "playtime_forever": 52, "playtime_last_two_weeks": 0, "last_played": 1498839208}, "language": "english", "review": "good shit", "timestamp_created": 1500647360, "timestamp_updated": 1500647360, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.464286", "comment_count": "2", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "33685049": {"recommendationid": "33685049", "author": {"steamid": "76561197989740624", "num_games_owned": 56, "num_reviews": 1, "playtime_forever": 959, "playtime_last_two_weeks": 26, "last_played": 1515838260}, "language": "english", "review": "Sweet game which i'm synthesizing the soundtrack for! The game is currently in quite early stage of development, but it is gettin' cool as fukk with each fresh update that partly is based on feedback by the community.\n\nGrab this one and bob your head to some electric madness as you kill your way through hells spawn and run from Death!", "timestamp_created": 1500597252, "timestamp_updated": 1500597252, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.577753", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "33618664": {"recommendationid": "33618664", "author": {"steamid": "76561197980921130", "num_games_owned": 1102, "num_reviews": 8, "playtime_forever": 70, "playtime_last_two_weeks": 0, "last_played": 1500285513}, "language": "english", "review": "It's got the ground work to be a good game, but the problem is the unlockables are pretty lacking and it gets pretty boring after about an hour or so.    Also, it's not really stated in the description at all but the aimming is old school doom-like.  As in, you can only look left and right.\n\nCurrrently, from what I can tell.  The game's weapons are locked to levels.   Meaning, after hitting floor/level 4 or 5 you finally start to see an ak47, while on level 1 or 2 all you pretty much see for weapons is your starting revolver, a crossbow, an uzi, and maybe a shotgun if you're really lucky.\n\nAlso, the blessings and curses system need some tweaking.  Each level you start of with ether a blessing or a curse(they alternate each level, first level at the start is always a blessing). Reason being it seems like the best way to play it is get the runner gunner and the infinite ammo when your under 20hp blessings and just mow everything down with ether an uzi or an ak47 and pretty much become a glass cannon.\n\nThe weapons need some tweaking too, as the rifle does doesn't seem useful at all since the pacing of the game means you need to haul ass and run since death comes for you after a little while each level.  And the rifle seems to be ment for picking off targets long range.  This seems good in theory, but in use it's worthless since when you get spotted by an enemy they move and the bullet speed is a factor.  (Low rate of fire + slow base bullet speed= why pick it?)\n\nThe basics are here, but it needs quite a bit of tweeking.   If this was $1.99 I could recommend this game since it's in early access and will most likely be changing.  but for almost $5 usd (it was $4.77 for me after taxes), I can not recommend this game when so many older games give a lot more content for almost the same ammount of money.  Being as this is a 2d pixel game, graphics are not an issue here, it's the game play that is.\n\nAlso, I have refunded this game.  Mainly due to the lack of the description in the shop text of how the aimming works and I did not enjoy it in it's current form.\n\nIf I could make one suggestion to the dev(s), that would be have the crystals be able to change into ANY weapon/item instead of what just can appear on that level since you only get so many of them a run unless you take a blessing to get 25 more.   Even then, there is no telling what you'll get.  It could be something from that level or something 5 levels ahead making that choice to use it now or save it for later all the more tempting, because right now, it's not worth fighting you're way over to a weapon on the earilyer levels if you already know what can drop on each level after around 10-20 runs of the game.  This would be an easy change that would massively improve the game.  Also, if it's a weapon, change it only to a weapon instead of an item or a weapon.\n\nTL;DR = hold off on buying it, wait for release to see if it improves.  It has the base down, but needs some tweeking to really shine.", "timestamp_created": 1500334646, "timestamp_updated": 1500334646, "voted_up": false, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.469182", "comment_count": "8", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33575565": {"recommendationid": "33575565", "author": {"steamid": "76561198070930881", "num_games_owned": 520, "num_reviews": 93, "playtime_forever": 84, "playtime_last_two_weeks": 0, "last_played": 1510234151}, "language": "russian", "review": "А вот это неплохо.\n\nТакой знаете очень думоподобный шутан, в меру сложный и атмосферный, плюс еще и с генерацией уровней.\nИ ко всему прочему еще и не коридорный.\n\nЦену свою оправдывает уже на этой стадии, хоть еще и сыровато.\n\nА что тут еще скажешь?\n\nА ну разрушаемость еще есть, много видов оружия, перков и бонусов.\n\nИгра на любителя и ценителя, зайдет не всем.\n\nЛично мне понравилось.\n\nЕдинственный и большой минус.\n\n- Хотелось бы побольше настроек разных в опциях, ну и лого юнити можно убрать со стартапа\n\nА так весьма даже не дурно для малобюджетного проекта.", "timestamp_created": 1500174896, "timestamp_updated": 1500174896, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504480", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33528137": {"recommendationid": "33528137", "author": {"steamid": "76561198134086602", "num_games_owned": 410, "num_reviews": 95, "playtime_forever": 51, "playtime_last_two_weeks": 0, "last_played": 1513402187}, "language": "spanish", "review": "Seguimos con las mil muertes por video! \"Still Not Dead\" es un shooter en primera persona con niveles aleatorios (roguelike), donde los enemigos serán cada vez más difíciles, y donde tendremos que ir recolectando ítems, mejores armas, munición y salud, pero ojo! luego de un tiempo aparece un bicho que nos empieza a perseguir por el nivel y tendremos que apurarnos para encontrar una salida y así pasar al próximo mapa, tratando de que no nos toque para no morir en el intento! Además, entre cada nivel iremos eligiendo bendiciones y maldiciones que afectarán en gran manera nuestro estilo de juego, para bien o para mal!\n\nhttps://www.youtube.com/watch?v=Ey4m4-RCsMw", "timestamp_created": 1500006292, "timestamp_updated": 1500006292, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "33527749": {"recommendationid": "33527749", "author": {"steamid": "76561198123418498", "num_games_owned": 43, "num_reviews": 14, "playtime_forever": 37, "playtime_last_two_weeks": 0, "last_played": 1500042634}, "language": "spanish", "review": "UN GRAN JUEGO RPG SHOOTER PRIMERA PERSONA! TIENE SU ESTILO PIXELADO QUE PARA MI ME GUSTA MUCHO! JUGABILIDAD MUY BUENA, CONTROLES NORMALES Y A MI NO ME CAUSO NINGUN PROBLEMA SIN BUGS O ALGO POR EL ESTILO JAJA MUY ESTILO DOOM PERO TIENE SU ORIGINALIDAD! PASAS UN BUEN RATO CON DIVERSION Y MUCHA TENSION PORQUE CADA VEZ SE PONE MAS DIFICIL! Y SIEMPRE TRATARAS DE SUPERAR TU PUNTUACION FINAL!! UN GRAN JUEGO QUE VALE LA PENA PARA ENTRETENERSE PERO ESTARIA BIEN QUE PUSIERAN MULTIJUGADRO JAJA :D\n\nY SI TODAVIA NO TE CONVENZE TE DEJO UN GAMEPLAY QUE YO HICE DE PRIMERAS IMPRESIONES DE ESTE JUEGO Y ME LA PASE MUY BIEN! JAJA ESPERO LES GUSTE Y PERDONEN EL AUDIO! ABAJO LES DEJO EL ZELDA ;)\n\nhttps://youtu.be/WHKeZlu2TjI", "timestamp_created": 1500004569, "timestamp_updated": 1500004569, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33490795": {"recommendationid": "33490795", "author": {"steamid": "76561198163111091", "num_games_owned": 102, "num_reviews": 4, "playtime_forever": 1380, "playtime_last_two_weeks": 9, "last_played": 1516088085}, "language": "english", "review": "What a fun little game. Love the art style. The music also gives the game a sense of urgency which i think is great.\nLookin forward to the future deveolpment of the game.", "timestamp_created": 1499900182, "timestamp_updated": 1499900182, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.549832", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33489478": {"recommendationid": "33489478", "author": {"steamid": "76561198017246524", "num_games_owned": 883, "num_reviews": 55, "playtime_forever": 241, "playtime_last_two_weeks": 0, "last_played": 1499831768}, "language": "english", "review": "A Solid FPS Action Roguelike. Lots of stuff trying to nibble you. Lots of different item paths to take. Plenty of clear choices of items and equipment to investigate on each level. I rather enjoyed this one. Especially when so many Roguelikes lately have been the standard Top-Down Affair. \n\nThat said it might be nice if in the future the terrain changed a bit more from level to level. Somewhat like the enemies. New little components pop up every time you head to the next level. \n\nhttps://youtu.be/zpDOlmDMcL8", "timestamp_created": 1499895455, "timestamp_updated": 1499895455, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.497568", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "33487765": {"recommendationid": "33487765", "author": {"steamid": "76561198019388720", "num_games_owned": 467, "num_reviews": 68, "playtime_forever": 69, "playtime_last_two_weeks": 0, "last_played": 1509025484}, "language": "english", "review": "This game is looking like it's on the right path towards being something cool.\n\nAs it is now I like the gameplay, it's very fun. The music is absolutely amazing and the art style is fantastic retro inspired awesomeness. \n\nThe game is obviously not finished yet but what is here is fun to play. I wish there was a bit more here, and I assume in time it will come. I'd like to see a bit more enemy variety and more weapons or environments / stuctures.\n\nI didn't notice any leaderboards but that would be nice if there was some sort of score system and you could compete with others for high score, or some other sort of thing that would add even more replayability to the game.\n\nSo far though it seems very promising. Good stuff!\n\nFirst Impressions / Gameplay Video\nhttps://www.youtube.com/watch?v=1JAhuBZ0xB0\n[b][url=store.steampowered.com/curator/18710490/] --> Follow My Steam Curator Here <--[/url][/b]\n\n- Skid Row Trash", "timestamp_created": 1499890081, "timestamp_updated": 1516513549, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.637434", "comment_count": "2", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "33464391": {"recommendationid": "33464391", "author": {"steamid": "76561198163061412", "num_games_owned": 207, "num_reviews": 29, "playtime_forever": 842, "playtime_last_two_weeks": 0, "last_played": 1502747784}, "language": "english", "review": "Lots of weapons to have fun with. If you loved Heavy Bullets and STRAFE, I think you'll love it. You'll need to strategize your path, manage your ressources, live with the curses and git gud. 24hrs after release, it is obvious that the dev love his project, is active and will make it only better! Careful though: There is no vertical aim and will NEVER BE (Don't you ever dare to ask the dev hahaha) But, as he says... the game is built around this idea.", "timestamp_created": 1499804019, "timestamp_updated": 1499804608, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.578947", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33442824": {"recommendationid": "33442824", "author": {"steamid": "76561198008768479", "num_games_owned": 445, "num_reviews": 180, "playtime_forever": 21, "playtime_last_two_weeks": 0, "last_played": 1499724217}, "language": "english", "review": "It is a good game to spend the time with, and remember us the old school fps games. Good times...\nCheck out my gameplay and join my Indie Army! \n\nhttps://youtu.be/rPXxTDH_bJc", "timestamp_created": 1499727408, "timestamp_updated": 1499727408, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.399494", "comment_count": "2", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "33435526": {"recommendationid": "33435526", "author": {"steamid": "76561198022064106", "num_games_owned": 219, "num_reviews": 51, "playtime_forever": 33, "playtime_last_two_weeks": 0, "last_played": 1499694642}, "language": "english", "review": "https://youtu.be/5UhTkQ75fNE\nNice game of classic appearance, in which we can find a great variety of monsters and zombies, besides many complements (weapons, potions and abilities) for our character, that will make things much easier. A fantastic game, in which we will spend hours of fun.", "timestamp_created": 1499705666, "timestamp_updated": 1499705666, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.469954", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "33434233": {"recommendationid": "33434233", "author": {"steamid": "76561198321872753", "num_games_owned": 61, "num_reviews": 7, "playtime_forever": 27, "playtime_last_two_weeks": 0, "last_played": 1499702983}, "language": "english", "review": "Gameplay is pretty good my only complaint is the spawn locations can be a little broken (A weapon spawning inside a structure) Also i had 30 bullets for my pistol and the next round i had none and im sure it wasnt because of a curse.", "timestamp_created": 1499702176, "timestamp_updated": 1499702176, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.548840", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "39607552": {"recommendationid": "39607552", "author": {"steamid": "76561198016096893", "num_games_owned": 7117, "num_reviews": 1115, "playtime_forever": 76, "playtime_last_two_weeks": 76, "last_played": 1516828140}, "language": "russian", "review": "FPS, в котором придется убегать от самой Смерти!\nВ этой игре вы найдете монстров из DOOM, разрушаемые блоки, как в «Minecraft» и геймплей, напоминающий «NUCLEAR THRONE».\nИгра проходится в 6 этапов. Это арены, на которых будем забивать монстров и бегать от Смерти. Пред началом каждого этапа нам дают выбрать благословение или проклятье. Это несколько умений. Одно из них нам придется взять. Затем загружается карта, и мы идем грохать различных монстров до тех пор, пока не разблокируются проходы на следующий уровень или не появится Смерть. Когда появится Смерть, вы увидите огромного монстра в виде черепа, которого нельзя убить. От него можно только убегать, а лучше сразу бежать к выходу на следующий этап, разумеется, если вы успели его открыть.\n«Still Not Dead» порадовал хорошим выбором оружия, разрушаемым миром (можно ломать любые стены), сменой погоды и интересной системой с выбором благословений/проклятий.\nРекомендую всем любителям пострелять в монстров, а не только фанатам DOOM и пиксельного арта.\n", "timestamp_created": 1516892586, "timestamp_updated": 1516892586, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "39607321": {"recommendationid": "39607321", "author": {"steamid": "76561198272374716", "num_games_owned": 7099, "num_reviews": 900, "playtime_forever": 161, "playtime_last_two_weeks": 161, "last_played": 1516888790}, "language": "russian", "review": "[h1]«Still Not Dead»[/h1]\nАркадный шутер от первого лица под олдскул.\nИгра состоит из шести случайно генерируемых уровней, на которых надо разблокировать выходы и успеть до них добежать, пока до вас не добралась смерть!\nГеймплей:\nhttps://www.youtube.com/watch?v=QPlXMNG_IZ8&t=3s\n\nВыходы напоминают туалетные будки, только красного цвета и с замками. Чтобы их открыть, надо убить определенное количество врагов. При этом придется пошевеливаться. Через некоторое время на уровне появляется смерть - огромный черепок, который нельзя убить. Он запросто вас сожрет, как только догонит. Выходы, боеприпасы, оружие, аптечки и смерть можно видеть на мини карте. Стараемся смыться с уровня до того, как смерть к вам подвалит. От черепка можно немного побегать, но как только ваш персонаж выдохнется (закончится stamina), смерть мгновенно его догонит.\n\nМежду этапами нам дают выбрать влияющий на игру бонус из несколько случайных перков (благословения или проклятия). Кроме этого на подобранные деньги можно купить новое оружие, но для этого нужно найти его на карте, подойти и отстегнуть заработанных бабок.\n\nГрафикой и построением уровней игра напоминает «Minecraft», а врагами «Doom». Идея совместить трехмерное окружение со спрайтами не нова, но тут это реализовали очень достойно. При этом окружение разрушаемое! Вы можете разломать любую стену. Правда в этом нет практической пользы, но прикольно. Хотя это позволяет разрушать блоки, за которыми прячутся монстры или разломать стену, если лень ее оббегать.\n\n[code]Динамичная, увлекательная пострелушка с простым и легким геймплеем. Сложность может вызвать только получение всех достижений (они для зaдрoтoв). После прохождения всех 6 этапов, разблокируются «skill skulls /умения черепков», усложняющие игру.[/code]\n\n[u] Вы можете почитать другие отзывы и подписаться на наших кураторов. Добро пожаловать! [/u] \n[url=http://store.steampowered.com/curator/25737869/] 5 minutes of game [/url]", "timestamp_created": 1516891889, "timestamp_updated": 1516891889, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.576108", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "39600274": {"recommendationid": "39600274", "author": {"steamid": "76561198037796318", "num_games_owned": 7804, "num_reviews": 614, "playtime_forever": 313, "playtime_last_two_weeks": 0, "last_played": 1506497840}, "language": "russian", "review": "Still Not Dead - смесь майнкрафта, квейк или дум, кому как угодно и платформера. От платформера тут мало, но чувствуется на протяжении игры то что некоторые фичи были взять именно из старых и злых игр, геймплей прост и заключаться в прохождении коротких дистанциях с полным хаусом и кубическим ферст блэд. Игра подойдет для любителей всего кубического и разрушаемого, ибо тут есть чем заняться на потеху вашему фетишу.", "timestamp_created": 1516869446, "timestamp_updated": 1516869446, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.593351", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39561902": {"recommendationid": "39561902", "author": {"steamid": "76561197982504799", "num_games_owned": 1828, "num_reviews": 642, "playtime_forever": 448, "playtime_last_two_weeks": 448, "last_played": 1516680942}, "language": "russian", "review": "Все еще не [strike]Дед[/strike] Сдох - занятный, но несколько монотонный аренный шутер.\n\n[u]Внимание: данный обзор пишется, пока игра в раннем доступе, и все описанное актуально на дату публикации.[/u]\n\n[h1]О игре.[/h1]\nВ аннотации указано, что игра является смесью рогалика и Дума. На мой взгляд от Дума тут только злые летающие черепа, а от рогалика возможность находить на арене оружие и прочие причиндалы и покупать их для использования. Стоит добавить что разрушаемость на уровне несколько напоминает Майнкрафт, ибо стены ловко разваливаются на блоки (жаль их нельзя использовать), плюс графика ближе имхо к Майнкрафту чем к Думу.\n\n[h1]О геймплее.[/h1]\nГеймплей выглядит следующим образом - у нас есть 6 забегов, в промежутках между которыми мы можем выбрать 1 проклятие или благословение (итого 6 штук в последнем забеге, по 3 каждого, из благословений самые полезные на деньги, если хотите собрать все достижения). Далее нас пускают на арену (рандомно выбранную, но их ограниченное количество), в которых надо завалить n-е количество мобов. Успели мы или нет, но рано или поздно придет здоровенный Черепок (ака Смерть), дабы показать нам где песцы ночуют. Черепка завалить нельзя, от него можно только смыться. После 6 забегов, откроются бонусные черепа усложняющие уровень (для достижений стоит брать тот, что повышает количество врагов на уровне). В целом это все. Кроме бонусных черепов ничего нового не добавляется.\n\n[h1]Плюсы.[/h1]\n[list]\n    [*]Много видов оружия.\n    [*]Достаточное количество монстров, хотя скоро их всех узнаешь.\n    [*]Поначалу довольно драйвовый геймплей.\n[/list]\n\n[h1]Чего не хватает.[/h1]\n[list]\n    [*]Нет таблицы рейтингов, а они здесь были бы очень кстати.\n    [*]Нет мультиплеера. Или хотя бы локального мультиплеера. Было бы забавно побегать с другом, кто настругает мобов раньше.\n    [*]Нет кастомизации, и это печально. Ибо будь она доступна, геймплей можно было бы больше разнообразить.\n    [*]Встроенный редактор карт и\\или мобов тоже был бы к месту. Тогда бы и игра была ближе к Думу.\n    [*]Прокачка бы тоже не помешала, хотя...\n[/list]\n\n[h1]Как итог.[/h1]\nВ целом получился неплохой аренный шутер, за которым можно скоротать пару вечеров. Минус в основном в монотонности, и в достижениях для задрoтов, ибо собирать их, боль. Ничего особо шедеврального, но довольно неплохо.\n6 черепов из 10\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=1126176713\n\n[i]P.s: если этот обзор был для Вас полезен ставьте лайк, а также добавляйтесь в друзья и подписывайтесь на меня как куратора - [url=http://store.steampowered.com/curator/28776273/] Обзоры онлайн [/url][/i]", "timestamp_created": 1516728690, "timestamp_updated": 1516731743, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.640903", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 50, "total_negative": 1, "total_reviews": 51}}
