{"reviews": {"39013502": {"recommendationid": "39013502", "author": {"steamid": "76561198233944892", "num_games_owned": 341, "num_reviews": 41, "playtime_forever": 1914, "playtime_last_two_weeks": 203, "last_played": 1515841116}, "language": "english", "review": "Well, there are a lot of games on steam that make promises like \"inspired by games like Chrono Trigger or Final Fantasy VI\". These games lie, they are often just generic, boring and devoid of all effort. \n\nBut not EInlanzer!\n\nThis game really lives up to those expectations. It is equal in length and depth, and it's developer has put a lot of effort into it. Since I bought the game, there have already been two seasonal events, which is very rare for rpg-maker games, and there might be more, so they care a lot about their game. If this was realeased in the 90th, I'm sure it had been a huge success! So I definitely recommend this game to any old-school rpg fan. It's in fact one of the best rpg-maker games I ever played.", "timestamp_created": 1514991373, "timestamp_updated": 1514991373, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.589537", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38927585": {"recommendationid": "38927585", "author": {"steamid": "76561198360211901", "num_games_owned": 12, "num_reviews": 2, "playtime_forever": 1073, "playtime_last_two_weeks": 0, "last_played": 1514902968}, "language": "english", "review": "how to find silver the hound owner? i kind'a missing the dialogue", "timestamp_created": 1514792483, "timestamp_updated": 1514792483, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38695314": {"recommendationid": "38695314", "author": {"steamid": "76561198111533249", "num_games_owned": 60, "num_reviews": 1, "playtime_forever": 2710, "playtime_last_two_weeks": 0, "last_played": 1514456803}, "language": "english", "review": "Biggest unexpected positive surprise for me in 2017. \n\nDespite me spending quite some time with the rpgmaker myself and the overall normal vibes I'm getting from the screenshots. The story and the balancing really got me positively off guard. Kudos to the maker, good game. One of the few that got me thinking about every dungeon and boss I met.\n\nRecommendable.", "timestamp_created": 1514292283, "timestamp_updated": 1514301906, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38518363": {"recommendationid": "38518363", "author": {"steamid": "76561198051490038", "num_games_owned": 797, "num_reviews": 36, "playtime_forever": 2276, "playtime_last_two_weeks": 380, "last_played": 1515996379}, "language": "brazilian", "review": "Ainda não terminei o jogo, mas creio que pelo que eu vi até agora já posso fazer uma recomendação positiva deste grande jogo. Einlanzer é mais um jogo de grande valia dentre aqueles feitos utilizando a engine RPG Maker. Ele conta a história dos guardiões de Einlanzer, uma espada forjada pelo deus da terra e do paraíso para banir o deus dos mares que conseguiu poder suficiente para romper o equilíbrio entre os deuses e tentava dominar o mundo.  Logo no começo o personagem principal é derrotado e deixa que inimigos desconhecidos roubem a espada, envergonhado pela sua incapacidade de cumprir o seu dever ele abandona a ordem dos guardiões, passando a fazer trabalhos aqui e acolá como mercenário.\n\nO jogo possui um bom desenvolvimento dos personagens masculinos e os combates são bem balanceados. Recomendo entretanto que os jogadores não se apressem nas missões principais e tentem farmar um pouco em cada área para facilitar as coisas. Não é um jogo difícil, mas também não é fácil. Bom, o coloquei no modo normal então acho que deveria ser esse o esperado, mas creio que posso colocar isso nos pontos positivos já que muitos jogos feitos nessa plataforma pecam nesse sentido. Como ponto negativo destaco que acho que o jogo falharia no teste de Bechdel/Wallace, para aqueles que esperariam personagens femininos bem desenvolvidos, o jogo até então não fugiu ao clichê, ou seja, não cumpre o teste básico qual seja:\n\n- ter duas personagens femininas; (Ok)\n- elas conversarem entre si; (Ok)\n- elas falarem sobre alguma coisa que não seja um homem; (nein)\n\nSenti também uma forçação de barra no envolvimento amoroso entre personagens, muito em parte pelo fraco desenvolvimento dos personagens femininos.\n\nP.s.: Caso a situação sobre o desenvolvimento dos personagens femininos mude mais adiante na história modificarei esta review.", "timestamp_created": 1513922073, "timestamp_updated": 1513922073, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.646788", "comment_count": "9", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35856078": {"recommendationid": "35856078", "author": {"steamid": "76561198277586394", "num_games_owned": 7, "num_reviews": 2, "playtime_forever": 164, "playtime_last_two_weeks": 0, "last_played": 1513697480}, "language": "english", "review": "If you enjoyed  the classic Final Fantasy and Chrono Trigger games, do not miss the opportunity to play this title. It is an experience  you will definitely remember alongside all the classic RPGs.", "timestamp_created": 1508476038, "timestamp_updated": 1508552926, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35577314": {"recommendationid": "35577314", "author": {"steamid": "76561198079762363", "num_games_owned": 8, "num_reviews": 2, "playtime_forever": 466, "playtime_last_two_weeks": 55, "last_played": 1515241776}, "language": "german", "review": "Also das Spiel ist Klasse, Leider ist es noch nicht auf Deutsch.\nWenn man grad nicht weiter kommt ist es ein nachteil da es keine Hilfen gibs, mann mus solange versuchen bis man den richtigen weg findet. Würde mich jedenfals freuen wen es auf Deutsch rauskommen würde :)\n\nHandlung: Saubere leistung vom Gameplay, schöne Story für alle Final Fantasy Freunde ist das ein Super Spiel.", "timestamp_created": 1507479943, "timestamp_updated": 1507479943, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35402608": {"recommendationid": "35402608", "author": {"steamid": "76561198086087452", "num_games_owned": 722, "num_reviews": 51, "playtime_forever": 262, "playtime_last_two_weeks": 0, "last_played": 1507348687}, "language": "english", "review": "Thus far its a pretty solid rpg-maker game.  I feel like it was made by someone who got what made older jrpg games fun to play, and doesnt necessarily feel like a shoddy rpgmaker halfass cobbling together of assets to try to make some side cash off a few hours of slapping it together.\n\nStory is servicable, not nearly the worst rpgmaker story, but no FF level of writing.  Combat is good but lacks the bells and whistles graphically, which is expected.  Havent gotten too far into the game but i feel like the balance is pretty good, not overly hard but not a total pushover in combat, the quest flows nice, there are lots of things to find ect.\n\nIn a sea of shit rpgmaker games this one is one of the better by far. If you are into old school jrpg games like this but hate how most rpgmaker games are just half assed attempts put this on your wishlist buy it...\n\n", "timestamp_created": 1506911843, "timestamp_updated": 1506911843, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.570757", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35209382": {"recommendationid": "35209382", "author": {"steamid": "76561198071514637", "num_games_owned": 63, "num_reviews": 2, "playtime_forever": 2263, "playtime_last_two_weeks": 0, "last_played": 1506368462}, "language": "english", "review": "Simply one of the best rpgmaker games on Steam.", "timestamp_created": 1506368526, "timestamp_updated": 1506368526, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.459402", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35207147": {"recommendationid": "35207147", "author": {"steamid": "76561198246600384", "num_games_owned": 143, "num_reviews": 16, "playtime_forever": 951, "playtime_last_two_weeks": 0, "last_played": 1506360616}, "language": "english", "review": "This is a very good, solid RPG in the style of oldschool  final fantasy games. If you like oldschool RPGs then you owe yourself to play this. It has great writing, well designed gameplay, tons of content, and a really active and helpful dev. Don't let the fact that it was made using RPGmaker throw you off.", "timestamp_created": 1506360256, "timestamp_updated": 1506360256, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34786211": {"recommendationid": "34786211", "author": {"steamid": "76561198211952579", "num_games_owned": 33, "num_reviews": 1, "playtime_forever": 1872, "playtime_last_two_weeks": 0, "last_played": 1504754394}, "language": "english", "review": "This game was a delightful surprise. Anybody who has a background in loving older RPGs, such as the first several Final Fantasy games or games like Earthbound will find much to enjoy in Einlanzer. Since it is a very story driven RPG, which made me a fan, I will do this with hopefully zero spoilers.\n\nThe main thing that I look for in RPGs of this kind is the story and the characters, and in that way this game delivered. Just about each member of the party was individual, interesting, and carried story elements to play out later. Just about each of the several characters you can play had a good character arc, along with varied abilities that made each of them useful in specific areas. Also, the ability to customize each slightly allowed for an even more balanced party. Finn, Salome, Abel, Galadin, and Lucille in particular were great characters. \n\nLike all RPGs, a good party needs some good villains, and they were also multi-dimensional, with twists and turns in their development that were very well thought out. Also, the ability to alter the course of the action with your own decisions, shaping the game as you go along, is a really nice touch, making it more than just a hallway, or a game with little choice on how to proceed.\n\nTo be sure, you have to be down with old school sprites and turn based combat. The abilities and combat will also be very familiar to players of other RPG games of that type, especially those with familiarity with RPG maker. Some people will find the homages to other games and media either heavy handed at times or fun, depending on the player. However, if those suit you, and you are looking for a good older style RPG quest with great characters, caves, mountain tops, airships, and realms beyond, then I think Einlanzer will be worth a play through.", "timestamp_created": 1504747727, "timestamp_updated": 1504747727, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34375213": {"recommendationid": "34375213", "author": {"steamid": "76561198155883969", "num_games_owned": 118, "num_reviews": 2, "playtime_forever": 2188, "playtime_last_two_weeks": 0, "last_played": 1508613353}, "language": "english", "review": "Very good game with a nostalgic flare that I personally found wonderful. The game knows what it's trying to be and hits that mark quite nicely. The easter eggs are plentiful and the story is very reminiscent of the 8 and 16 bit eras. The one area I dislike, though it is very fitting for the era of games this pays homage to, is the combination of enemy density and horrid escape mechanic that basically means you have to fight every single battle. It's actualy annoyed me enough that it's the specific reason I'm writing this review. I had to stop playing cause I failed to run from the same group of enemies approximately 8 times where I attempted to run each round til I died. It's not that I couldn't kill the enemies I was just not wanting to fght them the first two times then it became a test and then it became stubborness and ended with alt+f4 and this review. The battles are randomish but the specific battle is queued up probably from the monent you load the screen because it will occur on the same space and with the same enemy complement for each screen load and is persistent even through saves and reloads. The one new additon that is very very welcome is the ability to save anywhere. \n\nTL:DR - This game accurately calls back to the era of 8 and 16 bit era rpgs; specifically the Final Fantasy (mostly 1-3 and some 6), Dragon Warrior/Quest (mostly 1-3) series and Lunar Silver Star Story (mostly story elements and not really any gameplay). So if you like those games, you will like this one. As far as I'm concerned that is the best endorsment I can give for the type of game this is.", "timestamp_created": 1503240328, "timestamp_updated": 1503240328, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33725050": {"recommendationid": "33725050", "author": {"steamid": "76561198094835703", "num_games_owned": 56, "num_reviews": 1, "playtime_forever": 5508, "playtime_last_two_weeks": 0, "last_played": 1500075598}, "language": "english", "review": "Edit: This is long.  Also, several criticisms have been responded to and have either been clarified (due to the way I used stat boosts or misunderstandings on my part) or inspired adjustments (see the forums!).\n\nTL;DR - One of the harder RPGs you'll play.  Great and unique plot.  Some criticisms, but development is still active.  Definitely worth a few bucks and your time if you like RPGs (especially classically styled ones with references to the greats!)\n\nI just finished this game and wanted to share my thoughts. First and foremost, I enjoyed it thoroughly. I chose to play on normal my first time through and expected to just play straight through and move on. However, it proved to be a challenging and fairly engaging game and I ultimately just did everything available.  Plot was fantastic.\n\n- Subclasses seemed... unimpactful? It was a cool little customization feature that didn't make or break any characters.\n\n- I hated and loved the RP system. I hated that I didn't realize all of the monument abilities were RP based until it was too late, so several ended up entirely unused because I thought some would be spells. I loved the uniqueness the abilities offered to each character.\n\n- Tanking is IMPOSSIBLE. First of all, the provoke ability was worthless. I'm not sure how the final chance of hitting a character is calculated, but if you have a total of 430% target chance on your team after provoke is used, the tank would go from a 30% chance of being targeted (100 / 330) to ~47% (200 / 430). That's...almost pointless. I'm making some assumptions on how targeting is determined, but it seems to line up well with my experiences with the ability.\n\n- Again, tanking is impossible. No matter how much armor I stacked, my tankier characters took more or less the same damage as say...the thief and mage. As a result, my playstyle ultimately revolved around using high damage and/or high evasion tactics.\n\n- Alice is way too strong. As long as you can survive normal fights, you can heal up with the very efficient and low cost Heal spell after fights and she literally never runs out of mana. That's aside from the use of tents. To top it off, she can be built with high defense, absurdly high magic resist, evasion, speed, whatever. As a result, she's often your tankiest character, which just seems odd.\n\n- Ratt is broken once you get the Void Bow. Ratt has 200% accuracy. The void bow lowers this to 150%. Ratt can't miss and so deals ridiculous damage once you obtain it. Combine this with his break abilities and you have a recipe for smooth sailing. This was a problem to me because...\n\n- The game swings wildly in difficulty as you go through. Status effects are so incredibly prevalent throughout the game, yet for most of it, you lack proper tools to address it. You have characters that can build heavy armor, but still can't survive because, aside from armor seeming ineffectual, nearly evey enemy has multiple hitting physical attacks of team-wide magic spells. Now, I didn't spend a single moment of the game to stop and level up, but I still found it odd that for the majority of the game, every monster was faster than even my thief. I played the game with my whole team always going last, oftentimes even with speed boots. Then you get things like Void Bow (with Ratt), arthur's crown, merlin's cap. Suddenly, you can throw two boots of speed on Salome and one shot every random encounter on the first attack, clean up any higher HP ones with Ratt (who also is insanely fast at this point), and then sustain forever with super cheap tents and her mana absord RP ability that always seems to heal her full MP. I loved that the game was challenging. It's what ultimately pulled me in more. However, it seemed to vary so wildly throughout the game.\n\n- Victor was worthless. This made me sad. He started out great with cleave, Great cleave, hard hits, stuns, etc., and progressively became less relevant as the game went on. Eventually, his tanking was subpar (for reasons stated above), his damage was incredibly outclassed by Ratt, Borm, and the thief (during the scattered stages in which stacking critical hit effective). His rage abilities were unnecessary because Lucille could buff the entire team in a more effective manner and/or Ratt could debuff the opponent more effectively in the same time it took Vic to rage up and beserk. Why bother doing it when Ratt and Borm hit as hard or harder as a raged Victor and Ratt + Lucille offered more survivability to your entire team that undying rage did to Victor alone? The only plus in all this is that Abel was still worse. I don't think I ever once found Abel useful except for a brief time when a combination of slow and Haste II made bosses laughable (this eventually had to abandoned for the more effective Lucille, Ratt, and Golem).\n\n- I had to change my accessories, builds, and team composition CONSTANTLY. Every new area. Everytime I got new equipment. Everytime certain abilities were learned. This. Is. Awesome. Regardless of why, I loved this about the game the most. I couldn't cruise through. I couldn't wear the same gear half the game. I couldn't use the same people for the same situations. I spent so much time in the menus brainstorming effiicient builds and trying new strategies. This is the reason I'm going to bother playing a second time (on hard).\n\n- The references and nostalgic touches were wonderful. :)\n\n- Aside from the final boss, who's changing elemental affinities and strengths made him interesting, most bosses were too easily tackled with the same strategies time and again. Random encounters were often more challenging (can't count the times I was killed in the first round against elementals while laughing off bosses). To be fair, this is how bosses in almost every RPG out there are like anyway.\n\n- So I was really underwhelmed with the gear received going through the extra dungeon (bear with me for a moment). The superboss at the end was incredibly challenging. I honestly can't imagine winning with a composition or strategy different than what I used (aside from farming stat ups, but that's boring). It took me dozens of tries to refine that unbeatable strategy. And finally, the equipment I got for winning made the entire dungeon worth it all. It was just a shame there weren't any other big challenges to use them in.\n\n- I didn't stop to grind at all. I never stopped moving foward in the game except to complete side quests and I always took the shortest route I could to complete each stage while collecting every treasure (I think I missed only two treasures. One I know the location of. One was a hidden wall in Yvalak's realm that I forgot about and will never find now). I didn't run away from any encounters. The point of all of this was that I found it interesting that I was almost max level when I was done. I typically finish RPGs in the level range of 50-70, sometimes a little lower. It was pretty cool.\n\nI must admit, I'm not used to status effects and AoE magic being such a ridiculous threat throughout the entirety of an RPG. I also didn't expect armor to lack reasonable scaling. I am greatly looking forward to tackling hard with my developed understanding of the game mechanics.", "timestamp_created": 1500742418, "timestamp_updated": 1500742418, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.533265", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33236201": {"recommendationid": "33236201", "author": {"steamid": "76561198260500933", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 95269, "playtime_last_two_weeks": 0, "last_played": 1499796832}, "language": "english", "review": "Wow, great game, truly epic. I'm on my second playthrough and still not tired of it yet!", "timestamp_created": 1499183398, "timestamp_updated": 1499183398, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.473511", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33199765": {"recommendationid": "33199765", "author": {"steamid": "76561198095147454", "num_games_owned": 401, "num_reviews": 3, "playtime_forever": 3096, "playtime_last_two_weeks": 0, "last_played": 1499055898}, "language": "english", "review": "Wow, well, I just played through arguably the best JRPG of all time.   If I would have said that a week ago, I'd be referring to a replay of Chrono Trigger, Final Fantasy VI, Secret of Mana, Albert Odyssey or others I've played over the years.  However, today, I'm saying that becuase of this wonderful gem called Einlanzer.   The SNES heyday of JRPGs was during my teenage years, so I've been playing and enjoying them for ~20-25 years now.   I can say without a doubt that Einlanzer ranks up with the best of them. \n\nThe game starts out fairly 'typically' of how a game like this starts out, but it's not to say it starts out unoriginally.  Over the dozens and dozens of hours of this game though, you really see it grow and flourish into what I think is a masterpiece of dialoge, story and satisfying gameplay.   Without giving anything away, the main story ended up blowing me away more than any story in a video game in years.  It legitimatley made me 'feel' feelings.  And there were also 'laugh out loud' moments where I actually laughed, instead of just smiled and lightly gave a single chuckle (like usual 'funny' sections of games).  \n\nThe difficulty curve is also worth mentioning.  In this game, almost every single new place you go ends up giving you very challening battles, but there are no impossible sections that make you want to quit or get too frustrated like is the case in sections of many other JRPGs.  It's just another spot-on achievement, along with everything else about this game.  \n\nThis is honestly one of the best of the best.  As a JRPG veteran and huge fan, Einlanzer belongs in the conversation of 'best JRPGs of all time', and is one of the most purely fun games I've played in a very long time.", "timestamp_created": 1499112030, "timestamp_updated": 1499112030, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.545252", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33149497": {"recommendationid": "33149497", "author": {"steamid": "76561198035233570", "num_games_owned": 81, "num_reviews": 43, "playtime_forever": 758, "playtime_last_two_weeks": 0, "last_played": 1499299675}, "language": "english", "review": "Nifty Little RPGMaker Title, I've enjoyed it so far.\n\nThe Actual turn-based Gameplay is less satisfying than some comparable games I've played, but it's perfectly functional, and I'm enjoying it. The greater story seems fairly basic so far, and has hit me with the odd exposition dump that's just a chore to get through, but there are some promising ideas here that I'm pretty sure I'll get to see in more detail as the game continues.\n\nBut the real thing that sets it apart, and why I genuinely think this game is worth playing, is a strong focus on character dialogue- It consistently FEELS like you're at the head of an actual team of characters who are all talking and interacting, who all approve or disapprove of choices you make, and just generally spend the whole game providing their 2 cents on everything going on around you. It's a level of character interaction I'm not used to seeing in an RPGMaker game, and I really enjoy it. I want to see what antics these characters are going to get up to next, and see if all the times I stole stuff and disappointed the Cleric are going to have consequences.\n\nIt's certainly worth buying on sale if you're into this sort of old-school JRPG style of game that people make all the time in RPGMaker.", "timestamp_created": 1499024949, "timestamp_updated": 1499024949, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32633042": {"recommendationid": "32633042", "author": {"steamid": "76561198125480725", "num_games_owned": 66, "num_reviews": 6, "playtime_forever": 4761, "playtime_last_two_weeks": 0, "last_played": 1498135724}, "language": "english", "review": "Wow, what a game! It's so hard to find a well made, classic JRPG. This one has it all - a great story, unique, well fleshed characters, side quests, a turn based battle system....took me 79 hrs to finish!  Looking forward to many more games from the developer and team.", "timestamp_created": 1498100484, "timestamp_updated": 1498100484, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.527559", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32543202": {"recommendationid": "32543202", "author": {"steamid": "76561198066212848", "num_games_owned": 172, "num_reviews": 6, "playtime_forever": 4491, "playtime_last_two_weeks": 0, "last_played": 1497730484}, "language": "french", "review": "Sans les évaluations dithyrambiques, je ne me serais pas arrêté sur cet énième produit RpgMaker vendu par un trailer très kitsch. Après une soixantaine d'heures passées sur Einlanzer, je me sens obligé de laisser ici quelques mots pour le francophone fan de Jrpg qui passerait par ici : Madame, Monsieur de passage, faites halte, ce titre vaut la peine de s'y intéresser.\n\nSi Einlanzer ne transpire pas l'originalité sur la forme, en revanche, il se démarque sur la finition. Steam ne manque pas \"d'hommages\" en tout genre aux Jrpg d'antan, qui se bornent à en reprendre quelques caractéristiques pour attirer à bon prix le nostalgique. Ce n'est pas le cas de cet Einlanzer.\n\nSon premier point fort : le scénario. On a plusieurs fois l'impression de toucher au dénouement de l'aventure, et paf, un rebondissement tombe, et donne un nouveau souffle à l'histoire. Les ressorts de l'intrigue sont classiques, mais assez maitrisés pour tenir en haleine jusqu'au bout, et susciter une larmichette une fois arrivé, enfin, à l'épilogue. L'histoire parvient en plus à intégrer quelques \"choix\" moraux proposés au long de l'aventure, sans créer de cassure avec le fil rouge de l'histoire, ni paraitre totalement cosmétiques ou incongrus. On aimerait pouvoir en dire autant de certains titres à gros budget récents. \n\nLe deuxième point fort : l'équilibrage. J'ai terminé le jeu en mode \"difficile\", et, pour une fois, le terme \"difficile\" n'est pas usurpé. Le jeu est exigeant, et il ne suffit pas de grind pour venir à bout de n'importe quel obstacle (d'ailleurs, on finit sans forcer au lvl max bien avant d'atteindre le dernier boss optionnel). Je n'ai pas trouvé non plus de stratégie ultime susceptible d'être répétée en boucle. Chaque personnage a ses forces et faiblesses (dont certaines vont dépendre d'une spécialisation irrévoquablement choisie au début), et son intérêt selon la situation, avec un équipement et un soutien approprié (à part peut-être Borm, sauf à lui donner certains skills uniques). \n\nLe troisième point fort, qui rejoint les deux premiers : la quantité assez incroyable de contenu. Dans la pure tradition des (bons) Jrpg, chaque personnage de l'équipe a le droit à ses moments de gloire et de misère, et le grand finale n'arrive qu'au terme d'une longue quête faite de moult rebondissements, de quêtes subsidiaires et de donjons juste assez tordus pour donner une impression de variété à un contenu de prime abord assez aride. \n\nEt les points négatifs dans tout ça ? Le jeu n'est disponible qu'à condition de lire l'anglais, mais je suppose que ce n'est pas un obstacle insurmontable à ceux qui se seront seulement arrêtés sur la page de ce jeu. Par ailleurs, c'est du Rpgmaker. Le créateur du jeu a manifestement préféré investir sur le fond que sur la forme. Il y a cependant mis toute sa passion, et parvient à transmettre des émotions. C'est à mon avis assez rare pour être souligné.", "timestamp_created": 1497805023, "timestamp_updated": 1497805023, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32210784": {"recommendationid": "32210784", "author": {"steamid": "76561198160600718", "num_games_owned": 158, "num_reviews": 1, "playtime_forever": 2309, "playtime_last_two_weeks": 14, "last_played": 1515660194}, "language": "english", "review": "Really nice old-school JRPG; about ten hours in and so far good pacing, engaging characters, and the game has remained interesting without any dull segments. A good mix of Final Fantasy IV and Phantasy Star IV is how I would describe it, and good humor also is scattered throughout the adventure. Battle system is in a good range with not too little involved but also not over-saturated with actions. Visuals are satisfactory and music is well-composed in the style of JRPG's from the nineties.\n\nUpdate: Wanted to add that I am now about 25 hours into the game and it does build in epic scale quite nicely. Really enjoying the overall scope of this adventure. It is clear that a lot of thought and effort went into developing character skill-sets and also enemy designs. Einlanzer does certainly stand side-by-side with any of the cherished JRPG's for SNES, Genesis, and Turbografx CD-Rom and compares favorably. I will definitely be looking out for future projects from this developer, be it another JRPG or a different genre.", "timestamp_created": 1496709253, "timestamp_updated": 1498685112, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.532858", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31897962": {"recommendationid": "31897962", "author": {"steamid": "76561198014889390", "num_games_owned": 334, "num_reviews": 26, "playtime_forever": 581, "playtime_last_two_weeks": 0, "last_played": 1496518830}, "language": "english", "review": "A real hidden gem.\n\nGood story and dialogues (so far) = check\nGood hard tactical combat (if you play on hard difficulty) = check\nGood skills = check\nAnd decisions like subclasses or even not mandatory fights with good rewards = check\n\nFinally a real good old tactical RPG.\nHave almost not found it because most of the RPG Maker games are real bad, but this is a lovely gem.", "timestamp_created": 1495444342, "timestamp_updated": 1495444342, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.553160", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31660211": {"recommendationid": "31660211", "author": {"steamid": "76561198004865132", "num_games_owned": 112, "num_reviews": 6, "playtime_forever": 3864, "playtime_last_two_weeks": 0, "last_played": 1495079884}, "language": "english", "review": "I am really enjoying this game. It is increibly well written and the story is immersive and surprising! Combat has a lot of variety, is fun, and strategic. Characters are great. 10/10 classic JRPG.\n\nUpdate: Finished the game. There was much more content than I expected and I really enjoyed the whole thing! Some of the writing gets a little corny towards the end, but the multple endings were really well done and showed the serious impact of a big decision. This really hit home for me. Great game and well done.", "timestamp_created": 1494397785, "timestamp_updated": 1495080408, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.515152", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31299841": {"recommendationid": "31299841", "author": {"steamid": "76561198065336306", "num_games_owned": 168, "num_reviews": 1, "playtime_forever": 1724, "playtime_last_two_weeks": 0, "last_played": 1493262630}, "language": "english", "review": "Absolutely loving the game! The story is very immersive and gives you a sense of purpose as you play the game. The game does not hold your hand and will not give you a big glowing pointer to where you need to go next. You must pay attention to what is being said and use the directions that people tell you to find your next destination. Overall, I am quite thrilled and it is a great buy, especially for only $8", "timestamp_created": 1492876447, "timestamp_updated": 1492876447, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.507692", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31268179": {"recommendationid": "31268179", "author": {"steamid": "76561198031859124", "num_games_owned": 333, "num_reviews": 24, "playtime_forever": 1235, "playtime_last_two_weeks": 0, "last_played": 1510543280}, "language": "english", "review": "I have a logitech controller and a xbox 360 controller and niether one works with this game (sigh) very disapointed that i have to use the keyboard to play it . with that said the game is very well made . if it had support for controllers other than the steam controller it would be close to perfect. after some searching i found controller companion on steam it works and its easy to use problem solved :)", "timestamp_created": 1492746516, "timestamp_updated": 1492749465, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.483871", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31176568": {"recommendationid": "31176568", "author": {"steamid": "76561198173717413", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 14815, "playtime_last_two_weeks": 0, "last_played": 1514742929}, "language": "english", "review": "I absolutely loved this game.\nOne of the best RPG 's I have played in a while.\n", "timestamp_created": 1492343641, "timestamp_updated": 1492343641, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31148581": {"recommendationid": "31148581", "author": {"steamid": "76561198029415707", "num_games_owned": 45, "num_reviews": 5, "playtime_forever": 4557, "playtime_last_two_weeks": 0, "last_played": 1498948857}, "language": "english", "review": "Being an RPGMaker game, I didn't exactly have high hopes for Einlanzer at first.. but I was terribly wrong, and incredibly surprised by the amount of polish that's gone in to this game. I can't even tell it's an RPGMaker game; it feels like something straight off the SNES, and I love it.\n\nI'll break things down as I feel they need to be and go over them a bit.\n\nStory: the story is fairly simple... at first. It's your typical \"time to be heroes!\" kind of setting, but this is exactly what I was expecting and haven't been disappointed at all in it. It's been engaging enough throughout my playthrough that I've been reading everything I've been able to.. something that usually doesn't happen in RPGMaker games, for some reason.\n\nThere's numerous twists and turns that I won't go over here due to spoilers, but I'll say that it's the first time a game like this has had me saying \"Oh shit...\" to myself in I don't know how long. Really, really refreshing!\n\nGameplay: if you've ever played the SNES greats (Final Fantasy 6, Chrono Trigger, etc.), Einlanzer will not disappoint. It's pretty solid for what it is, so if you're a fan of that era of RPG games, you'll like Einlanzer. There's PLENTY to do (40+ hours... so surprising, but so great as well!), and plenty to find!\n\nThere's also multiple difficulty settings. Even on Normal, the game is quite hard in various spots. Strategy will very much be a part of how you play, rather than \"lol mash attack and win battles\".\n\nI can't imagine how it is on Hard, although I will be playing through it a second time, once I'm done, to find out!\n\nCombat: pretty typical for RPGs like this. The things that stood out for me, though, that every other RPGMaker game I've played has been missing, is this:\n\n1. Buff/Debuff management - Most, if not all, other RPGMaker games that I've played have not done this very well at all. Einlanzer stands above those games and has a vast array of visuals for both buffs, debuffs, and other effects.\n\n2. Skill variety - This is the aspect of Einlanzer's combat that really surprised me. There's a vast amount of skills available to every character, which allows for great strategic play (which is sometimes necessary, even on normal), and even more so when paired with other combat mechanics you can utilize.\n\nVisuals: the visuals of the game remind me of those SNES greats that I spent so many hours playing when I was younger. While the combat visuals aren't quite as extensive as, say, FF6 or Chrono Trigger, they're still good and I wasn't disappointed. Every skill has its own unique visual, and certain weapons even alter your basic attack visual to something new.\n\nAudio: the soundtrack is, surprisingly, very good. I'm particularly fond of the Lost Woods track. My only gripe with the audio is that one of the boss themes (I think the... miniboss theme? You can encounter \"mini bosses\" later on that use this particular theme; if you've played the game you know what I mean) is quite loud when it kicks in. If you're just out in the world or a dungeon map later in the game and come across a miniboss, it may make you jump a bit. It's a good track, though!\n\nAll in all, I'm not even done with the game yet and I'm still enjoying it thoroughly. I seriously did not expect an RPGMaker game to have this much content in it. It's quite apparent to me that the developer(s) have put a lot of time, effort, and love in to this game and it shows in every aspect. The only gripes I have about the game are that one audio track I listed above, and some random grammatical errors here and there. (Mostly a few spelling and grammatical errors.)\n\nThis is a DEFINITE 10/10 for me. If you're looking for a good, old-school RPG similar to the greats of years past, [b]buy this game[/b]. You're flat out told that this game is heavily inspiried by the old SNES classics (and others of that era), and it shows. The detail and polish is through the roof on this one. I can't stress enough to buy it if you're a fan of these types of games.\n\nThis is definitely a developer worth watching, also. If this much has been up in to this game, I can't wait to see what else they have planned, whether it be a sequel or an entirely new game.", "timestamp_created": 1492228979, "timestamp_updated": 1492229241, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30697812": {"recommendationid": "30697812", "author": {"steamid": "76561198044424316", "num_games_owned": 66, "num_reviews": 1, "playtime_forever": 1800, "playtime_last_two_weeks": 0, "last_played": 1493403430}, "language": "english", "review": "I was looking for a new jrpg to play and stumbled across this beauty. I'm only around 6 hours in, but I've had a blast. So far the story is reminiscent of the epic jrpgs of the 90's, but with much better dialogue. As much as I loved Woolsey, he was a bit cringy at times.\n\nThe characters are already fairly fleshed out for the time I've invested into the game, and the balance levels seem fine. The black mage might be a biiiit broken though, as her spells hit HARD and her mana drain ability puts Osmose to shame. The side quests (yes, this game has sidequests!) are a fun diversion that are also quite rewarding.  \n\nThe game seems to have a morality system, and depending on the outcomes of the different choices you make this could make for immense replay value. \n\nIf you enjoyed any of the SNES Final Fantasies, Chrono Trigger, or pretty much any jrpg I strongly encourage you to try this game. For the price it is a steal.", "timestamp_created": 1490327591, "timestamp_updated": 1490473460, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.509749", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30696278": {"recommendationid": "30696278", "author": {"steamid": "76561198126967395", "num_games_owned": 33, "num_reviews": 1, "playtime_forever": 2268, "playtime_last_two_weeks": 0, "last_played": 1496514146}, "language": "english", "review": "Simple and short review: If you're looking for a JRPG, look no further than Einlanzer.\n\n***\n\nSit on down and let me tell you about a JRPG called Einlanzer...\n\nSo here I am, natural lover of all JRPG's. I'm talking old school JRPG, during the dawn of JRPG's. I have been searching EVERYWHERE for a good one. When I played back in the day on the good ol' PS1, I played a game called Suikoden (perhaps you've heard of it/played it), and that game was literally BOMB AF, (one of my all time favorite games) but you know.. with time it got erased from my presence. I tried World's Dawn (on steam) and it's fair enough. I beat it in like two days, so not really for me, I like a challenge. I'm thinking maybe there's just no more good JRPG's in the world, but HOLD YOUR HORSES BECAUSE WE FOUND EINLANZER. \n\nEinlanzer channels Suikoden on so many levels, and I'm loving every second.\n\nWhat I like:\n---> Turn-based combat \n---> Gathering new characters with new skills \n---> Ability to swap your formation to play who you want within the characters you've collected\n---> Mechanics\n---> Plot is pretty decent with some OK character development but don't come looking for anything deep and meaningful (See #2 on my list of improvements)\n---> Map layout \n---> Difficulty (I'm guessing it takes about 60-70 hours to finish *ON EASY* and that's w/o doing side quests.. you have the option for easy, medium, hard)\n---> Side Quests\n---> Price (so cheap for a good game)\n\n\nWhat could be improved:\n---> When leveling up a character, you don't get to decide which stats are raised, or which new skills you get to learn.. they're just automacially decided for you (don't get me wrong, the stats/skills are still pretty much what I would've chosen had I been given an option anyways)\n---> Dialogue. Some of this dialogue makes me roll my eyes, but nevertheless keeps me interested. You can tell it's written for/by a less mature audience. (Rated E)\n\n\nNo game is perfect, and Einlanzer certainly isn't any different, but it is DEFINITELY worth buying and playing.", "timestamp_created": 1490319171, "timestamp_updated": 1490319529, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.570720", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30616588": {"recommendationid": "30616588", "author": {"steamid": "76561198142627191", "num_games_owned": 67, "num_reviews": 1, "playtime_forever": 1639, "playtime_last_two_weeks": 0, "last_played": 1509041392}, "language": "spanish", "review": "Si bien tengo algun que otro juego en steam esta es mi primera review que hago sobre uno y lo hago por que este juego vale la pena. Solo tengo 6hs de jugado pero con solo ese tiempo puedo decir que es una obra maestra, si te gustan los juegos Chrono Trigger, FF 2-4, etc, te puedo decir que con este no te vas a decepcionar. Muy buena jugabilidad e historia con personajes carismaticos y queridos  y banda sonora increible, en mi opinion vale la pena sus 8dls esta joyita de game.", "timestamp_created": 1489933393, "timestamp_updated": 1489933393, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30566859": {"recommendationid": "30566859", "author": {"steamid": "76561198119548397", "num_games_owned": 1740, "num_reviews": 7, "playtime_forever": 611, "playtime_last_two_weeks": 0, "last_played": 1489748178}, "language": "english", "review": "Really nice JRPG game, it reminds me of older classics I played when I was really young. I'm very pleased with the amount of choices and mistakes that the player can choose from during combat! The monsters always seem to be a threat. To me, the game isn't too easy, but at the same time, it isn't too hard either.\n\nThe character progression is good and the storyline is great! The developer is highly responsive, so bugs are fixed fairly quickly. I'd recommend this game to anyone who likes classic JRPGs.", "timestamp_created": 1489748710, "timestamp_updated": 1489748710, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.494327", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "30517345": {"recommendationid": "30517345", "author": {"steamid": "76561197964316764", "num_games_owned": 83, "num_reviews": 1, "playtime_forever": 609, "playtime_last_two_weeks": 0, "last_played": 1489616803}, "language": "english", "review": "Even just a couple of hours into the game, I was really enjoying the variety of choices (and mistakes!) available to the player during combat.  The monsters are always a threat, and there's a lot more to success than simply using your \"best\" attack over and over.  For better or worse, the threat of random encounters is more immediate than the traditional JRPGs I remember, with less focus on battle-to-battle resource management.  It takes some getting used to, but it's nice to see this game taking a chance on doing things a little differently.\n\nI'm only about five hours into the game, so I can't say too much about the story, but I'm still playing and enjoying progressing my characters and exploring the map.  I'll update this review when I'm further through the game.\n\nWorks really well with the steam controller.", "timestamp_created": 1489539677, "timestamp_updated": 1489539677, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.514019", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "30483182": {"recommendationid": "30483182", "author": {"steamid": "76561197983976576", "num_games_owned": 246, "num_reviews": 12, "playtime_forever": 3537, "playtime_last_two_weeks": 0, "last_played": 1500846693}, "language": "english", "review": "[b]If Einlanzer was released during the 90's instead of today, it would be hailed as the RPG that all others are held to as the standard of having a great story, effortless game play progression and abundance of content and emotion. [/b] \n\nFor this old gamer, my absolute favorite RPG's of all time where the classic JRPG's of the 90's and on top of that list was always the incredible journey of Final Fantasy II with Cecil fighting against his brother Golbez who was amassing all of the worlds Elemental Crystals.  I have played just about every JRPG since then, hoping to ever get that feeling I had as a child (who am I kidding, I can still play FF II and get that feeling again).  It seems like with all the ones I have played since the advent of RPG maker games never fully delivered.  Some where very good, others just did not do it for me.  For 25 years I kept searching for a game to even compare to how FF2 made me feel.  Einlanzer hooked my attention with it's claim that it has tapped into the lure that was created with all those great JRPG's of the time so I took a chance to try this game out.\n\n[h1]Einlanzer Is That Game![/h1]\n\nFrom start to epic finish, Einlanzer is true to it's word.  In good old JRPG fashion you are the dumbfounded new hero thrust into having to save the world from an enemy so powerful that they can crush even the gods and the every existence of the entire universe itself.  Although the game's story does not go from what I would say \"ordinary\" to very good until about Act 3 or 8 hours into the game, it is still enough to keep you very interested as the rest of the story develops.  \n\nYou can tell Einlanzer takes a nod from what made the best JRPG's of the 90's the best of the best.  The main enemy employs the use of generals who during the main story block your hero and his companions attempts at every intersection along the way.  These generals are vastly superior than all of your combined forces and many tragic defeats and loss of life occurs as your hero's begin to contemplate just how impossible their plight really is.  In addition to the enemy employing his own heroes to stop yours, you will also encounter the growth of your party as they go through this experience together.  Friendship, betrayal, comedy, sorrow and even love is eloquently transformed during powerful and even mundane moments in the game.  \n\nIt all leads up to the revelations of the source of the power the main enemy has been using to become so powerful and the epic battle to save the world.  In all my years of playing these types of games, no final boss battle has ever had such an epic and terrifying last battle aside from Sephiroth in FFVII.  But the best part is, the game does not end there.  You still have one very powerful last few minutes of the game to finalize what you started.  \n\nAlso, did I mention that the decisions you make can profoundly change the course of the game all the way up to the very end giving it lots of replay value to top things off?\n\n\n\n[h1]What to expect for experienced JRPG players[/h1]\n\n\nAlthough the story starts off a little slow and somewhat predictable, it transforms once it gets to the meat of the game at around Act 3 or 8 hours into it.  The writing in this game is wonderful and borderline genius.  Everything pushes forward the story in a simple to understand linear fashion of the games of old after a somewhat confusing dream that your lead character, a Swordbearer named Victor has while on guard duty on the day the beginning events of the Einlanzer story unfolds.  The progression system is also spot on with very little need to grind to be able to progress in the story unless you want to.  Visually you can expect SNES graphics, but for us fans of JRPG's that is not much of a concern for us.  Plus, any who play a lot of these like me will notice a good amount of standard RPG Maker assets like seeing the same monsters you would in other games.  Again, not something that really annoys me, but sometimes I may go to old habits in other games if the enemies weaknesses are different.  \n\nAlthough there is a ton of content in the game, side quests themselves are impossible to miss as every location unlocks during certain parts of the story.  Bad for grinders, but like I said, there is really no need to have to.  Even though there is not much \"open world\" to enjoy, I do not see many situations where you would wish to put the main story on hold for long because of how enthralling it is.  Especially as the game progresses.  \n\n\n\n[h1]The only Cons[/h1]\n\n- Like pretty much all JRPG's, if you have a ultra-wide monitor, there is no way to make it look non-stretched\n- Only a few decisions made in game greatly impacted the story.  Most just changed something very narrow and not important\n- Music was good, but not the best.  Music in some parts seemed out of place, but most of the time it fit very well\n- Some grammar mistakes here or there.  But not enough to be distracting\n- Some of the characters in the game could had been left out, combined or killed off as they did not seem to play a very central role like some of the others\n\n*****No Part 2 or new game planned from this studio yet!  I am drooling out the mouth for another!  ******\n\nEDIT - I take back the last two sentences :)", "timestamp_created": 1489369626, "timestamp_updated": 1502400486, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.602451", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30463616": {"recommendationid": "30463616", "author": {"steamid": "76561198052292988", "num_games_owned": 569, "num_reviews": 35, "playtime_forever": 4810, "playtime_last_two_weeks": 2, "last_played": 1516202295}, "language": "english", "review": "Well This is a good RPG.  I have not finished it yet, due to it being long.  And I sure there were many sidequest I missed and hidden items, but hey thats cool for replay if I ever get to beat this game.  It has a great story.  Graphics are good, party setup is nice.  Music great.  \n\nFor the price you getting a game that will beat out I am Setsuna. I won't say it beats Lufia 2 yet, but it does beat out Final Fantasy snes titles. \n\nThe only issues withe the game I feel are gamepad.  It is not supported but maybe one day with a patch.  The other issue I have is with the world map.  It be nice to see an icon of yourself on it, or a mini map in game.\n\nBeyond that great game by a single developer.  I highly recomend.  Oh, did I say it has easy, normal and hard mode for a RPG?", "timestamp_created": 1489299300, "timestamp_updated": 1489299300, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.487927", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30457288": {"recommendationid": "30457288", "author": {"steamid": "76561198043931760", "num_games_owned": 376, "num_reviews": 6, "playtime_forever": 3494, "playtime_last_two_weeks": 0, "last_played": 1489529610}, "language": "dutch", "review": "Awesome game in his sort. One of the best and many, many hours fun .", "timestamp_created": 1489269688, "timestamp_updated": 1489269688, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30352890": {"recommendationid": "30352890", "author": {"steamid": "76561198127225937", "num_games_owned": 49, "num_reviews": 1, "playtime_forever": 3194, "playtime_last_two_weeks": 0, "last_played": 1491018995}, "language": "english", "review": "Fairly enjoyable game.\n\nI liked the huge world and semi strategic battles with a vast array of skills and equipment to choose from. The music is decent, nothing groundbreaking but most of the time fits the scene. The illustration on the main menu looked quite nice, although I was a bit confused by how sexualised Alice was, considering that she's supposed to be a devout priestess. The mapping was well done. Fairly generic, but nothing to complain about. I was somewhat confused by the face sets, however. Some of them were stock faces from RPG Maker, and some of them looked like they'd been made with a custom face maker or edited in GIMP or something. I can't really remember any bugs, which is a big plus.\n\nThe biggest problem I have with this game is the writing. For someone calling themself a \"professional fantasy novelist,\" much of the dialogue seemed like it was written by a twelve year old boy. The game was riddled with grammar and spelling errors, which really made me wonder if a lot of it was even proofread at all. Several characters spoke in bizarre modern slang, which wasn't at all fitting of the world it was set in. The jokes and \"romance\" were absolutely cringeworthy, especially with the thief character, Finn. The constant yelling in caps lock and incessant flirting that bordered on sexual harassment were incredibly difficult to stomach, and at several points I would have loved to be able to reach through the screen and squish him.\n\nDespite these flaws, I'm somewhat enjoying this game so far. I've just gotten the big ship and gone to the swordbearer temple. The new addition to my party is pretty stupid, honestly. What's the point?\n\nIf you're a fan of classic RPGs or games made with RPG Maker and you're willing to deal with these issues then by all means, buy the game.", "timestamp_created": 1488791812, "timestamp_updated": 1488791812, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.557070", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30351723": {"recommendationid": "30351723", "author": {"steamid": "76561198011891156", "num_games_owned": 834, "num_reviews": 57, "playtime_forever": 6972, "playtime_last_two_weeks": 0, "last_played": 1491517263}, "language": "english", "review": "I am an old school rpg enthusiast who love RPG Maker games.\n\nI pick up this game a few days ago, and have been playing non-stop eversince. The graphics are really pretty and there are numerous original music scores. On top of that the storyline is very interesting and immersive. The game world is very large and I can recruit a team of up to 10 members, each of which have a unique vocation that come with a set of unique skills as well. \n\nSo far, this game is relative bug free, which means that there were probably extensive beta testing prior to the release. That is good, as I really do not like to play early access games where I have to wait for the final version to come out. However, the case of Einlanzer, the game is very well polished and well balanced, so I do not expect any disruptive patches that might disrupt my game play.\n\nI am also a completionist and like to get all the steam achievements.  Since there are moral decisions involved that will affect the game play and possibly the different endings,I realised that I have to play this game at least twice. This make it all the more fun for e, and I can easily forsee myself spending 100 game hours to hunt down all the different achievements.\n\nSo, for all the fun times, I feel that this game is really a worthwhile buy that will give me many hours of enjoyment. I highly recommend this game to any old school gamer who like a well made, detailed oriented, epic RPG.\n\n", "timestamp_created": 1488783632, "timestamp_updated": 1488783632, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.527304", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30325820": {"recommendationid": "30325820", "author": {"steamid": "76561198041191365", "num_games_owned": 236, "num_reviews": 26, "playtime_forever": 152, "playtime_last_two_weeks": 0, "last_played": 1488670438}, "language": "english", "review": "After playing great 2.5 hours of this game. I can really say that this game is oldschool and great. It is worth its price for who ever is into RPG's like me. The story isnt too difficult which makes the game great for RPG fans and for people who just got into RPG's. Definetly strong 9.5/10. The only reason i didnt give this game 10/10 is that during dialog if the expresions of the characters would change. Like their facial emotions. Then it would be 10/10 but even without that. This game is great and I am happy that I decided to buy it :)", "timestamp_created": 1488670650, "timestamp_updated": 1488670650, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.498059", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30270224": {"recommendationid": "30270224", "author": {"steamid": "76561197975903030", "num_games_owned": 65, "num_reviews": 1, "playtime_forever": 1012, "playtime_last_two_weeks": 0, "last_played": 1500068838}, "language": "english", "review": "Enjoyable game with a highly responsive dev. I did some beta testing and the bugs I found were addressed quickly.", "timestamp_created": 1488416830, "timestamp_updated": 1488416830, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.367641", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 7, "review_score_desc": "Positive", "total_positive": 36, "total_negative": 0, "total_reviews": 36}}
