{"reviews": {"39432771": {"recommendationid": "39432771", "author": {"steamid": "76561197983469885", "num_games_owned": 323, "num_reviews": 4, "playtime_forever": 1494, "playtime_last_two_weeks": 1479, "last_played": 1516320773}, "language": "english", "review": "Such an increadibly good game. Just wow.\nSo much reaplablity, such great characters, so much suprise on the diffrent pathways. \n\nThis is a game with a lot of heart, great big nerdy heart.", "timestamp_created": 1516269669, "timestamp_updated": 1516269669, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39382520": {"recommendationid": "39382520", "author": {"steamid": "76561198439763277", "num_games_owned": 8, "num_reviews": 6, "playtime_forever": 1218, "playtime_last_two_weeks": 1218, "last_played": 1516413238}, "language": "english", "review": "This game is FULL of replayablility. If you want a game that constantly keeps you on your toes and is a good challenge, you'll get it. This game kicks my butt every time I play it, but it's fun enough that I keep coming back.\n\nThe cases aren't bad and are done pretty well. The cases repeat, but there are so many variations, you'll never know who the culprit(if there even is one) is until you investigate. Although some cases have very little time to solve them, if you don't get a lead almost immediently, you'll never have enough time and you lose points. Although, that is rare. One issue that I had was the cases come so rapid-fire that's near impossible to solve them all unless the RNG is gracious.\n\nI don't know if it's just me, but the characters were \"meh\" to me. I honestly had a hard time caring about any of them and felt like they detracted from what's important. Whether you got to know them or not, it usually didn't seem to matter too much in terms of the plot. I think the developer couldn't decide whether to make a dating sim or detective game, so it's both shoved tother. I have to admit, I skipped most of the text in the game because I just didn't care about it. I didn't really feel like my choices mattered and didn't care to get to know the girls, so I would just tune out.\n\nThe boss is hard. It took me about 5 tries to get to the boss, a 6th to beat it. Overall, it was pretty fun. It'd give it a 7/10.", "timestamp_created": 1516080616, "timestamp_updated": 1516080759, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39379900": {"recommendationid": "39379900", "author": {"steamid": "76561197993404712", "num_games_owned": 164, "num_reviews": 21, "playtime_forever": 1333, "playtime_last_two_weeks": 1333, "last_played": 1516067508}, "language": "english", "review": "Okay, sooo - honest review time.\n\nThis game overall is good for an experience. \n\nPoint form:\n\nUser Interface: 4/10. I will touch on this further later.\nMusic: 4/10. It's not bad, but it is really simple looping music. \nCharacters: 7/10. I liked -most- of the characters in this game. I'll touch on this later too.\nArtwork: 5/10. Okay this needs elaboration too, so again it's below..\nStory: 8/10. For the most part the story is good and makes sense. There are a few loop holes even after doing every single option in all paths, but that happens in most games.\n\nIn depth:\n\nAlright first off the negatives, let's get these out of the way.\n\nFirst and foremost the thing I found MOST annoying in this game was the inability to save per day. This was annoying because as a completionist of otome games, I not only had to make several game files but there are other reasons this is annoying too. [spoiler]I had to do it all TWICE with a second set of artwork, too! As I didn't know that was a thing until much later.[/spoiler]\n\nSecond most annoying to me is regarding the final boss. [spoiler] Miss Talmage has seriously too much health for such a simplistic game mechanic. Not only can you not double up your minions at the end (so you really only need one) but this mechanic makes it pointless to do anything but level up a single character. Since aforementioned you cannot save whenever you like, and I wanted to make sure I had all CG's I had to defeat Talmage at least 15 times due to mistakes and missing cutscenes along the way.. In fact this got to be so annoying that for the final few paths I straight up looked up how to cheat stats. It didn't help the ding-noise as you counter-attack her though, so I turned off my speakers, held down control at the boss fight and clicked the same thing a thousand of times... It was seriously that annoying..[/spoiler]\n\nThird thing was that I did not like that besides paying a ton of attention, you could not find the traitor just by how they were acting. You do get an option later on that lets you pick the traitor if you choose to - but, the first playthrough the only reason I found out who the traitor was (Althea in my case) was that I'd intended to go down her path first. Like I said, I do like MOST of the characters in this.\n\nFourth point is another spoiler. [spoiler] Mallory is heterosexual. Great, then why is she in this game? Look, I'm sure most of us that like girls have played with a girl who is bicurious and turns out to be straight, but the fact of the matter is... Most lesbians don't like straight girls. They might find em cute to look at, but it's such a turnoff since you can't tempt a unicorn forever. I hated her path. It was necessary in order to easily get the secret path as well - but I don't want to play a romantic visual novel where a character doesn't like something that the MC can't really change about herself. Just a pet peeve of mine. [/spoiler]\n\nFifth thing I need to mention is that you will need to complete this game with two sets of artwork for all of the achievements. If that wasn't the case, I wouldn't have bothered because I didn't like the art style at all. The cg's either, honestly speaking. Which brings me to the last topic/kind of ties in with it.\n\nLast negative I want to touch on is the artwork. I'm an artist... So I don't feel like my critique isn't fair in this case. You can change the art styles in the menu, but dear god, if you don't care about achievements, don't bother. I seriously don't know who was commissioned to do the artwork in this game, but I hope they weren't paid very much. The art is awful, seriously. The type of art that you would see in free-to-play games, bad.  The art style in the non-default set also looks like someone painted over pictures they grabbed from the internet, because none of the characters look the same when they're animated, also the proportions are seriously off. Uncanny valley. The only good thing I can say is that in the CG's Thais does look pretty, but I hated every other piece because of how bad the proportions were and lighting. There was no continuity to the style at all.\n\n-----\n\nOnto the good things?\n\nThis game will give you a solid two to four days of playthroughs if you don't skip through text, and you're an average speed reader. It's got a solid 8 endings. I say 8, but there are actually more like 10 if you include the failure endings. There is no credits screen either, so that's awesome due to how fast it is to see who did work in this game, if you care to. If you like card-type games, this game is probably going to appeal to you. \n\nThis game isn't quite a kinetic novel, but it also sort of is. What you do can only mildly influence the story. There are 3 events that are absolutely going to happen no matter what, unless you fail the game, so it's similar to a kinetic novel. If that's your thing, you might like this game a lot.\n\nI also liked the fact that there is a CG viewer, although now that I've completed the game I'll probably not play this for a very long time, I like that If I wanted to - I could go back and view the artwork from it. The art that is set to default is beautiful, and all of the cg's are quite nice in that set as well. So there's quite a bit of \"pretty girls\" in this. That was what motivated me to get it.\n\nOverall would I recommend this game? Yes. If it's on sale. It might be worth buying at full price for some, but for me - it's was not worth 20 dollars. 10-15 seems more fair, given the amount of content, and actual playability of this game.", "timestamp_created": 1516069824, "timestamp_updated": 1516070019, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39340699": {"recommendationid": "39340699", "author": {"steamid": "76561198261066527", "num_games_owned": 237, "num_reviews": 88, "playtime_forever": 36, "playtime_last_two_weeks": 36, "last_played": 1515942275}, "language": "english", "review": "only just started and the first case i found item but dident have enough time to finish arresting people and falsy harrassed someone my reputatio nwent down fast lol.. game woulod be better if it was RNG every game but i love it its amazing", "timestamp_created": 1515942532, "timestamp_updated": 1515942532, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38851537": {"recommendationid": "38851537", "author": {"steamid": "76561198069330741", "num_games_owned": 109, "num_reviews": 4, "playtime_forever": 587, "playtime_last_two_weeks": 0, "last_played": 1514623078}, "language": "english", "review": "So I like this game a lot, but there is one thing that just ruins it for me...the difficulty. Black Closet, even on easy mode, is needlessly grueling. Whilst scrolling through the Hanako Games forum for help I saw that one player was able to beat the game after YEARS of slogging. For me this is just too much.\nI ended up resorting to cheats to complete the game for the story, but if they weren't available I would have suggested you skip this game entirely.", "timestamp_created": 1514623334, "timestamp_updated": 1514623334, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38302905": {"recommendationid": "38302905", "author": {"steamid": "76561198275931064", "num_games_owned": 29, "num_reviews": 16, "playtime_forever": 937, "playtime_last_two_weeks": 0, "last_played": 1509897238}, "language": "english", "review": "One of best yuri games I have ever played. It not your sweet, happily ever after type of game. It could be cruel, heart broken, dark so prepare yourself!\nThe story is well written. Especially the canon girl (or just my guess). The 2nd art style is my favorite, both in sprite and CG. The 1st art have such a charming CG but it seem don't match the sprite art at all?!?? Game play VERY hard. Luckily we could cheat. I just wish we could save anytime we need and also skip mode to skip the week like what GB Patch did to XOXO Droplets. The gameplay surely interesting but it such a pain if you have to replay many times.", "timestamp_created": 1513264108, "timestamp_updated": 1513264108, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37992796": {"recommendationid": "37992796", "author": {"steamid": "76561198004701958", "num_games_owned": 243, "num_reviews": 15, "playtime_forever": 245, "playtime_last_two_weeks": 0, "last_played": 1512167607}, "language": "english", "review": "I really liked this game because it was interesting, did not feel too repetive or stale; some degree of the repetition comes from assigning your minions to question the other students and solve mysteries, but there is a randomness factor to the quests that make it intriguing enough that it doesn't quite feel the same. The game isn't that easy on normal difficulty, though finding out who the traitor is wasn't difficult. Every game, a random person will be the traitor. And every game, you can romance on of the other girls. It's not a cheap, VN romance either, filled with pages of generic text and you not making choices. In this game, you can chose your dialog ou feel in control the whole time.\nThe art is unique and it just looks and feels nice. The sotry is not overwrought and wordy. In fact, the interactions were so pleasing that I wished for more, which is unusual for VN style games. Between the art, story and gameplay, plus the uniqueness factor, I would say you should buy this game, but wait for a sale. I bought this together with A Little Lily Princess which I also liked, and I paid like $13 for both games. That was a good price for both and seems about right. Or if you want to be supportive, don't wait for a sale and buy it now ;)", "timestamp_created": 1512186802, "timestamp_updated": 1512186802, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37710533": {"recommendationid": "37710533", "author": {"steamid": "76561197963744302", "num_games_owned": 201, "num_reviews": 1, "playtime_forever": 491, "playtime_last_two_weeks": 0, "last_played": 1511724030}, "language": "english", "review": "Do you like visual novels?\nDo you like detective games?\nDo you like haram games?\nDo you like games staring a woman of color?\n\nThen this little gem is for you!", "timestamp_created": 1511724966, "timestamp_updated": 1511724966, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.499343", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37688825": {"recommendationid": "37688825", "author": {"steamid": "76561198157283034", "num_games_owned": 36, "num_reviews": 10, "playtime_forever": 1632, "playtime_last_two_weeks": 0, "last_played": 1512226571}, "language": "english", "review": "This is a great game about a private girls school with a few mysteries. The daily activities can be frustratingly challenging at times, but it makes winning it all the more fulfilling. I love the characters and ability to form relationships with them. It's not often that I find an interesting lesbian game with a good plot, choices that matter, interesting characters, and a relationship that's not fetishized. I look forward to doing all of the girls' routes. Highly reccomended!", "timestamp_created": 1511713273, "timestamp_updated": 1511713273, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37607958": {"recommendationid": "37607958", "author": {"steamid": "76561198005879531", "num_games_owned": 1043, "num_reviews": 46, "playtime_forever": 4402, "playtime_last_two_weeks": 0, "last_played": 1464387505}, "language": "english", "review": "Visual novel/choose your own adventure/detective hybrid.  This actually makes for a really fun combination.", "timestamp_created": 1511661986, "timestamp_updated": 1511661986, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.563492", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37460857": {"recommendationid": "37460857", "author": {"steamid": "76561197998012752", "num_games_owned": 169, "num_reviews": 3, "playtime_forever": 467, "playtime_last_two_weeks": 0, "last_played": 1499612062}, "language": "english", "review": "Great setting and style; \"possibly-evil student council leader at a girls' school\" is an interesting role to assume. The yuri aspect is much appreciated and well-done, and the game offers impactful story decisions at a regular pace.\n\nAlthough the music doesn't stand out, the sound design is actually quite effective in an understated way. The little scribbling and scruffling sounds are unsung heroes in creating the illusion that you're sitting in a posh office filling out orders, brooding, scheming...\n\nThe gameplay fits well with the theme, despite feeling a little basic. Some additional mechanical depth or challenge modes would have increased the game's longevity -- as it stands, you'll probably be playing nearly optimally after your first full run. The different character routes and options save it from being a one-play-only game, but it relies on unfamiliar content for its full effect, and while it's got a very respectable amount, it's inevitably finite.", "timestamp_created": 1511584201, "timestamp_updated": 1511584201, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36122181": {"recommendationid": "36122181", "author": {"steamid": "76561198135506589", "num_games_owned": 50, "num_reviews": 18, "playtime_forever": 2009, "playtime_last_two_weeks": 0, "last_played": 1510352777}, "language": "english", "review": "I like it", "timestamp_created": 1509306539, "timestamp_updated": 1509306539, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35907298": {"recommendationid": "35907298", "author": {"steamid": "76561198063955609", "num_games_owned": 1358, "num_reviews": 142, "playtime_forever": 1164, "playtime_last_two_weeks": 0, "last_played": 1509387646}, "language": "schinese", "review": "《学生会主席异闻录》Closet既有身处幕后操控学校的“会议室”，也有出“柜”的意思（大概）。\n\n步入女校的最后一年，你被指导老师钦定为新一届的学生会主席，手下掌管着五个性格特长还有年级各异的学生会成员：拍马屁技能满点观察力较强的Vonne，活泼天真令人想亲近的一年级新生Althea，武力值相当高的小太妹Thais和她的姐姐——成熟而与世无争的同样将要毕业的Althea。你要利用好各人的优点，安排至案件的不同岗位，该谈心的谈心，该威胁的威胁，该潜入的潜入，但要注意，别太明目张胆，否则会影响学校的声誉。校董们的忍耐度是有限的，如果你干岔了，那对不起，作为替罪羊，你恐怕是毕业不了了。\n\n哦对了，差点忘了，学生会成员还有一个：存在感几乎为0的Rowan……\n\n案件都是随机的——随机的完成时间，随机的受害者与嫌疑人，随机的人物性格，随机的真相。虽然因为在学校，没有什么太过恶性的案子，但一周也有两三件，学校灵异传说、教具丢失、风纪审查……全都得由你们学生会六个人解决！\n\n我是不是还没说，指导老师一开始就告诉你了，你们当中有一个是叛徒？\n\n所以，拜托，与部下们谈心，调教手下，搜刮储藏室，发布号令，解决案件，挽回学校声誉，找出内奸，预防破坏，顺藤摸瓜，找出幕后黑手，周旋、毁灭，顺利毕业。\n\n如果可能的话，在刷部下好感度的同时，在五个人里面给自己找个对象吧。", "timestamp_created": 1508636529, "timestamp_updated": 1508636647, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.609208", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35316578": {"recommendationid": "35316578", "author": {"steamid": "76561198047452208", "num_games_owned": 62, "num_reviews": 2, "playtime_forever": 2501, "playtime_last_two_weeks": 0, "last_played": 1508379818}, "language": "english", "review": "I've gone through this game so many times, and it doesn't get boring. \n\nThis is the kind of game I'd see and ask the developers to \"do this. But more.\"\n\nThe gameplay is repetetive at times (esepcailly after a few playthroughs), but the unique bits here and there make it fun. \n\nThe game's perfect at what it does, so much so that the only way to \"improve\" it would be to have MORE of it. The gampeplay and style is wonderufl, I just wanted more to go with. Like:\n\n-I would have loved to make my own conspiracies, to suit my own agendas.\n-I would have loved to use the Red Mask Society more fully. \n-I would have loved random events that threw a wrench in the works (ex: oh, the closet is locked- because that girl you harassed for no reason got really ticked at you, and jammed the door. Or because two students are making out in there.\n-I would have loved random supernatural of sci-fi occurences to pop up (like, the girl you sent into the steam tunnels developed faint powers. I always laughed imagining Thais harassing a student, only to find them unnaturally obedient. Or Vonne shadowing a student, but finding herself LITERALLY shadowing them. \n-I would have loved for the girls to change based on how you statted them. For Thais to appear more dominant, Rowan to appear more... Stealthy? Darker, more plain clothes. For Mallory to look more friendly, if possible (I also would have LOVED to see what happened if you made her more dominant. Haha). Not even big changes, just subtle things to say \"yup. This is me now.\"\n\n\nBut honestly? I love this game. I hope a V2 or a sequel or something pops up in time, because I would buy it in a heartbeat. \n\n\n\n", "timestamp_created": 1506729760, "timestamp_updated": 1506729760, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.636194", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35117936": {"recommendationid": "35117936", "author": {"steamid": "76561198051847235", "num_games_owned": 126, "num_reviews": 12, "playtime_forever": 439, "playtime_last_two_weeks": 0, "last_played": 1505596672}, "language": "english", "review": "I love this. I get to be Blair Waldorf. My dream come true", "timestamp_created": 1506044933, "timestamp_updated": 1506044933, "voted_up": true, "votes_up": 2, "votes_funny": 4, "weighted_vote_score": "0.454777", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34794316": {"recommendationid": "34794316", "author": {"steamid": "76561198055031802", "num_games_owned": 274, "num_reviews": 5, "playtime_forever": 647, "playtime_last_two_weeks": 0, "last_played": 1479521366}, "language": "english", "review": "Loved this game. \n\nGenuinely unique with a cool detective mechanic. Lots of characters with both romantic and friendship routes, meaning you can find a route that makes sense for the character. Also has a golden perfect ending, which is much appreciated.", "timestamp_created": 1504790698, "timestamp_updated": 1504790698, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.588728", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34471459": {"recommendationid": "34471459", "author": {"steamid": "76561198099290840", "num_games_owned": 114, "num_reviews": 29, "playtime_forever": 103, "playtime_last_two_weeks": 0, "last_played": 1503412226}, "language": "english", "review": "HARD! I have to replay because I failed so bad. This game kicked my ass and I liked it.", "timestamp_created": 1503624927, "timestamp_updated": 1503624927, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.563682", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33898180": {"recommendationid": "33898180", "author": {"steamid": "76561198115120642", "num_games_owned": 193, "num_reviews": 21, "playtime_forever": 3229, "playtime_last_two_weeks": 0, "last_played": 1488753601}, "language": "english", "review": "[i]Black Closet[/i] has a compelling story and fun, though sometimes frustrating, gameplay. Its only real weakness is the element of random chance in its design; every so often there will come a playthrough that just blitzes you with cases too hard for you to survive, and there's nothing you can do about it. It's not that big a deal, but it can be frustrating. Both sets of art are okay, with the best images being reserved for [spoiler]Vonne losing her god-damned mind,[/spoiler] which never fail to crack me up. If you like the idea of managing shenanigans at a school for crazy rich kids, having minions to harass and inconvenience people, and optionally young women kissing other young women on the lips and stuff, you will enjoy this game.", "timestamp_created": 1501396067, "timestamp_updated": 1501396067, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502262", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33739667": {"recommendationid": "33739667", "author": {"steamid": "76561198008936601", "num_games_owned": 216, "num_reviews": 7, "playtime_forever": 409, "playtime_last_two_weeks": 0, "last_played": 1481634812}, "language": "english", "review": "And interesting puzzle game with great dialogue and fun characters. The majority of gameplay is procedurally generated, so the late game can get a bit tedious, but story missions and character interactions come around with such frequency that you rarely have time to get bored.\n\nIf you're looking to buy into a fantasy and get emotionally attached to characters, I highly recommend this game.", "timestamp_created": 1500800701, "timestamp_updated": 1500800701, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33637790": {"recommendationid": "33637790", "author": {"steamid": "76561198067189801", "num_games_owned": 284, "num_reviews": 96, "playtime_forever": 2158, "playtime_last_two_weeks": 0, "last_played": 1500340485}, "language": "english", "review": "Another excellent game by Hanako Games. I really enjoyed it.\n\nPros:\n- Addictive gameplay (solving mysteries simulation)\n- Encourages critical thinking\n- Beautiful, gorgeous CG art\n- Two sets of art styles (note: you don't actually have to play each path twice; you can just use the mouse scroll to go back, change the art style, and get both sets of a character's CGs in one playthrough)\n- Excellent writing\n- Great character development\n- Yuri romances (it takes place in an all-girls school)\n- People of color representation, such as the protagonist being black, Vonne being (partially Japanese?) Asian, and Rowan being partially Native American\n- Various difficulty settings, so those who like more of a challenge and those who like casual gaming both could enjoy the gameplay\n\nCons:\n- Blocky, unappealing standard character art for the first art type; the second art style's standard character art is nice though\n- A couple of mystery cases were really difficult to figure out, no matter how many times I had a chance to solve them (maybe I'm just too dumb though? :P )\n- Fighting the \"boss\" (the game's true villain) can be a bit tedious, especially in later playthroughs; I feel like her having 100 in all stats is a bit much\n\nI definitely recommend this game for those who enjoy sim games, VNs, and yuri romances!", "timestamp_created": 1500410432, "timestamp_updated": 1500410432, "voted_up": true, "votes_up": 28, "votes_funny": 1, "weighted_vote_score": "0.725000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33548193": {"recommendationid": "33548193", "author": {"steamid": "76561198064943860", "num_games_owned": 159, "num_reviews": 6, "playtime_forever": 199, "playtime_last_two_weeks": 0, "last_played": 1498284043}, "language": "english", "review": "Entertaining yet relaxing. I really love Hanako Games.", "timestamp_created": 1500079301, "timestamp_updated": 1500079301, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.385048", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33452601": {"recommendationid": "33452601", "author": {"steamid": "76561198044726835", "num_games_owned": 140, "num_reviews": 13, "playtime_forever": 491, "playtime_last_two_weeks": 0, "last_played": 1499769129}, "language": "english", "review": "Graphic is good. Game play not so good.\n\nBe warn that this is not a detective game.\nGlad That I got this game on sale.\nYou need some amount of reasoning. \nHowever, you relied most on the stat of your team and a die.\n\nYou will done the same mission over and over with some twisted here and there.\nIt's just not interesting enough.", "timestamp_created": 1499768831, "timestamp_updated": 1499768831, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.389552", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33412445": {"recommendationid": "33412445", "author": {"steamid": "76561198074691072", "num_games_owned": 267, "num_reviews": 51, "playtime_forever": 1225, "playtime_last_two_weeks": 0, "last_played": 1498309669}, "language": "russian", "review": "Black Closet отлично сочетает в себе сразу несколько жанров: это и детектив, где на протяжении всего повествования пытаешься угадать сначала предательницу, а потом и её нанимателя; и менеджмент, в котором мы управляем своими помощницами, в попытках уберечь школу от скандала; и, конечно, симулятор свиданий с симпатичными девочками. Всё это помогает лучше вжиться в роль нашей героини - Эльзы - старшеклассницы элитной и закрытой женской школы - девушки, которая неожиданно для себя получает один шанс на миллион и становится президентом школьного совета. Вряд ли она понимала сколько всего готовит для неё эта работа...\n\n[b]Часть 1: детектив.[/b] Главная роль президента школьного совета - сохранение репутации школы. Любой ценой. Если эту репутацию не беречь, Эльзу выкинут из школы с такими рекомендациями, что путь ей будет заказан в любое приличное заведение. Так что по ходу сюжета быстро приходишь к компромиссу со своими убеждениями и начинаешь выживать - шпионить, доносить, угрожать, вламываться в чужие комнаты, читать личные дневники и переписку, даже исключать слишком упрямых учениц. К каждой девочке нужен свой подход - начнёшь угрожать без доказательств и она замкнётся, да ещё и наговорит о тебе всякого. Будешь слишком мягкой и не успеешь расследовать дело вовремя. \"Дела\" здесь генерируются автоматически, поэтому заранее узнать виновницу не получится - игра каждый раз проходится как первый. И, помимо стандартной подпольной работы школьного совета, в ней есть ещё один сюжет - кто-то хочет разрушить вашу школу, среди помощниц есть предательница, которая работает на злоумышленника. Но кто это? Вычислить волчицу в овечьей шкуре и виновника всех бед школы и предстоит Эльзе на её последнем году обучения. Отмечу, что предательница выбирается случайным образом в начале игры, так что узнать её один раз и потом безошибочно делать правильный выбор во всех прохождениях не получится.\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=920084382\n\n[b]Часть 2: менеджмент.[/b] Президенту школьного совета не пристало самой марать руки, так что для расследования происшествий и поиска врагов у вас пять помощниц - девушек с очень разными способностями и характерами. Несмотря на их различия и, иногда, протесты, все миньоны будут прилежно выполнять ваши приказы. Ну, почти все - вы же не забыли о змее, что пригрели на груди? \nДевочек можно отправлять на задания, тренировать, чтобы улучшить их способности, и отправлять в кладовку за бустерами, которые на один ход усилят их характеристики. Если заставлять их работать слишком много, они устанут и пропустят следующий день из-за стресса. Лучше всего сразу решить, кто будет в вашей команде и целенаправленно вкладываться в развитие именно этих персонажей. Для основной игры вполне достаточно троих: так называемой social butterfly - общительной и легко сходящейся с людьми героини; задиры, способной запугать тех, кто не идёт на контакт; и шпионки, которая наблюдательна и умеет оставаться в тени, когда необходимо. Очень желательно кого-то из этих троих сделать своим другом или возлюбленной и прокачивать её лояльность - пригодится к финалу.\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=950035108\n\n[b]Часть 3: симулятор свиданий.[/b] Как я уже говорила выше, у вас пять помощниц с самыми разными характерами, целями и представлениями об идеальных отношениях. Не все из них жаждут вашего внимания - кто-то вполне может дать Эльзе от ворот поворот, кто-то за открытые отношения и не собирается клясться вам в вечной любви. Что мне понравилось: девочки цельные и остаются таковыми в отношениях, не меняются ради главной героини. Свободолюбивая Алтея, серьёзная и неожиданно мечтательная Вонн, амбициозная Таис, солнечная Меллори, чертёнок в тихом омуте Рован - все они очень разные и хранят своих скелетов в шкафах, которые открываются только если узнать их получше. Сам процесс узнавания неплохо выстроен - здесь нет неожиданных \"Я знаю тебя три дня, но готова любить всю жизнь!\", события развиваются медленно и естественно. И да, Эльза и выбранная девушка с большой вероятностью перейдут к более активным действиям, чем поцелуи, а игра покажет нам соответствующую CG.\n\nПодводя итог, рекомендую ли я Black Closet? Да, если вам нравится юри, и да - даже если не нравится, но вы любите таинственные истории, разгадывать загадки и вам хочется пообщаться с интересными персонажами. В Black Closet много красивых символичных моментов и монологов, которые подойдут даже тем, кто никогда не учился в закрытой школе. Это не просто юрийный симулятор детектива - это история о власти, о том как остаться собой даже в самых тяжёлых обстоятельствах, о том, что не всем на словах желающим добра можно доверять, об искушении и борьбе с ним, о первой любви... Здесь каждый найдёт то, что по душе, потому что в Black Closet нет правильного пути. Есть путь, ведущий к победе. И он может быть очень разным.\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=954140649", "timestamp_created": 1499627694, "timestamp_updated": 1499628149, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.639621", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33303878": {"recommendationid": "33303878", "author": {"steamid": "76561198049422348", "num_games_owned": 69, "num_reviews": 19, "playtime_forever": 66, "playtime_last_two_weeks": 0, "last_played": 1479467462}, "language": "english", "review": "This game isn't really a detective game, even though it's about detectives. It was pretty interesting at first, but I was never interested to play it again after the first time.", "timestamp_created": 1499327659, "timestamp_updated": 1499327659, "voted_up": false, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.383247", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32821502": {"recommendationid": "32821502", "author": {"steamid": "76561198060946700", "num_games_owned": 158, "num_reviews": 14, "playtime_forever": 811, "playtime_last_two_weeks": 0, "last_played": 1508811668}, "language": "english", "review": "It has a tsundere", "timestamp_created": 1498494757, "timestamp_updated": 1498494757, "voted_up": true, "votes_up": 5, "votes_funny": 6, "weighted_vote_score": "0.364597", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "32715351": {"recommendationid": "32715351", "author": {"steamid": "76561198078492068", "num_games_owned": 255, "num_reviews": 7, "playtime_forever": 439, "playtime_last_two_weeks": 0, "last_played": 1504314835}, "language": "english", "review": "Black Closet is a strategy manager/mystery game with some visual novel elements that you can skip (though I recommend not doing so as the diologue choices are well fleshed out and make you feel like what you choose to say and do actually make an impact and give you a view into the characters.\n\nWhere to start with all the pros of this? Each mini mission is a little mystery of it's own, which while they each follow a set formula that you eventually get used to after seeing the scenario enough times, still is interesting to see if you can solve the mystery in time and who's behind it. Each of your 5 minions has stats that help them stalk, intimidate, interview, and persuade students as to not cause trouble and reveal important secrets that might jeapordize the reputation of the school. You'll sometimes have to expell or suspend a student (which so far I don't see much of a difference in game), though you can try and use detention or persuasion, but sometimes even then a student simply won't listen, and you'll have to discipline them.\n\nThere's also a lot of mystery involving the 5 main characters, your minions, or fellow student council members under your leadership, and the school environment. The characters each have their own unique personalities, and one of them is randomly selected each game to be a traitor in your group. They each have their own motivations, and it's up to you to find out who's the one sabotaging the council's work, earn their trust, and deal with them how you see fit. But the story doesn't end there either, that's only the beginning of the rabbit hole, the plot goes far deeper, even I haven't fully unraveled the mystery yet, but I'm hoping to when I get a full playthough.\n\nThe game also has a custom mode where you can design your own 5 custom minions with randomized stats, change their looks, and play the basic investigations for up to 16 weeks. While this mode has no traitor, it's fun if you like challenging yourself to solve the common issues that plague the school with your own custom designed and named students.\n\nFor negatives, my only negative is that the rules aren't always 100% clear, it took me a while to realize the symbols on the left of an option were your stats, vs the one on the right which were theirs. For example, stalking isn't about having a higher stalking score, it's about having a stalking score higher than their perception, and part of questioning a student is about your perception against their stealth. This could have been made clearer with a tutorial, but after a little while you get used to it. You eventually start to get the hang of it.\n\nI'd definately recommend this game for any fans of visual novels, strategy games, or mystery games. If you're not sure, wait for it to go on steam sale, but I personally found it was high quality, full of replay value, and kept me on my toes every time I played. Worth every penny to me.\n\nOverall, I'd give it a 9/10.", "timestamp_created": 1498289601, "timestamp_updated": 1498289601, "voted_up": true, "votes_up": 36, "votes_funny": 0, "weighted_vote_score": "0.820391", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32007506": {"recommendationid": "32007506", "author": {"steamid": "76561198001656726", "num_games_owned": 171, "num_reviews": 5, "playtime_forever": 538, "playtime_last_two_weeks": 0, "last_played": 1495925363}, "language": "english", "review": "I don't think Black Closet is a bad game. I mostly enjoyed my time with it. That said, I do find it has some pretty severe issues. It's similar to a a graphic novel in terms of length and writing quality, yet it's painfully short of good artwork. It's very short- which is good in that it doesn't overstay its welcome, bad in that I feel it doesn't quite justify its list price. It has a promise of replayability in its randomly-generated gameplay elements and different paths, but the game's core gameplay of handling cases becomes repetitive well before you even finish your first playthrough, killing all my interest in giving this a second playthrough- which begs the question of why even make randomly-generated cases in the first place.\n\nI don't regret playing this game; I think its positives outweight its negatives, and I had a good time overall. Its writing is pretty good. I just don't think it's worth the asking price; I'd be happier if I'd picked this up at 50% off.\n\nOh, and if you want to buy it for the Yuri elements? Don't. It has a few suggestive pieces of dialogue... and that's it. And by few, I do mean like 4 or 5 suggestive lines of text throughout the entire playthrough.", "timestamp_created": 1495926916, "timestamp_updated": 1495926916, "voted_up": false, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.552297", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31950897": {"recommendationid": "31950897", "author": {"steamid": "76561198034402880", "num_games_owned": 150, "num_reviews": 4, "playtime_forever": 707, "playtime_last_two_weeks": 0, "last_played": 1452114662}, "language": "english", "review": "+1", "timestamp_created": 1495716004, "timestamp_updated": 1495716004, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.373352", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31334342": {"recommendationid": "31334342", "author": {"steamid": "76561198256913998", "num_games_owned": 164, "num_reviews": 14, "playtime_forever": 1274, "playtime_last_two_weeks": 0, "last_played": 1479833091}, "language": "english", "review": "Great lesbian dating sim with detective elements :)", "timestamp_created": 1493015067, "timestamp_updated": 1493015067, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.496640", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31266555": {"recommendationid": "31266555", "author": {"steamid": "76561198117493929", "num_games_owned": 255, "num_reviews": 40, "playtime_forever": 1034, "playtime_last_two_weeks": 0, "last_played": 1474032066}, "language": "english", "review": "This game is pretty freaking cool It has some of the best female characters I've seen, a pretty awesome protagonist, diversity and the gameplay is simple but challeging and demands order and strategy. The routes of different characters are so cool and dialogue is always a pleasure to read. Also, the art is BEAUTIFUL. BEAUTIFUL. \n\nHowever, fair warning, you can't have a romantic involvement with all the female characters in this game. I think that's fair to say, since it's the kind of game in which you would expect romance in all its routes but nah. It's impossible to get a romantic ending with many characters. Some might be straight, some might be too young for you. The point is that a good ending with one of the characters isn't necessarily a romantic ending. This is a game more focused in each character personal dramas - usually conected to their careers - than anything. \n\nAnyway, it is a fairly challenging game with pretty good story elements and I recommend it for sure.", "timestamp_created": 1492737917, "timestamp_updated": 1492737917, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.541184", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31205184": {"recommendationid": "31205184", "author": {"steamid": "76561198038943797", "num_games_owned": 127, "num_reviews": 14, "playtime_forever": 1056, "playtime_last_two_weeks": 0, "last_played": 1492478040}, "language": "english", "review": "Oh man, this game.  It seems like a kinda-normal high school novel type adventure, and then the knives come out.  You are basically responsible for running your own little branch of the CIA, and keeping things in check in an authoritarian boarding school.  You have your minions with different skills, some are good at intimidation and enforcement, others at wheedling and questioning, others at stealthily breaking into places and quielty rifling them for incriminating evidence.  And then you apply those minions to unraveling a continual stream of plots and threats.  Oh, and absolutely everyone is screwing over everyone else.  And the ones who aren't, are loveably messed up in the head in their own way. :)  \n\nTwo-thumbs up, would never trust anyone again.", "timestamp_created": 1492455286, "timestamp_updated": 1492455286, "voted_up": true, "votes_up": 7, "votes_funny": 2, "weighted_vote_score": "0.576257", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30812027": {"recommendationid": "30812027", "author": {"steamid": "76561198095204875", "num_games_owned": 146, "num_reviews": 19, "playtime_forever": 367, "playtime_last_two_weeks": 0, "last_played": 1490262522}, "language": "japanese", "review": "生徒会長となり、毎週発生する事件を解決していく話です。\n学内の事件なので、騒音で眠れない、試験結果が悪い、仲が悪いといった感じです。秘密の組織があるみたいのもありました。ストーリーモードでも\n起こる事件はランダムなので、難しいときは事件の2-3週前からやり直すといいと思います。\n自分で解くと言っても、生徒会の他のメンバーを関係の場所に派遣するか、\nやはり他のメンバーが当事者に事情聴取や備考するだけなので、\n解けないときが多いです。\nしかも時間経過で解決するものや重要でないものあります。\n基本的には毎日、生徒会のメンバーに事件を分担して、結果のダイス判定になります。\n週末はメンバーの1人を選んでイベントで忠誠心を上げていくイベントが2回あります。\n事件に期日がありますが、解決出来ないとどんどん溜まるので、\n人が足りなくなります。メンバーもストレスが溜まるので毎日は使えないし毛結構厳しいです。\n他にも生徒会のカルマや学校の評判もあり、0になるとゲームオーバーです。\nストーリーモードでは、これ以外に大筋のイベントが決まった日にあり、\n色々起こります。こちらのイベントはランダムではありません。\n生徒会のメンバーは、個性的で調査の向き不向きもあります。\n彼女たちとのイベントも楽しいです。\nしかも1回見たものはスキップ出来るので、繰り返しプレイし易いです。\nゆりバンドルになっていますが、それほどでもないと個人的には思います。\n女子校ではありますが、あまり過剰な期待は禁物って感じです。\n逆に推理物って言えるほどの謎でもありません。\n似ているゲームは思いつかないですが、\n軽いアドベンチャーのあるテキストゲームです。\n面白いとは思いますが、定価だと少し高い感じです。\n気になる人はセールで1000円以下ならいいかなと。\n", "timestamp_created": 1490789198, "timestamp_updated": 1490789198, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.665823", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30537713": {"recommendationid": "30537713", "author": {"steamid": "76561198213359933", "num_games_owned": 52, "num_reviews": 21, "playtime_forever": 2414, "playtime_last_two_weeks": 0, "last_played": 1489856487}, "language": "english", "review": "At first, the looks of this game put me off (it looked more like solitare than a vn-based game) but this game has a lot of depth! Very detailed and clever storylines, well written-characters and the randomnisation elements for each game makes it challenging to complete the game. A very entertaining game - if you want to buy it, it would suggest wait for a sale at the price tag is a bit high but its def worth checking out!", "timestamp_created": 1489649982, "timestamp_updated": 1489649982, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30534177": {"recommendationid": "30534177", "author": {"steamid": "76561198011548001", "num_games_owned": 254, "num_reviews": 36, "playtime_forever": 568, "playtime_last_two_weeks": 0, "last_played": 1489642174}, "language": "koreana", "review": "학생회장이 되어서\n임원들을 동원해 각종 사건사고를 정신없이 해결하는 게임. \n그 와중에 배신자가 있어??!?\n\nLong Live The Queen도 재밌게 했었는데 같은 개발사인듯.\n\n사건이 발생하면 임원들을 동원해서 \n관련 인물들에게 질문을 하거나 괴롭히거나 스토킹해서 정보를 얻고, \n장소를 탐색하거나 지키거나 감시하거나 등. \n얻은 정보에 따라 설득, 정학, 퇴학등을 시킬 수도 있음.\n\n4가지 능력치가 있는데 행동마다 영향을 주는 능력이 다르고,\n사건을 해결하면 포인트를 얻어서 성장시킬 수 있음. \n1회용 아이템도 있고, 스트레스도 있어서 조끔 복잡함.\n\n미연시처럼 부하들과 대화하고 호감도 올리고 그런 것도 있는데, \n이쪽은 시스템은 단순하지만 컨텐츠는 그럭저럭 괜찮은 느낌.\n\n설정이나 시스템은 매력적인데, \n한 번 엔딩보기까지가 꽤 길어서 \n여러 번 반복하기에 부담인게 아쉬운 부분.", "timestamp_created": 1489624719, "timestamp_updated": 1489624719, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.509804", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30397543": {"recommendationid": "30397543", "author": {"steamid": "76561198039156043", "num_games_owned": 79, "num_reviews": 10, "playtime_forever": 556, "playtime_last_two_weeks": 0, "last_played": 1489163649}, "language": "english", "review": "weird but fun", "timestamp_created": 1489004625, "timestamp_updated": 1489004625, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.499775", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30046839": {"recommendationid": "30046839", "author": {"steamid": "76561198009986252", "num_games_owned": 982, "num_reviews": 65, "playtime_forever": 741, "playtime_last_two_weeks": 0, "last_played": 1488006325}, "language": "english", "review": "This is a surprisingly challenging game. Part visual novel, part strategy/management/detective game. It's that team management element that really helps Black Closet stand apart from the crowd, and it's quite enjoyable.\n\nIt is rather unforgiving though. I've played through it twice now, the first time I got a game over by having too low of a reputation after failing multiple events. The second time I found the option in the menu to change the difficulty down to \"Easy\", which helped immensely in my ability to actually progress through the full game. At the end however, I still ended up failing as I did not manage to complete a particularly difficult and crucial mission within the game's alloted timeframe.\n\nHowever I enjoyed the time playing and intend to go back and try again now that I have a better idea of the kinds of skills I will need to focus on for my \"minions\" aka student council members. That's arguably one of the strong and weak points of the game: lots of trial and error, and sometimes there are head-scratcher moments where things just work out differently than you had expected them to.\n\nThere is somewhat of a random element to the experience as well, ensuring that each playthrough is never quite the same as the others, though the randomness is only to a point because you will start to pick up repeating patterns after awhile in some cases.\n\nThe visuals and music are both well done, and like most of Hanako Games' releases, the presentation is top notch for this genre.\n\nIf you're looking for a VN with a bit of bite to it in the difficulty levels, or just one that has some unique gameplay elements to it, definitely give Black Closet a try.", "timestamp_created": 1487547107, "timestamp_updated": 1487547273, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30026316": {"recommendationid": "30026316", "author": {"steamid": "76561198052178797", "num_games_owned": 143, "num_reviews": 43, "playtime_forever": 543, "playtime_last_two_weeks": 0, "last_played": 1490340692}, "language": "english", "review": "In this game, you're the head of an anime-style absurdly powerful student council out to ensure no harm comes to your boarding school's good name, whether that be girls starting the place on fire or political riots on campus. You must rely on your five underlings to carry out your orders, but one is a traitor.\n\nWhat follows is an engaging game where you simultaneously must manage your minions effectively while looking for clues as to who the turncoat could be. Gameplay is randomized, but in a good way- you might get the same \"case\" (i.e. \"Somebody's starting a secret society\") twice in one playthrough, but the solution might be different (stalk and intimidate members into disbanding, discover a slave trading ring on campus, find out it was all a harmless prank). The girl who's the traitor is always different, too, meaning you can't just look it up in five seconds but must suss out clues from their performance in the field. It's a bit like being a police chief, except your most powerful tool for getting rid of miscreants is expelling them, not gunning them down. It grounds the experience a little. I kept being reminded of the distraous This Is The Police, which aimed big and fell flat on its face. This one keeps the scope smaller and more contained, letting it deliver a more focused experience. Make no mistake though, it's not as short as you might think- the game initially lulls you into thinking you just need to catch the traitor in a little over an in-game month, but there's much more to do and more petty criminals to apprehend.\n\nThere's a surprising amount of replayability, since the tratior can vary and every one of your loyal or disloyal minions has skeletons in her closet, and a few can be courted for some (TAME) girl-on-girl sweetness. Even beyond that, the game lets you set up custom campaigns with your own created minions after your first playthrough.\n\nIn conclusion, the mini-mysteries are engaging, the visual novel style interactions with your underlings are well-written, and you can beat the game (kind of) by seducing the final boss. This is a short, neat game I'd recommend for those who like managing limited resources and solving mysteries. There's a surprisingly meaty game here. I continue to be impressed by how well Hanako Games pulls off seemingly cliched ideas into compelling, twisted packages.", "timestamp_created": 1487483079, "timestamp_updated": 1487483079, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.508081", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29890017": {"recommendationid": "29890017", "author": {"steamid": "76561197960279937", "num_games_owned": 575, "num_reviews": 55, "playtime_forever": 294, "playtime_last_two_weeks": 0, "last_played": 1486624611}, "language": "english", "review": "Not a perfect game but it's got a lot of promise.\n\nI love games centered around intrigue so the idea of managing Minions to go about completing tasks while knowing that one of them is a traitor and I'm trying to figure out who they are hits me in a bunch of the right places so I knew I had to give this game a try.  Overall, the game is decent if very repetitive by the last third of the game or so.  It's missing like... 4-5 more case types.  Also, I'd love to see more continuity between cases outside of the main storyline cases and maybe the ability to recruit more minions over the course of the year.\n\nThe tutorial could have been a little bit longer or certain mechanics explained a little better (Loyalty, for example, was something I never figured out on my first playthrough)... but with that said, getting over that learning curve seems to be intended for your first time through so... meh vOv\n\nThe Traitor section does not last long enough and gets resolved very quickly which kind of threw me when you look at the focus it gets in the game's blurb.  Also, it's a game over if you pick incorrectly, which is definitely a missed opportunity.  Losing a loyal minion while the traitor sticks around all running amok sounds like a neat challenge while also giving you a second opportunity to turn them to your side... so not having that as an option is too bad.\n\nThe writing is good.\n\nThe Art is passable.  \n\nI didn't listen to the music, so I can't comment on that.\n\nI'd say... grab it while it's on sale.  The game is okay right now but can easily get way better over time.  The developers seem to be pretty active so that may actually happen.", "timestamp_created": 1486957043, "timestamp_updated": 1486957043, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29889316": {"recommendationid": "29889316", "author": {"steamid": "76561197996255059", "num_games_owned": 105, "num_reviews": 17, "playtime_forever": 646, "playtime_last_two_weeks": 0, "last_played": 1504235115}, "language": "english", "review": "Black Closet is what you get when you mix up Maria-Sama Ga Miteru with Floor 13. And Hanako Games did a good job on that.", "timestamp_created": 1486954715, "timestamp_updated": 1486954715, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.547325", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29823348": {"recommendationid": "29823348", "author": {"steamid": "76561198248105534", "num_games_owned": 174, "num_reviews": 37, "playtime_forever": 318, "playtime_last_two_weeks": 0, "last_played": 1480268609}, "language": "spanish", "review": "El juego es entretenido, nada sencillo de completar, tiene una muy buena historia, el arte es una enorme mejora con respecto a anteriores obras, y muy bueno en general, al punto que a veces quieres detenerte sólo para ver el nivel de detalle de los sprites y las escenas.\n\nEl mantener a flote la reputación de tu colegio es más complicado de lo que se piensa, en especial cuando hay un misterio más grande aún por ahí, listo para hacer explotar todo. Y querida, que el que no te apoyen en entrar a la universidad que quieres puede no ser lo más grave de todo.\n\nEste juego es, como muchos de Hanako Games, una sorpresa respecto a qué es, y cuáles son sus mecánicas. ¿Un simple juego de gestión, con algo de novela visual? Oh, no has siquiera rascado la superficie. Puede ser fácil aprender cómo jugar, pero ganar es otro tema diferente. No es fácil llegar al final del juego, ir a la universidad, mantener con aire respetable a la escuela y salir airosa.\n\nLa diversidad de personajes me gusta. La protagonista es una mujer de color, lesbiana, y en una posición de poder. Hay chicas a las que les gusta el maquillaje y la moda, otras que prefieren ser más sutiles, una más abierta respecto a sus intereses románticos y con poco interés en encaje y maquillaje, otra que viene de otra escuela y trata de adaptarse, y la última tiene un trasfondo interesante con la protagonista. Es tan refrescante poder disfrutar un videojuego en donde hay personajes, protagonistas, lesbianas, diversidad de etnias y motivaciones. Y este es otro punto fuerte de Hanako Games: la diversidad.\n\nSí, vale la pena, y sí, te llevarás más de una sorpresa.", "timestamp_created": 1486732895, "timestamp_updated": 1486732895, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29798857": {"recommendationid": "29798857", "author": {"steamid": "76561198059140558", "num_games_owned": 573, "num_reviews": 7, "playtime_forever": 254, "playtime_last_two_weeks": 0, "last_played": 1512282706}, "language": "english", "review": "Most people's first impression is that this game is a visual novel with an investigation mechanic hammered in, it was definitely my first impression. Then I noticed the developer, Hanako Games, also made Long Live the Queen (another excellent game that fuses strange mechanics with dating sims) this alone was enough to make me buy it on impulse. \n\nOn startup, I was immediately impressed with the game. You run the student council at a prestigious all girls school. The store page labels it as a yuri dating sim, but so far I haven't seen much of that. What you should be paying attention to is the brilliant investigation mechanics. Each day of the week you assign each of your \"minions\" to do something, be it interrogate another student, investigate a location, search for an item, etc etc. These encounters play through much like a tabletop RPG or board game since they are all decided with a die roll and stat bonuses.\n\nAll of the cases are randomly generated. This includes the perpetrator and even the people in cases, meaning you'll never have the same case twice. On rare occasions, cases will even solve themselves, some might think this is kind of a dumb thing to have, but I like it. logically, a school can't have that many mysteries without some of them just being coincidences, and the game can get very tight with time even with these self solving cases\n\nThe plot was interesting with many paths to follow, but my favorite part so far has been the introduction of a traitor. One of your minions will occasionally fail on purpose and in general try to stop you, but you have no idea which minion this is and you are put on a clock to find them or risk losing the game entirely. \n\nAll in all, I found the game to be very well done, I'd highly recommend it.\n", "timestamp_created": 1486636846, "timestamp_updated": 1486636846, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29787179": {"recommendationid": "29787179", "author": {"steamid": "76561197998827138", "num_games_owned": 675, "num_reviews": 152, "playtime_forever": 341, "playtime_last_two_weeks": 0, "last_played": 1479395736}, "language": "english", "review": "It's a mix of Adventure/Visual Novel with a board-game style detective game. Managing your minions is fun, and your successes or failures can lead to multiple different outcomes.\n\nWould love for it to have a little bit more variety in the random cases you get, but still: pretty good and rather unique game.", "timestamp_created": 1486579634, "timestamp_updated": 1486579634, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.536907", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29391885": {"recommendationid": "29391885", "author": {"steamid": "76561198128704797", "num_games_owned": 484, "num_reviews": 59, "playtime_forever": 2105, "playtime_last_two_weeks": 0, "last_played": 1454684764}, "language": "english", "review": "Hanako Games continues to release brilliant games and Black Closet is no exception. In this newest release, you take on the role of Elsa, the newly elected class president of St. Claudine's (a private girls' school), and it is your job to solve various cases presented by students and faculty. Otherwise, scandals could break out and ruin the school's reputation and/or the students' trust in you. Along the way, you learn that there is a traitor among your minions (one of five students who will help you to solve cases) whom you have to discover and either you can befriend them or expose them. \n\nOf course, there is more than simply solving cases and such. As there are five minions who will work for you, there are five paths that you can pursue. Three of these are romanceable while two are more friendship paths (although it's interesting to see what unfolds if you try to pursue romance with those paths). Although I enjoyed trying out all the paths, I preferred the friendship paths but this may be more of a personal preference than anything else.\n\nIn regards to the gameplay, I enjoyed it very much. I loved solving the various cases given and even when you may be given the same type of case, it may not be solved in the same way as a previous playthrough. Thinking through the cases and finding out the best and most efficient way to solve them is key to earning the best case grades and accompanying skill points with which you can use to train your minions to be better at certain skills, such as observation and stealth.\n\nThere are a total of 16 achievements that you can earn so there's definitely a lot of playability to be had in Black Closet. Also, there are two art sets (for both CGs and character sprites) so if there's one that you prefer over the other, you can choose to your heart's content. Even after you earn all the achievements and finish all the character paths, there is still replayability to be had. There is a customized mode where you can add in and/or design your own minions and determine their skill values and set the number of weeks within which you wish to solve cases. \n\nBlack Closet is such a wonderful game and I would highly recommend it to anyone who's a fan of Hanako Games or even if you're a fan of VNs and life sims. There are VN aspects in this game as well as the element of solving cases. It's a great game to have and I have to say that now I'm having difficulty determining if I like Black Closet or Long Live the Queen, as the latter was my favorite game before Black Closet's release. ^^", "timestamp_created": 1484983596, "timestamp_updated": 1484983596, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.509804", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29373585": {"recommendationid": "29373585", "author": {"steamid": "76561197970563863", "num_games_owned": 447, "num_reviews": 19, "playtime_forever": 806, "playtime_last_two_weeks": 0, "last_played": 1486643162}, "language": "english", "review": "It's your final year at St. Claudine's and you're the president of the student council. For some reason this involves a lot of questioning, harassing students, being in charge of detaining, suspending or even as last resorts, expelling them and breaking into their rooms. Every few days you're assigned new cases which can be as simple as students losing stuff, to runaways, illegal moonshine stills, food poisoning, etc. \n\nTo help you in this you have a bunch of minions. Match their strengths to what's required out of the case. Some cases are more complicated than others, like you might need to uncover two test sheets in two different students' rooms, or interrogate 5 different suspects to assemble a picture of what actually went down then mediate between the offended parties. Sometimes you dont need to do a thing, but not resolving a case doesnt give you training points, and failing a case badly can be costly. With training points you can make people multitaskable, or you can push some minions into ludicrous skill zones, both of which are useful. Raiding the supply closet can help you with skill boosting equipment. Dont mind all those sedative syringes in the closet.\n\nAlso one of your minions is a dirty filthy traitor! It's up to you to examine their performance, like if they're failing simple tasks and their success rates are far below everyone else's. That's just one of the long term goals you're working towards. \n\nYou also have direct character interaction with your minions, building up their loyalty with outings and meetings. You may even romance one of them! Or remain platonically friends, no judgement here! There's very little minion to minion interaction for better or worse. This part of the game is where the VN heritage show through.\n\nAlso you can play with the game's original artwork but ahahahah why. The only thing that bugs me about the current artwork is Vonne's freaky side eye. Otherwise it's all pretty lovely and/or functional. \n\nOverall I really enjoyed it. I'm not entirely convinced the visual novel and the minion management parts of the game mesh together well, but it's still enjoyable mostly. It's RIDICULOUSLY HARD though even on easy, but it's probably because I chose to SMASH THE SYSTEM which is the hardest of all the routes. Once you've finished and want to see the other stuff, you can cheat yourself up, hooray!\n\nRating: Hell yeah!", "timestamp_created": 1484911698, "timestamp_updated": 1484911698, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.637625", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29228860": {"recommendationid": "29228860", "author": {"steamid": "76561197994215424", "num_games_owned": 148, "num_reviews": 18, "playtime_forever": 663, "playtime_last_two_weeks": 0, "last_played": 1483834916}, "language": "english", "review": "Black Closet is part visual novel, part detective story, and all student council politics. The basic gist is that you're stepping into the shoes of Elsa, the new student council president, at what is possibly the most backstabbing and chaotic private school ever. You'll have to stay on top of the mysteries with the help of your minions, characters who you can send to question, stalk, bully, and basically function as your own private Stasi. One of them, however, is a traitor (randomly chosen at the beginning of each game), and discovering who that is creates the very first big branching choice of the game.\n\nSo positives first! \n+The story is intriguing, and since you can't see all the branching paths in one go...\n+ There is some definite replay value. \n+The gameplay is simple and you'll pick it up fairly quickly.\n+The cases are randomized, so you'll never see exactly the same one.\n+The art style is appealing and a huge improvement on what it was originally.\n+The music and atmosphere creates a surprising amount of tension.\n\nBut there are some negatives:\n-It's a short game. You can probably beat it in under 3 hours easily.\n-The cases are randomized, but you'll start to notice the same basic structure of each one quickly.\n-It's expensive. I played 4 games for a total of 11 hours and bought it for $10.50.\n\nAll in all I'm happy that I got it, but it's one of those games where it's difficult to recommend to people unless it's their particular cup of tea. I say get it on sale and play it for an hour or two. You'll know if you want to keep it very quickly!", "timestamp_created": 1484330139, "timestamp_updated": 1484330139, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29146221": {"recommendationid": "29146221", "author": {"steamid": "76561198219306591", "num_games_owned": 15, "num_reviews": 2, "playtime_forever": 705, "playtime_last_two_weeks": 0, "last_played": 1483985106}, "language": "english", "review": "This game was a great deal of fun.  I found it had far, far more depth than I at first supposed.  The story branched nicely and the elements which are expertly randomized make for a surprising degree of replayability- I will definitely be playing this again soon.  The romantic aspects of the story were also greatly appreciated. The game was more challenging than I expected too with an interesting end boss scenario. Taken all together, I can recomend this game whole heartedly.", "timestamp_created": 1483985423, "timestamp_updated": 1483985423, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29097517": {"recommendationid": "29097517", "author": {"steamid": "76561198139328230", "num_games_owned": 1838, "num_reviews": 218, "playtime_forever": 2236, "playtime_last_two_weeks": 0, "last_played": 1483817161}, "language": "english", "review": "[b]\"I rank myself no higher in the scheme of things than a policeman - whose utility would disappear if there were no criminals.\" - Lord Salisbury[/b]\n\nWhen I chose to give [i]Black Closet[/i] a go, I already had my fair share of experience with Hanako Games - more than enough to declare them to be a spectacular name in Visual Novel genre. I expected no different from this title, and as always, Hanako Games delivered. I'm happy to declare that [i]Black Closet[/i] is a wonderful combination of an investigation/source management game with a truck load of stories and intrigue attached to it! If this sounds like your cup of tea, you really shouldn't even wait for the rest of the review. Go for it! For ones who'd be a bit more skeptical and wish to take note of a long list of praises, you are welcome to keep reading.\n\nIt's the beginning of another school year in the highly prestigious all-girls academy of St. Claudine's. Daughters of the rich and the famous are taken in from a young age to be properly educated in all manner, to guarantee a position of power for their future here, and it is going to be your job to keep them in line for the rest of the year. We are to take the role of Elsa, a senior high-schooler and the president of the student council, with a seemingly bright future ahead of her. Sadly, that can change any minute now in St. Claudine's! It is going to be our trial to keep the girls of St. Claudine out of trouble, investigate a mystery or two, and while doing so chase some yuri romance path as flavor. Don't be deceived though; the scene of power starts early here, and any scheme could end with a ruthless execution if you are not careful!\n\nOkay, it is basically [i]CSI[/i] meets [i]Gossip Girl[/i] with a touch of [i]The Tudors[/i] out there, so it might be useful to describe some game mechanics up front. You'll be given five minions to run through cases with different skill sets. Each week, there will be random cases, varying from a student struggling to keep her grades up to investigating a gambling ring in the school premises. The game generates cases completely randomly based on some basic templates, yet no mystery resolves the same as before. You'll be expected to investigate these cases by inspecting the area, talking to parties involved or resorting to some unsavory harassment tactics to gather information. Nothing will be beneath you, since you'll never know who'd be an innocent victim or who'd be a bored scammer. Your minions possess 4 investigative stats - social, intimidation, stealth and perception. For each action, you'll be required to make skill checks - a total of the attaining minions’ relevant skill, any item bonuses and the dice roll - opposing the required difficulty of the action, defined by all other relevant condition. Each resolved case will reward you with skill points, and each botched case will present... results. There are 2 other parameters that you should keep an eye on: school reputation and council karma. When they get low enough, you'll face real problems.\n\nAside its investigation gameplay and various short stories revolving around the cases, the setting itself is a rich melodrama. Each of your minions do possess a distinct personality with background, traumas, aspirations and struggles. They'll respond to you based on their characters and the way you've been treating them, and others around them. It is a challenging feat to keep everyone happy, when your own friends carry majestic egos themselves. Oh, and there will be a randomly picked traitor in your group in each gameplay too. So, good luck with each story path already. You'll be given the chance to befriend one of your minions a bit more closely than others in each gameplay, choosing her route to pursue her either as a close friend or a romantic interest. Combined with random case progression, this build presents you an incredible replay value.\n\nThe game comes with 2 different art styles - one sharp cornered, contrasting photo manipulation, one soft curved manga depiction - and both are simply gorgeous. As you play, you can acquire certain CGs in both art styles to complete a gallery containing depictions of possible important events. There is no voice acting, but the written narrative is so elegantly presented, you won't be actually missing any voice hanging around. Soundtrack is very simple and a bit repetitive, yet brilliantly fitting to atmosphere also. Oh, did I mention achievements yet? Yup, and some are a challenge to acquire, demanding multiple gameplays.\n\nNow my long list of praises is complete, please feel free to go ahead and purchase the game. Waiting a sale would help, yet it shouldn't be mandatory with this kind of quality in narrative, gameplay and replay value. You won't be disappointed if you've played anything from Hanako Games before hand. Enjoy!\n\nPlease also check out Lady Storyteller's Curator page [url=http://steamcommunity.com/groups/ladystoryteller#curation]here[/url] - follow for regular updates on reviews for other games!", "timestamp_created": 1483820341, "timestamp_updated": 1483824017, "voted_up": true, "votes_up": 42, "votes_funny": 0, "weighted_vote_score": "0.815100", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29046485": {"recommendationid": "29046485", "author": {"steamid": "76561197995051730", "num_games_owned": 215, "num_reviews": 27, "playtime_forever": 1446, "playtime_last_two_weeks": 0, "last_played": 1483624371}, "language": "english", "review": "Game Highlights: \n-\tHaving one of the [u]least[/u] obnoxious tsundere’s I ever saw.\n-\tMaking me feel like I need to take a shower after going the evil route. \n-\tMaking me despise a character, and then actually warm up to it via her sheer charm alone.  \n\nAnd now for the boring review:\n\nBlack Closet is…. Really god damn good actually.  \n\nThe best part of the game, in my opinion, are the characters (duh). They seem lifelike, have complex motivations, and their character develops in interesting ways. I really enjoyed learning about what makes them tick, and felt tempted to do their routes more than once. \n\nThe actual game-game, the cases mechanism, is… Good. I had a great time with it over the first 20 hours of playing, and only now it’s slowly getting a bit repetitive. The system itself might seem challenging, but once you get the hang of it it’s hilariously forgiving on normal difficulty. As long as you show restraint and send the right people, you should have no trouble solving most of the cases. It’s just a shame the game shows everything it has to offer (game-wise) way before you do all the character routes.\n\nSo definitely a recommendation from me. Don’t be discouraged by early failures, and check the Case log if you ever feel stuck.", "timestamp_created": 1483656033, "timestamp_updated": 1483744866, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29021139": {"recommendationid": "29021139", "author": {"steamid": "76561197995744889", "num_games_owned": 228, "num_reviews": 19, "playtime_forever": 584, "playtime_last_two_weeks": 0, "last_played": 1483322889}, "language": "english", "review": "As a twenty-seven year old man living in his parent's basement, eating cucumber sandwiches, playing games, and watching yuri anime, I never thought I would be good at anything. Black Closet changed all that. I am the greatest student council president of an all-girls school ever, and my father has never been prouder.", "timestamp_created": 1483574878, "timestamp_updated": 1483574878, "voted_up": true, "votes_up": 6, "votes_funny": 11, "weighted_vote_score": "0.574162", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "28770394": {"recommendationid": "28770394", "author": {"steamid": "76561198027935299", "num_games_owned": 108, "num_reviews": 5, "playtime_forever": 182, "playtime_last_two_weeks": 0, "last_played": 1482811000}, "language": "english", "review": "I very much enjoyed Long Live the Queen (played it for hours on end, but over at GoG) and I thought Black Closet looked like it had its own charm. I was intrigued at the prospect of solving mysteries and finding a traitor sounded fun as well. It had promise, but I think it fell short.\n\nFirst and foremost, to quote a Dangerfield joke you \"don't get no respect!\" I felt more like a dungeon master with a shaky weekend group than the student council president. I understand the need to build personal relationships with these character since romance is a big thing. I also understand some characters being frivolous or self-absorbed, but due to the rather strange loyalty mechanic you spend more time appeasing your minions than getting their respect. You are a dating sim protagonist and it just so happens one of the romance options kind of, sort of, maybe wants you utterly destroyed.\n\nSecond, and more importantly, your options for resolving cases can be confusing. I've googled this issue and I know I'm not alone. You can have evidence of wrongdoing or know the issue, but still fail because you have no idea which button will solve the case. For instance, I investigated a clear-cut instance of a student being envious. When persuaded she just whined (success), harassed she admitted envy (success), and the game establishes early suspects will only offer what they wish to questioning. The only option left didn't make sense: Stalking. So I failed because there's no 'send to the school's counseler' option.  It also sadly doesn't help that the tutorial doesn't explain the uses of suspension, detention, or expulsion.\n\nThird, the random elements are nice for replayability, but it makes prioritizing nearly impossible. Any given case can resolve itself or be terribly important. This suits realism to some degree, but when you're managing multiple health bars, loyalties, and skills it can be a striking detriment. Did you waste time on an open window maintenance should have noticed and now someone is down a flight of stairs? Them's the breaks. This also links to my second point. I tracked down a girl in the city to an ice cream parlor, but instead of calling the local authorities when I lost her I was given another day to try again. I failed by only a few points, which is understandable, but no other choices? Try again or fail the case. I tried again AND failed the case.\n\nFinally, all these things came together to make this more of a frustrating experience than the joy Long Live the Queen has been. It was an admirable effort and the excitement of investigation is there, but the characters and resolutions are abrasive to folks like me. If you don't have a lot of patience and time to replay the game several times I'd pass on this one.", "timestamp_created": 1482967401, "timestamp_updated": 1482967401, "voted_up": false, "votes_up": 22, "votes_funny": 0, "weighted_vote_score": "0.708142", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28702975": {"recommendationid": "28702975", "author": {"steamid": "76561197983672075", "num_games_owned": 602, "num_reviews": 59, "playtime_forever": 312, "playtime_last_two_weeks": 0, "last_played": 1486892108}, "language": "english", "review": "An interesting game.\nIt's in the style of a tabletop game mixed with a little bit of visual novel.\n\nYou send your \"minions\" (student council members) to question, harass, stalk, search, guard, and stakeout students of a boarding shool, and places in it, trying to figure out what is going wrong (you get various cases to investigate, and have multiple cases at once) before something gets big and the school takes a reputation hit, but you must also maintain respectability of the student council you're the president of so if you're caught searching an area or a students room. It's a bit odd to explain.\nOH, and one of your minions, at random, is a traitor who will try to fail their task secretly. It's a bit like the tabletop game Battlestar Galactica game in that way, but in a single-player videogame.\n\nI hate to make this kind of statement, but I feel like this more of a $10-$15 game (I bought it at $10.99) than a $20 game. But I tend to feel that way about these types of games that are part visual novel. Still, if you find it on sale it's kinda interesting and it was worth the price for me.\n\nThe 4 hours I have at writing this review is only the point where the school lost so much reputation they decided I was no longer fit to be student council president.\nI look forward to another run.", "timestamp_created": 1482825110, "timestamp_updated": 1482826666, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.464602", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27709896": {"recommendationid": "27709896", "author": {"steamid": "76561198071310818", "num_games_owned": 1586, "num_reviews": 11, "playtime_forever": 3309, "playtime_last_two_weeks": 0, "last_played": 1480190500}, "language": "german", "review": "Black Closet war in mehrerer Hinsicht eine Überraschung und  meist eine positive. \n\nEigentlich hatte ich eine Art Visual Novell mit einer trickreichen Intrigengeschichte an einer Elite-High-School erwartet. Die gibt es auch, ist aber selbst nicht so spannend, dass sich das Spiel dafür lohnen würde. \n\nInteressant wird das Ganze durch die Verbindung mit anderen Spielelement: Management einer Schülervertretung, Verbesserung der Fähigkeiten seiner Mitstreiter und Dating-Sim. \n\nDabei haben ich auch gelernt was \"Yuri\" heißt. Man leitet nämlich die Schülervertretung einer reinen Mädchenschule. Dem entsprechenden gibt es nur weiblich-weibliche Beziehungen, eben \"Yuri\". (Leute, die sich auf visuellen \"Fan-Service\" freuen, ist das Spiel aber abzuraten, da wenig bis nicht vorhanden)\n\nDie einzelnen Spielelement sind gut mit ein anderen verbunden. Es gibt einiges an Wechselwirkungen. Andere Wege haben oft überraschende aber glücklicher Weise nie unlogische Auswirkungen.  Es braucht schon etwas Mitdenken und Erfahrung, um richtig zu reagieren und das Spiel zu meistern. \n\nBelohnt wird man mit einer einmaligen Spielerfahrung in einer Welt voller Intrigen, Verrat, Mord, Freundschaft, Treue und Liebe. Glänzend umgesetzt sind die unterschiedlichen Charaktere in der Schülervertretung und ihre verschiedenen Perspektiven auf die Welt und die Handlung.  Vor allem deshalb lohnt es sich das Spiel auch mehrmals durchzuspielen. \n\nDazu kommt eine große Portion Indie-Charme. Man anmerkt, wie viel Arbeit und Liebe die Entwickler in ihr Spiel investiert haben und mit wenig Mitteln und vielen Ideen etwas Einmaliges geschaffen haben. Man kann es lieben oder hassen oder einfache die Reise genießen. Wie auch immer: die Leistung und auch den Mut der Entwickler muss man anerkennen.", "timestamp_created": 1480185033, "timestamp_updated": 1480198422, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27570726": {"recommendationid": "27570726", "author": {"steamid": "76561198062979985", "num_games_owned": 140, "num_reviews": 2, "playtime_forever": 392, "playtime_last_two_weeks": 0, "last_played": 1480118780}, "language": "english", "review": "Solve mysteries. Find the traitor in your ranks. Seduce your underlings. Reign over highschool with an iron fist. What's not to love, really?\n\nBlack closet is a turn-based game, some king of strategy-visual novel hybrid that has you impersonating the president of the student council of a prestigious girl's bording school. You are in command of a team of underlings, and must tackle a number of randomly generated cases quickly enough to safeguard the school's reputation, but subtly enough not to turn the students against you. The mechanics are easy to take a hold off, but the gameplay is very well balanced, meaning you'll constantly be weighting your decisions and the way you allocate your limited manpower.\n\nAnd that's only the day to day affairs. The procedurally generated cases rhythm a much bigger intrigue, as your character must prepare for her life after school, attend a variety of event, bond with her underlings, find the traitor in the council (who changes every game and can be detected by carefully observing your underlings' success rate), and maybe uncover a conspiracy or three, all the while maintaining her position as the student council president.", "timestamp_created": 1480118668, "timestamp_updated": 1480118668, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27549691": {"recommendationid": "27549691", "author": {"steamid": "76561198064838002", "num_games_owned": 153, "num_reviews": 134, "playtime_forever": 179, "playtime_last_two_weeks": 0, "last_played": 1480187580}, "language": "english", "review": "Well this game is pretty interesting for its price, and the story is really intresting.\n\nBut but gameplay-wise, it really annoys me - because of its trend of snowballing. Let me explain:\n\nYou gain ability points for solving cases. \nIf you always succeed, you will be fine. But if you fail at least once, or get low rank (1xp points instead of 5), this means that your odds at the next case will be significantly lower. And if you fail the next case, all the future cases will be almost impossible due to insufficent stats of your characters. \n\nOr maybe just my luck, im not good at \"full random\"-dependent games. But you might be more lucky.\n\n", "timestamp_created": 1480109099, "timestamp_updated": 1480109099, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.420835", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26723245": {"recommendationid": "26723245", "author": {"steamid": "76561198027068115", "num_games_owned": 308, "num_reviews": 3, "playtime_forever": 1309, "playtime_last_two_weeks": 0, "last_played": 1445198810}, "language": "english", "review": "Another wonderful, weird game from Hanako. It is *hard* to write a decent procedural detective system, and they've pulled it off pretty well. The characters are well drawn – picking a lieutenant felt like a meaningful choice – and the dialog is consistently well written.\n\nMy all-girl (non-boarding) high school didn't have actual eldritch cults or poisoning sprees, but a lot of the more mundane storylines rang true for me: overbearing parents, BFFs turned mortal enemies, practical jokes, bullying, etc. So, A for authenticity.\n\nPretty good replayability, with all the customization options. I paid $20 and felt very happy with what I got. Can't wait for more from Hanako.", "timestamp_created": 1479686301, "timestamp_updated": 1479686301, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26707496": {"recommendationid": "26707496", "author": {"steamid": "76561198009316578", "num_games_owned": 330, "num_reviews": 20, "playtime_forever": 586, "playtime_last_two_weeks": 0, "last_played": 1503039250}, "language": "english", "review": "I don't know if this is what school is like in Japan, but if it is I'm really disappointed in my birthplace for not getting on that bandwagon.\n\nOne of the best of its kind, whatever its kind actually is, interesting game mechanics overlaid on a branching and moving storyline, a game about which any complaint I could make would be forced and insincere.", "timestamp_created": 1479626611, "timestamp_updated": 1479626611, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26488036": {"recommendationid": "26488036", "author": {"steamid": "76561198055006994", "num_games_owned": 618, "num_reviews": 59, "playtime_forever": 337, "playtime_last_two_weeks": 0, "last_played": 1472547723}, "language": "english", "review": "Surprisingly entertaining, if you like the idea of being the manager of a group of detectives that solve proceduraly generated cases and dont mind it´s random nature and spreadsheet gameplay then I recommend you give this a try, maybe get it on sale.", "timestamp_created": 1478607633, "timestamp_updated": 1478607633, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.554863", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26212757": {"recommendationid": "26212757", "author": {"steamid": "76561197975493492", "num_games_owned": 66, "num_reviews": 9, "playtime_forever": 1362, "playtime_last_two_weeks": 0, "last_played": 1479701301}, "language": "english", "review": "Play the free demo first and understand that you've seen 95% of the game mechanics. \n\nNothing else really changes, and the story (lol) is not... that... great; an average story with your standard tropes. \n\nIf you like it, then definitely buy it when it's on sale :) -- decent replayability for a few runs.", "timestamp_created": 1477393794, "timestamp_updated": 1477393794, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26162294": {"recommendationid": "26162294", "author": {"steamid": "76561198079260383", "num_games_owned": 185, "num_reviews": 17, "playtime_forever": 1129, "playtime_last_two_weeks": 0, "last_played": 1510859112}, "language": "koreana", "review": "전략 게임과 비쥬얼 노벨이 조합된 백합게임 \"살아남아라 학생회장님\"입니다.\n연애보다 학생회 운영과 입시 성공하기가 더 재미있었습니다.", "timestamp_created": 1477138565, "timestamp_updated": 1477138565, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.507168", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25718018": {"recommendationid": "25718018", "author": {"steamid": "76561197992375595", "num_games_owned": 747, "num_reviews": 11, "playtime_forever": 598, "playtime_last_two_weeks": 0, "last_played": 1475337573}, "language": "english", "review": "This game lets you assume the Gendo Pose, and there are pretty girls in frilly outfits. What else do you need?", "timestamp_created": 1474934779, "timestamp_updated": 1474934779, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25313719": {"recommendationid": "25313719", "author": {"steamid": "76561197971099303", "num_games_owned": 77, "num_reviews": 2, "playtime_forever": 1675, "playtime_last_two_weeks": 0, "last_played": 1478821903}, "language": "english", "review": "A superb game of politics and intrigue. It's challenging, it's fun, and it's actually kinda sexy. But don't go thinking it's smut. There's a really interesting game here, with really interesting choices to make. The difficulty fades once you figure out the mechanics, but that takes long enough for you to be really entertained.\n\nNot the kind of game I'd usually play, but having played it, I love it.", "timestamp_created": 1472854511, "timestamp_updated": 1472854511, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25234706": {"recommendationid": "25234706", "author": {"steamid": "76561198025677399", "num_games_owned": 247, "num_reviews": 8, "playtime_forever": 443, "playtime_last_two_weeks": 0, "last_played": 1473148767}, "language": "english", "review": "Really original game with a great cast. Highly recommended if you like difficult stat management games.", "timestamp_created": 1472498489, "timestamp_updated": 1472498489, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502262", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25229919": {"recommendationid": "25229919", "author": {"steamid": "76561198056805938", "num_games_owned": 134, "num_reviews": 6, "playtime_forever": 649, "playtime_last_two_weeks": 0, "last_played": 1473117664}, "language": "english", "review": "Not the most exciting Anime Game ever (Hanako Games itself has done better) but still interesting enough to deserve attention. The mechanics are quite original (if repetitive at times) and the story intriguing; there is also enough incentive to replay it in order to explore the different paths. Graphics is Manga-style at the point of self-parody sometimes, but really beautiful. The writing is good and the characters pretty interesting.\nMy main disappointment, the very encased structure so that you have your week of work and investigation, then in the weekend you meet one of the girls (with not many dialogue choices), then rinse and repeat, which feels quite artificial.", "timestamp_created": 1472482523, "timestamp_updated": 1472482523, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24834727": {"recommendationid": "24834727", "author": {"steamid": "76561198029904609", "num_games_owned": 375, "num_reviews": 83, "playtime_forever": 328, "playtime_last_two_weeks": 0, "last_played": 1470962096}, "language": "english", "review": "This is unlike anything else I've played. Ignore the setting and premise if you have to and give this a go. Mechanics-wise, it's rock solid. The balance is tight and procedurally generated; two great tastes that rarely go great together. I barely felt like I could catch my breath between cases, and every time I managed to get the upper hand on an issue, I felt like I had triumphed over something I wasn't meant to beat.\n\nBut perhaps I should go back and explain.\n\nBlack Closet is about running the FBI from your position as class president in a probably Cthulhu-infested girls' school. Every week new cases are assigned to you and you dispatch a team of well-dressed mooks to solve them in a way that does not look unfavorably on your alma mater. \n\nOn the surface that seems pretty straightforward, but each twist in the plot is a torpedo aimed directly at your success so far and the cases range in intensity from \"two girls spent a night together and now each is convinced the other has an unwanted crush on her\" to \"actual black magic is being performed\" and \"girls are being deliberately poisoned.\" \n\nThere's less murder and horrible death in Black Closet than in Hanako's princesses-in-pink-dresses simulator, but the stakes feel just as high. Furthermore, the routes that this game takes are convoluted and twisty, making for a lot more replay value than I would have expected. \n\nThe visual novel format isn't too intrusive in Black Closet, and I felt more like I was playing a game than reading one, so folks who would be scared away by any of the steam tags are advised to give this title a closer look.\n\nI'd impulse-buy it at $15, which is way higher than I'd usually go for something I was this on-the-fence about, and I'd say $30 would be a very reasonable price for this game.\n\nUnless your portfolio of games is pretty much just COD and things that look like COD, Black Closet is worth checking out.", "timestamp_created": 1470963026, "timestamp_updated": 1470963026, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.709949", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24413729": {"recommendationid": "24413729", "author": {"steamid": "76561198059215839", "num_games_owned": 82, "num_reviews": 2, "playtime_forever": 1412, "playtime_last_two_weeks": 0, "last_played": 1484864730}, "language": "english", "review": "This game is so much fun! It's a very strategic game, and I've really found that there's no 'best' way to playing it. The game puts you in the driver's seat; you're the one commanding your minions and telling them what to do, and the results of their investigations are always so suspenseful! At the same time that you're solving all these minor mysteries, there's a larger mystery overshadowing you; there's a traitor in your ranks, and you need to come up with a way to weed her out. While this game doesn't contain fast-paced action, anyone who enjoys strategies, mysteries, and suspense will find this game to be very enjoyable. In addition, the game is randomized every time you play through it, and it's also very customizable, so it's hard to run out of things to enjoy about it! I was really glad that I found this game and purchased it without having to hear about it elsewhere.", "timestamp_created": 1468957923, "timestamp_updated": 1468957923, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24200343": {"recommendationid": "24200343", "author": {"steamid": "76561198289300711", "num_games_owned": 91, "num_reviews": 4, "playtime_forever": 488, "playtime_last_two_weeks": 0, "last_played": 1468045667}, "language": "english", "review": "Short version: THIS GAME IS TOTAL GARBAGE\n\nThe idea of the game I admit was pretty cool. I just constantly had issues with the logic, the general gameplay, and even the story fell flat. The first of many problems is that for the first part of the game when you need to spend time with your council members, all the cutscenes mean NOTHING. They will be the same cutscenes no matter who the traitor is so that bit of \"finding out who the traitor is\" is just lies. On top of that I actually thought the in-between cutscenes where you spoke to the teacher and other people was important....nope. No matter what choices you make, how you make them, and for what reason you make them, is completely irrelevant to the game. Also this whole \"finding out the traitor\" business is somewhat lied about too. They tell you in the beginning the EXACT way to find out who the traitor is. That is all good but when the 'middle' of that section of the game happens and you get the cutscene with the teacher asking you who you suspect at this point is very misleading(in my opinion). I knew for a fact based off the evidence I had seen who the traitor was but when I told the teacher she said I had ZERO EVIDENCE. Sadly this is only the first part of the game and for me it was extremely frustrating trying to cope with the crappy \"cases\" and trying to figure out what the purpose of the cutscenes were. The rest of the game afterward is 100% trial and error. You will NEVER be lucky enough to get through the entire game first time without some form of guide giving you tips or just flat out telling you what to do. Even when cases recycle(as they will because the students in this school are absolute devil children) they can't be solved with the same steps every time and there were MANY times where a case went cold, ended, and it turned out to be a scandal and I lost reputation and karma for it.....thanks game. Don't get me wrong either, I tried EVERYTHING the game gives you for options but it still doesn't progress at all leaving you with just a middle finger in your face. As mentioned previously: the game's story falls flat too. They seemed to try and make it edgey or something but it just comes off as...sorta desperate. It seemed like after the traitor incident they just kinda struggled to keep up good writing(what little there was). It just saddens me cause I felt like the idea had potential. Regardless of the artwork I still kinda pictured it in my head as you're the student council president at an anime school and you gotta solve the problems that come up....with ACTUAL problem solving...which was of course shattered the instant the game began :'c\n\nOverall my experience with this game was very frustrating just like it was with Long Live the Queen...and how fitting that it be people who took part in the making of that \"Little Girl Death Simulator\"    2/10", "timestamp_created": 1468047028, "timestamp_updated": 1468047028, "voted_up": false, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.464852", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24141593": {"recommendationid": "24141593", "author": {"steamid": "76561198003381569", "num_games_owned": 575, "num_reviews": 82, "playtime_forever": 1030, "playtime_last_two_weeks": 0, "last_played": 1469486504}, "language": "english", "review": "Extremely addictiing gameplay, with tactical portions (assigning skill heavy girls to specific tasks to not fail).\n\nYuri love (tasteful).\n\nHigh quality art and very nice sound.\n\nFrom the Devs who did \"A Lily Princess\" (which I also have).\n\nClever dialog not the usual tropes for a VN esq game.\n\nYou solve problems like (and I don't personally see this as  a problem) one of the girls is posing nude and sending out her pic. (how do you stop the scandal?).\n\nNo hentai but I still played it 3 hours straight the other day.\n\nWould Pay for Hentail (DLC).\n\nGet it, and support the talent and the arts.", "timestamp_created": 1467834060, "timestamp_updated": 1467834060, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24083969": {"recommendationid": "24083969", "author": {"steamid": "76561197969067861", "num_games_owned": 502, "num_reviews": 9, "playtime_forever": 161, "playtime_last_two_weeks": 0, "last_played": 1467646251}, "language": "english", "review": "[h1] Overall: 3/5 [/h1]\n- Decent combination of mystery adventure, lesbian dating sim and card duel. \n\nPros:\n- Requires strategical thinking to achieve good results for each investigation.\n- Sort of rogue-like in that each case is randomly generated. \n\nCons:\n- The variety of cases is limied. It starts to feel repetitive after 2-3 hours.", "timestamp_created": 1467646850, "timestamp_updated": 1467646850, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.570056", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24068350": {"recommendationid": "24068350", "author": {"steamid": "76561198067725186", "num_games_owned": 276, "num_reviews": 26, "playtime_forever": 785, "playtime_last_two_weeks": 0, "last_played": 1467599306}, "language": "english", "review": "If I were a teenage girl, this would be my kind of school. There is more that enough trouble to get into, and there are plenty of ladies to \"explore\" with. Even the straight girls want to be cuddle buddies for the free hugs.\nI'm making a t-shirt that says \"Now accepting applications for cuddle budies\".\n\nIt took me three failed games to figure out the strategy, even knowing the basics, the game is a challenge as you balance your investigator's resources against the large number of cases that arrive on your desk. If you fail, don't give up.\n\nI had hoped for more of an investigation heavy game where clues were searched for, witnesses were interviewed, and notes were discussed to arrive at a conclusion. You do these things in the game, but not in great depth.\n\nI have no regrets. I'd invite Mallory to a secluded picnic again.", "timestamp_created": 1467600568, "timestamp_updated": 1467600568, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23880316": {"recommendationid": "23880316", "author": {"steamid": "76561198310280753", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 9212, "playtime_last_two_weeks": 0, "last_played": 1495688033}, "language": "english", "review": "100% recommend \n9/10\nI became obsessed with this game the moment I started playing. I have unlocked all achievements with the exception of unlocking all of both art styles. It's really fun, but as you play, you do start to learn patterns that ultimately make the game more of a habit and less of a mystery. But in the process, you still have to unlock all of the girl's stories, and you get to choose your response rather than just reading paragraphs about what your character is saying, so it does make it a lot more interesting and fun. If you can't tell by my logged hours, I really really really love this game. I recommend it 100% to those who like RPG games with more options and complexity, as well as mystery and decision making. There are SO many storylines. Plus, GIRL LOVE!  \n", "timestamp_created": 1467080044, "timestamp_updated": 1467080044, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23804536": {"recommendationid": "23804536", "author": {"steamid": "76561198253367672", "num_games_owned": 72, "num_reviews": 1, "playtime_forever": 779, "playtime_last_two_weeks": 0, "last_played": 1480199074}, "language": "german", "review": "Okay mein erstes Review!:D\nDieses Game...ich habe wirklich nicht erwartet, das es so gut ist.\nDie Fälle wiederholen sich, aber dennoch sind sie nie komplett gleich...\nUnd auch der Verräter wechselt immer!\n11/10 would make Lemonade again.\n\nEinfach immer wieder reizvoll zu zocken.", "timestamp_created": 1466887494, "timestamp_updated": 1466887494, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23740909": {"recommendationid": "23740909", "author": {"steamid": "76561197960877486", "num_games_owned": 338, "num_reviews": 2, "playtime_forever": 215, "playtime_last_two_weeks": 0, "last_played": 1484148004}, "language": "english", "review": "This is nice, I like it.", "timestamp_created": 1466732885, "timestamp_updated": 1466732885, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.404208", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23608882": {"recommendationid": "23608882", "author": {"steamid": "76561198049949381", "num_games_owned": 327, "num_reviews": 126, "playtime_forever": 65, "playtime_last_two_weeks": 0, "last_played": 1466133693}, "language": "english", "review": "Original game that puts you into the shoes of a student president and you need to find out who is the traitor in your group at the same time as solving problems and keeping your group's karma and the school's reputation high... not an easy task.\n\nIf you like investigation games, this might be your game.\nIf you like unique and original game, this might be your game.\n\nI strongly recommend this game for anyone like both.", "timestamp_created": 1466142963, "timestamp_updated": 1466142963, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23566089": {"recommendationid": "23566089", "author": {"steamid": "76561198025500356", "num_games_owned": 350, "num_reviews": 107, "playtime_forever": 490, "playtime_last_two_weeks": 0, "last_played": 1493469138}, "language": "english", "review": "I always want to be the leader of an absurdly powerful student council and doing tent-hand in front of my secret elite cabal of minions for the supposedly greater good of society. It's everything I've ever imagined and more. Chance to romancing my minion is a bonus as welll. Thanks for making that dream comes true, Hanako Games.", "timestamp_created": 1465978780, "timestamp_updated": 1465979064, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.466667", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23543996": {"recommendationid": "23543996", "author": {"steamid": "76561198008512424", "num_games_owned": 480, "num_reviews": 4, "playtime_forever": 3938, "playtime_last_two_weeks": 0, "last_played": 1514385979}, "language": "english", "review": "I love this game to pieces. I love the setting, I love the art, I love the characters, I love the writing...\n\nThis game is set in a high class boarding school for girls. The main character is the president of the student council, who delegates her council to complete covert missions to keep the students in check. The characters on the council are as trope-tastic as the setting, but the writing works really well for someone like me who loves these tropes. Here you will find the playgirl, the quiet one and the diva, amongst others. And yet I found myself interested in every single one of  these characters, even though they felt kind of familiar from the start. I think this might be because I really, really enjoy the tropes the characters have been based around, but the writing of the individual characters really is strong. I also suspect that the great visual design helped. Every last one has an interesting look that is distinguished from the rest of the cast.\n\nAnd the game has a few flaws. There is a bit of a draught of scenes towards the end of the game, giving a pacing that slows down towards the end of the game. (A greater build up to the climax would probably have made this game even better.) Some parts of the writing can also get a little bit awkward. Examples could be how the writing handles the main character being black, which sometimes works well and sometimes really feels strange and/or awkward.\n\nIf you want a \"covert detective/extortion simulator\" game set in an all girls high school featuring a cast of interesting, albeit tropey characters, this game might be for you.", "timestamp_created": 1465858068, "timestamp_updated": 1465858068, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.588759", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22873483": {"recommendationid": "22873483", "author": {"steamid": "76561198031529366", "num_games_owned": 1849, "num_reviews": 66, "playtime_forever": 501, "playtime_last_two_weeks": 0, "last_played": 1499139496}, "language": "english", "review": "The PC classic government conspiracy sim \"Floor 13\" meets schoolgirl yuri anime - and the two mesh far better than one might expect! Putting you in the role of the new leader of a shadowy, excessively powerful student council in a prestigious girls' academy, Black Closet tasks you with juggling the various goings-on at St. Claudine's, as well as among your henchwomen. One great strength of the game is its use of randomization. In most games of this sort (if there were very many of this sort), you could safely bet anything that crosses your desk represents a time-bomb waiting to be defused. But that isn't necessarily the case! Some situations can be conclusively proven to have been nothing after all - and other, more ambiguous ones may leave you wondering if you need to keep digging to get to the truth, or stop picking at the \"problem\" and focus your resources elsewhere while it sorts itself out. Even of those that really do represent some kind of skullduggery that warrants your intervention, the same (apparent) situations may have wildly different causes and solutions. The characters aren't earthshattering, but they're well-written and reasonably nuanced. The replay value isn't fantastic, but some major random variables (like exactly who - if anyone? - in your organization is actually a mole) keep some curveballs coming your way. All told, if you've ever had any fondness for the archetypal \"shadowy student council\" in some school-setting anime/manga, this will probably suit you nicely.", "timestamp_created": 1462759204, "timestamp_updated": 1462759204, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.504586", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22727243": {"recommendationid": "22727243", "author": {"steamid": "76561197972364921", "num_games_owned": 1121, "num_reviews": 4, "playtime_forever": 6, "playtime_last_two_weeks": 0, "last_played": 1442544090}, "language": "english", "review": "Do you like Floor 13? Yes? Good, then play that. It's free. \n\nDo you not like Floor 13? Then don't play this anyway. It's basically the same game with a beyond terrible random number generator and romance plotlines tacked on.\n\nAlso, it's a game with a beyond terrible random number generator and romance plotlines tacked on. Don't play this. You can do so many other things with your time. Better things. Like committing war atrocities. \n\nBlack Closet is overpriced and underdone, it's basically a version of a game you can get for free, but with unnecessary and poorly designed bits nailed all over it.", "timestamp_created": 1462037770, "timestamp_updated": 1462037770, "voted_up": false, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.387733", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22667345": {"recommendationid": "22667345", "author": {"steamid": "76561197970324415", "num_games_owned": 247, "num_reviews": 15, "playtime_forever": 627, "playtime_last_two_weeks": 0, "last_played": 1462207512}, "language": "english", "review": "Really nice game, heard about it from RPS and added it to my wishlist - sale came by and picked it up, not disappointed!\n\n+ procedurally generated problem solving\n+ intriguing story\n+ nice art\n+ nice music\n+ multiple storyline / character paths\n- if your school reputation is too low it can be difficult to recover (RNG will screw you over!)\n\nWell worth the time and money!", "timestamp_created": 1461785004, "timestamp_updated": 1461785004, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.506680", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22609557": {"recommendationid": "22609557", "author": {"steamid": "76561198070683801", "num_games_owned": 135, "num_reviews": 1, "playtime_forever": 608, "playtime_last_two_weeks": 0, "last_played": 1461702166}, "language": "english", "review": "One of the best indie games I've ever played. Gameplay is quite unique, though there isn't much to say about it to be honest. Characters and story are where this game shines in my opinion, I haven't finished the main story yet, but it's not exceptionally great, but the characters are simply amazing, they're extremely appealing and all have a really nice story. One of the other great aspects of the game is the fact that the story changes a lot every time you play. If you like generated stuff and choices-matter kind of games like me, it's also a nice feature.\n\n[spoiler]I'm actually a filthy bastard who hunts for lesbian stuff in games but damn the characters were really nice[/spoiler]\n", "timestamp_created": 1461503229, "timestamp_updated": 1461503229, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22563315": {"recommendationid": "22563315", "author": {"steamid": "76561198043280625", "num_games_owned": 76, "num_reviews": 3, "playtime_forever": 851, "playtime_last_two_weeks": 0, "last_played": 1512246602}, "language": "english", "review": "This game is addicting and fairly simple to get into once you understand the mechanics. Love the RNG aspect.", "timestamp_created": 1461312007, "timestamp_updated": 1461312007, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22491141": {"recommendationid": "22491141", "author": {"steamid": "76561198025563408", "num_games_owned": 111, "num_reviews": 6, "playtime_forever": 1370, "playtime_last_two_weeks": 0, "last_played": 1463024275}, "language": "english", "review": "At its core, Black Closet is a resource-management and investigation game; you spend resources to investigate cases, and use the knowledge you get to determine how much more you need to spend to close the case. I especially like how a good number of cases turn out to be nothing, which kept me on my toes (Do I spend a lot more in case I missed something, or is there really nothing more to do?). I found the game surprisingly tense for something with no real-time pressure.\n\nI did like the fluff and the story routes, though I did end up skipping through a lot of it on later runs. In my opinion, the gameplay is varied enough to stand up to the repitition, though going through the same story points every time grates a bit.", "timestamp_created": 1460944613, "timestamp_updated": 1511426064, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22488641": {"recommendationid": "22488641", "author": {"steamid": "76561197982497554", "num_games_owned": 356, "num_reviews": 13, "playtime_forever": 523, "playtime_last_two_weeks": 0, "last_played": 1460932306}, "language": "english", "review": "very good gameplay and fun. Lesbian romance scenes were a distraction from the gameplay however. I still recc it on gameplay alone.", "timestamp_created": 1460932358, "timestamp_updated": 1460932358, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22230837": {"recommendationid": "22230837", "author": {"steamid": "76561197970346067", "num_games_owned": 978, "num_reviews": 57, "playtime_forever": 177, "playtime_last_two_weeks": 0, "last_played": 1459740819}, "language": "english", "review": "Very solid and super interesting mystery-solving / randomly-generated-social-sim visual novel thing. I had an absolute blast. Highly recommended.", "timestamp_created": 1459742961, "timestamp_updated": 1459742961, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22228512": {"recommendationid": "22228512", "author": {"steamid": "76561197989696272", "num_games_owned": 237, "num_reviews": 15, "playtime_forever": 351, "playtime_last_two_weeks": 0, "last_played": 1453523543}, "language": "english", "review": "Intriguing, well-written, nicely paced. I enjoyed playing through twice.", "timestamp_created": 1459728668, "timestamp_updated": 1459728668, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500240", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21998658": {"recommendationid": "21998658", "author": {"steamid": "76561198059007740", "num_games_owned": 163, "num_reviews": 34, "playtime_forever": 679, "playtime_last_two_weeks": 0, "last_played": 1458723818}, "language": "english", "review": "So, solving mysteries is fun but eventually you realize it's the same 13 or so mysteries (Luckily, the solutions vary). But this game is more than just that: it's totally 100% a lesbian dating sim. Definitely, that's the main point I think. And it's a good one at that. I enjoyed it. All the characters are fun and interesting. If you like dating sims, this is a potential one, though it's hard until you learn how to play properly.", "timestamp_created": 1458724047, "timestamp_updated": 1458724047, "voted_up": true, "votes_up": 17, "votes_funny": 2, "weighted_vote_score": "0.700534", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21840282": {"recommendationid": "21840282", "author": {"steamid": "76561198042682154", "num_games_owned": 77, "num_reviews": 1, "playtime_forever": 1058, "playtime_last_two_weeks": 0, "last_played": 1474202446}, "language": "english", "review": "The most Japanese thing I'm willing to buy... Because it's set in England.\n\nBlack Closet is a game where you order your minions to stalk and harass schoolgirls, join cults and manipulate everyone around you. Think I'm exaggerating? I'm not.\n\nConduct investigations into various cases around an all-girls boarding school. Forged test results, secret societies and lesbian love affairs are just some of the cases that you may be assigned. Each case is randomly generated and can have a different outcome, making each playthrough a unique experience. There are aslo special cases that can result in a game over if you fail, so make sure your minions are properly trained.\n\nThe other side of this game is a basic dating sim. It doesn't have to be a romantic relationship, but you will get a choice of following one of your five minion's storylines early in the game. This part of the game remains the same, but characters will have different responses to your different dialog options. The only major things that these affect are mostly whether you end up in relationship with your chosen character. Otherwise, this whole segment doesn't have a huge impact on the game other than sometimes affecting the loyalty of your minions, which really only comes into play at the final part of the game.\n\nYou have the choice of five lovely ladies as your love interest.\n\nAlthea - The school floozy.\nThais - The prissy posh one. Well, posh-er. It's a private school, so you know.\nVonne - The token childhood friend character that is so devoted to you that it borders on creepy.\nMallory - The cute, bubbly one. I think she's American or something.\nRowan - The shut-in. You know, like the one that's in every anime ever?\n\nTheir stories develop the more intimate you get with them. Typically, the story arc wraps up when you acheive maximum romance. Your reward for this is a single picture of your own character and chosen love interest giving eachother a big ol' smooch. So, those of you who want to buy this game purely for that (and we all know that some people do) you have your work cut out for you.\n\nAt the end of the day, I reccomend this game. A nice blend of strategy and mystery, easy to get in to and a decent story. Plenty of replayability so you'll definitely get your money's worth, especially if you grab it in a sale.\n\n\n\nIf you want to learn more about the game, read a real review. I'm mostly doing this for the achievement for my profile.", "timestamp_created": 1457984727, "timestamp_updated": 1457984727, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.510074", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21584336": {"recommendationid": "21584336", "author": {"steamid": "76561198034945011", "num_games_owned": 163, "num_reviews": 22, "playtime_forever": 213, "playtime_last_two_weeks": 0, "last_played": 1455348559}, "language": "english", "review": "I've always wanted to be an inspector and take charge of an investigation. \nMy favourite minion, the stalker, just max those stalking skills, it pays off. \nThe art-style is also interesting, and it pulls you in.", "timestamp_created": 1456928823, "timestamp_updated": 1456928823, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.499760", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21521030": {"recommendationid": "21521030", "author": {"steamid": "76561198135116644", "num_games_owned": 238, "num_reviews": 14, "playtime_forever": 994, "playtime_last_two_weeks": 0, "last_played": 1458160311}, "language": "german", "review": "That game makes totally addicted! And it is so frustrating at the same time. \n\nThat game is really, really, really hard and a totally challenge. But if you would get the game better, if you can use your minions better, then you progress further and further ... and at the point were you see that it would be easier to handle, Black Closet could then be one of the best games of your library. \n\nIt's hard to manage, but it makes so much fun to play it! I started it two days ago and there are ten hours where I played it ... enough said ;)? \n\nSo, my points will be 10/10, at least. A must buy for all who likes to solve mysteries, manage your \"troops\" (in that game \"minions\"), combine that with private life of the characters and search for an harder challenge than other detective games.", "timestamp_created": 1456656868, "timestamp_updated": 1456656868, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21412549": {"recommendationid": "21412549", "author": {"steamid": "76561198000777924", "num_games_owned": 687, "num_reviews": 83, "playtime_forever": 326, "playtime_last_two_weeks": 0, "last_played": 1456258317}, "language": "english", "review": "Very nice detective VN with bunch of lesbianism - basically perfect combination :D What you're going to do in here:\n- Find who is traitor\n- Keep faithful watch over school as a school council president!\n- Question, haras, expel, stalk search and so on other people and their rooms or other places.\n\nBasically each week you'll be getting 1 or more cases which you have to crack. You can quesrion suspects, haras them, stalk them to see what are they doing. There are bunch of tools for you to use. Plus cases and traitor randomize.\n\nAnd while doing all the detective work you're gonna dive into some hot pink romance with different girls who work under your command. Nice visual novel + detective game. If there will be sequel I hope they will add more types of cases and more twists in cases.", "timestamp_created": 1456259190, "timestamp_updated": 1456259190, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21348743": {"recommendationid": "21348743", "author": {"steamid": "76561198160771498", "num_games_owned": 26, "num_reviews": 1, "playtime_forever": 439, "playtime_last_two_weeks": 0, "last_played": 1455999742}, "language": "english", "review": "A really nice game if you like resource/time management life simulators. And the setting is right up my alley too. I replayed it right away after my first run, that's the kind of game it is.", "timestamp_created": 1456000633, "timestamp_updated": 1456000633, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500240", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21320930": {"recommendationid": "21320930", "author": {"steamid": "76561198096899228", "num_games_owned": 165, "num_reviews": 21, "playtime_forever": 501, "playtime_last_two_weeks": 0, "last_played": 1455801174}, "language": "english", "review": "A procedural detective game set in a prestigious all-girl's high school. Puzzle solving, conspiracy, romance, and one of your minions is a traitor. Conceptually one of my favourite games, and the implementation feels like a board-game (which, in my books, is a good thing).", "timestamp_created": 1455901074, "timestamp_updated": 1455901099, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21272708": {"recommendationid": "21272708", "author": {"steamid": "76561198119342164", "num_games_owned": 718, "num_reviews": 50, "playtime_forever": 3238, "playtime_last_two_weeks": 0, "last_played": 1479202742}, "language": "english", "review": "Spreadsheet sim/VN/card game/rpg. Play a lesbian School Captain in an elite boarding school, and use your minions to pry into your fellow students' secrets and bend them to your will.\n\nA+", "timestamp_created": 1455711883, "timestamp_updated": 1455711883, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502413", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21013154": {"recommendationid": "21013154", "author": {"steamid": "76561198009202030", "num_games_owned": 60, "num_reviews": 10, "playtime_forever": 2176, "playtime_last_two_weeks": 249, "last_played": 1515789517}, "language": "english", "review": "BLUF: Another well done game that offers a twist on the survival/manager games.  If you like the setting of Rockstar's \"Bully\", liked the movie \"Mean Girls\", like solving small mysteries or if you like a twist on the managment genre then you should consider buying this game. \n\nPros:\n[*] Well written story that will have you guessing as to who is your friend and whose not\n[*] For those fans of romance, there are those elements\n[*] Very nice artwork\n[*] Randomization of the cases offers some challenge on successive playthroughs\n[*] GREAT AD+D social reference!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!   Your character and her second discuss a real world story that all of us who played AD+D back in the early 80s will recognize.  Excedllent touch!\n\nCons:\n[*] Once you know how to approach the cases, there is little change to the process. This may lead some to be bored after seeing the same case, though with different actors, over and over. \n[*] Linear story so once you have seen it/solved it, the replay value is mostly in seeing how the story evolves when choosing different allies and enemies\n[*] Little customization of your character, so Else Jackson (your character) is mostly set with a few choices about what makes her her\n\n\n", "timestamp_created": 1454809657, "timestamp_updated": 1454809657, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20970208": {"recommendationid": "20970208", "author": {"steamid": "76561198043763241", "num_games_owned": 93, "num_reviews": 3, "playtime_forever": 1318, "playtime_last_two_weeks": 0, "last_played": 1455511018}, "language": "english", "review": "The game is a lot of fun! Pretty art, and a fun premise overal.", "timestamp_created": 1454682211, "timestamp_updated": 1454682211, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20603807": {"recommendationid": "20603807", "author": {"steamid": "76561198007807564", "num_games_owned": 310, "num_reviews": 40, "playtime_forever": 1092, "playtime_last_two_weeks": 0, "last_played": 1453053898}, "language": "english", "review": "Like all the other games from this Developer this one glued me to the screen for a good few days. Every time i wonder how they do this. I recomend this game to everyone, especially for the strategy component.", "timestamp_created": 1453119784, "timestamp_updated": 1453119784, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.401412", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20393866": {"recommendationid": "20393866", "author": {"steamid": "76561198009854709", "num_games_owned": 1713, "num_reviews": 490, "playtime_forever": 312, "playtime_last_two_weeks": 0, "last_played": 1450622504}, "language": "italian", "review": "LA MISTERIOSA SCUOLA PRIVATA YURI (Black Closet) - Novità \nE poi ci sono giochi come Black Closet che lancio per provarli e mi tengono incollato una serata. Riusciremo a diplomerci con successo o soccomberemo alle macchinazioni che vogliono vederci fallire? Siamo la presidentessa del consiglio studentesco e la scuola è piena di casi misteriosi che potrebbero ledere la reputazione dell'istituto e, come se non, bastasse, tra le nostre sottoposte c'è un traditore. Non vi sembra semplice? Beh, non lo è.\n\nhttps://www.youtube.com/watch?v=hA0bSyYcPvQ", "timestamp_created": 1452249296, "timestamp_updated": 1452249296, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.458273", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20387108": {"recommendationid": "20387108", "author": {"steamid": "76561198096369345", "num_games_owned": 107, "num_reviews": 14, "playtime_forever": 1608, "playtime_last_two_weeks": 0, "last_played": 1499374633}, "language": "english", "review": "This game is my aesthetic through and through\nI can be a diabolical evil leader, confuse straight girls, make minions kiss my boots, tie up a yandere and have sex in the woods\nI love this game", "timestamp_created": 1452214626, "timestamp_updated": 1452214626, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.489058", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20376792": {"recommendationid": "20376792", "author": {"steamid": "76561198026896352", "num_games_owned": 163, "num_reviews": 3, "playtime_forever": 936, "playtime_last_two_weeks": 0, "last_played": 1485801409}, "language": "english", "review": "I'm not even halfway through the game, and I love it. It's not a game I think EVERYONE will love, but if you're a fan of detective games with good plotlines, you will definitely be happy with it. It seems simple at first, but you'll quickly realize how difficult it is to keep all of your karma and reputation intact. The dating portion is pretty solid, taking on the feeling of a good visual novel style of game.\n\nThe case aspect, for me, is a bit difficult - not only realizing what needs to be done in some cases, but I also don't understand the case rating system. I've failed some and gotten a C, and solved one in two days (that could have ONLY been solved on day 1 by gambling that I'd interrogate 3 characters successfully) and gotten a D. I think that would be my biggest concern in gameplay, because otherwise, I'm digging the stats and D-20 system.\n\nThey've added tons of replayability, with different story paths for different choices, 5 romance options, case endings differentiating, and randomizing the traitor. I'm absolutely going to continue playing, and will likely play it again!", "timestamp_created": 1452181901, "timestamp_updated": 1452181901, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20316023": {"recommendationid": "20316023", "author": {"steamid": "76561197993297997", "num_games_owned": 447, "num_reviews": 14, "playtime_forever": 146, "playtime_last_two_weeks": 0, "last_played": 1451979094}, "language": "english", "review": "It's a good game you can play for 30, 40 hours.\n\nBut I wouldn't recommend it.\nFirst, the art is weird. Both packs are hideous. \nSecond, it's not a roguelike where you take a lot of notes and eventually win. It's a gambling game where you take a lot of notes and eventually win - maybe, if you're lucky. You *can* influence every roll outcome but unless you already know every bit of gameplay, the d20 die will decide your fate.\n\nThere are about 30 rolls or so between every save point. Losing a roll means paying with your karma, school reputation or time. When you're out of time you lose karma and school reputation.\n\nThe visual novel bit doesn't make the game easier, it makes it more difficult (except for the Red Mask who can make your life much better in return for some nasty favors). More girls you have, the less you need to take notes and memorize every possible case. You can also completely screw up the story and find yourself in a personal hell. Oh, did you put all the training points in Intimidation for this girl? Well she's furious now for her own story reasons, so say goodbye and enjoy it.\n\nThis game is not fair, it's presented as a strategy but in reality it's just a gambling game.", "timestamp_created": 1451978134, "timestamp_updated": 1451978296, "voted_up": false, "votes_up": 18, "votes_funny": 2, "weighted_vote_score": "0.506641", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20273053": {"recommendationid": "20273053", "author": {"steamid": "76561198007861295", "num_games_owned": 61, "num_reviews": 1, "playtime_forever": 1955, "playtime_last_two_weeks": 0, "last_played": 1512090615}, "language": "english", "review": "only game where you can give your waifu a baseball bat and have her go bust some kneecaps so you can get into a good college. 10/10", "timestamp_created": 1451861061, "timestamp_updated": 1451861061, "voted_up": true, "votes_up": 1, "votes_funny": 4, "weighted_vote_score": "0.477966", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20162709": {"recommendationid": "20162709", "author": {"steamid": "76561197993781094", "num_games_owned": 266, "num_reviews": 15, "playtime_forever": 688, "playtime_last_two_weeks": 0, "last_played": 1453436816}, "language": "english", "review": "In Black Closet, you are playing as the president of an all girls school, tasked with handling the various events and controversies that may occur during the year. You are given a team of student countil members to help you maintain order and reputation at the school.\n\nThe first third of the game features your interaction with your board members and your attempt to discover the traitor amongst your team. Finding the traitor isn't necessarily difficult -- the traitor will tend to perform less adequately than your other team members. Otherwise, however, you get to interact with the team, and through this interaction you learn more about who they are. The characters themselves are relatively deep and well constructed; I think the art is a bonus in this regard, as it serves as another means of discerning how they act and what their personalities are.\n\nThroughout the game, you will be attempting to solve \"cases\", which are events that occur at the school. They represent typical happenings at a boarding school: vandalism, missing persons, etc. The overall breadth of possible random events is not very big -- you will face multiple repeats of past events. Luckily, the outcomes of the events change. For example, in my playthrough, I encountered the \"cheating\" event multiple times. One of the times, it turned out to be a cheating ring led by multiple girls; however, another time, it was merely a coincidence. Thus, you cannot assume the outcome of the events, even if you have played the event before. Nonetheless, you do fall into some patterns with the events -- for example, with a certain event, it eventually becomes obvious that it is more important to search for clues at key locations rather than interrogate the suspects. Nonetheless, it manages to stay entertaining throughout the play experience.\n\nThe gameplay itself is very interesting, with opprotunities to ponder statistics and strategies of handling the events. Rarely do you have only one event occuring at a time; thus, time management is a crucial aspect because each of your team members can only investigate one location or person at a time. Thus, there are some times when you may need to perform a cost benefit analysis to determine whether one event is more important to investigate than another, or if one event is a decoy that does not threaten the reputation of the school. Additionally, each of the student government councilors are better at certain actions over others, requiring specific thought as to who is best to assign for missions.\n\nThere are romance subplots in the game, and they are decently well executed. One complaint about the romance sub plots is that those dialogues will completely eclipse most other interraction with your team members, meaning that you lose the opportunity to learn more about your other council members. I assume this is to add to the replayability.\n\nSpeaking of replayability, I think there is significant room for replaying the game, as the events themselves are constantly changing. The traitor is also random, so you do not know who is sabotaging your investigations. Each playthrough will take a minimum of three or four hours, so it isn't a terribly long game, but the replayability is a factor working in its favor. The game itself is reasonably difficult as well, providing enough of a challenge to remain interesting.\n\nAs mentioned, the artwork is certainly aesthetically pleasing, as well as the music and sound effects.\n\nThe real quandary concerning this game is whether it is worth the price listed. I procured my copy for approximately $12. While that feels just a tad too high of a price for this game, I certainly do not regret the purchase, and I believe that developers who put forth the effort to create a quality product should be rewarded. If the price drops to $10 or less, this is absolutely a game I would recommend without question.\n\nIn closing, I do recommend this game in most aspects. The lack of a large pool of possible events is a little unfortunate, but otherwise I find it to be an engrossing game that features unexpected needs for strategic thought and statistical inference. A good game and a great playing experience.", "timestamp_created": 1451602236, "timestamp_updated": 1451602236, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.509188", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20009250": {"recommendationid": "20009250", "author": {"steamid": "76561198082436433", "num_games_owned": 220, "num_reviews": 69, "playtime_forever": 463, "playtime_last_two_weeks": 0, "last_played": 1451341762}, "language": "english", "review": "Black Closet is a great game.\n\nI'd say more but I'm trying to figure out how to win this case.", "timestamp_created": 1451248314, "timestamp_updated": 1451248314, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.454253", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19940535": {"recommendationid": "19940535", "author": {"steamid": "76561198200118851", "num_games_owned": 319, "num_reviews": 7, "playtime_forever": 695, "playtime_last_two_weeks": 0, "last_played": 1451236204}, "language": "english", "review": "An estrogen-filled version of Floor 13. As the Student President, your task is to preserve your school's reputation with a student body full of high school girls who do whatever they want and think they can get away with it.\n\nFrom exam counselling (Regardless of your daddy issues and your desire to get back at your family, you are not failing your next exam on purpose) to stopping them from personal embarassment (Your freedom of artistic expression is invalid; you are not putting a painting of a woman surrounded by tentacles on public display) to religious education (Black magic = bad). \n\nOh, did I mention that one of your minions is a traitor and you have three months to win her loyalty or lose a valuable minion forever? It's not Floor 13, but would play again.", "timestamp_created": 1451069206, "timestamp_updated": 1451069279, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500075", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19560611": {"recommendationid": "19560611", "author": {"steamid": "76561198052709775", "num_games_owned": 100, "num_reviews": 11, "playtime_forever": 927, "playtime_last_two_weeks": 0, "last_played": 1443515248}, "language": "english", "review": "Nutshell: Challenging gameplay, lovely art, interesting \"minion\" characters and romances available; suffers a bit from repetitiveness of cases and difficulty/non-intuitiveness of endgame.  \n\nI bought Black Closet because I played and adored Long Live the Queen.  I really enjoyed most aspects of the game, with the fact that it's all F/F romance and a Black protagonist being the icing on the cake.  The one major negative for me was the fact that the gameplay doesn't at all build on itself/prepare you for the endgame challenges.  You get a tutorial on solving cases, and just as you're starting to feel like you've gotten the knack for those in your first playthrough, you're getting near the end of the game and finding that you lack the appropriate stats to handle the plot-advancing cases.  If you scrape through those, the final boss encounter will still wipe the floor with you.  It's very much a game to play once expecting to lose and then look up a guide for, because there is no natural progression that leads you to expect what you will have to do at the end (or otherwise forces you to build your team to a degree that will let you handle it).", "timestamp_created": 1449554793, "timestamp_updated": 1449554793, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.524816", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19556810": {"recommendationid": "19556810", "author": {"steamid": "76561198068589368", "num_games_owned": 196, "num_reviews": 9, "playtime_forever": 856, "playtime_last_two_weeks": 0, "last_played": 1451070597}, "language": "english", "review": "Have you ever wanted to be a clandestine spymaster? Or run your very own secret police?\nHave you ever wanted to root out everyone's dirty little secrets and turn them against your enemies?\nHave you ever had dreams of stamping freedom and individuality beneath your heel? Creating a world where the unique are expelled and all conform to your regime? Where all opposition is crushed between your cold, ruthless palms? Where you are the cruel, undisputed ruler of all?\n\nWell now you can!", "timestamp_created": 1449533558, "timestamp_updated": 1449533558, "voted_up": true, "votes_up": 2, "votes_funny": 6, "weighted_vote_score": "0.498991", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18850861": {"recommendationid": "18850861", "author": {"steamid": "76561198069420601", "num_games_owned": 6246, "num_reviews": 47, "playtime_forever": 1072, "playtime_last_two_weeks": 0, "last_played": 1446526747}, "language": "english", "review": "One of my personal Games of the Year! Black Closet is developed by Hanako Games, which you may know from another game of theirs, [url=http://store.steampowered.com/app/251990/]Long Live the Queen.[/url] Black Closet packs intense and tactical gameplay with great storytelling, and I have yet to see a balance like this in other games. A heads up though, you may enjoy this game differently if the game play, as described below, isn't really your thing. The game also isn't easy (but there are options for that!) so there is definitely a learning curve.\n\n[h1]Thoughts, game play wise:[/h1]\nIn Black Closet, you play as the student council president of a prestigious girls' boarding school. If solving mysteries and [strike]power[/strike] is your thing, this probably already sounds interesting. Naturally, you have a lot of obligations and work to do though. The game play aspect of the game focuses on solving mysteries - if you succeed, you maintain your position, but if you fail, there are consequences, often long lasting. The game is a lovely combination of stats raising, resource management, and you must use a good combination of your skills versus your \"enemies\". \n\nEach case is randomly generated - if you play the game long enough you can kind of figure out some approaches to solve the cases, but they will not be the exact same. I loved how this game kept me on my toes the entire time, and it was the greatest feeling whenever I was able to solve a case on my own (felt lucky, oftentimes). Like real life, sometimes you will have a large amount of work dumped on you, but often there's actual scandal or dark intrigue involved (hopefully unlike your real life job).\n\nOverall you will need to keep track of your \"minions'\", which in this game means other student council members under you, and their stats as well as their loyalty. You then send them on different missions, which often don't take just one turn to solve, as you will have to gradually unravel mysteries, and battle using stats and dice rolls. So you'll really need to think tactically as there are all sorts of constraints against you, making the game really exhilarating to play. By the way, you could die as student council prez. You could die a lot.\n\n[h1]Thoughts, story wise:[/h1]\nYes, there is very rich story in this game. Everything is a mystery that you have to unravel - the cases you solve are mini stories in themselves, but there is also lots of main story line, which is about the school, your minions, your past and present, and other secrets. There are character routes for each of your minions, with multiple endings for each. I've played two whole routes and some partial ones, and each one had me emotionally invested as well as hooked. Each girl has their own past, sometimes intertwined with yours/ Elsa's, and the writing is amazing. I was playing Vonne's route, and felt emotions that I rarely feel in real life... It's very rare that I see a game that has such good story but also mind blowing game play, so this combination definitely earned Black Closet a games of the year spot for me.\n\n[h1]Other things to know:[/h1]\nThe replayability is very high for this game - apart from trying to get each character route which takes many playthoughs, you can also start custom and random modes. You can amp up the difficulty, and choose to focus on just solving mysteries if you so wish. You can even upload custom character pictures! If you can think of something to do in this game, Hanako Games really got our backs for this title. The game ran flawlessly for me, and I didn't experience any performance issues at all.\n\n[h1]Ending remarks:[/h1]\nI highly recommend this game, for the game play as well as the story. I personally found nothing bad to say about it, which is quite rare. There's very high replayability, deep, tactical gameplay, and lots of customization.\n\n~If you enjoyed this review, please check out the [url=https://steamcommunity.com/groups/completingthebacklog#curation]Completing the Backlog[/url] curator page, for other nice reviews by me and others!~", "timestamp_created": 1446522919, "timestamp_updated": 1451678103, "voted_up": true, "votes_up": 117, "votes_funny": 2, "weighted_vote_score": "0.913771", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18731628": {"recommendationid": "18731628", "author": {"steamid": "76561198031631176", "num_games_owned": 140, "num_reviews": 4, "playtime_forever": 1631, "playtime_last_two_weeks": 0, "last_played": 1506530773}, "language": "russian", "review": "Итак, очередное детище Hanako Games, независимой команды разработчиков, подарившей нам любопытный и интересный Magical Diary, сногсшибательную шоколадную конфету со вкусом яда Long Live The Queen, а также ещё несколько менее известных, но не менее заслуживающих внимания творений. Давайте же попробуем разобраться, что это из себя представляет!\nI) ИДЕЯ на первый взгляд может показаться тривиальной и скучной, вам предлагают стать президентом студенческого совета женской академии St. Claudine's, но это только на первый взгляд. За столь кратким определением скрывается руководство целой шпионской сети \"миньонов\", цель которой - всеми силами не допустить опорочивания репутации академии, в чём для ГГ присутствует и личный интерес, суть которого раскрывается по сюжету.\nII) Весь ГЕЙМПЛЕЙ представляет из себя раздачу миньонам приказов, анализ поступившей от них информации и поиск решения по определённому \"делу\" - ситуации, возникшей в академии и требующей срочного вмешательства. Другими словами, вы наверху и думаете, миньоны внизу и делают. Следует ли напоминать, что ответственность всегда на нас?\nIII) МУЗЫКАльное сопровождение подобрано замечательно, тут и добавить нечего, разве что особо восхитила тема Босса, ух!\nIV) Ну и пару слов про СЮЖЕТ: являясь \"сеньором\"(студент выпускного класса) академии, вы были назначены председателем студенческого совета, что стало для вас неожиданностью. Далее выясняется, что замысел руководства академии состоял в том, что на этом посту в случае роковой ошибки именно из вас легче всего будет сделать \"козла отпущения\". На протяжении всей игры вам предстоит решить множество \"дел\", изобличить предателя, выбрать в пару Королеву, вступить в тайное общество, и может быть,, если очень повезёт,  даже выпуститься!\nВ общем, игра захватывающая, интересная, достаточно сложная, обладает большой реиграбельностью - стоит своих денег по всем пунктам, особенно для любителей предыдущих игр от Hanako. Единственный крохотный МИНУС, который лично для меня не минус вообще - игра целиком на английском языке, однако достаточно простом для воспринятия, некоторым хватит и школьных знаний. \nP.S. В самом конце хочу добавить, что игра 100% юри, то есть вы можете завести романтические отношения со всеми (почти) миньонами, которые есть 5 девушек. + в игре присутствует возможность смены стиля рисовки (всегда играю на втором), на вкус и цвет каждого.\nИТОГО: Как говорится, 10 яндере из 10. Иии помните: один из ваших миньонов - предатель.", "timestamp_created": 1446061654, "timestamp_updated": 1446061654, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.723928", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18727799": {"recommendationid": "18727799", "author": {"steamid": "76561198169199445", "num_games_owned": 47, "num_reviews": 2, "playtime_forever": 5939, "playtime_last_two_weeks": 0, "last_played": 1449888132}, "language": "english", "review": "Are you good enough to get into a prestigious college?\n\nWell, you better hope you are, because that's your ultimate goal as Black Closet's main character Elsa Jackson. Actually achieving that goal requires a successful term as president of your school's student council, and achieving that goal requires putting the lid on several potential scandals without damaging your own credibility too badly. Let me tell you, there are a [i]lot[/i] of potential scandals, and other forces at work may end up making your life more difficult. But first you need to identify and neutralize the traitor within your ranks...\n\nBlack Closet is about solving the mysteries in your school. A few times a week, one or two new cases will be brought before you, and it's up to you to get the bottom of them before they erupt into a scandal that could damage the school's reputation (maybe). Each of your minions has their own stats (which can be raised with point from successfully solved cases), and picking the right minion for the right job is critical to your success. Your targets have their own stats, and your minion can only get the right results if their stats are higher than their target's. Complicating this is chance itself - a twenty-sided die that adds a random number of points to each participant in a confrontation. Failed encounters during harsher actions like harassment or detention will make you look bad, as will targeting an innocent person. You have two bars measuring your success - School Reputation and Council Karma (measuring the student body's opinion of the council itself). Letting either fall to zero is a game over, as the higher-ups of your school will be all too happy to sacrifice you to save their own skins.\n\nThere's definitely replay value in Black Closet. The most obvious is the romance paths with each of your five minions (two of which have an a path and a b path), and it's only through these that you can completely unravel your minion's characters. Cases are randomly generated except for the big storyline ones (which can still have variations between them), and many cases start out similarly but have very different solutions. The traitor is also randomly chosen (though players who have beaten the game have the option of selecting the traitor herself), so targeting the same person in every playthrough will rarely work. And of course, if you just want to solve mysteries free of plot-involvement, there's a custom campaign mode that allows you to create your own minions and work on cases alone for a set number of weeks (though careful! That mode has its own special challenges).\n\nMusic and graphics set the mood (and please don't ignore art style 1 when it comes to CGs).The writing is solid, as it needs to be for a game like this and as it typically is for a Hanako Games product. Characters may seem like simple at first, but each have their own personalities and motivations which become clear in their own routes (and makes how any of your minions could be the traitor feel natural). And of course not everything's serious - sometimes humor is found where one least expects it.\n\nHighly recommended.", "timestamp_created": 1446045757, "timestamp_updated": 1446045757, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.605582", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18600535": {"recommendationid": "18600535", "author": {"steamid": "76561198009802063", "num_games_owned": 2527, "num_reviews": 70, "playtime_forever": 1584, "playtime_last_two_weeks": 0, "last_played": 1445737986}, "language": "english", "review": "This game is great. I feel I am understating. \nThis game is epic. I feel I am understating. \nThis game is the most awesome, best, game of the year. I feel I am understating. \n\nThis game is full of mystery, darkness, wonderfulness, and intrigue.\n\nIt plays out as a board game. Resource management, sending out your minions to solve cases within the school. It's also got a lot of VN segments, where you get to talk to your minions, possibly date them, and also work out which of them is a traitor. Then there is some further mystery which I am not going to talk about at all because spoilers.\n\nBut let me tell you; [b]the girls are a mystery too[/b]. Over your playthroughs you will get to unravel their personailities. And more! It is delicious.\n\nIs there replayability? Yes. Every time you play, the traitor is different, and the cases within the board game are different. Plus, there are so many choices you can make in the VN side of the game, and find out more what's going on, what you can do about it, and about the girls and romancing them... and you can walk yourself into a lot of different outcomes. There are a lot of layers to work out, and it's a ton of fun to do so.\n\nI just worked out how to resolve things in a certain way last night, and I felt like \"this is epic! I am a genius!\" even though in reality all I've managed to do is take several playthroughs to put 2 + 2 together. \n\nThis game is so great!\n\nOh btw - this game works fine on desktop PC but I also found that it works magnificently if you try to play it on a tablet PC. Yes. I know what you're thinking. \"You mean, this game.... I can take it to bed?\". That is exactly what I am saying. Have fun! :D", "timestamp_created": 1445437971, "timestamp_updated": 1445438117, "voted_up": true, "votes_up": 16, "votes_funny": 2, "weighted_vote_score": "0.654991", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18565433": {"recommendationid": "18565433", "author": {"steamid": "76561198075988666", "num_games_owned": 3039, "num_reviews": 74, "playtime_forever": 197, "playtime_last_two_weeks": 0, "last_played": 1486776388}, "language": "english", "review": "Greetings fellow gamers! This is Gamer Guy (In a Suit) from the Echo Army YouTube channel! Today I am bringing you a review of Black Closet! \n\n(NOTE: This game was reviewed using a key provided by the Developer)\n\nVideo Review: \n\n[url=https://youtu.be/GamCirNtPSc] Black Closet Review\t[/url]\t\n\nThe \"Too Long, Didn't Watch\" Review:\n\nA delightful game. A TON of replayability. Intriguing charachters, interesting scenarios. Easy gameplay/controls. Addicting game. 4.5/5 \nWorth the $20\n\nThe \"Meat & Potatoes\" Review:\n\nThe game play is superb. What can I say? Great graphics, solid sounds, comfortable and addicting gameplay. Very much like running the mafia....except at an all girls school! You have minions, traitors, harassing, interrogating and more. An absolutely fantastic detective/mystery type game with solid elements of Simulators, Strategy Games and even RPGs present. Fans of Long Live The Queen will enjoy this game quite a bit. There really isn't much to tell you about this game short of \"it's actually worth the full price!\" This has certainly been one of the best games I have played over the last 6 months. Games like this are precisely why I enjoy PC gaming more than console gaming. Almost a truly perfect game, just falls somewhat short as I can concept running a little thin after, oh, 40-60 hours of gameplay or so. That is NOT bad at all. This gamer hesitates greatly to give out a 5 to ANY game, this one falls JUST short. Definitely a 4.5 out of 5 stars and worth your $20 any day.\n\nHappy Gaming!!!", "timestamp_created": 1445249671, "timestamp_updated": 1445249671, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.503549", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18547581": {"recommendationid": "18547581", "author": {"steamid": "76561198071721589", "num_games_owned": 131, "num_reviews": 24, "playtime_forever": 935, "playtime_last_two_weeks": 0, "last_played": 1443467478}, "language": "english", "review": "Possesses all the relevant charm from a visual novel / choose your own adventure game and combines it with minor board game-esque mechanics.\n\nThe individual ingredients are perhaps not all that original. Having to make your way through a school year and make defining choices each day is hardly a new concept, especially after playing Persona 4. Leveling up character stats to pass random RNG skill checks is a pretty staple mechanic. Having multiple story paths dependant on choices, and throwing in a random mystery traitor into the mix... a lot of VNs do the same thing.\n\nYet it all molds together to make a pretty original and exciting premise. And the replay value exists because of how well the random aspect of the game is handled. You solve cases by uysing your characters to question/ investigate/ harrass/ stalk and persuade the matter to a conclusion, which in turn saves your school and council reputation. As the game progresses you encounter situations requiring more out of your characters 4 skills, and that is where you must plan ahead so as to not lose the game by crashing on the caseload you receive.\n\nIt is true that there probably needed to be a lot more variety to cases. Meta knowledge of the game could probably make it a bit trivial toward the end. And the random traitor aspect needed to have more variables to make it more tricky and defining.\n\nOtherwise, this is a solid niche experience, that really should be as popular as LLtQ.", "timestamp_created": 1445170529, "timestamp_updated": 1445170529, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.444185", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18463815": {"recommendationid": "18463815", "author": {"steamid": "76561198182521258", "num_games_owned": 47, "num_reviews": 8, "playtime_forever": 1787, "playtime_last_two_weeks": 0, "last_played": 1445045738}, "language": "english", "review": "This game is toothsome. The characters are surprisingly nuanced and the branching of potential plots is gigantic -- I've played a few times through on easy mode and a time or two on normal. The game's frequent save points gives you an out to take risks and backtrack easily. (I am lousy at games and appreciate this feature.)\n\nThere are multitudes of tiny details that go differently even in playthroughs that seem similar. My most recent playthrough included something new to me, [spoiler]winning back the traitorous minion, which I only knew to try because of the Accomplishments for the game -- and which was only possible because of the \"fixed traitor\" replay option.[/spoiler]\n\nBlack Closet is thoughtful, expansive, dramatic, and very funny at times.", "timestamp_created": 1444787377, "timestamp_updated": 1444787377, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500175", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18423523": {"recommendationid": "18423523", "author": {"steamid": "76561198006795437", "num_games_owned": 168, "num_reviews": 14, "playtime_forever": 1186, "playtime_last_two_weeks": 0, "last_played": 1444772296}, "language": "english", "review": "Definately not for everyone, but excellent at what it does.  I'm still a little leary about recommending it at it's regular price point but it's not a rip-off or totally unwarrented either.\n\nThere's a lot more reviews doing a lot better at the overall picture so I'll emphasize the main thrust of the game: time management and mystery solving.  The nice thing about the game is that they're actual mysteries, it's not always suspect X or the same solution every time.  You have to use logical deduction and the skills of your minions to solve the cases. This can be a challenge when you include the possibility of a traitor, cases that literally aren't worth your effort, and a real crunch in the time available to you.  Solve a case quickly and well and you'll get some precious skill points to improve your minions skills.  Fail and you can face a nasty hit to your 'life points' (school reputation and council karma in this game) loss of minions... or nothing at all since some cases are essentially red herrings.\n\nThe story is... better then average but that's not saying much.  It kept me interested in various characters and mildly intrigued but it's not worth getting the game for.  Still, I'm impressed by this relatively rare game focus and recommend fans of mysteries and logical deduction put it on their watch lists.\n\n", "timestamp_created": 1444547210, "timestamp_updated": 1444547210, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18407155": {"recommendationid": "18407155", "author": {"steamid": "76561197972361170", "num_games_owned": 178, "num_reviews": 11, "playtime_forever": 517, "playtime_last_two_weeks": 0, "last_played": 1474940459}, "language": "english", "review": "If you enjoyed Long Live The Queen, you'll enjoy this game. \n\nI haven't even come close to beating a run in it yet (Assuming a game lasts one school year I got about half way), but from what I've seen this is a solid game. While your investigation checks do use rng, It's mainly based on your stats. Those can only be raised by completing missions, and the amount of stat points you get are based on how effectively, and quickly, you complete a case. This, combined with multiple cases, and your 4 minions having a fatigue bar to manage, and the game is quite challenging, at least so far. \n\nLike Long Live the Queen you can fail a skill check (and in this game cases) without getting a game over, though you have to maintain your school reputation, as well as that of the student council, so the more quests you fail, or the more inappropriate actions you take, the sooner you're going to fail the game. \n\nI haven't fully figured out the optimal strategy yet, but the game is a lot of fun. The RNG element is also great, since it prevents this game from becoming the mindless walkthrough game some people thought Long Live The Queen was. \n\nAs far as cons for the game go, I don't have many. I think one of the cons I have is sometimes the RNG is brutal. To give an example, I got a case that should have been open and shut. A girl stole another girls watch, after saying she was interested in it. I searched her room and found evidence the girl had the watch, and she acted suspicious when questionsed about it. However I failed to get a skill check that passed by enough to actually pin the blame on her. This escalated to the point where she stole from 5 more girls, and tanked the school reputation so hard, that about a month later my game came to an end.\n\nAt the time of writing this I've only played about 3.5 hours, so I haven't seen if that type of quest difficulty is common, though the fact that level of rng can exist is a little annoying. \n\nBesides that unlucky rng though I have no real complaints about this game. \n\nWith multiple character routes, I believe you can get at least 20-30 hours of content from this game, possibly more if you fail a lot while learning the mechanics. With that being the case I strongly recommend this game, especially if you can get it on sale.", "timestamp_created": 1444462362, "timestamp_updated": 1444462362, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18403730": {"recommendationid": "18403730", "author": {"steamid": "76561197977186427", "num_games_owned": 662, "num_reviews": 20, "playtime_forever": 1229, "playtime_last_two_weeks": 0, "last_played": 1445724141}, "language": "english", "review": "This is a cool game for people who like reading and/or rolling D20s.\n\nSeriously though it's a really neat little game, part visual novel and part detective saga; unfortunately, it's hobbled by a clunky, low rent UI and a price that's probably a little too high for what it offers. The randomly-generated cases work well with a surprising amount of variety in the possible outcomes, and the resource/time management aspects of creating tension and leading to interesting dilemmas regarding who should be sent where.\n\nThe story and dialogue gets a bit melodramatic at times, but it feels appropriate for a game about conflicts between high school girls at an all-female academy. I enjoyed the character development that I saw (I didn't complete everyone's story arcs), even though most of them start off as pretty standard archetypes. To me, at least, the constant stream of cases does a good job of alleviating a major issue with visual novels: every playthrough is unique! The standard \"pick these options to go down this path\" setup still exists, but the player isn't just fast-forwarding through the rest of the game during subsequent playthroughs.\n\nTo be honest, Black Closet is a tough sell at full price; it's a fascinating concept that's executed reasonably well, but it doesn't feel meaty or polished enough for $20. Once it's on sale, though? If you're at all intrigued by this game, get it!", "timestamp_created": 1444438008, "timestamp_updated": 1444438008, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.651250", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18340321": {"recommendationid": "18340321", "author": {"steamid": "76561198138621063", "num_games_owned": 174, "num_reviews": 24, "playtime_forever": 98, "playtime_last_two_weeks": 0, "last_played": 1450198239}, "language": "schinese", "review": "非常赞的文字冒险游戏。\n\n比普通的文字冒险游戏形式有所创新，游戏的日常流程是派手下去处理学校内的突发事件。看似相同的事件可能有完全不同的原因，也有多种解决办法。节奏很快，自由度比较大，分支众多。角色性格的塑造感觉是比较扎实的，就是主线稍微弱了一点。因为是女子学校，所以全是百合情节：）喜欢的玩家不要错过。\n\n值得一提的是这个游戏公司 Hanako Games，之前的作品口碑都相当不错，很善于塑造坚强的女性形象和阴谋类型的故事线。喜欢本作的玩家，之前的作品《Long Live the Queen》和《Royal Trap》等也强力推荐。\n\n个人评分 8/10", "timestamp_created": 1444048676, "timestamp_updated": 1444048676, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.653907", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18267666": {"recommendationid": "18267666", "author": {"steamid": "76561198012952660", "num_games_owned": 360, "num_reviews": 45, "playtime_forever": 389, "playtime_last_two_weeks": 0, "last_played": 1451587088}, "language": "english", "review": "Satisfactorily difficult, nicely written, quite original (and a nice build up from their previous game, Long live the Queen, which I also recommend), there's a lot to like in this game.\nOn the other hand, if your tolerance for Japanese style characters and preposterous teenage stories is low, then... maybe it's not quite the game for you.", "timestamp_created": 1443643980, "timestamp_updated": 1443644216, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.500624", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18199184": {"recommendationid": "18199184", "author": {"steamid": "76561198152727086", "num_games_owned": 389, "num_reviews": 23, "playtime_forever": 306, "playtime_last_two_weeks": 0, "last_played": 1443254948}, "language": "english", "review": "Overall a very fun game and kept me hooked all on one play though. A great atmosphere and intriguing cases to solve, while making sure to keep your balance between karma and reputation, was quite engaging.\n\nThe characters you interact with, were quite good and were interesting, but nothing groundbreaking. Never the less, they helped move everything along and were hardly 1-dimensional. My one complaint about setting was the whole “ruthless leader” image they try to force. (why do I consider the counsel members “minions” again?). It's a bit eye-rolling, especially when you can be quite nice at times, and you are just trying to keep these dang students from burning the school down (quite literally at times).\n\nThe only real flaw is that the game could really use some sort of tutorial or guide for the more confusing parts of the game. It took me almost half the game to figure out how to properly detain a lot of troublemakers, and i lost a lot of reputation just because I knew who the troublemaker(s) were but had no idea on how to get them to stop. Another example was the boss of the game, the “fight” was just given to me, and having not EVER to deal with the new game mechanic, I had to intentionally lose, just to find out what everything did.\n\nIn the end tho, the game was a unique experience that I had fun playing, and ignoring a few bumps, always kept me on the edge of my seat.", "timestamp_created": 1443259537, "timestamp_updated": 1443259537, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "4.995006", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18178090": {"recommendationid": "18178090", "author": {"steamid": "76561198029143495", "num_games_owned": 331, "num_reviews": 16, "playtime_forever": 492, "playtime_last_two_weeks": 0, "last_played": 1465338095}, "language": "english", "review": "This is a beautiful game.", "timestamp_created": 1443133331, "timestamp_updated": 1443133331, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18177359": {"recommendationid": "18177359", "author": {"steamid": "76561198090583680", "num_games_owned": 100, "num_reviews": 10, "playtime_forever": 1971, "playtime_last_two_weeks": 0, "last_played": 1443127884}, "language": "english", "review": "This game is extremely entertaining ,and farnkly, somewhat addictive. With a perfect balance of story ang gameplay I found myself replaying it over and over out of curiousity about the complex secrets sourrounding St. Claudine's and the complicated charcters sourounding it. While not another pervy game with anime girls in demeaning outfits it can be romantic and downright sensual to a certain degree (though never graphic it's more suggestive but still sensual and romantic as well as having some really beautiful artwork). Appealing graphics, sensual lesbian romance, intriguing mysteries, a fascinating story driven by your choices, high replayibility, and many different endings made for a game that i thouroughly enjoyed and think other will enjoy. Granted not everyone might like it (for example gamers who mainly enjoy games like COD or Donald Trump).", "timestamp_created": 1443129301, "timestamp_updated": 1443129301, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.504702", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18174872": {"recommendationid": "18174872", "author": {"steamid": "76561198007251402", "num_games_owned": 32, "num_reviews": 1, "playtime_forever": 1459, "playtime_last_two_weeks": 0, "last_played": 1443051668}, "language": "english", "review": "Fun and satisfyingly challenging.", "timestamp_created": 1443116642, "timestamp_updated": 1443116642, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18166279": {"recommendationid": "18166279", "author": {"steamid": "76561198040093463", "num_games_owned": 350, "num_reviews": 80, "playtime_forever": 717, "playtime_last_two_weeks": 0, "last_played": 1451320366}, "language": "english", "review": "If Long Live the Queen and Magical Diary are Hanako Games' Superman, then Black Closet is Batman.\n\nThis game is hard. Even on Easy. Even when you know what you're doing.\nOkay, well, maybe not THAT hard.\n\nUnless you decide to break Vonne's mind. Then - yes - it's that hard.\n\nHanako, why do you have to make Intrigue and Resource Management so much fun?", "timestamp_created": 1443055089, "timestamp_updated": 1443055699, "voted_up": true, "votes_up": 5, "votes_funny": 3, "weighted_vote_score": "0.530591", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18164039": {"recommendationid": "18164039", "author": {"steamid": "76561198026988769", "num_games_owned": 161, "num_reviews": 10, "playtime_forever": 293, "playtime_last_two_weeks": 0, "last_played": 1444079038}, "language": "english", "review": "This is challenging on default difficulty, but definitely absorbing.", "timestamp_created": 1443040410, "timestamp_updated": 1443040410, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18163710": {"recommendationid": "18163710", "author": {"steamid": "76561197962166025", "num_games_owned": 362, "num_reviews": 3, "playtime_forever": 738, "playtime_last_two_weeks": 0, "last_played": 1443222248}, "language": "english", "review": "Note to self: there's always a traitor.", "timestamp_created": 1443039060, "timestamp_updated": 1443039060, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.577496", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18160650": {"recommendationid": "18160650", "author": {"steamid": "76561197991808695", "num_games_owned": 169, "num_reviews": 54, "playtime_forever": 546, "playtime_last_two_weeks": 0, "last_played": 1443383580}, "language": "english", "review": "An investigation game, with romance/dating elements, where you play as a domineering S&My woman, in a all women setting.  Game of the year! \n\nBut in all seriousness, this game is very well written, complex, and immersive. Ive never played a game with a romance sim undertone, where you were a dominate female. Usually in a F/F romance setting your almost always submissive and loyal, almost to a fault... not this game. It puts you in the roll strong female lead that commands respect both on the job, and with her romance choices XD. It handles the somewhat taboo themes with extrodinaire taste, that is a real joy to watch unfold. Your not so domineering that your crushing your romance options spirit or mind, your simply being the master and commander, they swoon at the knees for.\n\nOh... and then there's the actual investigation/gameplay. Its pretty fun and engaging, it doesnt really get old like you might think it would, the random elements and the variety of options on how to solve the case, keeps it fresh\n\nOne little complaint is the difficulty. It can be unforgiving at times, even if you know what your doing, which the first time you play, you wont. The random hand of fate can turn into a fist and swing the entire game into a doomed scenerio, so save often... not that you CAN. You can only save at the end of each week, which is a real pain, when you have to go through scenes and even dates over and over again if your trying to tip toe over failing a crucial investigation. \n\nSpeaking of early on difficulty, there's a traitor in your team, and the way you deal with it requires you to A. Befriend them by going on outtings with them so they feel to guilty to betray the team. Or B. Figure out whose the one failing on purpose through trial and error (you'll have to do that anyways to find out who they are.) and then EXPEL them from the school, and thus expelling them from the game!  SO you'd have to finish the game with only 4 henchmen, not 5, each one bringing vital skill combinations to the table. This wouldnt be such an issue, if it wasnt for the fact you dont have enough outtings to fully befriend more then 2 people, so I recomend saving after the first week and if its impossible for you in other saves AFTER figuring out who the traitor is, going back and making sure you fully befriend them as well as your romance interest of choice. This is actually alot of work, so this game isnt just a tip toe through the toolips, it requires throught and planning.\n\nBUT those are just minor annoyances, that Im not sure if I would even want to change, but their there. This game is a unique, amazing experience, and Im very glad I bought it.", "timestamp_created": 1443024731, "timestamp_updated": 1443024731, "voted_up": true, "votes_up": 6, "votes_funny": 2, "weighted_vote_score": "0.586740", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18153513": {"recommendationid": "18153513", "author": {"steamid": "76561198001530298", "num_games_owned": 168, "num_reviews": 30, "playtime_forever": 428, "playtime_last_two_weeks": 0, "last_played": 1444765950}, "language": "english", "review": "Maybe you are happy with space marines, psychotic criminals, or one-eyed cyber soldiers. For me, the only thing I've ever wanted to be was a tyrannical student president, ruling over a girl's school full of lesbians with an iron fist. Black Closet made that dream come true.", "timestamp_created": 1442972520, "timestamp_updated": 1442972520, "voted_up": true, "votes_up": 90, "votes_funny": 190, "weighted_vote_score": "0.768371", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18141047": {"recommendationid": "18141047", "author": {"steamid": "76561198078045024", "num_games_owned": 199, "num_reviews": 17, "playtime_forever": 4359, "playtime_last_two_weeks": 0, "last_played": 1467599260}, "language": "brazilian", "review": "Black Closet foi desenvolvido pela Hanako Games. dos mesmos criadores de Long Live the Queen.\n\n- Esta análise não contém spoiler-\n\nBlack Closet foi feito carinhosamente para jogadores que gostam de games de ESTRATÉGIA/RPG/TABULEIRO, Long Live the Queen era quase que um RPG onde era seu personagem conduzia a história se espelhando em suas habilidades desenvolvidas. Black Closet não é igual Long Live nesse aspecto e não deixa nada a desejar por causa disso.\n\nNo enredo você é a \"Chefona\" (Ou chefão se preferir) que é eleito para o conselho estudantil de um colégio feminino, as estudantes moram no próprio colégio, você será encarregado cuidar da escola e do conselho estudantil, a tematica do jogo embora se passa em ambiente escolar, você poderá investigar,interrogar, persuadir, vigiar e entre outras opções que estiverem ao seu dispor para determinada ação, o enredo é muito interessante e a dificuldade do jogo é bem amarga, se vc é um jogador hardcore de estratégia não irá se depecionar.\n\nSobre o gameplay, temos o \"tabuleiro\" que é representado por sua mesa do conselho, as pessoas, objetos e lugares são representados por cartas, cada carta tem seus status, onde cada ação será jogado o clássico D20 (Dado de 20 lados) e então a comparação de status é feita, tendo a possibilidade da pessoa com menos habilidade ganhar na rodada, pastas na sua mesa representam as missões pendentes e lá dentro tem o log da missão, cada ação que você tomou estará detalhado dentro das pastas.\nAo seu dispor você terá membros do conselho estudantil, os seus subordinados são as suas peças mais valiosas, além de dar  o comando a eles, existe um sistema de lealdade sobre eles, é muito interessante porque na campanha, dependendo das suas ações, o rumo da história muda.\n\nTive que ter duas gameplays pra determinar algumas dicas, caso você goste de descobrir tudo na raça, ignore o que vier abaixo.\n\nDicas:\n\n1 - A mais importante, os pontos gastos precisam ser gastos sabiamente, não gaste-os à toa.\n\n2- Você terá total liberdade de conduzir a investigação, tem vários métodos de se concluir a mesma investigação, mas também tem vários métodos para se falhar, mantenha isso em mente.\n\n3- O game tende a repetir missões, porém, essas missões, mesmo você ache que a missão são repetidas, elas não são repetidas, os acontecimentos irão variar, e os desfechos também, isso fez com que eu falhasse em uma tonelada de missões.\n\n4- Quanto melhor o desempenho na missão, melhor você é recompensado.\n\n5- Siga sua intuição", "timestamp_created": 1442896301, "timestamp_updated": 1442896913, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "4.980100", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18134642": {"recommendationid": "18134642", "author": {"steamid": "76561198014901411", "num_games_owned": 1507, "num_reviews": 3, "playtime_forever": 974, "playtime_last_two_weeks": 0, "last_played": 1444078233}, "language": "french", "review": "Un jeu d'enquêtes générées aléatoirement où l'on incarne une lesbienne pouvant sortir avec les élèves sous ses ordres.\nSi ça vous suffit pas, je peux rien faire de plus pour vous.", "timestamp_created": 1442857042, "timestamp_updated": 1442857042, "voted_up": true, "votes_up": 8, "votes_funny": 18, "weighted_vote_score": "0.514507", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18125459": {"recommendationid": "18125459", "author": {"steamid": "76561198023892474", "num_games_owned": 251, "num_reviews": 25, "playtime_forever": 624, "playtime_last_two_weeks": 0, "last_played": 1471767437}, "language": "english", "review": "Great little game!\nI tried out the demo first (from the developers website)- and was hooked. Could not stop playing!\nI love the setting, the story (high school, investigations and a secret society- what is not to like?) and the atmosphere, and the art is great, too (but like the anime art set better than the classic one, yes, there are 2 art sets to choose from!).\nThe game is quite challenging, even on easy, and you will have to try several times to find the right strategy on how to handle cases. \nFully recommended to people who like solving mysteries!\nIf you are not sure, try out the demo which lets you play the first part of the game where you have to hunt for the traitor- but be prepared to get hooked!", "timestamp_created": 1442791647, "timestamp_updated": 1442791647, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.505419", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18117424": {"recommendationid": "18117424", "author": {"steamid": "76561198018696864", "num_games_owned": 223, "num_reviews": 1, "playtime_forever": 745, "playtime_last_two_weeks": 0, "last_played": 1458241710}, "language": "english", "review": "Black Closet, a mix of mistery and VN elements. Thats something you dont see everyday.\nYou are a Highschoolgirl in one of this highclass schools in Imbetterthanyoutopia. You're Student Council President and need to protect the School image by any means nessesary. Heres where the mistery begins. You solve cases/puzzles through various actions like a nice and friendly talk, or you just detain people until they break. Its just like your classical overthetop anime since you have almost as much pover as that girl from killakill.\nThe cases are randomly generated and actually quite hard to figure out sometimes. Ofc there are schematics that repeat themselfs after you have senn them all, but that certanly takes some time.\nThe VN part comes into play with your 5 Minions who you can befriend at weekends. They do seem pretty shallow at the beginning but they get more interesting the more time you spend with them.\n\nBut does all this work? Yes and no.\n\nThe good side of the game is that it just works i guess. The cases are fun and dont become repetetive that early on. The caracters are all interesting and the VN part does a really good job.\n\nThe bad things on the other hand go way more into detail. It starts of with the information given at the start which is pertty much not more than I have given until now. No mechaniks, no Stats, basically nothing gets properly explained, which leads to a lot of trail and error at the beginning. Also the VN part could be a little more informative before, since even though this is a Lesbian Romance game you cannot romance everyone. Two of the girls are actually underaged and therfore not openly romancable, since the image of the school wouldnt allow it to begin with, which is a great touch of realism, but it needs to be said at the beginning. I started the game 2 times hoping to get my favorite girls and boom, you're to old after 2-4 hours, go fund yourself. Also one of the girls is only romancable if she was the traitor, and the chances for her to be one is actually lower since she is a pretty hard opponent. Again a 3rd time I had to restart after wondering why nothing happend anymore.\n\nEven though there is so much to criticise here, I would still recommend the game to every fan of VNs or Hanako Games other games like Long live the princes. It is hard, its enjoyable, and after you figured everything out, an overall great game.", "timestamp_created": 1442756429, "timestamp_updated": 1442756429, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18110499": {"recommendationid": "18110499", "author": {"steamid": "76561198064414264", "num_games_owned": 2308, "num_reviews": 19, "playtime_forever": 664, "playtime_last_two_weeks": 0, "last_played": 1448791702}, "language": "english", "review": "I feel like writing another review. I'm lazy enough to not write much so go figure, friends that read my reviews know I'll just write whatever comes to my head which can be either a lot or not much. \n\nThis game comes from Hanako Games, the makers of Long Live The Queen. I have a lot more than 8.5 hrs in the game, it should be at least a few days worth- I owned the game before it was on Steam, so that's just my steam play-time.\n\nBlack Closet is an interesting, logical investigation game. The mechanics are good and the game is fun. There's an achievement checklist and a decent amount of replay value. Investigations have different branches so they're not always the same, one of the core mechanics: who the Traitor is, changes each game, and there are at least six different storyline branches based on who you choose as Harvest Queen after the first major part of the story. \n\nThe game has different difficulty settings, and is challenging the first time around on default settings. Oh and this one is just a personal preference: I like the background musics on this one, they're relaxing to listen to and suit the theme well too.\n\nCheck out the screenshots and the video, if it seems like your kind of thing, I'm sure you'll enjoy it as much as I did.\n\nCheck Hanako Games if they like these too- they have more games that didn't come to Steam:\nhttp://www.hanakogames.com/\n\n\nUpdate: I forget there's a custom campaign mode too, which was added after I beat the game the first few times. Quoting the dev:\n\n\"Normal campaign mode ends at the end of the school year, if you've made it that far. There are several ways it can end early.\n\nThere's also a custom campaign mode where you set how many weeks you want to play for and how many cases you want to handle every week. In that mode, you also get to use your own characters instead of the default ones, and can set yourself extra challenges like starting with a smaller team.\"", "timestamp_created": 1442719668, "timestamp_updated": 1442755085, "voted_up": true, "votes_up": 32, "votes_funny": 1, "weighted_vote_score": "0.674887", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18108417": {"recommendationid": "18108417", "author": {"steamid": "76561198047609043", "num_games_owned": 405, "num_reviews": 68, "playtime_forever": 698, "playtime_last_two_weeks": 4, "last_played": 1515981301}, "language": "english", "review": "Welcome my friends, to Loli Princess's Cooking Class\nToday we will make Yuri VN Cake, with a pinch of roleplaying.\nAll ready, let's start then!\nImagine yourself as Sherlock Holmes.\nGood, now, Imagine Sherlock Holmes as a Highschool girl.\nExcellent, now, Imagine Watson and every other character as a Highschool girl.\nSounds good, no? Now, add a tablespoon of mysteries to solve\nOne tablespoon of drama, one of betrayal, one of action\nAnd finally, ADD THE WHOLE FREAKIN' CAN OF YURI LOVE.\nMix with passion, the same passion that two young girls put when kissing.\nWe are looking for a good consistence. Once we achieve that, we pour our mix on a mold and into the oven we go.\nTemperature? HOT, GOD AWFUL HOT, AS THE BURNING FLAMES OF YURI LOVE.\nWe let it bake for 45 mins and then we let it cool.\nNow, this is where the magic happens. Decorations! To set this cake aside from plain and boring Yuri cakes, we need beautiful decorations. We add interesting characters, gorgeous art, the correct music for the situation and the element of Randomness of course. A little chaos is good once in a while.\nThere, it smells heavenly, isn't it?\nThis, my friends, is what a Gorgeous, magnificent and truly mouth watering Yuri VN is.\nHope you enjoyed this cooking class. \nNext time, on Loli Princess's Cooking Class: How to NOT Ruin your VN.\nSee you next time!", "timestamp_created": 1442706867, "timestamp_updated": 1442707178, "voted_up": true, "votes_up": 12, "votes_funny": 33, "weighted_vote_score": "0.499666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18094915": {"recommendationid": "18094915", "author": {"steamid": "76561198069685070", "num_games_owned": 122, "num_reviews": 18, "playtime_forever": 359, "playtime_last_two_weeks": 0, "last_played": 1447874086}, "language": "english", "review": "Good, but short (approx. 5-6 hours.)  It has some decent replayability; however, that doesn't quite excuse its lack of depth with regards to the main story line.  I wouldn't want to pay full price, but if you can get it at a steep enough discount, I'd say it's a good way to kill a few hours.", "timestamp_created": 1442645475, "timestamp_updated": 1442645475, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.459958", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18089453": {"recommendationid": "18089453", "author": {"steamid": "76561198133282265", "num_games_owned": 218, "num_reviews": 11, "playtime_forever": 709, "playtime_last_two_weeks": 0, "last_played": 1442715003}, "language": "english", "review": "Enjoying this a lot more than Long Live the Queen so far. It's much less \"visual novel\" -- there's still that component to it, but the gameplay is a bit tighter. The interface is awful; it's hard to see what you have selected and awkward to navigate -it should be simple to click on 3 things but this game makes it annoying and easy to mess up. The mini-mysteries you solve are kind of repetitive -- you'll see the same ones come up multiple times though theyc an have different solutions. Still, they're fun to figure out and try to optimize.\n\nThe romance aspect is interesting -- in LLTQ you barely got to know the princes you could choose to marry, but in this the romantic partners all have seperate (mostly stereotypical anime girls, but with a twist) identities and since you have a lot of chances to interact with them, you develop a strong connection.\n\nAside from interface woes, this game is a lot of fun. It's unfortunate to see it's getting much less attention than LLTQ, because IMO it's the superior game.", "timestamp_created": 1442609822, "timestamp_updated": 1442609822, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.626633", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18080133": {"recommendationid": "18080133", "author": {"steamid": "76561198014273403", "num_games_owned": 452, "num_reviews": 28, "playtime_forever": 548, "playtime_last_two_weeks": 0, "last_played": 1491142150}, "language": "english", "review": "Very excellent game. Essentially, a VN with gameplay, in the same vein of LLTQ, and if you like LLTQ, you'll almost certainly like this.", "timestamp_created": 1442553687, "timestamp_updated": 1442553687, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18079612": {"recommendationid": "18079612", "author": {"steamid": "76561197984195486", "num_games_owned": 937, "num_reviews": 120, "playtime_forever": 46, "playtime_last_two_weeks": 0, "last_played": 1442547883}, "language": "english", "review": "What this game is not: a weird, creepy, quasi-hentai game.\n\nWhat this game is: An opportunity to lord over a boarding school with a bunch of lackeys. Solve mysteries, fight petty crime, and protect the school's reputation from scandal. (and maybe an eldritch cult)", "timestamp_created": 1442548371, "timestamp_updated": 1442548371, "voted_up": true, "votes_up": 35, "votes_funny": 2, "weighted_vote_score": "0.632648", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18071794": {"recommendationid": "18071794", "author": {"steamid": "76561198115869397", "num_games_owned": 271, "num_reviews": 8, "playtime_forever": 938, "playtime_last_two_weeks": 0, "last_played": 1471961835}, "language": "english", "review": "Mystery filled RPG at an all girls acadamy. Difficult in it's own way at balancing your points for future cases and trying to keep the school rep and all of your \"minions\" (Don't know why they wanted to call student council officers that) to stay with you. Definetly play through the game all the way through as much as you can so you are ready to plan out and change things when going through everything again.\n\nThis game has great replay value. It's hard even on easy when you don't know what to do when first playing. Definetly some good mysteries in it and gets engaging to play when you're in the mood strategizing and solving mysteries. Highly recommend it if you love your strategy games added with a bit of detective simulator type work. \n\nAlso forgot to mention...you can date anyone of your student council members...and yes there is some cute/sexy art with the two together if you play them out right. So enjoy ;)\n\n*Spoiler sorta*\n\n\n\n\n\n\nFirst big mission they give you when starting the game is to find the spy in your group of \"minions\" and you can call them out on it when the time comes OR you can comfront them and try to change their ways (I didn't know this at all at first). It is extremely helpfull to have every single member of your student council with you but also not neccesary as I'm still progressing through the game.", "timestamp_created": 1442503236, "timestamp_updated": 1442503236, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.503799", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18071703": {"recommendationid": "18071703", "author": {"steamid": "76561198032120166", "num_games_owned": 134, "num_reviews": 31, "playtime_forever": 338, "playtime_last_two_weeks": 0, "last_played": 1495039575}, "language": "english", "review": "I bought this game before the steam release so I've got a lot more play time than what's on record here. \n\nIn short; You're the president of the student council at a prestigious, girl's only, boarding school. It's your job to protect the school from scandals by rooting out the illicit activities of your fellow students. But as the president you don't have to get your hands dirty, that's what your minions are for. They do your bidding, and may try to undermine you, and it's up to you to train them up and make the best use of their skills. \n\nBut the weekly issues are only the background for the larger mysteries surrounding your school and you've got to solve them if you want to make it to graduation in one piece. \n\nI've completed the game twice so far and found that it takes roughly 3-5 hours for a single playthrough. Depending on how much reading you do. For those of you worried about replayability, don't. The cases you're assigned each week are randomized. You'll never get the same cases in the same order and each case is always slightly different. Each potential love interest has their own path and the overall arc of the story changes depending on certain choices you make. \n\nIn the end; it's highly replayable, highly engrossing, and a lot of fun.", "timestamp_created": 1442502735, "timestamp_updated": 1442502735, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.609492", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18066274": {"recommendationid": "18066274", "author": {"steamid": "76561198065801900", "num_games_owned": 89, "num_reviews": 3, "playtime_forever": 279, "playtime_last_two_weeks": 0, "last_played": 1499563988}, "language": "english", "review": "Full review here: http://somestrangecircus.blogspot.com/2 ... loset.html\n\nPlease note the above review is of an earlier version.\n\n-\n\nBlack Closet, the latest from Hanako Games (Long Live the Queen, Magical Diary) is part visual novel, part detective RPG. You play as student council president Elsa Jackson, who is tasked with quashing scandals and keeping up appearances in a sophisticated all-girls' high school. Also on the Council to assist you are your minions: popular flirt Althea, her stubborn and opinionated sister Thaïs, naive newcomer Mallory, unusually competent Vice President Vonne, and antisocial Rowan.\n\nEach week, you receive a couple of cases and have to assign your minions to various tasks, such as questioning witnesses or searching crime scenes. The girls have different stats that will determine their success or failure when executing their assignments. In the background, you also have some overarcing plot cases to solve; one of your minions is a traitor, and you have a limited amount of time to figure out which girl it is and deal with her in one way or another. And then there are the outside enemies that your advisor, Miss Talmage, alludes to, such as a mysterious group called the Red Mask that seem to know lots of things they shouldn't, such as where you sleep.\n\nIt's a rather difficult game, difficult enough at times that you can tell it's made by the same developer as Long Live the Queen, but there are tricks to learn that make it easier, and the game also includes an easy mode (which was not included when I initially played waaaaay back in the pre-Steam days, but am happy to play with now). The mysteries are interesting, and your fellow council members are all well-developed. Elsa is somewhat unique in that you get to choose everything she says (from a visual novel list of options, of course), and what you pick will affect her characterization and what your minions think of you, especially if you're on a romance path.\n\nAnd the art and soundtrack are both beautiful. You actually get two art sets to choose from, the original art set and a new one that was added in later versions of the beta. Truthfully, I prefer the first one and am not sure why the second one gets all the focus in screenshots, but both have their merits. (And you have to earn CGs in both art sets, so you'll be seeing a lot of them either way.)\n\nUpon completing the game you unlock custom minion mode, which lets you create your own council and is rather fun to play around with. You also get the ability to choose who the aforementioned traitor is at the beginning of a normal game, which makes things easy for completionists.\n\nAll in all, another excellent Hanako Games title and well worth your money to pick up.", "timestamp_created": 1442461897, "timestamp_updated": 1442461897, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.564542", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18063911": {"recommendationid": "18063911", "author": {"steamid": "76561198104326428", "num_games_owned": 176, "num_reviews": 2, "playtime_forever": 2712, "playtime_last_two_weeks": 0, "last_played": 1444852377}, "language": "english", "review": "Black Closet is an intriguing game that piqued my interest because in addition to solving mini-mysteries throughout the week you have one major overall case to solve in order to figure out who is sabotaging your Senior year.  The characters are  well-written.  Your minions may seem like game tools at first (you use their special skills to question, harass, stalk, inspect witnesses, suspects and locations), but each one really has a background story with depth.  You can romance them to flesh out their full story line or just stay friends. \n\nThere's also a secret society and your college applications to worry about along with your love life.\n\nLike \"Long Live the Queen\", it did take me several play throughs before I successfully graduated and found out the saboteur.  There can be a lot of things to juggle at one time which can be overwhelming at first. And like LLTQ I was interested in the story line enough to want to replay to get all the CGs and achievements.\n\nThere are 2 art modes to choose between.  There are 3 difficulty levels.  After completing the game once you can choose a more customized game or play a shortened version of the game solving cases with random minions.", "timestamp_created": 1442444793, "timestamp_updated": 1442444793, "voted_up": true, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.690257", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18061976": {"recommendationid": "18061976", "author": {"steamid": "76561198007983674", "num_games_owned": 213, "num_reviews": 23, "playtime_forever": 1203, "playtime_last_two_weeks": 0, "last_played": 1446149012}, "language": "english", "review": "Black Closet is a game about solving mysteries. But not just one or two mysteries; Dozens of tiny mysteries in each playthrough. Every week new cases hit your desk, and using your wits and skills of your faithful council members you must put together the clues and solve the cases before something terrible happens... or maybe it's all a red herring. Only by solving it will you be able to tell. Along the way you can make friends with your classmates, find romance, and uncover the darkest mysteries of the school.\n\nQuick Look:\n+Wide variety of case variants mean it's possible to play an entire game without repeating a case outcome \n+Solid writing and diverse and interesting characters\n+Easy to understand pass/fail check mechanics\n+-Art is usually great, but some assets are a bit rough\n\nEach case is a tiny story within itself with it's own cast of randomly generated charaters. While there are a set number of case types there are a large number of variations in the solutions to each case, so that you canplay an entire game without seeing a case variant repeat. Even once you've managed to learn all the different case variants there is no way to tell which variant youre dealing with until you begin investigating, making each case a race against the clock to solve it. \n\nThe cast is diverse and interesting and each route is different from the last. Each of the characters come with their own motivations and desires and the plots never fall into the predictable or cliche. There's hours of gameplay to be found in exploring all the different story paths. Once you've done that, there's also an unlockable freeplay mode where you can create a custom council of your very own and solve cases without the distractions of the plot.\n\nOverall, Hanako has delivered a solid and enjoyable game yet again and I highly recommend it to anyone who enjoys  tabletop inspired mechanics with a good story and enjoyable writing.", "timestamp_created": 1442433441, "timestamp_updated": 1442433441, "voted_up": true, "votes_up": 87, "votes_funny": 2, "weighted_vote_score": "0.850245", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39569586": {"recommendationid": "39569586", "author": {"steamid": "76561198059341122", "num_games_owned": 187, "num_reviews": 6, "playtime_forever": 694, "playtime_last_two_weeks": 694, "last_played": 1516725005}, "language": "english", "review": "A must. \n\nDifficult, as any who played Long Live the Queen will be absolutely unsurprised to hear, and sometimes really frustrating, but in a good way. You'll want to do it time and again, despite the sometimes repetitive gameplay: to find out who the traitor might be this time around, to see all the scenes and character options, to make different choices, but above all TO BEAT IT DAMN IT! Because it is challenging. Very challenging. \n\nSo, this is a game for those who love making choices that matter, who love beautiful art (THE ART IS AMAZING), who enjoy hair pulling difficulty, and love a good lesbian romance. Or no romance. Sometimes even if you wished this path could be one and it turns out it's not as easy as you thought it would be. But she's cute, so you can't be mad.\n\nPlus, Elsa, your alter ego, is a badass black woman. Need I say more?\n\nI wish we could have a sequel. Or more of it. Random events to spice things up? But the game is already great as it is. Try it!", "timestamp_created": 1516752367, "timestamp_updated": 1516752367, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39553553": {"recommendationid": "39553553", "author": {"steamid": "76561198117712150", "num_games_owned": 51, "num_reviews": 1, "playtime_forever": 398, "playtime_last_two_weeks": 19, "last_played": 1516859841}, "language": "english", "review": "Much more entertaining then initially thought.", "timestamp_created": 1516702278, "timestamp_updated": 1516702278, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "40780621": {"recommendationid": "40780621", "author": {"steamid": "76561198412039002", "num_games_owned": 39, "num_reviews": 11, "playtime_forever": 537, "playtime_last_two_weeks": 537, "last_played": 1521436033}, "language": "english", "review": "Great game. I wish their were more romance scenes and romance \"graphics\" with all characters.", "timestamp_created": 1520920081, "timestamp_updated": 1520920081, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "40613519": {"recommendationid": "40613519", "author": {"steamid": "76561198088320745", "num_games_owned": 421, "num_reviews": 12, "playtime_forever": 1573, "playtime_last_two_weeks": 0, "last_played": 1520466740}, "language": "german", "review": "This game is great. A combo of Visual Novel (the Yuri kind, and 5 routes, too!) and stat management. The best thing about it is probably the story, that can differ very much depending on your choices and the artwork (there's two sets of CG's in different artstyles that both have their charm). Playing all the routes takes more than 20 h, it's cool.", "timestamp_created": 1520362640, "timestamp_updated": 1520362640, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "40605368": {"recommendationid": "40605368", "author": {"steamid": "76561198047696463", "num_games_owned": 227, "num_reviews": 55, "playtime_forever": 1271, "playtime_last_two_weeks": 0, "last_played": 1485097724}, "language": "english", "review": "Evil student council, spying on students, romancing my lessers.\n\nA+", "timestamp_created": 1520337329, "timestamp_updated": 1520337329, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "40400860": {"recommendationid": "40400860", "author": {"steamid": "76561198066475284", "num_games_owned": 337, "num_reviews": 25, "playtime_forever": 270, "playtime_last_two_weeks": 0, "last_played": 1519102385}, "language": "english", "review": "Pretty fun little VN/sim.  I would call it a cross between This is the Police and Long Live the Queen.  If you enjoyed either of those games, I think you'll enjoy this one", "timestamp_created": 1519595314, "timestamp_updated": 1519595314, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39847915": {"recommendationid": "39847915", "author": {"steamid": "76561198056921152", "num_games_owned": 254, "num_reviews": 6, "playtime_forever": 1552, "playtime_last_two_weeks": 0, "last_played": 1483416321}, "language": "english", "review": "I bought it because I was wanted to play a tactical mystery game, but after a while Black Closet felt like a lesbian dating simulator...", "timestamp_created": 1517764427, "timestamp_updated": 1518480949, "voted_up": false, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.559300", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39770407": {"recommendationid": "39770407", "author": {"steamid": "76561198074925645", "num_games_owned": 30, "num_reviews": 4, "playtime_forever": 588, "playtime_last_two_weeks": 0, "last_played": 1517930149}, "language": "english", "review": "Utterly strange and utterly intriguing\n\nI can not exactly explain what happend to me. Wether am I an anime/hentai fan (can't even tell the difference, if there is one...) or care much about lesbian love, but this game dragged me in right away. \n\nYou take the role of Eliza newly elected president of a student council in a very fancy girls only boarding school. Well, solve cases assigned to you and your minions, eliminate a traitor and safe the schools reputation and the councils karam. Sounds easy? Well, it is not, believe me. And because it is not, you are going to spend hours and hours trying to solve every mystery. \nAnd by the way... you can fall in love, have an affair or nothing at all. \n\nI cannot pinpoint it, but there is something to this game that really really got me. Maybe it is the schools atmosphere (went to a boarding school myself, thank god not girls only.. :) ), maybe because it is so delicately developed with a lot of details and a lot of love that went into it. \nAnd there are a lot of possible endings and outcomes. \n\nWell, what else is there to say, than thank you for this enjoyable game! \n", "timestamp_created": 1517500560, "timestamp_updated": 1517500560, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 140, "total_negative": 8, "total_reviews": 148}}
