{"reviews": {"39219844": {"recommendationid": "39219844", "author": {"steamid": "76561198039683051", "num_games_owned": 135, "num_reviews": 4, "playtime_forever": 1149, "playtime_last_two_weeks": 603, "last_played": 1516206463}, "language": "english", "review": " Una gran historia con multiples finales, que me dejo un buen savor de boca y que realmente vale el dinero gastado.", "timestamp_created": 1515542670, "timestamp_updated": 1515542670, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38826907": {"recommendationid": "38826907", "author": {"steamid": "76561198017662551", "num_games_owned": 246, "num_reviews": 18, "playtime_forever": 1027, "playtime_last_two_weeks": 0, "last_played": 1514559424}, "language": "english", "review": "Having just finshed all of the routes and getting all of the endings. I have to say that i had a blast going though it. There is easily 15-20 hours of game play here. With some routes taking about 3 hours each. The music was well done and the terror elements where very well done. This novel has about 20 diffrent endings, some being so so, others being awesome and other that are just messed up in a good way. The novel explains everything you need to know so your never lost with whats going on ,with maybe one exception to this being the bride. I think they could have went more in detail on that. Over all it was fun to play and i would rate it a 9/10. Very well done and hope to see more in the future.\n\nNever know a real hero may yet show up.", "timestamp_created": 1514568686, "timestamp_updated": 1514568686, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38757611": {"recommendationid": "38757611", "author": {"steamid": "76561198341435259", "num_games_owned": 109, "num_reviews": 25, "playtime_forever": 771, "playtime_last_two_weeks": 0, "last_played": 1514472866}, "language": "english", "review": "[b] Current status:[/b] Complete 100%\n[b] Current grade:[/b] 9/10\n\nI was pleasantly surprised by this game, having cleared all the endings. I won't lie, it made me emotional, but it didn't hit me as much as The House in Fata Morgana did, although they both share this sense of unusual, twisted, dark and wonderful visual novels.\n\nCharacters in this one are amazing, I loved a lot of them, they are well done, but I believe Chester wins the prize for the best protagonist. Except for that one guy - no one talks about that guy.\n\nAnyway beautiful music, wonderful graphics, stunning cg gallery (although i got all endings and it looks like 8 cg are missing from the gallery on the first page (or there weren't any in the first place?), but overall, it's worth it.\n\nAlmost 95% of the game is explained, I was only bothered by the fact that there was no explanation for the [spoiler] bride deal and the purpose of it[/spoiler] (or i somehow missed that part, but... unlikely?), but considering everything else, i'll leave it up to my imagination... That was the only thing I was bothered with, but the pros outnumber the cons so I will look it through my fingers.\n\nNot to mention the fact that this game has three routes, and two of them are with guys, while the last one is with a doll of the forest, Some could consider these relationships romantic or platonic, it just depends on your point of view and I loved it. \n\nHonestly, I adored it. This game is just beautiful and solid 10-15 hours worth of gameplay (depending on your reading speed).\n\n[b]PROS:[/b]\n\n◈ solid 10-15 hours of content\n◈ solid characterisation, especially the main character\n◈ interesting story and multiply endings that all form together one whole. Recommendation: play the endings in order of the routes to get the full story chronologically.\n◈ beautiful music and background atmosphere\n◈ horror and comedy elements\n\n[b]CONS:[/b]\n\n◈ unexplained plot point that can be looked through fingers, as it is not the actual point of the storyline\n◈ 800x600 resolution that can be fixed with the mod by ffleader1", "timestamp_created": 1514415821, "timestamp_updated": 1514452970, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38114147": {"recommendationid": "38114147", "author": {"steamid": "76561198025079799", "num_games_owned": 156, "num_reviews": 15, "playtime_forever": 1411, "playtime_last_two_weeks": 0, "last_played": 1512595518}, "language": "finnish", "review": "Definitely one of my favorite visual novels available on Steam. \n\nThe art is lovely, the characters are well-defined and interesting and the overall mystery keeps you engaged through all the endings. There are some less refined parts in the writing, but overall there was hardly anything I didn't like about ENIGMA:. I'd warmly recommend this VN to anyone who likes bittersweet stories and can stomach some gore (boy, some of the endings go from 0 to 100 in the intensity scale real fast).", "timestamp_created": 1512596635, "timestamp_updated": 1512598010, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525547", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38112847": {"recommendationid": "38112847", "author": {"steamid": "76561198133676405", "num_games_owned": 317, "num_reviews": 6, "playtime_forever": 1001, "playtime_last_two_weeks": 0, "last_played": 1512263664}, "language": "english", "review": "ENIGMA is truly a very unique visual novel. Why? \n\nBecause it got an interesting, dark and melancholy story which unfolds layer by layer through each playthrough. \nBecause it got relatable, complex and interesting characters. \nBecause it got beautiful graphics and soothing background music. \nBecause it got a great, relaxing atmosphere (at least until the story turns dark).\n\nI loved every second of it. Highly recommended!", "timestamp_created": 1512592803, "timestamp_updated": 1512592803, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37452441": {"recommendationid": "37452441", "author": {"steamid": "76561198115247277", "num_games_owned": 31, "num_reviews": 7, "playtime_forever": 850, "playtime_last_two_weeks": 0, "last_played": 1511593187}, "language": "english", "review": "This is a game about FEELINGS and TRUE FRIENDSHIP and LOVE. All of the characters are VERY PURE. (Except Tai. Screw Tai. And also Colette is...special.) I have VERY STRONG EMOTIONS about Lauro, Ignis, Greta, and Envirio. There are many endings. They are all sad, but some are a lot more optimistic than others. Try to get a lot of them as you reach for the true ending. I played without using a guide, and I don't regret it. There's a lot of backstory...not sure how much of it I grasp, but enough. This here is a rich fantasy world. There are loads of hijinks and memorable fun and sentimental moments. The anime art is very pretty, and there are a lot of beautiful screengrabs that you can collect.\n\nI gave this game 10/10 on VNDB. I've only given one other VN that rating so far (Shikkoku no Sharnoth. Good luck getting that in English.)\n\nPlay this game, it will give you The Feels, I AM NOT KIDDING AROUND!!!", "timestamp_created": 1511578414, "timestamp_updated": 1511578414, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36004296": {"recommendationid": "36004296", "author": {"steamid": "76561198128704797", "num_games_owned": 487, "num_reviews": 59, "playtime_forever": 1960, "playtime_last_two_weeks": 0, "last_played": 1508991997}, "language": "english", "review": "[i]ENIGMA:[/i] is a visual novel in which you take on the role of an unnamed MC (so you can choose whatever name you wish) guided by a mysterious man who serves as the narrator of the story.  In this game, we take on a third person role as we view the story from the eyes of Chester, a young man from the mainland who ends up on the island of Carlyle.  He is afflicted by a disease simply known as \"Enigma,\" which has spread throughout the world, killing people.  Throughout the story, we meet the various people on the island, such as Colette and Lauro (the siblings who discover Chester), the mysterious, quiet Ignis (who seems to not be originally from the island), and Envirio (a doll who supposedly brings bad fortune to those in contact with it).  When you start the game, you get locked into Lauro's path (which has 7 different endings) and once you get a particular one of his endings, then you can choose to move on to Ignis' path.  Then once you get a particular couple of his endings, you can finally choose to move on to Envirio's endings.  I won't spoil any more in regards to the story or whatnot but definitely, save the true ending of Envirio's path for last.  It might take a while to get to it, but it's totally worth it.\n\nNow that I've given a basic idea of what [i]ENIGMA:[/i] is about, it's time to get on to the critique part of the review.  I think only a few words can sum up my reaction upon finishing this VN, getting all of the endings and whatnot.  I absolutely loved it!  This has to be one of the best VNs I've played in a while.  [i]ENIGMA:[/i] brings out a lot of emotions.  There are parts that are happy, humorous to downright scary and even horror-filled.  I liked getting to know the different characters and as I unlocked different paths, I got to know certain characters better.  Of course, we do get to learn more about the disease known as Enigma and find out that the island has a huge tree called by the same name.  Are the two related or is it just a coincidence?  I'm not going to give the answer for now.  ;)  It's also interesting to learn more about Chester's past and we definitely get to do by playing through Envirio's path.  There are mysteries and a couple do get left unsolved but I could take a pretty good guess as to what was going on so I felt it was fine.  Without a doubt, my favorite ending was definitely the true ending, found on Envirio's path, as it revealed the most of what was going on and it was the saddest, most touching of them all.  It's worth it to save it for last.  Are there any happy endings?  Well, it depends on your definition of happy but I'd say that there are a few.  However, there are others that are sad or even downright scary, full of horror and a bit of gore.  This is just to give a heads up for those who may not be into certain genres and such.  \n\nAs to the other aspects of the game, I loved the art style as well as the music.  Also, there is a gallery which has all of the CGs and endings you have unlocked.  I like when VNs include this feature since I like looking at the CGs and replaying the endings after I've gotten them.  Are there any criticisms I would give?  For me, there was nothing that I personally disliked about the game but I'll bring up this one point since this might be a turn off for those who don't like this feature.  As I stated earlier, when you start a new game, you get locked onto Lauro's route so you can't play Ignis' or Envirio's routes.  This might annoy those who'd rather have the freedom to choose which route to take but I can understand why the developers chose to lock routes.  The other routes do spoil more of the story and I like it better when I can learn more of the story little by little rather than have it all thrown out at me at once.  That's really the only criticism I have although, as I said, this wasn't an issue for me.\n\nOverall, I absolutely loved [i]ENIGMA:[/i] and it's a must-have for anyone who loves VNs and a wonderful story.  It took me over 32 hours to complete all of the paths and so forth but that's only because I don't tend to skip text.  I like getting to experience the entire story for myself and rarely do I ever skip text.  For the price, [i]ENIGMA:[/i] is worth buying and you'll be in for one emotional ride once you get started.  ^^", "timestamp_created": 1508994328, "timestamp_updated": 1508994374, "voted_up": true, "votes_up": 24, "votes_funny": 0, "weighted_vote_score": "0.712092", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36000419": {"recommendationid": "36000419", "author": {"steamid": "76561198360045710", "num_games_owned": 25, "num_reviews": 8, "playtime_forever": 859, "playtime_last_two_weeks": 0, "last_played": 1512855775}, "language": "english", "review": "Fantastic game.", "timestamp_created": 1508979005, "timestamp_updated": 1508979005, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34247540": {"recommendationid": "34247540", "author": {"steamid": "76561198144786155", "num_games_owned": 56, "num_reviews": 1, "playtime_forever": 1116, "playtime_last_two_weeks": 0, "last_played": 1505949064}, "language": "english", "review": "warning: the word \"ret*rded\" comes up sometime after the 3rd choice. i am autistic (asperger's) and i would rather not see the word normalized as an insult in such a beautiful game. it was terribly disappointing.\nother than that sour note, i am enjoying the game very much. sorry if you were expecting an in-depth review.", "timestamp_created": 1502763389, "timestamp_updated": 1504489444, "voted_up": true, "votes_up": 14, "votes_funny": 1, "weighted_vote_score": "0.471876", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33360335": {"recommendationid": "33360335", "author": {"steamid": "76561198182865045", "num_games_owned": 27, "num_reviews": 1, "playtime_forever": 731, "playtime_last_two_weeks": 0, "last_played": 1510665398}, "language": "english", "review": "Within the first two hours of having played this game, I’d decided I was going to write a review, however for the sake of being thorough, I waited until I finished up all the alternate routes and endings. In short, I was very impressed by just how incredible this visual novel is.\n\nI felt the visuals throughout the game were very nice. There were so many lovely CGs! And the backgrounds… I was quite impressed. They were absolutely stunning! The character designs were quite nice as well. I feel some visual novels go overboard on some of their designs, but ENIGMA seemed to have a perfect combination of unique, but still practical.\n\nThe music suited the story perfectly. It was so beautiful and haunting. In fact, when I was playing without my headphones, my roommates both commented on just how lovely the background music was. I’m really glad the soundtrack is packaged in with the game, though I would have happily bought it separately if it were not.\n\nWhile these are all well and good, my biggest concern when reading a visual novel is its storytelling. And it just so happens that that category is one where ENIGMA really shines. While it’s true the story starts out a little slow, it gradually introduces you to the cast and the culture of the island of Carlyle. As you complete each ending, you’re given more clues and slowly you piece together the puzzle that is Enigma.\n\nThough I must admit, some of the characters are a bit flat, I felt the 'main' cast were all very well rounded. Chester in particular makes for a wonderful protagonist! I quite enjoyed getting to know more about the former soldier, and watching him interact with the rest of the cast was an incredibly fun experience.\n\nAll in all, this game had me laughing, smiling, uneasy, disturbed, and tearing up—all more than once. It’s such a beautiful, tragic story about hope and despair, life and death. And perhaps most importantly: heroes.", "timestamp_created": 1499479423, "timestamp_updated": 1499479423, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.596289", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33252447": {"recommendationid": "33252447", "author": {"steamid": "76561198111263211", "num_games_owned": 39, "num_reviews": 5, "playtime_forever": 829, "playtime_last_two_weeks": 0, "last_played": 1501381599}, "language": "english", "review": "I accidentally saw the true ending without seeing all the other endings first.\n\nMy heart was broken when I went to see the other endings, but in a good way. The true ending was so good and connects the other routes very well.\n\nThe characters were well written. It was easy to see their motivations and why they do what they do. I also liked how they gave you little hints in earlier routes as  you continued with the story... placing pieces of the puzzle one by one to see the bigger picture. The protagonist was also solid for someone who had conflicting drives in juxtposition. Well done.\n\n[spoiler]candle/10[/spoiler]", "timestamp_created": 1499209891, "timestamp_updated": 1499209891, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.520639", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "32762496": {"recommendationid": "32762496", "author": {"steamid": "76561198330779078", "num_games_owned": 8, "num_reviews": 3, "playtime_forever": 1243, "playtime_last_two_weeks": 0, "last_played": 1498406928}, "language": "schinese", "review": "一句话评价：其韵婉转，回音绕梁。\n一句话剧情主旨：这不是个英雄拯救世界的故事，而是英雄到来前人们认清自我、敞开心扉的往事。\n然后指路攻略：https://unluckyhero.wordpress.com/2016/11/15/enigma-walkthrough/\n这游戏你别看选项就几个，结局可是有22之多，而且有些结局有先后，所以没攻略想全通真的很难。\n然后后来我发现这游戏是有日文人物介绍和体验版的（两个小游戏？），网址：\nhttps://www.freem.ne.jp/win/game/5334\nhttps://www.freem.ne.jp/win/game/7464\n制作组超级用心的说。\n\n客观的说完了，下面就是大段剧透（会黑幕）和及其主观的吐槽啦~\n先来吐槽。我关注这款游戏的时候它还没开始发售，但精美的画面和动人的OP已经深深吸引了我。要知道我VN和RPG玩了许多，可前者多为乙女向，后者多为恐解，所以像这种男主视觉、貌似galgame的游戏真的很难入我眼。所以说我当初也没很抱希望，毕竟同人作。等它出了后感觉价格还行就买了。\n全通后我觉得自己赚到了。不得不说，这游戏剧情设计在我见过的VN中绝对是上乘，而且bgm和CG也是该换就换数量丰富且精美。我甚至觉得，幸好它没有配音（不少英文评测为此遗憾），这样一来我反而觉得各角色在我脑海中更立体、我能想象到他们的一颦一笑。\n当然了缺点自然也有。首先是英语，我相信考过高考的看这个都没问题，不过里面偶尔会有几句日式英语（？）让你感觉语序怪怪的，不过不影响阅读。另外是某些结局——不是说制作组有多做点充数的嫌疑（每一个都做的不错），只不过：是不是有一些整体气氛也太#@￥*%￥了啊编剧！（具体可以看黑幕剧透）然后不知道是不是我理解的问题，感觉有些核心概念讲解的不透彻。\n不过最后，我还是用英文评测里我觉的说的很对的两个做总结。\n1：制作组的意图很明显，让你们喜欢上男主。\n2：这是难得的不仅配角塑造的很好，连主角都塑造的很严谨的游戏。\n\n然后终于到了剧透环节。如果我没有记错（毕竟最后真结局与之前隔了太久才打），故事背景是这样的（我尽量是让你看了依旧想要玩）：\n[spoiler] 岛上原住民一直供奉着一颗大树，它可以实现人的愿望，但代价是要吸收人的颜色（通过人行娃娃）。所谓颜色应该是人的生命力，而且为了保护它自己，于是大树只吸收非原住民的。这种自私邪恶的事被外面的人知道了，于是一帮人组成了英雄小队来打败这棵树。他他们与想要保护树的原住民战斗，最后原住民只剩下一个女孩活着逃到了树旁边。树实现了女孩的愿望，并反抗英雄小队的人，导致英雄小队的人也只有英雄本人活着。之后忘了因为什么原因，英雄成为了为树制造人形娃娃的人，他/她很不甘心，却又不得不维持现状。这件事过去很多年后，我们本篇的男主Chester来到了岛上。解谜的故事开始。[/spoiler]\n剧透不涉及任何人的名字，所以有点好奇的人看了不会后悔的~毕竟是介绍故事背景。\n\n最后是与严重剧透有关的吐槽！求同样通关的人来理解我！\n[spoiler] Colette我没有看错你！不愧是典型的外表纯良内心想黑就黑的标准角色！多少丧心病狂的ED背后都是你！还有Genius，灵魂身份是什么鬼，虽然我后来发现男主开头就是这样出现的，可真的……你突然告诉我，这也太无法理解了！然后Eliot，制作组说了男主无BL倾向，所以我特别想为你鞠一把泪（？？？）以及男主，我玩到后来都忘了开头和你说过话，还给自己起了个名字，所以我以为真结局你能解决这一切然后大团圆的，然后真结局你就传火给我了……你怎么那么惨，无论哪个结局都是……[/spoiler]\n\n最后的最后，将第一个steam长评献给Enigma：。Chester和Envirio我抱走了谁也不许抢！", "timestamp_created": 1498380135, "timestamp_updated": 1498380135, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.673158", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32701443": {"recommendationid": "32701443", "author": {"steamid": "76561198211963892", "num_games_owned": 26, "num_reviews": 2, "playtime_forever": 895, "playtime_last_two_weeks": 0, "last_played": 1513251919}, "language": "english", "review": "This is the best game I ever played, story is secomd to none. I Cried like 10 times. 11/10", "timestamp_created": 1498258267, "timestamp_updated": 1498258267, "voted_up": true, "votes_up": 14, "votes_funny": 3, "weighted_vote_score": "0.535566", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32550055": {"recommendationid": "32550055", "author": {"steamid": "76561198162269272", "num_games_owned": 34, "num_reviews": 2, "playtime_forever": 578, "playtime_last_two_weeks": 0, "last_played": 1493081766}, "language": "brazilian", "review": "Ótima história, bem elaborada!", "timestamp_created": 1497820612, "timestamp_updated": 1497820612, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31757801": {"recommendationid": "31757801", "author": {"steamid": "76561198142327767", "num_games_owned": 113, "num_reviews": 41, "playtime_forever": 834, "playtime_last_two_weeks": 0, "last_played": 1494797882}, "language": "english", "review": "Multiple endings / 20", "timestamp_created": 1494797940, "timestamp_updated": 1494797941, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.440961", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30418301": {"recommendationid": "30418301", "author": {"steamid": "76561197987156600", "num_games_owned": 392, "num_reviews": 17, "playtime_forever": 60, "playtime_last_two_weeks": 0, "last_played": 1488600068}, "language": "english", "review": "This was a great VN. I really enjoyed how the various endings and routes slowly revealed the central mystery and many of the endings were very emotional despite the very premise of the game tipping you off to many of the outcomes. Nice Music and Art as well. Not very long, but fulfulling. Try it.", "timestamp_created": 1489109504, "timestamp_updated": 1489109504, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.542567", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30175185": {"recommendationid": "30175185", "author": {"steamid": "76561198315121491", "num_games_owned": 20, "num_reviews": 1, "playtime_forever": 938, "playtime_last_two_weeks": 0, "last_played": 1488049687}, "language": "english", "review": "A wonderful tale that leaves you feeling so many emotions it sometimes make your head spin. All the characters are introduced gradully and through each route you learn a little bit more about them. No character is uniportant, no ending underserving of exploration. Sometimes the game does glitch out, and the graphics do sometimes repeat themselves, but, overall, these don't detract from the story. In fact, it's almost fascinating how each CG can be used diffrently per the scinerio you are on--besies which, it'll sometimes shots out an entirely new beautiful/horrifying CG right after so...\n\nIn the end Chester and Envirio drew me to this story, but I wound up falling in love with all of the characters, and it's painfully wonderful the hope this story gives you...and what it does to it.", "timestamp_created": 1488049459, "timestamp_updated": 1488049459, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.542567", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29983808": {"recommendationid": "29983808", "author": {"steamid": "76561198063469476", "num_games_owned": 57, "num_reviews": 2, "playtime_forever": 1043, "playtime_last_two_weeks": 0, "last_played": 1501583141}, "language": "english", "review": "1. Came for Envirio (cuz she looks pretty)\n2. Stayed for the island of Carlyle's stories\n\nHi guys. It's my first time writing a review so spare me. I'm also trying to avoid any spoilers while writing this review.\n\n[h1]Review/Synopsis?[/h1]\nThis game tells the tale of Chester, a former army from the mainland who has a sickness called Enigma. He was found on a beach (most probably thrown overboard during a storm) at an uncharted Island called Carlyle which happened to have a forest also named Enigma, like the disease.\n\nEvery choices would lead to different story path and would explain Enigma from several perspectives. Once finished, we can relate all of the story together to fill in the voids of each storyline. Like a tree with multiple branches.\n\nWe would also enjoy the story of each characters that we can get close with. \nWe have Greta (the herbalist), Lauro and Collete (the kind siblings), Ignis (the cold silent dude), Genius (the lonely dude) and Envirio (the doll).\nEach of them adds their own color to the story which makes it worth replaying for the gallery and endings.\n[The skip button and the numerious save slots are very convenient for this]\n\n[h1]Tips[/h1]\n[olist]\n[*]If you are gonna play this the first time, I recommend to just enjoy the pace of the story.\n[*]Use the [Auto] button to enjoy this visual novel at a laidback pace.\n[*]Spam save slots and quicksave after each choice (atleast once after making a choice)\n[*]There's a guide on how to play Enigma: in high definition\n[*]There's a guide on how to get every ending\n[/olist]\n\n[h1]How long[/h1]\nAt the time I achieved all endings (with the help of a guide, skip button and save slots) but still unable to unlock all gallery images, I have spent around 17.3 hours into this game. (According to Steam)\n17/2/2017", "timestamp_created": 1487336904, "timestamp_updated": 1487337447, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.527752", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29756942": {"recommendationid": "29756942", "author": {"steamid": "76561198087869683", "num_games_owned": 84, "num_reviews": 2, "playtime_forever": 1262, "playtime_last_two_weeks": 1, "last_played": 1516184581}, "language": "schinese", "review": "先吃我一发安利：48CNY买这个游戏绝对值得。\n老实说买这个游戏之前我是比较忐忑的，因为这游戏当时一个中文测评都没有……但是买回来之后我就明白我没买错了。分为几个部分说说吧。\n语言要求：这游戏只有英文，甚至连日文都没有，所以可能会让很多人望而却步……不过说真的比起steam大多数英文版的Visual Novel来说，这游戏对英文的要求并不高。我这四级水平勉强就能看懂了，我姐的六级水平根据她的说法是完全没问题的。当然，个别的生词依然有，但是并不影响大局。\n画面：800X600分辨率令人比较怨念……但是无论画风还是数量都能令我满意。\n剧情：想要不剧透的说剧情真的还挺困难……我尽可能说说吧。首先，相比“Galgame”，这个游戏归为普通的Visual Novel更为合适。虽然恋爱要素的确不少，但是相比之下剧情的推动以及看点很大程度上并不在于恋爱要素。当然了，想要恋爱要素的人也可以放心，因为这游戏也并不是那种完全没有恋爱成分的游戏。此外，这游戏的结局数量是真心多……选项算是不多不少，但是似乎存在殊途同归的情况，因此某些END对于我而言很难进。（现在还差好几个呢）而且，BAD END似乎是多了点……但是不要灰心，进入Envirio线之后，至少我个人见到Envirio的ED1之后直接感动的哭了。还有就是我个人玩过的各种各样的VN也有几十个了，但是这个游戏的剧情我个人感觉配得上“不落俗套”四个字。说真的，这个游戏非常非常适合想要体验剧情的人。当然了，只喜欢卖肉废萌(我就不点名是哪些游戏了)向的玩家，最好就不要买了。\n音乐：我个人感觉不错……这东西很大程度上真的因人而异啊。\n最后再重复一遍，这个游戏的定价堪称良心——如果你更注重剧情的话。\n  \nPS:有几个……不对，有一半的结局让人怀疑制作组想要靠卖刀片发家致富。", "timestamp_created": 1486453729, "timestamp_updated": 1486900931, "voted_up": true, "votes_up": 16, "votes_funny": 4, "weighted_vote_score": "0.727030", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29237455": {"recommendationid": "29237455", "author": {"steamid": "76561198141123924", "num_games_owned": 100, "num_reviews": 10, "playtime_forever": 138, "playtime_last_two_weeks": 0, "last_played": 1511099232}, "language": "english", "review": "Enigma is a great game in my opinion, and one I highly recommend. \nNow, I wouldn't go as far as saying it's one of the best VNs I've ever played, because it isn't. But it's so unique and engaging! It's an experience I'll never forget, for better of for worse. Why worse? Well, I assume you've read the description of the game - this isn't a joyful one. I mean, sure it has funny moments, but it's overall depressing and has lots of very disturbing moments.\nAn important factor to keep in mind if you want to play this game is that it isn't a game you play for romance, since friendship is the main factor here, even if it has \"character routes\" like most romantic VNs (though you can read in between the lines and see whatever you want in there). \nAs for the characters, I really liked most of them, though I must admit Ignis must be my favorite from the ones who got routes. He really hits some soft spots in my heart and breaks it in some of his endings. Now, Lauro is lovely and lovable too, and Chester, the MC, is one of my favorite main characters in VNs. I think I like Envirio a bit less than the others, but I love seeing dolls in games - it's quite uncommon. \nOne thing bothers me a lot about Envirio, but this isn't a story or character problem. The issue is that most of the characters in the game speak of them using the femenine, while they are genderless being a doll, and they even say it at some point. English has neutral forms, so why not use these? But this is roughly my only complaint.\n\nOther than what I've already said, I also think this game is gorgeous, both the art and the soundtrack are great, and don't even let me start on the opening and the ending!\n\nOverall, it was a great experience I'll be glad to replay once the trauma of the depressing story will subside a bit.\n\n\nPS: don't mind the small playtime recorded by Steam - I've played offline, and it didn't record the time I've played or the achievements. I was able to get the achievements by loading all of my saves and skipping from the last choice leading to each ending (I save all the time), but well, I can't help the playtime.", "timestamp_created": 1484359242, "timestamp_updated": 1484359427, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.642768", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 7, "review_score_desc": "Positive", "total_positive": 41, "total_negative": 1, "total_reviews": 42}}
