{"query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 181, "total_negative": 6, "total_reviews": 187}, "reviews": {"38930732": {"recommendationid": "38930732", "author": {"steamid": "76561198397355125", "num_games_owned": 7, "num_reviews": 1, "playtime_forever": 287, "playtime_last_two_weeks": 287, "last_played": 1514849726}, "language": "english", "review": "Oki so, Its pretty good, On diff loads Ive joined all the clans but- Not much has happened? I havent got any quests or anything.. Its kinda boring.", "timestamp_created": 1514801514, "timestamp_updated": 1514801514, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38914519": {"recommendationid": "38914519", "author": {"steamid": "76561198260938644", "num_games_owned": 165, "num_reviews": 84, "playtime_forever": 338, "playtime_last_two_weeks": 338, "last_played": 1514838773}, "language": "english", "review": "YOU CAN BE A CAT, WHAT ARE YOU WAITING FOR JUST BUY IT. \n\n\nSeriously though, it's a wonderfully relaxing game. You forage, fight rivial cats, eat, buy stuff, hunt other creatures, I went to a summer festival and raced turtles to win tokens, theres also a Story-line so theres some quests you end up doing. A lot of it is wandering around finding things, also you choose 1 of 3 colonies to join when you start. It's 10/10, if you need a new game after enjoying Stardew Valley then this is the game for you. Can't wait to find out what else this game has to offer.", "timestamp_created": 1514753573, "timestamp_updated": 1514753573, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38891332": {"recommendationid": "38891332", "author": {"steamid": "76561198041118653", "num_games_owned": 216, "num_reviews": 10, "playtime_forever": 478, "playtime_last_two_weeks": 478, "last_played": 1514316114}, "language": "english", "review": "You are a cat. \nBest game.", "timestamp_created": 1514703541, "timestamp_updated": 1514703541, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38887076": {"recommendationid": "38887076", "author": {"steamid": "76561198059125167", "num_games_owned": 227, "num_reviews": 20, "playtime_forever": 453, "playtime_last_two_weeks": 453, "last_played": 1514690852}, "language": "english", "review": "This game is basically Harvest Moon, except with cats instead of farming. If that sounds appealing from the get-go, you should proabably buy this game. There's a lot of content to be found and it's pretty addicting to play. The game description pretty much sums up everything you can do in this game, you get exactly what it says on the tin. It's a very cute and fun game overall that's a great way to relax and pass some time. \n\nI can't believe I'm saying this, but I think the biggest downside to this game is that not all of the cats are romanceable.", "timestamp_created": 1514692091, "timestamp_updated": 1514692125, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38863457": {"recommendationid": "38863457", "author": {"steamid": "76561198162336733", "num_games_owned": 29, "num_reviews": 1, "playtime_forever": 4473, "playtime_last_two_weeks": 155, "last_played": 1514783192}, "language": "english", "review": "Backed this game for 30 dollars and it was the best 30 dollars I spent on a kickstarter. I even played the predecessor to this game, Warrior Cats: Untold Tales. It is super crazy to think just how far Falcon has come with this game and it was pulled off very well and I love it to bits. Cattails is a super fun game with really interesting and really funny (looking at you Krampy) characters, fairly decent leveling mechanics, and an amazing and soothing soundtrack to go behind it. The only time I cried was when I got swept up in one of the rivers and died. Twice, might I add. Still fun though haha. If you don't have the game already, or are thinking about getting it, DO IT!", "timestamp_created": 1514646212, "timestamp_updated": 1514646212, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38841411": {"recommendationid": "38841411", "author": {"steamid": "76561198086015561", "num_games_owned": 69, "num_reviews": 14, "playtime_forever": 999, "playtime_last_two_weeks": 999, "last_played": 1514776784}, "language": "english", "review": "It's like Harvest Moon, with cats.  \nVery nice game to pass time though, currently hooked to it.", "timestamp_created": 1514596760, "timestamp_updated": 1514596760, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38840807": {"recommendationid": "38840807", "author": {"steamid": "76561198254658530", "num_games_owned": 17, "num_reviews": 1, "playtime_forever": 912, "playtime_last_two_weeks": 912, "last_played": 1514826157}, "language": "english", "review": "I don't write reviews much, if at all, but I'm willing to for this masterpiece!\n\nI've been looking for a fun, calm, and relaxing game centered around animals and that's what I got. I love this game and I've barely dived into it. \n\nI started off as a stray cat on on the side of a road. I went through some tutorial stuff and chose one of the three clans. (Forest Clan, Mystic Clan, and I believe the Mountain Colony.) I went about my buisness. Meeting my local clan members, hunted, fought, etc. I also encountered some interesting story quest that I'm currently working hard on. I'm curious as to where these story quests are leading and I hope to get back on in a minute to continue my journey to find out. I can't wait to see what else this game offers as it seems pretty deep in a sense.\n\n\nLet's break down all the good points I personally found with game.\n\nMusic: Great. Not annoying and very nice to the ears. Excellent job to the musicians.  \n\nGraphics: To the level of RPG Maker's graphics with a little hint of DS styled graphics tossed in too. I personally like it and thinks it suites the game.\n\nStory: Not much to it at the start, but you tend to get the general idea. Nothing too gripping, but good enough to get you started. The game is designed for you to make your own story, so that's mostly what you do. (Like Skyrim, Minecraft, etc.) Story quests do show up later and they are interesting.\n\nGameplay: This is where the game shines. The menu interface is nice and simple, while the movement, hunting, and fighting work like a charm. The skill based level system is a nice touch, as it keeps the gameplay from feeling too stale and it also helps that you get XP for almost anything. (Outside the colonies.) You can also decorate your house which is pretty cool, and you even have a friendship mechanic with the citizens. (Still not sure how it works completely though. I'm still experimenting.) The hunger system that's in the game is nice and doesn't feel too intrusive. On a side note, hunting takes practice. So expect to take a good bit trying to figure out the hunting mechanic.\n\nConclusion: If you want a realistic cat simulator, then this game ain't for you. But if you want a game simular to Harvest Moon, Sims, or Animcal Crossing, then here you go. I do have one issue and that there's lag in the section with pruple rock pillars, even with fancy lighting turned off , but that's minor.\n\nMaking games in Game Maker is not easy. (I should know.) But this small team showed what you can do with the program when you know what your doing. Makes me rethink games I used to work on. \n\nAnyways, I love this game and I hope to see more for this game in the future. Great job Falcon Team. :)", "timestamp_created": 1514595334, "timestamp_updated": 1514596380, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38831464": {"recommendationid": "38831464", "author": {"steamid": "76561198141815402", "num_games_owned": 40, "num_reviews": 4, "playtime_forever": 830, "playtime_last_two_weeks": 830, "last_played": 1514581170}, "language": "english", "review": "Harvest Mew? Cat Moon? 猫の物語? How else can I put this? It's Harvest Moon but with cats. That's not a bad thing! At all! It's a wonderful thing, actually. \n\nYou live as a cat in the wilderness among feral cats and so you must hunt and gather to survive. The mining system and friendship/dating/marriage systems are near identical to Harvest Moon (especially the later games in the series) and so this will be easy to get the hang of if you are familiar with those games. \n\nThe music is fantastic. Seriously. So smooth, so calming. \n\nThis isn't a very coherent review. Sorry. My point is, though, this game is great. Get it. Now.", "timestamp_created": 1514576629, "timestamp_updated": 1514576629, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38829416": {"recommendationid": "38829416", "author": {"steamid": "76561198125925714", "num_games_owned": 10, "num_reviews": 1, "playtime_forever": 1001, "playtime_last_two_weeks": 1001, "last_played": 1514832359}, "language": "english", "review": "When I started up the game it only bugged out and eventually froze.  I believe I have all the requirements to run Cattails, since I can run other games.  I hope that I can fix this somehow but I'm not sure.  For the reviews that say Cattails is really enjoyable and addictive, I just wish I could join in too.  :<", "timestamp_created": 1514573072, "timestamp_updated": 1514573072, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38828220": {"recommendationid": "38828220", "author": {"steamid": "76561198046525525", "num_games_owned": 34, "num_reviews": 2, "playtime_forever": 1602, "playtime_last_two_weeks": 1602, "last_played": 1514847133}, "language": "english", "review": "This is such a nice game. People compare it to Stardew Valley, but that's only because there's no game really super similar to this one. The closest parts of the game are the romance and friendship systems and the Ruins which are similar to Stardew's Community Center. I personally find Stardew to be a bit overwhelming and this game is not overwhelming.\n\nYou hunt to survive and hunt for gifts to give. You forage for useful herbs, and go mining to earn some nice rewards. You  can fight battles to expand your colony's territory, and travel to other colonies to improve your relationship with them. Every 10 days, there is a festival, and then the season changes. If you like Warrior Cats you will probably like this game.", "timestamp_created": 1514571066, "timestamp_updated": 1514571066, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": true, "written_during_early_access": false}, "38805498": {"recommendationid": "38805498", "author": {"steamid": "76561198077343255", "num_games_owned": 65, "num_reviews": 2, "playtime_forever": 1180, "playtime_last_two_weeks": 1180, "last_played": 1514605589}, "language": "english", "review": "I've been following Falcon Development for years, and like many was a huge fan of Untold Tales back in my hayday as a Warrior Cats fan. A few months ago, after a nostalgia trip, I stumbled upon the Kickstarter for Cattails and I was so excited! I'm happy to say that I'd recommend this game, and that I personally feel it stands on its own apart from the Warrior's series. However, it's not without its flaws, and I can't help but want the game to continue being fleshed out for the $15 price tag. \n\nPros:\n[list]\n    [*] The soundtrack is absolutely wonderful. It's relaxing and fits the tone of the game very well.\n    [*] Having kittens that actually grow up is really enjoyable! Unlike many other similar games, you get to be highly involved with your offspring.\n    [*] The dialouge gives you a feel-good vibe. This only goes for the Forest Colony (as it's the only area I've really played through), but every character feels distinct and becoming friends with them for the extra dialouge feels valuable. \n[/list]\n\nCons:\n[list]\n    [*] It doesn't do anything revolutionary. It feels a lot like a smaller Stardew Valley with a different coat of paint. This isn't helped by the fact that Stardew Valley is the same price ($15) with more content and polish (the difference between the mines, for instance). \n    [*] This may be a personal preference, but something about many areas of the map made them a bit... forgetable. Some areas blend together, and this is really unfortunate because some areas are given a lot of detail (the large tree in the swamp territory comes to mind). I was constantly getting lost despite frequently using the map.\n    [*] Although the dialouge that exists is well-written, after the first year and befriending the cats in your colony, you're going to get the same 5 or so lines of dialouge. Although there are other characters in other colonies to befriend, I just can't help but want more!\n[/list]\n\nConclusion: I'd recommend Cattails to anyone who enjoyed Untold Tales (this is a MAJOR upgrade), has already played through Stardew Valley, and/or has read the Warriors series. It's a casual, but sometimes challenging (took me forever to get a cardinal, lol), game that'll make you feel warm and fuzzy. I look forward to the update where you can create your own colony, and hope additional content will be added to flesh the game out further in the future.", "timestamp_created": 1514520749, "timestamp_updated": 1514520842, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38802411": {"recommendationid": "38802411", "author": {"steamid": "76561198046076616", "num_games_owned": 86, "num_reviews": 11, "playtime_forever": 6245, "playtime_last_two_weeks": 6245, "last_played": 1514846552}, "language": "english", "review": "I would prefer more marriage candidates for my own taste but for overall taste I think adding quests and some important story lines via characters would make the game a lot better not that it isn't great right now.", "timestamp_created": 1514512587, "timestamp_updated": 1514512587, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38798789": {"recommendationid": "38798789", "author": {"steamid": "76561198254092089", "num_games_owned": 9, "num_reviews": 9, "playtime_forever": 1280, "playtime_last_two_weeks": 457, "last_played": 1514847742}, "language": "english", "review": "Wow, I actually like this game! If you didn't already know, Cattails is a game similar to Stardew Valley (wow no dip sherlock) where you are a cat (obviously) and you have to survive in the wilderness. At least one person expects me to do this, lets look at the pros and cons.\n\nPros:\n-Usually never lags\n-The controls are easy to remeber and are customizable (however the controls used for moving the cat are weird)\n-Warrior cat fans will be proud (in fact Falcon Development's previous game actually was a Warrior cat simulator)\n-Very impressive for being made by a two-people team\n-How friendly the community and devs are\n-KRAMPYYYYYYYYY\n\nCons:\n-Becomes tedious and repetitive after a while\n-You're only able to have one litter of kittens (and that might be dissapointing if you only have one kitten)\n-That I can't have kittens with Krampy \n\nSo in conclusion, if you're into Stardew Valley, Warrior Cats, or you just like feral cats in general, Cattails might be the game for you. However, like someone else said, if you're not into any of these, you might get bored 10 minutes after the tutorial.", "timestamp_created": 1514503546, "timestamp_updated": 1514503546, "voted_up": true, "votes_up": 8, "votes_funny": 2, "weighted_vote_score": "0.634494", "comment_count": "7", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38797591": {"recommendationid": "38797591", "author": {"steamid": "76561198084610698", "num_games_owned": 88, "num_reviews": 2, "playtime_forever": 1909, "playtime_last_two_weeks": 1909, "last_played": 1514597375}, "language": "schinese", "review": "为什么要抛弃我？？？？为什么要抛弃我？？？？(´ﾟДﾟ`)？？！！\n\n成为一只喵喵酱，真的爽死了，每天都要做猫，我超喜欢这个游戏的！要是有中文就更好啦~", "timestamp_created": 1514500791, "timestamp_updated": 1514500791, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38772699": {"recommendationid": "38772699", "author": {"steamid": "76561198347445347", "num_games_owned": 12, "num_reviews": 4, "playtime_forever": 393, "playtime_last_two_weeks": 393, "last_played": 1514593581}, "language": "english", "review": "It's awesome game I've been waiting so long and it's here I really recommend this game you guys in Falcon Development have made so much progress I really support you guys! And by the way Untold tales still isn't old to me! Hope you have more success to your future games!", "timestamp_created": 1514452323, "timestamp_updated": 1514452323, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.543568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38770857": {"recommendationid": "38770857", "author": {"steamid": "76561198284437564", "num_games_owned": 27, "num_reviews": 7, "playtime_forever": 816, "playtime_last_two_weeks": 816, "last_played": 1514732134}, "language": "english", "review": "the game is AWESOME. i spend a lot of my time on it.", "timestamp_created": 1514447368, "timestamp_updated": 1514447368, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38768597": {"recommendationid": "38768597", "author": {"steamid": "76561198043791326", "num_games_owned": 115, "num_reviews": 1, "playtime_forever": 1551, "playtime_last_two_weeks": 1551, "last_played": 1514624674}, "language": "english", "review": "After playing long hours of this game I am happy to see how in depth this games content has. Don't let the beginning of playing this game discourage you, starting out is difficult but leveling up and stockpiling your food you'll quickly get a hold on how this game plays. There is a main quest to do as an end game and I enjoy the small customization and achievement goals to work towards after completing the main quest. If you enjoy a nice and relaxing game to pass the time and chill I highly recommend this game.", "timestamp_created": 1514441040, "timestamp_updated": 1514441040, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38758174": {"recommendationid": "38758174", "author": {"steamid": "76561198189843906", "num_games_owned": 63, "num_reviews": 3, "playtime_forever": 222, "playtime_last_two_weeks": 134, "last_played": 1514334454}, "language": "english", "review": "very nice", "timestamp_created": 1514416967, "timestamp_updated": 1514416967, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38741726": {"recommendationid": "38741726", "author": {"steamid": "76561198369202740", "num_games_owned": 16, "num_reviews": 3, "playtime_forever": 816, "playtime_last_two_weeks": 631, "last_played": 1514851050}, "language": "english", "review": "At first, the game is a little bit hard (I almost died from failing at hunting) and may not be as fun. I'm not a warriors fan that much, but this game is so fun. Right now I prefer to play this game instead of my favorite game. The game is basically never-ending. There's no \"the end\", while there may be one, you can just keep playing on your save, and you can make new characters. The thing that makes it addicting, in my opinion, is the variety of things to do. When you think you've done everything, you haven't. Don't judge the game when you first start, I didn't play it as much and wanted to play it that much now. Make sure to upgrade your fighting and hunting, hunting gives you a fair amount of coins and land, while hunting gives you lots of food. The festival games are really fun, they also give you special coins for special items. Also, if you're going to marry a cat, make sure it has the red heart when you're talking to it. The game is adventurous, and the fighting is actually not boring, and the game is pretty casual most of the time. Honestly I would say this game is worth 60$, not that I want it to be 60$, because less people would buy it. 15 dollars is a very good price, you should get it even if you don't like warriors. Or cats. Often, you will find your inventory being a lot less full in the winter than any other seasons. (logic, duh.) So basically, you should get the game. It's worth your 3/4 of your 20 dollar bill. Trust me.\nEdit: It sometimes lags in areas, probably because I have the special light setting on. But when I got a new graphics card (obviously not for this game) all it did was just lag even more. That's a bug that needs to be fixed.", "timestamp_created": 1514387854, "timestamp_updated": 1514561005, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38720067": {"recommendationid": "38720067", "author": {"steamid": "76561198273521985", "num_games_owned": 7, "num_reviews": 1, "playtime_forever": 2158, "playtime_last_two_weeks": 2158, "last_played": 1514848346}, "language": "english", "review": "I love Cattails, and would totally reccmmend it to anyone and everyone, though I do have a small issue with it. The game itself is wonderful in everyway, but my problem is with the save files. I've done research and have tried to, but failed to even find where I can delete a save file. It's a minor issue, but it's still a little annoying to say the least.\n\nI would honestly rate this wonder game a 10/10, but I do wish there was an easier way to delete a save file in the game itself and not having to go into the game files to delete it.", "timestamp_created": 1514340020, "timestamp_updated": 1514340020, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38713755": {"recommendationid": "38713755", "author": {"steamid": "76561198373493329", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 1903, "playtime_last_two_weeks": 1903, "last_played": 1514813355}, "language": "english", "review": "Hey, Falcon! I was swimming for the first time to the Island Mine, and realised that before I got there, the swimming tag above the characters' head was missing and that I could just swim around as much as I wanted.\nI decided to swim around the whole sea part, and yet the swimming bar wouldn't come up.\nPlease fix it! D: (even though it's a good thing for the players xDD)\n\nBesides this, I got this game for Christmas and I've fallen in love with it <3 I'm not kidding.. today, I spent over 13 hours playing it.. I'm still playing it 0w0\n\nLove it! ~Prim", "timestamp_created": 1514325602, "timestamp_updated": 1514325602, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38709861": {"recommendationid": "38709861", "author": {"steamid": "76561198387717526", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 906, "playtime_last_two_weeks": 906, "last_played": 1514429817}, "language": "english", "review": "Amazing game. I just want to marry Krampy.", "timestamp_created": 1514318461, "timestamp_updated": 1514318461, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38707567": {"recommendationid": "38707567", "author": {"steamid": "76561198406453742", "num_games_owned": 4, "num_reviews": 2, "playtime_forever": 711, "playtime_last_two_weeks": 40, "last_played": 1514784487}, "language": "english", "review": "wooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooow!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! so cool too bad i gonna delete steam and all my games! not cuz cattails is dumb, but i rly wants SIMS 4 but i totally recommend this game! its challenging.... its realistic(cuz you can actually starve to death and seasons change)... its cute... ITS CATTAILS!!!!!!", "timestamp_created": 1514314469, "timestamp_updated": 1514314469, "voted_up": true, "votes_up": 1, "votes_funny": 3, "weighted_vote_score": "0.437972", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38695279": {"recommendationid": "38695279", "author": {"steamid": "76561198004955969", "num_games_owned": 200, "num_reviews": 17, "playtime_forever": 1255, "playtime_last_two_weeks": 606, "last_played": 1514522163}, "language": "english", "review": "Really fun game. Reminds me of Stardew Valley but you are a cat. Highly recommend.", "timestamp_created": 1514292225, "timestamp_updated": 1514292225, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38683402": {"recommendationid": "38683402", "author": {"steamid": "76561198040977237", "num_games_owned": 82, "num_reviews": 2, "playtime_forever": 758, "playtime_last_two_weeks": 758, "last_played": 1514348693}, "language": "english", "review": "I wasn't expecting much out of this game when I saw it in the Steam store, but I like Harvest Moon, Stardew Valley, and cats, so I figured why not. Well...I've actually been playing this today as much as I would my favorite Harvest Moon games. The pixel artwork is gorgeous, the dialog is so endearing, and the music is REALLY great (I absolutely love the hints of jazziness in several of the tracks). There's a surprising amount of depth to this game and you can just tell that the devs are thoughtful people. The only thing I don't like is the amount of killing lol. It seems a little out of place for such a cute game. One minute you're getting attached to an irrelevant NPC from your colony as they talk about their secret pet mouse that they couldn't bear to kill, and the next minute you hear sounds of the rival colony slashing them to death. I would definitely suggest this game to anyone who likes cute, laid-back games (if you can get past the murdering of cute little pixelated cats with equally cute names). It starts off a little slow, but it's very fun overall.", "timestamp_created": 1514262361, "timestamp_updated": 1514262575, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.546412", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38665437": {"recommendationid": "38665437", "author": {"steamid": "76561198123331168", "num_games_owned": 114, "num_reviews": 8, "playtime_forever": 53, "playtime_last_two_weeks": 0, "last_played": 1513530667}, "language": "english", "review": "This game is magnificent and does everything good. There is still some areas which can be improved on however the devolopers delivered what we saw in the early gameplay. This game still has a lot of potiential such as modding however the game is good if you are looking for a RPG playing cat.", "timestamp_created": 1514222029, "timestamp_updated": 1514222029, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.502618", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38513780": {"recommendationid": "38513780", "author": {"steamid": "76561198135968267", "num_games_owned": 170, "num_reviews": 9, "playtime_forever": 980, "playtime_last_two_weeks": 980, "last_played": 1514212262}, "language": "english", "review": "I think I would consider this game like another Stardew Valley or World's Dawn but without the farming side. In this game you become a cat and you get to experience its life in the wild. When you start the game, you get to choose between three colonies of different cats and that colony becomes your new home. Some of the things you are able to do in the game is hunt, forage, mine, have a romance, and do a short story. The mechanics for the same are simple enough to get the hang of and if for some reason you do not like the placement of the keys, then you can change them. I haven't played around with the mining mechanic too much but it's like Stardew Valley. There are a hundred levels and the farther you go down the better gems you find. \n\nFor the romance option, for each colony you join there are three romance options in each colony. I have not tested it but I believe that even if you are in colony A but like one of the cats in colony B, you can still romance that cat. It's just out of your way to visit them. When you join a colony the romanceable cat starts with two stars and once you reach five stars you can date and then that cat gains a heart. Once that heart turns red then you can marry. Eventually you can have kittens and I believe you can have four. I haven't reach that part yet so I can not say what happens after you get the kittens. I believe you can name them and build your relationship with them. Also if you do not like your partner cat then you can get a black rose and break up with them. \n\nThe story/quest of the game isn't too difficult. It's pretty much a fetch quest of different plants, animals, and bugs that you can find in the game. Its taken me about three years in the game to really find everything. Some things are more rare then others and you could buy some of the items if you don't have the patience to look. The story doesn't have very much depth and they try and cover that up with the fetch quests but this game is not really big enough for a large story so the quest length wasn't too bad in my opinion. \n\nThey let you customize your cat at the beginning of the story. Through out the game, you can buy differant colors of fur for your cat and accessories at different colonies. One thing I like that the game does is that they allow you to recustomise your cat at any time in the game. You could be blue one day and white the next, with different colored eyes. The game also has an experience system where you upgrade four skills to level ten such as hunting, swimming, foraging, and fighting. The game also has festivals at the end of each season where you can play mini games and get tokens. The tokens let you buy quest items, furniture, accessories and even pets for your cat like butterflies and fireflies. \n\nThe seasons are ten days long and there are four seasons. The last day of the season is the festival where all the colonies gather. Another thing you can do in the game is upgrade your den/home. You can add a storage room, garden (kinda), nursery, and two additional rooms to put random stuff in. \n\nOverall I think this game is cute but there is a lot of grinding for the game and the main story is a fetch quest. If you do not mind that and even enjoy that type of game then you will have a blast. I think the customising of your cat in the game is well done and they give you a ton of options and the map is cute/pretty. The music in the game is also well done. There is a huge cat book series I read as a kid called \"Warriors\" by Erin Hunter and this game brought back major memories of that book series. So over all I like the game, I personally think 15$ is a bit much and would wait for the game to go on sale. The game is very grindy but other then that I had no issues with it and thought it was fun and brought back memories of my childhood. \n\n", "timestamp_created": 1513911668, "timestamp_updated": 1513911668, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.559567", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38507739": {"recommendationid": "38507739", "author": {"steamid": "76561198054134534", "num_games_owned": 89, "num_reviews": 2, "playtime_forever": 1878, "playtime_last_two_weeks": 1237, "last_played": 1514309821}, "language": "danish", "review": "Addictive! Only thing I'm waiting for is the kittens and to finish the secret mine... I'm looking forward to the new update!\n", "timestamp_created": 1513897975, "timestamp_updated": 1513897975, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "38492102": {"recommendationid": "38492102", "author": {"steamid": "76561198020583371", "num_games_owned": 677, "num_reviews": 17, "playtime_forever": 4817, "playtime_last_two_weeks": 1577, "last_played": 1514656214}, "language": "english", "review": "I got so addicted to this game really fast. It's cute, it's fun, it really is a good hack and slash rpg.", "timestamp_created": 1513867463, "timestamp_updated": 1513867463, "voted_up": true, "votes_up": 1, "votes_funny": 2, "weighted_vote_score": "0.502618", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38441868": {"recommendationid": "38441868", "author": {"steamid": "76561198362976831", "num_games_owned": 4, "num_reviews": 2, "playtime_forever": 7956, "playtime_last_two_weeks": 526, "last_played": 1513964610}, "language": "english", "review": "Great game! Beautiful graphics, nice story, and fun in general! 11/10 fur sure!", "timestamp_created": 1513729257, "timestamp_updated": 1513729257, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.430158", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38408359": {"recommendationid": "38408359", "author": {"steamid": "76561198070610958", "num_games_owned": 53, "num_reviews": 1, "playtime_forever": 1450, "playtime_last_two_weeks": 236, "last_played": 1514820039}, "language": "english", "review": "The game has a stardew valley vibe to it and it is very enjoyable. from just plain old hunting to getting married and starting a family! i would deffinately reccomend this game to people who like cats,exploration,open world and rpg. it is fun and just AMAZING! i love the game and can't stop playing it.", "timestamp_created": 1513633458, "timestamp_updated": 1513633458, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.526185", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38392038": {"recommendationid": "38392038", "author": {"steamid": "76561198796240065", "num_games_owned": 1, "num_reviews": 1, "playtime_forever": 1443, "playtime_last_two_weeks": 0, "last_played": 1513567568}, "language": "english", "review": "This is a truly stunning game. I just think there is one thing that you should add in! Maybe once you are done with creating the custom clans, can you add multipile litters? Or even the option to play as your kit once they age up? If you play as a quirky kit, options will be like, Time for hunt, or time for Fight? just like the kit's interaction, but more adult cat. Replies to that would be something like, You don't have much prey! Go hunt soon! or, Fights are close to our camp. Go fight for our clan! Anyways, great job guys!\n\n", "timestamp_created": 1513568373, "timestamp_updated": 1513568373, "voted_up": true, "votes_up": 8, "votes_funny": 3, "weighted_vote_score": "0.621212", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38373243": {"recommendationid": "38373243", "author": {"steamid": "76561197993175508", "num_games_owned": 633, "num_reviews": 17, "playtime_forever": 751, "playtime_last_two_weeks": 21, "last_played": 1514780961}, "language": "english", "review": "What I expected: casual, cute cat simulation about hunting and catnip jokes\n\nWhat I got: War, politics, lore, magic powers... combined with all of the above\n\n\nThis game has a lot more depth than the premise would let you believe. Yes, you're a cat who's just trying to survive in the wild, but there are different cat colonies fighting every day in border skirmishes, an old forest guardian has vanished, and you got skills that you can keep upgrading. So far it's pretty fun, and my only real issue is that hunting seems to be a little random; the distance for the pounce doesn't look like it's consistent. Otherwise, this is definitely worth the 19.99 USD", "timestamp_created": 1513507454, "timestamp_updated": 1513507454, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.504132", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38368195": {"recommendationid": "38368195", "author": {"steamid": "76561198382515368", "num_games_owned": 3, "num_reviews": 1, "playtime_forever": 652, "playtime_last_two_weeks": 33, "last_played": 1513819637}, "language": "english", "review": "  Cattails | Become a Cat! has been amazing so far. It's hard for me to explain things, but let me try. It is as it says in the description. There's much more too, but I'll just put that out there. The beginning brought a tear to my eye. Abandoned by your \"friends?\" How cold. The main story itself is interesting. Help Coco, restore the gaurdian, it does get repetitive to some. However, you can take a while from that by having eligable cats swoon over you. Fight for territory, hunt, forage, explore, etc. I'd recommend this game, but not to everyone. This is a game for those who can really just sit down and enjoy the beauty of a game and its tale. Happy hunting.\n\n(Side note: This was a brief description, so sorry if I was vague. I didn't have much time to type this.)", "timestamp_created": 1513488120, "timestamp_updated": 1513488120, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.502618", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38362676": {"recommendationid": "38362676", "author": {"steamid": "76561198382417228", "num_games_owned": 17, "num_reviews": 2, "playtime_forever": 773, "playtime_last_two_weeks": 565, "last_played": 1513658956}, "language": "english", "review": "So, I backed this game on Kickstarter, and let me tell you JUST HOW AMAZED AND ESTACTIC I AM ABOUT IT. My biggest issue with games has always been that I'm not very technically strong (why lie?) and I despise First Person Shooter, or games where violence is *always* the only answer. I am more of the \"Don't Starve/Stardew Valley\" resource managing, survival games, and Cattails has just been absolutely brilliant with what they promised to deliver, and I'm so happy with this game. I've been bragging to all my friends in real life (to the point where they think I'm obnoxious about it, haha), but I seriously love this game. Ya'll should totally buy it in support of these awesome people. Thank you all! (I checked the 'free box, just in case, because I backed it on Kickstarter??)", "timestamp_created": 1513465479, "timestamp_updated": 1513465479, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.502618", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "38362424": {"recommendationid": "38362424", "author": {"steamid": "76561198082258757", "num_games_owned": 62, "num_reviews": 3, "playtime_forever": 300, "playtime_last_two_weeks": 0, "last_played": 1513463756}, "language": "german", "review": "Ich persönlich finde das Spiel ziemlich gut. Nachdem die Hauptquest freigeschaltet wurde, gibt es wesentlich mehr zu tun und gibt dem Spiel einen Sinn. Ich kann verstehen, dass sich viele erstmal beschweren weil es anfangs sehr eintönig wirkt - aber meiner Meinung nach wird es besser. Schön finde ich vorallem, dass man kleine Kätzchen bekommen kann und diese auch aufziehen kann.\n\nMan darf jedoch kein Spiel wie Stardew Valley erwarten, die Dialoge sind im Vergleich nicht so ausgearbeitet. Auch scheint es keine Zwischenszenen mit den Heiratskandidaten zu geben (schade). 2018 soll es jedoch ein Patch geben, mit dem man seine eigene Kolonie aufbauen kann (wuhu).\n\nAlso: sofern man hier kein umfangreiches und tiefsinniges Spiel wie Stardew Valley erwartet und Katzen mag, der hat hier definitiv seinen Spaß.", "timestamp_created": 1513464577, "timestamp_updated": 1513464675, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38341563": {"recommendationid": "38341563", "author": {"steamid": "76561198185739255", "num_games_owned": 36, "num_reviews": 2, "playtime_forever": 824, "playtime_last_two_weeks": 12, "last_played": 1513801719}, "language": "english", "review": "I'd like to clarify that I was one of the people waiting for this game from the moment I heard it was announced, several months ago, by an email that told me the developed of Warrior Cats: Untold Tales was working on a new game. However, I also didn't follow the news on this game aside from its release date, so I could have an experience without more expectations than necessary. \n\nI'd also like to clarify this is my first attempt at a more in-depth review of a game, so I apologize if I'm not really up to par.\n\nAlso, this review may contain spoilers for events throughout parts of the game, if you consider things like characters and details on recurring events to be spoilers.\n\nAs someone who still plays Untold Tales today because I find it fun and familiar, I was hoping for an experience that wasn't a carbon copy of Untold Tales' simple formula, but took the parts that are still fun even now and remixed them into something even better, and something new, and, well... I wasn't disappointed. Cattails is altogether a very different experience from Untold Tales, that's something I can tell just by playing the small amount I have. It feels a lot more like Stardew Valley, which... I personally don't mind. Probably because I love Stardew Valley.\n\nThe hunting system from Untold Tales is here, but far better executed - probably because this game actually has a budget to work with and a more experienced developer, but I digress. There's also a lot more variety in the prey you can catch, and the general distance from which you can do so. Some prey even has variants, such as the three types of mice I've come across so far - there might be more, I don't know. I really like it, even though I spent about ten minutes in the tutorial because I didn't realize I had to press the spacebar to pounce rather than just releasing shift like in Untold Tales. Another cool thing that I'll put here is that what seem like uninteractable set pieces, like butterflies and fireflies, can be attacked and collected. I've been collecting butterflies myself.\n\nThere are three colonies, and after the tutorial you're given the option to join any one of them. Coco, the tutorial cat, pushes the Forest Colony but I'm a rebel, so I picked the Mystic Colony. They live in the wetlands and are led by Alisa. I haven't played with either of the other colonies yet, so my experience is 100% a Mystic experience.\n\nEvery colony has a few datable cats. After looking over my options - the older-than-you Slip, the leader Alisa who I haven't had a chance to get to know, and Nil, who needs higher self-esteem - I went for Nil. Mostly because I gave him catnip one time and he told me he didn't believe he was worthy of it, and I can relate to that.\n\nCat relationships are another place where it falls into being a lot like Stardew Valley. For one, it's not locked by gender - the player doesn't have an established gender. Secondly, you have a relationship level, one to five stars, with each cat. (The datable cats have hearts instead of green arrows in their dialogue boxes.) At four or higher, I think (I'm not sure?) the tutorial wizard Coco will appear in front of your den and instruct you to go get a red rose and ask the object of your affections out already.\n\nOnce you've been dating long enough and have a relationship of five stars, you can buy a certain item that allows you to ask another cat's paw in marriage. Holy catrimony, if you will. Once married, your spouse moves into your den and you can have kittens. I haven't had any luck with my many, many proposals to Nil so far, so that's about as far as my knowledge extends.\n\nSomething I do know more about, though, is dens! You start with a smallish den, but partway through your first winter Molby the Construction Mole will show up in front of it, install his calling card without your consent, and offer to expand your home for money. Some of these upgrades are useful! I've only got two so far, the nursery (required to have kittens) and the herb garden, which lets you grow the plants you forage from around the world, even out of season. You can decorate your den with items from all your exploring. The items don't disappear, which is nice. I've started a stockpile of prey next to my nest.\n\nOn that note, let's talk about skills! Hunting, foraging, and fighting, and probably other things I haven't noticed, all help earn you experience points that you can use to upgrade your skills. Unlike Stardew Valley, your skills don't just level up on their own when you do things - you can apply your experience points to any of the skills, which can be useful if you want to level up something like swimming. I haven't reached the cap (level 10) on any of my skills yet, so that's a bonus.\n\nThe seasons change, too. They're each ten days long, with a festival on the tenth day of each. A festival is where cats gather at the Sacred Temple, the center of the map, to just kinda chill and compete in festival games. You can earn special currency to spend on items like special colorings for your cat or hard-to-catch prey if you need it for something or decorations for your den or even a pet butterfly.\n\nThere's a lot more things that I can't really talk about because I haven't gotten very far in them - like relationships between colonies, and the mines, and even the main questline. I haven't spent a lot of time on any of those things, so anything I could say would be extremely limited and hasn't come up much in my experience. But that's a big part of this game.\n\nTL;DR: A unique experience, but if you came here looking for the sequel to Untold Tales because of the developer you'll be disappointed. If you really like Stardew Valley or other similar games, though, and are looking for something kind of similar but also different - this might be a good game to check out.", "timestamp_created": 1513400596, "timestamp_updated": 1513400596, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38340350": {"recommendationid": "38340350", "author": {"steamid": "76561198215056107", "num_games_owned": 11, "num_reviews": 1, "playtime_forever": 3753, "playtime_last_two_weeks": 1601, "last_played": 1514071020}, "language": "english", "review": "Im an alpha tester as well as a lover of Falcon's last games. I have played this game on and off for quite a while and i have a lot to say about it. I havent played as much as my best friend (an alpha tester and backer), but i've been involved in the communities discord and heard many opinions about this game! Now, here goes my review!\n\nGameplay:\n\nThe gameplay consists of living your life out in a colony as a wild cat. Your main task is hunting to gain food so your cat does not starve. Your cat can catch many wild critters by holding shift and sneaking up on the prey. It feels a bit unbalanced, because hunting is surprisingly challenging at first, but at high levels the prey basically walks into your paws.  The hunting feature is fun although leaves a bit to be desired.\n\nThe next mechanic is foraging. Your cat can pick berries and roots that will restore a tiny bit of hunger, and certain plants to heal you. There are also misc plants with effects like growing territory and giving your cat a boost. Its a cute mechanic and i dont have much to complain about it.\nAlthough, it feels a little unrealistic for cats to eat berries, but i wont complain. One of my cats in real life loves to eat people things sometimes, I caught her eating noodles the other day! It was hilarious!\n\nBattling is a major part of the game, and the thing i was most excited for.  The battle system is pressing spacebar for attack, and there are a couple special skills you can get, such as one that drains health overtime. But i have to say, the battle system could be much improved. Its repetitive, and at high levels, you can defeat patrols of 7 cats at once with ease, which is quite unrealistic. I believe developing the battle system offers a LOT of potential!\n\nNow, here are my main issues regarding gameplay. As people said, it is incredibly fun. Also as people said, it can get really repetitive. My main issue is the game has a lack of balance. When you level up, it becomes so easy (even on hard mode) the game loses a portion of its fun. Prey and items are able to be spotted up on the minimap at high levels, and defeating patrols is extremely easy. The game goes into a cycle of waking your cat, catching prey, talking to  the cats, Maybe mining or some misc activity, but it is not a fun long term game.\n\n Its good to play in short bursts, but i find a lack of incentive to be an issue. The game suffers because it does not have a very good quest or event system that can help you feel like you want to find items for a goal. There is a main quest where you can catch items and bring them to certain statues, which is something, but it is very simple and underwhelming, and seems to just be a continuation of the daily grind. It justs asks you to hunt items and bring them like usual, and does not offer anything unique, like a rescue quest, or a time quest, or maybe a special skill or reward for each quest.\n\nIn conclusion, the game is amazing, but i reccomend the following to improve the gameplay:\n\nA random event system where you may have to find certain items, another cat, or maybe that plays out a little bit of story. Or, a quest system where you can find and bring back rewards. Something that keeps you motivated to play! Maybe some special accessory or event when you collect certain items. There should be something to break that repitition cycle so many people speak of, making it a true wilderness adventure.\n\nBut, thats my take on it.\n\n\nStory:\n\nIll say that there is not quite a story in this game that is very developed. We have many cats we can talk to in our colonies, and they are quite cute characters. I like the uniqueness of the characters designs, and seeing my friends backer cats has made me very happy. You can give them items for dialogue, a fun system. Marriage and kits are great, and i have no suggestions on those.\n\n Now, i know falcon has heard this a lot, but a suggested improvement has been to have marriage eligibility for every cat. You cannot marry many of the cats, including some of the communities favorite felines in the game. I do think that would be a positive change. \n\nCoco, our mysterious helper, also has their own gamemode. Its the gameplay with the statues, where you give the statues items, the forest guardian quest. Now, my best friend, also an alpha tester, has said it leaves room for improvement, and i must agree. It was not very engaging to get the statues items, and it did not reap satisfying enough rewards for the effort. Now, why would i not like the system when i suggested quests and events? Well, it eases the repetitive grind. You are still looking out for the same items and living the same day, though, and it just did not seem any more interesting then your daily cat life.\n\n\nMusic:\n\nThe music? Well, it is what it is. Not amazing, but it has its moments. There are a couple tracks that play during seasons, which are nice, though i only really like the winter soundtrack. I still am satisfied with it, as music isnt a big deal for me, though it can get repetitive. I just realized I have the whole soundtrack too apparently, being an alpha backer, hehe.\n\nArt:\n\nI have a lot to say about the art of the game. Simply, I love it. The cats and enviroments look wonderful and natural. I have to say, this was a huge selling point of the game for me. Sure, you could say some of the cats profiles look a bit awkward, but the sheer effort that was put into it makes me unable to say anything bad about it. I love the charm of the leaves and bugs flying through the air, and the winter snow is beautiful. Thanks for making me feel like a real cat, falcon.\n\nConclusion:\n\nIm going to end by saying that I really love cattails. I know it seems like i gave it some negative comments, but i want the game to improve. I love the potential, direction, art, everything. This game is important to me and im very thankful to falcon for this amazing game yet again.  It suffers from repetition, a bit of ability imbalance, and a oversimplified battle mechanic, but succeeds in aesthetic and design, adorable and unique direction and customization, and charming characters. I have met many wonderful friends who play this game, mainly through the discord.Thanks for letting me live life like how it goes in my cats wildest dreams!", "timestamp_created": 1513395439, "timestamp_updated": 1513395439, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.532710", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38331608": {"recommendationid": "38331608", "author": {"steamid": "76561198047285515", "num_games_owned": 177, "num_reviews": 5, "playtime_forever": 3269, "playtime_last_two_weeks": 0, "last_played": 1513185662}, "language": "english", "review": "Oh man, this game!\nI'm a type of gamer who would love to see games where you are an animal to control. I have searched a bunch till I got into this!\n\nAt first I saw this game before release and though to my self that this is just some RPG Maker made game, something simple and something even I can make. After the release, the game has a lot of positive reviews, so I must be wrong!\nI bought it, and I tried it. Good god I was wrong! I played for a couple of hours and then I was stuck after days in this game.\n\nI have found some flaws in this game but not too big. FPS drop happens by certain spots ingame, these are quite familiar to me. I had used RPG Maker before, and I know when you adding too much stuff on one screen, the game lags and the framerate drops extremely, and it's just a 2D game which I don't understand why that's happening. However, I wonder if it has something to do with bitrate of the game. I mean... I have programs that has 32 bits and 64 bits, comparing them what I have notice is that 64 bit can handle more than 32 bits... right? Could it be that this game runs on low bits? Anyway...\n\nAlso after you get released from Coco on the first days, it gets quite lonely for not sure what to do. But it's not a big deal, you can then go explore and do whatever you want. But I do wish there were more intereaction with the cats around, like cutsceens, plots and more about them, you know?\n\nBut overall, it's really nice! The music... Oh god the music! I loving it! I want to buy the soundtrack which is possible, but I'm not into buying the artbook aswell... Can you seperate them for me? Thank you!\n\nDo I recommend this game? **** yeah! What game are you a cat that mines in caves, anyway?", "timestamp_created": 1513364337, "timestamp_updated": 1513364420, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502618", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38326329": {"recommendationid": "38326329", "author": {"steamid": "76561198131408348", "num_games_owned": 6, "num_reviews": 2, "playtime_forever": 3408, "playtime_last_two_weeks": 741, "last_played": 1514820190}, "language": "english", "review": "Amazing!!!!! Please make the update for making your own colony!!!! (Ps: make it so you have to collect sticks and twigs and flowers to build dens, and rocks for rock dens, and also if you make a den with sticks and say, catnip, there will be catnip poking out of the den, but you can't add flowers to rock dens, also make it so that you can make your colony anywhere!)\nTHIS IS THE BEST GAME EVER!!!!!!!!!!!!!!!!!!!!! The only thing I want to say is that if you stpe on a stick, it cracks and scares prey and that if youn have extra prey, you can bury it! (But I know it's hard to make a pixel game as AMAZING as yours, so you guys did a great job!) \nPLEASE, EVERYONE, PLAY THIS GAME {MEOW :) }", "timestamp_created": 1513350328, "timestamp_updated": 1513350328, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.518389", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38314120": {"recommendationid": "38314120", "author": {"steamid": "76561198382955088", "num_games_owned": 4, "num_reviews": 2, "playtime_forever": 1597, "playtime_last_two_weeks": 440, "last_played": 1514696864}, "language": "english", "review": "this game gives me the nostalgic feels when I used to read the warrior cat series, that was the reason I bought the game. \n\nanother this is I want to give some suggestions and opinion about the mechanics, such as it takes too long to go from one side of the map to another unless you have sprint which has a short cooldown but I guess the point to this game is you are not suppose to rush and take your time. Also I really wish the marriagable cats have more dialogue than just repeating the same thing everyday (so far ive only been dating).\n\nThe only downside the game has is the currency in the game are tough to earn a lot and healing gets expensive everytime you use their service.\n\nbesides the downside I love the soundtrack, its so relaxing. (I love the autumn soundtrack its makes me feel like im in a cafe)", "timestamp_created": 1513303076, "timestamp_updated": 1513303076, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502618", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38310454": {"recommendationid": "38310454", "author": {"steamid": "76561198389185871", "num_games_owned": 9, "num_reviews": 6, "playtime_forever": 3124, "playtime_last_two_weeks": 1608, "last_played": 1514136287}, "language": "english", "review": "Hunt, Eat, Sleep. Hunt, Eat, Sleep. Hunt, Eat, Sleep. Hunt, Eat, Sleep. Hunt, Eat, Sleep. Hunt, Eat, Sleep. Hunt, Eat, Sleep. Hunt, Eat, Sleep. Hunt, Eat, Sleep. Hunt, Eat, Sleep. Hunt, Eat, Sleep. Hunt, Eat, Sleep. Hunt, Eat, Sleep. Hunt, Eat, Sleep. Hunt, Eat, Sleep. Hunt, Eat, Sleep. Hunt, Eat, Sleep. Hunt, Eat, Sleep. Hunt, Eat, Sleep. Festival!\n\n\nCons:\nWhen you die, you lose EVERYTHING. Not 'One or Two things', EVERYTHING. \nToo Little Content\nThe colors to some of the cats (A purple and black cat. A blue cat, a cat with a PLAGUE MASK).\nYou die way too easily.\n\n\nPros:\nMusic\nAtmosphere\nFestivals\nPrey", "timestamp_created": 1513287899, "timestamp_updated": 1513287948, "voted_up": true, "votes_up": 3, "votes_funny": 3, "weighted_vote_score": "0.501981", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38294207": {"recommendationid": "38294207", "author": {"steamid": "76561198244340920", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 3234, "playtime_last_two_weeks": 2813, "last_played": 1513818849}, "language": "english", "review": "Love this game, hope new stuff keeps coming. So far the story seamed to go fast as well as the year with only 40 days, but that dosent stop this game from being amazing. Beautiful art, music, and feel.", "timestamp_created": 1513225894, "timestamp_updated": 1513225894, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502618", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38288470": {"recommendationid": "38288470", "author": {"steamid": "76561198126089840", "num_games_owned": 74, "num_reviews": 1, "playtime_forever": 78, "playtime_last_two_weeks": 0, "last_played": 1513197570}, "language": "english", "review": "Just got into the game after kickstarting it. \n\nFirst thing, it came out ON TIME. 10/10\n\nSecond thing, the pixel art looks wonderful, the world feels very interactive and there are a lot of things going on. I hesitate to compare it to stardew valley because it's it's own thing, but if I'm being honest it does have stardew vibes. \n\nThis game is nothing short of charming, and I highly reccomend it to anyone with a soft spot for animals and laid back simulators like stardew. Nothing but a good time. <3", "timestamp_created": 1513199351, "timestamp_updated": 1513199351, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.494237", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38271598": {"recommendationid": "38271598", "author": {"steamid": "76561198455265838", "num_games_owned": 3, "num_reviews": 1, "playtime_forever": 1333, "playtime_last_two_weeks": 44, "last_played": 1513896233}, "language": "french", "review": "Fan de ''Warrior Cats'' vous en seriez ravie. \n\nVous aviez le choix d'entré dans l'un des trois clans. Ils vendent chacun des items différent ainsi que des design de fourrure propre à leur environnement. (Même si au final, on peux tous les débloquer...) Le système de saison est bien pensé, mieux vos faire de bonne privision si vous voulez survivre à l'hiver! Le système de combat est simple tout comme celui de la chasse et pourtant (pour ma part) on apprécie rapidement cette légerté. \n\nAient essayez plusieurs jeux de genre ''simulation'' ''rpg'' j'adore celui-ci. Y'a toujours quelque chose à faire, donc pour le prix qu'il vaux on en est satisfait.  Si vous aimez Warrior Cats et les jeux de simulation, c'est probablement un jeux que vous allez adorer.", "timestamp_created": 1513135992, "timestamp_updated": 1513135992, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38263133": {"recommendationid": "38263133", "author": {"steamid": "76561198276315184", "num_games_owned": 14, "num_reviews": 1, "playtime_forever": 1668, "playtime_last_two_weeks": 231, "last_played": 1514632603}, "language": "english", "review": "Its a very good game. As you get used to the controls, I reccomend upgrading your den. The only thing I could think of fixing was the Indoor garden. As the leafbare/winter comes, it freezes up. But somehow, you still grow herbs. So I think you should make it look a little more alive, overall. 4/5 Paws from me!", "timestamp_created": 1513104304, "timestamp_updated": 1513104304, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502618", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38257492": {"recommendationid": "38257492", "author": {"steamid": "76561198358398359", "num_games_owned": 358, "num_reviews": 2, "playtime_forever": 989, "playtime_last_two_weeks": 0, "last_played": 1513433750}, "language": "schinese", "review": "小时候读过猫武士，很喜欢，真的", "timestamp_created": 1513087829, "timestamp_updated": 1513087829, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38252471": {"recommendationid": "38252471", "author": {"steamid": "76561198366070068", "num_games_owned": 23, "num_reviews": 1, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1513067312}, "language": "english", "review": "This is a pretty decent game, and I think it's worth $15. Essentially it's a lot like Stardew Valley, but you- well, you're a cat. You hunt, forage, fight cats from other colonies to establish territorial dominance, do a little dungeon mining, collect item sets, and establish relationships with other cats.\n\nThe problem is that the gameplay mechanics themselves are rather basic, and after a few hours it definitely starts to feel repetitive. Stardew Valley sidestepped this problem by having a farm you could customize in almost every single way, along with stuff like fishing which made what could have been a throw-away mechanic engaging and lucrative. In Cattails, you're given character customization options, and you can eventually upgrade your home den to have stuff like a nursery or garden or aesthetic props, but none of it goes as far as Stardew does. \n\nCombat consists of pressing the attack button until your opponent is dead, occasionally using some special powers you unlock through XP gains. You can, sort of, dodge attacks by moving away from enemies, and you can usually run from any fight if it's too tough or you're being mobbed. Stardew Valley's combat wasn't very good or focal either, but there was at least some variety in enemy types and a certain satisfaction in destroying a bug with a sword. As far as I can tell, Cattails has two enemy types: cats and dungeon bats of varying degrees of HP and attack strength; both attack or run away if their health is low. Considering that you can partake in optional battles every day, the system just doesn't have staying power.\n\nThe dungeon stuff is also underwhelming. You collect ores and gems to trade in for tokens. I may not just be going down deep enough, but at level 20 of the mines, all there was to do was break open rocks and fight the occasional bat. If there's any collectibles or unique things to be found there, I haven't gotten to it yet.\n\nTo hunt, you sneak up to prey (but not too close), until a circle fills up above their heads and you pounce. This is done for animals on land as well as fish. You can forage a moderate variety of plants that do several things, from healing to nourishment to applying poison damage on enemies to cementing your colony's control of a region. \n\nThe relationship system is well done, but also comparatively limited in content. There are about a handful or so of interactible NPCs in each colony/faction, and AFAIK only through festivals do you interact meaningfully with other colonies outside of battles. You can date NPCs from your colony and eventually marry them and have kittens if you want. The writing is well done, amusing and cute, though characters tend to repeat themselves as the days go by. \n\nDespite its problems, though, I like Cattails. It needs more content put into it (after glancing at their website forums it looks like the devs are working on custom colony building) and it doesn't have nearly the same effortlessly addicting quality that Stardew Valley does, but it's bursting with charm. You could do a lot worse for fifteen bucks, and if it's ever on sale for less I'd call it a no-brainer if you're a fan of Harvest Moon/Stardew life simulation games.", "timestamp_created": 1513067342, "timestamp_updated": 1513067342, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.583333", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38249636": {"recommendationid": "38249636", "author": {"steamid": "76561197988055697", "num_games_owned": 279, "num_reviews": 25, "playtime_forever": 858, "playtime_last_two_weeks": 112, "last_played": 1514429608}, "language": "english", "review": "It's pretty good, not super elaborate exactly and it tends to be repetitive but if you like pixel art or cats with a sufficient passion you'll probably like this.", "timestamp_created": 1513054030, "timestamp_updated": 1513054030, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502618", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38245954": {"recommendationid": "38245954", "author": {"steamid": "76561198354409083", "num_games_owned": 15, "num_reviews": 3, "playtime_forever": 1275, "playtime_last_two_weeks": 260, "last_played": 1514678992}, "language": "english", "review": "I totally have have fallen in love with this game but I have a few suggestions maybe when stalking you could hold a plant and get closer to the animal before they notice you and/or you could get closer dipending on what the animal is doing or facing also the other colonys they have the same abilitys like when there chasing you they can't walk on water and you can see there health", "timestamp_created": 1513037565, "timestamp_updated": 1513037565, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38243453": {"recommendationid": "38243453", "author": {"steamid": "76561197998743026", "num_games_owned": 183, "num_reviews": 1, "playtime_forever": 1371, "playtime_last_two_weeks": 418, "last_played": 1513376466}, "language": "english", "review": "This game is pretty much if you took Stardew Valley, replaced farming with hunting, and injected it with unbearable cuteness.  It's not the deepest game, but it is a relaxing one, one that I found myself playing a lot more than I expected to.  Everything about it is very chill and I have a real appreciation for that.  And cats, I really like cats.  I would say that if you are a crazy cat person, you cannot go wrong with this game.", "timestamp_created": 1513026880, "timestamp_updated": 1513026880, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38239177": {"recommendationid": "38239177", "author": {"steamid": "76561197971291045", "num_games_owned": 312, "num_reviews": 44, "playtime_forever": 1239, "playtime_last_two_weeks": 558, "last_played": 1513733784}, "language": "english", "review": "I rather enjoy becoming a cat! (Disclosure: Backed this on Kickstarter, for what that's worth.) \n\nCattails falls into a genre of relaxed, daily-rhythm games that used to be Harvest Moon-like but is now Stardew Valley-like. (Though I'd say that this has the most similarity to Survival Kids/Lost in Blue with a tough of Cube and Star: An Arbitrary Love.) \n\nThe world is open before you, but as it goes through seasonal changes, it opens up to you like a puzzle box. Plants to forage for and animals to prey upon move in and out of the world according to rhythms that just barely elude you, since you are a cat. You murder them all, often for experience points. There's a central MacGuffen that imposes a modicum of order and direction on all this murder, but while it's welcome, it's not really the point. \n\nThere are also cat politics which I haven't quite worked out yet (though again, systems that you haven't quite worked out yet are part of the joy of this sort of game). There's a mining section stapled on, which is fine. But mostly you walk around the landscape to murder small animals and to get slightly better at murdering small animals with practice. \n\nAnt it does take practice--there's an awkward rhythm to the pounce that is quite satisfying when you get it right, but the kill never feels guaranteed. I imagine that there's a lot of math happening in the background generating random-feeling pounce radii and the like based on the temperature and the time of day and how hungry your cat is, and so on. Fighting other cats is similarly fidgety and awkward, but in that good way, where getting into any fight at all is a fearsome proposition. You feel like you're part of an ecosystem rather than The Player Character in an important way. \n\nI could make some criticisms that are more like dev notes. (Menus are pretty bad: If you want to sell and then buy a commodity, you need to talk to a character, complete the sell transaction, leave the dialogue tree, talk to the character again and complete a separate buy transaction. There doesn't seem to be a way to assign special abilities to particular keys/buttons, so you're stuck with the default assignments until you have enough skills unlocked to strategically enable and disable them. There are some contextual situations where the game reads your inventory to see what you most likely want to do, and you go through \"Is this what you wanted? Y/N\" until it guesses right.) \n\nBut the rhythm is there. The core mechanic of wandering around and happening upon things and killing them because you are just an adorable murder-baby is there. It's a good time!", "timestamp_created": 1513012013, "timestamp_updated": 1513012013, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38231706": {"recommendationid": "38231706", "author": {"steamid": "76561198356155930", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 444, "playtime_last_two_weeks": 0, "last_played": 1513327596}, "language": "english", "review": "I like this game so far-its very fun however there is a lot of lag when going into certain areas and sometimes my cat glitches and I can't control where they go?", "timestamp_created": 1512987082, "timestamp_updated": 1512987082, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38227412": {"recommendationid": "38227412", "author": {"steamid": "76561198186407161", "num_games_owned": 10, "num_reviews": 1, "playtime_forever": 963, "playtime_last_two_weeks": 76, "last_played": 1513843337}, "language": "english", "review": "This game is great! There's so much detail and beauty. It's like living out a second life as a wild cat - as soon as the free create-your-own-colony update arrives, I will live out the Warriors books in pixel form ^-^.", "timestamp_created": 1512965107, "timestamp_updated": 1512965107, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.461785", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38226943": {"recommendationid": "38226943", "author": {"steamid": "76561198073790114", "num_games_owned": 6, "num_reviews": 1, "playtime_forever": 1616, "playtime_last_two_weeks": 0, "last_played": 1512962561}, "language": "english", "review": "I had this game in early release and it has only gotten better. The graphics are wonderful the game play is amazing. I would recomend this game to anyone.", "timestamp_created": 1512962692, "timestamp_updated": 1512962692, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502618", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38225369": {"recommendationid": "38225369", "author": {"steamid": "76561198116881678", "num_games_owned": 97, "num_reviews": 3, "playtime_forever": 303, "playtime_last_two_weeks": 0, "last_played": 1513311626}, "language": "english", "review": "this game is so cute, the music is soothing, and you get to be a cute cat!!", "timestamp_created": 1512956115, "timestamp_updated": 1512956115, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502618", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38223431": {"recommendationid": "38223431", "author": {"steamid": "76561198195436890", "num_games_owned": 19, "num_reviews": 2, "playtime_forever": 3669, "playtime_last_two_weeks": 311, "last_played": 1513993453}, "language": "english", "review": "There are two kinds of gamers: those who can enjoy life sims, and those who cannot. Some people need the game to show them \"this is what your goal is,\" and others are very happy to invent their own goals regardless of whether or not the game gives you one. If you're in that latter category, then by all means, I recommend this game to you. Especially if you like cats. Otherwise... you'll probably find yourself growing bored right after the tutorial. \n\nAlthough I feel like this was pretty ingenious--[i]of course[/i] you have no goal at first. You're a housecat that was dumped off into the middle of nowhere! Your first few days should be spent learning how to survive. THEN you can come up with something to do. (And the game provides you with a main quest a few days later, so there's that.)  \n\nWhat I like:\n>The festival games are fun. \n>Unlike stardew valley, this game feels more polished, code-wise. SV had a lot of glitches, and that's not to mention that some parts of the game (looking at you, dumb festival with the slingshot minigame!) are virtually unplayable. In Cattails, I haven't run into a single thing that felt like shoddy programming. \n>You can get married and have kittens\n>Your kittens inherit their looks from their parents, and can be a mix of the two coat colors. Later on, they can join you in your adventures!\n>You can decorate your den, and move about as you please.\n>You can expand your den\n>Tons of coat colors to choose from and/or collect.\n>Arthur is the most adorkable cat I've ever seen and I love him to bits\n>Main Quest quite like that of SV's. \n>Sliding on ice is ridiculously fun\n\nWhat I dislike:\n>Fighting is lame. It basically boils down to \"who has the most numbers?\" \n>Getting money can be rather hard. Lots of things costs ridiculous amounts of money (nursery expansion is 500 mews! The highest thing I've been able to sell was somewhere around 15 mews)\n>A couple of the cats have slightly wonky portraits\n>THE MUSIC. OMG [i]THE MUSIC.[/i] This is probably the first time I've ever muted a game's soundtrack, because I prefer to play the devs' intended experience. Each season seems to start off with one song, which is usually pretty good, but then it gets replaced by this dumb jazz-like tune that starts grating your nerves after a while. Thankfully, you can turn the music off. (Or at least make it nearly inaudible.)\n\nAll in all, though, I fully recommend this game if you're a fan of life simulation games and cats.", "timestamp_created": 1512948049, "timestamp_updated": 1512948049, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.580838", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38212652": {"recommendationid": "38212652", "author": {"steamid": "76561198078324753", "num_games_owned": 77, "num_reviews": 9, "playtime_forever": 390, "playtime_last_two_weeks": 0, "last_played": 1512713121}, "language": "english", "review": "This is a cute game with a good concept but it is extremely repetitive. I wanted to love this game but it lacks npc dialogue variety and basic gameplay variety. A good, engaging quest system is a sorely lacking in this game. This game begs some kind of goal system besides the main story line to break up the monotony of repeating the same tasks over and over. Otherwise, you're just wandering around in circles catching the same prey and collecting shrubs for minimal xp rewards.\n\nA simple introduction to gaining reputation with the other cats and clans would go a long way in making this game more new player friendly as well. \n\nStardew Valley this is not.", "timestamp_created": 1512918666, "timestamp_updated": 1512918666, "voted_up": false, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.591422", "comment_count": "7", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38201723": {"recommendationid": "38201723", "author": {"steamid": "76561198395949542", "num_games_owned": 20, "num_reviews": 1, "playtime_forever": 237, "playtime_last_two_weeks": 0, "last_played": 1513224109}, "language": "english", "review": "Amazing game, It's very fun to play for long periods of time or short periods such as before work or anytime really. Any amount of play will give you experiance you need :)", "timestamp_created": 1512887674, "timestamp_updated": 1512887674, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.496732", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38194049": {"recommendationid": "38194049", "author": {"steamid": "76561198041100696", "num_games_owned": 186, "num_reviews": 2, "playtime_forever": 826, "playtime_last_two_weeks": 5, "last_played": 1514680766}, "language": "english", "review": "This game is sort of a life sim for a cat in the wild. Most of the time it's pretty open ended with you just wandering around, talking to cats, gaining territory, hunting, and fighting border battles against other cat clans. There does appear to be a main story/plot, but it doesn't move quickly and is a nice addition, but is not a driving force in your day to day activity other than to hunt down some things the quest wants or to make friends with particular cats (so far at least). If that sounds like something you enjoy, then go ahead and pick up the game! If not, then perhaps it's not for you. I for one really enjoy it and am looking forward to planned updates in the future ^_^", "timestamp_created": 1512860375, "timestamp_updated": 1512860375, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.520548", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38193826": {"recommendationid": "38193826", "author": {"steamid": "76561198127125965", "num_games_owned": 51, "num_reviews": 1, "playtime_forever": 1726, "playtime_last_two_weeks": 315, "last_played": 1514678336}, "language": "english", "review": "I CAN'T SAVE!! :( \nEvery time I exit the game, (Yes, I saved the game in my den) I come back trying to get back to my adventures with my character, Strawberry, but it says I have no saved games. I'd love to be able to properly save and come back to the game without having to create a new save.\n\n I hope Falconstar reads this because I love to play Cattails because all of the unique features and possibilities.", "timestamp_created": 1512859667, "timestamp_updated": 1512859667, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38174658": {"recommendationid": "38174658", "author": {"steamid": "76561198128244044", "num_games_owned": 28, "num_reviews": 2, "playtime_forever": 486, "playtime_last_two_weeks": 22, "last_played": 1514811332}, "language": "english", "review": "i really love this game", "timestamp_created": 1512811821, "timestamp_updated": 1512811821, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38165670": {"recommendationid": "38165670", "author": {"steamid": "76561197988427759", "num_games_owned": 206, "num_reviews": 4, "playtime_forever": 44, "playtime_last_two_weeks": 0, "last_played": 1512693689}, "language": "english", "review": "Like Stardew Valley, but less farming and more murder!", "timestamp_created": 1512777780, "timestamp_updated": 1512777780, "voted_up": true, "votes_up": 0, "votes_funny": 5, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38163996": {"recommendationid": "38163996", "author": {"steamid": "76561198200069489", "num_games_owned": 7, "num_reviews": 3, "playtime_forever": 1304, "playtime_last_two_weeks": 253, "last_played": 1513960819}, "language": "german", "review": "Cattails is a nice game for everyone who loves cats :D You have a big world to explore, very unique and adorable characters and a lot of detail. All the characters have their own lines which brought many smiles to my face and there are also many different dateable cats. \n\nAs this is an RPG you can do everything you like and there are also some nice achievements to get :D \n\nAnd so many great pelt colours! \n\nI just love this game and can only recommend it :D", "timestamp_created": 1512771594, "timestamp_updated": 1512771594, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38160247": {"recommendationid": "38160247", "author": {"steamid": "76561198052371732", "num_games_owned": 303, "num_reviews": 2, "playtime_forever": 328, "playtime_last_two_weeks": 0, "last_played": 1512846506}, "language": "english", "review": "This game is the cutest thing ever and I love it so much. It's such a feel good game and so laid-back and relaxing that I whole-heartedly recommend it to anyone.", "timestamp_created": 1512759561, "timestamp_updated": 1512759561, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502618", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38155807": {"recommendationid": "38155807", "author": {"steamid": "76561198130087006", "num_games_owned": 9, "num_reviews": 1, "playtime_forever": 152, "playtime_last_two_weeks": 0, "last_played": 1512001472}, "language": "english", "review": "This game is one of the best games I have EVER played with great game-play and some great story well worth the $15. Also worth the $50 that I paid for early access!", "timestamp_created": 1512747279, "timestamp_updated": 1512747279, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.463822", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38155749": {"recommendationid": "38155749", "author": {"steamid": "76561198048856291", "num_games_owned": 22, "num_reviews": 1, "playtime_forever": 703, "playtime_last_two_weeks": 117, "last_played": 1513728806}, "language": "english", "review": "VERY cute and nicely made game! I've been following it for several months and I'm so happy that it's finally here. It's great for making up your own story as you go along but I do wish there was a little more to do in the game and more romance options. Both my favorite cats in my colony are unavailable and that's such a shame since their writing is so fun.", "timestamp_created": 1512747174, "timestamp_updated": 1512747174, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502618", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38154079": {"recommendationid": "38154079", "author": {"steamid": "76561198115663526", "num_games_owned": 22, "num_reviews": 2, "playtime_forever": 1942, "playtime_last_two_weeks": 44, "last_played": 1513745855}, "language": "english", "review": "I love the game wish they had more choices in mates but other then the game is fun.", "timestamp_created": 1512742630, "timestamp_updated": 1512742630, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.531915", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38137162": {"recommendationid": "38137162", "author": {"steamid": "76561198375290284", "num_games_owned": 7, "num_reviews": 1, "playtime_forever": 93, "playtime_last_two_weeks": 39, "last_played": 1513826868}, "language": "english", "review": "Beautiful, relaxing game. I love video games but the first to admit, I die a lot, and I'm not that great in general. So I am a big big fan of casual, steady paced games. I really can't find anything bad to say about it. Other than, I do wish there were more items like plants, etc to pick up. But I only say that because I love collecting and hoarding things, espcially to do with nature. ;P", "timestamp_created": 1512677951, "timestamp_updated": 1512677951, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.508929", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38136705": {"recommendationid": "38136705", "author": {"steamid": "76561198053171575", "num_games_owned": 149, "num_reviews": 1, "playtime_forever": 2029, "playtime_last_two_weeks": 49, "last_played": 1513898773}, "language": "english", "review": "I really like this game and have been playing it a lot. But iv'e been having problems, for some reason im really slow in some areas, like my den whitch is REALLY anoying when organizing. Can anyone fix this problem as it's now been hapening in the Sacred temple and by the beach. If youknow the cause of itand how to fix it, that would be great. Other wise an amazing game though. One last thing it's only in my first save file as I tested it in another one.", "timestamp_created": 1512676586, "timestamp_updated": 1512676586, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.529183", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38121869": {"recommendationid": "38121869", "author": {"steamid": "76561198037704819", "num_games_owned": 269, "num_reviews": 22, "playtime_forever": 385, "playtime_last_two_weeks": 0, "last_played": 1512722931}, "language": "english", "review": "I would recommend this game if you:\n\n*Enjoy playstyles somewhat similar to harvest moon or stardew valley (gathering each day, mining, romance options, and exploration.)\n*Love cats!\n\nThere is actually a fair amount of stuff here in the first version with three different colony options to be a part of, an easy, normal, and hard mode, cat fighting for territory, decorating your little den, finding love and having kittens.  I feel like it's a game you can come back and enjoy a little each day.  The music is well done too.  Kudos to the indie development team for a fun adorable idea!", "timestamp_created": 1512626371, "timestamp_updated": 1512626692, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502618", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38119071": {"recommendationid": "38119071", "author": {"steamid": "76561198180284799", "num_games_owned": 239, "num_reviews": 133, "playtime_forever": 50, "playtime_last_two_weeks": 0, "last_played": 1512615344}, "language": "english", "review": "Like stardew valley but not as in depth and you're a cat. It's pretty fun I guess.", "timestamp_created": 1512615376, "timestamp_updated": 1512615376, "voted_up": true, "votes_up": 7, "votes_funny": 2, "weighted_vote_score": "0.618768", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38114225": {"recommendationid": "38114225", "author": {"steamid": "76561198171911471", "num_games_owned": 38, "num_reviews": 6, "playtime_forever": 742, "playtime_last_two_weeks": 0, "last_played": 1512837680}, "language": "english", "review": "This game is amazing, From the secondi purchased it and palyed it i loved it. Within hours i was already a part of the game board and talkign with people on it and about how good the game was no less. This game is a fun simulator game where you have to survive and fight for your colony as a cat and i think that its jsut a really cool and fun game and i am especially glad that the game doesnt lose your intrest after playing with the similar goal of surviving every day, it doesnt get boring for some reason i continue playing and playing. I also love the soundtrack and bought the dlc with the soundtrack the day after i bouight the game. Anyway if you love cats and rpg's about survival then i definitly recommend this game.", "timestamp_created": 1512596913, "timestamp_updated": 1512596913, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502618", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38110572": {"recommendationid": "38110572", "author": {"steamid": "76561198204993104", "num_games_owned": 23, "num_reviews": 3, "playtime_forever": 1777, "playtime_last_two_weeks": 0, "last_played": 1513029609}, "language": "english", "review": "This adorable game has such a charm to it, and I can't stop playing honestly. I've always been a huge fan of the Warrior Cats novel series, and these kinds of games in general, so this is wonderful. And a two-person team? I'm really impressed by that.\n\nGameplay wise you hunt, forage, claim territory, mine, explore, get to know other kitties, level skills, etc., (as a cute as frick cat of course!), and while yes, you do the same things over again, I don't personally find this repetitive, but it definitely comes down to personal preference on games like these. (If you enjoy the Harvest Moon franchise, this is probably a good bet for you!)\n\nOverall, I'm really enjoying this game, what it currently has to offer gameplay wise, and I 100% recommend it (again, keep in mind whether you are fine with slightly repetitive gameplay or not). Looking forward to what the devs release update wise in the future! \n", "timestamp_created": 1512585778, "timestamp_updated": 1512585778, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.551282", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38099640": {"recommendationid": "38099640", "author": {"steamid": "76561198003178355", "num_games_owned": 149, "num_reviews": 2, "playtime_forever": 3240, "playtime_last_two_weeks": 0, "last_played": 1512863531}, "language": "english", "review": "If you've ever played Harest Moon or Stardew Valley and loved it then you'll love this game too. It's like them... but with cats! It's a solid game so far but it does lacks in some game mechanics and variety a bit. However considering that this was done by a two person team, it's still a darn good game and I definitely recommend it if you enjoy the genre.", "timestamp_created": 1512556005, "timestamp_updated": 1512556005, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.530201", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38093817": {"recommendationid": "38093817", "author": {"steamid": "76561198353916431", "num_games_owned": 12, "num_reviews": 2, "playtime_forever": 1442, "playtime_last_two_weeks": 7, "last_played": 1513793161}, "language": "english", "review": "I love cattails but when i try to exit the game it freezes I have to restart and i lose all of my progress! Fix this please!", "timestamp_created": 1512528367, "timestamp_updated": 1512528367, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.489804", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38090351": {"recommendationid": "38090351", "author": {"steamid": "76561198162642123", "num_games_owned": 48, "num_reviews": 4, "playtime_forever": 1289, "playtime_last_two_weeks": 0, "last_played": 1512789127}, "language": "english", "review": "Is this game worth buying? Yes and no.\nI've been following the development of the game for a while, so I had pretty high expectations for it. It meats most of my expectations, but not all.  The only real complaint I have right now is that there are a few promised features that aren't here just yet.  The create-your-own colony feature is the most obvious one.  But the dev promises it will be here early 2018.\nI've heard it can get repetative, and I somewhat agree.  It can get dull.  You hunt, fight, forage, swim, and mine.  Do any of them too much, especally on an easier mode, and it gets old after a few hours.  I've found bumping up the difficulty helps make it more interesting.\nThe music also has started to irriate me.  I often play without sound now, and that's really helped.  The music just feels overly cheerful and energetic at some points.\nI also must mention the puzzles in the game.  I'm not a fan, mainly because I wasn't expecting them.  I love puzzles normally, but these felt like they came out of nowhere.  So be prepared if you do Coco's quests, bring food and healing herbs.\nOne thing I do love is having kits. Right now each cat can only have one litter. But the kits are adorable.  Mine are kinda ugly though, but adorably ugly. Kind of like pugs.  The genetics in the game are by far my favorite thing. I am defineity going to be playing around with it to see what horrifying and adorable kittens I can create.\nIt's not a perfect game.  But it's still a fun game for a select group of people.  I happen to be one.  If you like games like Stardew Valley, and other similar simulation titles, you'll probably like this one.\n\nTLDR: Fun, sometimes gets repetative, gentics system is hilarious (in a good way). Good for people who enjoy similar simulation games. (Ex. Stardew Valley)", "timestamp_created": 1512513222, "timestamp_updated": 1512513222, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.507042", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38082107": {"recommendationid": "38082107", "author": {"steamid": "76561198066876510", "num_games_owned": 34, "num_reviews": 4, "playtime_forever": 841, "playtime_last_two_weeks": 0, "last_played": 1512341216}, "language": "english", "review": "My Warrior Cats fantasy from childhood has been fulfilled.\n\n10/10.", "timestamp_created": 1512488075, "timestamp_updated": 1512488075, "voted_up": true, "votes_up": 30, "votes_funny": 15, "weighted_vote_score": "0.740422", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38080445": {"recommendationid": "38080445", "author": {"steamid": "76561198082514919", "num_games_owned": 20, "num_reviews": 2, "playtime_forever": 1079, "playtime_last_two_weeks": 137, "last_played": 1514408372}, "language": "swedish", "review": "I love the game, you can be a fighter if you want, but you can also become a collector. All the cats have intresting back stories and it is really fun becoming friends with everybody!", "timestamp_created": 1512483685, "timestamp_updated": 1512483685, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38072063": {"recommendationid": "38072063", "author": {"steamid": "76561198422878179", "num_games_owned": 15, "num_reviews": 1, "playtime_forever": 416, "playtime_last_two_weeks": 0, "last_played": 1513335891}, "language": "english", "review": "Much Survival. Such RPG. Reccomended. Wow.\n\n8/10", "timestamp_created": 1512449566, "timestamp_updated": 1512449566, "voted_up": true, "votes_up": 0, "votes_funny": 5, "weighted_vote_score": "0.461956", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38071778": {"recommendationid": "38071778", "author": {"steamid": "76561198127445866", "num_games_owned": 53, "num_reviews": 7, "playtime_forever": 1122, "playtime_last_two_weeks": 265, "last_played": 1514154134}, "language": "english", "review": "10/10 you can marry non-binary cats", "timestamp_created": 1512448308, "timestamp_updated": 1512448321, "voted_up": true, "votes_up": 13, "votes_funny": 5, "weighted_vote_score": "0.586068", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38070555": {"recommendationid": "38070555", "author": {"steamid": "76561198056993739", "num_games_owned": 225, "num_reviews": 23, "playtime_forever": 1825, "playtime_last_two_weeks": 319, "last_played": 1513734229}, "language": "english", "review": "I wish I could give this a half yes half no recommendation, honestly. I was a kickstarter backer--so I may be blinded by my own purchase a little--but this is a really cute harvest moon-like with cats and without a true farming or ranching mechanic. That said, without the ability to rule your own territory implimented yet, there's really nothing to do after you've collected all the shrine gewgaws. Granted, I've only started on training my two kits, but I think I'm going to hold off playing any more until I can make my own colony. \n\nAnd even then, will having my own colony make a difference? As far as I've seen, the only difference between territory owned by your faction and territory owned by another is that you're more likely to be attacked in the other's. There's no restriction on harvesting herbs or hunting prey outside my territory. I'm not totally confident that there will suddenly be court drama once I'm my own ruler, either.\n\nI really wish that there was an abundance of npcs (some non-colony ones perhaps?), and that some would try to trick you. As it stands, every cat except the faceless npc fighters is basically friendly, and none will attack you outright. I think there's room for a really solid plot here, but it seems to be going for a really kid-friendly bright and cheery atmosphere, after the touching opening sequence. I wish there was a plot that involved finding humans, whether or not they were your original humans, and/or dogs and cars to watch out for. The only combat is bats and cats (and in just one segment, ghosts), and I would like more enemies. Maybe even a Hardcore mode with permadeath.\n\nI know I've really only talked trash about it so far, and I think that's because I WANT it to be really good! Right now (and possibly forever?) it's cute and solid and a little grindy, but I've enjoyed my time with it. I just don't know if the average harvest moon-type gamer would be satisfied with how few mechanics there are, and if the average warriors cats fan would be satisfied with how mild and gentle it is. \n\nHuge plus is that the cats are ungendered, though.", "timestamp_created": 1512443061, "timestamp_updated": 1512443061, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.525556", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38069267": {"recommendationid": "38069267", "author": {"steamid": "76561198286262049", "num_games_owned": 7, "num_reviews": 1, "playtime_forever": 2525, "playtime_last_two_weeks": 386, "last_played": 1514676422}, "language": "english", "review": "This game is awesome! thats all I have to say....", "timestamp_created": 1512437552, "timestamp_updated": 1512437552, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.458326", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38062810": {"recommendationid": "38062810", "author": {"steamid": "76561198284366545", "num_games_owned": 16, "num_reviews": 2, "playtime_forever": 84, "playtime_last_two_weeks": 0, "last_played": 1512429691}, "language": "english", "review": "Terribly disappointed. The trailer makes it seem like there is so much to do and that there will not be a boring moment in this game. But oh boy. There's almost nothing to do. The game starts touchingly and then there's just way too much talk from this cat called Coco and the tutorial is way too restricting. The controls are clumsy and cramped together on the keyboard and using things from your inventory is too complicated. Plus the inventory is way too small. I walked around and fought and hunted and foraged in other places than the forest and till my reputation of those places is at 0%? How do you raise it?? You're not given any guidelines or tips on what to do next! The game is boring. And I'm sad to say that cause I was very excited for this game. and it cost quite a lot of money, too.", "timestamp_created": 1512412572, "timestamp_updated": 1512412572, "voted_up": false, "votes_up": 11, "votes_funny": 5, "weighted_vote_score": "0.358633", "comment_count": "9", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38060276": {"recommendationid": "38060276", "author": {"steamid": "76561197994502411", "num_games_owned": 108, "num_reviews": 3, "playtime_forever": 37, "playtime_last_two_weeks": 0, "last_played": 1512344428}, "language": "english", "review": "I am an avid gamer, and my fiancée is not. Then she saw the trailer for this game way back in the Spring, and cried. We booted up the game, and watched the opening cinematic, and she cried. But she still wanted to play. \n\nNeedless to say, there is a game she plays now.\n\nThe music is sprightly, and the graphics remind me of the best of the 16-bit era. Living as a stray cat is interesting, only scratching the surface just now. The UI is not very intuitive, but otherwise catching mice and birds and fighting cats has never been this fun.\n\n8/10", "timestamp_created": 1512404503, "timestamp_updated": 1512404503, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.498515", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38058855": {"recommendationid": "38058855", "author": {"steamid": "76561198090106476", "num_games_owned": 55, "num_reviews": 2, "playtime_forever": 201, "playtime_last_two_weeks": 0, "last_played": 1512628939}, "language": "english", "review": "I have played numerous indie games and this one shows a lot of promise, I haven't put a lot of time in the game and it is already growing on me.  To me the first 10-15 minutes of a game lets us know if the game will hold our attention and the next 1-2 hours will tell us if the game will gain our love.  \n\nThe artwork flows with the mechanics, you get a sense of purpose as a independant (yes cats are independant creatures), the music is great, and no cats were harmed in the making of this game (just all the rest of the animals)\n\nAlmost 2 hours in and I am going to say I will be streaming/recording more, well done developers!  There is so much you can do here with this game and it is so damn delightful. meow meow meow meow, meow meow.", "timestamp_created": 1512400379, "timestamp_updated": 1512400379, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.511746", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38057619": {"recommendationid": "38057619", "author": {"steamid": "76561198204976736", "num_games_owned": 65, "num_reviews": 3, "playtime_forever": 409, "playtime_last_two_weeks": 11, "last_played": 1514657945}, "language": "english", "review": "Very good game, it will keep you busy for a while. It might get repetetive but the developper said that they would update this game frequently.", "timestamp_created": 1512396587, "timestamp_updated": 1512396587, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.495751", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38050636": {"recommendationid": "38050636", "author": {"steamid": "76561197972480720", "num_games_owned": 503, "num_reviews": 2, "playtime_forever": 153, "playtime_last_two_weeks": 0, "last_played": 1512365878}, "language": "english", "review": "What a majesty of a little gem these fine folks have come up with. Take the scavenging and combat mechanics from the Farming Life genre (I.E. Harvest Moon, Stardew Valley) and place them into the world of wild cats. Simply a lot of fun. While Cat Tails wears its inspiration on its sleeve, the mechanics and economics of the game are so finely tuned that the game stands on its own four paws. \n\n10/10 would cat again.", "timestamp_created": 1512366240, "timestamp_updated": 1512366240, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.517375", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38048909": {"recommendationid": "38048909", "author": {"steamid": "76561198008476075", "num_games_owned": 346, "num_reviews": 6, "playtime_forever": 563, "playtime_last_two_weeks": 0, "last_played": 1512388679}, "language": "english", "review": "I've been enjoying this game for the most part. I do wish there was a bit more substance to it, and perhaps at it's full price, it's not worth it for everyone (although, some people will definitely get their money's worth), but it's a fairly relaxing game. There's enough to do that if you set your own goals, you'll enjoy the experience. It would be nice if the developers continue to add content, and I believe there may be some still to come (at least according to features in the Kickstart stretch goals, although they're mostly there from what I've experienced), so hopefully it gets a little more fleshed out.\n\nMy only real gripe so far is that during the Winter season, the game basically stagnates as there's very little to do. Thankfully, the seasons are quite short and if you're really struggling you can just sleep through it, but it is a little disappointing that your only option during winter is to hunt, as foraging becomes very limited and you're quite restricted in what you can do if you're not already prepared for it. There may be more to do once you're further into the game, but at least for the first winter, prepare to be bored.\n\nIt's a bit like playing Stardew Valley, except without farming, and also you're a cat. There's less to do and fewer NPCs to interact with, but it feels very much inspired by Stardew's style and play. That said, comparison aside, it stands on it's own two feet and if you're a fan of that casual \"do your own thing\" style game, with a cute pixel art presentation, relaxing music, and no real pressure on you to do more than what you want to do, you'll enjoy Cattails.", "timestamp_created": 1512357605, "timestamp_updated": 1512357605, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.521945", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38045996": {"recommendationid": "38045996", "author": {"steamid": "76561198026903279", "num_games_owned": 29, "num_reviews": 11, "playtime_forever": 3127, "playtime_last_two_weeks": 630, "last_played": 1514658830}, "language": "english", "review": "Waiting for the next update when they introduce claymore and sniper", "timestamp_created": 1512344688, "timestamp_updated": 1512344688, "voted_up": true, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.511017", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38045156": {"recommendationid": "38045156", "author": {"steamid": "76561198131413153", "num_games_owned": 56, "num_reviews": 16, "playtime_forever": 1335, "playtime_last_two_weeks": 0, "last_played": 1512923832}, "language": "english", "review": "It should be called StarMEW Valley! Get it? Hahaha", "timestamp_created": 1512341250, "timestamp_updated": 1512474650, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38044850": {"recommendationid": "38044850", "author": {"steamid": "76561198288069237", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 2707, "playtime_last_two_weeks": 75, "last_played": 1513826547}, "language": "english", "review": "It's such a fun and unique game!! Totally work the  $15!!", "timestamp_created": 1512340070, "timestamp_updated": 1512340070, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476083", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38043964": {"recommendationid": "38043964", "author": {"steamid": "76561198236208932", "num_games_owned": 31, "num_reviews": 8, "playtime_forever": 1736, "playtime_last_two_weeks": 22, "last_played": 1514770144}, "language": "english", "review": "Bought the game as a beta, made my first cat ever; Blu, made her an amazing swimmer, got her a mate and kits...then i moved onto making my old character from Warriors: Untold Tales. Her name was Mosspelt..a brown she-cat with green eyes, gave her the mossie skin and continued making cats from there. the last cat i made was Mosspelt's daughter's daughter: Silverfern. a she-cat with dark green eyes and silver fur.\n\nI was never disappointed with this game, kinda sad when my cat's died but atleast reviving them is a thing in this game. I recommend this game to many people who love cats and want to make their own little story out of one of their cats.", "timestamp_created": 1512337111, "timestamp_updated": 1512337111, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.640077", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "38043592": {"recommendationid": "38043592", "author": {"steamid": "76561198193108595", "num_games_owned": 42, "num_reviews": 2, "playtime_forever": 1819, "playtime_last_two_weeks": 121, "last_played": 1514045767}, "language": "english", "review": "I bought this game way back in August when it was still new, still liked it played it here and there but the full release is this god-like! I really love this game, the achievements, leveling up system, colonies, the selling, really everything I've encountered so far (except swimming) Swimming is a real pain but it is what it is :p. If you love the book series \"Warriors\" by Erin Hunter (who is more than one person) this game has been a dream come true for me every since I've started reading the series back in 5th grade always wanted a game like Cattails. Hopefully someday their will be multiplayer so I can play with like-minded people but for now I am more than happy to play singleplayer! Please support this game.", "timestamp_created": 1512336004, "timestamp_updated": 1512336004, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.480638", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38043384": {"recommendationid": "38043384", "author": {"steamid": "76561198326219017", "num_games_owned": 18, "num_reviews": 4, "playtime_forever": 1932, "playtime_last_two_weeks": 30, "last_played": 1514425493}, "language": "english", "review": "I found warriors: untold tales a few years back, I ended up playing much more then I had first thought i would. Some time after (I have no idea how long) I ended up hearing about cattails, I followed it for about a year before it was released on steam I came into this game with high hopes and I was not disappointed at all. At first I thought this would be a short, cute game that i would enjoy at the start but get bored with eventually, I was not expecting a game that I would spend over 10 hours on. The music is enjoyable, I dont have the urge to shut it off and play my own.", "timestamp_created": 1512335425, "timestamp_updated": 1512335425, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.585041", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38043103": {"recommendationid": "38043103", "author": {"steamid": "76561198370232418", "num_games_owned": 9, "num_reviews": 2, "playtime_forever": 7149, "playtime_last_two_weeks": 3626, "last_played": 1514644935}, "language": "english", "review": "Love, love, LOVE this game! I was waiting months for it to come out after I saw the lets plays on youtube. The best part of this game is that there's SO much you can do, and it's still not done updating! I highly recommend it!", "timestamp_created": 1512334486, "timestamp_updated": 1512334486, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38041690": {"recommendationid": "38041690", "author": {"steamid": "76561198291246324", "num_games_owned": 7, "num_reviews": 2, "playtime_forever": 2593, "playtime_last_two_weeks": 0, "last_played": 1513559929}, "language": "english", "review": "this game is awesome, if you really like cats and you have a crapy pc that cant run many games then this is a game for you. this 8 bit game comes full packed with exciting chalanges and trials. if your thinking about getting this game by all means. though my advice is finish the story quests before you have kits you'll find a cool secret thats just awesome to have.", "timestamp_created": 1512330184, "timestamp_updated": 1512330184, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38041421": {"recommendationid": "38041421", "author": {"steamid": "76561198057827025", "num_games_owned": 142, "num_reviews": 5, "playtime_forever": 924, "playtime_last_two_weeks": 0, "last_played": 1512525270}, "language": "english", "review": "this game has one MAJOR flaw:\n\nyou cannot marry krampy", "timestamp_created": 1512329327, "timestamp_updated": 1512329327, "voted_up": true, "votes_up": 0, "votes_funny": 6, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38039553": {"recommendationid": "38039553", "author": {"steamid": "76561198079649529", "num_games_owned": 83, "num_reviews": 1, "playtime_forever": 633, "playtime_last_two_weeks": 0, "last_played": 1507357367}, "language": "english", "review": "I got this game with the Beta and i couldnt be happier with such a great content i hope it continues to be worked on even if its just adding the smallest things. definitely worth the price.", "timestamp_created": 1512324154, "timestamp_updated": 1512324154, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38038708": {"recommendationid": "38038708", "author": {"steamid": "76561198342529915", "num_games_owned": 8, "num_reviews": 1, "playtime_forever": 2661, "playtime_last_two_weeks": 0, "last_played": 1513202119}, "language": "english", "review": "can you have more than one litter? My cat is Honey and her mate is Scout, I had 2 kittens, so can I have another litter?", "timestamp_created": 1512321867, "timestamp_updated": 1512321867, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38037785": {"recommendationid": "38037785", "author": {"steamid": "76561198015276640", "num_games_owned": 33, "num_reviews": 8, "playtime_forever": 1233, "playtime_last_two_weeks": 0, "last_played": 1513515386}, "language": "english", "review": "A really cute game that should interest you if you like Stardew Valley and animals in general. Cute pixel graphics and lovely music.\n\nBear in mind that it takes  an hour or so to properly get into the game. When I bought it I started to have doubts about the game. But I kept on playing and now I'm glad that I didn't get a refund.\n\nIt kinda lacks content at the moment, but I'm positive that the developers will add some more stuff to do in the future. They already mentioned that we will be able to make custom colonies later next near.", "timestamp_created": 1512319521, "timestamp_updated": 1513011557, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502618", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38037777": {"recommendationid": "38037777", "author": {"steamid": "76561198258034650", "num_games_owned": 12, "num_reviews": 1, "playtime_forever": 1440, "playtime_last_two_weeks": 271, "last_played": 1514042933}, "language": "english", "review": "Very cute game!", "timestamp_created": 1512319506, "timestamp_updated": 1512319506, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38031964": {"recommendationid": "38031964", "author": {"steamid": "76561198076093453", "num_games_owned": 202, "num_reviews": 54, "playtime_forever": 347, "playtime_last_two_weeks": 0, "last_played": 1512495260}, "language": "english", "review": "I was on the fence about getting this game originally, but the trailer's music drew me in.\nLuckily, I was happy to find out that the game also has pretty music!\n\nIt seems like a serious game with all the fighting involved but so far I've not stressed and I've enjoyed the whole experience.\nThe fighting itself is kind of minimal, you can go help on the battlefield (or die haha) or you can go hunting instead for a day, and explore and do what you want. Hunting is fun. You can catch big things like rabbits, or fish, or squrriels, or you can forage if you prefer to be vegetarian, though harder at first when your skills are low. (Yeah, skills!)\n\nTheres a big storyquest you can follow kind of behind the scenes, but theres no rush to it or limit.\nYou can also marry other people in your village, befriend the other villages (instead of war, give them gifts!) and have kittens too. I think all cats are datable if they have a friendship meter, and thats basically all of them in the village anyway. There doesnt appear to be gender specific ones either, with anything, coats/accessories/toys/cats etc., Everyone seems to be neutral, even my own cat - when I switch pelts I have to question 'Am I a boy cat? or a girl?' Somedays I guess I'm either! No one brings it up in the game, so you can naturally just marry anyone since nobody is specifically fem/masc. That's neat. I'm dating pebble, I have no idea if he's a boy or a girl, but hey, I've got me a mate!\n\nThere is weather and night/day cycles, and events. At the end of the very short month, there is a festival where all the cats get together to play games. The first month has turtle racing where you cheer on turtles to race. If you win, you get tokens which you can use to change your cat colour to something special or buy pets/accessories/etc\n\nThis game is stardew valley for cats.\n\n\n--------------\n[Pros] \n=============\n-Good music\n-Cute Graphics\n-Open world, can wander anywhere, anytime\n-Hunting/Gathering/Fighting and more!\n-Mining and marriagible npcs!\n\n[Cons]\n=============\n-Two areas on the map can be more laggy than others, for the most part I don't experience any lag, but the mines by default have a lighting system that you can turn off in options. That seems to stop that lag a bit, the second area is by the river that connects to the ocean. It's mostly okay to walk near, but in the rain it can get really awful.\n-More content is needed! The game is flying by and I've already played two months worth in four hours!", "timestamp_created": 1512304928, "timestamp_updated": 1512305696, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.609058", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38029106": {"recommendationid": "38029106", "author": {"steamid": "76561198078447500", "num_games_owned": 70, "num_reviews": 9, "playtime_forever": 1188, "playtime_last_two_weeks": 221, "last_played": 1514198581}, "language": "english", "review": "Cattails is seriously just totally adorable.\nIt provides what it promises: You play as a cat that you can customize over the duration of the game. You choose one of three clans to live with and protect the territory, hunt, forage, mine and explore the decently sized map. Especially hunting is pretty well done. Seasons change, so does what you find out in the wild. \nThere is a storyline as well, that gives you various tasks to complete. \nI was sceptical about the graphics at first, but they grew on me, the music is absolutely beautiful and suits every tone they try to hit.\n\nIt's simple, yes, but still provides a lot of fun. For a two man team behind it, I think it's pretty great and the price suits it well too.\nIf you imagined a 2D animal simulator with elements of harvest moon/stardew valley, you pretty much know what it has in store.\n", "timestamp_created": 1512297286, "timestamp_updated": 1512297286, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38028208": {"recommendationid": "38028208", "author": {"steamid": "76561197963925447", "num_games_owned": 167, "num_reviews": 17, "playtime_forever": 308, "playtime_last_two_weeks": 34, "last_played": 1514099664}, "language": "english", "review": "I do not reccomend this for this price.  Extremely simplistic and very lacking.  \n\nThe 'hunting' is just you running around holding shift waiting for the 'timer' to fill up and hitting space.\nThe abilities are 'generic' and not very inspired.\nIts cutesy, but the music gets a bit repetitive.\nThe combat is just stand there and hit space early on but gets a tiny bit more interesting once you get abilities and the fighting other cats is really simplistic and generic overall.\n\nMaybe if it was $5 I would be content with it... but I've played cheaper games for more entertainment value.\n\n***UPDATE***\n\nAfter a lot of yelling fron other players, I gave it a shot, its unpolished but decent.", "timestamp_created": 1512294726, "timestamp_updated": 1513501449, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.527721", "comment_count": "8", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38024450": {"recommendationid": "38024450", "author": {"steamid": "76561198102136531", "num_games_owned": 56, "num_reviews": 5, "playtime_forever": 454, "playtime_last_two_weeks": 0, "last_played": 1512265251}, "language": "english", "review": "8/10 Would recommend\n\nI bought this the day it came out. I gotta say I was pretty hyped for it; while I didn't know about the kickstarter and couldn't afford the Early Access, I thought the trailer was absolutely adorable. The art had a simple and colorful appeal to it, and the gameplay looked sound. Playing the game was about the experience I expected after seeing that trailer. You hunt down prey to stay full, and can forage for herbs which act as curatives for your health. I was surprised to discover that you could even mine and fish!\n\n I haven't gotten married or had a litter yet, but did score a mate, and that process is very Harvest Moon-esque, relying entirely on gifts. I romanced Scout as they seemed like the easiest, being really into hunting means they'd really like prey! I have no idea what any other character would like as gifts, or if it's just like real life cats, where they all like to be gifted prey.\n\nI've also started on the main storyline, completing two of the game's collection goals and puzzle dungeons. That's right, there are puzzle dungeons! From what I can tell, they are relatively small, and all underground and locked until you need to explore them; once you get the treasure inside, they lock again. It's a neat way of stopping the player from sequence breaking.\n\nOne criticism I do have is that if you die, you lose ALL your items, not just \"one or two\" like your local doctor cat might tell you, and that the doc only heals you halfway. But, once you get a storage unit in your den, this becomes less of a big issue.\n\nAnother criticism I have is that the seasons and the days themselves are very short. I blazed through my first year in about 7 and 1/2 hours because there are only 10 days per season, and I might be wrong but I think the time ratio is faster than 1 in-game hour per irl minute. Since you're a cat and they're aren't really time constraints anywhere, it's not that big a deal, it just makes the game seem smaller; I was genuinely shocked and saddened when my first winter was suddenly here, wondering if there might have been a better way to spend that lost time behind me.\n\nAll in all, I think it's a cute game that pretty much nails its theme. Good job.", "timestamp_created": 1512281795, "timestamp_updated": 1512281795, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38023832": {"recommendationid": "38023832", "author": {"steamid": "76561198141178443", "num_games_owned": 2967, "num_reviews": 81, "playtime_forever": 72, "playtime_last_two_weeks": 0, "last_played": 1512182667}, "language": "schinese", "review": "萌系游戏，猫奴必备。", "timestamp_created": 1512279670, "timestamp_updated": 1512279670, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.580399", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38020667": {"recommendationid": "38020667", "author": {"steamid": "76561198275531334", "num_games_owned": 7, "num_reviews": 1, "playtime_forever": 2150, "playtime_last_two_weeks": 268, "last_played": 1514661736}, "language": "english", "review": "Dear God I loved Untold Tales so many years ago and seeing this game come out is honestly inspiring. This game is reminiscent of Untold Tales but so neatly polished and takes its own twist to be a purely original game. Would love to see some kind of online multiplayer, but without it, this game is still great!", "timestamp_created": 1512267747, "timestamp_updated": 1512267747, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38020565": {"recommendationid": "38020565", "author": {"steamid": "76561198052258887", "num_games_owned": 59, "num_reviews": 1, "playtime_forever": 1531, "playtime_last_two_weeks": 394, "last_played": 1514055612}, "language": "english", "review": "You get to be a cat, do cat stuff, and be friends with other cats. This game delivers on its promises and it's genuinely fun. It's also relaxing.", "timestamp_created": 1512267329, "timestamp_updated": 1512267329, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38020396": {"recommendationid": "38020396", "author": {"steamid": "76561198349315033", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 1086, "playtime_last_two_weeks": 0, "last_played": 1512852660}, "language": "english", "review": "I was waiting in anticipation for this game months before the release date, can safely say I wasn't disappointed. As an avid fan of Erin Hunter's 'Warriors' book series it's hard to find any game about cats that resembles the world and daily tasks. Well, this may be no official Warriors game, but it hits the mark despite adding its own original concepts (which I also thoroughly enjoy!) \n\nThe music is enjoyable and pleasant, it instantly can brighten your day with the cheerful tunes! The style of the pixel art is adorable. And the cats you meet all have interesting personalities! There's many different fur patterns to unlock and closely resembles the gameplay style of Stardew Valley, if that's your kind of thing. \n\nThe cons really just depend on the player, this game can get fairly repetitive with hunting, filling up your health and food bar, and fighting off rival Colonies of cats. If you get bored of doing daily tasks easily, I'd recommend playing the game in short spurts to enjoy it completely! \n\nOverrall this was certainly worth the wait, if you love cats and this genre of game,  I'd say it's worth it for you too! :)", "timestamp_created": 1512266787, "timestamp_updated": 1512266887, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38017830": {"recommendationid": "38017830", "author": {"steamid": "76561198352086226", "num_games_owned": 16, "num_reviews": 2, "playtime_forever": 2516, "playtime_last_two_weeks": 632, "last_played": 1514780861}, "language": "english", "review": "This is fun, awesom game! You gat a cat and hunt, fight, and live as a cat! This is, by far, the best game of the year.", "timestamp_created": 1512257197, "timestamp_updated": 1512257197, "voted_up": true, "votes_up": 1, "votes_funny": 2, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38017822": {"recommendationid": "38017822", "author": {"steamid": "76561198050145608", "num_games_owned": 192, "num_reviews": 3, "playtime_forever": 43, "playtime_last_two_weeks": 0, "last_played": 1512256676}, "language": "english", "review": "Got it on Kickstarter\n\nAnd finally got it to my Library. \n\nIt does look so... nice. Really. You live as a cat in the wilderness. You hunt. You forage. You just... explore. \n\nDidn't play much yet, but will spend a couple of hours per week just to... be a cat )))", "timestamp_created": 1512257180, "timestamp_updated": 1512257180, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.478803", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38013147": {"recommendationid": "38013147", "author": {"steamid": "76561198196515541", "num_games_owned": 26, "num_reviews": 1, "playtime_forever": 726, "playtime_last_two_weeks": 0, "last_played": 1513543750}, "language": "english", "review": "When I was pretty little I was obessed with warrior cats and the previous game by the developer \"Warrior Cats: Untold Tales.\" So of course, when I heard about this game, I was overcome with a wave of nostalgia. The fact that I really like games like Stardew Valley (which this game takes some inspiration from) was a bonus. \n\nAlthough, having played a similar game from this developer, I was a little dissappointed when I began playing. I remember things like significant predator encounters, the chance of deadly cars on the roads, random npc encounters, quests to gain jobs and perks, the ability to build your own colony, and special perks unique to each colony in the previous project. Those things had a lot of charm which I found this game lacking a bit of. \n\nThats not to say this game doesn't do a lot of things right. The npcs are way more fleshed out, with full personalities and likes and dislikes that the player has to pay attention to, as opposed to just spamming them with \"shiny objects\" to gain affection. The music is beautiful, and the graphics and animations have a lot of heart. The game has a nice storyline so far, and although it is lacking the apprentice quest system, it has a very nice stardew-inspired quest system in it's place. Kits dont just sit there and do nothing. Overall, the gameplay is better. It's clear that a lot of hard work went into this project, and I wouldn't be surprised if some of the things I mentioned earlier were added in future updates. There's still so much to be descovered- these are just my first impressions!! \n\nOverall, I totally recommend this game.", "timestamp_created": 1512243893, "timestamp_updated": 1512244133, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502618", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38012188": {"recommendationid": "38012188", "author": {"steamid": "76561198041264122", "num_games_owned": 52, "num_reviews": 1, "playtime_forever": 504, "playtime_last_two_weeks": 0, "last_played": 1512447139}, "language": "english", "review": "Like Stardew valley but with CATS!", "timestamp_created": 1512241421, "timestamp_updated": 1512241421, "voted_up": true, "votes_up": 35, "votes_funny": 7, "weighted_vote_score": "0.736378", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38012050": {"recommendationid": "38012050", "author": {"steamid": "76561198400250405", "num_games_owned": 9, "num_reviews": 3, "playtime_forever": 1012, "playtime_last_two_weeks": 0, "last_played": 1512860101}, "language": "english", "review": "What you need to know is, this is the kind of game that grows on you as time passes. In the first few days, I didn't like it at all, and actually wrote an unfavorable review. But, after the first season, I saw past the cons and discovered how much the game had to offer. (Some people say that the game gets repetitive, and sometimes it does, but you have to remember that it will be updated, and every time you repeat something, it usually takes you closer to your next goal.)\n\nPROS:\n+Beautiful graphics\n+Interesting gameplay\n+Diverse amount of characters\n+Lots of polish, clearly had much work put into it\n+Very pleasant soundtrack\n+Creative ideas and designs for characters and settings\n+Much better A.I. for the NPCs than in some other games.\n\nCONS:\n-You seem to have less purpose than you did in the developers' other, although less professional, great game called Warriors: Untold Tales. (Which this game draws from for its battle mechanics and foraging techniques.) Part of what made that game fun was the nostalgia it invoked in fans and the sense of duty and belonging in the clan. You would work hard to support your friends and family, giving you a reason to hunt and survive every day. Sadly, in this game, there's not much in the way of achieving rank and honor, or supporting anyone else. No one relies on you to feed them. This takes away some of the objective and motivation from the game.\n-Difficulty with the main story mode. The main story mode starts out easy. You must capture a few different types of prey, which are all common. But when you unlock the first pillar, the others demand you find vaguely rare prey like catfish, and with the really short days, trying to balance taking care of your mate, finding time to return to base and sleep, and foraging, the tasks become drawn out.\n\nOverall, this game is wonderful. Don't get it if you only play FPS games like Call of Duty and Halo, but for anyone who's willing to experiment, this game provides a quite entertaining time, and you won't want to stop playing. (Speaking of which, there seems to be lots of playtime involved.) This game gets an 8.5/10 from me.\n", "timestamp_created": 1512241072, "timestamp_updated": 1512258023, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38011659": {"recommendationid": "38011659", "author": {"steamid": "76561198085098462", "num_games_owned": 177, "num_reviews": 5, "playtime_forever": 1143, "playtime_last_two_weeks": 0, "last_played": 1510671032}, "language": "english", "review": "I adore this game! I've had it for awhile & I would have more hours but I unfortunately have been working on school. It's basically Warriors, without actually being Warriors!", "timestamp_created": 1512240067, "timestamp_updated": 1512240067, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38010979": {"recommendationid": "38010979", "author": {"steamid": "76561198354896396", "num_games_owned": 30, "num_reviews": 3, "playtime_forever": 93, "playtime_last_two_weeks": 0, "last_played": 1512240622}, "language": "english", "review": "I think this game is super fun!! You get to play as a cat, and it's similiar to warrior cats(a bit, not a lot though) and stardew valley. I definitely see a lot of places where this game can improve, of course! I've read a few other review and I have to agree that more structured clans/tribes would be a really good part of the game. Another feature from the old game that I really liked was becoming a rogue and having the ability to start your own clan. Those are two things that would be great to have in the game, and would make the already positive experience even better! \n\nOther things I think could be added would be things like, multiple different stories to continually progress the game(while keeping it an open game), small quests from the other clan cats that could help to boost rep, A few different dialogues for each relationship that could change out each day, and maybe even an aging system. Of course, these are all just reccomendations, and making a game is definitely not an easy feat. \n\nI definitely recommend this game for cat lovers, or warrior cat lovers! It's super fun, and it definitely has a lot of potential! I'll be sticking with it. :)", "timestamp_created": 1512238471, "timestamp_updated": 1512238471, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502618", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38007662": {"recommendationid": "38007662", "author": {"steamid": "76561198335510230", "num_games_owned": 30, "num_reviews": 3, "playtime_forever": 893, "playtime_last_two_weeks": 0, "last_played": 1513117171}, "language": "english", "review": "Wow! Might I say that this game is so cute and awesome! It's absolutely adorable, and the beginning of the story got me hooked instantly. I love the different cats and all the different things you can do in learn. I can't wait to play more of this game!", "timestamp_created": 1512230620, "timestamp_updated": 1512230620, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502618", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "38007523": {"recommendationid": "38007523", "author": {"steamid": "76561198157261626", "num_games_owned": 44, "num_reviews": 2, "playtime_forever": 50, "playtime_last_two_weeks": 0, "last_played": 1512228843}, "language": "english", "review": "tl;dr: wait for a sale and be sure you're fine with this style of gameplay.\n\nI was really looking forward to this game, and I have to say, I'm disappointed.\n\nIt's a well-made game, and you can see a lot of effort went into it, but it's just - nothing. It's not substantial. There really is not much to do. It plays fantasticaly, the graphics and music are great, but the gameplay is extremely lacking. Once you're past the tutorial, there's no direction, no guide, no goal. I understand the idea of an open ended game, but this isn't like Stardew Valley, where you know from the beginning you're supposed to be rebuilding a farm, and the game allows you to go about doing that however you want. In Cattails, there's just nothing. There is an optional story, I think, but it doesn't seem to have much of an impact on the game. You can ... hunt ... fight ... get ... married ? \n\nAnd don't get me wrong, all those mechanics are great. This game is just not worth fifteen dollars, and I was not prepared for the lack of content. If you're fine with super open-ended gameplay where you really just ... wander around ... and you think that's worth fifteen dollars, then by all means, get Cattails. If not - wait for a sale, or avoid altogether.\n\nAlso, a lot of people are comparing this game to Warrior Cats, and while I get it, don't come into this game expecting a Warrior Cats-like experience. You don't have a specific role or purpose in your colony - there's no sense of community. Conversations are repetitive and impersonal. So, if you're looking for the experience of being in an Erin Hunter book, don't look here.\n\n\n\nedit: relax everybody. i know i haven't played very long - and that playtime was even over the course of two days. either way, my main point was that this game is not worth 15.00. i have read and understand your criticism - take or leave this review.", "timestamp_created": 1512230302, "timestamp_updated": 1514127121, "voted_up": false, "votes_up": 79, "votes_funny": 1, "weighted_vote_score": "0.585193", "comment_count": "23", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38004510": {"recommendationid": "38004510", "author": {"steamid": "76561198220256017", "num_games_owned": 89, "num_reviews": 3, "playtime_forever": 950, "playtime_last_two_weeks": 2, "last_played": 1513869415}, "language": "english", "review": "I got this game with Kickstarter when it first was introduced and I am so happy I did.\n\nThe game has an amazing soundtrack, artstyle, and is very charming. I would recomend it to just about anyone", "timestamp_created": 1512223547, "timestamp_updated": 1512223547, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.546300", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38004268": {"recommendationid": "38004268", "author": {"steamid": "76561198279729047", "num_games_owned": 36, "num_reviews": 5, "playtime_forever": 380, "playtime_last_two_weeks": 0, "last_played": 1513514526}, "language": "english", "review": "I bought this game when it was still in its beta stage and didn't expect it to be a time-sinker. I have around 6 hours (or more? I tend to play offline sometimes) in the game and have yet accomplished anything. I spent 6 hours hoarding stuff and honing my skills and trying to decide which cat to marry. I have moved from forest to mountain colony and a mole came to offer to upgrade my den! Sweet! The only problem is that I am broke.\nThe forest guardian needs my help! Yikes! I just want to hoard stuff!\nI can't swim but I need the fish!\nArthur! Pebble! Scout! Who to choose? And, mister black cat over there, are you an eligible bachelor? And, there is a blue cat who calls me his rose?\nThere are also many accessories and fur colour to collect in this game.\nIt is also possible to get a garden to grow herbs (or so they say, havent got this far yet).", "timestamp_created": 1512222941, "timestamp_updated": 1512222941, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.504310", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38000517": {"recommendationid": "38000517", "author": {"steamid": "76561197983436748", "num_games_owned": 583, "num_reviews": 40, "playtime_forever": 33, "playtime_last_two_weeks": 0, "last_played": 1512212648}, "language": "english", "review": "I am now a cat, I am one with the cat!\n\nHave you ever dreamt about being a cat? I know I have. \n\nDo you like RPGs and casual exploration? Kind of\n\nDo you like teleporting cats? YES\n\nThen you have to pick up this game, It's probably not going to be the next Stardew Valley but it’s a cute, time passing, nice lovely game is what I can say, full of charm and wit.\n\nRecommended if you like that sort of thing\nIf you like dogs, FPS games and hate RPGs then maybe look elsewhere!\n\nCould do with an option screen on main menu and \"combat' needs a little work but so far so good and maybeeeeee a little on the expensive side! \nOverall get it checked out, I even made a little video\n\nhttps://www.youtube.com/watch?v=Xo5aM3dY6NE&feature=youtu.be\n", "timestamp_created": 1512213430, "timestamp_updated": 1512213430, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.574759", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37996566": {"recommendationid": "37996566", "author": {"steamid": "76561198038264439", "num_games_owned": 223, "num_reviews": 4, "playtime_forever": 1947, "playtime_last_two_weeks": 0, "last_played": 1512685555}, "language": "english", "review": "Cattails has a lot of charm, especially if you're familiar with Warriors or Stardew Valley. It's a very relaxing time hunting prey and foraging herbs. The combat is very basic but still works. The game offers a lot of goals to work towards and you can get lost for hours working towards them, even if it can get repetitive. Also, you're a cat, so you don't need to work off hyooman hours.", "timestamp_created": 1512201664, "timestamp_updated": 1512347918, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.589297", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37991979": {"recommendationid": "37991979", "author": {"steamid": "76561198137045409", "num_games_owned": 43, "num_reviews": 1, "playtime_forever": 1961, "playtime_last_two_weeks": 0, "last_played": 1513527690}, "language": "english", "review": "I was expecting great things from Cattails, and I was not disappointed. So far, this game has been amazing, and I'm still astonished that it was all done by two people (and a cat!). Here are some ups and downs that I've noticed while playing:\n\n+Charming soundtrack\n+Great art and animation\n+Simple gameplay mechanics\n+Unique characters\n+Being a cat\n\n-Can get repetitive, but not too much\n\nIf you enjoy Stardew Valley, Harvest Moon, Warrior Cats, or just like cats, I highly recommend this game. As for everyone else, I still recommend this game, it has been a great experience for me so far and I'm sure it would be for you too.", "timestamp_created": 1512183577, "timestamp_updated": 1512254188, "voted_up": true, "votes_up": 16, "votes_funny": 1, "weighted_vote_score": "0.660198", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37991640": {"recommendationid": "37991640", "author": {"steamid": "76561198212760125", "num_games_owned": 26, "num_reviews": 1, "playtime_forever": 1241, "playtime_last_two_weeks": 20, "last_played": 1513986730}, "language": "english", "review": " The game is great! I'm in love with all of the characters you can talk to and all of the different things you can do like mining and hunting. To me, it's like a combination between Warriors: Untold Tales and Stardew Valley in a way... I like it. \n\n My favorite parts of the game are the cute pixelated graphics and the music! The music is so playful and colorful, I enjoy just listening to it. The graphics are charming and I like the soft colors the game has. Unlike Stardew Valley's graphics, Cattails doesn't have bright, neon, rainbow butterflies spitting out of trees or other colors that hurt my eyes just by looking at the grass.\n\n A problem I have with the game though is that I struggle a lot with controls. I try hunting and then when the timer fills up, I end up attacking the prey instead of catching it. I've tried getting my hunting skills up, but it might just be me messing up everytime.\n\n If you like cats and a practically endless game, maybe even Untold Tales or Stardew Valley, then get Cattails! It's pretty fun!", "timestamp_created": 1512182269, "timestamp_updated": 1512182269, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.529579", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37991375": {"recommendationid": "37991375", "author": {"steamid": "76561198180893358", "num_games_owned": 40, "num_reviews": 1, "playtime_forever": 1798, "playtime_last_two_weeks": 1016, "last_played": 1514601798}, "language": "english", "review": "IVE BEEB WAITING AND SO SUPPORTIVE OF THIS GAAAME! Just started playing it 2 hours ago and I love the slow casual progression! BUY ITT!", "timestamp_created": 1512181211, "timestamp_updated": 1512181211, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.433274", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37991354": {"recommendationid": "37991354", "author": {"steamid": "76561198116403348", "num_games_owned": 308, "num_reviews": 29, "playtime_forever": 1246, "playtime_last_two_weeks": 0, "last_played": 1512361198}, "language": "english", "review": "-The cat's meow-\n\nI didn't know I needed this game in my life until I stumbled upon it by chance just after its release and I bought it right away. The preview I saw of it reminded me of many of the aspects of both Stardew Valley and the old Harvest Moon, minus the whole farming portion of course. It reminded me of some books I found recently so I had to give it a try for myself and I was not dissapointed in the least.\n\nWonderfully enjoyable, great music and cute cats everywhere. Your cat is customizable with several colors and customizations for your cat including accessories and a den all to your own. When starting you can choose from three different clans of cats and help defend your territory, make friends with the locals and do a little shopping, hunting, gathering and mining; there always seems to be something you can do and somewhere to explore!\n\nWould highly recomended - 10/10", "timestamp_created": 1512181148, "timestamp_updated": 1512410179, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.504310", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37990824": {"recommendationid": "37990824", "author": {"steamid": "76561198088239023", "num_games_owned": 25, "num_reviews": 3, "playtime_forever": 2439, "playtime_last_two_weeks": 1, "last_played": 1514003393}, "language": "english", "review": "Warrior Cats: Untold Tales, developed by Falcon_Star was a gift to my childhood. I would go home and sit down at our subpar box computer and play it for hours. I joined the proboards, talked about it constantly with friends, and dedicated so much of my time to it. As I grew older, I remembered it with what was longing.\n\nYou can imagine my surprise when an email with the subject \"From the Creator of 'Untold Tales' Comes a New Cat Simulation Game: Cattails | Become a Cat!\"\n\nI was thrilled, to say the least. I didn't know what to say at first- I rushed right to the kickstarter. I wanted to play it [i]as soon as possible.[/i] I did everything in my power to help- I gave it my support on Steam Greenlight, and more-- my excitement for the game was so great that I backed the kickstarter at the \"Abyssinian Alpha\" tier, which gave me acess to the Cattails alpha in July 2017.\n\nI adored the game, to say the least. My (currently) 38 hours on record aren't even close to the true amount of hours I've spent playing Cattails with no wifi- on an airplane, on a road trip, even sometimes in class! Needless to say, I'm smitten with the game, and I haven't even done all there is to offer. I know for sure that this game will only grow better as time passes!\n\nI highly recommend this game to anyone. I honestly believe this is my favorite Steam game that I've ever played.\n\n-Absol on the Cattails Proboards", "timestamp_created": 1512179098, "timestamp_updated": 1512179098, "voted_up": true, "votes_up": 63, "votes_funny": 2, "weighted_vote_score": "0.828068", "comment_count": "3", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37990653": {"recommendationid": "37990653", "author": {"steamid": "76561198357212569", "num_games_owned": 8, "num_reviews": 1, "playtime_forever": 2664, "playtime_last_two_weeks": 0, "last_played": 1512348891}, "language": "english", "review": "This is a very relaxing sandbox game with a optional storyline if you get bored, it has a very nice and pleasing sound track, that changes with the seasons.", "timestamp_created": 1512178468, "timestamp_updated": 1512178468, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504132", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37990448": {"recommendationid": "37990448", "author": {"steamid": "76561198023890091", "num_games_owned": 301, "num_reviews": 2, "playtime_forever": 847, "playtime_last_two_weeks": 0, "last_played": 1512672979}, "language": "english", "review": "It's Harvest Moon but you're a cat\n\n10/10", "timestamp_created": 1512177612, "timestamp_updated": 1512177612, "voted_up": true, "votes_up": 2, "votes_funny": 3, "weighted_vote_score": "0.480068", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37990257": {"recommendationid": "37990257", "author": {"steamid": "76561198380153228", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 2793, "playtime_last_two_weeks": 0, "last_played": 1512367619}, "language": "english", "review": "I love this game! There are so many things to do, and so many things to collect! My favorite things so far are, collecting mews, collecting rare items, and watching my kits grow up! I so far have played this game for 40 hours, but it feels like I've only played it for 4! I reccomend this to anyone who likes cats and adventure.", "timestamp_created": 1512176767, "timestamp_updated": 1512176767, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.527559", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37990079": {"recommendationid": "37990079", "author": {"steamid": "76561198056225990", "num_games_owned": 203, "num_reviews": 13, "playtime_forever": 331, "playtime_last_two_weeks": 75, "last_played": 1513692569}, "language": "german", "review": ".", "timestamp_created": 1512175927, "timestamp_updated": 1512175927, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.471014", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37989979": {"recommendationid": "37989979", "author": {"steamid": "76561198013224025", "num_games_owned": 28, "num_reviews": 1, "playtime_forever": 335, "playtime_last_two_weeks": 0, "last_played": 1504804838}, "language": "english", "review": "Absolutely love it! I got to play this in pre-alpha and I bought the Kickstarter as soon as they launched. You're going to love. It's adorable, it's fun, and it's so dang wholesome. Go, be a cat. Enjoy!!", "timestamp_created": 1512175494, "timestamp_updated": 1512175494, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.504132", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37988029": {"recommendationid": "37988029", "author": {"steamid": "76561198175307889", "num_games_owned": 64, "num_reviews": 8, "playtime_forever": 3261, "playtime_last_two_weeks": 227, "last_played": 1514782676}, "language": "english", "review": "Cattails is amazing in every way and there are still more thing to be added. It allows you to play a cat in a warrior cats like world, has an intersting storyline, and you can have adorable kits! What makes this game fantastic is the fact you don't have to follow the story part of it, you get to make your own story. You can go from a cat who is kind and gentle and will never fight to a cat who cares for nothing and will beat down anyone in it's way.", "timestamp_created": 1512168021, "timestamp_updated": 1512168021, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.527721", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37986593": {"recommendationid": "37986593", "author": {"steamid": "76561197995597878", "num_games_owned": 480, "num_reviews": 3, "playtime_forever": 1726, "playtime_last_two_weeks": 0, "last_played": 1512979948}, "language": "english", "review": "this game is cool, u get to become a cat, the important part is remembering that when you stop playing the game you are no longer a cat.", "timestamp_created": 1512163321, "timestamp_updated": 1512163321, "voted_up": true, "votes_up": 62, "votes_funny": 165, "weighted_vote_score": "0.722813", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37986347": {"recommendationid": "37986347", "author": {"steamid": "76561198064502798", "num_games_owned": 2186, "num_reviews": 18, "playtime_forever": 942, "playtime_last_two_weeks": 0, "last_played": 1512353840}, "language": "english", "review": "This game is meowrvelous! It was meowde by a two-person team and they did a meowgnificent job. I was a backer on Kickstarter and was really excited about it and yet it has still meownaged to live up to my expectations. It is full of the similar kind of charm of Stardew Valley and will appeal to players who enjoyed that. I have only clawed the surface of this game but you can hunt, fight, forage and there are lots of little areas in the open world that hint at meowre content that I haven't discovered yet. For the small staff it is very impressive and the price is fair for how meowny hours I suspect one can get out of this meowsterpiece. From what I understand you can even get meowrried, or the cat equivilant. Beautiful little game, 4 paws out of 4.", "timestamp_created": 1512162613, "timestamp_updated": 1512162613, "voted_up": true, "votes_up": 9, "votes_funny": 10, "weighted_vote_score": "0.532762", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37984338": {"recommendationid": "37984338", "author": {"steamid": "76561198052385980", "num_games_owned": 26, "num_reviews": 1, "playtime_forever": 31853, "playtime_last_two_weeks": 0, "last_played": 1501262834}, "language": "english", "review": "Mastahpiece!", "timestamp_created": 1512156893, "timestamp_updated": 1512156893, "voted_up": true, "votes_up": 7, "votes_funny": 3, "weighted_vote_score": "0.578336", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37983086": {"recommendationid": "37983086", "author": {"steamid": "76561198136885913", "num_games_owned": 386, "num_reviews": 2, "playtime_forever": 58, "playtime_last_two_weeks": 0, "last_played": 1512153185}, "language": "english", "review": "It's probably not going to be the next Stardew or anything, but it scratches that same itch for casual exploration and progression, and it does enough to distinguish itself from its peers that I find it charming in its own way.", "timestamp_created": 1512153301, "timestamp_updated": 1512153301, "voted_up": true, "votes_up": 43, "votes_funny": 2, "weighted_vote_score": "0.754823", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37982770": {"recommendationid": "37982770", "author": {"steamid": "76561198182495153", "num_games_owned": 105, "num_reviews": 23, "playtime_forever": 65, "playtime_last_two_weeks": 0, "last_played": 1512153365}, "language": "english", "review": "I was offered to get put into Beta but didn't have the money too at the time. I bought this the second I got the email it releases and have had my eyes glued since. I'm still not super far into it, and am learning but.. Its so worth the 15 bucks. If you're big on stardew valley, and chose the cat as your pet, consider this its story when you're away ;).", "timestamp_created": 1512152395, "timestamp_updated": 1512152395, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.533157", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37981845": {"recommendationid": "37981845", "author": {"steamid": "76561198289996280", "num_games_owned": 35, "num_reviews": 1, "playtime_forever": 2135, "playtime_last_two_weeks": 19, "last_played": 1514745607}, "language": "english", "review": "Beautiful lovely game! You get to choose to go into three cat colonies, the Forest Colony, Mystic Colony, or the Mountain Domain. You are able to have up to 5 save files incase if you want to go to a different colony as a different cat. You can switch colonies on one save file too! The currency system is Mews, you can get Mews from selling items you catch or find. Next year, you will be able to create your own colony. Very adorable game! It will get updates so it wouldn't get repetitive and boring.", "timestamp_created": 1512149630, "timestamp_updated": 1512149630, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.594938", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37981328": {"recommendationid": "37981328", "author": {"steamid": "76561198344052612", "num_games_owned": 25, "num_reviews": 1, "playtime_forever": 4996, "playtime_last_two_weeks": 656, "last_played": 1514822759}, "language": "english", "review": "As an alpha tester, I got to be one of the first to experience Cattails along with 149 others. I am writing this in the beta period, and here are my thoughts..\n\nCattails is being developed by a two-person team, and what a wonderful game they have made! When you first start, a rather touching intro plays before leading you to the tutorial. A cat named Coco teaches you the basics before letting you choose a colony and taking you to your den. And from that point on, it's all you. Who will your cat be? Will they be a stealthy hunter, an athletic swimmer, maybe a strong fighter or even a forager? Will they be a plain, white run-of-the mill kitty or a diverse, colorful rainbow with a nightcap on their head? Will they start a family or live alone..? There will also be a story to follow in the full release, but it won't be that forced.\n\nBut enough with cats, let's look at the world. It's quite large, with secrets to find and caves to explore. Your colony can claim different squares on the map. The only squares they can't claim are a specific two squares of one colony's territory and The Sacred Temple, a place where festivals are held. In festivals, cats from every colony - Forest, Mountain and Mystic - gather together and celebrate the end of the season. Games are held, and you can talk to Coco in the middle to participate. The game is different every season.\n\nThe graphics are cute, and good for this type of game. The art can be a little misleading, but it's nice anyways. I haven't heard the music myself as my volume is always on mute, but I've heard positive response to it. The controls are good too, but maybe not as good for right handed people. The gameplay can either be fun or repetitive, depending on if you like these types of games. To put it simply, if you don't like Stardew Valley you probably won't like this game either.\n\nBut overall, Cattails is a great game and I definitely recommend it if you're interested!", "timestamp_created": 1512148082, "timestamp_updated": 1512148082, "voted_up": true, "votes_up": 94, "votes_funny": 1, "weighted_vote_score": "0.840696", "comment_count": "7", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37980246": {"recommendationid": "37980246", "author": {"steamid": "76561198071493077", "num_games_owned": 564, "num_reviews": 14, "playtime_forever": 613, "playtime_last_two_weeks": 0, "last_played": 1512217489}, "language": "english", "review": "It's like Warrior Cats but with capitalism and a lack of universal health care.\n\nIt's basically the American Warrior Cats.", "timestamp_created": 1512145376, "timestamp_updated": 1512145376, "voted_up": true, "votes_up": 39, "votes_funny": 122, "weighted_vote_score": "0.603835", "comment_count": "7", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37979543": {"recommendationid": "37979543", "author": {"steamid": "76561198081257098", "num_games_owned": 52, "num_reviews": 7, "playtime_forever": 1232, "playtime_last_two_weeks": 0, "last_played": 1509133603}, "language": "english", "review": "It's a good game, but be warned; It might get repetitive after a while.", "timestamp_created": 1512143522, "timestamp_updated": 1512143522, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.591740", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37979450": {"recommendationid": "37979450", "author": {"steamid": "76561198348504982", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 6114, "playtime_last_two_weeks": 436, "last_played": 1514430753}, "language": "english", "review": "I think this is an excellent game for all ages! It's fun, interactive, and allows the player to be a cat in this colorful world that brings to life the sense of adventure. I have enjoyed it so much since playing in the Alpha and can't wait to see the final form. Congratulations, Falcon Development! It's one of my favorite games on steam. :)", "timestamp_created": 1512143344, "timestamp_updated": 1512143344, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.530024", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37979212": {"recommendationid": "37979212", "author": {"steamid": "76561198389852489", "num_games_owned": 3, "num_reviews": 2, "playtime_forever": 83, "playtime_last_two_weeks": 0, "last_played": 1512146806}, "language": "english", "review": "You should most definately get this game if you are into adventuring and meeting other cats and the main greatness is the fact that you can choose your own story. That in itself is amazing which is why you should play it.\n\nJust try it and have a go!", "timestamp_created": 1512142776, "timestamp_updated": 1513957439, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.394123", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "39403791": {"recommendationid": "39403791", "author": {"steamid": "76561198156411345", "num_games_owned": 19, "num_reviews": 4, "playtime_forever": 1508, "playtime_last_two_weeks": 783, "last_played": 1516161632}, "language": "english", "review": "This game is for you if:\n- you are a warrior cats fan (or used to be) and curse the lack of cat games and probably played WC: untold tales at some point\n- you enjoy games such as Animal Crossing, Stardew Valley, Harvest Moon and Story of Seasons.\n\nI personally fit in these two categories. You might enjoy this game more if you fit in the first one, seeing as Cattails is in a way WC:UT’s successor (though it branched away from warrior cats). Playing the game expecting Catdew Valley might leave you disappointed.\n\nPros:\n- tons of unlockable pelt colors and accessories for your cat\n- as there is no gender, you’re free to mate any of the available cats (there are nine), from any colony\n- unique kitten colors: depending your pelt color and your mate’s as well as eye color, your kittens will have an unique coat. You can then use these unique colors yourself after bonding with your kits.\n- an amazing soundtrack\n- simple controls and easy-to-learn (but hard to master) hunting.\n- Rule 1/3 of the forest in balance with the other colonies or become the master of the forest. \n- an interesting main story\n\nCons:\n- sometimes lags on a tile for no apparent reason (can be reduced by turning fancylight off)\n- no sidequests\n- no friendship events/romance events unique to each candidates\n- no predators/danger aside from patrol skirmishes\n\nAn update is incoming for around March 2018. It will include new pelt colors as well as the long awaited feature: the possibility to create your own colony.", "timestamp_created": 1516156081, "timestamp_updated": 1516156081, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39395340": {"recommendationid": "39395340", "author": {"steamid": "76561197998528153", "num_games_owned": 505, "num_reviews": 52, "playtime_forever": 772, "playtime_last_two_weeks": 772, "last_played": 1516230667}, "language": "english", "review": "This is a game I'd always been hoping someone would make. Even if your not a huge fan of cats, if you love rpgs, I suggest buying it. This is something entirely unique, which combines familiar rpg things, with a light hearted way to play and use them. And, to top it off, it has minigames/prizes at festivals. It has territory disputes. It has things heavy, and light that balance well.\n\nThis is a very thought out, and well made game. I am pleased I bought it, I'm pleased I Let's Played it. I'd reccomend it to anyone. Two paws up.", "timestamp_created": 1516125407, "timestamp_updated": 1516125407, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39389038": {"recommendationid": "39389038", "author": {"steamid": "76561198655354759", "num_games_owned": 3, "num_reviews": 1, "playtime_forever": 6366, "playtime_last_two_weeks": 2831, "last_played": 1516107424}, "language": "english", "review": "It's a fun game and you can do much. It's open-ended so you can have different plans and not sticking to a single storyline. However, there is one questline avaliable too. Hunting, battling won't be hard at all if you get some practice and use tactics even at the hardest difficulty.", "timestamp_created": 1516107656, "timestamp_updated": 1516107656, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39372496": {"recommendationid": "39372496", "author": {"steamid": "76561198091486706", "num_games_owned": 47, "num_reviews": 1, "playtime_forever": 1833, "playtime_last_two_weeks": 1833, "last_played": 1516158933}, "language": "english", "review": "are you making the update any time soon.when are you releasing it?\n", "timestamp_created": 1516044048, "timestamp_updated": 1516044048, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39357056": {"recommendationid": "39357056", "author": {"steamid": "76561198801238474", "num_games_owned": 9, "num_reviews": 4, "playtime_forever": 1414, "playtime_last_two_weeks": 366, "last_played": 1516220197}, "language": "english", "review": "some reason i have no fun playing almost any game, but i enjoy this game so this is a good game! also it was fun playing this game creators warrior cats untold tales game >:3", "timestamp_created": 1515993237, "timestamp_updated": 1515993237, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39341224": {"recommendationid": "39341224", "author": {"steamid": "76561198167936960", "num_games_owned": 24, "num_reviews": 2, "playtime_forever": 721, "playtime_last_two_weeks": 721, "last_played": 1515991218}, "language": "english", "review": "Its a really fun game that I looooooooooooooooooooove playing 10.5/10.6 hours on it and I've only had for 4 days!\n Which is not common for me to get. So it must be a good game! Also totally recomend!", "timestamp_created": 1515943846, "timestamp_updated": 1515943846, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39331542": {"recommendationid": "39331542", "author": {"steamid": "76561198150800880", "num_games_owned": 17, "num_reviews": 1, "playtime_forever": 819, "playtime_last_two_weeks": 819, "last_played": 1515980262}, "language": "english", "review": "I should preface my review by saying that I am definitely a cat lady. I love cats, I have two of them, I even got a board game called \"Cat Lady\" for Christmas! So, when I was purusing Steam for a game to use my gift card on, this game definitely piqued my curiosity right away. And, well, we all know about curiosity and cats... ;)\n\nIn addition to my love of cats, I also really love life simulation games. Stardew Valley, Harvest Moon, Rune Factory, Animal Crossing--you name a sim game, I have probably played and loved it. So, with my love of cats and my love of sim games, Cattails was bound to be the perfect game for me. And boy, is it ever! :D\n\nCattails is adorable, addictive, and so much fun to play! The hunting system takes a little getting used to, but once you start upgrading your abilities, the whole world opens up to you. From hunting, foraging, and exploring to fighting territorial battles, Cattails will make every trip out into the world an exciting adventure. Get to know your fellow cats, form alliances with other clans, and woo a special kitty to be your spouse. Attend season festivals complete with cute little mini-games to win rare prizes (my favorites are the decorations for your den!). And while you're busy doing all that, you can also work on completing your quest to bring balance back to the world. There's no shortage of things to do, but you get to take it all at your own pace.\n\nI appreciate Cattails because it offers many different experiences. Sometimes, it's gentle and relaxed; other times, it's tense and fast-paced. It can be easy or challenging, joyful or heart-breaking. If you like cats and life simulation games as much as I do, then you will definitely enjoy Cattails. :3", "timestamp_created": 1515915899, "timestamp_updated": 1515915899, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39325321": {"recommendationid": "39325321", "author": {"steamid": "76561197992990221", "num_games_owned": 206, "num_reviews": 70, "playtime_forever": 40, "playtime_last_two_weeks": 40, "last_played": 1515892573}, "language": "english", "review": "Lets get this streight, it is NOT Stardew Valley. At the time of wrighting this, it needs A LOT of work to come anywhere close to it.\n\nAll it is now, is talking to pre-scripted npcs and killing small animals with very little show.\n\nActual value: 7.00", "timestamp_created": 1515892846, "timestamp_updated": 1515892846, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.400000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39324409": {"recommendationid": "39324409", "author": {"steamid": "76561198271653851", "num_games_owned": 7, "num_reviews": 1, "playtime_forever": 4399, "playtime_last_two_weeks": 4399, "last_played": 1516229755}, "language": "english", "review": "Okay so... I loved this game. I still do. I love it to bits. But, HOW DO YOU REMOVE CHARACTERS?! I get you can replace them with another, but having multiple characters I don't use anymore bothers me. Is there any way to do it?\n\n\n\nBut, not including that, it's beautiful, fun, the characters are quirky, and it's kind of addicting tbh. Like pretty much everyone else has done, I compare it to Stardew Valley. I can't wait for more updates!", "timestamp_created": 1515889472, "timestamp_updated": 1515889472, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39266605": {"recommendationid": "39266605", "author": {"steamid": "76561198273488930", "num_games_owned": 6, "num_reviews": 1, "playtime_forever": 302, "playtime_last_two_weeks": 302, "last_played": 1516063455}, "language": "english", "review": "Really cute!!", "timestamp_created": 1515707966, "timestamp_updated": 1515707966, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39246950": {"recommendationid": "39246950", "author": {"steamid": "76561198336862492", "num_games_owned": 6, "num_reviews": 3, "playtime_forever": 1282, "playtime_last_two_weeks": 729, "last_played": 1516048071}, "language": "english", "review": "\nStart a family.\nDominate the other weak cats.\nRaise your kittens to become soliders.\nClaim every single tile of land.\nHave a Tardis-like den that you can get bigger on the inside, but stays the same on the outside.\nWreak havoc on any cat that is not that of your colony.\nMurder mulitple cats without losing half your health.\nListen to the awesome sound track :D\n\n", "timestamp_created": 1515641654, "timestamp_updated": 1515641654, "voted_up": true, "votes_up": 0, "votes_funny": 4, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39246678": {"recommendationid": "39246678", "author": {"steamid": "76561198104064883", "num_games_owned": 24, "num_reviews": 1, "playtime_forever": 2700, "playtime_last_two_weeks": 1969, "last_played": 1516134404}, "language": "english", "review": "[h1] Oh My Gods. [/h1]\n\nThis game had been collecting dust on my wishlist ever since its release, and even once I obtained the money to purchase it I found myself rather reluctant, -- fearing buyer's remorse, given 15$ (Though cheap by comparison to most games) could be spent on any number of other things.\n\nAfter a few weeks my brother spontaneously bought it for me, saving me the money. I played it for 12 hours straight that day, pausing once only to eat.\n\n[i]12  h o u r s[/i]\n\nWhile simple and streamlined, the main questline is pleasant and endearing, with the promise for more in future updates (I'm so excited!) Even after rushing straight through everything, I still had plenty more to do before I would even begin to feel satisfied with setting the game down for awhile.\n\nIt's all very grind-oriented, with self-set goals and various achievements to chase after, such as gaining more territory, finding a mate, raising your kittens and so on.\nIf you can appreciate games with a relaxed, self-paced setting like Animal Crossing and Stardew Valley, this game is for you. I'm so excited to see more from Falcon and his wife.\n\nConsider supporting them for the hard work and beautiful product!", "timestamp_created": 1515640572, "timestamp_updated": 1515640601, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.548495", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39237902": {"recommendationid": "39237902", "author": {"steamid": "76561198353559330", "num_games_owned": 11, "num_reviews": 5, "playtime_forever": 1395, "playtime_last_two_weeks": 1395, "last_played": 1516139384}, "language": "english", "review": "Just like Warriors: Untold Tales! I really love the sprites for this game! They're very cute and much more improved from the others. I really like the storyline as well but no spoilers! ;3c You'll all have to figure out what happens on your own, there. The first part of the storyline is sad when opening up the game, though. Made me tear up a little because I thought of my own cat and the same fate that happens to others. But that's off topic. I also really like the OST of this game along with the little festivals the cats have. Those are cute as well. Really love the game!", "timestamp_created": 1515609842, "timestamp_updated": 1515609842, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39231273": {"recommendationid": "39231273", "author": {"steamid": "76561198086876593", "num_games_owned": 152, "num_reviews": 2, "playtime_forever": 1034, "playtime_last_two_weeks": 1034, "last_played": 1516230842}, "language": "english", "review": "This game is absolutely precious.\nIt's relaxing to play, and while it does have an overarching plot, it leaves enough space to create your own goals that you never feel stressed about completeing that plot ASAP. I would recommend that people who enjoy Stardew Valley, but sometimes want something even more 'lowkey' than that definitely give this a try.\n\nYou can tell that this game is well loved by its developer, as well.", "timestamp_created": 1515591196, "timestamp_updated": 1515591196, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39162340": {"recommendationid": "39162340", "author": {"steamid": "76561197976812952", "num_games_owned": 462, "num_reviews": 6, "playtime_forever": 47, "playtime_last_two_weeks": 47, "last_played": 1515354077}, "language": "english", "review": "If you love cats then you owe it to yourself to play Cattails.  I usually avoid these types of games like the plague, Falcon did an amazing job here.", "timestamp_created": 1515354585, "timestamp_updated": 1515354585, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.461096", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39123626": {"recommendationid": "39123626", "author": {"steamid": "76561198403081418", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 2682, "playtime_last_two_weeks": 16, "last_played": 1516117769}, "language": "english", "review": "When I was younger, I was a huge Warriors fan, and while I've grown out of it, this game peaked my interest. And while it does have several similar qualities to the book series, it's also different in a lot of ways! It's a beautiful open world game, and while you can follow the main story, it's not necessary. I adore this game and all it has to offer. It was definitely worth the money. The only real issue I have with it is sometimes it lags in some spots, like at the temple and the beach! The graphics are beautiful, but I wish it wouldn't slow down in some spots, that's rather irritating. All in all, this game is an amazing RPG that I have loved playing and will continue to love.", "timestamp_created": 1515256855, "timestamp_updated": 1515256855, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39107512": {"recommendationid": "39107512", "author": {"steamid": "76561198312214219", "num_games_owned": 122, "num_reviews": 13, "playtime_forever": 1081, "playtime_last_two_weeks": 1061, "last_played": 1515872479}, "language": "english", "review": "A very interesting game with many cats,a very nice main story.\nNeeds more realism\n", "timestamp_created": 1515216546, "timestamp_updated": 1515216546, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39103627": {"recommendationid": "39103627", "author": {"steamid": "76561198388402184", "num_games_owned": 3, "num_reviews": 1, "playtime_forever": 6581, "playtime_last_two_weeks": 1777, "last_played": 1515948144}, "language": "english", "review": "I love this game. it's really cute and i can't wait for the next update so we can finally build our own colony.", "timestamp_created": 1515204479, "timestamp_updated": 1515204479, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39100574": {"recommendationid": "39100574", "author": {"steamid": "76561198371375643", "num_games_owned": 24, "num_reviews": 2, "playtime_forever": 2386, "playtime_last_two_weeks": 2386, "last_played": 1515769642}, "language": "english", "review": "This game is a relaxing experience and it's one of my favourite games to play when stressed. The game is about restoring the balance and bringing back the Forest Guardian, which is only the main quest. I believe there are sidequests aswell. This game is obviously inspired by Warrior Cats, as Falconstar's previous project was a warrior cats simulator called Warriors: Untold Tales. I know about this game because of that game, i have been looking forward to this game for ages and i love it. If you're not sure if you want to get this, download Untold Tales. Its basically a simpler version of this game with less things to do, no controller support, worse graphics etc. But the concept is the same. You have your cat character with different territories, you can collect herbs, fish, prey and more and you can have kits and make friends. If you play Untold Tales and think \"Hey, i like this concept but its missing alot.\" you will definitly enjoy this game. All things that are wrong, annoying and missing in Untold Tales are in this game, complete with extra features and things to do. However i can see this not being for everyone. I reccomend this game to anyone who liked Untold Tales or likes a cute rpg pixel game about cats. Here are my pros and cons.\n\nPros:\n\n- Improvement from Untold Tales\n- Better graphics\n- Adorable cats\n- Many things to collect and customize\n- Long main quest with many side quests (so more enjoyment)\n- The fact that you can date cats and have kits, which i find hilarious\n- Cat customization\n\nCons:\n- Keyboard controls are meh. I reccomend using a controller.\n- May get boring for people that do not like this genre or Warrior Cats\n- Missy is a bit of an annoying brat no matter how much you give her in the beginning.\n- Some items to buy are very expensive and will take a long time just hunting for a few hours.\n\nI really dont have more nitpicks, and these are very small and dont ruin anything for me (except the keyboard one i really reccomend a controller)\n\nAgain, if you're not sure. watch other people play it or download Untold Tales for free. :)\n\nLove this game.\n\n", "timestamp_created": 1515195655, "timestamp_updated": 1515195655, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39090216": {"recommendationid": "39090216", "author": {"steamid": "76561198197232245", "num_games_owned": 10, "num_reviews": 2, "playtime_forever": 2430, "playtime_last_two_weeks": 814, "last_played": 1515986642}, "language": "english", "review": "I love this game, I could play it for weeks on end. There's so much to do and explore, and the achievements give you a lot more goals to shoot for. I wish some more of the cats were marriageable, like Sarge or Leo. I just want to date all of them, even though Nil is my one true love. XD I really like the kitten pelt generation and how you can unlock your kittens' pelts, even though I wish you could have more than one litter of kittens, since sometimes you only end up with one, which can be a little disappointing. The fact that black roses make the recipient hate you - and how much you *know* they hate you - gives the world more depth. Overall, it's a ton of fun! I definitely recommend Cattails, and I can't wait until the next update!", "timestamp_created": 1515172595, "timestamp_updated": 1515172595, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39073249": {"recommendationid": "39073249", "author": {"steamid": "76561198048840464", "num_games_owned": 68, "num_reviews": 3, "playtime_forever": 2249, "playtime_last_two_weeks": 298, "last_played": 1515352160}, "language": "english", "review": "My daughter plays this game and loves it.  She loves animals and has a great imagination so this works for her.", "timestamp_created": 1515128731, "timestamp_updated": 1515128731, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.465116", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39072613": {"recommendationid": "39072613", "author": {"steamid": "76561198273555063", "num_games_owned": 76, "num_reviews": 5, "playtime_forever": 222, "playtime_last_two_weeks": 0, "last_played": 1513554031}, "language": "english", "review": "Very fun and cute, the only issue I have with this game is that it lags in certain areas of the map (even with fancy light turned off). I've decided to put playing it on hold until there's an update that hopefully fixes the lag. It's unplayable for me with how slow the game runs sometimes. Other than that, very cute and I wish I could play it more. I'd recommend it if not for that lag alone.", "timestamp_created": 1515126545, "timestamp_updated": 1515126545, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.501629", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "timestamp_dev_responded": 1515169644, "developer_response": "Hi escafrisky,\n\nSorry to hear that you're experiencing issues with game performance. Can I ask if you computer meets our specified Minimum Requirements?\n\nOS: Windows 7\nProcessor: 2.0 GHz\nMemory: 4 GB RAM\nGraphics: Intel HD 4000\nStorage: 200 MB available space\n\nIf it does and you're still experiencing lots of lag, please let us know at tyler@cattailsgame.com so we can work towards a solution.\n\nAll the best,\n\n-Falcon Development"}, "39043370": {"recommendationid": "39043370", "author": {"steamid": "76561198177146501", "num_games_owned": 60, "num_reviews": 20, "playtime_forever": 1348, "playtime_last_two_weeks": 0, "last_played": 1514261045}, "language": "english", "review": "A cute casual game where you get to pretend you're a cat. Consider it a \"light\" version of something like Stardew Valley, because it doesn't have a lot of depth, but the same principals in game play, such as limited exploration where you will forage for food, form relationships, mine, etc. Unfortunately it does get repetitive, and unless you're a die hard fan of these types of games, I don't see a lot of longevity. On the plus side, I really recommend playing this game without any sort of guide in the beginning. The fun part is figuring it out and the discoveries you make.\n\nJust don't name your cat after your own, because I made that mistake and no good owner wants to picture their cat being abandoned at the beginning. :X", "timestamp_created": 1515061822, "timestamp_updated": 1515061822, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.533074", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39030039": {"recommendationid": "39030039", "author": {"steamid": "76561198128497751", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 1511, "playtime_last_two_weeks": 550, "last_played": 1515888841}, "language": "english", "review": "If you like playing Stardew Valley and liked the Warrior cat book series back in the day, this is the game for you. It's a fun game. You can go mining, you can build cat relationships and have a cat family, you can garden or forage. A few different things- the fighting aspect. You are in one of three packs of cats. You can get in scirmishes and expand your territory. You also get to hunt little critters and need to maintain your hunger level by eating. You can customize your cat by buying different colors and patterns. The mini games durring festivals are nice and I like the pacing of how time passes in-game. One thing I was slightly irked by is when you're mining and reach lower levels, you don't get an elevator (or 'mole hole' in this game) automatically. It must be purchased with the credits you get in exchange for your mining efforts. I wish there was a screen to monitor your relationship building and show how many hearts you have with each villager/cat. The shops are very overpriced and then buy your foraged items from you for only a couple coins which is frustrating. \n\nOverall, I enjoy and reccomend it.", "timestamp_created": 1515023132, "timestamp_updated": 1515023132, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39024930": {"recommendationid": "39024930", "author": {"steamid": "76561198151167050", "num_games_owned": 8, "num_reviews": 2, "playtime_forever": 1580, "playtime_last_two_weeks": 0, "last_played": 1514701680}, "language": "english", "review": "Cattails satisfies that urge we've had for years to play in the warriors cats world. You get to choose your own colony, much like a clan, and fight for land, get married and have kits, save the forest etc. I was very much addicted to the game, and can't wait for more content!", "timestamp_created": 1515012581, "timestamp_updated": 1515012581, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39022299": {"recommendationid": "39022299", "author": {"steamid": "76561198128535425", "num_games_owned": 4809, "num_reviews": 19, "playtime_forever": 863, "playtime_last_two_weeks": 838, "last_played": 1516130318}, "language": "english", "review": "Wellll... 'Guess I've already found my new brand of catnip for this whole year to come. =^.^=", "timestamp_created": 1515007528, "timestamp_updated": 1515007586, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39021634": {"recommendationid": "39021634", "author": {"steamid": "76561197994006736", "num_games_owned": 232, "num_reviews": 3, "playtime_forever": 1155, "playtime_last_two_weeks": 169, "last_played": 1514962394}, "language": "english", "review": "The game is charming and hits all the expected notes for the genre.  Some of it feels a little tacked on, but none of it becomes a hindrance to the enjoyment of the game.  Music is good. I really enjoyed being a cat.", "timestamp_created": 1515006354, "timestamp_updated": 1515006354, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39021196": {"recommendationid": "39021196", "author": {"steamid": "76561198087008127", "num_games_owned": 165, "num_reviews": 3, "playtime_forever": 863, "playtime_last_two_weeks": 0, "last_played": 1513144782}, "language": "english", "review": "As an avid fan of games styled like Cattails when I heard about this game, somewhere back before summer of 2017, I was super excited (especially because I'm a huge warrior cats fan!). I purchased this game under the assumption it was a fully finished product.\n\nIt's NOT.\n\nPros; \n\n- Well made\n- Great storyline \n- Well outlined character personalities\n- MANY colors to chose from\n- Many ways to earn currency\n\nCons;\n\n- SOME stuttering, not too bad but I added it as a con anyway\n- Some in game products too expensive (this is a personal preference, I don't want the game to be super easy but I find some of the products super late game even though they're not supposed to be)\n- Incomplete game\n\n[ S P O I L E R ]\n\nI completed the Arcane pillars and brought back the guardian and this is where I became super dissappointed, the game is incomplete; the guardian informs you that in order for balance to be restored to the forest you need to create your own Colony HOWEVER it also informs you that you have to wait for the next update to be able to access this feature.\n\nI bought this game for two other people as well and I'm upset that they can't finish the game either, such a dissapointment for all of the hype it generated.\n\nWould recommend to others if it was complete, especially since they reached their kickstarter goal, but for now I'm not recommending it to anyone.\n\nWould also suggest this game be labeled as early access or beta.", "timestamp_created": 1515005533, "timestamp_updated": 1515005533, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39018550": {"recommendationid": "39018550", "author": {"steamid": "76561198395987948", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 708, "playtime_last_two_weeks": 708, "last_played": 1515839240}, "language": "english", "review": "Aaaah! I absolutely love this game! Can't wait for new updates.", "timestamp_created": 1515000824, "timestamp_updated": 1515000824, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39012570": {"recommendationid": "39012570", "author": {"steamid": "76561198799227147", "num_games_owned": 29, "num_reviews": 2, "playtime_forever": 644, "playtime_last_two_weeks": 644, "last_played": 1515549940}, "language": "english", "review": "If you enjoyed Stardew Valley then you defently will enjoy this game. This game is defently fun and i dont regret spending $15 on it. I do, however, have a few problems that may impact one's enjoyment of this game. The game is also optimised pretty well. I'm running the game with the exact listed Minimum requirments and the only time i had lag was when it was rainin at night and inside the mines. Also if you do plan on Buying this game i highly recommend playing on hard mode, as the game has a relitivly low learning curve.", "timestamp_created": 1514989682, "timestamp_updated": 1514990164, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39010003": {"recommendationid": "39010003", "author": {"steamid": "76561198263533046", "num_games_owned": 16, "num_reviews": 3, "playtime_forever": 2668, "playtime_last_two_weeks": 2144, "last_played": 1515918154}, "language": "english", "review": "Stardew Valley and Warrior Cats Untold Tales combined together.\n(I'm pretty sure one of the developers from this game made Warrior Cats Untold Tales)\n\nI've been waiting for this game for a while now, (I've read Warrior Cats, the novel series so I was pretty hyped for this game). Its pretty fun and has the potiential to become a better game.\n\nPositives\n\nIts an adorable game, you can hunt, you can establish territory, you can forage, you can mine, you can befriend other cats and you can fight cats from other colonies. Its a fun game and worth the $15. The controls are something that you can remember and are establishable (easy to wrap your head around). Graphics-wise, it fits in with the music and 'point' of Cattails and is done neatly, adding to the 'adorable' aesthetic. Its bright and colourful, its one of those game that are just there to make you happy.\n\nOverall its great fun and passes the time. Probably the best cat game I will ever find. What a dream come true.\n\nNegatives \n\nI'm not saying its cardboard cut-out of those two games, it definitely has some distinguishable differences. Probably could use more unique concepts to make Cattails 'its own game' considering there is alot of similarites between Cattails and Stardew Valley. The mines are an example, the mechanics and appearance it pretty similar.\n\nMore content with a direct approach? After a few hours the game can get repetitive, depending if you know what your going for in the game. Everything seems start to cycle over and over again. It needs something a bit extra.\n\n\nOverall, the game could use some work but still worth buying.", "timestamp_created": 1514984487, "timestamp_updated": 1514984808, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38996340": {"recommendationid": "38996340", "author": {"steamid": "76561198065493472", "num_games_owned": 28, "num_reviews": 2, "playtime_forever": 487, "playtime_last_two_weeks": 324, "last_played": 1515116495}, "language": "english", "review": "Where was this game when I was 13? I am in love.\n\nFor all of those people who like casual sim games like Stardew Valley or the Harvest Moon games, pick this up and give it a try. It's very much in that vein (Stardew in particular) except instead of farming, you are amassing the world's largest collection of black hares while trying to avoid getting beat up by the Mountain domain.\n\nFor those of us who were Warrior Cats nerds back in 2008 and still foster love and nostalgia towards that world, this is the game you would have procrastinated on your geometry homework for. Cattails is very much its own thing, but it maintains that spirit of exploration, survival, family loyalty....and fighting for territorial hunting rights. As you do.\n\nThings I like:\n- Pretty pixel art and music\n- Hunting is actually tricky\n- THERE ARE FRIGGIN POLITICS\n- You're a cat. Duh.\n\nThings I want:\n- More dialogue depth with everyone (potential mates in particular)\n- Longer days\n- Generational play, or at least multiple litters of kittens\n\nIt is a fairly simple game, but at only two hours in I have already seen so much depth -- and so much potential for growth. My understanding is that the developer is going to continue to update Cattails, and I hope to see even more complexity packed in to this little gem. I can't wait. Meanwhile, there are mice to catch!", "timestamp_created": 1514946304, "timestamp_updated": 1514946340, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38961257": {"recommendationid": "38961257", "author": {"steamid": "76561198449870812", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 2441, "playtime_last_two_weeks": 58, "last_played": 1515709328}, "language": "english", "review": "Great game! Beautiful graphics and love the cat art! (I'm still amazed by the shadow affect)", "timestamp_created": 1514867701, "timestamp_updated": 1514867734, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38952246": {"recommendationid": "38952246", "author": {"steamid": "76561198411764972", "num_games_owned": 3, "num_reviews": 1, "playtime_forever": 1990, "playtime_last_two_weeks": 0, "last_played": 1514758995}, "language": "english", "review": "Oh my goodness even just the opening scenes are worth the money", "timestamp_created": 1514844035, "timestamp_updated": 1514844035, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38952132": {"recommendationid": "38952132", "author": {"steamid": "76561198348117536", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 3926, "playtime_last_two_weeks": 0, "last_played": 1514927439}, "language": "english", "review": "I really love the game and it's a shame it doesn't get more attention, though my achievments have been acting up since i already dated and married a cat and had kits but i don't get the achiements for them, so if you could help with it'd be a great help, thanks ffor reading.", "timestamp_created": 1514843812, "timestamp_updated": 1514843812, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39423545": {"recommendationid": "39423545", "author": {"steamid": "76561198145858508", "num_games_owned": 17, "num_reviews": 2, "playtime_forever": 3155, "playtime_last_two_weeks": 413, "last_played": 1516228902}, "language": "english", "review": "Before the game's release, I was tracking the game and hoping to get it when it was released. When I got home on the release day, I immediatly bought it.\n\nPros:\ngraphics\ncool cat designs\ngreat gameplay\ngood music\n\nCons:\nA bit of deja vu (from Stardew Valley)\nCan't go on an adventure with multiple kits at once\nOnly one litter per save\nCats don't have specified genders", "timestamp_created": 1516226904, "timestamp_updated": 1516226904, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39423489": {"recommendationid": "39423489", "author": {"steamid": "76561198372358630", "num_games_owned": 19, "num_reviews": 7, "playtime_forever": 110, "playtime_last_two_weeks": 110, "last_played": 1516047579}, "language": "english", "review": "*Gets adopted and cared for*\n\n\n\n\n\n\n\n\n*Gets left on the street to die*\n\n\n\n\n''Im going to get revenge-''\n\n\n\n\n", "timestamp_created": 1516226719, "timestamp_updated": 1516226719, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39447275": {"recommendationid": "39447275", "author": {"steamid": "76561198389284239", "num_games_owned": 8, "num_reviews": 3, "playtime_forever": 4372, "playtime_last_two_weeks": 1, "last_played": 1515967946}, "language": "english", "review": "[i][[Please note that this review is mostly opinion. If any of your opinions conflict my own, please don't complain about it.]][/i]\nWell, I've finally gotten out of this game's whirlpool of sheer addiction and have formed words to describe it. And seriously, I have quite a lot to say. This game is WONDERFUL. Even though I haven't played Stardew Valley or the like, this game is still amazing anyways! Surviving the wilderness as a cat has never been more fun.\nHere are some pros and cons:\n[h1] Pros [/h1]\n[list]\n[*] Charming characters\n[*] Absolutely WONDERFUL soundtrack (too bad it's DLC)\n[*] Battles with the other colonies\n[*] Customize your cat with fur colors, eye colors, a name, and cute accessories\n[*] Marriage and kittens\n[*] Rarely ever lags\n[*] Loads of items to collect\n[*] Unlimited gameplay!\n[*] 5 save files for unique cats\n[*] Befriend the other colonies\n[*] ...while secretly claiming their territory\n[*] Hunting isn't that tedious\n[*] Festivals and minigames to play\n[*] Story-based quest\n[*] Set and achieve your own goals!\n[*] Easy controls\n[/list]\n\n[h1] Cons [/h1]\n[/list]\n[*] Laggy by the ocean areas\n[*] Takes a while to unlock the whole dating thing\n[/list]\nYep. This game is a 10/10 in my opinion. If you like anything about it, why not support Falcon Development and purchase the game!", "timestamp_created": 1516317316, "timestamp_updated": 1516317316, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39509369": {"recommendationid": "39509369", "author": {"steamid": "76561198147537934", "num_games_owned": 19, "num_reviews": 1, "playtime_forever": 1505, "playtime_last_two_weeks": 1, "last_played": 1516538880}, "language": "english", "review": "Relaxed slow paced  grinding with a lot of goals for u to set, all while being in your cat hood with your cat hommies.Love it.", "timestamp_created": 1516537923, "timestamp_updated": 1516537923, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39500793": {"recommendationid": "39500793", "author": {"steamid": "76561198058776398", "num_games_owned": 55, "num_reviews": 3, "playtime_forever": 2253, "playtime_last_two_weeks": 0, "last_played": 1513491821}, "language": "english", "review": "I adore this game, and I highly recommend it. That said, you will not like this game if you don't like: repetitive tasks, resource gathering, limited dialogue, endlessly playable. (some Harvest Moon, Minecraft, early Stardew Valley, Animal Crossing)\n\nHowever, if you find games like that fun, and are looking for some lighthearted adventures, you will probably enjoy Cattails! I started playing Cattails in the beta when I purchased it mid October. Instantly I was hooked, with so many things to catch, with seasons to see, cats to meet! I played for hours.  The soundtrack is lovely and has encouraged many hours of play as I seem to forget how long it's been until the season changes. Please play Cattails if this sounds like something you would enjoy.", "timestamp_created": 1516508468, "timestamp_updated": 1516508468, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "39490109": {"recommendationid": "39490109", "author": {"steamid": "76561198381381939", "num_games_owned": 14, "num_reviews": 6, "playtime_forever": 1339, "playtime_last_two_weeks": 584, "last_played": 1516492139}, "language": "english", "review": "This game is purrrrrfect! I have suggestions for future updates : The cat your dating should be able to randomly propose to you.  Multiplayer mode! (please) Instead of AI cats filling the world, there could be other players instead! You could do the story together, or just mess around and have fun! More than 1 litter of kits.Being able to Choose your gender (after your mate has spoken to you about kits, if you selected female, your cat would become chubby and just to make it more of a challenge, your stats are lowered. Eg: Movement speed, stealthiness, ability to fight. That's all for now, please consider my suggestions. Thanks!", "timestamp_created": 1516472735, "timestamp_updated": 1516472735, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}}
