{"reviews": {"37977101": {"recommendationid": "37977101", "author": {"steamid": "76561198011699246", "num_games_owned": 280, "num_reviews": 9, "playtime_forever": 1135, "playtime_last_two_weeks": 0, "last_played": 1512595111}, "language": "english", "review": "This game is fabulous, and even though it's in early access, it shows great promise and has plenty to play around with in its current state. If you like fighting games, especially ones in the vein of street fighter, you'll enjoy this.", "timestamp_created": 1512137127, "timestamp_updated": 1512137127, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37459020": {"recommendationid": "37459020", "author": {"steamid": "76561198000640263", "num_games_owned": 64, "num_reviews": 3, "playtime_forever": 11095, "playtime_last_two_weeks": 1264, "last_played": 1516049081}, "language": "english", "review": "Where do I start....... THIS GAME IS AWESOME! I hardly have anything negative to say about this game. If you enjoy 2D style fighting games, with tons of defensive mechanics and solid gameplay, you WILL enjoy Punch Planet!\n\nGameplay: 10/10 This game has super responsive controls, unlike fighting games ive played recently. There is no input delay, it just feels really good to play. The gameplay is very deep and intuitive, giving each player an array of customization in they're fighting style with each character. I've played this game for 78 hours and have yet to run into two people who play a character the same way.\n\nGraphics: 10/10 At first look, this game looks like a 2D animated game. No, thats just what the unique art style wants you to think. These are 3D animated characters that have been beautifully rendered and animated with fluidity and it shows. The game looks great in motion and is a joy to watch. Shadows, lighting, and colors are all sharp and sort of pop off of the screen at you. Just gorgeous.\n\nAudio: 10/10 The soundtrack of this game will be stuck in your head hours after you play it. The tracks never get old or repetitive. They are unique enough to sound like music you've never heard before in a video game but also destinct enough to leave a lasting impression in your mind. Great music that fits the theme of a fighting game, set in the future, on distant planets in outer space.\n\nOverview: The game is a masterpiece. Its in early access right now, but for base price ($20) you get 4/8 playable from the start, 3 stages, practice mode and online pvp. Story/Arcade mode is coming as well as player vs cpu. Updates are almost weekly to the game, keeping it fresh and adding to the replay value. There is also a very active and welcoming community in the Punch Planet discord, led up by the three developers. You will have fun and you'll meet a ton of awesome people willing to help you with the game. Join here: https://discord.me/page/punchplanet\n\nI would highly recommend this game, its a breath of fresh air to fighting games and has an awesome lore supporting game as well. Pick it up, I promise you wont regret it--\n\n- Strtfghtr88", "timestamp_created": 1511582946, "timestamp_updated": 1511582946, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.566929", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37216150": {"recommendationid": "37216150", "author": {"steamid": "76561197967142337", "num_games_owned": 297, "num_reviews": 5, "playtime_forever": 116, "playtime_last_two_weeks": 0, "last_played": 1513725857}, "language": "english", "review": "Great start into early access. GGPO netcode is so great and the game is fun. Can't wait for more...", "timestamp_created": 1511474720, "timestamp_updated": 1511474720, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36678531": {"recommendationid": "36678531", "author": {"steamid": "76561198069996607", "num_games_owned": 163, "num_reviews": 19, "playtime_forever": 6088, "playtime_last_two_weeks": 556, "last_played": 1516465906}, "language": "english", "review": "+GGPO netcode. A very big plus since other netcodes start to become more restrictive the farther apart you are from the opponent\n+Street fighter style gameplay. \n+You can play as a dog\n+The DTC mechanic gives every character a sense of freedom and power in their offense. \n+Nice 2d visuals from 3d models\n+Good background music\n+Good backgrounds\n\n=Street fighter style gameplay.\n\n-Early access, this certainly isn't a complete game, and it's missing some key features currently like remapping keyboard as well as having just 4 characters currently. That said, the devs are working hard on adding the features and making the new characters.", "timestamp_created": 1511280837, "timestamp_updated": 1511280837, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.531250", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36635056": {"recommendationid": "36635056", "author": {"steamid": "76561198192004990", "num_games_owned": 130, "num_reviews": 2, "playtime_forever": 2403, "playtime_last_two_weeks": 4, "last_played": 1515491145}, "language": "japanese", "review": "結論から総評を言うと とても面白いゲームだと思います。\n既存の格闘ゲームでいうとストリートファイターシリーズ が近いかもしれません\nですがダブルタイムキャンセルをはじめ独自のシステムとゲージのおかげで\nかなり個性の強いゲームになっていると思います\n\n特定の組み合わせ以外で通常技→通常技のキャンセルはできないのですが\n所謂目押しコンボも先行入力の受付が絶妙で少し練習すれば\n始めたばかりの初心者でも実戦で完走できる難易度になっており、そのあたりはかなりストレスフリーかと\n\n残念な点をあえて上げるなら日本ユーザーがまだ少なく、\n情報共有や対戦は特定の誰かと連絡を取り合わないと難しい事でしょうか\nこちらに関してはjpwikiやdiscordのグループを作っているので今後人口が増えれば解決しますね！\n\n今後のアップデート楽しみにしてみます！トレモにはやくしゃがませる機能を実装してほしいかも", "timestamp_created": 1511132582, "timestamp_updated": 1511132582, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.584644", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36617684": {"recommendationid": "36617684", "author": {"steamid": "76561198096385391", "num_games_owned": 363, "num_reviews": 1, "playtime_forever": 167, "playtime_last_two_weeks": 10, "last_played": 1516009417}, "language": "english", "review": "This game is such a fun experience so far, I can't wait to see how it comes along. I'm very excited for its future.\n\nGameplay is familiar to Street Fighter players, takes mechanics from 4 and 3 and works them into a easy to understand and flexible and satisfying system. \n\nThe designs of the characters and just the game itself are concise and fitting in the vivid, minimalistic, sci fi aesthetic. Function wise, you have everything you need in the current 4 characters. Design wise, I'm in love, especially Tyara.\n\nThe devs are making something great, and a fighting game is harder than your standard indie title to create, and most importantly, create well.", "timestamp_created": 1511081334, "timestamp_updated": 1511331684, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36556027": {"recommendationid": "36556027", "author": {"steamid": "76561198338394007", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 7349, "playtime_last_two_weeks": 1286, "last_played": 1516464974}, "language": "english", "review": "This game gives you the opportunity to say 'try that on my Dog, b1tch'\n\nYou're doing yourself a disservice if you don't try this game.", "timestamp_created": 1510856686, "timestamp_updated": 1510856724, "voted_up": true, "votes_up": 0, "votes_funny": 2, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36546182": {"recommendationid": "36546182", "author": {"steamid": "76561198098610715", "num_games_owned": 23, "num_reviews": 2, "playtime_forever": 818, "playtime_last_two_weeks": 0, "last_played": 1511324514}, "language": "english", "review": "This game is the spearhead for the next wave of independent fighters.\n\nPunch Planet charms players with it's own vibrant, minimalistic, retro, sci-fi-punk aesthetic that doesn't exist in competitive fighters today. It also echoes that of Steven Universe (the character Tyara seems to be a nod to the Gems...and WW respectively)\n\nThis art style also typically lends itself to catchy, cool, retro, synthesized beats which the soundtrack perfectly captures. (makes for great fighting music)\n\nThe game has a memorable roster so far (only 4)\nall with their own unique fighting styles that very much live up to their dream function, with their personality beautifully expressed through their fighting style and battle cries a la street fighter. I can't wait to see the others.\n\nThe battle system feels like home! (I speak for myself)\nThe focus cancel mechanic borrowed from SF4 is amazing, and is what allows you to be creative with how you play, except in this game, you can cancel any normal move, and special move by tapping the same single button you last pressed. this mechanic has it's own meter bar that you must manage.\n\nThe parry mechanic becomes intuitive, and easy once you get the hang of it. in experienced battles, the parry will make you think twice about doing a lot of things, which makes for exciting gameplay. and the universal overhead/hop is a nice touch (maybe a nod to 3rd strike?)\n\nIf you're a competitive fighter looking for a new playground, Punch Planet won't disappoint.\n\nRemember the game is a work in progress.\nWith that being said, it's this promising in it's alpha state, and i can't wait to see the final product. I believe in this project.\n\n10/10", "timestamp_created": 1510816217, "timestamp_updated": 1510818667, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36539956": {"recommendationid": "36539956", "author": {"steamid": "76561198005406814", "num_games_owned": 57, "num_reviews": 1, "playtime_forever": 330, "playtime_last_two_weeks": 0, "last_played": 1510781043}, "language": "english", "review": "As a Street Fighter fan, I can only recommend this game. It has a lot of depth but is accessible at the same time, which is always good. It shares many similarities with SFIV and SFIII. Online connection is butter smooth thanks to GGPO netcode. The art style is very pleasant to the eye and the music gives a nice Sci-Fi/Retro vibe. \n\nIf you love Fighting Games you will love Punch Planet!\n\n", "timestamp_created": 1510782902, "timestamp_updated": 1510782902, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36516379": {"recommendationid": "36516379", "author": {"steamid": "76561197964860018", "num_games_owned": 132, "num_reviews": 5, "playtime_forever": 216, "playtime_last_two_weeks": 0, "last_played": 1511550745}, "language": "english", "review": "Very good game if you liked SF4 and don't like SFV.\nOverpriced right now, only worth it if you like lab work and playing against friends.", "timestamp_created": 1510683373, "timestamp_updated": 1510683373, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36502089": {"recommendationid": "36502089", "author": {"steamid": "76561197985469005", "num_games_owned": 344, "num_reviews": 6, "playtime_forever": 4574, "playtime_last_two_weeks": 175, "last_played": 1516311574}, "language": "english", "review": "awesome game!", "timestamp_created": 1510619294, "timestamp_updated": 1510619294, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36496042": {"recommendationid": "36496042", "author": {"steamid": "76561198141380426", "num_games_owned": 46, "num_reviews": 3, "playtime_forever": 53, "playtime_last_two_weeks": 0, "last_played": 1510587019}, "language": "english", "review": "This game might have potential to be solid great fighting game . The gameplay in this game are very neat and well-made . I hope that they add 'survival' gamemode . Also, the game might be good thing if they added matchmaking but hey this game is also early access so it will come soon \n\n", "timestamp_created": 1510594457, "timestamp_updated": 1510594457, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36480039": {"recommendationid": "36480039", "author": {"steamid": "76561198100243031", "num_games_owned": 286, "num_reviews": 11, "playtime_forever": 1492, "playtime_last_two_weeks": 17, "last_played": 1515288222}, "language": "english", "review": "This game is awesome. I can only speak to the core mechanics and online since that is basically what's available at the moment (I don't care about story stuff for later anyway) but if you grew up on Street Fighter then you will be right at home here. It is kind of like a cross between maybe SF3 (parries which are super useful, universal overhead) and SF4 (attack cancel stuff, think FADC, which is probably the most advanced mechanic to use properly - I'm definitely not). The flow of the game is pure SF - not stupid Marvel fast, but not too slow either. Buttons (six) are what you expect and frame data is similar so a jab (LP) will feel like what you think a jab is, and so on. \n\nThe sci fi theme is pretty cool, music is good, announcer lady is surpsisingly good, it all fits. The only thing missing now is more characters. Dog (ghetto Fuerte/Wolverine) seems like he could use a little work and feels hard to use beyond beginner stuff but I haven't seen good dogs to know what all is possible yet. On the other hand Roy (people say he isn't a shoto but he pretty much is, buttons are similar and his headbutt move covers the utility of both tatsu, and SRK when you EX it), Cid (footsies including a great knife jab, close frame traps, grenades setups, sort of like a Rolento type char), and Tyara (th1cc brawler/grappler mix, good range/poke buttons and an SPD) are all really solid though. Rumor is the next two characters are some kind of power ranger looking guy that is supposedly a real shoto, and a battletoad bigger brawler type. Looking forward to those and more characters later for more diversity. Otherwise even in this alpha state the actual fighting game core here and online is already really good.", "timestamp_created": 1510523065, "timestamp_updated": 1510527252, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36425864": {"recommendationid": "36425864", "author": {"steamid": "76561198124839541", "num_games_owned": 14, "num_reviews": 1, "playtime_forever": 1040, "playtime_last_two_weeks": 0, "last_played": 1514424438}, "language": "english", "review": "Punch Planet is a fighting game made BY players, FOR players. From amazing mix ups, satisfying hit confirms, incredibly fun and fast paced nuetral game, to the incredible soundtrack and attention to detail with the frames of animation; Punch Planet is just an all around fun that will keep you and your homies salty at each other for hours. Did I mention they use GGPO and have online capability? BUY THIS GAME!", "timestamp_created": 1510342207, "timestamp_updated": 1510342207, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "36418537": {"recommendationid": "36418537", "author": {"steamid": "76561198102157390", "num_games_owned": 92, "num_reviews": 2, "playtime_forever": 189, "playtime_last_two_weeks": 0, "last_played": 1510402499}, "language": "french", "review": "A bit barebone right now, especially for the price...but it's really great to play and I definitively want to see this game grows. Netcode seems ok, gameplay is really fun and I really like this retro sci-fi art style. \nIf people from Europe wants to play with me, feel free to add me !", "timestamp_created": 1510320906, "timestamp_updated": 1510320906, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36412497": {"recommendationid": "36412497", "author": {"steamid": "76561197993320375", "num_games_owned": 216, "num_reviews": 28, "playtime_forever": 1009, "playtime_last_two_weeks": 0, "last_played": 1510813478}, "language": "english", "review": "Roy is a bastard.\n\nDog is cool, hes with me.\n\nCid is the chick you don't wanna fuck with.\n\nTYara is a badass big booty mamma.\n\nOST is great, when you hear those sick synth sounds hit your ear you know fists will be flying in this Sci-Fi Fighter! Art Style is different and unique I myself love it. I know there are some people who are not fond of it but the Art Style and Sci-Fi setting sets this Fighting Game apart from the other fighters.\n\nOf course this is Early Access, the game is kinda bare bones at the moment as far as Modes and Features go but the Training Mode (Practice) is pretty in depth. Practice, Versus and Online are currently available.\n\nStory Mode, Trials, Features and more characters will be added over time. You can check the patch updates in game to see the progression that has been made so far.\n\n\nI've had a lot of fun so far, this game will only get better as time goes by. If you like fighting games you'll most likely love this indie fighter.", "timestamp_created": 1510294819, "timestamp_updated": 1510307551, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.540918", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36411984": {"recommendationid": "36411984", "author": {"steamid": "76561198095438451", "num_games_owned": 212, "num_reviews": 1, "playtime_forever": 267, "playtime_last_two_weeks": 0, "last_played": 1514463605}, "language": "english", "review": "I stumbled onto this game a few months ago, just saw it go up on Steam Greenlight, and I HAD to pick it up.\n\nIf you need convincing, I'll try to sum up what makes this so great as quickly as I can:\n\n-Amazing art style! Every character currently in the game (4 of the final 8) looks incredible, and I'm super excited to see what the other 4 will be like!\n\n-Great characters! Every character plays different, and plays fun! You've got Roy, who kind of fills the place of a shoto, by having reliable projectiles and decent all-around skills, and on the other side of the spectrum you have Tyara, a giant space-amazon, who's the giant, slow grappler, who has a level-4 720 throw super that takes off around 70% of the opponents life, which feels SO GOOD to land!\n\n-GREAT gameplay! Throw in a batch of good feeling Street Fighter-esque footsies, jump-ins, and cross-ups, mix in a whole mechanic that involves cancelling ANY move so that you can squeeze more attacks into your combo, and to top it off: Third Strike parries. What do you end up with? An AMAZING feeling fighting game, that I can see myself playing for a long-time to come!\n\nX The one negative thing I have to say about the game is that I wish there were more of it. And that's hardly a complaint, because the creators are working to put in all kinds of features: An Arcade and Story mode, more stages, and the 4 additional characters I mentioned before.\n\nI'm writing this review for completely selfish reasons, I WANT this game to succeed, because the bigger it gets, the more possible content I can wring out of it, and the longer I can play it!\n\nTL;DR\nThis game's amazing! Please give the developers, Sector-K, the support they deserve by helping them out.\n", "timestamp_created": 1510292534, "timestamp_updated": 1510292534, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36410797": {"recommendationid": "36410797", "author": {"steamid": "76561198090175410", "num_games_owned": 54, "num_reviews": 2, "playtime_forever": 52, "playtime_last_two_weeks": 0, "last_played": 1510365719}, "language": "english", "review": "Solid fighting game for anyone who is a fan of them. Still in early access so it will only get better with time. Future Punch Planet Evo finals will be hype!", "timestamp_created": 1510287156, "timestamp_updated": 1510287156, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.546436", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36410620": {"recommendationid": "36410620", "author": {"steamid": "76561198229268640", "num_games_owned": 362, "num_reviews": 4, "playtime_forever": 258, "playtime_last_two_weeks": 0, "last_played": 1513414813}, "language": "english", "review": "Super fun fighter from a small team- very deep system and awesome art direction- really looking forward to more content from this team down the line.\n\nIf you are a fan of fighting games you'll have a lot of fun with the systems in Punch Planet- Parry allows for some good comeback potential from defense and the double tap cancel mechanic allow major creativity on offense.\n\nAwesome character designs so far- especially love Roy and Tyara!", "timestamp_created": 1510286365, "timestamp_updated": 1510286365, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "36405294": {"recommendationid": "36405294", "author": {"steamid": "76561198012520056", "num_games_owned": 256, "num_reviews": 6, "playtime_forever": 2156, "playtime_last_two_weeks": 0, "last_played": 1514300790}, "language": "english", "review": "Even at only 4 characters this game is more than worth the money. The only thing holding it back right now is no ranked or matchmaking. However its still well worth it, you can find plenty of players in the PP discord and even give direct feedback to the devs on the spot.", "timestamp_created": 1510261676, "timestamp_updated": 1510261676, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.522293", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36405182": {"recommendationid": "36405182", "author": {"steamid": "76561198037211124", "num_games_owned": 106, "num_reviews": 1, "playtime_forever": 320, "playtime_last_two_weeks": 6, "last_played": 1515433618}, "language": "english", "review": "does alright", "timestamp_created": 1510261270, "timestamp_updated": 1510261270, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.473373", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36404406": {"recommendationid": "36404406", "author": {"steamid": "76561198033926465", "num_games_owned": 283, "num_reviews": 10, "playtime_forever": 828, "playtime_last_two_weeks": 0, "last_played": 1510516646}, "language": "english", "review": "DTC is easily my favourite implementation of combo extenders in a fighting game\nOnline uses ggpo and is smooth as fuck\nRoster is small but the system mechanics allow for so much creativity that you'll always be finding new ways to play with them\nArt and Music are spot-on\n\ngood video game buy it with your money $$$$\n", "timestamp_created": 1510258435, "timestamp_updated": 1510258435, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36391002": {"recommendationid": "36391002", "author": {"steamid": "76561198147367056", "num_games_owned": 33, "num_reviews": 2, "playtime_forever": 4395, "playtime_last_two_weeks": 995, "last_played": 1516441738}, "language": "english", "review": "There are many fighting games that I adore that effort was put into. This is definitely one of those games. Not only it is a love letter to older fighting games and USF4, but it has its own identity. The game has unique art style that hasn't really seen in most fighting games, great soundtrack (fucking Sugar Daddy <3), and a polish fighting engine.\n\nThe game reward plays for actually playing good! Your oppenent whiffs a button, you can actually punish them! Mess up a parry? Lose a part of your TC bar. I think that the fact that this game will keep changing and balance makes you look forward to the future. The devs listen to feedback and change appropriately. Please give this game a try! I adore this game and can't wait to see if succeed in the near future!", "timestamp_created": 1510211628, "timestamp_updated": 1510211628, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36390899": {"recommendationid": "36390899", "author": {"steamid": "76561198358639836", "num_games_owned": 30, "num_reviews": 6, "playtime_forever": 1012, "playtime_last_two_weeks": 187, "last_played": 1516261241}, "language": "koreana", "review": "아직 굉장히 초기 단계입니다. 캐릭터도 4명 밖에 없고, 아직 버그도 많이 있습니다. 그런거 쯤은 버틸 수 있다 하면은, 미국 카툰에서 볼수 있는 그림 스타일의 꽤 타이트한 대전액션 게임을 즐길 수 있을거라고 믿습니다. 시스템 자체는 타이트 하게 잘 짜여져 있고,  콤보 보다는 리셋을 조금 더 요구하는 격투게임입니다.\n\n나름 괜찮습니다, 살 가치가 충분히 있는 작품이라 생각해요.", "timestamp_created": 1510211129, "timestamp_updated": 1510211129, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36390534": {"recommendationid": "36390534", "author": {"steamid": "76561198029936364", "num_games_owned": 216, "num_reviews": 40, "playtime_forever": 144, "playtime_last_two_weeks": 0, "last_played": 1514949974}, "language": "english", "review": "It's systems from SF3 and SF4 thrown in a blender with slightly lower execution requirements and the end result is amazing even despite a 4 character roster (Will eventually make it to 8 playable characters). Anyone remotely familiar with 2D fighters will feel right at home with this.\n\n+Feels and controls exactly like you would expect from a 6 button fighter. Also shares general inputs from other fighting games like QCF, DP, and 360/720.\n+Surprisingly clean animations.\n+Flexible game systems (universal parry, one button FADC, universal shorthop, etc) allow for a lot of [b]SICK[/b] and [b]CREATIVE[/b] combos and setups.\n+Damage scaling is pretty much perfect where it is at currently.\n+GGPO netcode makes netplay buttery smooth.\n\n+-4 character roster, but those 4 [strike]characters[/strike] [b]functions[/b] are so well designed it's not even really a negative.\n\n10/10. It's a good game.\n\nPunk.", "timestamp_created": 1510209098, "timestamp_updated": 1510209098, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.613821", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36390068": {"recommendationid": "36390068", "author": {"steamid": "76561198159070530", "num_games_owned": 52, "num_reviews": 2, "playtime_forever": 341, "playtime_last_two_weeks": 0, "last_played": 1510258947}, "language": "english", "review": "This game is everything I want in a fighting game. The gameplay is right up there with any big name fighting game and honestly some of the most fun ive had with a new game in a while. I miss sf4 and this makes me feel right at home while still feeling totally new and exciting to dig into. If youre enjoy labbing things out youll be pretty impressed with training modes options (which include turning on hit boxes and hurt boxes, save/load states ect) Im so impressed with this game right now cant wait to get back out there and grind right now but I had to leave a review cause these guys deserve all the praise in the world for this game. BUY IT!!!!!", "timestamp_created": 1510206643, "timestamp_updated": 1510206643, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36387862": {"recommendationid": "36387862", "author": {"steamid": "76561198079125980", "num_games_owned": 1159, "num_reviews": 15, "playtime_forever": 1743, "playtime_last_two_weeks": 16, "last_played": 1515468433}, "language": "english", "review": "What a wonderfully fun game. The aesthetics are great, the combos are easy to do bnbs but advanced higher damage combos are very difficult and fun, Controls are responsive, netcode is great, and i write really long run on sentences. Definitely support these devs to add more content and characters.\n\n10/10", "timestamp_created": 1510195682, "timestamp_updated": 1510244734, "voted_up": true, "votes_up": 14, "votes_funny": 3, "weighted_vote_score": "0.603085", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36387328": {"recommendationid": "36387328", "author": {"steamid": "76561197999694794", "num_games_owned": 625, "num_reviews": 31, "playtime_forever": 514, "playtime_last_two_weeks": 0, "last_played": 1510625316}, "language": "english", "review": "Feels really good, like a Hybrid of some of the best FG's we've had, with system mechanics taken from SF games like Universal overhead and parries, and even move cancels like FADCs. All the chars feel great so far and the art style is good. Really worth taking a chance on if you're interested in fighting games.", "timestamp_created": 1510193105, "timestamp_updated": 1510193105, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.522293", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36387228": {"recommendationid": "36387228", "author": {"steamid": "76561198179674331", "num_games_owned": 62, "num_reviews": 19, "playtime_forever": 29, "playtime_last_two_weeks": 0, "last_played": 1513515165}, "language": "schinese", "review": "首先，这是早期版本，是提前体验的版本。就目前来说，70元绝对不值。线上模式玩不了，单机故事模式无法进入，不能和cpu对战。来说说优点：美漫画风，打击感还不错，乳摇好评，高叉泳装御姐好评，可以期待一下后期版本，目前不推荐入手，因为是早期版本，内容太少。", "timestamp_created": 1510192648, "timestamp_updated": 1510192648, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.507202", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36386775": {"recommendationid": "36386775", "author": {"steamid": "76561198059851334", "num_games_owned": 259, "num_reviews": 19, "playtime_forever": 661, "playtime_last_two_weeks": 0, "last_played": 1511581418}, "language": "english", "review": "Tiene un sistema bastante solido, la verdad como FG es un caño este juego, el online anda de 10. 0 Lag 0 disconnects por ser early access muy bien encaminado va. Recomendadisimo. Espero que no caguen a los personajes en algun update asi como estan estan re joyas y rotos todos en su estilo de juego.", "timestamp_created": 1510190407, "timestamp_updated": 1510190407, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.557340", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "36385610": {"recommendationid": "36385610", "author": {"steamid": "76561198114188682", "num_games_owned": 235, "num_reviews": 5, "playtime_forever": 642, "playtime_last_two_weeks": 0, "last_played": 1511133001}, "language": "english", "review": "commando but in girl form ✓\namazon snusnu ✓\n80s loose cannon cop that doesnt play by the rules ✓\na dog ✓\n\nFun and easy to pick up, really looking forward to the game final release along with the additional characters. If you liked street fighter 4 you should definitely give this a try. \nDevs are also really cool and down to earth people. 👍", "timestamp_created": 1510184541, "timestamp_updated": 1510184541, "voted_up": true, "votes_up": 15, "votes_funny": 6, "weighted_vote_score": "0.644678", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "36385519": {"recommendationid": "36385519", "author": {"steamid": "76561197995775959", "num_games_owned": 92, "num_reviews": 5, "playtime_forever": 2301, "playtime_last_two_weeks": 26, "last_played": 1515796288}, "language": "english", "review": "Do you like Street Fighter? You'll like Punch Planet. It takes many inspirations from both Ultra Street Fighter 4 and Street Fighter III: Third Strike. Link-based combos with some target combos, parrying, multiple supers on each character, and a freeform canceling mechanic will all feel at home with any fighting game player. Incredibly smooth gameplay along with GGPO netcode make for a great online experience.  \n\n$20 gets you 4 characters now, 4 characters by the end of 2018, and story mode/arcade mode content to follow. There's a little bit of everything for everybody.", "timestamp_created": 1510184150, "timestamp_updated": 1511469560, "voted_up": true, "votes_up": 22, "votes_funny": 2, "weighted_vote_score": "0.667491", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}}, "query_summary": {"num_reviews": 20, "review_score": 7, "review_score_desc": "Positive", "total_positive": 32, "total_negative": 0, "total_reviews": 32}}
