{"reviews": {"39225570": {"recommendationid": "39225570", "author": {"steamid": "76561198030736326", "num_games_owned": 370, "num_reviews": 46, "playtime_forever": 9, "playtime_last_two_weeks": 9, "last_played": 1515568395}, "language": "english", "review": "I would play it more, but it hurts my eyes and gives me a headache. I did enjoy the nine minutes I played of it. Might be something to look into if you enjoy tower defence games.", "timestamp_created": 1515569030, "timestamp_updated": 1515569047, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38850380": {"recommendationid": "38850380", "author": {"steamid": "76561198119322474", "num_games_owned": 107, "num_reviews": 7, "playtime_forever": 3497, "playtime_last_two_weeks": 0, "last_played": 1500048624}, "language": "russian", "review": "Надеюсь мой никому не нужный обзор побудит кого-то купить эту замечательно стилизированную игру Immortal Defence в жанре Tower defence. Возможно, по трейлерам кого-то отпугнет психоделичный дизайн, но будьте уверены, игра очень интересна в плане механики, сюжета и разнообразия. \nЧестно, мне даже не приходят на ум какие-нибудь недостатки. Игра прекрасно переведена на русский язык, музыка на уровне, атмосфера игры необыкновенная. Рекомендую брать игру по полной цене, либо по скидке, игра своих денег однозначно стоит.\nВ жанре Tower Defence:\n\nОценка 10/10", "timestamp_created": 1514620280, "timestamp_updated": 1514620280, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.528986", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38521058": {"recommendationid": "38521058", "author": {"steamid": "76561198009851282", "num_games_owned": 342, "num_reviews": 36, "playtime_forever": 22, "playtime_last_two_weeks": 0, "last_played": 1513927650}, "language": "english", "review": "Interesting story doesn't make up for an otherwise uninteresting tower defense game", "timestamp_created": 1513927873, "timestamp_updated": 1513927873, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37949693": {"recommendationid": "37949693", "author": {"steamid": "76561198100362712", "num_games_owned": 237, "num_reviews": 10, "playtime_forever": 299, "playtime_last_two_weeks": 0, "last_played": 1510966184}, "language": "english", "review": "I bought it out of curiosity but it was a lot more than i had expected.", "timestamp_created": 1512038540, "timestamp_updated": 1512038540, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500683", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37185185": {"recommendationid": "37185185", "author": {"steamid": "76561198223162884", "num_games_owned": 38, "num_reviews": 8, "playtime_forever": 69, "playtime_last_two_weeks": 0, "last_played": 1511463348}, "language": "english", "review": "I'd recommend to skip this game; there are much more polished and in-depth tower defense games out there.\n\nMy biggest problem with the game is with its presentation. It's so chaotic; so much stuff flying on the screen that you can't even see your own towers (aka \"points\"), let alone distuingish between different types of enemies or points or their levels, which points are shooting which enemies etc. It doesn't help that the path often intersects itself, making it difficult to see which enemies have moved furthest.\n\nIt also feels too fast paced, because enemies arrive so frequently and you have to be constantly manually shooting enemies with your cursor weapon and you don't get a single moment of peace to really think about what you're doing. To me, the best part of TD games is the planning. Planning where to place your towers and how to optimize their interactions. In this game you're in too much of a hurry to do everything.\n\nThe gameplay itself isn't even anything particularly in-depth. You place and upgrade points and help by manually shooting enemies. There's quite a few different types of points, so at least the game has that going for it.\n\nThere was an attempt at some kind of story but the writing was not very good and it wasn't enough to keep me interested.\n\nThe sound design in the game is also pretty bad (to the extent that I thought there was something wrong with my PC or headphones). It also lacks full screen support.", "timestamp_created": 1511466471, "timestamp_updated": 1511466471, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.519031", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36564383": {"recommendationid": "36564383", "author": {"steamid": "76561198043346855", "num_games_owned": 266, "num_reviews": 339, "playtime_forever": 335, "playtime_last_two_weeks": 0, "last_played": 1514418352}, "language": "english", "review": "Goes all-in on being weird and fantastical to deliver a wholly unique sci-fi game.  The gameplay also hasn't been done before, and though I'm not sure how I feel about it, it's certainly very challenging.  Immortal Defense is simply too special to ignore.", "timestamp_created": 1510894488, "timestamp_updated": 1510894505, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503249", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36275740": {"recommendationid": "36275740", "author": {"steamid": "76561198045284846", "num_games_owned": 338, "num_reviews": 198, "playtime_forever": 58, "playtime_last_two_weeks": 0, "last_played": 1493629935}, "language": "japanese", "review": "マウスタワーディフェンス\n買い", "timestamp_created": 1509816431, "timestamp_updated": 1509816431, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.460199", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34388248": {"recommendationid": "34388248", "author": {"steamid": "76561197996286519", "num_games_owned": 63, "num_reviews": 1, "playtime_forever": 3467, "playtime_last_two_weeks": 0, "last_played": 1504575925}, "language": "english", "review": "This game came out when I was in high school. I loved it then, and I love it now. The interesting and well-crafted story carries its simple but difficult to master gameplay onto another level. The medals and achievement system are great adds to the game for this Steam release, as they give you some additional tactical options to consider and some goals to strive for. This game is challenging, thought-provoking, and great fun.", "timestamp_created": 1503291890, "timestamp_updated": 1503291890, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500683", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34029521": {"recommendationid": "34029521", "author": {"steamid": "76561197972435489", "num_games_owned": 347, "num_reviews": 4, "playtime_forever": 46, "playtime_last_two_weeks": 0, "last_played": 1502081672}, "language": "english", "review": "I've bought this game a number of times over the years, and the old executable has traveled with me from computer to computer. A surprise then, to see that the steam version has been improved from the old game drastically; looks better, plays better, achievements, and so on. I have long been inclined to call it the best tower defense ever made, now that's certain. \n\nOne could get really wanky with the \"are games art\" argument, because while tower defense games don't normally set high bars for craft and auteurism, this game certainly does. A story more compelling than it has any right to be, interesting worldcraft, engrossing (and sometimes distracting) visuals, this game oozes care in its construction. \n\nAnd when it comes to the \"is it fun\" argument, simply a resounding yes. Excellent mechanics for a tower defense, with enough truly new and novel approaches that the same old tower defense techniques won't work just like you're used to. Add in a broad difficulty slider, new achievements, and some secrets, and there's enough game here to keep you interested for a long time. \n\nI've really liked this game for a long time, and this version is truly excellent. Buy it!", "timestamp_created": 1501904341, "timestamp_updated": 1501904341, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.471269", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33720396": {"recommendationid": "33720396", "author": {"steamid": "76561198158352871", "num_games_owned": 145, "num_reviews": 1, "playtime_forever": 20, "playtime_last_two_weeks": 0, "last_played": 1500727441}, "language": "english", "review": "I think this is the first game I reviewed or something. I liked this game very much so I have decided to write a review. \n\nThe game had followed a different approach to tower defense games, we have a cursor that shoots continuously, and we can put our shooter guys anywhere we want. It feels very flexible.\n\nMusics; a strange but nice combination. Game has jazz and classical-medieval music.\n\nIt is worth to be played if you are looking for a casual-chilling out game.", "timestamp_created": 1500728172, "timestamp_updated": 1500728172, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.476872", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33623081": {"recommendationid": "33623081", "author": {"steamid": "76561197972040704", "num_games_owned": 986, "num_reviews": 492, "playtime_forever": 420, "playtime_last_two_weeks": 0, "last_played": 1501343054}, "language": "english", "review": "If there's one strong positive that Immortal Defense nails in the tower defense genre, it's tower placement attack pattern/uniqueness. By that, I mean that most tower defense games have the fast-attacking tower, the slow-firing AoE tower, the speed-decreasing tower, etc., and the towers are very one-note and samey to all other tower defense games' towers.. In Immortal Defense, however, the towers attack in different literal patterns, sometimes apply different status effects, and all seem to have some use, depending on the map layout.\n\nIn my original review, I mentioned that there were a limited number of each type of tower you can place per level, and that you sometimes get more of the same tower, but there was no way to know if you would get them at all. The developer has been attentive and responded, informing me that most of the towers, upon getting a bunch of kills, will spawn new towers of the same type(s) getting bunches of kills, which you can then place. Also, this information is technically available in and in-game tutorial/information section, but that section was something like 15-19 pages long, somewhat buried and not pointed out as well as it should be. \n\nI think it should have at least been mentioned in one of the early levels quite clearly, since this can be a [i]crucial[/i] strategy for certain players, depending on play-style. I turned many losses and poor victories into very big successes.\n\nTower defense games often give the player something to do since the towers do much of the work. In Sanctum 2, your towers do their thing while you run about in first person, shooting at enemies inside and outside your maze. In Deathtrap, you're killing enemies Diablo-style (action RPG) while your towers do their thing. Unless you build the [i]perfect[/i] maze and/or tower placement, or have incredibly good skills, you won't succeed with only towers or only attacking yourself, but each technique is very good and useful from the beginning of each level to the end. \n\nTo continue that line of thought into less \"hybridized\" tower defense games, you're kept busy in those by upgrading your towers and placing others, keeping the strategy element going strong, often with \"waves\" of enemies with a few seconds in between to give you a breather. There is no breather on each level of Immortal Defense, upgrades are so costly that earning enough cash to buy them was rare for me, and the player interaction after hitting start, for me, solely consists of moving my mouse around pointing at enemies, and firing charged shots on occasion.\n\nThis would be alright, except that enemies' health increases the longer you go in the level, which in my opinion, is a no-no in tower defense games. Why? Imagine you're playing a tower defense where there are very specific enemy types which, at the beginning, you know how much time/how many hits it takes to kill them. If one leaks through, you can quickly go \"Oh, I need one archer tower,\" and place it, or whatever would kill it in time. In Immortal Defense, I'm pulling a number out of the air, but an enemy might have 100HP at the start of the level, but by the last minute, it has thousands of health. You lose the ability to easily gauge how easy/hard each enemy is to kill, which is the kiss of death for dealing with leaks, and this game [i]encourages[/i] you to get as close to leaking as possible.\n\nWhat do I mean by that? Well, in each level, you keep the best cash you had from the previous level, with a modifier based on how many enemies got through. That means that if you build a really good defense, you are losing out on your money for the next level, decreasing your odds of winning and getting better money. So the idea to play the game the \"best\" way is to build the bare minimum you need to succeed, and hope it's enough. \n\nBy the time an enemy leaks through, chances are it's too late to stop it, because it's late-game and you have no quick way of finding out how many hits of the shots from your cursor will kill it, or if you have time to place a new tower near the end and upgrade it, and then there's that hesitation of wondering how much money it's going to cost you to upgrade it enough to kill the baddie, and [i]then[/i] wonder if you spent too much money doing that and if it will make this attempt at the level completely wasted because you spent more money than you did the time before.\n\nThis adds a level of hesitation for me that a game of this pacing simply does not accomodate, and removes that euphoric feeling of knowing you hit the sweet spot on the towers you need, watching for a little while as your towers lay waste to incoming baddies. Instead, I found myself sitting there initially nervous, wondering if my defense was enough, giving me less enjoyment.\n\nHowever, I eventually stopped worrying and just felt bored, shift+tabbing to watch YouTube and talking with a family member in another room while the game played itself. I'd come back, see if I had success or failure, and if the latter, I would just do the same tower setup, pay for one more upgrade, hit start, and walk off again to come back in a few minutes and see how things went, because the cursor shots (player interaction) were so meaningless in my experience after the first couple of levels, even when charged.\n\nAlthough I ended up with a more positive outlook on the game than I did when I initially reviewed it, and I played through to completion of the first of six campaigns this time around, my experience was not a fun one, because I was barely playing the game, with my level of player involvement genuinely being less than a clicker game upon hitting the start button each time.", "timestamp_created": 1500355926, "timestamp_updated": 1501345797, "voted_up": false, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.705453", "comment_count": "20", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33232413": {"recommendationid": "33232413", "author": {"steamid": "76561198124949540", "num_games_owned": 10, "num_reviews": 1, "playtime_forever": 5102, "playtime_last_two_weeks": 0, "last_played": 1488374640}, "language": "english", "review": "Loved the game and the dark story behind it . Anyone that is a fan of tower defense games should definitely give this a try.", "timestamp_created": 1499177615, "timestamp_updated": 1499177615, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500683", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33065968": {"recommendationid": "33065968", "author": {"steamid": "76561197979223944", "num_games_owned": 176, "num_reviews": 9, "playtime_forever": 520, "playtime_last_two_weeks": 0, "last_played": 1486609539}, "language": "english", "review": "Great gameplay. Amazing story. If you even remotely like tower defense games, you'll enjoy this. Has a free demo version somewhere (from the devs) if you want to try it out.", "timestamp_created": 1498878922, "timestamp_updated": 1498878922, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.457726", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32797706": {"recommendationid": "32797706", "author": {"steamid": "76561197993548532", "num_games_owned": 363, "num_reviews": 48, "playtime_forever": 103, "playtime_last_two_weeks": 0, "last_played": 1498445671}, "language": "english", "review": "Interesting change of pace with the graphics. Backstory is sillier than usual and the idea of using your \"emotions\" as weapons seems gimmicky. \n\nI'm tempted to give this a thumbs down purely as a counter to the hypberbolic reviews, but it's not acutally bad, so that would be unfair.\n\nIt's a pretty good tower defence game. If you like tower defence games, you'll probably like this.\n\nGemmcraft is still better IMO.", "timestamp_created": 1498445870, "timestamp_updated": 1498445870, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.492286", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32632083": {"recommendationid": "32632083", "author": {"steamid": "76561198108762252", "num_games_owned": 102, "num_reviews": 22, "playtime_forever": 1002, "playtime_last_two_weeks": 0, "last_played": 1498012002}, "language": "english", "review": "I played this game ten years ago, when it was originally released and I thought, this game is unique. I bought again, played and enjoyed it again as a brand new game.\n\nIs so original and the difficulty can be set from too easy to OMFG this is impossible.\n\nI don't understand why this game is not considered a classic.\n\nAs another user said this is an art game. Just buy it.", "timestamp_created": 1498096412, "timestamp_updated": 1498096638, "voted_up": true, "votes_up": 11, "votes_funny": 2, "weighted_vote_score": "0.604472", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32196287": {"recommendationid": "32196287", "author": {"steamid": "76561198013986985", "num_games_owned": 144, "num_reviews": 9, "playtime_forever": 1282, "playtime_last_two_weeks": 0, "last_played": 1497095691}, "language": "russian", "review": "Лучший из известных мне Tower Defense, сравнимый по общему уровню \"интересности\" разве что с Defender's Quest. В первую очередь привлекает очень нестандартным исполнением и стилем, а также самым что ни на есть непосредственным участием игрока в истреблении врагов (ведь курсор-то наш - не просто курсор, а что-то вроде местного аналога истребителя с несколькими видами атак). Чем дольше играешь, тем больше развиваются личности местных действующих лиц, возводя сюжет на небывалую для ТД высоту. Удивительно, всё-таки, насколько большую роль при этом может сыграть сам способ подачи. Ведь по сути с нами ведут односторонние беседы, а сами персонажи олицетворены лишь неанимированными двухмерными портретами, но из этих коротких бесед и описаний между кампаниями складывается незабываемая картина с мощной философской подоплёкой, привкусом дзен-буддизма и рядом извечных человеческих вопросов.\nУровней в игре очень много (порядка сотни, если не ошибаюсь), а для особо ярых фанатов предусмотрена дополнительная кампания, призванная расставить все точки над \"и\" и открывающаяся только при прохождении всех остальных миссий без потерь. После просмотра заключительной заставки игра ещё долго не отпускает, наполняя душу впечатлениями как никакой другой представитель жанра. Горячо рекомендую.", "timestamp_created": 1496658962, "timestamp_updated": 1496658962, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.574845", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32149542": {"recommendationid": "32149542", "author": {"steamid": "76561198008426067", "num_games_owned": 55, "num_reviews": 3, "playtime_forever": 695, "playtime_last_two_weeks": 0, "last_played": 1505424986}, "language": "russian", "review": "Одна из лучших ТД. Творческий подход, интересное исполнение, интересный и не однообразный геймплей. Очень рад, что спустя много лет после выхода игра до сих пор развивается.", "timestamp_created": 1496486641, "timestamp_updated": 1496486641, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.533363", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32002425": {"recommendationid": "32002425", "author": {"steamid": "76561198075929626", "num_games_owned": 318, "num_reviews": 77, "playtime_forever": 1094, "playtime_last_two_weeks": 0, "last_played": 1496230233}, "language": "russian", "review": "Почему игру с таким крутым сюжетом так сильно недооценили? Просто что за неуважение. Комьюнити мертво (ясень пень, 56 обзоров будет вместе с моим). А в то время в игре всё переведено и даже не криво. Как ТД игра заставляет думать. Графика была бы норм для 2002, но тамошние компы не потянули бы :p. Брать по скидкам без вопросов!", "timestamp_created": 1495908581, "timestamp_updated": 1495908581, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.553081", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31961607": {"recommendationid": "31961607", "author": {"steamid": "76561197999876341", "num_games_owned": 141, "num_reviews": 3, "playtime_forever": 1765, "playtime_last_two_weeks": 0, "last_played": 1514622812}, "language": "english", "review": "Extremely niche game with weird visual and gameplay style.  Tower defense is an underused gameplay idea and most iterations of it are either one-to-one copies of centuries old custom rts maps or boring and uninspired.\n\nDoes a lot of interesting things with gameplay, levels feel meaningfully distinct besides just having different murderlane shapes, and has a Proper Story (tm) connecting the different elements of play.  It's hard to try to say what it *is* as a game when tower defense is such a wasteland of lame shit, but it's something that the developer cared a lot about and is very interesting to play through.\n\nI don't regret not finding anywhere to pirate the full game and giving the developer 5 dollars on his old site for the game, and the steam re-release seems to add enough content that it's worth paying full price for.  Art games like this deserve more success.", "timestamp_created": 1495754246, "timestamp_updated": 1495754246, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.616607", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31828114": {"recommendationid": "31828114", "author": {"steamid": "76561198164677642", "num_games_owned": 137, "num_reviews": 20, "playtime_forever": 227, "playtime_last_two_weeks": 0, "last_played": 1480343531}, "language": "spanish", "review": "Tower defense visualmente caotico, pero llamativo, la historia es extraña pero da curiosidad avanzar en ella. No innova respecto a otros juegos del mismo genero\n4/10", "timestamp_created": 1495136625, "timestamp_updated": 1495136625, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.600437", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31673234": {"recommendationid": "31673234", "author": {"steamid": "76561198007513026", "num_games_owned": 535, "num_reviews": 211, "playtime_forever": 21, "playtime_last_two_weeks": 0, "last_played": 1494453325}, "language": "english", "review": "I will say this for the game, the developer is very helpful. I experienced an issue where setting the game to full screen mode caused a blank screen. The developer tried to fix the issue but wasn't successful.\n\nNote that despite what Steam says about the game being released in 2015, this is a ten year old game.\n\nI'm a fan of TD games but this game barely qualifies, the TD elements are minimal. Lots of mouse clicking though. Not at all enjoyable for me and I doubt that full screen mode would change that.", "timestamp_created": 1494453583, "timestamp_updated": 1494453583, "voted_up": false, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.442798", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31165289": {"recommendationid": "31165289", "author": {"steamid": "76561198040884867", "num_games_owned": 1269, "num_reviews": 664, "playtime_forever": 340, "playtime_last_two_weeks": 0, "last_played": 1492220924}, "language": "english", "review": "[b][i]Immortal Defense[/i] has become my new all-time favorite tower defense game.[/b] Why? It's totally original, got a great story (which never happens in this genre), and has a great indie game feel. I will also add that the music is fantastic, and there is a ton of replay value here. At five hours in, I think I'm probably through 15% of the content. I'm not even considering the level editor.\n\n[i]Essentially, the core mechanic is the tried-and-true tower defense system, but there is a layer of abstraction that ties into the story line.[/i] Trust me that it plays *much* better than it looks in the trailer. Also beware that there is a learning curve to figure out how things work. After reading the detailed notes, you will find there is a bunch of stuff going on under the hood that you wouldn't expect (almost has that 'knowledge is power' thing going like in roguelikes).\n\n[b]Pros:[/b]\n+Totally original take on the tower defense genre - and it's all done remarkably well\n+Mouse is the only thing you need\n+So much content that it's kind of mind boggling, plus a level editor\n+Story is fresh and engaging\n+Music is outstanding\n+Runs on a toaster\n+Part 2 is in the works!!\n\n[b]Cons:[/b]\n-There is a learning curve; for the first hour I was pretty confused (and am totally still learning stuff) so I'd recommend clicking that 'confused' button in the main menu if you are scratching your head\n\n[b]Any fan of tower defense needs this in their library.[/b]", "timestamp_created": 1492291850, "timestamp_updated": 1492291850, "voted_up": true, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.762174", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31164982": {"recommendationid": "31164982", "author": {"steamid": "76561198032397651", "num_games_owned": 1475, "num_reviews": 11, "playtime_forever": 847, "playtime_last_two_weeks": 0, "last_played": 1492283784}, "language": "russian", "review": "Философский Tower Defense. \n\nБашни интересные и действительно разные. Типов врагов много, хотя их зачастую бывает и не разобрать - на экране порою творится совершенное месиво.\n\nСтоит иметь в виду, что в ходе прохождения придется, скорее всего, перепроходить старые уровни, чтобы накопить для  следующих достаточно денег. Так что требуется некоторое терпение.\n\nСюжет достаточно хорош, чтобы мотивировать на продолжение игры, и заставляет задуматься.\n\nВ целом впечатления положительные.", "timestamp_created": 1492290707, "timestamp_updated": 1492290768, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.565006", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31027483": {"recommendationid": "31027483", "author": {"steamid": "76561198049733975", "num_games_owned": 480, "num_reviews": 31, "playtime_forever": 5656, "playtime_last_two_weeks": 0, "last_played": 1491692855}, "language": "english", "review": "A unique tower defense game with psycadelic style, and an interesting story.", "timestamp_created": 1491688977, "timestamp_updated": 1491688977, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.457726", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30958333": {"recommendationid": "30958333", "author": {"steamid": "76561198263427469", "num_games_owned": 205, "num_reviews": 51, "playtime_forever": 222, "playtime_last_two_weeks": 0, "last_played": 1491387070}, "language": "english", "review": "I just can't continuing play this game.\n\nThe graphics and UI design remind me games from 80-x. It hurts my eyes. Music is annoying. Sounds effetts are terrible. The sound of attack of the main unit which repeats every ~0.4s made my ears bleed.\n\nProbably there is a really good story. Probably, there are challenging levels and a nice level design. I just can't play this game anymore because this game makes me suffer. \n\nI don't recommend Immortal Defense.\n\nUPD. I gave it a second try. Anyway, It's not my type of the game because of visuals. But i appreciate involvement of the developer to players' feedback. He seems responsible developer. That's an important trait.\n So thumbs up!", "timestamp_created": 1491387566, "timestamp_updated": 1493709677, "voted_up": true, "votes_up": 16, "votes_funny": 1, "weighted_vote_score": "0.626267", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30375536": {"recommendationid": "30375536", "author": {"steamid": "76561198091847869", "num_games_owned": 308, "num_reviews": 18, "playtime_forever": 175, "playtime_last_two_weeks": 0, "last_played": 1490629816}, "language": "english", "review": "Such an odd game, but in a good way. As a fan of tower defense games, or as this \ngame calls it pathdefence or pathspace, this is a refreshing one. The towers or \nweapons have personality and say things throughout the level. Like most other \ntower defense games you gain points, or cache, by killing enemies and use them \nto place more towers or upgrade them. \n\nProbably the most important feature of this game is how you kill, or mostly slow \nenemies down later in the game, by shooting them with your cursor. It will shoot the enemy closest to your cursor but you can click on specific enemy once to lock on \nto it. \n\nAwesome visuals, great characters, dank story. A refreshing twist on tower defense that I recommend.", "timestamp_created": 1488904757, "timestamp_updated": 1488904922, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.550132", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29978825": {"recommendationid": "29978825", "author": {"steamid": "76561197982079483", "num_games_owned": 850, "num_reviews": 118, "playtime_forever": 1224, "playtime_last_two_weeks": 0, "last_played": 1487304188}, "language": "english", "review": "Immortal Defense is one heck of a tower defense game. It has a fairly well-written story, interesting towers, and psychedelic visuals. It seems to have some trouble with balancing difficulty for the 6th chapter. It also suffers from becoming a visual mess at times when enemies and bullets are all over the screen. Still, it’s far from a traditional tower defense game which makes it worth a look if you enjoy the genre.\n\nLet’s start with the story. It’s delivered with character portraits and text at the beginning of a level. It covers a wide range of different themes including loneliness and finding purpose in life. The villains are as interesting as the protagonist’s own character development and oh boy, do you develop. You see, you were a person once, but a gargantuan invading force became stranded and started to wreak havoc in your space. You sacrificed your humanity to become an immortal “Path Defender” in order to protect your family and planet from all threats by placing towers to interfere with enemy space travel. \n\nOnly after becoming a path defender do we see the kind of toll it takes on an individual and it’s an interesting and long journey to behold. The characters that you meet along the way grow with you and the events that unfold take place on a grand scale. It’s not a Disney movie and aims to be a more thoughtful, sobering experience. It’s like a very long fable. All unlocked story bits are filed under History, just in case some of the longer levels cause you to forget what’s happening. I just wish the writing didn’t keep on driving the point home towards the end after becoming fairly obvious. It felt like the writer was saying, “Do you get it yet? Do you? Well!?” Other than that, it’s probably the best story I’ve experienced for a tower defense game.\n\nI enjoyed the different towers (Points) this game had to offer. Some of them were strange and took some learning to use. Each tower has seven levels and the last one tends to act as an ultimate form which can drastically change its behavior. For example, the Circuit Point draws a line to another Circuit Point which damages enemies that pass over it. They can also connect to your mouse cursor if it’s in range. At level 7, they have virtually infinite range and can attach to each other across entire levels. In addition to that, the medals (Achievements) that you unlock can enhance specific towers or make other changes like a faster charge-up time for the mouse cursor abilities which include bursts of bullets or gathering the bullets of your various Points into a specific enemy cluster. In the Circuit Point’s case, it’ll connect to Love Points for half-damage which can result in deadly laser grids for enemy spaceships.\n\nAs another example, the Limited Point targets the highest HP target available with a rapid fire barrage. The medal you can earn by completing a side-quest causes the projectiles of other Points to home in on targets within the Limited Point’s range. The Courage Point fires a piercing projectile with each level adding another projectile except for the seventh which causes it fire rapidly instead. Its projectiles can also wrap around the screen. These towers make you think about placement differently than other games in the genre which usually results in a fun time and one eye-melting light show.\n\nThe bullets fired from all Points, the mouse cursor, the enemy ships and projectiles, the Path lighting up, and the level being near the end all contribute their visual effects which can make upgrading towers or just seeing what’s going on difficult at times. The pause button takes you to a pause screen instead of letting you look at the map which I didn’t like. Even if you tone down the visual effects, it can still be a mess, but more manageable. Keep that in mind if you’re having trouble seeing what’s going on when there are hundreds of things on the screen.\n\nSince we’re on the topic of settings, did you know the game has an easily adjustable difficulty slider? You can make changes between levels and the game is set to 50% by default which provides a pretty smooth experience for the campaign. I had to make some severe adjustments when I started nearing the end. The last 6-7 levels of the final chapter were very difficult, even with the slider all the way to the left at 0%. Some of the side-quests were also brutally difficult. I had more trouble with those than anything else. On the bright side, there are dozens upon dozens of levels for you to conquer which resulted in around 18-19 hours to beat the game.\n\nFinally, I’d recommend hitting up the Confused? section to read the backstory. There are plenty of helpful tips in there about the game’s mechanics too which is great since some of them aren’t very obvious. I’d definitely give it a look periodically while going through the first chapter. I’d also like to revisit medals and say that I definitely enjoyed the impact they had on gameplay. You can only activate a limited amount of them at a time though which made me sad since I love obtaining obscene amounts of power, but the developer seems to favor “balance.” Psh, whatever. I should also note that the developer has been making careful updates to the game to make it more balanced and better over time which I appreciate. I was going to mention that the Endless levels were taking so long to resolve that I had to sabotage myself, but then a recent update was pushed out that solved that problem. Very nice.\n\nIf you’re looking for a non-traditional tower defense experience, Immortal Defense is a strong pick. It’s not a perfect game and the visuals might be an acquired taste, but I enjoyed the wildly different towers and the game’s plot. I hope Saturated Dreamers turns out just as well.\n", "timestamp_created": 1487316201, "timestamp_updated": 1487316201, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.633792", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29856013": {"recommendationid": "29856013", "author": {"steamid": "76561198010180682", "num_games_owned": 475, "num_reviews": 7, "playtime_forever": 590, "playtime_last_two_weeks": 0, "last_played": 1489939988}, "language": "brazilian", "review": "Immortal Defense é um jogo que eu já comprei 2x na vida. Uma no primeiro site, e uma segunda vez na Steam, e é a segunda resenha que eu faço, a primeira no meu blog independente, anos atrás.\n\nA premissa do jogo está aliada as convenções de jogabilidade do gênero e servem para justificá-las: dessa forma, a explicação de porque os inimigos são obrigados a atravessar esse caminho, e o motivo qual você pode atacá-los impunemente fazem parte de sua premissa básica - e da história do jogo. \n\nAo invés de um poderoso mago enfrentando monstros ou morador de subúrbio contra usando plantas contra zumbis, você comanda as ações de um “Path Defender”, que defende seu planeta contra as forças invasoras numa dimensão ao hiperespaço.\n\nUm dos diferenciais é você sempre tem visão completa e irrestrita do caminho e inimigos - como \"Path Defender\" e é isso que você é: cada nível é uma “linha” traçando os contornos onde seus inimigos irão transitar até atingir seu objetivo (o final da linha).\n\nSome isso a uma história intrigante que, apesar de parecer uma série de clichê de ficção científica no começo, rapidamente se prova única e engajante, ID é uma experiência que precisa ser experimentada.\n\nSe você odeia Tower Defenses, esse jogo é pra você.\nSe você ama, esse jogo é pra você.\nSe você joga e acha \"meh\", esse jogo é pra você.\n\nResumão: esse jogo é pra todo mundo.\n\nmega resumão tl;dr: O jogo é dotado de um minimalismo intuitivo e te prende tanto pela gameplay quanto a história", "timestamp_created": 1486842981, "timestamp_updated": 1486842981, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29709734": {"recommendationid": "29709734", "author": {"steamid": "76561198005094547", "num_games_owned": 502, "num_reviews": 7, "playtime_forever": 1905, "playtime_last_two_weeks": 0, "last_played": 1486267543}, "language": "english", "review": "It's a pretty interesting game; I'd strongly recommend playing it.\n\nThere's stuff to dislike about it. Some of the mechanics are tricky, invisible, hard to understand or poorly explained. The graphics effects are way overboard and make it very hard to see what's going on. There are bugs, there are wild difficulty spikes. But above it all, the levels are interesting puzzles to solve, the plot is actually quite interesting, and the various towers are quite unique and combine in neat ways.", "timestamp_created": 1486268398, "timestamp_updated": 1486268398, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.552301", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29674689": {"recommendationid": "29674689", "author": {"steamid": "76561198218245435", "num_games_owned": 257, "num_reviews": 17, "playtime_forever": 928, "playtime_last_two_weeks": 0, "last_played": 1486704518}, "language": "japanese", "review": "今のところそこそこ面白いけれどエンドレスモードはどうにかしてほしかった。\nキャンペーン１が終わったところの最初のチャレンジですが、これが本気で終わんない。\n４０分超えた所で中断しました。２０分でクリアということで強制終了させるか、\nもっと敵のインフレが急でも良かったんじゃないかなあ。", "timestamp_created": 1486145460, "timestamp_updated": 1486145460, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.564300", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29572599": {"recommendationid": "29572599", "author": {"steamid": "76561198019282214", "num_games_owned": 431, "num_reviews": 4, "playtime_forever": 779, "playtime_last_two_weeks": 0, "last_played": 1497039448}, "language": "russian", "review": "Огоньки-и-и... Чувствую себя каким-то мотыльком. Или нет, скорее каким-то глубоководным, привлечённым светом.\n\nTower Defense - он и в Африке Tower Defense (если, конечно, это не Sanctum), так что сильно оригинального ждать не приходится, но повышенная абстрактность оказалась достаточно интересна. И ей даже подведено сюжетное обоснование!\nПо отдельным деталям - графика, сюжет, музыка - игра не блещет, но в целом собирается во вполне ничего себе времяпрепровождение. На несколько вечеров потянет. \n\nУровни бы только менее затянутые, а то соорудил уже несокрушимую оборону и сидишь, гипнотизируешься огоньками...", "timestamp_created": 1485721546, "timestamp_updated": 1485721546, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.505387", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29551001": {"recommendationid": "29551001", "author": {"steamid": "76561198141499183", "num_games_owned": 197, "num_reviews": 86, "playtime_forever": 288, "playtime_last_two_weeks": 0, "last_played": 1489242655}, "language": "japanese", "review": "サンプル画像やムービーから、変則的なＴＤかな？と思ってましたが、\nサイケデリックなのは見た目だけで、中身はちゃんとＴＤしてました。\n光の線（パス）の上を敵が通るので、敵が通過するまでに撃退します。\n他のＴＤにあまりない特徴として、タワーの他にもカーソル自体で敵を攻撃できることがあります。\n敵にカーソルを近づけるとカーソルが敵を攻撃したり、\nタワーにカーソルを近づけるとタワーが強化されたりします。\nタワーの種類は、スタンダードな攻撃タイプから、レーザートラップみたいなのを張るタイプ、\nカーソル攻撃を強化するタイプなど、割と豊富です。\n\nちなみに・・・\n１ゲーム中のアップグレードはありますが、\nスキルポイントによる底上げ的なシステムはなし。\n（まだ序盤ですが）１ステージ２～５分くらい。\nステージ量はかなり豊富です。\nストーリーはしっかり作ってあります。\nプレイしてるとアーア（タイトルバックのエイリアン）が可愛く見えてくるから不思議。\n日本語対応。機械翻訳ではなく、人がちゃんと訳してます。\n\n難点として、\nサンプル画像からも分かる通り、グラフィックはかなり特徴的です。\nタワーを配置すると、画面がかなりごちゃごちゃして、何が起こってるのか分かり辛くなります。\n良く言うと派手。悪く言うと見辛い。\n\n１０００円と低グラフィックのＴＤにしてはちょっと高めですが、\nボリュームやちゃんと日本語訳してくれてることを考えると、\nコスパ的にはそんなに悪くはないんじゃないかと思います。", "timestamp_created": 1485640369, "timestamp_updated": 1485640369, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.592476", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29453637": {"recommendationid": "29453637", "author": {"steamid": "76561198044696755", "num_games_owned": 342, "num_reviews": 5, "playtime_forever": 646, "playtime_last_two_weeks": 0, "last_played": 1485558144}, "language": "english", "review": "Blissfully relaxing and hypnotic at the start... somewhere along pathspace it begins to challenge... by then you're pretty much addicted. All this coupled with an actual story, a rarity in TD type games this simple. It's a predictable, yet compelling narrative that adds a nice touch of engagement to the repetition. And the pretty colors... and the pretty lights... would probably be quite fun with recreational party favors... those years are far behind me, however... like the Dukis sunrise...", "timestamp_created": 1485223814, "timestamp_updated": 1485223814, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.530017", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28577611": {"recommendationid": "28577611", "author": {"steamid": "76561198035798418", "num_games_owned": 319, "num_reviews": 6, "playtime_forever": 1433, "playtime_last_two_weeks": 0, "last_played": 1500227774}, "language": "french", "review": "Ce jeu est une perle. J'avais joué des heures et des heures à son ancienne mouture, et je l'achète maintenant sur Steam avec plaisir. Il vaut chaque cent dépensé, sans aucune arrière-pensée.\n\nSoyons clair : je n'aime pas les towers defense habituellement. Trop mécaniques à mon goût, trop prévisibles. Mais lui... j'y reviens sans cesse.\n\nL'histoire est excellente, touchante même, les niveaux sont juste assez difficiles (difficulté customisable d'ailleurs), les graphiques ne sont pas conventionnels dans le genre, un peu psychédéliques (customisables aussi si on n'aime pas ça), la vitesse est customisable (là aussi) si on veut tester des techniques différentes sur les différentes niveaux pour les optimiser, encore et encore, la musique est extraordinaire (damn, j'ai même téléchargé la trame sonore ! Et je l'écoute de temps en temps !)\n\nQue dire de plus ? Achetez-le ! Vous ne serez pas déçu ! C'est un jeu qui mérite beaucoup plus que son succès actuel.", "timestamp_created": 1482545178, "timestamp_updated": 1482554166, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.524429", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27911562": {"recommendationid": "27911562", "author": {"steamid": "76561198046673582", "num_games_owned": 130, "num_reviews": 8, "playtime_forever": 737, "playtime_last_two_weeks": 0, "last_played": 1480302753}, "language": "english", "review": "Jesus fuck man. This is a tower defence game. Its not supposed to fuck me up this much. Buy it, and DO NOT SPOIL IT.", "timestamp_created": 1480303109, "timestamp_updated": 1480303109, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.500414", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27902359": {"recommendationid": "27902359", "author": {"steamid": "76561198044698045", "num_games_owned": 1257, "num_reviews": 14, "playtime_forever": 1084, "playtime_last_two_weeks": 0, "last_played": 1491890362}, "language": "english", "review": "A very unique tower defense game with it's own style, an interesting storyline, and many ways to build strategies.", "timestamp_created": 1480293420, "timestamp_updated": 1480293420, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.522683", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27387883": {"recommendationid": "27387883", "author": {"steamid": "76561197968355020", "num_games_owned": 860, "num_reviews": 76, "playtime_forever": 833, "playtime_last_two_weeks": 0, "last_played": 1481086800}, "language": "english", "review": "This has been a joy to play and a fun turn at the genre. Just remember, check your controls on the menu, not much of a tutorial on controls to be had (but really, you shouldn't need one, just be sure to RTFM, so to speak).", "timestamp_created": 1480052761, "timestamp_updated": 1480052761, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.546019", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27375377": {"recommendationid": "27375377", "author": {"steamid": "76561198050705438", "num_games_owned": 683, "num_reviews": 21, "playtime_forever": 1619, "playtime_last_two_weeks": 0, "last_played": 1480277989}, "language": "german", "review": "Immortal Defense besitze ich schon sehr lange. Es ist auch ein sehr altes Spiel, die erste Version kam 2007 auf den Markt, ich besitze es ca. seit 2010. Die Steamversion kam viel später und ist im Grunde genommen eine überarbeitete und aufpolierte Version des damaligen Spiels. \nWer das Spiel bereits außerhalb von Steam erworben hat, hier die wichtigsten Unterschiede:\n-Achievments, welche nicht nur toll aussehen sondern euch auch besondere Fähigkeiten im Spiel verliehen\n-überarbeitete Performance und Grafik, das Spiel sieht viel besser aus und läuft dabei noch flüssiger\n-Bonuskampagnien, die ihr freischaltet wenn ihr in der Hauptkampagnie voranschreitet\n-enorm verbessertes Balance, viele Türme wurden im Spiel überarbeitet, damit sie nützlicher sind\n\n\nNun zum eigentlichen Review. Immortal Defense ist ein Tower Defense Spiel und gleichzeitig ist es keins. Obwohl man es als \"Tower Defense\" Spiel bezeichnen kann, da es die Grundelemente jedes TD Spiels aufweist, reißt es ebenso alles hernieder, was ein TD Spiel eigentlich ausmacht.\nEs gibt Gegner, die eienn weg entlangwandern und das Ziel erreichen wollen, um euch Lebenspunkte abzuziehen, ihr baut Türme um diese abzuwehren. So weit ist noch alles normal. Aber damit enden auch schond ie Gemeinsamkeiten zu klassischen TD Spielen.\nIn ID spielt ihr einen sogenannten Path Defender, einen kosmischen Verteidiger der seinen Planeten vor einer Alieninvasion bewahren muss. Anders als in klassischen TD Spielen startet ihr komplett ohne Türme in eurem Arsenal, stattdessen seit ihr selbst, repräsentiert durch euren Cursor, die einzige Verteidigung, die euch zur Verfügung steht. Euer Cursor feuert automatisch auf nahe gelegene Feinde bis diese vernichtet sind, dann sucht er sich ein anderes Ziel. Sollte ein Gegner das Ende des Pfads erreichen, verliert ihr ein Leben. Gegner in ID kommen endlos nach, die einzige Chance ein level zu beenden ist, wenn der Timer abläuft. Dann bricht die Hyperspaceroute, die eure Gegner zum Reisen nutzen, nämlich zusammen und alle auf dem Pfad befindlichen Feinde werden zerstört.\nIm Laufe des Spiels erhaltet ihr euren ersten Turm, den sogenannten Fear Point. Türme im Spiel werden \"Points\" genannt und sidn Aspekte eurer eigenen Persönlichkeit, sie repräsentieren eure Gefühle und Gedanken. Der Far point entsteht aus der Angst, dass ihr verlieren könntet. Seiner Natur entsprechend ist er schwach und zurückhaltent, er kann Gegner kurz stunnen um euch mehr Zeit zum angriff zu lassen, er entfernt außerdem kurzzeitig die Verteidigung der gegner oder setzt ihre Fähigkeiten außer Kraft. Offensiv hat er jedoch wenig zu bieten. Der Courage Point hingegen setzt auf rohe Gewalt, er hat einen langsamen, aber sehr starken Angriff, der mit seinen Speerangriffen mehrere Gegner durchbohrt bevor er verschwindet. Sollte er das Ende des Bildschirms erreichen, weil er die gegner verfehlt hat, taucht er auf der anderen seite wieder auf. So kann er auch den gleichen gegner mehrmals hintereinander treffen, falls dieser zu langsam ist. \nNormale Spielgesetze, die ihr aus anderen TD Spielen kennt, existieren hier also nicht.\n\nWeitere Türme die später eingeführt werden, folgen diesem Rythmus. Es gibt einen Turm der in einer Spirale um sich herum feuert, aber nicht gezielt angreifen kann, es gibt eienn sich bewegenden Turm, der ziellos umherwandert und wil herumfeuert, einen turm, dessen Reichweite bei ejdem Upgarde abnimmt statt zunimmt, ein Turm, der mit jedem Kill stärker wird und ein Turm, der sich mit gleichen Türmen seiner Art verbindet und so ein Lasernetz bildet, dass durchfliegenden Gegnern schadet. Jeder Turm hat 7 Stufen, wobei die siebte Stufe eine Besonderheit darstellt, in der der Turm sein maximales Potential erhält und meist neue Fähigkeiten erlangt, so beginnt der Fear Point plötzlich panisch auf alle Gegner zu schießen und das in einer wahnsinnigen Geschwindigkeit.\n\nAnders als in anderen Tower Defense Spielen könnt ihr nicht beliebig einen Turm bauen solange irh das Geld habt. In jedem level habt ihr eine feste Anzahl von Türmen, deren Anzahl zudem jeweils limitiert ist, so könnt ihr beispielsweise 2 Courage points und 3 Fear Points haben. Mehr als diese Anzahl könnt ihr nicht bauen, allerdings können eure Türme durch das Abschießen von Gegnern mehr von ihrer Art erschaffen, die ihr dann platzieren könnt.\nEine weitere Eigenart des Spiels ist es, dass gesammeltes Geld zwischen Leveln fortbesteht. Statt einem festen Guthaben in jedem Level behaltet ihr eurer übriges Geld am Ende eines Levels plus einen Bonus für den Abschluss, dies nehmt ihr dann mit zum nächsten. Aufgrund dessen wird von der üblichen Praktik, alles Geld auszugeben, abgeraten, stattdessen sollte man gegen Ende immer einen kleinen Vorrat sich zusammensparen, den man dann mitnimmt.\nDie Gegner in ID starten zuerst wie typische TD Gegner, es gibt einen normalen Gegner ohne Fähigkeiten, einen tankigen mit viel Verteidigung, einen schnellen der durch eure Verteidigungen sprintet usw.\nSpäter kommen dann eher untypische Gegner, die anfangen eure Schüsse abzublocken oder gar abschießen, die eure türme außer Kraft setzen, die sich wild hin und her auf dem Pfad herumteleportieren nach jedem Treffer. Insgesamt ist das Design sehr gut gewählt.\n\nGrafisch macht Immortal Defense einen sehr grellen Eindruck. Der Entwickler setzt bei seinem Spiel auf leuchtende Farben, jeder abgefeuerte Schuss strahlt in einem Sprektrum und die grellen Effekte verwischen mit der Zeit ineinander. Dies kann oft dazu führen, dass man die Übersicht verliert, man sieht nicht mehr wo Gegner oder eurer Cursor ist. Zum Glück kann man diese Effekte herunterschrauben oder ganz abschalten, wer jedoch auf die Effekte steht, sollte sie so lassen. Selbst wenn man manchmal die Übersicht verliert ist das noch kein Untergang, dank Autoschussfunktion trefft ihr eure Gegner immer sofern eure Verteidigungen gut ausgelegt sind.\n\nEines der besten Dinge an Immortal Defense ist der Soundtrack. Ich kann leider nicht gut beschreiben, was ihn so gut macht, also sucht doch einfach mal auf Youtube danach und hört ihn euch selbst an ;-)\n\nImmortal Defense besitzt für ein Tower Defense Spiele ien überraschend tiefgründige Geschichte. Obwohl diese eher klischeehaft anfängt, mit euch als einziger Verteidiger gegen eien Alieninvasion, nimmt die Geschichte später sehr an Fahrt auf und wird euch am Ende sicherlich noch lange Nachsinnen lassen. Ich möchte hierbei nicht viel erzählen, da selbst die kleinste Information schon zu viel verrät. Die Erfahrung ist am besten, wenn man sie ohne Vorkenntnisse macht. \n\n\nInsgesamt ist Immortal Defense ein solides Spiel, ob man es nun als Tower Defense betrachten möchte oder nicht, es ist zumindest ein gutes Strategiespiel.", "timestamp_created": 1480045881, "timestamp_updated": 1480045881, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.542936", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "27311420": {"recommendationid": "27311420", "author": {"steamid": "76561198165660226", "num_games_owned": 1005, "num_reviews": 2, "playtime_forever": 1821, "playtime_last_two_weeks": 0, "last_played": 1480205266}, "language": "japanese", "review": "面白いです\n今セールで２９４円なのでこの価格なら買って損はないと思います\nふとした時に起動したくなるゲームです", "timestamp_created": 1480020002, "timestamp_updated": 1480020002, "voted_up": true, "votes_up": 5, "votes_funny": 2, "weighted_vote_score": "0.582014", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27117713": {"recommendationid": "27117713", "author": {"steamid": "76561197987036113", "num_games_owned": 1388, "num_reviews": 13, "playtime_forever": 964, "playtime_last_two_weeks": 0, "last_played": 1479985757}, "language": "english", "review": "A beautiful tower defense game that looks like a bullet hell chaos at first - but actually makes very coherent sense. A far more solid and complete plot than I'm used to from these as well, I thoroughly reccomend you try it.", "timestamp_created": 1479985879, "timestamp_updated": 1479985879, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.524429", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "27038188": {"recommendationid": "27038188", "author": {"steamid": "76561197972007224", "num_games_owned": 1084, "num_reviews": 10, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1457040440}, "language": "finnish", "review": "Tämä peli on klassikko ja must buy kaikille.", "timestamp_created": 1479966310, "timestamp_updated": 1479966310, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27019911": {"recommendationid": "27019911", "author": {"steamid": "76561197997524525", "num_games_owned": 1867, "num_reviews": 109, "playtime_forever": 72, "playtime_last_two_weeks": 0, "last_played": 1444401035}, "language": "english", "review": "Only you can save the multiverse from yourself.", "timestamp_created": 1479961690, "timestamp_updated": 1479961690, "voted_up": true, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.390563", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26995681": {"recommendationid": "26995681", "author": {"steamid": "76561197976032241", "num_games_owned": 827, "num_reviews": 9, "playtime_forever": 1845, "playtime_last_two_weeks": 0, "last_played": 1481000074}, "language": "english", "review": "Amazing Tower Defense game. The screenshots might make it look like some mess of a bullet hell shooter, but it's actually easy to keep track of what's going on (usually, some levels are intense).\n\nThe towers all have their own unique gimmicks, much more than the standard Fast Tower, Slow Tower, AOE Tower, etc.\n\nYour cursor shoots, so you're never sitting back waiting for the level to end, you get to be involved!\n\nThe story is weird, but believable, and there are great twists and turns.", "timestamp_created": 1479955443, "timestamp_updated": 1479955443, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500683", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26910403": {"recommendationid": "26910403", "author": {"steamid": "76561197997671919", "num_games_owned": 763, "num_reviews": 32, "playtime_forever": 3176, "playtime_last_two_weeks": 0, "last_played": 1443114472}, "language": "english", "review": "One of the most unique and compelling tower defense games I've ever played.", "timestamp_created": 1479938461, "timestamp_updated": 1479938461, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.493898", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26902448": {"recommendationid": "26902448", "author": {"steamid": "76561197965585057", "num_games_owned": 599, "num_reviews": 137, "playtime_forever": 36, "playtime_last_two_weeks": 0, "last_played": 1442373516}, "language": "english", "review": "A masterful blend of mechanics and narrative. When I talk about some of the best worlds done with story in gaming, Immortal Defense is always high on my list.\n\nMust Play.", "timestamp_created": 1479937431, "timestamp_updated": 1479937431, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.522683", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26896151": {"recommendationid": "26896151", "author": {"steamid": "76561198028117725", "num_games_owned": 136, "num_reviews": 2, "playtime_forever": 1499, "playtime_last_two_weeks": 0, "last_played": 1479932324}, "language": "russian", "review": "Хороший товер дефенс с интересным сюжетом.", "timestamp_created": 1479936661, "timestamp_updated": 1479936661, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.484189", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26864342": {"recommendationid": "26864342", "author": {"steamid": "76561197993210208", "num_games_owned": 215, "num_reviews": 10, "playtime_forever": 343, "playtime_last_two_weeks": 0, "last_played": 1467501772}, "language": "english", "review": "Oh gods. I cannot recommend this hard enough.\nThis is the best tower defense game there is, hands down.  Not for its mechanics--there are other TDs with more interesting mechanics--although ID's towers are very well desgined.  No, this one is the best because of its *story.*\n\nI'm so glad this game made it to Steam, I bought it ages ago almost before Steam existed.  It was deep, entertaining, thrilling, and compelling.  Everything about this game comes together in a way that makes any individual element absolutely neccessary: you couldn't remove one thing and have the same game or a better game, no you'd be missing a vital element.\n\nTry the demo, its pretty good, but that's basically \"Act 1\" (of four or five).  It wasn't until somewhere near the end that the story hit hard and made me go \"wow.\"", "timestamp_created": 1479933243, "timestamp_updated": 1479933243, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.554116", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26329680": {"recommendationid": "26329680", "author": {"steamid": "76561198031486819", "num_games_owned": 292, "num_reviews": 90, "playtime_forever": 186, "playtime_last_two_weeks": 0, "last_played": 1477988123}, "language": "english", "review": "I guess this game was released when it was common\nto have a printed manual... it took me a while \nto even learn how to put the game in fullscreen mode...\n\nBut after a \"Let's play\" on YT.\n\nWow!,\nThis is a GOOD tower Defense game!\nThumbs Up!\n:)\n\n", "timestamp_created": 1477888444, "timestamp_updated": 1477888444, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.524429", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25198761": {"recommendationid": "25198761", "author": {"steamid": "76561197985226368", "num_games_owned": 350, "num_reviews": 7, "playtime_forever": 497, "playtime_last_two_weeks": 0, "last_played": 1472420868}, "language": "english", "review": "Awesome alt-tower defense game.  I keep coming back to it over the years.  I even rebought it on steam just to support the dev.  Still hoping for saturated dreamers someday!", "timestamp_created": 1472363225, "timestamp_updated": 1472363225, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.521176", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24944646": {"recommendationid": "24944646", "author": {"steamid": "76561198010267364", "num_games_owned": 1009, "num_reviews": 58, "playtime_forever": 5356, "playtime_last_two_weeks": 0, "last_played": 1470004864}, "language": "english", "review": "Some of you have probably been waiting for this game to pop up. I considered about where to put it for a little while before eventually deciding to have it be at the very end. That's because, in my opinion, Immortal Defense is the best tower defense on Steam at the moment.\n\nThe peaceful planet Dukis finds itself under attack by the evil Bavakh empire, a war-faring race of red, devilish aliens. Their armadas are vast, and with no notable army of their own Dukis is no match. However, they have one trick up their sleeve: Subject K, who has volunteered to be a Path Defender, a process that involves separating his soul from his body and sending it up into space. It's unclear whether K represents one of his names, or whether he's the eleventh person they've tried this with. Once up there, K gains the ability to see the Bavakh's ships as they move through Pathspace (basically hyperspace), and the power to attack and destroy them before they reach their destination.\n\nYou control Subject K's essence in the form of the cursor, and bringing it next to an enemy will cause him to shoot at it automatically. You can also hold the right mouse button to charge up a bigger attack. That's all for the first two levels, but then you start getting access to Point's, this game's version of towers. All of them are some aspect of K's self - your first is Fear, for example, which shoots at enemies to reduce their defense and stun them. Simple enough, but that's about the only straightforward Point of the bunch. Courage will spray inaccurate, piercing shots which wrap around the screen; Pride starts off weak, but gains damage as it destroys enemies until it's powerful enough to one shot almost anything. Orthro is inexpensive to upgrade and deals splash damage, but only fires in the cardinal directions. The store description says you haven't seen towers like this in a game before, and that still holds up almost ten years after the game's release. All of them have some use, and in the late-game it feels like you're on the other end of a bullet hell shooter at times.\n\nYour enemies are also unique, and dangerous. Several of them buff others or mess with your Points' shots, requiring you to snipe them personally with your cursor's damage and other abilities. Some levels can be quite difficult thanks to them, but the game has a large difficulty slider; at zero things are pretty easy, while at maximum the levels show everything they're capable of. The game balance is designed to make you use the slider often, as the resources you have on hand to place points persists throughout levels. That's meant to encourage you to find more efficient ways of beating them rather than just spamming points everywhere, but if need be you can set a level lower and come back to it at another point; beating the previous level with higher resources changes the amount you start the next.\n\nImmortal Defense is split into six campaigns, each of which have fifteen stages, and tell a particular period of K's time as a Path Defender. I haven't talked about the stories each game has had in this series much, and that's because they're generally unimportant and not memorable. Immortal Defense's story, meanwhile, is shockingly good. In a lot of other games that premise would just be an excuse for the gameplay, but here it's examined quite thoroughly. Up in Pathspace, K has no-one to communicate with safe for brief messages from his home world, and other Path Defenders. All he knows is destruction, with the knowledge that if he fails, his home may very well be destroyed. What would an existence like that do to someone? Would they be able to stay true to why they came up there to begin with? It asks these questions with simple text at the beginning of each level, and does it well.\n\nIn the audio-visual department, Immortal Defense also excels. While only made in Game Maker, the levels have a lot of special effects and touches to them to really emphasize how otherworldly Pathspace is; the path itself will appear to bend and stretch depending on where you move your cursor, and enemies will appear transparent until you move close. The game's soundtrack is quite varied, from heroic and uplifting to quiet and mournful, and will play randomly in levels, which is neat. Throughout levels your Points will also make commentary when they destroy enemies or get upgraded by you.\n\nWith all the main levels Immortal Defense is quite a substantial game (the store says it's about twenty hours, but I think that's underestimating it quite a bit), and there are also several mini-campaigns featuring your Points which test how familiar you are with their strengths and weaknesses. Those, among many other things, unlock medals, in-game achievements that apply bonuses. Some are minor, while others, such as ones that affect Points, can give you a major advantage. I'm about finished with the game after I went back to redo levels at max difficulty, and I have about ninety hours, so it's quite a good value at ten dollars.\n\nOverall I'd say Immortal Defense is pretty close to perfect. The gameplay is enjoyable, it ties into an engaging story, it looks great despite it's age, and does a lot of unique things. I'm not sure how many people own it, but that number deserves to be much higher. Out of all the games I've talked about this month, if I had to pick one I'd recommend the most, it would be this one.", "timestamp_created": 1471305752, "timestamp_updated": 1471305752, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.592718", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24364664": {"recommendationid": "24364664", "author": {"steamid": "76561197984980428", "num_games_owned": 166, "num_reviews": 4, "playtime_forever": 5, "playtime_last_two_weeks": 0, "last_played": 1468723368}, "language": "english", "review": "Don't let my lack of time on this game fool you; I purchased and played it long before it was Steam. But once I learned that it was, the creator of the game hooked me up with a key right quick. Good guy.\n \nThis is one of my favorite indie games, and here's why. It's not because I'm a big fan of tower defense games (I am, mind you, but that's not why.) On a purely mechanical level, this game is a very unique take on the TD formula, so it's worth a try even if you're not, historically, a fan. But it's more than mechanics that make this game memorable to me. No, it's the story.\n \nImmortal Defense contains within it a phenominally-written science fiction story. Deep, intense, and positively heartrending. After completing this game for the first time, I had to go and have a lie-down to process what I just experienced. It left me completely and utterly drained in a way that few stories have before. And that, combined with the above, is why Immortal Defense is worth playing, and why it will reach deep inside of you with just four words. (When you finish the game, you'll know what those four words are.)", "timestamp_created": 1468723406, "timestamp_updated": 1468723406, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.524429", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "24225794": {"recommendationid": "24225794", "author": {"steamid": "76561198010259571", "num_games_owned": 383, "num_reviews": 37, "playtime_forever": 882, "playtime_last_two_weeks": 0, "last_played": 1468136618}, "language": "english", "review": "A truly unique game that transcends the Tower Defense genre, which I normally don't enjoy. Interesting mechanics, engaging visuals and a genuinely well-executed, thought-provoking story.", "timestamp_created": 1468137024, "timestamp_updated": 1468394764, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500683", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24053525": {"recommendationid": "24053525", "author": {"steamid": "76561197968932044", "num_games_owned": 247, "num_reviews": 5, "playtime_forever": 1635, "playtime_last_two_weeks": 0, "last_played": 1475179413}, "language": "english", "review": "I hate tower defense games. I love this game.\n\nMakes you feel good when you get an efficient design. Tons of numbers popping up, flashing lights. Really is good.\n\nGot to the end of the first chapter without knowing it thinking the game was over because I got to an endless mode and the end of the first chapter seemed wrapped up. Felt it was a tad short but not bad. Checked the chapter select screen and saw I had like 4 chapters more to go. Game does get hard and I'm not finished with the second chapter.", "timestamp_created": 1467563410, "timestamp_updated": 1467563410, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500683", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23689113": {"recommendationid": "23689113", "author": {"steamid": "76561197999363278", "num_games_owned": 1986, "num_reviews": 224, "playtime_forever": 82, "playtime_last_two_weeks": 0, "last_played": 1455519825}, "language": "english", "review": "Incredible abstract tower defense. It is extremely good. Probably even the best tower defense available in the platform.\n\nSurprisingly good story line too!", "timestamp_created": 1466529803, "timestamp_updated": 1466529803, "voted_up": true, "votes_up": 9, "votes_funny": 1, "weighted_vote_score": "0.534187", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23654139": {"recommendationid": "23654139", "author": {"steamid": "76561198166393641", "num_games_owned": 15, "num_reviews": 2, "playtime_forever": 4692, "playtime_last_two_weeks": 0, "last_played": 1510071841}, "language": "english", "review": "Simply, The Most Interesting tower defense I have ever played.\n\nThe stories are well written and slightly touching.\n\nThe gameplay are Awesome and Repetitive.\n\n\nThat's all I have to say. LOL. Anyway, The overall is Awesome and Worth of cash. ;)", "timestamp_created": 1466353116, "timestamp_updated": 1466353116, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.512722", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23637213": {"recommendationid": "23637213", "author": {"steamid": "76561197981144004", "num_games_owned": 395, "num_reviews": 9, "playtime_forever": 3170, "playtime_last_two_weeks": 0, "last_played": 1472275034}, "language": "english", "review": "It doesn't look like much, with graphics that would be more at home in a game made on the turn of the millenium, but I struggle to imagine how the bizarre setting of pathspace the game is set in could be presented another way.\n\nThis game is Tower Defence at its WEIRDEST. And this always sounds corny on reviews I read but boy is it story driven. Like, basically as advertised.\n\nGreat game to drop in and out of, the game boots quickly and each individual stage is less than 10 minutes (barring the tiny handful of 'endless' stages) and no sound-only cues, so you can play it on the fly between stuff.\n\nI'm not some kind of Tower Defence conneisseur, I've only played a handful before playing ID, but it has more space for unusual synergies and complex mechanics than any lauded TD game I've played previously.", "timestamp_created": 1466274869, "timestamp_updated": 1479979239, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.571158", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23496817": {"recommendationid": "23496817", "author": {"steamid": "76561197975632582", "num_games_owned": 666, "num_reviews": 5, "playtime_forever": 2903, "playtime_last_two_weeks": 0, "last_played": 1469854182}, "language": "english", "review": "A genuinely novel take on tower defense, and with an affecting story as well. I bought it long ago, before it was on Steam, and was only too happy to buy it again now that it's here and has a few more bits of polish added. I'm pleased to see that what I thought was an obscure little game that only a few folks knew about has actually gotten a great deal of well-earned recognition.", "timestamp_created": 1465626656, "timestamp_updated": 1465626656, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.536373", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22534471": {"recommendationid": "22534471", "author": {"steamid": "76561197995229787", "num_games_owned": 1559, "num_reviews": 10, "playtime_forever": 679, "playtime_last_two_weeks": 0, "last_played": 1475092776}, "language": "english", "review": "I put tons of hours into this game almost 10 years ago.  Best story in a TD ever.", "timestamp_created": 1461163405, "timestamp_updated": 1461163405, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.524429", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22247009": {"recommendationid": "22247009", "author": {"steamid": "76561197994701670", "num_games_owned": 278, "num_reviews": 4, "playtime_forever": 2690, "playtime_last_two_weeks": 0, "last_played": 1457249943}, "language": "english", "review": "What can I say that has not been said by others?\n\nI have forgotten what I could say.\n\nI have to keep defending.\n\nAll I am is a path defender.", "timestamp_created": 1459828859, "timestamp_updated": 1459828859, "voted_up": true, "votes_up": 4, "votes_funny": 3, "weighted_vote_score": "0.473332", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21847658": {"recommendationid": "21847658", "author": {"steamid": "76561198022669321", "num_games_owned": 569, "num_reviews": 1, "playtime_forever": 147, "playtime_last_two_weeks": 0, "last_played": 1458079877}, "language": "english", "review": "played alot of Tower defense. hey, just got home from a long day at work? brain tired but body exhausted. TD is the game then. Immortal Defense is a supprising newcomer to an older genre. Play it. buy it now, fool.", "timestamp_created": 1458023156, "timestamp_updated": 1458023156, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.494520", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21752202": {"recommendationid": "21752202", "author": {"steamid": "76561197968185576", "num_games_owned": 342, "num_reviews": 2, "playtime_forever": 651, "playtime_last_two_weeks": 0, "last_played": 1442697821}, "language": "english", "review": "I bought this game 3 times (before it was on steam, then: \"ah were is it already? Nevermind, I'll buy it again\").\n\nThis game is fantastic, and I am not sure I can exactly pinpoiny why. \nOf course I love a good and not too punishing tower defense game. But I did not expect to find such a good story there, with a great lore and an economic and mastered narration. I seldom had games that generated that much emotions, stuff I normally find in books. Except it is a game! And a good one too.", "timestamp_created": 1457635868, "timestamp_updated": 1457635909, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500683", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21688210": {"recommendationid": "21688210", "author": {"steamid": "76561198070536226", "num_games_owned": 914, "num_reviews": 57, "playtime_forever": 386, "playtime_last_two_weeks": 0, "last_played": 1458676318}, "language": "brazilian", "review": "Jogo ruim, com jogabilidade ruim, objetivos fracos e sem história nenhuma.\n\nNão recomendo", "timestamp_created": 1457367986, "timestamp_updated": 1457367986, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.391205", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21396232": {"recommendationid": "21396232", "author": {"steamid": "76561198072997539", "num_games_owned": 229, "num_reviews": 18, "playtime_forever": 639, "playtime_last_two_weeks": 0, "last_played": 1508354372}, "language": "english", "review": "This game is worth it. I _love_ this game--and I *HATE* tower defense games. That just goes to show how good it is.", "timestamp_created": 1456186784, "timestamp_updated": 1456186784, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.505798", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21143501": {"recommendationid": "21143501", "author": {"steamid": "76561198157926092", "num_games_owned": 211, "num_reviews": 29, "playtime_forever": 1549, "playtime_last_two_weeks": 0, "last_played": 1472612373}, "language": "spanish", "review": "Tuve la oportunidad de jugar este juego hace bastante tiempo. Llevaba tiempo buscandolo y afortundamente lo pusieron aqui en steam. Antes que nada, el juego centra su historia en un universo ficticio, asi que si eres fanatico de la ciencia ficcion, te va a gustar, pero se centra no tanto en temas tecnologicos, sino metafisicos, En lo personal a mi la historia me atrapo mas que el gameplay, que no deja de ser un tower defense donde te apoyas con el mouse para cazar a las naves enemigas. \n\nLos graficos, en lo personal me gustan, no son muy exigentes y se centran mas en crear una atmosfera y experiencia visual, aunque todo se desarrolla en base a lineas, vectores y graficos de pixeles tipo consola de 16 bit.\n\nLa musica me gusta mucho, siento que le falta mas variedad, pero aun asi siento que es atrapante y va muy de acuerdo con el tema del juego. No es muy movida, si no mas bien profunda y misteriosa.\n\nEl gameplay, es dinamico y solo es algo complicado de entender al principio, pero pronto lo entenderas y a pesar de todo no es un reto muy exigente, hasta ya muy avanzado el juego, pero siempre con opciones para ajustarlo.\n\nPersonalmente compre este juego, por la historia, se me hacia muy emocionante y epica, poniendote en la perspectiva de un heroe fuera de lo común, haciendo preguntarte, que sentido tiene salvar a tu planeta si ya existes fuera de el y de todo lo demas que podria afectarte. Tenia años de haberlo jugado y no dude en comprarlo. le doy un 8 / 10\n\n\n\n \n\n", "timestamp_created": 1455251211, "timestamp_updated": 1455251211, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.559648", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21093298": {"recommendationid": "21093298", "author": {"steamid": "76561198003868982", "num_games_owned": 350, "num_reviews": 1, "playtime_forever": 1340, "playtime_last_two_weeks": 0, "last_played": 1455599117}, "language": "english", "review": "A good story in a well-balanced tower defense game.\n\nThe story takes a while to get going, and you'll never see the whole thing if you're not interested in the gameplay. But the late-game twists definitely make the game worth a look. In a nutshell, the plot explores the difficulties that go along with immortality. The writing never feels particularly artificial and it's well paced with regard to the gameplay.\n\nThe gameplay can get a bit repetitive toward the end, but I think it's novel enough to keep going. Your 'points' (towers) take the names of various emotions or mental states. There are about ten points-- of those, I think that four or five are truly unique among games of this genre.\n\nYour currency carries over from level to level, so you're incentivized to perfect a level with the least possible investment. This means that there's reason to repeat levels, and if you're like me you'll find yourself doing so over and over again. There are also difficulty levels (with higher difficulty resulting in more currency), tower-specific challenges, and a badge system.\n\nOverall, I'd certainly recommend this to any fan of the tower defense genre.", "timestamp_created": 1455076911, "timestamp_updated": 1455076911, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.559023", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "21046781": {"recommendationid": "21046781", "author": {"steamid": "76561197994239085", "num_games_owned": 169, "num_reviews": 23, "playtime_forever": 333, "playtime_last_two_weeks": 0, "last_played": 1455645448}, "language": "russian", "review": "Барахло =(", "timestamp_created": 1454919121, "timestamp_updated": 1454919121, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.356133", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21002176": {"recommendationid": "21002176", "author": {"steamid": "76561198022911110", "num_games_owned": 179, "num_reviews": 22, "playtime_forever": 2101, "playtime_last_two_weeks": 0, "last_played": 1454743183}, "language": "english", "review": "Good story, good balance. The difficulty ramps up a bit slow in the first few levels, but by the end of the game you really have to understand what you're doing.\n\nI encountered a few crahses in my playthrough, but overall it was well worth the cash.", "timestamp_created": 1454780463, "timestamp_updated": 1454780463, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500683", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20856205": {"recommendationid": "20856205", "author": {"steamid": "76561198113873641", "num_games_owned": 350, "num_reviews": 35, "playtime_forever": 347, "playtime_last_two_weeks": 0, "last_played": 1454119092}, "language": "english", "review": "Sin ser fanatico del genero, debo decir que me gusto mucho este juego, 100% recomendando.", "timestamp_created": 1454184431, "timestamp_updated": 1454184431, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500683", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20677835": {"recommendationid": "20677835", "author": {"steamid": "76561197993895427", "num_games_owned": 110, "num_reviews": 1, "playtime_forever": 1491, "playtime_last_two_weeks": 0, "last_played": 1455083295}, "language": "english", "review": "One of the best stories ever told, the slow loss of sanity perfectly pictured.", "timestamp_created": 1453467024, "timestamp_updated": 1453467024, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.506829", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "20622631": {"recommendationid": "20622631", "author": {"steamid": "76561198038663307", "num_games_owned": 141, "num_reviews": 16, "playtime_forever": 1345, "playtime_last_two_weeks": 0, "last_played": 1484531609}, "language": "english", "review": "Its not the best TD on steam, but its better then most. I can easily say this is well abouve average.", "timestamp_created": 1453207447, "timestamp_updated": 1453207447, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.506829", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19756683": {"recommendationid": "19756683", "author": {"steamid": "76561198257876013", "num_games_owned": 3, "num_reviews": 1, "playtime_forever": 11191, "playtime_last_two_weeks": 0, "last_played": 1509850281}, "language": "english", "review": "When I first found this game, I torrented it because I was thirteen and I didn't have a credit card. Since then it has become an oddly constant presence in my life, and try as I might, after some 400 hours between this steam version and the old  pay-what-you-can original, I've never quite gotten sick of it. It's the kind of game that always has you sitting at your desk waiting to get home to play that one level slightly differently with that new strategy you just thought of. I paid 10 dollars for this one, but I should have paid 50.", "timestamp_created": 1450405410, "timestamp_updated": 1450405551, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.525377", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19753005": {"recommendationid": "19753005", "author": {"steamid": "76561197995262032", "num_games_owned": 410, "num_reviews": 2, "playtime_forever": 1921, "playtime_last_two_weeks": 0, "last_played": 1450204884}, "language": "english", "review": "TL;DR: Immortal Defense is the one of the best, if not the best game in the tower defense genre.\n\nID is extremely well designed, the towers (called points) are diverse such that each type fills a particular niche, and the gameplay is compelling and challenging. For example, you amass the resources you spend to build points by beating stages. When you start a stage, you can decide the difficulty at which you would like to attempt the stage. Increasing the difficulty makes the stage harder, but also increases the amount of resources you earn by completing the stage. Playing the stage at a lower difficulty is useful for advancing the story and unlocking new abilities. There is no strategic disadvantage to playing stages at a lower difficulty, as you can go back after the fact and replay those stages at a higher difficulty. Rewards that you earn will be retroactively applied to your current resources, if they are higher than your previous high score on that stage.\n\nThe game has really interesting visuals, resembling some sort of psychadelic screen saver when all the effects are turned on. The soundtrack is similarly interesting. The background music is mostly a moody and dark orchestral score. The different types of points and enemies have unique sound effects when they interact. The combination of these causes particularly busy stages where you build a lot of points to sound like the product of some mad composer. The story is also compellingly weird, and there were times I found myself motivated to complete stages in order to discover more of the narrative (which trickles in bit by bit at the beginning of each stage).\n\nI don't know if Immortal Defense was a labor of love, but it definitely feels like a lot of time, thought, and effort has been spent on refining it. If you're a fan of the tower defense genre, you'll definitely enjoy Immortal Defense.", "timestamp_created": 1450386618, "timestamp_updated": 1450386618, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.559886", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19722476": {"recommendationid": "19722476", "author": {"steamid": "76561198000445135", "num_games_owned": 1516, "num_reviews": 7, "playtime_forever": 2269, "playtime_last_two_weeks": 0, "last_played": 1477932137}, "language": "english", "review": "Immortal Defense was a contemporary of Desktop TD and Bloons TD. It may have been the first tower defense game to have a developed story to justify the gameplay, including exactly why the enemy is always moving on a set path and unable to destroy the towers.\n\nThis updated version offers fixes for modern systems and enhances the gameply with unlockable bonuses.", "timestamp_created": 1450230070, "timestamp_updated": 1450230070, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.568966", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "19668159": {"recommendationid": "19668159", "author": {"steamid": "76561198050309236", "num_games_owned": 166, "num_reviews": 3, "playtime_forever": 642, "playtime_last_two_weeks": 0, "last_played": 1448459487}, "language": "english", "review": "top gun", "timestamp_created": 1449986157, "timestamp_updated": 1449986157, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.462581", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19339040": {"recommendationid": "19339040", "author": {"steamid": "76561197996271398", "num_games_owned": 588, "num_reviews": 31, "playtime_forever": 896, "playtime_last_two_weeks": 0, "last_played": 1480008461}, "language": "english", "review": "Really good story, oddly enough, and superb gameplay with actual challenge make this one of the best Tower Defense games of all time. Just be sure to tune the graphics setting down to about 30% otherwise you won't be able to see anything on screen - too much explosions and random noise.\n\nedit: doing it for the cheevo during the Steam Awards Winter Sale. Nothing's changed. This game is still awesome.", "timestamp_created": 1448728252, "timestamp_updated": 1480008880, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.546056", "comment_count": "3", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "19141150": {"recommendationid": "19141150", "author": {"steamid": "76561197974548899", "num_games_owned": 372, "num_reviews": 1, "playtime_forever": 191, "playtime_last_two_weeks": 0, "last_played": 1447831785}, "language": "english", "review": "Absolutely amazing. It's not the prettiest game in the world, nor does it have the most revolutionary gameplay, but it goes where no other Tower Defense has dared go before. Please, don't let this game escape from under your radar. I freely admit that I cheated through the last few levels because the gameplay was getting in the way of my story, and I was dying to see what happened next.", "timestamp_created": 1447832202, "timestamp_updated": 1447832202, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.523610", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19032419": {"recommendationid": "19032419", "author": {"steamid": "76561198043385216", "num_games_owned": 501, "num_reviews": 43, "playtime_forever": 339, "playtime_last_two_weeks": 0, "last_played": 1447347041}, "language": "spanish", "review": "Un juego interesante si te gustan los de Defensa de torres. Tiene una buena trama y la manera de plantear el juego es original. Además es largo, tiene cromos y muchos logros.\n\nLo peor: la traducción al castellano es bastante mala.", "timestamp_created": 1447335755, "timestamp_updated": 1447335755, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.524429", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18630932": {"recommendationid": "18630932", "author": {"steamid": "76561198035809038", "num_games_owned": 179, "num_reviews": 18, "playtime_forever": 90, "playtime_last_two_weeks": 0, "last_played": 1439385782}, "language": "english", "review": "Immortal Defense is a complex yet rewarding tower defense game. The story is unusual and i would go as far as to say the best i have seen/read in a tower defense game to date.\n\nOnce you understand the gameplay mechanics and what the \"towers\" do this game comes into its own, its fast, furious and fun all at once.\n\nThe visual style is great yet simple and some of the particle effects are mesmerizing! The music is really great too, I especially love the hub screen music!\n\nHighly recommended", "timestamp_created": 1445550730, "timestamp_updated": 1445550730, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.537757", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18471672": {"recommendationid": "18471672", "author": {"steamid": "76561197975656323", "num_games_owned": 1256, "num_reviews": 8, "playtime_forever": 609, "playtime_last_two_weeks": 0, "last_played": 1445068742}, "language": "english", "review": "Great story, solid gameplay. I bought this a few years back and it's good to see it on steam and still getting patched!", "timestamp_created": 1444837442, "timestamp_updated": 1444837442, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.524429", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18316041": {"recommendationid": "18316041", "author": {"steamid": "76561197984641741", "num_games_owned": 317, "num_reviews": 10, "playtime_forever": 1070, "playtime_last_two_weeks": 0, "last_played": 1444521876}, "language": "english", "review": "As strange as it might seem, you'll be playing this one for the story. A very compelling tale that truly deserves the word \"epic\".", "timestamp_created": 1443912625, "timestamp_updated": 1443912625, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.524429", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18268224": {"recommendationid": "18268224", "author": {"steamid": "76561197968056472", "num_games_owned": 874, "num_reviews": 10, "playtime_forever": 3190, "playtime_last_two_weeks": 0, "last_played": 1491757449}, "language": "english", "review": "Immortal Defense is an amazing tower defense game that's only gotten better over the years.  It's has a very unique story along with beautiful motion visuals and hours of great gameplay.  Instead of plotting through mazes, enemies are taken along a pre-set line, and you must use a series of incredibly diverse and cooperative towers to dispose of the various waves.  Like many other modern tower defense games, your player (cursor) also plays a big role, except this was added before the feature was common, yet still has more complexities and uses than the others.  Additionally, the story is probably the best ever in tower defense, there are plenty of levels and challenges, and it now has added badges/achievements to obsess over, which give you significant in-game bonuses along with bragging rights.\n\nI really don't have anything negative I can add about it.  There is a demo around somewhere if you'd like to try it first, but it's easily worth the full price.", "timestamp_created": 1443646643, "timestamp_updated": 1443646643, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.550317", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18243621": {"recommendationid": "18243621", "author": {"steamid": "76561197985224081", "num_games_owned": 92, "num_reviews": 1, "playtime_forever": 205, "playtime_last_two_weeks": 0, "last_played": 1425446049}, "language": "english", "review": "Honestly one of the best tower defense games ever made (I don't think anybody can claim to have played all of them - but I would argue that it is *the* best). Compulsively playable, tons of levels, with a gorgeous psychosurreal aesthetic and a genuinely good narrative - it elevates the TD form to true art. This is the kind of game you start playing at 10 PM and stop because the sun came up.", "timestamp_created": 1443489726, "timestamp_updated": 1443489726, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504438", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "18235737": {"recommendationid": "18235737", "author": {"steamid": "76561197995991847", "num_games_owned": 574, "num_reviews": 1, "playtime_forever": 5843, "playtime_last_two_weeks": 0, "last_played": 1514987092}, "language": "english", "review": "Decently fun tower defence game, story drew me in well enough. Gameplay is quite creative and you're actually involved enough as a player that it doesn't feel like you're waiting inactivly after the towers are placed.\n\n The game does bog down slightly towards the end once you've gotten every variety of tower and most enemies have been introduced, especially noticeable in the very end campaign. The variety of both towers and enemies up until that point kept the game very fresh, it's certainly a game I would recommend giving a go if you have the time, certainly if you're a fan of the genre; It does have the distinction of being the first tower defence game I have actually played for a decent amount of time and finished. \n\nA final mention is that I quite liked how achievements were handled, actually getting something concrete rather than a useless note on your game profile.", "timestamp_created": 1443449390, "timestamp_updated": 1443449390, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.529143", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18086626": {"recommendationid": "18086626", "author": {"steamid": "76561198001678779", "num_games_owned": 117, "num_reviews": 2, "playtime_forever": 33, "playtime_last_two_weeks": 0, "last_played": 1442596623}, "language": "russian", "review": "Игра довольно хороша, но через пол часа игры меня стошнило :(\n10 эпилептических препадков из 10.", "timestamp_created": 1442597125, "timestamp_updated": 1442597125, "voted_up": true, "votes_up": 4, "votes_funny": 16, "weighted_vote_score": "0.446405", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18070750": {"recommendationid": "18070750", "author": {"steamid": "76561198002481729", "num_games_owned": 380, "num_reviews": 5, "playtime_forever": 429, "playtime_last_two_weeks": 0, "last_played": 1442523132}, "language": "english", "review": "Great story.\nI played this game a long time ago. Even now it's still one of the best tower defence game I have ever played.", "timestamp_created": 1442498147, "timestamp_updated": 1442498147, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.546019", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18034662": {"recommendationid": "18034662", "author": {"steamid": "76561197993717768", "num_games_owned": 423, "num_reviews": 17, "playtime_forever": 1553, "playtime_last_two_weeks": 0, "last_played": 1497291472}, "language": "english", "review": "Yeah, it's tower defence, and yeah, the trailer and screenshots are all kinds of 'I have no idea what's happening here' [Edit: I think the trailer's been updated and is clearer now], but trust me on this: if you like TD, this is a no brainer. If you don't like TD it's still absolutely worth a look.\n\nIt's not only my favourite tower defence game, but it's one of my favourite games, full stop. I loved it back in 2009 when I first played it and this new Steam version comes with a raft of improvements over the original, hence why I'm playing it again. It still holds up beautifully.\n\nIn Immortal Defense, you have given up your world and physical body to become an immortal defender in 'pathspace', a dimension above phasewarp. There, you are but a ghost to the Bavakh, one of the most tyrannical races in the galaxy, who are using hyperspace to attack your home planet Dukis. As a path defender you focus aspects of your will -- fear, love, courage, pride, precision and others -- to form 'points' (the towers of ID) to stop the Bavakh. This is how the game begins, but it's far, far away from where it ends.\n\nSo what makes it special? It's many things. It's the haunting story, the turns it takes and the themes it deals with. It's the hugely inventive and unusual towers. It's the way the mouse pointer is used as its own tower; shooting, charging shots and synergising with other towers in powerful and unexpected ways. It's the kaleidoscopic visuals, the warbling, droning sounds and the crystalline shattering of enemies as they bleed and streak light across the screen. It's the strange enemy designs and their unusual abilities. It's the rousing and understated soundtrack. It's the many challenging levels (and the new challenge stages which restrict what towers you can place, encouraging you to use them more effectively). It's the little things like kill counts per tower so you can gauge how effective your layouts are, or the recycle value of a tower degrading over time so a quick placement mistake won't punish you-- and mass end-of-level-selling won't help. It's your cache rolling over from one level to the next to encourage efficiency. It's the endless simulated assaults bookending each chapter, testing what you've learnt and ultimately determining how much cache you start the next chapter with. It's the level editor and the bundled fan levels, the detailed in-game manual, the leaderboards (if you're into that kind of thing), the ability to slow down time when things get manic (or speed it up if your line's holding)... and more.\n\nAt £6.99, or $10(ish), it's an absolute steal for a game this unique, heartfelt, evocative, clever, challenging and brimming with content.", "timestamp_created": 1442258076, "timestamp_updated": 1472582878, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.564945", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "18008224": {"recommendationid": "18008224", "author": {"steamid": "76561198000942568", "num_games_owned": 417, "num_reviews": 30, "playtime_forever": 445, "playtime_last_two_weeks": 0, "last_played": 1448224723}, "language": "english", "review": "Very different than other Tower Defense games that I have played. It takes a little getting used to, but it is worth the effort of learning the game. Incredibly fun and very deep strategically. \n\nI have enjoyed it even more than Gemcraft and it is almost as good as Defender's Quest (the best tower defense game on Steam!! <grin>)", "timestamp_created": 1442110358, "timestamp_updated": 1442110358, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.551105", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "17991152": {"recommendationid": "17991152", "author": {"steamid": "76561198022343811", "num_games_owned": 432, "num_reviews": 2, "playtime_forever": 292, "playtime_last_two_weeks": 0, "last_played": 1442179886}, "language": "english", "review": "Fancy graphics like Defense Grid 2? No.\nHalf-FPS like Sanctum? No.\n\nExcellently made combination of story, TD, and direct interaction with the field? Yes.\nBuy it, it was a great tower defense before steam, and now it has even more greatness!", "timestamp_created": 1442020777, "timestamp_updated": 1442020797, "voted_up": true, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.574796", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17964853": {"recommendationid": "17964853", "author": {"steamid": "76561198012597716", "num_games_owned": 1797, "num_reviews": 67, "playtime_forever": 1143, "playtime_last_two_weeks": 0, "last_played": 1442040738}, "language": "english", "review": "A fantastic, abstract tower defense game.", "timestamp_created": 1441856749, "timestamp_updated": 1441856749, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.472145", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17946404": {"recommendationid": "17946404", "author": {"steamid": "76561197999616683", "num_games_owned": 469, "num_reviews": 13, "playtime_forever": 756, "playtime_last_two_weeks": 0, "last_played": 1446070366}, "language": "english", "review": "\"Wa-a-a-it a minute, is this another one of those tower defense games? How many of them do we really need?\" - you're probably asking yourself at the moment. Why yes, indeed, it IS a tower defense for PC - a platform already chock-full of various games of the kind. You might have already played Defense Grid, spent some evenings grinding Defender's Quest, maybe partied in the co-op mode of Dungeon Defenders with a couple of friends... So, why waste time on yet another game of an exhausted genre?\n\nTo put it shortly - yes, we do need Immortal Defense. Right off the bat - when playing ID, you're not just an omnipresent authority figure (c), you ARE the guy who actually shoots stuff in top-down perspective. That little mouse cursor on screen that lets you build your towers? That's you right there, or rather your soul, personification of your willpower - whichever you prefer. It's the embodiment of a player in the game, and one of the signs of its unorthodox approach - combining the control mechanics with the actual gameplay, making the player a major part of the action while removing any unnecessary medium. Very few games do this (\"Brothers: A Tale of Two Sons\" comes to mind, check it out when you can), and to see this from a \"mere\" tower defense? Not bad, not bad at all.\n\nBut then we move beyond the interface and controls and look at the game itself, and... Geez, is that a plot segment I see in-between the missions? Some kind of a mystic space opera? Why do I even need a plot in a tower defense game? It boils down to shooting unremarkable enemies throughout a hundred of levels anyway, right? Right?... Well, not in this case, it doesn't. From the very beginning the game makes you feel responsible - you are not just a figure behind a computer desk, consolidating some defense force around your planet. You have been chosen to leave everything you knew behind and transcend into a new form of being - the form no one really knows much about. It's the sacrifice you made for your loved ones - and each message from them, received after successful battles, reassures you in the righteousness of your task. To become a god of space between worlds, to be the last hope of your home planet - what's not to like?\n\nAnd yet, the Universe operates on a different level, and not every action has clear consequences. Concentrating your will to create needle-sharp \"points\" - your line of defense against the invading armies - you fail to notice how decades after decades run by. The Universe is engulfed by war, and there's little time for you to think of what the future holds for you when you finally turn homewards. But when you do... will there really be home to return to?\n\nThere are many other beings like you, created with the same mission in mind - to protect, to defend, to repel. And yet, as you soon realize, not everyone can bear the centuries of loneliness. For that matter, can you?..\n\nBut the transcended existence has its own benefits - with each passing day, your memories shatter, but your will gets stronger. Learning more and more advanced techniques, assembling more and more powerful points, you manage to overcome the limitations of spirit once imposed upon you. What lies beyond? Will it be paradise for those who rely on you... or will you only descend deeper into hell?\n\nTo put it shortly, Immortal Defense is not an easy game to review. The controls and mechanis are closely intertwined with gameplay, and the gameplay itself depends heavily on the story. There are no decisions per se, no roads to take, but the final result still doesn't disappoint - in the very end it feels like you walked your own path, made your own choices. Complicated relationships with your family's descendants and the ones who you once thought your enemies only make it harder to progress, and the game itself becomes more and more complex with each mission, never forgetting to introduce yet another enemy pattern or some dimensional trick to keep you off guard. Overcoming those and using every available ability to your advantage - that is the measure of a true Ghost of the Path. And trust me, with the Steam release, the game has obtained a LOT of new shiny toys for you to experiment with, as well as a real sense of an almost RPG-like progression - just take a look at all the bonuses that achievements and medals provide!\n\nI first played ID when it was released years ago, and I still play it to this very day. With each playthrough, I feel as if I learnt something new - not just about the game, but about myself, too. Is there anything else to wish for? Well, maybe some cool graphics effects and nifty tower designs - in which case you'll find those here aplenty. ;) Happy hunting, Great Ghost! And never forget where you came from.", "timestamp_created": 1441735442, "timestamp_updated": 1441735451, "voted_up": true, "votes_up": 32, "votes_funny": 2, "weighted_vote_score": "0.767434", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17922730": {"recommendationid": "17922730", "author": {"steamid": "76561197970728510", "num_games_owned": 82, "num_reviews": 2, "playtime_forever": 1079, "playtime_last_two_weeks": 0, "last_played": 1502481720}, "language": "english", "review": "1.6 Hours on record here are my thoughts:\n\nThe acid trip style graphics have always been something that draw me into games rather than turn me away so I immediately launched it and looked for the settings so I could max those out.\n\nOverall this is a really good game.\n\nThere are some elements to it that make it appear definitively as an Indie title if you get my meaning : Inconsistent production quality with graphics, unorthodox audio, etc.\n\nBut instantly, you, like me will know that these are not the defining aspects of this game, these are merely the first impressions.\n\nI finished the first 16 missions and played a little bit of the first mission in the 2nd of 6 campaigns. I haven't experienced much of the story, but already I can tell this is an intriguing gem you would be remiss not to check out! I'll be savoring it.", "timestamp_created": 1441598861, "timestamp_updated": 1441598861, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500683", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "17903897": {"recommendationid": "17903897", "author": {"steamid": "76561197993562581", "num_games_owned": 340, "num_reviews": 4, "playtime_forever": 550, "playtime_last_two_weeks": 0, "last_played": 1459920066}, "language": "english", "review": "The first and still the best Tower Defense game to weave expert storytelling with solid gameplay and a beautiful soundtrack.  Place towers along a curving path and assist your towers during each wave with your own ship-cursor's regular and high-power shots.  Many towers react with each other, or with your own attacks to deepen the gameplay.  Each level has an evocative introduction that casts new light on what you're doing.", "timestamp_created": 1441502964, "timestamp_updated": 1441502964, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.528169", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17840366": {"recommendationid": "17840366", "author": {"steamid": "76561197994439950", "num_games_owned": 868, "num_reviews": 18, "playtime_forever": 583, "playtime_last_two_weeks": 0, "last_played": 1441481134}, "language": "english", "review": "At this point, I'm likely to ignore something that's described as \"a tower defense game.\" There are a lot of them out there, and many don't ultimately have much to offer. But Immortal Defense is an exception, and I'll likely use this new version as an excuse to play through the game again. \n\nImmortal Defense has a unique style, engaging mechanics, and an evocative story. You might not expect the writing to be a strength in a game of this type, but that's one of the elements that set Immortal Defense apart. \n\nI'm also looking forward to Studio Eres's other upcoming release [i]Saturated Dreamers[/i].", "timestamp_created": 1441159311, "timestamp_updated": 1441159311, "voted_up": true, "votes_up": 13, "votes_funny": 1, "weighted_vote_score": "0.570132", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17838882": {"recommendationid": "17838882", "author": {"steamid": "76561197993176986", "num_games_owned": 609, "num_reviews": 3, "playtime_forever": 540, "playtime_last_two_weeks": 0, "last_played": 1441505515}, "language": "english", "review": "Immortal Defense is one of those games that transcends its mechanics genre to become something unique and breathtaking.\n\nID is not strictly a tower defense. You don't have trenches dug out of a generic landscape where waves of mindless sprites throw themselves forward. Every aspect of this game has personality and purpose.\n\nYou are doing yourself a disservice if you do not try this game.", "timestamp_created": 1441150661, "timestamp_updated": 1441150661, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.524429", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "17822983": {"recommendationid": "17822983", "author": {"steamid": "76561198008775203", "num_games_owned": 693, "num_reviews": 92, "playtime_forever": 1330, "playtime_last_two_weeks": 0, "last_played": 1479936944}, "language": "english", "review": "A highly recommended classic of the genre, unlike any other and updated for the modern era. It's challenging, deep, and thought-provoking, with a very interesting setting and world. The gameplay is very simple to learn and pick up, but brutally hard to master, and unique in the genre, or maybe period: It does a lot of original, unusual things. A game with many great features and few if any flaws.", "timestamp_created": 1441078894, "timestamp_updated": 1479936517, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500683", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17822145": {"recommendationid": "17822145", "author": {"steamid": "76561198024976479", "num_games_owned": 368, "num_reviews": 121, "playtime_forever": 2155, "playtime_last_two_weeks": 0, "last_played": 1441074386}, "language": "english", "review": "Whether you're new or old to tower defense games, Immortal Defense is a good buy. With tons of unique mechanics but still holding together what makes a good tower defense a good tower defense, and on top of that all a great story considering it's a game where you're shooting geometrical shapes flying on a line... Immortal Defense is amazing for what it is.\n\nIn Immortal Defense, you play as a Pathspace Defender whose goal is to defend your home planet by literally becoming a god and shooting invisible hellbeams from another plane of existence at people who are invading you. You do this by what else- placing towers! While the story and gameplay get more complicated than that (and bring all sorts of delightful twists and turns), that is the basic premise to the game.\n\nIf you're new to the game, you might be pleasantly surprised by the gameplay and strange quirks it has. Each tower is more unique than the usual tower defense tower, with every single one having completely original properties and not just \"the splash damage tower\" and \"the one that shoots fast\". Not only that, but you have a stake in the action as well; you use your mouse cursor to charge up attacks and interact with some of the attacks of your nearby towers to efficiently take out harder enemies. The strategic depth of the game gets pretty crazy later on, with enemies you have to pinpoint and \"snipe\" with your cursor or else they'll buff other enemies to the point of being unstoppable. You'll also find that although the story starts out a bit slow it picks up very fast and perfectly placed cliffhangers keep making you want to play more.\n\nIf you're a returning player, why buy the steam version? The non-steam version is currently pay what you want on the site (unless it's been taken down). The steam version has all kinds of great new features, from almost doubling the length of the base game with side missions and campaigns to giving you permanent \"upgrades\" sort of by completing weird challenges to make the notoriously harder levels a tiny bit easier. Not only that but there is a more in depth graphical system (with widescreen support finally) and leaderboards/steam workshop integration so you can play other people's levels that they made with great ease.\n\nSo would I recommend Immortal Defense? With an overwhelming response, yes. It is one of, if not the best and most unique tower defense game I have ever played and the story is also seriously great (even though it can come off as trying too hard a time or two). For 9-10 dollars this game absolutely deserves to be checked out.\n", "timestamp_created": 1441073064, "timestamp_updated": 1441073064, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.570648", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17818273": {"recommendationid": "17818273", "author": {"steamid": "76561197962339114", "num_games_owned": 849, "num_reviews": 7, "playtime_forever": 1495, "playtime_last_two_weeks": 0, "last_played": 1442284932}, "language": "english", "review": "Immortal Defense is a pretty interesting tower defense game. It touches on some odd topics for a video game but it sure made me think about things that very few games can manage.\nThe story itself is pretty enjoyable and the game takes awhile to run through. So it is a decent investment on time I found. With six different plot lines that take place over sixteen missions a piece. And a bit of extra content if you can find it. It certainly kept me occupied for awhile.\nIt follows the adventures of an almost unnamed protagonist as he becomes his worlds only defense against an alien menace in what they call \"Path Space\" Which feels a lot like hyperspace, to me. And that's what it plays as, it is a short cut from point A to point B in space. And you are there, looking down at the ships trying to venture through. And this gives you a severe advantage over them. But in this state you are incorporeal, and seperate from your body. Time passes differently. How do you handle this, all the presure of so many lives depending on your constant vigiliance and being seperated from everyone you know and love. The story touches on this in many ways. And also friendship and betrayal as well. But I'll leave those for you to discover.\nIt's also quite atmospheric and charming. I haven't seen any tower defense games where your towers talk to you and have their own personalities. It's very interesting to see what all they have to say as you play the game. And how they respond to the things happening o nthe screen.\n\nOne of the things I like most about Immortal Defense  though is the music, it really draws me in and makes me feel there, in the moment and I think grabbing the soundtrack is worth the price of admission by itself. But that's just me.\nMusic aside, the visuals are another strong trait the game has, falling somewhere between a rave and some sort of bizzare drug trip, they are certainly something to see. Though on higher settings might be a bit much for some people of more frail constitution. But that is easily adjusted on the main screen via slider.\n\nAnyway, This is a game that I absolutely adore and have played through multiple times. Twice for fun and once to get to the secret stuff! Worth the money I spent, way back before it got on steam. And I will be buying it again now, for friends to enjoy!\nOverall, I would say, if you like tower defense games, or games that touch on philisophical things, this would be a very strong buy. The musics and graphics are great, for the games age, and it is really more about the aesthetic amyway, at least that's how I feel!\n\nDisclosure: Studio Eres provided me with an advance copy of the Steam version for the purposes of play testing and review.", "timestamp_created": 1441052532, "timestamp_updated": 1441052532, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.586481", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17817310": {"recommendationid": "17817310", "author": {"steamid": "76561198000153336", "num_games_owned": 284, "num_reviews": 1, "playtime_forever": 66, "playtime_last_two_weeks": 0, "last_played": 1457601893}, "language": "english", "review": "This is a very unique and good tower defense game.\n\nThe story is really good, and the towers really are unlike towers in all the other tower defense games I have played.\n\nMy game will seem a bit low because most of what I played was from a older verson that came before the game was put here on steam. \n\nThe game's dev is nice too for giving people who had a older verson of the game a chance to get a steam key if they can find something like their order information or email that shows they did in fact own it before.", "timestamp_created": 1441048428, "timestamp_updated": 1441048428, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500683", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17816325": {"recommendationid": "17816325", "author": {"steamid": "76561197990437197", "num_games_owned": 1918, "num_reviews": 3, "playtime_forever": 2355, "playtime_last_two_weeks": 0, "last_played": 1501617763}, "language": "english", "review": "This is an absolutely fantastic little tower defence game.\nIt's mechanically sound and the tower interactions (and limitations) lend themselves to requiring interesting strategies on most of the later levels. It's never a case of \"the slow tower + the aoe tower\" always assures victory.\nLet's be honest though there are hundreds of tower defence games out there so what sets this on apart?\nThe story.\nThe story is a fantastic exploration into what it means to be immortal and explores such themes as loneliness, betrayal and insanity. It's astoundingly deep content to have in a game of this genre.\nIt's hard to say any more without spoiling the experience so just go play it yourselves!", "timestamp_created": 1441044378, "timestamp_updated": 1441044378, "voted_up": true, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.575878", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17815927": {"recommendationid": "17815927", "author": {"steamid": "76561197971521788", "num_games_owned": 335, "num_reviews": 16, "playtime_forever": 167, "playtime_last_two_weeks": 0, "last_played": 1441068326}, "language": "english", "review": "I find it difficult to put into words how I feel about this game but here is my best attempt.\n\nIn 2007 (2008?) I was beginning to gain interest in, \"indie games.\" One of the games that I saw was the most highly acclaimed was Immortal Defense, reborn on Steam after 8 years. \n\nI was never very good at tower defense games, and to be honest I'm still not good at them. Back then I tried to get through as much of the story as I could (on difficulty 00 never the less) but I think my brain stopped being able to handle it around the half way point of chapter 3. The game is difficult and can take a lot of thinking to fully understand. Part of this is because there doesn't seem to be an, \"optimal,\" strategy for each level. There are ways that don't work, but especially later on you can figure out many different ways to beat them. I ended up cheating my way through a lot of the game from that point. Sorry Paul, I did it back then and I might have to do it again. I'm just not clever enough for your later levels.\n\nThe visuals, while simplistic, make up for it in terms of color, style, and how fitting they all are. The game looks really damn nice now. Still simple, but even more juiced up with all kinds of interesting effects.\n\nThe music can range between infectious and grand with some great melodies but you can definitely hear that it was a bit of a budget affair. I spotted some midi bass that seemed out of place.\n\nBut the real thing that makes Immortal Defense so special to me was its story and how it affects the gameplay. You play K, a person who has given up his body to defend his home world from invaders, detacting himself from the physical world to defend it from pathspace. K left all he loves physically - but not mentally. In pathspace, K uses parts of his being, mainly his emotions manifested into towers to destroy enemies in pathspace. They speak out in the middle of the game with character, making the battlefield feel alive.\n\nK's journey is a philsophical one that tackles a lot for a game: what matters to a person, what drives them, what the nature of reality is, what the nature of truth is, how powerful you can become and how it influences others, and how it would be like to live alone, forever in a place away from any mortal eye. \n\nThe writing is very well done. It is never these huge philosophical rants, rather the characters give you information and story through the use of subtle phrases that you can put a lot of thought into.\n\nNot only that, the levels range from abstract to very purposely made symbols that represent what is happening in the game.\n\nThe point is: The story and mood of Immortal Defense seems into every crevice of the game. Every element in the game seeks to bring you into the story of K. His story is a hypothesis on what might it be like if you, the player, were to embark on this grand journey a million years long.\n\nI finished the game long ago in 2007 (2008?) early in the morning. It made me think about my own place in the world, made me feel profound emotions and has given me a quote to live by to this day. Rethinking about the game gives me chills and to this day fills me with the feelings of...I can't really put them into words.\n\nMaybe it was me being naive and being sensitive. I'm a sensitive guy, what can I say? But this is my experience from the game. Even if no one else feels the way I did, this game hit me hard and inspired me in many ways.\n\nWhen you have nothing left, you must create your own reasons for existening. Some people cling to the past, others surround themselves in their own creations. \n\nHere are two quotes that have stayed with me all these years.\n\n\"There's one thing you can rely on in this universe: being as wrong as often as you are right. So whether you're right or wrong -- Be exceptional at it. That's morality.\"\n\nand \n\n\"I love you grandpa.\"\n\nThank you Paul and the rest of the developers behind Immortal Defense. I'll never forget this.", "timestamp_created": 1441042686, "timestamp_updated": 1441043246, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.571722", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "17815314": {"recommendationid": "17815314", "author": {"steamid": "76561198012486220", "num_games_owned": 338, "num_reviews": 24, "playtime_forever": 89, "playtime_last_two_weeks": 0, "last_played": 1449605968}, "language": "english", "review": "This is the best tower defense game on Steam. If you like Immortal Defense you'll like this game.", "timestamp_created": 1441040107, "timestamp_updated": 1441040107, "voted_up": true, "votes_up": 0, "votes_funny": 5, "weighted_vote_score": "0.444965", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17813863": {"recommendationid": "17813863", "author": {"steamid": "76561197996908322", "num_games_owned": 1290, "num_reviews": 1, "playtime_forever": 16, "playtime_last_two_weeks": 0, "last_played": 1441033329}, "language": "english", "review": "While there are no shortage of tower defense games in the steam marketplace, if you enjoy the genre then you should give this one a go.\nThe visuals and story feel like an old sci-fi serial, with nonsensical names and trippy colored backgrounds creating a vibrant space as you play, the tower types each add their own personalities into the story... it all works pretty well to keep you engaged.\nThe cursor acts as a tower as well, firing a steady stream of damage that gets larger as the round progresses, allowing you to prioritize the enemies at your door instead of feeling helpless.\nThe tower types are fantastic though, with firing patterns that match their personalities and they cause you to think about where they should be placed to maximize effectiveness which is one of the tennants of TD as a whole.\nOverall, this game is well priced for the experience, has a ton of customization and creativity involved (Custom levels and diffficulty settings) and is chock full of enjoyable content.", "timestamp_created": 1441034136, "timestamp_updated": 1441034136, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500683", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17812785": {"recommendationid": "17812785", "author": {"steamid": "76561198002691647", "num_games_owned": 306, "num_reviews": 10, "playtime_forever": 630, "playtime_last_two_weeks": 0, "last_played": 1508386662}, "language": "english", "review": "One of the best and most unique games in the Tower Defense genre. The story and gameplay mechanics are thoughtfully melded together, the towers are each unique and fun to use, and your mouse cursor attacking enemies gives you something to do during waves without too much pressure.\n\nThis steam rerelease modernizes the graphics a bit along with making the game work at all with newer versions of Windows. For some reason the options are set to extremely low graphical fidelity and you can almost definitely enable maximum on every setting on whatever computer you have today. The UI looked dated when Immortal Defense was originally released, and it unsurprisingly still does, but that's a very minor quibble that you won't even notice after a few levels.", "timestamp_created": 1441029622, "timestamp_updated": 1441029622, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.544248", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "17811879": {"recommendationid": "17811879", "author": {"steamid": "76561197962500440", "num_games_owned": 584, "num_reviews": 17, "playtime_forever": 8521, "playtime_last_two_weeks": 0, "last_played": 1507131202}, "language": "english", "review": "I purchased the original version of Immortal Defense quite a long time ago, and I'm glad that it has finally made its way to Steam. ID is one of the best Tower Defense style games I have ever played.\n\nOn a mechanical level, the towers are not the formulaic set you find in most other games. You know, the \"weak but fast\" tower, the \"long range and slow\" tower, the \"splash damage\" tower, etc. You won't find that here. Each of the towers has vastly different behaviors, making you think more carefully about placement. Behavior can change as you upgrade them, and they can also interact with your cursor as well (which is a weapon in its own right).\n\nThe game is also very challenging - experienced Tower Defense players will be tested here. But, the difficulty can be adjusted along the way, so if it's just too hard, you can dial the difficulty down a bit - for the one level you're having trouble with - and come back to it later if you want.\n\nVisually, Immortal Defense is fun. This is an older game but it still looks great. It's somewhere between a dream, a laser light show, and an LSD experience all rolled up into one. The visuals can also be dialed up and down as needed, though, so if it is too much for you, you can get back to a more \"sane\" experience. I recommend keeping on the higher side.\n\nThe music is great too - it has a delicate, mystical quality that fits very well with the art style.\n\nGenerally, tower defense games have at most a token storyline, something that is easy to throw away and ignore. But Immortal Defense delivers here, too - taken as a whole, the story of Immortal Defense gets into some interesting philisophical questions about immortality, good and evil, what is really important, etc. The towers (called Points in the game) come out of the story, and their names and functionality are drawn out of it as well. \n\nIt might be a bit too cerebral for a lot of people, but it won't interfere with the gameplay.\n\nFor the Steam version of the game, there are new challenges that you can complete for additional bonuses during gameplay. There is also a leaderboard.\n\nOverall, I rate this as a very strong buy for anyone who enjoys the Tower Defense genre and is looking for something a little different. Visuals aside, I put ID on the same level as other TD greats.\n\nDisclosure: Studio Eres provided me with an advance copy of the Steam version for the purposes of play testing and review.", "timestamp_created": 1441025678, "timestamp_updated": 1441025678, "voted_up": true, "votes_up": 78, "votes_funny": 0, "weighted_vote_score": "0.853505", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 98, "total_negative": 6, "total_reviews": 104}}
