{"reviews": {"39318635": {"recommendationid": "39318635", "author": {"steamid": "76561198150803506", "num_games_owned": 52, "num_reviews": 7, "playtime_forever": 1334, "playtime_last_two_weeks": 143, "last_played": 1515872790}, "language": "english", "review": "I'm a big fan of animes like Ranma 1/2 and this game was right up my alley. It was very entertaining and though there is little interactivity in this visual novel game, I enjoyed it nonetheless. Though this game ended with so many unanswered questions. I'm not sure if they plan to make a sequel or if I'm supposed to play through the game again and accomplish things differently (ie. choose a different love interest, etc.) One thing I didn't like about this game and this is trivial mind you, is that this game has spelling and grammar errors popping up every now and then. Either way, I enjoyed this game and I recommend it to everyone to give it a try. I also hope that they make a sequel so we can see more and possibly answer any questions that this game has yet to answer.", "timestamp_created": 1515873232, "timestamp_updated": 1515873232, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38201555": {"recommendationid": "38201555", "author": {"steamid": "76561198164928401", "num_games_owned": 46, "num_reviews": 2, "playtime_forever": 1437, "playtime_last_two_weeks": 103, "last_played": 1516218868}, "language": "english", "review": "max's big bust is by far the best experience i've had with a visual novel so far.\nwith a full cast of like able characters, funny scenes, and an actually interesting plot on top of all the great relationship stuff. this game is so much fun, theres alot of genuinly funny scenes that made me laugh out loud and not many games can do that for me. the sound is great, the visuals are great, the backgrounds are great, i could only ever wish to be as talented in art as the art lead for lached up games, Doku Denpa. other then maybe 1 unlikable character for me and some minor pet peeves this game was perfect.\n", "timestamp_created": 1512887109, "timestamp_updated": 1512887109, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36258787": {"recommendationid": "36258787", "author": {"steamid": "76561198337191660", "num_games_owned": 41, "num_reviews": 17, "playtime_forever": 820, "playtime_last_two_weeks": 0, "last_played": 1510301515}, "language": "english", "review": "Its a good vn game\nthe characther is uniqe,the story is fun to read,puzzle section is a bit confusing\ni would rate it 8/10", "timestamp_created": 1509765377, "timestamp_updated": 1509980717, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34540998": {"recommendationid": "34540998", "author": {"steamid": "76561198194269286", "num_games_owned": 65, "num_reviews": 5, "playtime_forever": 725, "playtime_last_two_weeks": 0, "last_played": 1504124485}, "language": "english", "review": "nice game, really funny story.", "timestamp_created": 1503874992, "timestamp_updated": 1503874992, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.488506", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33843460": {"recommendationid": "33843460", "author": {"steamid": "76561198018188854", "num_games_owned": 76, "num_reviews": 1, "playtime_forever": 762, "playtime_last_two_weeks": 0, "last_played": 1501336864}, "language": "english", "review": "so far im really enjoying the game and i look forward to more games by this studio", "timestamp_created": 1501197181, "timestamp_updated": 1501197181, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.459290", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33825331": {"recommendationid": "33825331", "author": {"steamid": "76561198304489224", "num_games_owned": 91, "num_reviews": 3, "playtime_forever": 1088, "playtime_last_two_weeks": 0, "last_played": 1493934517}, "language": "english", "review": "I'm really wanted to recommend this game. I really like some aspects of it.\n++ The music is really good, to the point that I actually left the game open to listen to it while doing other things.\n+ About the first third of the game was good. The characters interacted well, the story was good, the jokes were alright (not personally my cup of tea, but fine), and the little investigation puzzles you did were a rather nifty.\n\nThere were also things I personally liked, but I think some people would be mixed on. \n+/- While I personally was not bothered with it, I can see some people really not liking the art in this game. The backgrounds are perfectly fine, but those characters. It's a generic animu style, complete with nonsensical proportions and bad shading.\n+/- The game also has some animations, which I find is another mixed point. The also has that animu style, except now instead of being poorly shaded, it has wonky physics and for some reason has Japanese voice acting. The Japanese is handwaved in game, but that doesn't make less odd. While it is rather cool that the developer included these scenes, I would have been perfectly fine with them being left out.\n+/- Another mixed point in this game is the player's input within the story. Your actions in the game don't change anything about the ending, they only change which character/s you end up with. However, to make up for this, the game has several puzzles, each increasing in difficulty. While I found the puzzles a nice tradeoff, I can see people really not liking the lack of player induced change. Also, while almost all of the puzzles were good, I found the very last puzzle more tedious then challenging.\n\nThere was even something that, while I personally didn't like it, I could see someone else liking it.\n-/+ The CGs in the game I did not like at all. They, for me, crossed that line from being animu but fine to looking like DeviantArt trash. Proportions were completely off, to the point that Max's spine looked broken in most of them. Sometimes the characters in the CG looks little to nothing like the characters that are meant to be in them. However, if you can look past those two things, then they are rather nicely detailed, colored, and shaded.\n\nHowever, there was one thing that made this game unbearable. [spoiler]Around the point that Max's apartment flooded/burned[/spoiler] or about 1/3 of the way through the game, the entire thing became completely unenjoyable. I enjoyed this part the game so little that everything wrong with the game at that point was a major issue.\n- What happened to the humor? It turned from a mix of deadpan, referential jokes with a mild hit of random/stupid humor to being [b]entirely[/b] random and stupid with the occasional deadpan joke thrown in. This got to the point where there is an entire sequence where the only thing going on and the only joke occurring is that Max thinks that a cardboard cutout is really a person. Why did you do this? I at least found the first part's humor harmless. Now I just want to hit all of the characters (well, mainly Max).\n- [spoiler]Also [b]why is everyone sexing[/b]? Max, Brad, and Ethen will no matter who you’re going for, as do Holly and Ember, and Victoria and obvious villain number 1. I have no qualms with multiple relationships at once, no that's not the issue. First off, if you go for Brad/Ethen, you have to have a scene with the both of them, and if you go for Holly/Ember/Victoria, you have to have the scene with Ethen and Brad. So, I hope you wanted Max to get with Ethen and/or Brad. Second, while Max/Brad/Ethen was hinted at, and Victoria's was hinted at, Holly/Ember is not, leading me to believe that their scene was added as fan service. Thirdly, all of these events happen/ are repeatedly brought up at in the same sequence, which makes them all really off putting no matter what.[/spoiler]\n- Because of the two points above, all of the characters are ruined, as they do basically nothing else.\n- The entire story is also frequently derailed due to this.\n- The ending contains a not really twist that I predicted.\n- The very ending contains a stupid joke they decided to make an animation for because...reasons.\n\nDue to the latter portion of the story, I cannot recommend this game. The good parts are mostly ruined by the bad. If you can get the game for ten dollars or less, then it might be worth it, but even that's a stretch.", "timestamp_created": 1501136526, "timestamp_updated": 1504249831, "voted_up": false, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.658105", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33736302": {"recommendationid": "33736302", "author": {"steamid": "76561198160204240", "num_games_owned": 30, "num_reviews": 9, "playtime_forever": 1734, "playtime_last_two_weeks": 0, "last_played": 1514713041}, "language": "tchinese", "review": "this game is somthing but i think need in my oppinon that it should show some charaters from the other game but overall it was ok wasn't the best but should have show wat happenes later  lets see if there a continuation hope there is this game is god grafic are good but animation need some work but its fine", "timestamp_created": 1500785854, "timestamp_updated": 1500785854, "voted_up": false, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.519685", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33439709": {"recommendationid": "33439709", "author": {"steamid": "76561198043807220", "num_games_owned": 225, "num_reviews": 5, "playtime_forever": 1543, "playtime_last_two_weeks": 0, "last_played": 1500280212}, "language": "english", "review": "I really enjoyed this game. Its seems a little pricey for a VN but its got tons of content and well worth the price. Its also got great humor, fun and likeable characters, and an interesting story. The investigation gameplay puzzles are also alot of fun. Overall just a really high quality and fun VN. One of the best i've played.", "timestamp_created": 1499717585, "timestamp_updated": 1499717585, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32800239": {"recommendationid": "32800239", "author": {"steamid": "76561198130711570", "num_games_owned": 27, "num_reviews": 1, "playtime_forever": 1516, "playtime_last_two_weeks": 0, "last_played": 1498501859}, "language": "english", "review": "Pros\nPretty cute visual novel.\nNice art.\nFun story.\nMemorable characters.\nHot characters.\nIn depth story.\nSkip function.\nLI matters in details. ^^\n\nCons\nAnime scenes are scarce.\nAnime scene quality is not as good as art.\nMore romance scenes with LI.\n\nThe game is pretty awesome. Just wish there was more... T_T especially the romance scenes.", "timestamp_created": 1498451841, "timestamp_updated": 1498451841, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.576939", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32757761": {"recommendationid": "32757761", "author": {"steamid": "76561198019172944", "num_games_owned": 617, "num_reviews": 12, "playtime_forever": 498, "playtime_last_two_weeks": 0, "last_played": 1486826947}, "language": "english", "review": "It's a cute visual novel. I use that term advisedly, because that's what it is. It's not a game, per se. It's a story with a set beginning and a largely concrete end. There are puzzles, and objectives, but it's only a question of doing them well or doing them poorly. You can't skip them.\n\nSo, what's here that's worth your time? The art is quite good. I understand it may not be to everyone's tastes, but I enjoyed the artistic direction of the project. The writing is excellent, though slightly slapdash at parts. The animation, when there is animation, is top notch. The characters are strong and well-defined, except when they aren't, which is usually for the sake of humor. \n\nThere is one gag towards the end that relies both on the static animation and the fact you probably haven't given a particular character much thought that I thought quickly redeemed whatever flaws there were here, so I'm certainly pleased. It's a fast game, if you let it be. You could easily get sucked into the writing and spend hours at each decision point, trying to obtain more of it.\n\nNow, a few words about the... let's say content, might not go amiss here. Yes, it involves a full-scale magical sex change. Two, in fact. The story, insofar as it takes a stance, could also be described as sex positive. There's a great deal of sexual content and innuendo. Outright nudity? That I didn't see, though that's not to say it's not there. You can tell at a glance  up therewhat the usual 'level' might be.\n\nSoundtrack is... basic? Very basic? It seems to be largely stock music, and it was probably the weakest part of the game for me. Since there's no speaking outside of the animated sequences, you could easily play with the speakers off and your own music on. I'm not going to recommend that, but it's something you could do.", "timestamp_created": 1498370128, "timestamp_updated": 1498370128, "voted_up": true, "votes_up": 21, "votes_funny": 0, "weighted_vote_score": "0.731616", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32498598": {"recommendationid": "32498598", "author": {"steamid": "76561197988569311", "num_games_owned": 441, "num_reviews": 12, "playtime_forever": 889, "playtime_last_two_weeks": 0, "last_played": 1497787405}, "language": "english", "review": "I bought this game out of whim. The entire experience was something i never would guessed. Emotional rollercoaster that started with laughs and chuckles, turning into few \"this is cute\" moments.\n\nDepending on the route you play, there is tons of things i think are great. And things i would rather never wanted to see/read.\n\nOverall the story of the game is great aside few points where you are forced to take apart of story-elements that are honestly stomach turning disgusting. But that is just my own personal opinion of course.\n\nI still recomend this game for people who likes unique concept and ideas as well occasional laughs.", "timestamp_created": 1497690846, "timestamp_updated": 1497690846, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.545872", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32231500": {"recommendationid": "32231500", "author": {"steamid": "76561198124256299", "num_games_owned": 66, "num_reviews": 5, "playtime_forever": 1824, "playtime_last_two_weeks": 0, "last_played": 1489878067}, "language": "english", "review": "I was given this game as a sort of deal.  My friend and I decided to get each other visual novels because why the heck not.  I get them Nekopara Vol 2, and they got me this.  Despite the very weird nature of this game, I managed to enjoy this game for all it was worth.  I was able laugh at the TG (initials for transgender) elements in the game (it's meant to be funny I swear, they use that joke more than once), able to respect the other modified ladies in the game (bunny girl, fish girl, etc), and I was able to get into the story that was given.  It takes place in Australia and has a rather funny plot about drug investigations, magical forces, elemental people and other crazy stuff of that nature.  It also has a feature in which you can hook-up the main character (who recently went from male to female) with characters in the story through certain decisions (you have a police man, a lesbian otaku, a bookworm, a redhead and a mystery man), and has some fun (albeit repetitive) investigation sections as to spice up the visual novel and overall have you do more.  In summary, it's very weird, should never be played in public, and is very anime at the end of the day.  Seriously though, keep this game hidden from people, you will be judged harshly for playing this.", "timestamp_created": 1496803787, "timestamp_updated": 1496803787, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.533184", "comment_count": 0, "steam_purchase": true, "received_for_free": true, "written_during_early_access": false}, "32075082": {"recommendationid": "32075082", "author": {"steamid": "76561198115610931", "num_games_owned": 208, "num_reviews": 5, "playtime_forever": 601, "playtime_last_two_weeks": 0, "last_played": 1508010455}, "language": "english", "review": "I had an issue with the executable and it not launching so I got in contact with Lached Up games and they gave me some of the best customer service I have had in a long time. Before this issue I had beaten this game and I really enjoyed I really recomend it.", "timestamp_created": 1496192571, "timestamp_updated": 1496192571, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.556136", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32004758": {"recommendationid": "32004758", "author": {"steamid": "76561198072190312", "num_games_owned": 119, "num_reviews": 5, "playtime_forever": 1471, "playtime_last_two_weeks": 0, "last_played": 1503592402}, "language": "english", "review": "doesn´t realy feel like a game, mostly you klick throu endless conversations on which u have no influence, the only choices you can make are with wich person you spend lunchbreakes or a day off. in investigations you have to klick throu all options untill u have all information and its resolved automatically. i was realy excited, but it feels more like you are watching a movie during which you nonstop have to read subtitles.", "timestamp_created": 1495915988, "timestamp_updated": 1495915988, "voted_up": false, "votes_up": 10, "votes_funny": 2, "weighted_vote_score": "0.266050", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31908312": {"recommendationid": "31908312", "author": {"steamid": "76561198110955313", "num_games_owned": 366, "num_reviews": 7, "playtime_forever": 1407, "playtime_last_two_weeks": 0, "last_played": 1495488777}, "language": "english", "review": "Awesome story, great humor and nice music.\nThere weren't that many animated cut scenes as I hoped for, but it didn't make the game bad or anything.\nSome of the characters look quite weird but the game is aware of it.", "timestamp_created": 1495489199, "timestamp_updated": 1495489199, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.516085", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31821750": {"recommendationid": "31821750", "author": {"steamid": "76561198024408014", "num_games_owned": 479, "num_reviews": 3, "playtime_forever": 1483, "playtime_last_two_weeks": 0, "last_played": 1512844557}, "language": "english", "review": "I loved this game. Even had tears of joy and sadness at the very end. I wish it had more romantic scenes with your love partner but apart from that - it is really good. There aren't a lot of that impressive visual novels in steam with such amount of work and attention to details.\n\n9/10.", "timestamp_created": 1495114432, "timestamp_updated": 1495114432, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.508311", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31337606": {"recommendationid": "31337606", "author": {"steamid": "76561198044081173", "num_games_owned": 97, "num_reviews": 3, "playtime_forever": 5, "playtime_last_two_weeks": 0, "last_played": 1482983420}, "language": "english", "review": "daggerwav.wav has changed my life forever", "timestamp_created": 1493034153, "timestamp_updated": 1493034153, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.422637", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31325821": {"recommendationid": "31325821", "author": {"steamid": "76561198082476943", "num_games_owned": 263, "num_reviews": 1, "playtime_forever": 885, "playtime_last_two_weeks": 0, "last_played": 1486958564}, "language": "english", "review": "one of the best VN i`ve played.  keept me guessing as to what was going to happen until the end", "timestamp_created": 1492971915, "timestamp_updated": 1492971915, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502036", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30694535": {"recommendationid": "30694535", "author": {"steamid": "76561198012273110", "num_games_owned": 148, "num_reviews": 17, "playtime_forever": 1342, "playtime_last_two_weeks": 0, "last_played": 1497016547}, "language": "english", "review": "I've only just started this one and already it has gotten me laughing hard enough to hurt.\nIf you're able, read the words as they come up on screen. Some lines that come out of nowhere will crack you up.", "timestamp_created": 1490310087, "timestamp_updated": 1490310087, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.566327", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29928892": {"recommendationid": "29928892", "author": {"steamid": "76561198120348301", "num_games_owned": 873, "num_reviews": 389, "playtime_forever": 920, "playtime_last_two_weeks": 0, "last_played": 1487018580}, "language": "english", "review": "I thought that this was going to be a silly game with gender swapping, but I’m glad I was (partially) wrong. Yes, there’s a lot of fan service, but honestly, Max’s Big Bust is a good visual novel. You solve mysteries and you can romance one of the other characters (women and men), and the dialogue between the characters is pretty funny some times. \n\nI liked the fact that the game makes fun of itself; not in a tiring way that at some point you get annoyed (at least in my opinion), but in a legitimately funny way. Everything can happen here, the universe of this story is totally crazy together with its characters.\n\nThere’s the animation too. Some scenes were actually animated into a short anime, and I found that amazing! [spoiler]Also, the “after credits” nearly made me choke of laughing, now I want to see a zombie version of Dancing Guy in another game.[/spoiler]\n\n9/10, I highly recommend if you want a visual novel with more gameplay, and if you really want a \"non sense comedy\" to read and have fun.", "timestamp_created": 1487106929, "timestamp_updated": 1487106929, "voted_up": true, "votes_up": 32, "votes_funny": 1, "weighted_vote_score": "0.790072", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29813664": {"recommendationid": "29813664", "author": {"steamid": "76561197995820083", "num_games_owned": 1170, "num_reviews": 642, "playtime_forever": 1295, "playtime_last_two_weeks": 0, "last_played": 1487573272}, "language": "english", "review": "Even though it looks like it's just another boob VN, Max's Big Bust actually has a nice amount of content in its bosom. There are a few parts where you actually get to do what can be loosely considered police work, talking to suspects and doing goofy Phoenix Wright-style hijinks to catch criminals, there's a poor imitation of a pet raising game on your phone, and there's even random trivia games placed everywhere they could fit one. The story is pretty good, and the budget seems higher than most similar games, including having a few animated cutscenes (though it seems like they were animated by a Japanese studio, so the dialogue is in unsubtitled Japanese explained in-game by a joke, but the dialogue isn't that important in the scenes that have it) and subjectively good art - most of the art is pretty well-drawn, and the characters who have questionable poses or designs get mocked by the other characters pretty often so it feels more like the game is laughing with you. One route of the game took me 15 hours to finish, and I doubt the other romance paths will take as long but that's still a pretty good length for an Australian VN to me.", "timestamp_created": 1486689046, "timestamp_updated": 1486701381, "voted_up": true, "votes_up": 14, "votes_funny": 1, "weighted_vote_score": "0.572993", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29778160": {"recommendationid": "29778160", "author": {"steamid": "76561197982554752", "num_games_owned": 32, "num_reviews": 13, "playtime_forever": 3611, "playtime_last_two_weeks": 0, "last_played": 1488036628}, "language": "english", "review": "YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH YEAH", "timestamp_created": 1486546801, "timestamp_updated": 1486700143, "voted_up": true, "votes_up": 3, "votes_funny": 10, "weighted_vote_score": "0.321675", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29773838": {"recommendationid": "29773838", "author": {"steamid": "76561198068098174", "num_games_owned": 357, "num_reviews": 5, "playtime_forever": 1407, "playtime_last_two_weeks": 0, "last_played": 1508375712}, "language": "english", "review": "One of the most well-developed and well-written Visual Novel-esc games I've played in a long time.\nIt does have a few themes that might turn some off (Gender Bending, People with Animal Ears and Tails, a Slimegirl) but it by no means feels like it's overly-pandering towards that demographic. It takes itself quite maturely, which is refreshing to see when it comes to games in these genera. \nIt is by no means soely a 'choose A or B' game; There are surprisingly enjoyable Detective segments that require actual thought, not just random clicking around, and Trivia games that, while not essential to the story, do at least make you more inclined to actually pay attention to the ingame universe as a whole.\nIts characters are a riot to watch; I had more than a few belly-laughs throughout. The story never takes itself too seriously, and overall is just a fun ride to sit through. \n\nIf you aren't exactally enthralled by the gender-bending trope or the idea of having 25% of the cast have animal ears, this probably isn't your thing. But if you're just looking for an enjoyable visual novel with a relatively unique perspective on the genera, I highly reccomend you checking this out.", "timestamp_created": 1486522750, "timestamp_updated": 1486522750, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29759015": {"recommendationid": "29759015", "author": {"steamid": "76561198000680440", "num_games_owned": 306, "num_reviews": 27, "playtime_forever": 536, "playtime_last_two_weeks": 0, "last_played": 1486653570}, "language": "english", "review": "Things that the British are good at:\n\nNaval warfare\n\nEmpire building\n\nPolitical backstabbing\n\nKicking skirtfags out of their ancestoral homeland\n\n\nThings they are bad at:\n\nCreating a standing empire\n\nArmored warfare\n\nBlowing up U-Boats\n\nInsults\n\nKeeping their prisoners and colonists in line\n\n\n\nIf they bongs had been good at keeping their penal colony in line, maybe my dick wouldn't hurt so much. Good one, boys. You really dropped the ball on Australia.", "timestamp_created": 1486464068, "timestamp_updated": 1486464068, "voted_up": true, "votes_up": 5, "votes_funny": 6, "weighted_vote_score": "0.313834", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29621677": {"recommendationid": "29621677", "author": {"steamid": "76561198093507593", "num_games_owned": 34, "num_reviews": 4, "playtime_forever": 3084, "playtime_last_two_weeks": 0, "last_played": 1487557576}, "language": "english", "review": "     This is my third visual novel that I've played. I'm not very experienced in talking about these type of things and I don't write many reviews. With that being said, here is what I though about the game. I was originally introduced to this game from a YouTuber called TheRPGMinx, and I was glad to see that she was the drugs in this game. I watched all of her current episodes and I thought that this was the funniest game I've ever seen. I could not stop myself from laughing at all of the jokes. One of my favorite parts of the game was when Gender Bender DNA Twister Extreme was referenced in the final trivia. I laughed my ass off. Though 'The boobcalypse' is probably the best name for an event such as what happened. [spoiler] I guess they are going to call the tentical monster attack 'The Great Groping'.\t[/spoiler] Anyways, I thought it was a great game with good art, good animations, and some of the best comedy I've seen in past few years. Well honestly though I don't play too many games with that much comedy in it, but that's besides the point. I would highly recommend this game. If you are not hooked by my review then go watch the first episode on Minx's channel.\n\nI am looking forward to the next game you guys make!\n\n Sinceraly,\nMysterious Person", "timestamp_created": 1485929915, "timestamp_updated": 1485929915, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.381338", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29053709": {"recommendationid": "29053709", "author": {"steamid": "76561198079489589", "num_games_owned": 66, "num_reviews": 7, "playtime_forever": 1029, "playtime_last_two_weeks": 0, "last_played": 1485928633}, "language": "english", "review": "From what I have been able to gather this game takes place in Australia.\n\nI am beginning to seriously contemplate moving to Australia.", "timestamp_created": 1483686852, "timestamp_updated": 1483686852, "voted_up": true, "votes_up": 4, "votes_funny": 16, "weighted_vote_score": "0.522868", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "29012292": {"recommendationid": "29012292", "author": {"steamid": "76561198189250154", "num_games_owned": 41, "num_reviews": 2, "playtime_forever": 15397, "playtime_last_two_weeks": 0, "last_played": 1489437606}, "language": "english", "review": "This is the best visual novel I have ever experienced!  Thank you for making such a thoroughly enjoyable game!\n\nThis game is the gold standard by which all other VNs should be judged.  And in time I am sure that it will be.  If you are looking for a great interactive experience, then pay full price and support Latched Up Games, because with this kind of attention to detail, quality and substance, they are bound to produce many more incredible games with great story and composition!\n\nI look forward to their next VN, whatever and whenever that may be...", "timestamp_created": 1483551853, "timestamp_updated": 1483551853, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "28847914": {"recommendationid": "28847914", "author": {"steamid": "76561198114910663", "num_games_owned": 17, "num_reviews": 1, "playtime_forever": 5904, "playtime_last_two_weeks": 1, "last_played": 1516470527}, "language": "english", "review": "This game would make a great anime", "timestamp_created": 1483140326, "timestamp_updated": 1483140326, "voted_up": true, "votes_up": 0, "votes_funny": 2, "weighted_vote_score": "0.429240", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "28476301": {"recommendationid": "28476301", "author": {"steamid": "76561198096638903", "num_games_owned": 50, "num_reviews": 2, "playtime_forever": 357, "playtime_last_two_weeks": 0, "last_played": 1482185947}, "language": "english", "review": "[h1]This game is pretty nice [/h1]\nGrafics are really pretty and the animated scenes are a plus even if they are short. \nAll characters are appealing , each in their own way wich for a visual novel is really important.\nI laugh prety often while playing this game and it hadn't happened in a long time.\nThe only thing that can distub you is if you have a thing against TF and TG (I don't ).\nTotaly worth its price.", "timestamp_created": 1482186616, "timestamp_updated": 1482186616, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "28315309": {"recommendationid": "28315309", "author": {"steamid": "76561198163694269", "num_games_owned": 15, "num_reviews": 10, "playtime_forever": 1493, "playtime_last_two_weeks": 0, "last_played": 1487289754}, "language": "english", "review": "Oh My Gosh - Loved the waterpark episode and now cant wait to see Holly dress max up <3 \nNot sure what to think of the new game but i will keep my mind open because I would prefer to play it before I judge to much. \nFigurines of all the characters from all three games seems a super cool Idea and I would deffinetly collect them and it would hopefully bring you funding for more episodes.\n\nKYAAAAAAAA!!!!!!\n\nReally want to donate 3000AU but I am not rich I can barely afford the first one being trans and all I am so worried about not having enough to be myself and cover cost of everything. :( wanted to appear in this game and even more so Really want to buy figurine's of all characters from all games Lached has done. <3 <3 If I was rich I would deffinetly donate 3000AU.\n\nGuess I should get a job but its hard.\n\n\nPlease Please Please make a store to help fund you while making things affordable to us. I can see it now a shelf with all the characters on and two large posters on my wall removing all my other ones and keeping just your's up. No I am not holly xd but I guess you could say we have similerarities.", "timestamp_created": 1481484348, "timestamp_updated": 1481485373, "voted_up": true, "votes_up": 0, "votes_funny": 2, "weighted_vote_score": "0.480132", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "27592231": {"recommendationid": "27592231", "author": {"steamid": "76561198030528610", "num_games_owned": 266, "num_reviews": 6, "playtime_forever": 1243, "playtime_last_two_weeks": 0, "last_played": 1486515302}, "language": "english", "review": "Completely ridiculous. And I love it.", "timestamp_created": 1480132502, "timestamp_updated": 1480132502, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.484646", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "27163790": {"recommendationid": "27163790", "author": {"steamid": "76561198070917075", "num_games_owned": 264, "num_reviews": 3, "playtime_forever": 1451, "playtime_last_two_weeks": 0, "last_played": 1514926484}, "language": "english", "review": "Max's big bust is one of the best visual novels out there. It has great story with very funny elements, it also has great visuals. The maker's visual style has been greatly improved from their previous game gender bender dna twister. Story is complex and long and gives good number of choices.\n\nOne thing that dissapointed me was the amount of animation in the game. Since they advertise that part of their game in shop so much, you kinda expected more animated shorts between gameplay. That can change though because the game isn't complete yet at the time of my review.\n\n8,75/10 for a visual novel", "timestamp_created": 1479994420, "timestamp_updated": 1479994420, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26140733": {"recommendationid": "26140733", "author": {"steamid": "76561198055674734", "num_games_owned": 55, "num_reviews": 2, "playtime_forever": 16, "playtime_last_two_weeks": 0, "last_played": 1485766983}, "language": "english", "review": "Great game. If your thinking of buying this game. Buy it! Everything about this game is great. From the interesting characters, to the investigations. All make for a game that is unique. The beautiful art and relationships make for alot of replayability and increase the fun further. While I find all of the relationships interesting the Ember character I found to be best. Definetely my suggestion for the first play through. Enjoy a great game.", "timestamp_created": 1477030593, "timestamp_updated": 1477030593, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "25859630": {"recommendationid": "25859630", "author": {"steamid": "76561198140819078", "num_games_owned": 15, "num_reviews": 4, "playtime_forever": 1903, "playtime_last_two_weeks": 0, "last_played": 1487332644}, "language": "english", "review": "I love this game so far, Ive ran through each romance and event, The content is great, the story is awesome so far~! Im just waiting on the next update! 11/10 so far!", "timestamp_created": 1475611141, "timestamp_updated": 1475611141, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "25456111": {"recommendationid": "25456111", "author": {"steamid": "76561198207213988", "num_games_owned": 27, "num_reviews": 1, "playtime_forever": 1403, "playtime_last_two_weeks": 0, "last_played": 1486933544}, "language": "french", "review": "Par le même auteur que GBDNATE (oui, j'abrège) et dans le même univers, le style change quand même radicalement et pour le mieux.\nAu lieu de multiples histoires un peu décousues, et du coup pas toujours raccord, on a ici une seule histoire bien travaillée et plus cohérente. Au niveau graphique, les captures d'écran de la boutique suffiront à vous montrer le radical changement de style.\n\nMais cessons là les comparaisons qu'en est-il du jeu lui même ? \nOn suit l'histoire d'un agent de police, Max, enquêtant sur une affaire de drogue. Mêlé à ce trafic se trouve des gemmes magiques dont Max fera les frais en se retrouvant métamorphosé en son pendant féminin. Comment s'adaptera-t-il à sa nouvelle vie ? Comment ses relations avec ses collègues évolueront ? Qui se cache derrière ces trafics et en quoi sont-ils liés ? C'est là tout le propos du jeu.\n\nAvec une ambiance à la buddy movie, on a une bonne dose d'humour et de romance. Les enquêtes mèneront à résoudre quelques puzzle/énigmes pas forcément très compliqués mais qui ajoutent une petite dose de changement dans les traditionnels murs de textes que sont les VN.\n\nLes bons points :\n - sprites de bonne qualité\n - des scènes en animation (ce qui est plutôt rare et elles sont franchement sympa à regarder)\n - une histoire intéressante avec une bonne dose d'humour\n - des transformations (oui, bon, ça c'est pour ceux qui aime, et j'en fais parti)\n - une bonne durée de vie\n\nLes moins bons points :\n - sprites un peu trop statiques avec des poses non neutres (ce qui mène à avoir un personnage qui danse partout tout le temp, ou un autre ayant toujours l'air de lever les mais au ciel)", "timestamp_created": 1473570013, "timestamp_updated": 1473570170, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.507610", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "25337057": {"recommendationid": "25337057", "author": {"steamid": "76561197978976857", "num_games_owned": 2882, "num_reviews": 55, "playtime_forever": 70, "playtime_last_two_weeks": 0, "last_played": 1474186227}, "language": "english", "review": "In the interests of not only full disclosure but avoiding the tendency to give out unwitting spoilers, I will say that I have NOT finished this game. I have, however seen enough to get a grip on the story and the way the game plays. I got this game for review exclusively for The Hidden Levels. The Publisher/Developer provided a review key. My opinions are, as always, my own.\n\nI'm recommending this, not because it's flawless (it isn't), or that I know the dev (I don't), or even because I think the anime girls are cute (I do). It's a well-assembled game that the Dev obviously cares about, and that's a Good Thing. It gets points for not doing the standard thing with the gameplay, having the cute animu style, and for a somewhat different take on the gender-bending thing. \n\nNow, about those flaws: The early part of the story, in which they establish the character of Max and the way he operates [i]before[/i] being turned into a busty blonde, can get more than a little confusing. Max and Brad are part of a tiny department of the local police force whose role doesn't seem to make a while lot of sense. There are already divisions of most police forces that do the things that this one \"elite\" force does-- why that sort of overlap? \n\nA couple of hours in, and I still don't have a solid answer to that. In a Crapsack World, one would expect that major drug operations would be undertaken by Vice, and murders by Homicide. \n\nSeveral other bits of story stand out in similar ways, all of which are dropped nearly immediately or handwaved away as Normal, or at least not out of the ordinary. Some things, like transformatives, are in fact common enough that there are methods available to reverse them-- albeit rather expensive ones. \n\nThe investigation game after that is rather interesting, and here's one of the places where the game shines-- you will want to use those neurons to solve the cases Max has to deal with during the bulk of the game. You CAN brute-force your way through, but a lighter hand and some logic will serve you in better stead. \n\nThe other thing that I really did like were the little animated cutscenes. They could have been rendered a bit better, I think, but they make for a nice touch to punctuate high points in the game. \n\nMuch as I was down on the story, there are several high points: Max's reaction to being transformed was hilarious, while seeming mostly natural-- He didn't like what happened to him, but appears to get over it... Eventually. Captain Nekorai, on the other hand, has been modified a-purpose with cat ears and a tail-- which he adores. He swears the story is about him, when in fact he's the occasional walk-on cameo and boss for the gang. \n\nI still want to know what exactly he does with that disco ball...", "timestamp_created": 1472953385, "timestamp_updated": 1472960467, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.518522", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "25137597": {"recommendationid": "25137597", "author": {"steamid": "76561198021819410", "num_games_owned": 138, "num_reviews": 15, "playtime_forever": 2342, "playtime_last_two_weeks": 0, "last_played": 1497558439}, "language": "english", "review": "HAH, now I was bored. I was interested. And boy do I like girls. And what better way to like girls than in a story where there is one less boy and one more girl by default in the beginning?\n*Gibberish*\n\nSo I was bored. I got interested in the concept of seeing more girls. I got this after the update at 2016/08/04 (4th of August I believe) Aaand I was not so hot for the dating thing I was more interested in...(I am not sure what I was interested in)\n\nI was more interested in the fox girls and the ears. I had hoped for the character to gain those ears. And I love them ears. (N' tails) \n\nSo I do recommend this game. There are fox girls. If you are like me and dislike surprises then... I dunno... You will probably stay for the ears and the hope of seeing more fox ears and catears.\n\nHowever... This is wonky. I don't know what to dislike about it. Maybe the art could be subpar in someones eyes? But beeing someone that cannot draw at all but is trying I find it much more easy to just turn a blind eye to how things looks... I think...\n\nI am ok with this buy. I got some fox ears and cat ears to look at. That is fine. This is fine....\n\n\n\nThis is nonsense. Shooo. Go away. If you read this far that is...", "timestamp_created": 1472150849, "timestamp_updated": 1472150849, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.444050", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "24915914": {"recommendationid": "24915914", "author": {"steamid": "76561198120057322", "num_games_owned": 525, "num_reviews": 15, "playtime_forever": 1551, "playtime_last_two_weeks": 0, "last_played": 1486572281}, "language": "schinese", "review": "澳洲佬做的性转VN\n\n大体上讲一个叫Max [strike]Payne[/strike]的黄毛警探某日和搭档/基友缉毒时不慎碰了藏在毒品中的某种物质然后变成了金发巨乳天然呆吃货妹子的故事。[strike]随后赶来的基友看到这画面欣喜若狂当场就干了个爽咳我瞎说着玩的[/strike]\n之后主角Max要一边逐渐适应自己身心娘化的现实，同时还要作为警员侦破案件并找到导致自己性转物质相关的线索。\n然后还要同时在警局内部谈恋爱……\n五个可攻略对象，其中三女两男，[spoiler]主角被男的撩的时候莫名有一股女性向作品感脚[/spoiler]\n\n\n就目前的展开来看剧本很有意思而且相当欢乐，有很多让人忍俊不禁的地方。[spoiler]做条子的日常莫名的有种Psycho-Pass的既视感，嗯而且主角还特喜欢用电击枪电人……[/spoiler]\n既然主角是条子随剧情发展也会有几个破案的环节，像是检查不同地点搜寻证据询问证人判断嫌犯之类的，也有像是问答之夜考你游戏相关内容的环节。有几处还需要你想办法支开一些人或者分开组合一部分证人方便询问。\n其次就是一些其他功能像是主角手机看看新闻天气（有的新闻还会和后面剧情有关联），以及养一个目前似乎没什么卵用的虚拟宠物……\n\n因为作者是澳洲人所以有各种澳洲英语以及相关文化用词，像是经常出现的\"bloody hell\"\"mate\"之类的\n几个主要人物都塑造的都各有特色，配角立绘数量很多也很用心，作画是日本公司所以画风看着还是挺顺眼的[spoiler]（奶子！奶子到处都是！）[/spoiler]，有的CG画风看上去有点怪就是了。\n而且还有全动画过场，预览就可以看到就是主角抓人和性转的两段。\n并没有配音（过场动画那段日配不算）\n\n总而言之是一部让我感到惊喜的作品，能感觉到作者在剧本上很是用心，看的过程中也给我带来了很多愉悦（正色）\n剧情量不小，目前还没有完结不过已经有十个章节（目前为止我前前后后看了二十多小时了……），新章节刚出也多少有些小BUG，作者也在随更新在社区和玩家互动并逐渐修复。\n最大问题就是略贵的价格了……真想入还是推荐打折\n\n最后一提感觉这游戏不大可能会有河蟹补丁，[spoiler]虽说有一笔带过的啪啪啪剧情以及打码打到丧心病狂的全果立绘……[/spoiler]", "timestamp_created": 1471195258, "timestamp_updated": 1471196686, "voted_up": true, "votes_up": 18, "votes_funny": 3, "weighted_vote_score": "0.723763", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "24843960": {"recommendationid": "24843960", "author": {"steamid": "76561198291571551", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 934, "playtime_last_two_weeks": 0, "last_played": 1506355847}, "language": "english", "review": "WOW NICE GAME,RECOMMEND IT FOR EVERYONE WHO LOVE THIS TYPE GAME.", "timestamp_created": 1471015956, "timestamp_updated": 1471015956, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.415486", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "24819513": {"recommendationid": "24819513", "author": {"steamid": "76561198318960180", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 408, "playtime_last_two_weeks": 0, "last_played": 1492392022}, "language": "english", "review": "Note: I've played approximately twelve hours or more on this game, but that was on a separate computer so I'm assuming it didn't keep track of it.\n\nI became interested in this game to do rpgminx's playthrough of it. After watching her, I knew I had to get my hands on it myself. Buying this is a decision I do not regret. I have not played (nor watched gameplays of) many genderbender games, but this one has lured me in and set the bar for any others I might play in the future.\n\nI played all the yuri love interest routes, being a lesbian, and each one I loved for different reasons. Ember's was sweet and somewhat amusing, due to Max's naivety. Holly's was surprisingly romantic, and her personality actually reminds me of myself (whether that is a good thing or not, though. . .). Victoria's was flat out amusing, but also affectionate when it came to the art. Speaking of. . .\n\nThe art is lovely. The animations surprised me when I was watching rpgminx's playthrough, and it made me want to play it all the more because that is not something you see in a typical visual novel, or so my experience of them says, anyways.\n\nI like how Max's situation with his/her flipped gender is dealt with. [i] He [/i] (and I say that for a reason, at least in the beginning) is very upset and resistant to being turned into a girl. It's not immediate acceptance, and it's actually his primary concern - he wants to turn back into a man. Even when he starts becoming more of a [i] she [/i], Max stills talks about returning to his original gender, although I believe she's actually embraced her new form (or at least I hope) and is now content with her body.\n\nThe characters are actually pretty far from bland, even the background characters. I have a fondness for all of them, even if that fondness mostly shows up in the form of irritation for a certain panda. . . They're pretty unique and can amuse you. Sometimes the situation can build and I'll be struck by how tense the scenario actually is.\n\nThe investigation scenes can actually require some thought, but they're not ridiculously complex or anything like that. Trivia is something I wasn't expecting, but I enjoy those parts too.\n\nThe only thing I would say that actually detracts from the game is the grammar - there are a few mispellings, typos, and what seems to be absent words, but in all honesty these are pretty far apart and don't interrupt the flow too much or confuse you, so it's easily ignored.\n\nIf I had to rate it, it's an actual 10/10 despite that little issue. I had a lot of fun with this and I'm looking forward to more as soon as more comes out.\n\n\n", "timestamp_created": 1470882012, "timestamp_updated": 1470882012, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500120", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "24512919": {"recommendationid": "24512919", "author": {"steamid": "76561197994642454", "num_games_owned": 919, "num_reviews": 10, "playtime_forever": 386, "playtime_last_two_weeks": 0, "last_played": 1484732536}, "language": "english", "review": "Well, for starters I would say that I have really enjoyed what I have played of this story so far despite the fact that I did end up playing most of it with Offline mode turned on. The reason being offline with it is that I'm pretty sure my friends would be a bit like \"What the heck are you playing\" or something along those lines. But I digress, for me it has been pretty fun so far and I admit that it was not really what I had been expecting. \n\nFor starters, there are parts of it where you are actually talking to characters and collecting information in order to solve number of cases, and to work your way through situations. I didn't know the game had this in it as a feature so it was a pleasent surprise for me. For me it was pretty simple to do them, but it was fun none the less.\n\nThe next part of it that I wan't expecting was about how wacky some of the characters and their personalities are. I got a kick out of how silly the Police captain is and I did find some of the bad guys you encounter to be pretty funny as well. \n\nSadly though, I have progressed to the current end of what is available to play so I am left in suspense as to what Max will \nencounter until more content updates come around. Luckily, there are mulitple numbers of story routes that I can play through to learn and find out more of what is going with the characters and how they fit into things. :)\n\nI do recommend giving this game a shot if you like visual novels with fun and interesting plot twists and a bit of mystery. So far not everything is as it seems.\n\nA little note to the developers if you happen to read this:\nI really hope there is more that is going to happen at Coffee Shrine, the things that go on there really make my day. :D\nAnd I really liked the hair color. I hope to see it make a return even if it's just once. :)", "timestamp_created": 1469425457, "timestamp_updated": 1469425457, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "24405391": {"recommendationid": "24405391", "author": {"steamid": "76561198107463371", "num_games_owned": 66, "num_reviews": 7, "playtime_forever": 95, "playtime_last_two_weeks": 0, "last_played": 1484115298}, "language": "english", "review": "okay so afterthing playing through one of the story lines i can say the game is worth the $30 it cost. The art style and animations qre amazing, the interation between the characters is good and funny. Fun puzzles for a game like this and its good to finaly see a visual novel game that isnt just \"want to hang out with girl A or GIrl B\" and you can play through it a few times and get the same ending over and over again. I'm not the best at wring reviws but i give this game 9/10. \n\nOverall its a fun and i cant wait to see what Developers can come up with next.", "timestamp_created": 1468923225, "timestamp_updated": 1468923225, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "24363369": {"recommendationid": "24363369", "author": {"steamid": "76561198272018340", "num_games_owned": 36, "num_reviews": 4, "playtime_forever": 885, "playtime_last_two_weeks": 0, "last_played": 1493174737}, "language": "english", "review": "Wow.\nI am truly at a loss for words.\nOf course, it's still in the process of being an amazing game, but it is GLORIOUS as it is right now.\nI love how it's not just something you read, and then leave it from there. There is ACTUAL thinking involved, as well as a shit ton of replayability. For my first Visual Novel, I can say I am really pleased, and definetly recommend this game(If I can accidently stumble upon 25$ in my bank account, so can you!) because it is truly worth every penny.\n\nI think I favourite route was Ethan. Max was so awkward the entire time around him, and the ending of this update really solidified my thoughts. I also ran Brad. I liked it, because it had a more, thoughtful approach to it, rather than Ethan. Don't worry dev, I'll get to the Yuri endings as well ^~^\n\nLong story short, BUY THIS GAME! HELP THE DEV!", "timestamp_created": 1468715891, "timestamp_updated": 1468715891, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500120", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "24359920": {"recommendationid": "24359920", "author": {"steamid": "76561198227884224", "num_games_owned": 1644, "num_reviews": 25, "playtime_forever": 181, "playtime_last_two_weeks": 0, "last_played": 1505081177}, "language": "english", "review": "A very good anime-style visual novel, with a few crimey-wimey (timey-wimey Dr Who ref!) puzzles in it, as well as a coupla trivia quizzes!  The characters and their story lines are well thought out, as well as umm... well-drawn... once this is completed, definitely a 10/10! \n\nNOTE:  zomg, ZOMG, FINISH IT PLEEEASE!!!  DON'T PULL A \"GEORGE R R MARTIN\" ON US!!!!\n\nANOTHER NOTE:  [spoiler] Max's sister [/spoiler]  should get the [spoiler] Ice powers [/spoiler] if you're going the full [spoiler] elemental trio [/spoiler] route [spoiler] with the tramsforming-elemental-marble thingys [/spoiler]\n\nCat-tastic!   =^_^=", "timestamp_created": 1468700033, "timestamp_updated": 1468700033, "voted_up": true, "votes_up": 1, "votes_funny": 2, "weighted_vote_score": "0.502262", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "24191958": {"recommendationid": "24191958", "author": {"steamid": "76561198155656406", "num_games_owned": 121, "num_reviews": 4, "playtime_forever": 1199, "playtime_last_two_weeks": 0, "last_played": 1510803452}, "language": "english", "review": "This game is great because the art design are good and the story plot for each person is great, and each choice you picked will have an outcome of what might happen.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMe regretting is that i laugh so hard I ended throwing up because I can't keep stop laughing like crazy", "timestamp_created": 1468013028, "timestamp_updated": 1468013028, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "24176225": {"recommendationid": "24176225", "author": {"steamid": "76561198148681951", "num_games_owned": 14, "num_reviews": 1, "playtime_forever": 808, "playtime_last_two_weeks": 0, "last_played": 1486679073}, "language": "english", "review": "This games is worth the money. The latest update is very funny. The choices for who Max moves in with are great, and some of the dates that happen after Max moves in are extreamely funny,  they are in my opion: Victoria, Brad, and Ember's. The route for Holly is sweet. The route for Ethen is weird but slighly nice. So my score rating for this game is a 9.5 out of 10.", "timestamp_created": 1467963264, "timestamp_updated": 1467963264, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "24175006": {"recommendationid": "24175006", "author": {"steamid": "76561198271118345", "num_games_owned": 9, "num_reviews": 1, "playtime_forever": 933, "playtime_last_two_weeks": 0, "last_played": 1486577503}, "language": "english", "review": "Very funny and very clever writing. A few glitches noticed on the Brad plot line (Holly delivers your costumes, knows that you are dating, then acts all freaked out at the anime con and asks when we started dating) but still really fun. Can't wait to see more.", "timestamp_created": 1467957607, "timestamp_updated": 1467957607, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "4.997145", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "24146785": {"recommendationid": "24146785", "author": {"steamid": "76561198060327406", "num_games_owned": 69, "num_reviews": 15, "playtime_forever": 2550, "playtime_last_two_weeks": 0, "last_played": 1490919908}, "language": "english", "review": "Now, you might have scrolled down here to the review section because you were curious about this game, but thought something along the lines of \"Oh wow, $30 for a visual novel? That's kind of expensive...\" Trust me; it's worth every damn cent. This visual novel, whenever I play it, never fails to put a big dumb happy grin on my face. The writing is an absolute riot, the characters are very unique in terms of personality, there are investigation puzzles and trivia sections, and come on man, did you even [i] SEE [/i] those anime cutscenes? Those are in the game in case you're wondering, and there are apparently more to come.\n\nOverall, this game is a great buy, regardless of the few typos and redundant sentences, along with the few character model misplacements.\n\nFinal score 9/10 (one point off for the stuff I just mentioned, but I'll change that when it's out of early access and that stuff has been fixed.)", "timestamp_created": 1467852030, "timestamp_updated": 1467852138, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.565217", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "24140484": {"recommendationid": "24140484", "author": {"steamid": "76561198077529162", "num_games_owned": 134, "num_reviews": 5, "playtime_forever": 393, "playtime_last_two_weeks": 0, "last_played": 1481872564}, "language": "english", "review": "9.5/10\nA very well made game and provides hours of fun in its current state. Crime solving mechanics entertaining and added a level of difficulty I haven't seen in a game like this ever.  When it cut off at the end of the update, I screamed. Can't wait to se this game completed.", "timestamp_created": 1467830638, "timestamp_updated": 1467830638, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "24051538": {"recommendationid": "24051538", "author": {"steamid": "76561198130758761", "num_games_owned": 147, "num_reviews": 14, "playtime_forever": 343, "playtime_last_two_weeks": 0, "last_played": 1482492809}, "language": "english", "review": "Team Bonnie anyone??? ok.. just me then.", "timestamp_created": 1467558989, "timestamp_updated": 1467558989, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "4.975124", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "24037186": {"recommendationid": "24037186", "author": {"steamid": "76561197996279787", "num_games_owned": 96, "num_reviews": 7, "playtime_forever": 1652, "playtime_last_two_weeks": 0, "last_played": 1513338379}, "language": "english", "review": "A great Visual novel, I cant wait to see the rest of the story...  (>^.^<)", "timestamp_created": 1467520245, "timestamp_updated": 1467520245, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "23946020": {"recommendationid": "23946020", "author": {"steamid": "76561198072113741", "num_games_owned": 248, "num_reviews": 5, "playtime_forever": 492, "playtime_last_two_weeks": 0, "last_played": 1495556061}, "language": "english", "review": "Let me preface this by saying that I really liked this game so far. I think that all the characters are awesome and that the story is pretty funny and interesting. Basically this game is a 8/10 in my book probably 9/10 once it is finished. But there is one small problem that makes me so angry when I see it and its inevitable. It's Ethan and his Fucking Bullshit Ass name reminds me of Heavy Rain a game that I really hate and every time I just hear David Cage's Dumb ass saying Ethan in a broking french accent every time and its just enfuriating. Just had to get that out there, the game is still awesome though I hope I didn't ruin Ethan for any of you.", "timestamp_created": 1467265755, "timestamp_updated": 1467277857, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "23695703": {"recommendationid": "23695703", "author": {"steamid": "76561198006651270", "num_games_owned": 156, "num_reviews": 2, "playtime_forever": 491, "playtime_last_two_weeks": 0, "last_played": 1468804891}, "language": "english", "review": "enjoyable visual novel type game with some detective work elements. is still under development but what has been released has been fun.\n\nyou too will wonder.....what the heck is up with the Disco Ball", "timestamp_created": 1466553399, "timestamp_updated": 1466553399, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "4.975124", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "22227503": {"recommendationid": "22227503", "author": {"steamid": "76561198240088030", "num_games_owned": 27, "num_reviews": 1, "playtime_forever": 621, "playtime_last_two_weeks": 0, "last_played": 1513880021}, "language": "english", "review": "Hello I am pgg1998 and I love this game fully but there is a glitch on the heart meter I have played it for a while and i think it's stuck I keep trying to make it work on ember but it's stuck on nuetral friend and from what I have been able to get her I should have 5 to 6 hearts for her at this point even though it's stuck on 3 but other then that great game", "timestamp_created": 1459723592, "timestamp_updated": 1459723592, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "21992151": {"recommendationid": "21992151", "author": {"steamid": "76561198009736046", "num_games_owned": 96, "num_reviews": 2, "playtime_forever": 307, "playtime_last_two_weeks": 0, "last_played": 1482187617}, "language": "english", "review": "If you liked the game X-Change then you will definitly love this one.", "timestamp_created": 1458691431, "timestamp_updated": 1458691431, "voted_up": true, "votes_up": 3, "votes_funny": 2, "weighted_vote_score": "0.466321", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "21872574": {"recommendationid": "21872574", "author": {"steamid": "76561198079409879", "num_games_owned": 103, "num_reviews": 2, "playtime_forever": 638, "playtime_last_two_weeks": 0, "last_played": 1495418464}, "language": "english", "review": "This is the best visual novel i've ever played EVER.\n\nThe story is VERY good (even though its in development)\n\nThe art is very good (cg,character sprites,ect)\n\nI've never played a visual novel with full motion video cut scenes fully animated\n\nThe interaction is the best i've ever seen in my life(visual novel wise) you investigate crime scenes, you can actually play on your phone. my virtual pet died :(\n\nOne thing it lacks, but is made up for in the other feaures is that there is no voice acting, but this is not the first visual novel i've played without it.\n\nThe action scenes are good.\n\nIt also has a very good soundtrack serously make a DLC for that.\n\nThis game is one trillion times better then sakura spirit (sakura spirit was the first visual novel i've played)\n\nI've payed CDN$28.04 it was -15% best 28 dollers and 4 damn cents i've spent (and also the most i've put into one game).\nI Recommend this game for the visual novel fans out there or the people who want to check this genre out.\nBUY This damn game its worth EVERY SINGLE DAMN CENT.\n\nIf I was to give this game a rating on a scale of 1 to 10\n\nI would say 9/10", "timestamp_created": 1458148336, "timestamp_updated": 1458148336, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.577633", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "21828697": {"recommendationid": "21828697", "author": {"steamid": "76561198074072128", "num_games_owned": 91, "num_reviews": 22, "playtime_forever": 538, "playtime_last_two_weeks": 0, "last_played": 1492370403}, "language": "english", "review": "Not too bad of a game so far. Personally I'm going to wait until it is fully finished so I can play all the way through a path. Also I hope there might be an option to skip certain sections if you have completed it once, ones that don't really change depending on your path.", "timestamp_created": 1457928426, "timestamp_updated": 1457928426, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "21682768": {"recommendationid": "21682768", "author": {"steamid": "76561198050947291", "num_games_owned": 87, "num_reviews": 5, "playtime_forever": 1664, "playtime_last_two_weeks": 0, "last_played": 1496916112}, "language": "english", "review": "Still in early access and hours of hilarity already! Not afraid to have a laugh at controversial issues (or itself) or show some skin (or cat ears). You probably don't want to play this at work but it's good humor on a night off.", "timestamp_created": 1457343969, "timestamp_updated": 1457343969, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "21214383": {"recommendationid": "21214383", "author": {"steamid": "76561197993770423", "num_games_owned": 176, "num_reviews": 18, "playtime_forever": 277, "playtime_last_two_weeks": 0, "last_played": 1469468150}, "language": "german", "review": "Max´s Big Bust, ist das zweite des Entwicklers „Lached up Games“, nach \"Gender Bender DNA Twister Extreme\", und aus meiner Sicht ein großer Sprung nach vorne.\nBei \"Max´s Big Bust\" handelt es sich im Kern um ein Game des Genres \"Visual Novel\", ein vor allem Textbasiertes Spiel, bei dem Bilder und kleine Animationen, genutzt werden, um die Erzählung zu stützen. Im Gegensatz zu den Klassischen Visual Novels, gibt es bei diesen Spiel jedoch kleine Rätsel, welche das Spiel zusätzlich auflockern.\nWie die meisten (guten) Visual Novels, hat das Spiel durch verschiedenen Entscheidungen, welche der Spieler im verlauf der Handlung fällt, einen hohen Wiederspielwert.\n\nWer die Geschichte von „Lached up Games“ verfolgt sollte wissen, dass die Entwickler gerne mit den Narrativen-Elementen des Geschlechterwechsel und „Kemonomimi“ (menschliche Figuren mit Tiermerkmalen), arbeiten. In bester „Visual-Novel Tradition“ kommen dabei auch Erotische Anspielungen nicht zu kurz. (sind wir ehrlich sie machen einen nicht unerheblichen Teil des Humors aus) \n\n„ Jedermanns Geschmack“ sind die Geschichten der Autoren sicher nicht. Handwerklich ist in meinen Augen wenig an der Geschichte auszusetzen. ( Wobei sie auch sicher keine Literaturpreise gewinnt). Die Geschichte ist Flüssig erzählt, wobei einige wiederkehrende Charaktere noch etwas blass bleiben, was sich aber natürlich noch ändern kann.\n\nIn \"Max´s Big Bust\" steht der Polizist Max, im Mittelpunkt der Geschichte. Max lebt in einer Welt, in der sich Menschen in Kemonomimi´s auf Medizinischem Weg verwandeln lassen, um aus der Masse hervorzutreten, z.b. um mehr Menschen in das eigene Cafe zu locken.\nBei einem Einsatz gegen ein Bande Drogendealer, kommt er durch Zufall in Kontakt mit einem kleinen runden Objekt, welches ihn in eine Frau verwandelt.\n \nAuch technisch, ist an \"Max´s Big Bust\"wenig zu meckern. Die Zeichnungen sind qualitativ gut, ebenso die (noch wenigen) Animationen, auch wenn sie sich noch nicht mit den großen Japanischen Studios für Visual Novels messen können.\n\nAktuell (14.2.2016) beträgt der Umfang von Max´s Big Bust, ungefähr 3 Stunden Spielzeit für den ersten Durchlauf, und ich habe gerne auch ein zweites mal das Spiel gespielt.\nDas Spiel wird aktuell Monatlich erweitert. \n30€ sind eine Menge Geld, und ich kann das Spiel bei aller liebe nicht uneingeschränkt empfehlen, doch unterstütze ich in diesem Fall gerne die Entwickler. \n\n\n", "timestamp_created": 1455477568, "timestamp_updated": 1455477568, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.515172", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "21197090": {"recommendationid": "21197090", "author": {"steamid": "76561197994581058", "num_games_owned": 1441, "num_reviews": 16, "playtime_forever": 2877, "playtime_last_two_weeks": 0, "last_played": 1512007115}, "language": "english", "review": "This is a game involving transformations, primarily focusing on guy to girl.  Though animal ears and tails are pretty prevalent too.  If you dont care for that kind of stuff you should probably just move on, because though there is more than that to this game it is the central theme.\n\nThe main character is a Police Officer working in an elite unit tasked with taking down a new drug, MinX.  Through a bit of stupidity, the character gets turned into a girl.  This is a world were people can buy drugs to alter their appearance so it's not considered a big deal.\n\nYou have the standard romance options with the people you work with.   You also have some detective type puzzles to work through, which i rather enjoyed.  Other than that there's alot of dialog to go through and it feels very well written.  I rather got to enjoy the characters in the story.  The game world itself is an extension of another game, \"Gender Bender DNA Twister Extreme\".  As a result the game worlds lore actually has some depth to it, though its mostly only hinted at here.  I'm not sure but i think this game picks up a year or two after the last one ended, and in a different city.  You will see some return characters though.\n\nSimply put, this game is better than its predecessor.  Or at least i think so, sure you don't get to jump around characters like before and see their different angles of the story.  But, this game seems like it will ultimately be larger and already has more variety of actions, namely the detective style puzzles and i'm hoping they do more with the mini game on your phone.  Regardless, if you liked the previous game get this.  If you thought it was lacking a bit, get this.  If you hated it, don't get this.  And if you have no idea about the other game ask yourself two questions.  Do i want to play a date sim style game?  Can i tolerate transformations that include gender change?\n\nThe only thing i didn't really care for was the serious lack of variation on the characters picture's.  I'm hoping its nothing more than a mark of being early access.  Admittedly it was funny when the characters made a comment about this in regards to a criminal but i'd rather have more variation than a sly 4th wall gag.", "timestamp_created": 1455423846, "timestamp_updated": 1455423846, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.635128", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "21183760": {"recommendationid": "21183760", "author": {"steamid": "76561198090763632", "num_games_owned": 90, "num_reviews": 4, "playtime_forever": 751, "playtime_last_two_weeks": 0, "last_played": 1472361728}, "language": "english", "review": "when i found out the game was 4-5 hours i was disappointed then i realized that was early access and theres a lot more story to come. i enjoyed the puzzles and the story. its more interactive then most Visual novels i see.", "timestamp_created": 1455383005, "timestamp_updated": 1455383005, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "20986810": {"recommendationid": "20986810", "author": {"steamid": "76561198067112366", "num_games_owned": 71, "num_reviews": 1, "playtime_forever": 1608, "playtime_last_two_weeks": 0, "last_played": 1499329533}, "language": "english", "review": "I really like this game, and I can't wait until the next update to continue the story. Even though the game isn't finished I've been having a lot of fun with it.", "timestamp_created": 1454734436, "timestamp_updated": 1454734436, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "20868955": {"recommendationid": "20868955", "author": {"steamid": "76561198253201980", "num_games_owned": 128, "num_reviews": 1, "playtime_forever": 7380, "playtime_last_two_weeks": 0, "last_played": 1494288328}, "language": "english", "review": "It has a good storyline good charcter development i see great potential in this gamr", "timestamp_created": 1454236566, "timestamp_updated": 1454236566, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "20517768": {"recommendationid": "20517768", "author": {"steamid": "76561198154261189", "num_games_owned": 228, "num_reviews": 2, "playtime_forever": 889, "playtime_last_two_weeks": 0, "last_played": 1480668382}, "language": "english", "review": "Best Game, so many great joke and an amasing story with great puzzeles", "timestamp_created": 1452751452, "timestamp_updated": 1452751452, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "20422626": {"recommendationid": "20422626", "author": {"steamid": "76561198040163594", "num_games_owned": 73, "num_reviews": 2, "playtime_forever": 3112, "playtime_last_two_weeks": 0, "last_played": 1494079613}, "language": "english", "review": "I like it, however i think when max is home and has nothing to do, she need a little more opthions like looking in the mirror comptimplating in thought about being female, taking a scented bath to relax, or touching herself to see what it feels like giving you the option of what to say or think in your head during a conversation or automaticly say that without the option that's just my persional opinoin whatever the creaters deside it's all up to them.\n\nps sorry for any bad spelling it's been a while since i typed and hopfully the creaters like a few of my ideas. \n\n\nI fogot to mention i think max should atleast have internet on his home PC so Max can think what she would look like with animal ears and tail, like cat, fox, or rabbit. The option of shoping for cloths would be there and max can try on a few outfits witch also force Max to comptimplate on the female gender, i think max should have the option to deside where to work for part time like zara gaming, coffee shrine, or the other store's i can't remmber the names i know they were in the very first puzzle game when Max had to investigated the rubberies at the mall.\n\n\nDevolers please send email to my acount on steam and tell me what you think good luck with the beta, this goes out to the gamers as well please speak your mind.", "timestamp_created": 1452351071, "timestamp_updated": 1452440205, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.499456", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "20149963": {"recommendationid": "20149963", "author": {"steamid": "76561198013453773", "num_games_owned": 104, "num_reviews": 4, "playtime_forever": 1667, "playtime_last_two_weeks": 0, "last_played": 1506596701}, "language": "english", "review": "6 hours of gameplay so far and it's still in development? Wow, I sure feel that I got what I paid for!\nSo after running the game from beginning to the current end, I have to say that I am not disappointed at all!\n\nThe plot (scroll down to my review below to avoid spoilers)\nThe plot is apparently set in the near-future, where it's been popular with transformation-gas and half human-half animal surgeries and stuff. The technology is quite similar to current, with taser-weapons as regular non-lethal weaponry, normal TVs, cars on wheels and trains still on tracks etc. The gender-transformation is apparently still in its early days with a few biproducts (like lactose-intolerance being a biproduct of cat-ears). Our protagonist however, is a young police officer with about three years of experience. He and his partner, Brad, are part of a department that deals with drugs and stuff and they are currently trying to deal with a new sort of drug called MinX. During their first dispatch, our protagonist ends up having a \"tiny\" bit of an accident and ends up as a woman. Now, for all of you that came here just for that par, I can promise you that he's not the only one that ends up having to deal with a female body... *giggle*\n\nNow, here's my veiw on other features in the series:\n\nMusic/sound\nI like the music and sound effects, but I miss being able to hear voices and possible have a on/off function of this. What I think would be great is if one could choose between having the characters speak or not. I like the game, but it's a shame when I have to read things 2-3 times because I can't seem to register what I read (this often happens when I'm feeling a bit tired, and that I do often). I also think this could help making the game differ more from other visual novels.\n\nAnimation\nThis part I feel should be separated in two parts: the animated scenes and the regular scenes.\n\nI have to say that I love the scene from the trailer. However I have been playing for 6 hours and only at the current end did I get to enjoy a new, short animation that looked quite similar to the last one. To be honest I feel a bit disappointed. I would very much love to see action or comedy-packed scenes receive even just a short scene now and then. Especially special scenes containing unique situations or characters. It would give the game more interesting content that adds to the regular content.\n\nFor the regular content I want to make one thing clear; NEVER use a picture of the character that doesn't fit in with the action. It's important with variation to ensure that it doesn't look cheap and poorly made. So if a character is bloody, it is bloody, and if a character got ther gender swapped and they have a belt to their pants, they won't try to hold them in place with one hand all the way to their boss's office and then all the way home. Besides,  a womans waist is wider than a mans, and hence it doesn't add up that the protagonist lose his pants (and not the underwear?) when turned into a woman. But enough of that pricky stuff. Overall aside from these few things, the content is good-looking and most of the time it fits well into the situation.\n\nTexting\nI've found some, but very few errors to the texting. So far I guess I have only found places where words are missing, so I just add them in my mind when reading the sentence a second time. It would be nice to see these minor errors corrected, but it's not something that would need to be prioritized at this stage. It may actually be a good thing, as the reader has to stop and read one more time to get the whole picture. It creates a pause and a difference, and it certainly gets the reader's attention back a little. As long as it's only happening 4-5 times in like 6 hours of content, it's not something to get all worked up about.\n\ninteraction with the game\nI simply love how one can affect the game with multiple choices and this should definitely have a continued focus throughout the development. Even though it's a story-based game it should give the player the possibility to interact and affect the game, and even though I haven't really got to test this out much, I have to say that it's still a bit funny. In my case I'm a justice-person so I have an issue with accusing the wrong suspect and stuff like that, in fear of getting both the hard-working protagonist and an innocent in trouble... But I did get an opportunity to run away from a certain cute-girl loving maniac that eventually stunned/tazed the protagonist and dragged her to a swimsuit shop... it was quite funny actually...\n\nAnd that's it for my review! Personally I don't think I'm the right person to set a \"grade\" on stuff, but in my case I would say 8/10. As the game is not finished yet, my estimate is only for the content so far, not for the finished product.", "timestamp_created": 1451571303, "timestamp_updated": 1451571328, "voted_up": true, "votes_up": 22, "votes_funny": 3, "weighted_vote_score": "0.648000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "20069491": {"recommendationid": "20069491", "author": {"steamid": "76561198025683153", "num_games_owned": 815, "num_reviews": 9, "playtime_forever": 759, "playtime_last_two_weeks": 0, "last_played": 1481179890}, "language": "english", "review": "Okay so this is a review as of V4.1, the bugfix version of 4.0. To start off, i'll admit part of the main reason I like this game so much is the theming, I find TG to be very fun, and when big boobs and long hair is involved? You know i'm there. Now, aside from that, my bias aside, this is shaping up to be a very solid game so far, it has the makings of what could be an amazing product easily. It has a ton of diffirent characters already and theres a pretty, admitedly silly, yet deep plot. The options you get are very varried. Despite only being V4, it already has many many many hours of replayability thanks to all the choices you can make. In further addition to that, it's not just a straight up VN Dating Sim style game, it actually lives up to it's name as a cop game. In V4 there is already two pretty intriguing puzzles, they're not exactly super complex, but they can take some figuring out and are pretty enjoyable. Overall, pre bias i'd give the game a solid 8/10 in it's current state of development, even if you're not really into the TG scene you can easily find things to enjoy in this game as it's comedy gold and has a solid plot with really interesting characters.", "timestamp_created": 1451399188, "timestamp_updated": 1451399188, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.554510", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "19582849": {"recommendationid": "19582849", "author": {"steamid": "76561198145055020", "num_games_owned": 31, "num_reviews": 22, "playtime_forever": 2608, "playtime_last_two_weeks": 0, "last_played": 1487243591}, "language": "english", "review": "Max's Big Bust is a Life Sim/Visual Novel that begs to differ from others. It is just so abundant of contents that compliment each other. The game has well-written events, variety of unique and attractive characters, interactive puzzle and investigation sections, many different locations, diverse routes for relationship choices, and great humors. The progression of the story and the dialogues feel smooth and natural, and the characters' reactions feel understandable and not overly exaggerated or cheesy. I also love the variety of locations, background musics, and their transitions for different moods. I must say it's also quiet immersive and interactive with the puzzles and the investigation minigames and different choices for building love relationships with interesting choice of partners in a universe of fantasy filled with interesting anime characters in terms of both appearance and personality and TG possibilities men like me would die for. Not to mention that the game packs great Australian humor that anyone can enjoy. I am certainly enjoying it.", "timestamp_created": 1449670358, "timestamp_updated": 1483684720, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.635113", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "19568020": {"recommendationid": "19568020", "author": {"steamid": "76561198111651423", "num_games_owned": 274, "num_reviews": 3, "playtime_forever": 2914, "playtime_last_two_weeks": 0, "last_played": 1504714427}, "language": "english", "review": "Max big bust has got to be one of the most awsome game this year, it gives us multi choices, unque charicter and some charicters from gender bender, you have to play it, i 110% recommend you get it and play it", "timestamp_created": 1449592974, "timestamp_updated": 1449592974, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.424423", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "19151602": {"recommendationid": "19151602", "author": {"steamid": "76561198020173264", "num_games_owned": 490, "num_reviews": 3, "playtime_forever": 505, "playtime_last_two_weeks": 0, "last_played": 1492544612}, "language": "english", "review": "It's like L.A. Noire but made by weebs with a gender bender fetish. Highly recommended", "timestamp_created": 1447887791, "timestamp_updated": 1447887791, "voted_up": true, "votes_up": 87, "votes_funny": 127, "weighted_vote_score": "0.613951", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "19020710": {"recommendationid": "19020710", "author": {"steamid": "76561198006444163", "num_games_owned": 75, "num_reviews": 9, "playtime_forever": 737, "playtime_last_two_weeks": 0, "last_played": 1486960806}, "language": "english", "review": "Surprising, thought provoking, and puzzle solving are all played out through this fun title, and that is only the demo for right now. Being a fan of visual novels, I can say that this has a lot of elements there that hook someone into enjoying it. I enjoy the thought of the idea \"What if...\" throughout the whole process and making it come alive throughout this title is something to enjoy unlike in some other games that lead you into a false sense of choice. Overall, great presentation so far with what is given in the demo, favorite part through the story is the fox girl cafe ^-^ and thats saying a lot because \"sakura spirit\" almost destroyed my love for fox girls in visual novels. \n\nOverall rating: \n\nIts in the demo stages right now so I cannot give it a score for the time being. I will give it a rating of \"Enjoyable and want to see more to come.\"", "timestamp_created": 1447276205, "timestamp_updated": 1447276205, "voted_up": true, "votes_up": 18, "votes_funny": 1, "weighted_vote_score": "0.531037", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "19010438": {"recommendationid": "19010438", "author": {"steamid": "76561198007330588", "num_games_owned": 229, "num_reviews": 53, "playtime_forever": 1171, "playtime_last_two_weeks": 0, "last_played": 1489410173}, "language": "english", "review": "This game is a good start to a new gender blender game. virtual novel\n\nthe game does a lot of things right unlike their first game.\nthe story so far is much better written. and they focus this time\non one main character. witch is a big plus. as you can get to know the main character max more.\nthere is also an annimation in the game of the main transformation, and looks rather nice.\nthe game character models also look much better then their first attemt in their first game.\n\nso far I have no coplaints. \nI only recomend this game to poeple that like VN, games \nknow its still in alpha, and not yet complete. \nso only buy if you are a fan of their work or simply love transformation games. \n\nSmall Edit.\nAs fun as the story is in the beginning nearing the end it all falls too short for me.\nAnd was left feeling disapointed.", "timestamp_created": 1447243179, "timestamp_updated": 1512317322, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.453285", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 69, "total_negative": 3, "total_reviews": 72}}
