{"reviews": {"39326559": {"recommendationid": "39326559", "author": {"steamid": "76561198068478670", "num_games_owned": 43, "num_reviews": 7, "playtime_forever": 772, "playtime_last_two_weeks": 448, "last_played": 1515662488}, "language": "english", "review": "I've beat the game and these are my opinions:\n[h1]PRO'S\t[/h1]\n[olist]\n    [*]Great nostalgic game for 90's generations\n    [*]Having subquest and hidden bosses is a big plus!!! \n    [*]If you think the puzzle is too hard, don't be a douchebag and try to solve it rather than crying like a weak ass; IMO the puzzle is not hard\n[/olist]\n\n[h1]CON'S\t[/h1]\n[olist]\n    [*]Dry humour and dialogues, seriously guys, you are trying too hard to be funny...\n    [*]The world map is too tiny, we want more hidden areas, bosses and quests\n    [*]The devs seems to be obsessed with Sliding Ball Puzzle and Cart Rail Puzzle; Create another challenging puzzle please...\n    [*]No random battles means no levelling up, we need to re-enter the dungeon..this is annoying; The most stupid part is the monster blocking the way, you are forced to fight it, if you want to have \"Visible enemies - no random encounter\" do it like Chrono Trigger, the enemies are moving around and not just sitting there blocking your path like Snorlax\n[/olist]\n\nBuy this if you are into old gens rpg or want to try the experiences of games before \"graphic boasting era\"", "timestamp_created": 1515897325, "timestamp_updated": 1515897642, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "39141481": {"recommendationid": "39141481", "author": {"steamid": "76561198078646163", "num_games_owned": 95, "num_reviews": 9, "playtime_forever": 1177, "playtime_last_two_weeks": 415, "last_played": 1515301684}, "language": "english", "review": "As other reviews agree, the resemblance to early Final Fantasy or Chrono Trigger is obvious. Plot and characters were pretty cliche, with a few exceptions, but none of it was even close to being bad enough to deter me from the story (Curtis was infinitely entertaining).  Combat was fun - I feel like I used almost all the moves available per character on a regular basis, indicating nobody felt useless and moveslots weren't wasted. Atmosphere was beautiful. Not the most striking pixel art I've seen (cue Owlboy), but certainly captivating and immersive. Great variety in settings. Music was so-so, always fit the scene but didn't go above expectations.\n\nPuzzle variety was nice - I count at least six different kinds, but sadly the block-pushing sort was just pervasive. Other puzzle types weren't used nearly as often, leading to dungeons feeling a bit tedious after a time. All in all, Shadows of Adam nailed the retro JRPG feel it was going for, but as a result also failed to surprise me most of the time.", "timestamp_created": 1515303151, "timestamp_updated": 1515303151, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.470588", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38784623": {"recommendationid": "38784623", "author": {"steamid": "76561197999294964", "num_games_owned": 420, "num_reviews": 16, "playtime_forever": 569, "playtime_last_two_weeks": 0, "last_played": 1514309124}, "language": "english", "review": "Overall I find Shadows of Adam to be a great little RPG, which is very newbie friendly as well, but it could use a bit of polish.\n\nThe writing and humor could use some work, and I wish it turned more serious a bit earlier than it did, but it works just fine.\n\nIt has no random encounters. Instead it uses fixed static encounters (that respawn if you leave an area) that block the way forward and some of the treasure chests. It's a little bit on the easy side in my opinion, with the exception of one boss fight that apparently glitched on my side causing it to be a lot harder than it was supposed to be. One of the best combat features is that it actually requires the use of skills/spells instead of being simply \"mash attack until I win\".\n\nPlotwise it isn't a masterpiece, going with a \"My dad shows up as a ghostly figure looking for help and we have to save him!\" with some \"There was a war 100 years ago and now we need to fix the thing that happened due to it.\" thrown in for good measure. As the game overall feels more aimed towards newer players (at least in my opinion) it's definitely not a bad plot as far as that goes. The pacing works really well too, it never bogs down too much with unnecessary dialogue or forced \"side\" activities.\n\nI did however run into a few bugs and glitches.I'll list the below, but do know that I have sent bug reports and videos to the developers who are looking into what caused them and they generally seem to have a good idea on how to fix most of them.\n- One boss glitched so that it did up to 8 attacks per turn instead of the 2 attacks per turn it's supposed to do, making it quite difficulty to beat.\n- One of my characters (Kellan) died at the end of a battle and ended up with negative HP which apparently made him immune to resurrection spells and items forcing me to reload the game.\n- Spoilers for the end of the game where I had one final glitch: [spoiler] The final boss decided to skip it's more powerful form and got stuck in a super easy loop the second time I fought it. [/spoiler]\n\nAs I mentioned at the very start of the review it's a pretty great game, but could use some polish. But it's definitely not a bad way to spend 8-12 hours, especially not if you're just starting your RPG journey.", "timestamp_created": 1514476541, "timestamp_updated": 1514476541, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.494382", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38761811": {"recommendationid": "38761811", "author": {"steamid": "76561198302364177", "num_games_owned": 54, "num_reviews": 1, "playtime_forever": 850, "playtime_last_two_weeks": 0, "last_played": 1515138097}, "language": "english", "review": "A Charming game with colourful pixel graphics and a nice bit-tune soundtrack, simple but effective.", "timestamp_created": 1514425114, "timestamp_updated": 1514425114, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.470588", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38760159": {"recommendationid": "38760159", "author": {"steamid": "76561198321740054", "num_games_owned": 34, "num_reviews": 35, "playtime_forever": 18, "playtime_last_two_weeks": 0, "last_played": 1514420978}, "language": "english", "review": "Do yourself a favor and go play an actual classic JRPG in your favorite retro gaming platform instead of Shadows of Adam. This game doesn't compare to the best old titles on anything: art, music, controls, battle system, level design, you name it...\n\nIs it fair comparing an indie game to the best games made two decades ago, like your Final Fantasies, Breath of Fires and Phantasy Stars? It probably isn't. On the other hand, when all this game is doing is trying to be a throwback to that 8 bit and 16 bit era of gaming, there's really nothing else you could compare it to (except maybe other games that go for that retro JRPG vibe like Undertale but I'm not even going to start comparing this bland game to an effing masterpiece like Undertale).", "timestamp_created": 1514421283, "timestamp_updated": 1514421283, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.524499", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38694907": {"recommendationid": "38694907", "author": {"steamid": "76561198020935870", "num_games_owned": 260, "num_reviews": 75, "playtime_forever": 789, "playtime_last_two_weeks": 0, "last_played": 1514289381}, "language": "english", "review": "Let's start with a very important statement: Shadows of Adam is a recreation of jRPGs from the 90's. It's not a simple love letter and it's definitely not filled with lazy references to older games. It stands on its own and it's clear that the developers put a lot of effort in understanding how the classic jRPGs were made, what was their structure, tone and topics. I'm not sure if it was the goal, but the story itself very uses a lot of ideas described in \"The Hero With A Thousand Faces\", what only highlights the fact that there's a lot of good, old but tested and working ideas.\n\nThe writing is both the greatest quality and the main problem of this game. The story is overall great, characters have interesting personalities and the dialogues aren't boring, even though they're not fascinating. At first I was weary that the game will be focused on chasing some boring element-related macguffins, like many of the older games, but the writer smoothly used it as a disguise for some interesting and creative ideas. \n\nHowever, similar to games such as Final Fantasy VI (III in USA), the comedy put in the game doesn't work that well. There's a ton of bad puns, childish squabbles between two of the main characters and a lot of moments that don't feel natural in the game's rhythm. Too often it feels as if the game is looking for comic reliefs, even though it never really needs them and sometimes has a great pieces of comedy writing in it. I don't understand why did we need so many childish, even clownish characters. I don't mind making one of the main villains a complete goofball and I don't want to say that the comedy in the game was inexcusable, just pushed a bit too much. \n\nAlso, I hate how the characters keep having dialogue lines as \"...\" / \"(name)...\" / \"I guess...\" and so on. God damn it stop. Please stop.\n\nWriting aside, the game has quite interesting battles though I wish there would be an automatic victory option, like in \"Ara Fell\", since some of them are a bit repetitive - as turn-based battles tend to be. Sound effects are great and graphics, including battle animations, are beautiful, but the majority of the music, even though loops well, is forgettable and deserves an improvement. Some parts of the game introduce puzzle elements, but the camera makes it difficult to predict where the character can actually walk through. Many times I was surprised that a large corridor was blocked because it was \"in the middle\" of two tiles, while in other times the character was walking at tiny edges like a ballerina. \n\nOverall, a great game. Not without problems, but they stay in the shadows and some of them may be completely unrelatable to you. If you don't like retro-jRPGs, this one won't really change your mind, but if you wish they could be available in their former glory on your Steam, this one is a great option.", "timestamp_created": 1514291469, "timestamp_updated": 1514291469, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38617596": {"recommendationid": "38617596", "author": {"steamid": "76561198007654420", "num_games_owned": 10, "num_reviews": 2, "playtime_forever": 1531, "playtime_last_two_weeks": 0, "last_played": 1514453826}, "language": "brazilian", "review": "O jogo é simplesmente sensacional, nos remete ao jogos da velha guarda, graficos lindos, dificuldade boa, puzzles equipamentos legais, o único ponto que ficou faltando para mim foi uma maior duração.", "timestamp_created": 1514113884, "timestamp_updated": 1514113884, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38568698": {"recommendationid": "38568698", "author": {"steamid": "76561198000878931", "num_games_owned": 731, "num_reviews": 52, "playtime_forever": 1112, "playtime_last_two_weeks": 0, "last_played": 1514036710}, "language": "english", "review": "Definitly worth a purchess  i'd also reccomend buying it at full price and the dlc as well not just on sale as there is plenty game here to keep you entertained. My only gripe with the game is stupid sliding block puzzles even in triple a games i never liked them mainly because i over think for  a saloution and end up trying to solve it for hours. \n\nWith that out of the way . This is a classic 2d turn based rpg with a small twist. instead of magic points each character has the same ammount of ap at 100% spells are rated by percent as well. One move will be something like 15% to use while another will take 45%  ect . \n\nI like this as it adds a layer of stradegy of when tto use certaning skill and you can't just spam ultima like you can in final fantasy games.   Ap also recovers every turn so if you happen to be low on it you can wither  defend or just normally attack to recover it,\n\nThere is not a sound track i did not like in the game pretty much every track i found my self humming along to especially the earth cave music which pulled on my nostalgia strings a little. It's composed by Tyler mire so go show him some love. https://twitter.com/mire_tyler \n\nOver one youtube i am currently working on a playthrough for the game so to see some gameplay footage be sure to check that out if your interested  \n\nhttps://www.youtube.com/playlist?list=PL55HrPk2f7R6HUmCcAzMYRyc-hO7tj0BR", "timestamp_created": 1514020163, "timestamp_updated": 1514042701, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.467980", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38426358": {"recommendationid": "38426358", "author": {"steamid": "76561198449444981", "num_games_owned": 16, "num_reviews": 6, "playtime_forever": 1622, "playtime_last_two_weeks": 0, "last_played": 1512404442}, "language": "english", "review": "[b]Shadows of Adam[/b] is more than a love letter to SNES era RPGS. This is a beautifully designed masterpiece, serenading you with its mesmerising score and visual aesthetic. Good God, Shadows of Adam is the very best ‘retro inspired rpg’ I have played. There, I said it.\n\nI scrapped and rewrote this review several times. I almost binned it altogether. I’m a real connoisseur of nostalgia fuelled retro stylised video games and Shadows stumped me.\nI enjoyed my adventures in the SoA so much that it became almost impossible for me to critique it in a fair and proper way. How do you accurately and fairly critique the best retro inspired RPG you've ever played without just dribbling and flapping all over the bloody place!? \n\n[H1]OK, so it looks and sounds fantastic, but how does it play?[/h1]\nTo call SoA short but sweet would be a massive understatement. The story and way that you progress through the game world is so perfectly paced! This is not a 200 hour RPG, it’s just long enough to reel you in but there's absolutely no grind, it never gets tedious. Which is impressive because if you go back and play a few of the Golden era RPGs that we all remember so fondly, you'll likely find yourself getting bored or frustrated by some of the dated game design aspects. The characters and their personalities are intriguing and interesting. The game has plenty of slap stick humour that helps to build your connection to the characters. \n\n[H1]No more random battles[/H1]I’ve always loved random battles in RPGs, but some games get them so wrong.  In SoA you’ll find encounters scattered throughout the game world, it really feels like each battle has been meticulously placed so as not to create a grindy experience. The boss fights are interesting and fresh, you can beat each boss with some careful planning and strategy, rather than just grinding up your stats and whomping through each boss. The way that you can stack damage and deliver massive blows using buffs and de-buffs is really fun.\n\nYou cannot buy a retro inspired RPG that has this level of quality and polish because it doesn’t exists. Grab Shadows now and fall in love with your childhood all over again. Awesome.\n[h1]5/5[/h1]\n\nPlease check out and follow my Steam Curator where I shine a light on the very best indie games and occasionally poke fun at some of the worst.\nhttp://store.steampowered.com/curator/31321063/", "timestamp_created": 1513671992, "timestamp_updated": 1513672941, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.513274", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38319162": {"recommendationid": "38319162", "author": {"steamid": "76561197995894805", "num_games_owned": 561, "num_reviews": 40, "playtime_forever": 739, "playtime_last_two_weeks": 0, "last_played": 1513325389}, "language": "english", "review": "Good and challenging, retro and fun. Pretty generic Final Fantasy 'find the crystals in a world with magic (and also daddy issues)' story, but hey, that's part of the retro charm. It's short, about 12 hours, and they advertise that on their website. Nerd factoid: it appears to be done entirely in javascript with electron, which I wasn't expecting, but without RPG maker it ends up feeling more unique than games that are. The graphics sure are pretty too. Someone knows how to do pixel art.\n\nWorthwhile play!", "timestamp_created": 1513325527, "timestamp_updated": 1513325527, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38047488": {"recommendationid": "38047488", "author": {"steamid": "76561197970731100", "num_games_owned": 219, "num_reviews": 53, "playtime_forever": 837, "playtime_last_two_weeks": 0, "last_played": 1512351028}, "language": "english", "review": "Basically Final Fantasy Mystic Quest 2", "timestamp_created": 1512351197, "timestamp_updated": 1512351197, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.517027", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37848098": {"recommendationid": "37848098", "author": {"steamid": "76561198024925713", "num_games_owned": 159, "num_reviews": 16, "playtime_forever": 1052, "playtime_last_two_weeks": 0, "last_played": 1511841028}, "language": "english", "review": "I backed this game on Kickstarter and am very happy with it, if for no other reason than it actually got done and it's fun.  It's very much a love letter to older console-style RPGs, especially certain Final Fantasy games.  At times it feels like it goes a bit beyond 'homage' into 'derivative', but the aesthetic and gameplay really make up for it.  The sprites look great and the world has a great look and feel.  Combat is fast with the right level of balance; trash mobs aren't very annoying while bosses can wreck you if you're not careful.  The way skills are handled in combat is great - basing everything on percentages of the AP bar instead of fussing with discrete MP values makes things flow much more easily, and everyone having ways to recharge AP means there's no need to ration it while exploring dungeons.  The puzzles interspered in the dungeons are tough without being ridiculous, and quite solvable without needing to hunt down a guide or checking the message boards.  I haven't tried the DLC yet - I grabbed it because I want to replay the game but the base game doesn't really have replay value.  I'm looking forward to trying a New Game +, and hitting all the achievements.\n\nIf you like these kinds of RPGs, you'll like this game.  Based on what I saw during the Kickstarter and now on the message boards, the devs seem very involved and responsive.  I'm looking forward to whatever their next game is, and hoping they improve on what's weak, build on what's great, and come out with another fun game.", "timestamp_created": 1511840673, "timestamp_updated": 1511840673, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.489691", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37818682": {"recommendationid": "37818682", "author": {"steamid": "76561197982917310", "num_games_owned": 1424, "num_reviews": 3, "playtime_forever": 1033, "playtime_last_two_weeks": 0, "last_played": 1507644754}, "language": "english", "review": "There are many games which try to appear like classics out of the golden era of SNES-RPGs. This one comes very close.\n\nWhy?  Well I just remember myself visiting a port-town of Adam. During exploration the following thoughts came into my mind: \"If this would be an old SNES-RPG there would be a hidden entrance to that house when I move the character right behind it...\" Let's try that for nostalgic reasons. A few moments later the screen turned black and when there was light again a dusty chest stands right in front of me. That left a big smile on my face - really satisfying. :)\n\nThe game also provides many other great features:\n\n* Enemies mostly follow a well thought strategy\n* some very well hidden Treasure chests which require you to observe nearly EVERY single wall of the entire game\n* Boss battles could turn very hard if you don't level up frequently\n* some interesting puzzles (e.g. water labyrinth with levers, floating orb puzzles)\n* interesting story (unfortunately a bit short) / characters with background-information\n\nLast but not least: There's still new content!\n\nIf you liked games like Lufia or Mystic Quest Legend I'm sure you'll enjoy this one too...", "timestamp_created": 1511812963, "timestamp_updated": 1511812963, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37230750": {"recommendationid": "37230750", "author": {"steamid": "76561198245401814", "num_games_owned": 20, "num_reviews": 1, "playtime_forever": 1478, "playtime_last_two_weeks": 0, "last_played": 1511480893}, "language": "english", "review": "Just finished playing through and had blast. Overall great game--hard to imagine that someone who enjoyed Squaresoft's SNES  games wouldn't enjoy this. Felt to be like a cross between FFIV and Lufia II. Some things I particularly appreciated:\n\n- being able to save anywhere eliminated a lot of the tedium that sometimes comes with rpgs\n- no random battles, no need to grind\n- being able to experiment with the grand rel. by removing socketed items meant that you didn't have to wait to the end game to start using these powerful items\n- the puzzles were hard and satisfying\n- most of the skills were useful throughout the game \n- the game wasn't in general self-indulgent, and little self-indulgences, like inserting at least two (three?) of the developers into the game as irresponsible soldiers, weren't apparent until later and then made me smile rather than cringe\n- the length of the game was great. Long enough to have depth, but didn't drag on\n\nAdditionally, the developers are very responsive and friendly on the forums and clearly care about users' experiences. The game seems to a lot of potential for hacking/modding and I'd be surprised if some interesting user-generated content doesn't appear in the future. I'd like to see an enhanced difficulty mod or extensions to the battle arena.", "timestamp_created": 1511480804, "timestamp_updated": 1511480804, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.518072", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36944065": {"recommendationid": "36944065", "author": {"steamid": "76561198019894979", "num_games_owned": 675, "num_reviews": 2, "playtime_forever": 1759, "playtime_last_two_weeks": 0, "last_played": 1511700120}, "language": "english", "review": "This game is a true love letter to old school RPGs of the 16-bit era. It takes what you most love about games from that time (deep characters, excellent music, wonderful pixel art style, and a sense of humor that never takes itself too seriously) and combines it with modern gaming conventions that allow it to stand among the games of today (saving anywhere, properly balanced difficulty, a magic/ability system that is intuitive and fun, and an astonishing attention to detail). This Kickstarter darling is a fantastic RPG that anyone looking for a good adventure should definitely NOT miss out on.", "timestamp_created": 1511414954, "timestamp_updated": 1511415039, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36709927": {"recommendationid": "36709927", "author": {"steamid": "76561198109056948", "num_games_owned": 1503, "num_reviews": 27, "playtime_forever": 2672, "playtime_last_two_weeks": 70, "last_played": 1516174873}, "language": "english", "review": "This game exceeded all of my expectations. It's challenging, fun, engaging, and best of all, it's often HILARIOUS. If you get nostalgic for the ol' 16-bit era SNES RPGs, then this is for you. And don't forget to get the DLC \"Guild of the Artificers.\" The deluxe version is worth it, even at full price.", "timestamp_created": 1511374880, "timestamp_updated": 1511374880, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.526066", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36541264": {"recommendationid": "36541264", "author": {"steamid": "76561198064352388", "num_games_owned": 149, "num_reviews": 1, "playtime_forever": 219, "playtime_last_two_weeks": 0, "last_played": 1509318414}, "language": "english", "review": "When I first caught word of Shadows of Adam, I admit I was skeptical. However, my opinion changed as I followed Something Classic’s twitter, and got further news on SOA.  When I got ahold of Something Classic, for a streamer’s review copy,  they were more than happy to allow someone to review the game on stream.  I was pleasantly surprised when I booted up Shadows of Adam, in spite of the issues I had getting it to run on stream. The game could not be streamed right out of the box with game capture, until we found out you have to set compatibility mode to windows 8, and run with a window capture. My ps4 controller also refused to work, unless I ran the game from its install folder, and not from steam.\n\nThe following is a breakdown of each game element, and my personal opinion. Though I recieved the game for free, it plays no bearing on how I will review it.\n\nGraphics:  When playing this game on stream, I had to constantly hold back my enthusiasm for how great Shadows of Adam looked.  It brought back feelings of plugging the cartridge in, and waiting for my CRT to give that distinctive hum as it turned on.  Character attacks have a certain flair to them, look pretty to use, and feel powerful, especially the magical attacks of Asrael. The team at Something Classic poured their soul into the sprite work and it shows. Area maps drip with atmosphere, colors pop, and I found myself just admiring everything as I played.\n\nSound: Tyler Mire’s sound design invokes a certain feeling, the melodies that play with each battle, character, scene, and story twist invoke that snes style.  I did find some issues with looping within the first two towns. However this is not enough to detract from the overall feel of the soundtrack. \n\nGameplay: Instead of having random battles, Something Classic opted for on screen enemies. However not all of them can be skipped, especially when you are searching for hidden loot. This removes the need for grinding and in turn provides you with a learn as you go experience. Each battle will be tougher than the last, causing you to use your newly learned skills. Within the battle system itself is the encouragement to use your most powerful abilities whenever you want.  As AP recharges over time, and with skills such as Taunt/Focus/Meditate. There is no need to save everything for one big boss battle. There is also a degree of tactics needed for the battles in managing your AP properly for high damage output.  Some fights seem to produce bugs within enemy AI. I once had a foe who was frozen, and could not move due to a status ailment, but their partner was able to blur them. Giving me a target that could not be hit or taunted again due to already being taunted.  There is a massive difficulty spike when you reach a certain area. Where the monsters instant death attacks seem to hit quite often. Which caused me a couple of resets.\n\nIn the Guild of the Artificers DLC a special accessory combination system is added. Which allows for outrageous combinations of 3 other accessories.  Allowing the player to “break” the game by giving absurd abilities. Such as  never missing attacks, attacking two times in a row, and always criting with hits. It is up to the player’s imagination to discover their own style with these special combinations.\n\n\nStory: Without spoiling anything, Shadows of Adam spins a wondrous tale. The story is not complex, but it does have a couple of twists. You will expect the twists, however they will come in a form that you will not expect.  By only having four playable characters the game laser focuses its story on them, their interactions, and how the world flows around them. Each character has a story you want to learn more about.  However, the game is woefully short. About 10-15 hours if you focus on story alone.  I would like to see more, there is so much about the game world that I want to know, and feel. \n\n\nSummary: Shadows of Adam is a wonderful throwback to the SNES genre, that takes its own spin on the system and runs with it. The story, characters, graphics, and gameplay, while sprinkled with a few bugs is top notch. I found myself wanting to play more. This game sent me back to my childhood of eating sugary cereals and playing videogames on a saturday morning. A time where I fell into a story and found myself a part of the game’s world.  This game is a must have for anyone looking to get that feeling again. \n\nThank you to Something Classic, for making a wonderful game. I look forward to your future projects and hope for your success. \n", "timestamp_created": 1510789141, "timestamp_updated": 1510789141, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36195665": {"recommendationid": "36195665", "author": {"steamid": "76561198026069206", "num_games_owned": 202, "num_reviews": 14, "playtime_forever": 766, "playtime_last_two_weeks": 0, "last_played": 1509552577}, "language": "german", "review": "Tolle Story und ein gut durchdachtes Kampfsystem! Nicht vom generischen Namen abschrecken lassen, wer old-school jrpgs mag, wird Shadows of Adam lieben :)", "timestamp_created": 1509552727, "timestamp_updated": 1509552727, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35114609": {"recommendationid": "35114609", "author": {"steamid": "76561197960403790", "num_games_owned": 444, "num_reviews": 10, "playtime_forever": 536, "playtime_last_two_weeks": 0, "last_played": 1506819280}, "language": "german", "review": "Searched a long time for that feeling I had playing Final Fantasy on my Gameboy at night with a Flashlight...\nSeems I found it :)", "timestamp_created": 1506030488, "timestamp_updated": 1506030488, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35081249": {"recommendationid": "35081249", "author": {"steamid": "76561198029242857", "num_games_owned": 395, "num_reviews": 51, "playtime_forever": 429, "playtime_last_two_weeks": 0, "last_played": 1508969308}, "language": "english", "review": "Hi all, \n\nLet me say a little something about Shadow of Adam: \nThis lovely game really deserves to get more attention and people who like to play and purchase old school feel, retro snes type games. It's a basic old school rts that's not telling a compellingly deep story, but it's still good to follow through nonetheless. The graphics i personally think are very well done and really add to that classic feeling from the past. The game is not that lengthy (9-12h) depending on your playstyle it could be a bit more, but the developers are including new dlcs as we speak (Oct. 2nd 2017) which will add to the overall enjoyability and length of the game including new features and whatnot. \nThe sound/music is overall enjoyable too, but please also note it's similar to those scores and sounds from way back in the snes/Super Nintendo days.. So they've basically kept it all as real as possible which to me just adds to the whole as a retro game should be in the end. (But i know it will not fancy everyone who isn't yet as old als me) ^_^ \nTo conclude, it's a very enjoyable game guys but keep in mind that this game offers nothing spectacular, however what if does offer works very well together as a whole and it's very stable on whatever system you like running it on. \nThe developers are all very nice and responsive to feedback and offer help as soon as they can, which is always a really nice way to support the future projects for this developing team. \nThere's still more to say about this game obviously, but i'm not a man of many hints or spoilers so i can only advice others to check out the game (it's also offering regular discounts etc) and it's not expensive to get at all considering what you get in return. \nGive it a try guys, and thumbs up if you like it and if not well refund it for something else (Steam). \n\nCheers!", "timestamp_created": 1505902942, "timestamp_updated": 1505902942, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.506897", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34979924": {"recommendationid": "34979924", "author": {"steamid": "76561198188939413", "num_games_owned": 578, "num_reviews": 6, "playtime_forever": 98, "playtime_last_two_weeks": 20, "last_played": 1515330745}, "language": "english", "review": "A talking save point remind you to save the game and heal you just before the first boss,\neven though you can save anywhere in the game.\nvery great game. 10/10. need more of this good guy talking save point.\n\nJokes aside,\nI think this game mainly appeal to those who plays older RPGs with the pixel graphics.\nFor me this game remind me so much of RPGs that I used to play when I was little.\nAnd because of that, I decided to try this game, and I must say I'm really impressed.\n\nThe game have a very well-made pixel graphic with great battle, walking, and even expression animation.\nThe music is really great and really capture the moments in the game.\nThe Battle system uses simple RPG basics such as attacks, skills, magic, equips, with no confusing stuff, and that is a big plus for me.\nThe story is good with some comedy here and there. (I might need to update this later after beating the game)\n\nI definitely recommend this game for those who likes a well-crafted old-style RPG.\nAlso a new DLC is coming up that adds New Game+ Content. The more reason to play this game!", "timestamp_created": 1505504896, "timestamp_updated": 1505507682, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.508352", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34927515": {"recommendationid": "34927515", "author": {"steamid": "76561197996138858", "num_games_owned": 392, "num_reviews": 14, "playtime_forever": 996, "playtime_last_two_weeks": 0, "last_played": 1505337870}, "language": "french", "review": "Super RPG qui rappel la bonne époque de la supernes, l'ost est très sympa, l'ambiance rappel bien les rpgs d'antans et pour finir le pixel art est très soigné.\nJe conseil vivement :)", "timestamp_created": 1505338053, "timestamp_updated": 1505338106, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34926743": {"recommendationid": "34926743", "author": {"steamid": "76561198419244325", "num_games_owned": 7, "num_reviews": 1, "playtime_forever": 881, "playtime_last_two_weeks": 0, "last_played": 1510110682}, "language": "english", "review": "Fantastic recreation of old school 8-bit rpgs. Combat is not difficult, game is relatively short, but all in all it was an enjoyable experience.", "timestamp_created": 1505334654, "timestamp_updated": 1505334654, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34912948": {"recommendationid": "34912948", "author": {"steamid": "76561197989563720", "num_games_owned": 724, "num_reviews": 17, "playtime_forever": 825, "playtime_last_two_weeks": 0, "last_played": 1505274032}, "language": "english", "review": "[h1]How mystic legends are born[/h1]\n\nShadows of Adam brings back the old SNES era JRPG style with many inspirations that shows clearly both in its presentation and gameplay.\n\nFor example, one hour into the game and you will make parallels between this game and Mystic Quest, Lufia II, Secret of the Stars and many other. Along with a turn-based battle system using an AP system where you recover some AP every turn and unique skills for every character that can synergize quite well with one another, the animation quality is quite top notch and surprisingly pleasant.\n\nThe soundtrack, which is available as a separate download, sounds very retro with a few memorable themes. At times however, there seems to be a disrepancy between the styles used as some themes will definitively feel like an attempt to reproduce MIDI chips while other themes will be much more orchestrated in style. As for overall sound design, battles definitively feel much more impactful than expected, with hits and skills being satisfactingly deep and crisp.\n\nThe story is entertaining yet not something that will blow away expectations. However, it has enough original ideas to make you continue on your quest. Some characters are quite interesting and funny while one in particular is a dead giveaway for a well known antagonist from another JRPG. Regardless, the heroes themselves have interesting personalities that, unlike most recent JRPGs, aren't too outlandish or exagerated; for the genre, the heroes feel grounded and believable instead of face-palmingly annoying.\n\nThe pacing is controlled in dungeon by the use of puzzles that uses specific mechanics. Some of these puzzles will leave you pondering on the solution for quite some time (and for that, let me advise you : the solution is usually far less complex than you expect) which lengthens the experience. All in all, I believe a good hour to an hour and a half might've been of puzzle solving. And the final dungeon gave a twist with one of the puzzles that I really didn't expect.\n\nGear progression is linear in that most towns will give you progressively better gear while dungeons will have a few unique pieces hidden behind more difficult puzzles. Given the gear is divived only between Weapon, Armor and Accessory, I was pleased that seeking the harder to find items often gave a serious boon to your characters.\n\n[h1]Verdict...[/h1]\n\nOverall, the experience is very nice for the price tag and the game can run for around 12 to 14 hours, depending on your puzzle deduction skills and willingness to search for secrets and endgame quests for the truly powerful equipment.\n\nIf you're looking for a little throwback to the early SNES era JRPGs and want something that feels polished as you play it, then this title definitively deserves to be given a try.\n\nIt definitively makes me look forward to the next game this developer will create.", "timestamp_created": 1505275630, "timestamp_updated": 1505275772, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.506897", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34515728": {"recommendationid": "34515728", "author": {"steamid": "76561197973097301", "num_games_owned": 126, "num_reviews": 11, "playtime_forever": 744, "playtime_last_two_weeks": 0, "last_played": 1503786138}, "language": "english", "review": "A fun, short (my total playtime was 12 hours, and I missed a few secrets) RPG that brings to mind late NES and early SNES era games, especially Final Fantasy: Mystic Quest. The best thing about it by far is the combat system, which uses a %-based system where each skill consumes a set amount, and you regenerate a set amount at the beginning of each combat round. The game has no random encounters, which is pleasant, with enemies appearing stationary and generally just blocking your path.\n\nThe downside is that the game's dialogue, characters, and story are pretty forgettable, and what drove me to keep playing was learning new abilities, finding new gear, and coming up with new strategies to fight the enemies. The combat system is definitely the game's strong point -- I ended up not really caring about the characters or their motivations. The graphics are reasonably well-done with only some minor silliness here and there (like a wide space that looks like you could walk through being impassable, or blatant arrows showing where you can jump down instead of a subtler, more natural-looking hint).\n\nMy other complaints are minor and come down to personal preference. Each character only has three equipment slots: a weapon, an armour, and an accessory, which is a bit lacking compared to some RPGs. Additionally, aside from choosing an accessory (and some optional endgame gear), there's no real customization for characters in terms of skills or stats. They always level up the same way and learn the same skills at the same levels. This is fine for a relatively simple game like this, but if you're looking for extensive character cutomization, you won't find it here. Lastly, some of the enemies in optional lategame dungeons are very frustrating to deal with -- not a major strike against the game, just a personal gripe.", "timestamp_created": 1503786851, "timestamp_updated": 1503786851, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.557143", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34386061": {"recommendationid": "34386061", "author": {"steamid": "76561198013674073", "num_games_owned": 240, "num_reviews": 33, "playtime_forever": 799, "playtime_last_two_weeks": 0, "last_played": 1509062511}, "language": "english", "review": "Keepin' it simple. Great game. Has an awesome cast of memorable characters with a story that kept me hooked. The OST is wonderful and fits in nicely. The combat is fun and rewarding. Pixel graphics are on point.", "timestamp_created": 1503280762, "timestamp_updated": 1503280762, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.580601", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33824184": {"recommendationid": "33824184", "author": {"steamid": "76561198026459618", "num_games_owned": 187, "num_reviews": 16, "playtime_forever": 1614, "playtime_last_two_weeks": 0, "last_played": 1501130454}, "language": "english", "review": "Decent little jRPG style game worth about 9-10 hours on a first run through and more DLC content coming to inflate that. Graphics inspired by the likes of Lufia and Final Fantasy 5, it has a great classic style to it. The main party are all fairly well fleshed out, getting several backstory flashbacks over the course of the game letting you know who these people are and their motivation for following their quest. The battle system is simple but has enough complexity that it isn't just button mashing. It's certainly a great attempt by an indie developer and delivered on a lot of promises by its kickstarter campaign to deliver a classic style RPG. \n\nIt isn't perfect though. The story is a little too simple. It isn't quite 'save the princess from the dragon' and as I said, the main characters are well fleshed out, but side characters are pretty much just stereotypes dropped in to move the plot along and the antagonist is a little too derivative of Final Fantasy 6's Kefka without much of the charm and comes off very two dimensional. What is developed of the setting is good, but several elements are mentioned or teased but never expanded on, particularly at points it would have made sense to (that I won't get into due to spoilers). The game is also very linear with little deviation from the main quest until a point toward the end, which, while appreciated would have been nicer to see threaded earlier in the game. \n\nCombat could also be tweaked a little more. Particularly early on, it can feel frustrating trying to use the AP gain abilities only to kill the enemies with other characters and end up losing out on the AP so you're less prepared for the next battle without burning recovery items. A 'Defend' option to pass a turn would have been nice at some points. Finally, later on weaknesses/resistances start to matter a lot and it isn't always clear what type of damage every ability does outside of just assumption if they're not labeled. Certain abilities don't seem quite as useful either. The gear system is okay, very simple 'new weapon/armor = clear upgrade' until the end when you make the choice between straight attack power over secondary stats, which is nice. There's a glut of accessories but some of them are so overly useful you don't use the vast majority of them, the DLC addresses this a little but maybe a 2nd accessory slot would've alleviated a lot of this. \n\nHowever, these are minor issues. As the first major entry by an indie company it shows a lot of promise and a lot of good ideas. It feels like a good framework for the company to build on in future entries and really this feels like the first Chapter in what could be a developed word. I'd love to see another installment or another game in this style that did something like included a larger party and spent more time in locations and let the story breathe a little more in a larger game world. \n\nDefinitely recommend!", "timestamp_created": 1501130404, "timestamp_updated": 1501130404, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.559934", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33606137": {"recommendationid": "33606137", "author": {"steamid": "76561198349195327", "num_games_owned": 126, "num_reviews": 55, "playtime_forever": 874, "playtime_last_two_weeks": 0, "last_played": 1500727772}, "language": "english", "review": "Still haven't gotten that far into the game, but it's an alright game. If you like classic RPGs you'll probably enjoy this game. So far my only grievances are with the abrupt black screen transitions between cutscenes and gameplay, awkward scripting and that the plot is a bit hard to follow at times, but this is just a matter of final polish. The graphics are quite good and the music is fitting, and the game does increase in difficulty overtime so I think it's a good game since it doesn't get too easy.\n\n\nEdit: Now that I've completed the game I gotta say I was a bit too harsh with passing judgment. You sorta get used to the things I mentioned above so those details aren't really any major issues. I think the reason I found myself skipping the plot all the time tho was because of lack of little character drawings by the dialog boxes. Having those could really aid in expressing the characters emotions since you can see their reactions and facial expressions, but also engage you in the story. All in all it was a really fun game once you get really into it.", "timestamp_created": 1500291880, "timestamp_updated": 1500727992, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.524439", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32894958": {"recommendationid": "32894958", "author": {"steamid": "76561198125538375", "num_games_owned": 15, "num_reviews": 1, "playtime_forever": 1455, "playtime_last_two_weeks": 0, "last_played": 1503263642}, "language": "english", "review": "This is a great game. It plays like a combination of Final Fantasy 4, 6, and Mystic Quest. That on top of a good storyline with jokes and funny banter between the main characters makes this a winner in my opinion. Especially if you played any of the 2D JRPG's on the SNES console as a child.", "timestamp_created": 1498603235, "timestamp_updated": 1498603235, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.567084", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32783369": {"recommendationid": "32783369", "author": {"steamid": "76561197991326387", "num_games_owned": 400, "num_reviews": 7, "playtime_forever": 914, "playtime_last_two_weeks": 0, "last_played": 1498415305}, "language": "english", "review": "Really nails the feel of the old snes squaresoft games without feeling too derivative,  The only gripes I can think of are that it is much shorter than the games it draws insperation from and some of the music tracks do not properly loop making them a bit hard on the ears.", "timestamp_created": 1498415561, "timestamp_updated": 1498415561, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.582818", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32741839": {"recommendationid": "32741839", "author": {"steamid": "76561198052960706", "num_games_owned": 64, "num_reviews": 6, "playtime_forever": 709, "playtime_last_two_weeks": 0, "last_played": 1498345253}, "language": "english", "review": "So I just completed Shadows of Adam over this weekend (the game is around 10-13 hours max) and as someone whom was around and played the games in my youth this game is clearly a love letter to (it looks and plays like Final Fantasy 6, Final Fantasy Mystic Quest + Lufia 2 had a love child), I have to say it was an enjoyable experience, (with a few writing and tone hiccups along the way).\n\nThe Battle System is surprisingly decent, although granted there were more then a few abilities I simply never used as I quickly figured out it was a better idea to spam the lower-mid range AP usage abilities with buffs up then the higher ones that left you with no AP. Honestly it was hard for me to NOT rely on just buffing Asrael's magic and using Double Up on her and then AoEing the enemies down later on in the game. With all the AoE abilities the enemies had access to, I just wanted to end the fights as fast as possible so I wouldn't be worn down for the Boss fights.\n\nLet me get into some pros and cons:\n\nPros\n-----\n- Beautfiul game with very nice retro graphic style and sprite art. I wish more companies would go this way instead of the polygon crap as I think it lends a ton of character.\n- Great soundtrack that feels like it could have been in an 16 bit RPG.\n- Battle System was very good (but could use a few tweaks both for what enemies use and what the characters get access to).\n- Decent pacing; I don't think it's anywhere near as well crafted as say Chrono Trigger or Final Fantasy 6, but it never feels like you're underpowered for what you're facing (except towards the latter half of the game, see below for more on that).\n\nCons\n-----\n- Some of the writing felt very, very, VERY \"In-Jokey\" in regards to the characters and some of the enemies you meet. I'm sure the Devs get a kick out of it, but as someone sitting down playing the game it tried my patience more then once. Talon (in a few scenes) and the Kefka wannabe villain (to me) were the biggest culprits of this.\n- Enemy balance issues. The toughest enemy to fight in the game isn't the last boss (by far), but random enemies you'll run into that are impossible to hit if they buff themselves and/or have magic AoE attacks that hit everyone for moderate damage they can spam. Oh and they counter AND double hit too. If you've played this game around halfway or three-quarters of the way through you'll know the enemies I'm talking about. A group of 3 of them with buffed HP + a tank monster would've been a tougher last boss then what we got.\n- World map is DAMN small. Like... I got the airship and was legitimately looking forward to exploring, and quickly realized flying around I had already seen 95% of what there was to see doing the main storyline...? It made me wonder if they shouldn't have bothered with a world map or airship at all.... or they were going to make the game much longer but ran into the developer hell of getting it out...? Not sure which it is but it was EXTREMELY disappointing. (Imagine if there were 3-5 other continents worth of stuff equivalent to the first 2 that you could start quest lines on. This game would instantly be an amazing classic instead of just good/very good).\n- Give us some different puzzles! The pushing the block ones were cool, but it'd have been great if each dungeon had their own unique puzzles to solve, (and maybe have the last dungeon be a culmination of them).\n- Nitpicky ... but I always hate games that give you items that negate melee damage.... but they don't matter as every single enemy spams magical attacks (or counts stuff that SHOULD be considered physical attacks such as bleed AoEs as magical) thus making that item fairly useless. I'm looking at you Wraith Shield.\n\nAnyways... overall it was a very well done game and easily the best RPG-throwback I've played here on Steam. Hopefully the Devs either make a sequel to this or take what they learned and produce something that's a step above this. Recommended.", "timestamp_created": 1498335164, "timestamp_updated": 1498335294, "voted_up": true, "votes_up": 16, "votes_funny": 1, "weighted_vote_score": "0.710660", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32579275": {"recommendationid": "32579275", "author": {"steamid": "76561198105620365", "num_games_owned": 41, "num_reviews": 2, "playtime_forever": 387, "playtime_last_two_weeks": 0, "last_played": 1497916585}, "language": "english", "review": "Really nice pixel art!  Very polished and fun game. =)", "timestamp_created": 1497916884, "timestamp_updated": 1497916884, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.436966", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31456282": {"recommendationid": "31456282", "author": {"steamid": "76561198002874170", "num_games_owned": 2507, "num_reviews": 56, "playtime_forever": 2044, "playtime_last_two_weeks": 0, "last_played": 1514314665}, "language": "english", "review": "I needed badly to scratch the turn based old school rpg itch. But I've been scared lately because RPG Maker has caused a lot of crap to show up on steam. This isn't that. It's got it's own engine. It also satisfied every desire I had. Great writing and stands on it's own. Worth the $15.", "timestamp_created": 1493531851, "timestamp_updated": 1493531851, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.562189", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31351400": {"recommendationid": "31351400", "author": {"steamid": "76561198034188195", "num_games_owned": 502, "num_reviews": 21, "playtime_forever": 984, "playtime_last_two_weeks": 0, "last_played": 1489212340}, "language": "english", "review": "Great old school RPG with clear influence from Final Fantasy 6 and FF mystic quest. \nThe game's kinda like FF mystic quest but with a decent story (Replaying it, it really had the most basic story ever...) and a really interesting battle system. \nMusics dont loop very well for a lot of songs which fairly annoying and few songs are actually memorable (especially problematic for the basic fight and boss theme that you'll hear many times) except for a couple ones.\nArt's done by one of the best pixel artists around and looks all around gorgeous.\n\nOverall if you're craving for an old school RPG with a more western style of writing and characters with strong personalities, then you should really consider buying this.", "timestamp_created": 1493098312, "timestamp_updated": 1493098312, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500069", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31218205": {"recommendationid": "31218205", "author": {"steamid": "76561198045379093", "num_games_owned": 110, "num_reviews": 35, "playtime_forever": 364, "playtime_last_two_weeks": 0, "last_played": 1492519645}, "language": "english", "review": "Shadows of Adam has this \"good ol' RPG\" feeling. Albeit a bit short (~10h to finish) it's still a great game for any RPG fan. It has good and interesting gameplay mechanics, puzzles, and is very well balanced, leading to very little to no frustration once you get the hang of it, which comes quickly.\nAll in all a solid game if you like the genre.", "timestamp_created": 1492521175, "timestamp_updated": 1492521175, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500069", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31127323": {"recommendationid": "31127323", "author": {"steamid": "76561198073088368", "num_games_owned": 369, "num_reviews": 92, "playtime_forever": 611, "playtime_last_two_weeks": 0, "last_played": 1492134355}, "language": "english", "review": "I just finished this game a few minutes ago and here are my thoughts about this game.\n\nThis game has some awesome music to listen to, the storyline of this game is awesome, & the battle mechanics in this game are pretty solid. The only thing about this game that'll leave you stumped for a while is a few of the puzzles but other than that I really enjoyed playing through this game.\n\nIf you are looking for a extremely fun RPG with a good storyline, then this is the game for you.", "timestamp_created": 1492134562, "timestamp_updated": 1492134562, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500693", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30990542": {"recommendationid": "30990542", "author": {"steamid": "76561198011257824", "num_games_owned": 354, "num_reviews": 12, "playtime_forever": 697, "playtime_last_two_weeks": 0, "last_played": 1491543227}, "language": "english", "review": "This game is an absolute must for any RPG fan - especially for ones grew up in NES/SNES era. It took me ~10 hours to beat with almost all secret items. Level design and environmental art are fantastic. Gameplay is fun, boss fight is a bit on the easy side for RPG veterans, but still very fun. And by the way this is not one of those low quality RPGMaker title, everything is crafted specifically for this game - glad I backed this in the kickstarter - and will back again if the creator want to do expansion.\n\nBuy it! Recommended!", "timestamp_created": 1491536813, "timestamp_updated": 1491536813, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500069", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30972765": {"recommendationid": "30972765", "author": {"steamid": "76561198043379143", "num_games_owned": 11, "num_reviews": 3, "playtime_forever": 1394, "playtime_last_two_weeks": 0, "last_played": 1503105979}, "language": "english", "review": "\n\nThis is an excellent game, with quality close to what you would expect from Square's SNES RPGs.  It is a bit shorter though, maybe about a third of the size that one would expect.  So given that, I would say that this game is worth about $30, yet it only costs $15.\n\nGAMEPLAY: The combat system is great!  I would say that it is better than any SNES RPG that I've played.  The characters each have about a dozen interesting abilities that remain useful until the very end.  Each character only has 100 AP (mana) but it automatically refills 15 points per turn, 30 if you skip your turn.  This encourages you to use a mix of cheap abilities, expensive abilities, basic attacks, and skips.  My one complaint is that the attack resolutions animations are too fast for beginners, though you soon get used to them.\n\nSTORY/SETTING: The dialogue is really weak at the beginning but gradually gets better.  They should go back and rewrite the first five hours of the script.  The setting is well done, pretty much your standard fantasy world with enough tweaks to keep it interesting.  The plot is good.  I don't want to talk about the plot too much because that would give it away, but I have no complaints with it.  Although the characters have interesting backstories, the characters themselves are pretty dull.  There isn't any character development.  Curtis being black doesn't make any sense.  The sidequests are few but add to the setting.  I used a spoiler to finish one of the sidequests and had to leave another unfinished because I couldn't find a spoiler. Townspeople have up-to-date dialog when you go back to places.\n\nENCOUNTERS/BOSSES: Regular encounters are tough and require the use of special abilities.  You can't just hit \"attack, attack, attack, attack\" and expect to win.  You can't just nuke everything with your strongest abilities either, otherwise you will run out of AP.  So you need to do things intelligently.  Bosses can be tough but mostly you just have to whittle them down.  There are no gimmicks to figure out.  Although most battles are tough... overall the game is actually easy.  I never once lost my whole party.  Monster design is interesting but nothing special.\n\nDUNGEONS: The dungeons are laid out well and are just the right size.  There are some tentacle puzzles in the first dungeon that are ok.  A few dungeons later you come across your first sun orb puzzles.  These can be lots of fun.  The orb puzzles start off easy but get harder.  There was one in an optional dungeon that I couldn't solve.  You can save anywhere but there are a few \"save spots\" that restore you to full health, right before boss fights.\n\nITEMS/EQUIPMENT: It has all of your standard potions, ethers, elixirs, revives, etc... along with some useless items.  Each character has three slots: weapon, armor, special.  Each weapon and armor goes with a certain character, so you can think of them more along the lines of upgrades.  Near the end there is some variety but for the most part it is obvious which weapon and armor each character should use.  The special items are great, they are like the relics from FF6.  You can really customize your party depending on which relic you give to each character.  You have to make tough choices because you only have one of each relic and you can only put one on each character.\n\nART/MUSIC: Great.  The pixel art is consistently beautiful.  The music is great too.\n\nPROGRAMMING: Great.  I didn't notice any bugs until the very final battle, and those were just graphical glitches that didn't last.  I couldn't figure out how to remap the controls on my gamepad but the defaults were perfectly good (start=menu, B=action, A=cancel).\n\nSUMMARY: Buy this game, tough out the first few hours of poorly written dialog, and then enjoy the rest of the game.", "timestamp_created": 1491450729, "timestamp_updated": 1491450729, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.549318", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30889223": {"recommendationid": "30889223", "author": {"steamid": "76561197977971687", "num_games_owned": 203, "num_reviews": 8, "playtime_forever": 723, "playtime_last_two_weeks": 0, "last_played": 1491083875}, "language": "english", "review": "I wanted to wait until I finished the game before leaving a review. I backed this game on Kickstarter and I was really hyped for its release so I didn't want the hype to cloud my judgement. I'm glad to say that even by taking my time, and spreading this game over a few weeks, the game has lived up to my expectations.\n\n[h1]The Good[/h1]\n\nWe live in an awesome time where indie RPGs are abundant. Unfortunately the barriers to entry are very low with the use of frameworks like RPG Maker. This often leads to games with low effort, poor balance, and unrefined stories. What makes Shadows of Adam stand out is that everything was done from scratch and done very well; from the graphics, game engine, music, and story.\n\nI think the game's best feature is its battle system. There are no random battles here! The developers made sure this wouldn't make the game too easy by placing choke points with a guard the needs to be taken out. Monsters don't respawn while you're in a dungeon until you leave to the overworld. This makes for intense dungeon explorations because you might find yourself through the majority of the puzzles only to find yourself rationing your items in fear of having to go back to town to restock.\n\nFinding yourself thin on items can force you to come up with different battle strategies to try and conserve your precious AP. You might try and cheese an encounter by finishing off all but one weak enemy and letting it live while you refill your AP through your meditation skill.\n\nAlso, there's no such nonsense such as out-of-date abilities. Lightning, the first spell you use, is as relevant at the end of the game as it was at the beginning. This is very much a modern RPG, it tries to remove the annoying bits without trying to reinvent the whole formula.\n\n[h1]The Bad[/h1]\n\nDuring my playthrough I did run into a few bugs. Some were trivial but immersion breaking (loading in the wrong spot when entering a town), some forced me to reload the game (getting stuck behind a one way staircase), and certain puzzle pieces being able to be pushed over water (not game breaking but it made the puzzles a bit more confusing).\n\nNone of these ruined the experience but they were there. Fortunately the devs are extremely active on the discussion board and take bug reports very seriously. The bugs mentioned above have all been patched. \n\n[h1]The Ugly[/h1]\n\nThere's nothing uglier than being ready for a boss fight only to have him instakill two of your party members with an opening attack. This forced me to throw my strategy out the window and improvise. What's worse is that I later found out that the instakill ability had been patched out of the game in favour of a more fair (but still tough) strategy. Dang you Something Classic!", "timestamp_created": 1491091585, "timestamp_updated": 1491091585, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30708920": {"recommendationid": "30708920", "author": {"steamid": "76561198068096702", "num_games_owned": 49, "num_reviews": 1, "playtime_forever": 1101, "playtime_last_two_weeks": 106, "last_played": 1515604956}, "language": "english", "review": "After playing through this game 1.9 times (almost finished it twice now), I can say that this game is fairly well-crafted.  The battles are challenging without feeling impossible, and the story is interesting, even though it's a little simple at times.  I'd rather not spoil anything, so I'll just say that two of the villians might be my new favorites.  I especially loved the humor in the game, namely Curtis's blunt approach to communicating.\n\nMy favorite thing about SoA is that every skill learned continues to be useful for the entire game.  No early game skills that become junk later on.  This creates the impression that the creators focused a lot on balancing the game, which isn't always the case in indie games.\n\nOverall, this game does a great job at capturing old-school RPG nostalgia, while putting a few twists into it.  Definitely worth the $15 price for this game.", "timestamp_created": 1490376914, "timestamp_updated": 1490376914, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500693", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30694818": {"recommendationid": "30694818", "author": {"steamid": "76561198073505285", "num_games_owned": 60, "num_reviews": 1, "playtime_forever": 522, "playtime_last_two_weeks": 0, "last_played": 1501220300}, "language": "english", "review": "Great gameplay, music, story, and graphics. Recommended for anyone wanting to enjoy a game made after the claassic jrpg style.", "timestamp_created": 1490311621, "timestamp_updated": 1490311621, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500693", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30692510": {"recommendationid": "30692510", "author": {"steamid": "76561198029579296", "num_games_owned": 319, "num_reviews": 36, "playtime_forever": 668, "playtime_last_two_weeks": 0, "last_played": 1490301103}, "language": "german", "review": "Ein nettes kleines RPG, wenn man seine Erwartungen nicht zu hoch schraubt. Ich finde Shadows of Adam grafisch sehr ansprechend, das Kampfsystem klassisch, die Kämpfe sind aus meiner Sicht eher auf der einfachen Seite.\nWas stark auffällt, ist, dass das Spiel sehr gehetzt wirkt. Die Dialoge sind auf das nötigste reduziert, kein Charakter hat wirklich die Möglichkeit seine Persönlichkeit richtig zu entfalten, es gibt keine wirklichen Anreize sich länger als nötig in Städten aufzuhalten, insgesamt also irgendwie unvollkommen.\nIch finde den Preis daher etwas zu hoch, kann aber nicht leugnen, dass mich das Spiel immerhin 10 Stunden bei Laune gehalten hat.", "timestamp_created": 1490301905, "timestamp_updated": 1490301905, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502262", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30561657": {"recommendationid": "30561657", "author": {"steamid": "76561197979597049", "num_games_owned": 275, "num_reviews": 1, "playtime_forever": 793, "playtime_last_two_weeks": 0, "last_played": 1489715985}, "language": "english", "review": "If you are a fan of SNES era RPGs, this is a game for you. The only thing holding this game back is some polishing. There are some minor errors/hiccups here and there, but you hardly notice them as you progress through the game.\n\nBattle System/Diffuculty: The battle system is great, but without random encounters it makes you not want to grind. I never had to go through any area more than once to be adequately leveled. Even the end game bonus dungeon was not hard once you had all of the other items you could aquire.\n\nVisuals: This game looks great. Some of the sprites were used more than once, but each area still seemed new and exciting. \n\nMusic: I loved all of the music in the game. The battle and boss themes were great. Whenever I heard something new, it instantly reminded me of any number of RPGs I had played before. \n\nOverall: Buy this game. Support the developer so that we can get more games like this. It is so rare to get a game that is new but nostalgic at the same time. With some more support, I am sure they can create something even greater.", "timestamp_created": 1489717338, "timestamp_updated": 1489717338, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500693", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30527422": {"recommendationid": "30527422", "author": {"steamid": "76561198065209195", "num_games_owned": 300, "num_reviews": 31, "playtime_forever": 1691, "playtime_last_two_weeks": 0, "last_played": 1489591892}, "language": "english", "review": "This is a fun little game.  While the dialog didn't really suck me in, the story line is decent and the fights are fun.  You really have to put some thought into strategy for boss fights, which is a nice change from some of the games I've played recently.", "timestamp_created": 1489594481, "timestamp_updated": 1489594481, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502702", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30519235": {"recommendationid": "30519235", "author": {"steamid": "76561198182794809", "num_games_owned": 35, "num_reviews": 1, "playtime_forever": 1962, "playtime_last_two_weeks": 0, "last_played": 1489189627}, "language": "english", "review": "Well now.\n\nExcellent game for old-school 8/16bit style RPGs. \n\nWhat I did like:\n\nBattle mechanics are overall excellent. They are slightly on the simple side for RPGs but I never felt I lost a battle because it was impossible; I just didn't figure it out yet.\n\nFor the story/dialog, I'm happy with its length (10hr - 18hr depending on how you play).\n\nThe OST is pretty great.\n\nThe art direction really honed in on the 16-bit era. And really well with few exceptions. You'll feel like you're at your SNES most of the time playing this game.\n\nWhat I didn't like:\n\nThe story and general dialog is not interesting or capturing. You aren't going to love the protags like you love Chrono or anything. The dialog is just too much \"poke fun at 16-bit RPG games tropes\" to be exceptional. At times the dialog goes on and on and on... (no skip ability for dialog you're done with). \n\nThe music... great compositions. But a programmatic issue comes up with the music looping incorrectly... even after several fixes, you still aren't listening to a loop. There is still a weird sound break when the (level/area/etc music) asset repeats. \n\nFinal:\n\nGreat game. I wish the story mattered more to me, but it didn't. The game mechanics ruled. The art direction ruled. \n", "timestamp_created": 1489551109, "timestamp_updated": 1489551109, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500069", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30515733": {"recommendationid": "30515733", "author": {"steamid": "76561197979177807", "num_games_owned": 179, "num_reviews": 6, "playtime_forever": 785, "playtime_last_two_weeks": 0, "last_played": 1489528722}, "language": "english", "review": "Just finished 100%ing the game. It's a solid, fast experience. 8-10 hours if you're playing normally, 10-12 if you're trying to get everything. Pixel art is great and inviting, dungeons and towns are lush with detail, combat abilities are fully animated, and the combat is intricate enough that you'll have to think about how to approach every battle. There's nothing like \"mash through it\" in this game, at least not until you've learned how to handle each encounter group. Puzzles and bosses are challenging enough to test you without demanding hours of attempts.\n\nFew games nowadays just drop you in and say \"Okay, go\". There's a thousand things to fiddle with before you can really get into the meat of the gameplay. It was very refreshing to play an entirely self-contained game that I could complete within a weekend's time. Straightforwardedness is a quality that I think a lot of games have gotten away from, and it's present in this game in spades. \n\nThere are a few cons. There's still a few bugs at time of writing, the plot and characters are somewhat on the shallow side, and the puzzle mechanics can be repetitive (as well as not really having much to do with the dungeons they reside in). \n\nIf you're looking for a solid weekend adventure that won't consume your life then this is worth the purchase and play. Hope you like mine carts!", "timestamp_created": 1489530545, "timestamp_updated": 1489530545, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.608889", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30471019": {"recommendationid": "30471019", "author": {"steamid": "76561198165442724", "num_games_owned": 373, "num_reviews": 61, "playtime_forever": 93, "playtime_last_two_weeks": 0, "last_played": 1489527716}, "language": "english", "review": "Disclaimer: I am still fairly early in the game. \n\nDo you miss games like Lunar, Breath of Fire, and Grandia? This is for you. Very well done, story and characters are fun. \n", "timestamp_created": 1489326777, "timestamp_updated": 1489326777, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.456216", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30455297": {"recommendationid": "30455297", "author": {"steamid": "76561198039754119", "num_games_owned": 109, "num_reviews": 1, "playtime_forever": 1176, "playtime_last_two_weeks": 0, "last_played": 1513451037}, "language": "english", "review": "Shadows of Adam is a delightful example of the experimental \"neo-JRPGs\" which Western indie developers have begun to turn out since 2010.  Although not quite as nuanced as those of Stardew Valley or On the Rain Slick Precipice of Darkness episodes 3 and 4, the combat and stat systems are fresh and engaging.  Boss encounters are well designed, and there is a definite underlying theme which unifies the tactical combat with the plot of the game.  The sound and music are particularly well done, and the game features a couple of the cleverest interactive flashbacks (a JRPG staple) in the genre.  I spent 13 hours beating the game and still had some optional content left to go.  Definitely worth the purchase.", "timestamp_created": 1489262910, "timestamp_updated": 1489263000, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500693", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30455087": {"recommendationid": "30455087", "author": {"steamid": "76561198039737134", "num_games_owned": 506, "num_reviews": 37, "playtime_forever": 1544, "playtime_last_two_weeks": 0, "last_played": 1511688179}, "language": "german", "review": "Must-Have-Game", "timestamp_created": 1489262281, "timestamp_updated": 1489262281, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30451839": {"recommendationid": "30451839", "author": {"steamid": "76561198136051394", "num_games_owned": 36, "num_reviews": 1, "playtime_forever": 935, "playtime_last_two_weeks": 0, "last_played": 1510720789}, "language": "english", "review": "Followed this game during development and testing. The game does well to capture the glory days of jRpgs during the SNES era. Simple and fun, with an engaging story. Well worth purchase.", "timestamp_created": 1489252620, "timestamp_updated": 1489252620, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500693", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "30415843": {"recommendationid": "30415843", "author": {"steamid": "76561198087813151", "num_games_owned": 3431, "num_reviews": 10, "playtime_forever": 1277, "playtime_last_two_weeks": 0, "last_played": 1509146342}, "language": "dutch", "review": "Geweldige rpg. Doet me denken aan de tijd van de snes games.\nHet verhaal is goed. Veel puzzles, soms ook erg moeilijk. Dat was in het begin wel frustrerend, maar dankzij youtube is het me toch gelukt\nHet grote voordeel van het vechten is dat het turnbased is, maar vooral dat er geen onverwachte vijanden zijn\nEcht een aanrader als je een beetje heimwee hebt naar de oldschool rpgs", "timestamp_created": 1489096166, "timestamp_updated": 1489096166, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500069", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30388526": {"recommendationid": "30388526", "author": {"steamid": "76561198037302509", "num_games_owned": 57, "num_reviews": 7, "playtime_forever": 736, "playtime_last_two_weeks": 0, "last_played": 1490441840}, "language": "english", "review": "Updated review after having finished the main storyline:\n\nPros:\n\n- Runs well even on modest hardware\n\n- Gorgeous chunky amd colourful sprite graphics\n\n- Music has that sampled SNES style to it, many varied tracks\n\n- You can save the game anywhere you like\n\n- Interesting turn-based combat system, different from the FF series\n\n- Just the right length - long enough to be good value, short enough to finish casually\n\nCons:\n\n- Could do with more variety of items in shops and loot from monsters\n\n- The puzzles got a little repetitive towards the middle of the game. It picked back up towards the end.\n\nI played on a MacBook Pro 13\" Retina (Late 2013).", "timestamp_created": 1488969117, "timestamp_updated": 1490442539, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.502745", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30363044": {"recommendationid": "30363044", "author": {"steamid": "76561197965229974", "num_games_owned": 1424, "num_reviews": 36, "playtime_forever": 1631, "playtime_last_two_weeks": 0, "last_played": 1488763770}, "language": "english", "review": "Now this was something great. I knew we were in for a treat with the mighty Lun onboard mapping and setting up the story, but the whole package turned out to be incredible - from the sublime soundtrack to the frustrating-yet-satisfying-when-you-finally-crack them puzzles, the world design was brilliant too -- though sadly not quite as expansive as I'd have liked, which I guess is my way of saying \"I wanted more! MORE!\" :D With the current industry trend towards more action-based combat systems and less turn-based, this was a delightful return to strategic form. Combat wasn't grindy in the slightest, and required some true thought into exploiting enemy weaknesses. Visuals were cutesy SD but impressively animated and plenty of areas were unique and deliciously drawn in gorgeous pixel art -- and the overall game really brought back some memories of the much maligned, yet a true guilty pleasure, Final Fantasy Mystic Quest.\n\nIf I had to talk about negative aspects, the aforementioned puzzles spring to mind. Unfortunately the only puzzles in the game were classic \"sliding block\" puzzles... and there were a lot of them, some more infuriating than others, but still more than I'm usually comfortable with. Sadly the story, whilst certainly passable, never really expanded beyond \"leave village, find father\" and while there were some twists and turns, it was largely by the numbers. Something of a slight disappointment for a game that evokes memories, both in gameplay, style, and audio, of the mighty forebears like FFVI. A lack of logbook and/or world map unfortunately makes endgame exploration more tedious than it should be, but that was a sign of the times of the era this game so faithfully recreated :)\n\nIn the end, for the low price you pay for this, you really can't go wrong. It's a delight to play, sounds great, has gorgeous reto styled SNES-era visuals, and will easily set you back a good 15-20 hours. Truly recommended to anyone that has a soft spot for classic SNES-era jRPGs <3", "timestamp_created": 1488838368, "timestamp_updated": 1488838368, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.636090", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30362049": {"recommendationid": "30362049", "author": {"steamid": "76561198049179314", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 1587, "playtime_last_two_weeks": 0, "last_played": 1495741712}, "language": "english", "review": "At first, I thought this was just an above-average indie RPG in the style of an SNES game. Polished art, sometimes witty dialogue, solid gameplay, but not quite up to the level of something like Final Fantasy 6.\n\nAnd then, after about an hour of play, I got to the ridge where the camera panned up to the castle, and the style was perfect. Without saying anything, it told me that everything I'd played up to that point was just the prologue, and that this is where the game would start getting deep. It was a perfect moment.\n\nI'm going to be finishing this one, and I definitely recommend it to anyone who's on the fence about it.", "timestamp_created": 1488833416, "timestamp_updated": 1488991461, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.502745", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30351362": {"recommendationid": "30351362", "author": {"steamid": "76561197990076091", "num_games_owned": 239, "num_reviews": 8, "playtime_forever": 1219, "playtime_last_two_weeks": 0, "last_played": 1488779620}, "language": "english", "review": "A great tribute to the old school 8 and 16 bit JRPGs!  It's exactly what you'd expect: plucky group of young adventures, quirky dialog, villainous princes and of course a quest to save the world.  As is traditional, it mostly linear until the end when you get full freedom to explore the world and find side quests.\n\nPlus there's some nice improvements over the standard JRPGs of the 16 bit era:\n- No random fights: all the monsters appear on the map, so you'll know when you're getting into a fight.  They stay dead until you leave the dungeon, which is nice when you're exploring\n- The AP system: AP is used for all characters special actions (special attacks, spells, etc).  You regenerate AP every round of combat, so you can actually let loose with those special abilities rather than saving them for the boss fight.\n- Fights are tough: because of the AP system, they expect you to be using your special abilities or you won't win.  Very few battles are just choosing \"fight\" for all 4 characters.\n- Save anywhere: Yup, no save points.  Well, actually they have \"save points\" but they are actually just full HP/AP restore.  Bonus: the save points talk back to you!\n\nA few cons:\n- The game is short: probably 10-16 hours (depends on how many of the side quests you choose to do at the end).  Not bad at all for the price, but not quite the typical 40 hours one might expect from a JRPG\n- Not much in the way of character customization until the very end.  For most of the game, there's only one obvious weapon/sword/accessory to equip on each character.  It's only at the end that you'll finally have some choices in how you'd like to spec your party.\n\nTL:DR: If you love old-school JRPGs, you'll love this.  Buy it!", "timestamp_created": 1488781063, "timestamp_updated": 1488781063, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.505231", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30340288": {"recommendationid": "30340288", "author": {"steamid": "76561198076319760", "num_games_owned": 398, "num_reviews": 2, "playtime_forever": 1235, "playtime_last_two_weeks": 0, "last_played": 1509903769}, "language": "english", "review": "Amazing game with a lovely classic JRPG style.\n\n+ Characters\n+ Maps\n+ AP skills\n+ Music\n+ Puzzles\n+ Story\n+ Design\n\nIt's a great adventure.\n\n", "timestamp_created": 1488729902, "timestamp_updated": 1488729902, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.526300", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30333127": {"recommendationid": "30333127", "author": {"steamid": "76561198066100634", "num_games_owned": 38, "num_reviews": 10, "playtime_forever": 5426, "playtime_last_two_weeks": 0, "last_played": 1510156878}, "language": "english", "review": "[h1]THE TL;DR NO SPOILER REVIEW[/h1]\n\n[b]I don't recommend this game for:[/b]\nMediocre writing, so so plot\nMediocre character development\nRepetitive puzzles\nAP recovery not properly done, character should recover 15 AP at the end of each battle.\nIf these problems make you feel bad, then I don't recommend this game.\n\n[b]I recommend this game for:[/b]\nNice graphics, nostalgic but with improvements.\nQuick combat.\nNo random encounter.\nClever level layout design, very little back tracking.\nDevs actually talk to you and fix stuff.\n\nThe DLC is quite epic. \nNew Game Plus is very challenging.\nAnd many more!!!", "timestamp_created": 1488705923, "timestamp_updated": 1503822666, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.487030", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30331276": {"recommendationid": "30331276", "author": {"steamid": "76561198241793148", "num_games_owned": 24, "num_reviews": 2, "playtime_forever": 2549, "playtime_last_two_weeks": 1382, "last_played": 1515726093}, "language": "english", "review": "I found this game searching around for some turn based RPGs...I was a bit skeptical of this product at first, and although it's certainly not perfect or one of my favorite RPG based games...this is a solid entry. At least a B+ in my opinion. \n\nThe battle system with the AP+ as mana for techs/spells is very unique that I welcomed! The graphics are good in traditional 8-bit/16-bit style graphs. The story is....decent I think. Although I would say that the I dont find any of the places (with the exception of the optional dungeons) very memorable in this game. Everything is solid...but it's just sort of there. The music is decent and dialogue is a bit campy. Overall, if you like turn based RPGs and things in the 8-bit/16-bit style era of the SNES, then I think you'll find this game enjoyable. I did, and despite it's problems. It's pretty good...even if things are not amazing or the incridbly memorable. It's worth the 15 bucks (or 12 if you got the opening release sale). \n\nFinal recommendation: Buy this game", "timestamp_created": 1488697945, "timestamp_updated": 1488697945, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.510853", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30330756": {"recommendationid": "30330756", "author": {"steamid": "76561198078810724", "num_games_owned": 106, "num_reviews": 7, "playtime_forever": 866, "playtime_last_two_weeks": 0, "last_played": 1488584461}, "language": "english", "review": "Art/Aesthetics: This game looks aethestically gorgeous with some good OST to match the atmospheric setting. The background, the towns, and even the enemies are simply hard to put into words, in a good way. All I can absolutely say with the art is that it is breathtaking as to how the art is displayed within the game.\n\nStory: The concept and lore of the story are interesting, but the characters themselves aren't. To avoid spoilers, majority of the character development is reliant on flashbacks and there's very little focus on the characters themselves. I really feel that the devs should emphasize more present dialogue to further flesh out the characters.\n\nCombat system and gameplay elements: I really adore the combat system because it is strategic in its own nature that certain moves are more important than others, but all skills can still be used until the end. The pacing and difficulty is right on point as there's really no point of grinding for extra levels, so you never feel that you should backtrack for levels. The puzzles in this game are interesting and innovative, but they become repetitive as you progress in the game. \n\nPersonally, I would rate this game 7.5/10. If you really like the aesthetics of the game with good OST, an interesting story, and a strategic combat system, I recommend getting this game.", "timestamp_created": 1488695322, "timestamp_updated": 1488695322, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.502745", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30319453": {"recommendationid": "30319453", "author": {"steamid": "76561198003866860", "num_games_owned": 236, "num_reviews": 1, "playtime_forever": 1091, "playtime_last_two_weeks": 0, "last_played": 1488568645}, "language": "english", "review": "There are games that succeed at becoming a love letter to the games we grew up with and there are games that fail. Shadows of Adam succeeds in every aspect.\n\nSomething Classic Games has done a fantastic job at capturing the essence of old school rpgs. Much like Final Fantasy Mystic Quest, Shadows of Adam (SoA) uses great art, emotive sprite work and a unique story to create a vibrant world for players to enjoy. Tyler and the rest of the team took a simple concept — creating an old school rpg — and brought it life in a beautiful and entertaining game.\n\nMECHANICS\nSoA is in start contrast to I Am Setsuna, which aimed to bring gamers of today a Chrono Trigger-esque game. I Am Setsuna, however, was plagued with poor design choices — uninspired level design, a rehased story from FFX, and unfair difficulty spikes for boss fights. SoA has none of these design problems. SoA begins relatively easy, as most rpgs do, and gradually increases as the game progresses. There was never even one instance where I felt the difficulty was artificially inflated. The game features lots of weapons, armor and accessories to outfit your party, which can vary depending on your playstyle.\n\nCombat is turn-based and has players managing their AP pool (much like a magic points system) to fire off defensive and offensive abilities. Each of the four characters are distinctively different from each other and several abilities from one character compliment another character's abilities. On the plus side, you receive AP after each turn and for defeating enemies.\n\nART\nThe visuals in SoA are top shelf. The sprite work on the main characters is reminiscent of the excellent work done in Final Fantasy VI. Sprites are able to emote a handful of animations, which really helps the player feel connected to the characters in SoA. Enemies are varied and interesting with minimal pallette swaps. The game really shines with its bosses. Just like Final Fantasy Mystic Quest, boss sprites have hurt animations. While I would have loved to see all enemies in the game have hurt animations, adding this very small aspect to boss fights really brings a lot of character to the fights in the game.\n\nSOUND\nThe sound effects and music in SoA is some of the best in any rpg. The music never got in the way of the gaming experience. Tracks were numerous and varied. The victory fanfare was something straight out of a TGIF sit-com from the 90s. I couldn't help but smile. Other tracks like the Lost Cave were pure rockin'. \n\nThe sound effects stand out above all else though. From the time I used the first ability in my arsenal — Cleave — to the final ability — Wraith Storm — the sound effects blew me away. They pack quite a punch and really make the combat feel visceral and impacting. \n\nSTORY\nThe story in SoA is classic jrpg. It feels like something we would have all played as kids on the SNES. The characters all have disctinct personalities that help to bring variety to the dialogue. The dialogue is well done and never gets too heavy on exposition. There are plenty of cliches, but this is par the course for rpgs. Thankfully, a unique story helps to give the story what it needs to succeed on its own.\n\nFINAL THOUGHTS\nSoA is a game that I whole-heartedly recommend to anyone who enjoys old school rpgs. Finally, we have a love letter to the games of our childhood that succeeds in every aspect. SoA isn't plagued with the poor design choices of I Am Setsuna. Instead, Something Creative Games has created a worthy successor to our 16-bit roots.\n\nMy hope is that Something Creative is able to next create a fitting tribute to Chrono Trigger for their next game. I have faith in the development team that they can actually create a solid experience that emulates the mechanics and design of Chrono Trigger, yet with a completely new and original story. I have faith that Something Creative would succeed where the developers of I Am Setsuna failed.\n\n", "timestamp_created": 1488649065, "timestamp_updated": 1488649065, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.526300", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30297149": {"recommendationid": "30297149", "author": {"steamid": "76561198028049202", "num_games_owned": 325, "num_reviews": 82, "playtime_forever": 733, "playtime_last_two_weeks": 0, "last_played": 1488555442}, "language": "english", "review": "This is a fun little JRPG that's worth playing if you have an itch for the SNES Final Fantasy games, but don't have the time to deal with all those random battles again. It's about 10 hours long, with appealing graphics and catchy music. Beating enemies up and levelling up is as satisfying as ever. The gameplay and writing is a little simple and repetitive at times, but overall I enjoyed it for the stress-free JRPG nostalgia.\n\nWith my review out of the way, I have some advice for the developers about how they can greatly improve this game without too much work (I'm the developer of the Epic Battle Fantasy games btw):\n\n• I spent a lot of time restoring my character's AP, both with potions and also just by stalling in battle. I feel like a lot of this would be remedied if your characters regained a bit of AP at the end of battles. This is especially annoying if my characters are using their AP restoring skills, and don't get the AP because the battle ended! Major oversight there.\n\n• The game is seriously lacking in item variety. Most of the treasure chests in the game just contain potions. I think permanent stat-boosting items would be a simple way of motivating players to explore, while they wouldn't otherwise have a major impact on the game (a few stat points won't make a big difference, but it will feel good finding them). Also just in general there should be more items hidden around, I feel like I wasted a lot of my time trying to explore every bit of every area, when there wasn't much hidden stuff to find.\n\n• Conversations were hard to follow. There's a lot of dialogue, and I think it would be much easier to read if the text box displayed the speaker's avatar. At the very least for the main characters, since they already have avatars. Its up to you if you want to draw avatars for all of the NPCs.\n\n• There's way too many sliding block puzzles in the game! You didn't do much with the barrel puzzles though - maybe turn some of those barrels into rocks that you can push around, and put them into the dungeons instead of the sliding blocks.\n\n• The final dungeon also felt very cheaply made. I think you could replace a few of the recycled sprites with new stuff to make this less obvious, especially in the fight with the 3 crystals.\n\nAlso here's some bugs I found:\n\n• Couldn't turn off scan lines after turning them on in the options.\n\n• The switches that control the water level in the water temple can be activated from behind, while standing on the ledge above. I'm pretty sure this is not intentional.\n\n• Twice in battle the game froze with loud noise playing. This one is serious!", "timestamp_created": 1488557167, "timestamp_updated": 1488557167, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.614713", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30270176": {"recommendationid": "30270176", "author": {"steamid": "76561198021451849", "num_games_owned": 81, "num_reviews": 2, "playtime_forever": 666, "playtime_last_two_weeks": 0, "last_played": 1513533924}, "language": "english", "review": "Part of the reason that I got into the RPG Maker is to re-capture that feel of the retro JRPG that I played when I was growing up. Shadows of Adam does that in spades... Let me be honest I don't have a lot of time to play games so when I say that I've clocked 5 hours into this game that is almost a weeks worth of gaming for me. I play it every time I have 30 minutes or a hour to do so. \n\nThe graphics are sufficiently retro with a modern sharpness to them. The battles are fun (and some of them challenging!) The story and characters are simple, but there is a depth to them that you can gather from their dialogue. I keep looking forward to the next series of dialogue. \n\nAre there some old JRPG cliches in there? Yes, but you know what I loved those cliches in my younger days and I still love them now. This is the retro JRPG that I have been looking for! I hope to see more such goodness come out of the Something Classic Games crew. \n\nPros \nRetro JRPG\nSimple and lovable dialogue\nBeautifully modern pixel art designed in a retro style\nCurtis is best monk ever\n\nThrow backs to Final Fantasy\n\n\nCons \nBattle System is really nice and smooth, but costs me so much healing items. I am always broke!\nMain Character (thus far) is kind of a do-nothing that is just stumbling around and getting lucky.\nNot as long as I want it to be!\n\nIn closing, I look forward to the handful of hours that I have remaining for Shadows of Adam. I highly suggest that if you want a good solid retro JRPG then you buy this game immediately.", "timestamp_created": 1488416459, "timestamp_updated": 1488416459, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.502745", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30268153": {"recommendationid": "30268153", "author": {"steamid": "76561198339130430", "num_games_owned": 63, "num_reviews": 3, "playtime_forever": 720, "playtime_last_two_weeks": 0, "last_played": 1490975452}, "language": "english", "review": "Ten hours in to the game.  From what I've read online, there is between 12 and 14 hours of content.  This game really is a tribute to some of the best JRPGs designed in the early 1990's.  It borrows heavily from Final Fantasy VI, Final Fantasy Mystic Quest, and Lufia II, taking the best elements of each and making its own improvements in terms of game mechnanics and story telling.\n\nIn terms of what it borrowed\n\n(1) Like Mystic Quest there are no random encounters.  Monsters appear as sprites on the map and many battles can be bypassed.  I don't recommend this, however, because the game is superbly paced.  If you deliberately destroy each sprite on every map, you will never need to grind.  That's right, you will never need to return to any map in order to gain experience.  I only backtracked one time to grab treasure that I accidently bypassed.  \n\n(2) There is a puzzle solving element ala Lufia II that is just challenging enough to get your mind off random encounters for 2-5 minutes at a time, 2-5 times per major dungeon.  At least one of these puzzles is linked to an optional treasure that is typically very helpful dealing with either the matter at hand or the next immediate challenge - i.e., at the end of the dungeon prior to the 'Magma Sanctum', you can get an Ice Sword available no where else.  So the puzzles are not a chore, but an intrinsic part of the game.  \n\n(3) There are multiple Final Fantasy VI references I won't spoil, but in terms of game play, once you get the airship and the end game is opened up, it pays to roam the overworld.  Old locations contain legendary rewards and also open new subplots tied to previously unaccessable locations which also contain legendary rewards, setting you up for the final spike in difficulty.  \n\nThat brings me to improvements unique to the game itself\n\n(1) The combat is more challenging, and frankly puts American JRPG imports from the 90's to shame.  Each character has a unique and exclusive set of skills.  Monsters don't have resistances so much as immunities which require some experimentation and make your different characters shine at different points in time, even within a single battle.  Buffs and debuffs are additive and its possible to stack them in such a way to make a two-round round cannon out of whatever character can break the immunities of an enemy in a given fight.  There is an AP system which fuels abilities and regenerates by round, making it difficult to spam abilities and more rewarding when you can set up a combo like I describe above.  Also, the battles are smartly animated - your sprites actually rush up and cleave, suplex, stab, claw, etc., the enemy.  It makes a big intangible difference in gameplay.   \n\n(2) The story is intimate and emotional in a way unique to itself.  I won't spoil it, but as far as 1990's JRPGs go, the only thing I can compare it to is the full up version of Final Fantasy VI - deleted plotlines and all.  And thats only in terms of the impact it will have on you, not the content.  The characters have an interrelated, bittersweet backstory that I was somewhat blindsided by.  In otherwords, though I intended to, I did not button mash through the plot of this one.  Its a story worth watching which ends up being the most pleasant surprise this game brings to the table.\n\nWorth the money.", "timestamp_created": 1488405622, "timestamp_updated": 1488405622, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.526300", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30260954": {"recommendationid": "30260954", "author": {"steamid": "76561198129309676", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 1450, "playtime_last_two_weeks": 0, "last_played": 1513890369}, "language": "english", "review": "Shadows of Adam feels like an old school RPG brought into the modern era.\n\nThe modern elements are not so much graphical as they are mechanical. All the things game developers have learned seems to be applied to create a better experience for the player. Saying the graphics are just standard would be an understatement though, as you can see from the screenshots. I had a great time playing Shadows of Adam, here are a few reasons why:\n\n[b]The Battle System[/b]\nAlthough simple, the battle system has enough depth to keep you engaged throughout the game. Every character and all abilities are viable for certain situations. You don't feel anyone is useless, as is common in many RPGs. The AP system gives you the option of chosing power vs speed. The battle also aren't easy, and bosses will whipe the floor with you if you don't pay attention. I went through the whole game without grinding (which is also discouraged by design) and with the right strategy you will always come out on top.\n\n[b]The World and it's characters[/b]\nNotice I didn't say the story. The story is fine and in typical RPG fashion but what sets it apart is the writing.\nYour heroes feel like actual humans. Cities are alive. NPCs have their own personalities. That goes for everyone basically. Their are different groups that you will immediately be able to tell apart, not just by their appearance but their language as well. Snakes!\n\n[b]The Music[/b]\nThere are a few incredible pieces in there. Some I have grown to love more as I played on. The main theme and Curtis theme are the 2 that stand out for me the most. The music fits always well with the story.\n\n\nSo overall I absolutely loved the game. There are few minor cons for me:\n* the amount of puzzles was a bit too much for my personal taste\n* the story weakens off at the end\n* more optional stuff would have been nice\n\n\nConcluding, I can say that this is the first good RPG I have played in years.", "timestamp_created": 1488378251, "timestamp_updated": 1488378251, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.502745", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30259413": {"recommendationid": "30259413", "author": {"steamid": "76561198140049916", "num_games_owned": 188, "num_reviews": 1, "playtime_forever": 846, "playtime_last_two_weeks": 0, "last_played": 1494453485}, "language": "english", "review": "I'm a bit unhappy to write this review, and it's worth keeping in mind I'm coming at this game from an unusual angle. A lot of the reviews for this game mention that it's a solidly made retro JRPG, and it is in some ways, especially the combat, which I thought was really fast and solid. But, for anyone playing it because they liked The Way (the previous game by writer Lun Calsari) it's much more complicated--a game that was sort of the insane king of JRPGs, with a complex, mysterious world, continuously strong and surprising writing, interesting characters, and game design choices so eccentric you still appreciate them though, near the end of the game, it becomes nearly unplayable and labyrinthine.\n\nThis isn't exactly fair, because Shadows of Adam is advertized as a very simple, straightforward JRPG. But I'd expected at least decent writing to go along with the combat. What we get, though, is pretty unexceptional--a messy, cliche plot that's mostly ignored from moment to moment, full of shallow, poorly realized characters and weirdly reliant on flashbacks with very little interesting going on in the present. Near the beginning there are a few moments that hint at something much better, but it fades away pretty quickly. This was disappointing to me considering the same writer made one of my favorite stories ever told in a game. Even the towns are written sort of unimagintively and mostly used for one-liner throwaway gags.\n\nThe other thing that annoyed me, and the reason I decided to give this game a thumbs down, was the puzzles, which were reasonably well designed but very repetitive and too frequent. I played through because I had a vested interest in this game before I started it, but through the second half the puzzles were just weirdly annoying and there were quite a few moments where I wanted to quit. \n\nI do think some parts of this game were executed well, but really I don't think I enjoyed it very much. With so many similar games out there I have trouble recomending it.", "timestamp_created": 1488372110, "timestamp_updated": 1488439061, "voted_up": false, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.618215", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30257108": {"recommendationid": "30257108", "author": {"steamid": "76561197992760170", "num_games_owned": 488, "num_reviews": 79, "playtime_forever": 1875, "playtime_last_two_weeks": 0, "last_played": 1511758162}, "language": "english", "review": "You can read other reviews if you want more detail... All I have to say is this is the best JRPG I've played in 20 years. Freaking legendary.\n\nOk ok...I have to say more... AMAZING OST, GORGEOUS Sprite Art. Loved the writing. Cute, funny, and serious when it needs to be. I really put this up there with the greats of the SNES era.", "timestamp_created": 1488361298, "timestamp_updated": 1488361608, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.575095", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30234793": {"recommendationid": "30234793", "author": {"steamid": "76561198067151440", "num_games_owned": 73, "num_reviews": 2, "playtime_forever": 999, "playtime_last_two_weeks": 0, "last_played": 1509626631}, "language": "english", "review": "Overall solid JRPG\n\nReally enjoyed the banter between the characters, and the AP system is pretty unique.", "timestamp_created": 1488262043, "timestamp_updated": 1488262043, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500693", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30234552": {"recommendationid": "30234552", "author": {"steamid": "76561198131936648", "num_games_owned": 151, "num_reviews": 10, "playtime_forever": 798, "playtime_last_two_weeks": 0, "last_played": 1488149952}, "language": "brazilian", "review": "Apesar de ter uns bugzinhos gostei bastante! Personagens tem um background interessante e historia eh boa", "timestamp_created": 1488260839, "timestamp_updated": 1488260839, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30233276": {"recommendationid": "30233276", "author": {"steamid": "76561198001507954", "num_games_owned": 2023, "num_reviews": 103, "playtime_forever": 415, "playtime_last_two_weeks": 0, "last_played": 1507786224}, "language": "english", "review": "In the modern world of jRPGs very few titles seem authentic anymore. Heavy marketing tactics and shifts in demographics have caused shock, awe, and commercial appeal to take place of genuine storytelling that is heartfelt and relatable on a universal level. With endeavors like Chrono Trigger and Suikoden II's style of emotional narrative a thing of the past, we now rely and look to the indie market for a more human take on the formula the way we remember and love it. Shadows of Adam offers us a glimpse into the past, back to a time where these creative aspects were priorities and not afterthoughts.\n\nOne of the greatest strengths in Shadows of Adam is the gorgeously detailed yet simple and retro pixel-art that fills the screen. The characters are given a certain visual personality that you don't often see in retro styled games through their wonderfully diverse and creative designs. Considering how low-fi the 16-bit designs of the characters are they manage to each have a very distinct style of fashion or armory, which sets them apart and makes the story much easier to follow. The backgrounds of each setting you adventure through are of exceptional quality, with crisp natural settings and ominous, dank caves all giving a genuinely old school and nostalgic jRPG backdrop.\n\nThe game also has incredible sound design for an indie pixel game, and really evokes the same sense of chaotic intensity I got from battling Lavos at the end of time years ago. The loud crackling of lightning, the whoosh and roar of a burst of flames, and even the nostalgic Squaresoft-esque crystalline tinkling of a savepoint are all meticulously engineered for a classic yet dramatic effect. Warm and melodic chiptune tones make up the retro throwback soundtrack and set a mood that is dreamlike as well as memorable, calling back to a style of soundtrack composition that was progressive and appropriate to it's setting and pacing.\n\nThe writing is done in a provocative way that leaves many early details out, creating an initially mysterious and sometimes confusing atmosphere. Our heroes scour the thick and twisted Tangle, but it isn't until the revealing of it's monstrous and grotesque boss that we are introduced to why they were sent from their village and exactly what the strange source of dark energy they hunt for really is. With many twists and unexpected turns Shadows of Adam is a lengthy 10ish hours of fantasy narrative that as any good jRPG should has lots of humorous and lighthearted side-quests that introduce very strong character building.\n\nShadows of Adam is the spark to reignite that flame in every classic jRPG enthusiasts heart. For every kid who spent their weekends renting and obsessing over beating those sprawling, complex adventures in everything from Final Fantasy to Dragon Quest and grew up wanting more of the classic adventuring. If you're the kind of person who feels that something is clearly missing from today's modern offerings of mostly cheesecake rpgs, Shadows of Adam is a genuine and authentic glimpse back into a time where imagination and creativity took priority in the form of great storytelling, engaging character development and a one-of-a-kind crafting of fictional worlds.", "timestamp_created": 1488253915, "timestamp_updated": 1488308023, "voted_up": true, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.619234", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30231727": {"recommendationid": "30231727", "author": {"steamid": "76561197995414632", "num_games_owned": 129, "num_reviews": 2, "playtime_forever": 1227, "playtime_last_two_weeks": 0, "last_played": 1488733128}, "language": "english", "review": "What I love about this game, I love hard - The combat is fantastic. In a fight, finding the best course of action isn't simple, and that's a good thing. Opponents vary widely, and you constantly learn new, interesting abilities - this all means you're always having to adapt. Absolutely fantastic! The art was surprisingly great too, and the music okay - if sometimes awkward.\n\nBut sadly, the rest of the game felt extremely amateur, and constant little issues worked to remind me of that. A severe lack of polish. No one issue really matters that much, but they all add up, you know? Here's a list, because I'm a jerkface:\n\nThere is a significant silent gap whenever any song loops (Edit: Fixed!)\nText is higher resolution than game graphics\nThere is something weird going on causing the pixel-grid to frequently shift around and resize\nMouse cursor isn't hidden when window is focused\nDialog text appears all at once, instead of rolling in\nWhen a single character has multiple dialog boxes in a row, it closes and reopens that dialog box, instead of keeping it open to show continued speech\nMenu cursor has an extremely slow top-speed - this causes input to often be ignored in menus\nWhen using Mind Read, you're unable to press a button to continue - have to wait a long time\nWhy are there save points if I can save anywhere?\nSelf-only abilities have you select your target\n\nAnd really, if it were only a lack of polish, it'd be fine, but there were too many things about the game design that got on my nerves, too. Another list:\n\nI don't mind some personality in the dialog and storytelling, but it's so heavy-handed and drawn out - it felt annoying instead of charming.\nThe last area & ending was incredibly anti-climactic and brief.\nThe sliding-object puzzles are used so often through the course of the game that it barely feels like there's any other kind of puzzle. There could be lots more variety & creativity there.\nTons of treasure chests, but they lose their charm once you get healing potion #7234589.\nI don't recall there being any branching paths in the game - it's extremely linear.\n\nI did enjoy myself all in all - it's just, if I knew what this was going to be like, I would've had a lot more fun replaying an actual old JRPG. I like to think that if it were improved just a bit, it would really help the game out a lot, though!", "timestamp_created": 1488246204, "timestamp_updated": 1488733163, "voted_up": false, "votes_up": 44, "votes_funny": 3, "weighted_vote_score": "0.713957", "comment_count": "7", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30230649": {"recommendationid": "30230649", "author": {"steamid": "76561198098598276", "num_games_owned": 168, "num_reviews": 9, "playtime_forever": 76, "playtime_last_two_weeks": 0, "last_played": 1503459007}, "language": "english", "review": "So far this game is great. if you enjoyed the good old days of 16bit SNES RPG games this game is for you.", "timestamp_created": 1488240300, "timestamp_updated": 1488240300, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500693", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30216855": {"recommendationid": "30216855", "author": {"steamid": "76561197973250890", "num_games_owned": 468, "num_reviews": 6, "playtime_forever": 842, "playtime_last_two_weeks": 0, "last_played": 1512867080}, "language": "english", "review": "Epic 16-bit nostalgia trip\n\nAlthough it took me 4 hours to realise you could run in the game", "timestamp_created": 1488191398, "timestamp_updated": 1488191398, "voted_up": true, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.522374", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30214144": {"recommendationid": "30214144", "author": {"steamid": "76561198015512286", "num_games_owned": 156, "num_reviews": 3, "playtime_forever": 620, "playtime_last_two_weeks": 0, "last_played": 1488254580}, "language": "english", "review": "As a person that grew up in the 80's and 90's, i'm used to the \"Golden Age\" of RPG games. Those to this day are still my favorite, and Shadows of Adam really is a throwback to the old, turn based battle system game that has a great storyline to back it. \n\nThis has been a real pleasure. If you are into Traditional RPG games with turn based battles, this is defintely not a game you want to pass up!", "timestamp_created": 1488176692, "timestamp_updated": 1488176692, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.524439", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30212745": {"recommendationid": "30212745", "author": {"steamid": "76561197997089521", "num_games_owned": 152, "num_reviews": 20, "playtime_forever": 937, "playtime_last_two_weeks": 0, "last_played": 1505221686}, "language": "english", "review": "The game is fantastic and a must have, it make me think about a modern version of chrono trigger. The music is superb and the dialoge is just TOO SWEET!( Bullet club)", "timestamp_created": 1488169142, "timestamp_updated": 1488169142, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500693", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30212267": {"recommendationid": "30212267", "author": {"steamid": "76561198032493216", "num_games_owned": 159, "num_reviews": 5, "playtime_forever": 43, "playtime_last_two_weeks": 0, "last_played": 1487992133}, "language": "english", "review": "I really thought I'd like this game.\nIt seemed to have all the things I could want from a retro-inspired RPG; an interesting story, a twist on the tradional battle system and no random encounters, so no need for grinding!\n\nBut that's not the game I got; yes the graphics are great, but they're the only part of this game that feels professional. \n\nDialogue is stilted and confusing; full of nonsequitors and questionable phrasing. Pacing of cutscenes is extremely slow, animation and movement seems delayed.\n\n(something happened to deal the rest of my review while I was writing so I will summarize)\n\nThe Ap system fails entirely to provide the stated strategic depth as Ap cost and recovery amounts are innacurate. Per-turn regeneration skews all values and is not taken into account when presented to the player.\n\nWith the exception of the graphics (and unremarkable music), every other aspect feels poorly planned and even more poorly executed.\n\nIf you don't mind clumsy dialogue, clumsy cutscenes and clumsy battles but all means but this game.", "timestamp_created": 1488166683, "timestamp_updated": 1488166683, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.438513", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30207636": {"recommendationid": "30207636", "author": {"steamid": "76561198144321736", "num_games_owned": 51, "num_reviews": 3, "playtime_forever": 615, "playtime_last_two_weeks": 0, "last_played": 1494609140}, "language": "english", "review": "This is more of a collection of random thoughts than a properly structured review, but it will convey the appeal and potential turn-offs of this game just as well. Skip to tl;dr if you're impatient.\n\n-- \n\nI just finished Shadows of Adam. Took me about 11.5 hours and I think I've done all of the sidequests. I also didn't bother to grind to level 40 for the last trophy, but I'm not much of a trophy hunter in the first place. ;)\n\nSo here are some random thoughts:\n- The game just looks beautiful! This really is high-level pixel art. The color palette is also very unique and makes Shadows of Adam stand out from other 16-bit-ish retro RPGs. It looks very good in motion; I was happy to see that the characters have quite a few different poses, and the exaggerated FFV/FFVI-ish expressions are very charming.\n- The music is pretty good. Most of the melodies aren't too cachy, but the style is unique and the music is very good at creating a certain atmosphere (for example, the peaceful and mysterious music in the forest, or the goofy track that plays when you meet the witch.) There could've been more sound effects and background sounds, though.\n- I enjoyed the character interactions, they were quite charming. Using insightful flashbacks to reveal the past of the characters helped to add some depths. I originally didn't expect the cast to be this lively. \n- The game has great humor. The two recurring comic relief characters are a fun duo, but my favorite is probably the witch. \n- Some of the KS cameos break the immersion a bit because they reference stuff that's clearly not in the game, or because of their names (like beginning the name with a small letter). Not a biggie, but I prefer these kinds of encounters to be consistent with the world of the game.\n- The story doesn't reinvent the wheel and I thought the finale was a bit too short and simple, but the key mystery was well-presented. I liked how there were certain tensions between the characters, and how magic was integrated into the world building. \n- The technical presentation of dialogues was a bit lackluster. Speech bubbles (or face portraits) would have helped a lot to see who's talking at the moment right away. Text that pops up instantly also often leads me to read / skip through the dialoges faster that I actually should.\n- The battle system is really good. I remember you writing that all skills should stay useful until the end of the game, and that is definitely the case. There are a lot of different ways to fight (especially toward the end), and the whole AP system adds a lot of depth to the battles. Bosses are usually challenging and even normal encounters can be dangerous. Reminds me of the four Zeboyd RPGs.\n- What I didn't like so much were the scripted encounters. I would have prefered custimizable random encounters or enemies that walk around for two reasons: I think deciding *when* (and how often) you want to fight makes playing an RPG more comfortable, and revisiting old areas can be kinda annoying when you have to fight the same battles all over again. (There isn't really a lot of backtracking in Shadows of Adam, but still.)\n- The puzzles were really well done. Easy to understand, but still challenging. I think I easily spent 60 to 90 minutes of my playtime on puzzles alone. Very good dungeon design with lots of variety, too. (Though the final dungeon was a tad too long for my taste.)\n- Generally the game was very motivating which I attribute to the fun battles and a good gameplay and story pacing. I played it for about 9 hours yesterday and only stopped because I got sleepy (well, it was 8 AM already).\n- The bonus stuff was fun, but it would've been nice to have a bit more incentive to revisit places. There really isn't much optional stuff to do before you get the airship, and even then it's mostly about new places.\n- The game feels very polished overall, despite some minor flaws and glitches and very minor useability issues (like damage numbers in battles popping up before the actual animation).\n- Yay for Disastercake boss and candy dungeon!\n\ntl;dr: Shadows of Adam feels very much like a (beautiful!) SNES RPG and has the same kind of charm, but it's much more fun too play than most of the 90s RPGs because it has very few tedious aspects. Very recommended for fans of charming retro JRPGs and deep / challenging turn-based battles.", "timestamp_created": 1488147427, "timestamp_updated": 1488147427, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.599173", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30206937": {"recommendationid": "30206937", "author": {"steamid": "76561198282928133", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 1159, "playtime_last_two_weeks": 0, "last_played": 1488210398}, "language": "english", "review": "This game is a perfect dose of delicious nostalgia for anybody who yearns for the days of 16-bit RPGs with wit and heart.  Everything is lovingly crafted from the dialogue to the art to the music to the settings, weapons, and items.  \n\nMuch of what's present in this game will be familiar to fans of SNES-era Final Fantasy or Chrono Trigger.  That said, this is a perfect starting point for somebody who's interested in retro-style RPGs even if they've never played one before.  The puzzles are challenging without being enraging.  The overall difficulty balance is near-perfect, with battles feeling tense and rewarding strategic play while never becoming frustrating.  If you love grinding, this game doesn't have it - there are no random encounter battles.  Nonetheless, there is freedom to return to previously explored areas.  \n\nThe game's art is colorful and imaginative.  The Water Garden in particular pops off the screen and evokes an immersive setting even within the confines of the old-school graphics.  \n\nI was a Kickstarter backer of this game, so I'm happy that it has finally come to fruition.  It was worth the wait.", "timestamp_created": 1488145248, "timestamp_updated": 1488145248, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500693", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30202764": {"recommendationid": "30202764", "author": {"steamid": "76561197990194469", "num_games_owned": 163, "num_reviews": 24, "playtime_forever": 850, "playtime_last_two_weeks": 0, "last_played": 1488079387}, "language": "english", "review": "Really enjoyed this gem, felt like a remixed classic game from 16 bit era mostly inspired by Final Fantasy.  The plot is even reminsicent of FF6 in some ways which isn't a bad thing.  I liked the cast but their personalities were bit one dimensional.  The combat is very quick and fluid with minimal unnecessary animations, each character have a good set of unique skills and they remain useful whole game.  The map design is top-notch and look to be a cut above most of indie RPGs.  The puzzles were enjoyable but not much of variety aside for pushing stuff and flipping switches.  Enemies are well-varied even bosses.\n\nMy only complaint is that only one accessory slot, would had been nice to have 2 slots and bump the difficulty up bit.  And I never saw any sidequests during the whole game until the very end where I did few and they didn't really add anything to the story / background of characters which was disappointing.", "timestamp_created": 1488133332, "timestamp_updated": 1488133332, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.524439", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30199285": {"recommendationid": "30199285", "author": {"steamid": "76561198009905418", "num_games_owned": 126, "num_reviews": 7, "playtime_forever": 548, "playtime_last_two_weeks": 0, "last_played": 1488166553}, "language": "english", "review": "Shadows of Adam borrows and adds to the great 16-bit RPGs of old.  It's not a rehash.  Thoroughly enjoyable.  Great music, appropriately challenging, well paced, humorous dialog.  Love it!", "timestamp_created": 1488124506, "timestamp_updated": 1488124506, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.522374", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30184933": {"recommendationid": "30184933", "author": {"steamid": "76561198072016402", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 682, "playtime_last_two_weeks": 0, "last_played": 1488419112}, "language": "english", "review": "A love letter to SNES era RPGS.\n\nThe art and the music are are excellent. The dialogue, story, and character development are average at best, and is what keeps the game from being great. \n\nThat battle system is solid, so no complaints there. I paid full price for the game and believe it's worth the asking price.", "timestamp_created": 1488080399, "timestamp_updated": 1488080399, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.482578", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30184443": {"recommendationid": "30184443", "author": {"steamid": "76561198126586036", "num_games_owned": 90, "num_reviews": 12, "playtime_forever": 987, "playtime_last_two_weeks": 0, "last_played": 1489279782}, "language": "english", "review": "A MUST buy JRPG for fans of the 16bit era! These guys have captured what made the SNES RPGs timeless classics! This is the real deal; so many others have tried and even come close but this is the standout and it deserves to be enjoyed by all! Traditional Square-Enix menus and battle commands with fast game play, save anytime, no random encounters, no grind required - but kill what you see to maintain the difficulty, great story, graphics are somewhere between Final Fantasy 4 & 6, excellent soundtrack, characters with personalities that you become attached to and a great price point! Support this game - we need sequels and more game like this that deliver a nostalgic experience while being new at the same time! Sure you will see a lot of influence from Final Fantasy 4-6, Chrono Trigger, Phantasy Star 4, Dragon Quest 6-7 and Breath of Fire 1-2 but it is done respectfully and delivers!\n\nUpdate - I just finished the game - this is a true masterpiece and I hope it gets ported to consoles so all can enjoy!\n\nA note to the dev team:\nMy 1st system was the Atari 2600 and I fell in love with Adventure, Riddle of the Sphinx and Raiders of the Lost Ark. \nI've finished countless RPGs from The 8bit era to current gen with my fondest memories belonging to the 16bit era. \nMy 3 favourite RPGs (true RPGs - not Zelda or MetroidVania games or Faxanadu or Diablo - which are also awesome) in a very specific order are Final Fantasy 6, Chronotrigger and Final Fantasy 4. \nI have also enjoyed less common/known RPGs that are hidden masterpieces like Septerra Core, Crimson Gem Saga, Albert Odyssey and Symphony of Eternity. \nI have been waiting and disappointed time after time even with indie studios with hardcore retro roots. \nFinally - THIS - is the game I have been waiting for! You guys clearly understand what made the old school RPGs timeless classics that can be replayed end enjoyed even when you know exactly what to do without a map or walk through. \nThank you for giving me something that really makes me feel nostalgic and yet is a new experience! \nI hope you guys get the recognition and success you deserve for creating this future classic that I hope ends up on other platforms and has many sequels - all JRPG lovers should finish this game! \nI have no issues buying this again for my home console (if a port gets made) and will be spreading the positive referrals to my friends - and the price point just augments the value even further!\nCongratulations and thanks; you guys are awesome and have brought me back to my best time in gaming; which I thought would not be possible playing a new game!\n\"They just don't make them like they used to!\" - actually as of Feb 23rd, they do!", "timestamp_created": 1488078796, "timestamp_updated": 1489280073, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.544070", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30179437": {"recommendationid": "30179437", "author": {"steamid": "76561198023913038", "num_games_owned": 117, "num_reviews": 1, "playtime_forever": 527, "playtime_last_two_weeks": 0, "last_played": 1488736689}, "language": "english", "review": "I am 3 hours in, and having a blast playing the game. One thing that is important to me is balance.  I feel that because the mechanics of getting into battles, the devs were able to make battles  (both normal and boss) feel challenging. Along with this, the gold you aquire is enough to kit out your characters with the new gear offered at each town. There is no grind, there are battles that you can avoid, but unless you go out of your way to do this throughout the game you shouldnt feel gimped. \n\nFun to play.", "timestamp_created": 1488060990, "timestamp_updated": 1488060990, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.521161", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30178460": {"recommendationid": "30178460", "author": {"steamid": "76561198365285620", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 11191, "playtime_last_two_weeks": 0, "last_played": 1514582302}, "language": "english", "review": "What can I say about Shadows of Adam that hasn't already been said about the classic RPGs that we all grew up with and loved playing as kids and then played multiple times again through the years and even now as adults? Here's what I HAVE to say:\n\nThis game is a glorious compilation of everything great that I love about the RPG/JRPG genre/s and more! You have the classic SNES style graphics, phenomenal/emotional musical scores, quick to pick up user-friendly gameplay, a classic battle system with innovative additions to keep the pace fast yet strategic/explosive, memorable characters with continual growth in character development, quirky/deep character dialogue that keeps you laughing and intrigued from start to finish, a beautiful world that rewards gamers with epic treasures when you explore every nook and cranny, epic side quests that every memorable RPG has (some of which were Kickstarter backer's ideas that were brought to life by the generous game developers), a fantastic storyline (which is what makes or breaks any game), and replayability which is what so many modern games lack nowadays! I've literally played through Shadows of Adam 5 times over and I can easily start a brand new file right now and still be highly entertained!\n\nThis is an original game that I believe will become a classic in years to come like Final Fantasy, Chrono Trigger, Secret of Mana, etc. If you consider yourself a true lover of the RPG genre, then this is the game that you need to get...NOW!!! Play it, learn it, love it, and spread the word! I've decided to start another playthrough now actually, haha! Game on, everyone! ^_^", "timestamp_created": 1488058178, "timestamp_updated": 1488058178, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500693", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30177811": {"recommendationid": "30177811", "author": {"steamid": "76561198051533584", "num_games_owned": 247, "num_reviews": 6, "playtime_forever": 298, "playtime_last_two_weeks": 0, "last_played": 1488408809}, "language": "english", "review": "Snake ? SNAKE ? SNAAAAAAAAAAAAAAKE !!", "timestamp_created": 1488056548, "timestamp_updated": 1488056548, "voted_up": true, "votes_up": 0, "votes_funny": 2, "weighted_vote_score": "0.312295", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30177316": {"recommendationid": "30177316", "author": {"steamid": "76561198068961389", "num_games_owned": 184, "num_reviews": 2, "playtime_forever": 258, "playtime_last_two_weeks": 0, "last_played": 1488242910}, "language": "english", "review": "If you like Final Fantasy or Chrono Trigger, buy this game. Awesome callback to those types of games!", "timestamp_created": 1488055294, "timestamp_updated": 1488055294, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.482578", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30162934": {"recommendationid": "30162934", "author": {"steamid": "76561198066341445", "num_games_owned": 158, "num_reviews": 4, "playtime_forever": 936, "playtime_last_two_weeks": 0, "last_played": 1488016568}, "language": "english", "review": "This is a somewhat decent indie JRPG. While this is not an RPGMaker game, it has the same feeling and mechanics,so those of you who had some experience with RPGmaker games will find pretty much same here.\nBest word to describe this game is \"average\",because everything you will see in this game fits this description perfectly (at least for me). Plot?average (for an indie JRPG).Music?average.Gameplay?average and so on. \n\n[h1]PROS [/h1]\n\n- decent graphics and art, not your typical RPGmaker tiles\n- about 10-14h of gameplay (with all optional content)\n- moderately interesting\n\n[h1] CONS[/h1]\n\n- typical indie JRPG plot (underaged party of heroes saves the world)\n- childish puzzles (they are not bad per se,just very easy)\n- linear progression (you will have a small degree of freedom only before the very last dungeon)\n\nTL;DR average JRPG, nothing special about it,but will get you some 10h+ of unsophisticated entertainment", "timestamp_created": 1488017294, "timestamp_updated": 1488017294, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.562603", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30162443": {"recommendationid": "30162443", "author": {"steamid": "76561198195114666", "num_games_owned": 116, "num_reviews": 10, "playtime_forever": 511, "playtime_last_two_weeks": 0, "last_played": 1488008382}, "language": "english", "review": "[b]Context:[/b] I completed the game in 11 hours (some offline) which included most of the optional end-game sidequests. \n\n[b]Graphics:[/b] The pixel art in this game is fantastic! I often found myself just looking at all the details in the background and couldn’t believe how consistently good-looking it was throughout the entire game. If you’re a fan of (or even open to) pixel art then you’ll be very happy here.\n\n[b]Sound:[/b] The soundtrack was really good and the devs should consider putting the OST up as well! I found the tracks worked well with the art and complemented the whole experience. The only exception to this was the battle theme became a bit tiring after fighting a few consecutive battles.\n\n[b]Story:[/b] This was probably the weakest area for me. I felt the character development was a little soft and relied heavily on the intermittent flashbacks throughout the game to simply establish the character, as opposed to further develop them. The tone of dialogue between characters seemed inconsistent with the overarching plot and almost detached at times from the current context. The story is definitely serviceable, but wasn’t enough to really stand out from the pack.\n\n[b]Gameplay:[/b] The battle system is well balanced and the level of difficulty is slightly above something like final fantasy. Enemies are visible on the map and there is no level grinding required. Your characters have a range of skills to work with and there is usually more than one way to win the battle. The puzzles are challenging enough to make you think, but not so much that they become frustrating. It is clear that the devs have really thought about all aspects of the gameplay and it shows.\n\n[b]Overall:[/b] The best way I can describe this game is honest, it knows exactly what it is and if you’re looking for a retro jrpg then you’re likely to be satisfied.", "timestamp_created": 1488015672, "timestamp_updated": 1488015769, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.586811", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30159116": {"recommendationid": "30159116", "author": {"steamid": "76561198059929284", "num_games_owned": 73, "num_reviews": 1, "playtime_forever": 6322, "playtime_last_two_weeks": 0, "last_played": 1512193816}, "language": "english", "review": "I wish I had known about this game when they were still in their Kickstarter phase. As it is, I only heard about the game 2 days ago (the day before launch) and am loving every minute of it. Shadows of Adam is truly an homage to the JRPGs of old. If you are a fan of SNES era JRPGs, then I highly recommend Shadows of Adam to you.\n\nMusic - the music is amazing, hands down. Each track is unique in its own way, and enhances the mood of the area you are in.\n\nBattle System - the AP system is a new and refreshing take as opposed to an MP based one. Each skill takes a certain percentage of your AP. You regain some each round or for defeating enemies, but it's up to you to ration how you spend it between fights and during bosses. This adds a nice level of strategic thinking to determine how best to approach each fight.\n\nGraphics - the 16bit style that the devs went for harkens back to classic SNES JRPGs for a major nostalgic factor. The backgrounds are wonderfully done, as are character sprites.\n\nStory - I'm just about to start the 3rd major dungeon, so I'm not sure exactly how far along I am. There have been some interesting plot reveals via flashbacks that have a nice pacing so as to not innundate the player with backstory before needed. From speaking with the Devs in Twitch chat the game casually should run between 14 and 16 hours. While there is no New Game + mode, there are bonus dungeons and side quests that add to the story as well that I'm looking forward to.\n\nThe Devs have been very active on Social Media and Twitch offering to answer any and all questions about the game, and sharing about their experiences making it - which has been a nice touch in my opinion. Overall I'm extremely pleased that I took a chance on Shadows of Adam - it has been my best and favorite purchase since Stardew Valley. Great job to the guys/gals at Something Classic - you've created an amazing game!", "timestamp_created": 1488003618, "timestamp_updated": 1488003618, "voted_up": true, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.654038", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30158939": {"recommendationid": "30158939", "author": {"steamid": "76561198044316312", "num_games_owned": 313, "num_reviews": 3, "playtime_forever": 132, "playtime_last_two_weeks": 0, "last_played": 1492471285}, "language": "english", "review": "Pro's:\n-An amazing 16 bit art style that is just similar enough to Final Fantasy to give you nostalgic feelings, but different   enough it has its own identity. \n-The  story is actually mostly serious, unlike many retro themed RPG's that devolve into parody. \n-The battle system feels pretty unique.  This isn't just a FF  or DQ clone. \n-No random battles!\n-It supports Steam Achievments which most of these retro RPG projects on Steam do not.  \n-The most recent patch fixed the music/sound issue.  The music is great, \n\nCon's:\n-The config UI is a bit oddly laid out, and in order to get the steam overlay to work I had to edit the text config file.  Not all options are in the game's GUI config.  \n-A few minor display bugs with the steam overlay (nothing major).  \n\nOverall I would rate this a 9/10.  If you yearn for the olden days of 16 bit RPGs BUY THIS GAME NOW!", "timestamp_created": 1488002905, "timestamp_updated": 1488953844, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.509759", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30157517": {"recommendationid": "30157517", "author": {"steamid": "76561198025309226", "num_games_owned": 143, "num_reviews": 1, "playtime_forever": 1999, "playtime_last_two_weeks": 0, "last_played": 1509106199}, "language": "english", "review": "A love letter to the RPGs of our childhood, this will tingle everyone of your old-school senses and have you begging for more.\n\nIt hurts to put this game down, it's that good.\n\nWhat are you waiting for?", "timestamp_created": 1487996226, "timestamp_updated": 1487996226, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.607489", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30151998": {"recommendationid": "30151998", "author": {"steamid": "76561198044302180", "num_games_owned": 519, "num_reviews": 9, "playtime_forever": 225, "playtime_last_two_weeks": 0, "last_played": 1487968712}, "language": "english", "review": "https://www.youtube.com/watch?v=SDHS_RluGJM", "timestamp_created": 1487974950, "timestamp_updated": 1487974950, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.436597", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "30150280": {"recommendationid": "30150280", "author": {"steamid": "76561197960864209", "num_games_owned": 334, "num_reviews": 1, "playtime_forever": 655, "playtime_last_two_weeks": 0, "last_played": 1488089775}, "language": "english", "review": "I've played a lot of indie RPGs over the years and can safely say that Shadows of Adam stands out from the crowd as one of the better ones I've played. Having scripted encounters instead of random encounters makes exploring dungeons far less frustrating than other titles I've played, and boss fights are all well balanced and interesting encounters. The music and animations are really top notch, and the game really feels like a 90s era SNES title at heart. For people like me who enjoy nostalgia RPG experiences, I would highly recommend this game.", "timestamp_created": 1487969663, "timestamp_updated": 1487969663, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.567119", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30150240": {"recommendationid": "30150240", "author": {"steamid": "76561198120217961", "num_games_owned": 114, "num_reviews": 6, "playtime_forever": 465, "playtime_last_two_weeks": 0, "last_played": 1507113632}, "language": "russian", "review": "Решил написать первый русскоязычный обзор.\n\nСобственно, поиграл я еще немного, потому обновлю отзыв со временем на более обширный.\n\nДля начала стоит упомянуть, что игру я ждал и купил  ее в первые минуты появления в стиме. Причина тому - предыдущий проект одного из авторов (который отвечает за сюжет и геймдизайн в целом) - The Way. Прошлая игра, которая к слову, вышла очень давно, имела весьма нестандартный, лихо закрученный, отлично раскрывающий персонажей сюжет. В новом творении авторов я сразу ощутил привкус предыдущей игры, и это было очень приятно) Чувствуется некая таинственность, атмосферность, яркие личности героев. Насколько хорош сюжет сам по себе,  я пока не могу сказать, слишком рано делать выводы. Но он точно НЕ плохой, что уже радует. \n\nПо поводу же геймплея и графики скажу следующее:\nПонравились спрайты, видно что все они нарисованы самими авторами, а не взяты с других игр или RPG Maker, красивые и яркие. Понравилась анимация боя (!!!), что вообще не типично для подобных олдскульных jrpg: герои круто замахиваются в битвах, красиво кидают спеллы. Управление и прокачка стандартные, удручения не вызывают. И что пожалуй, самое приятное - пока минимум гринда. Монстры не респаунятся и нет случайных встреч. Всех врагов видно издалека, битвы не частые и не утомляют.\n\nИтого: Всем кто любит Jrpg и не против старомодной стилистики - смело можно приобретать. Любителям хорошего сюжета, возможно тоже стоит приглядеться. Как пройду игру до конца, опишу подробнее свои выводы. А пока:\nLet the Purpose guide you!\n", "timestamp_created": 1487969532, "timestamp_updated": 1487969532, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.614902", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30149821": {"recommendationid": "30149821", "author": {"steamid": "76561198051906368", "num_games_owned": 62, "num_reviews": 2, "playtime_forever": 175, "playtime_last_two_weeks": 0, "last_played": 1487988902}, "language": "english", "review": "If you remember role playing games before Playstation, than this game is for you.\n\nAll the elements that make a classic RPG are there for Shadows of Adam. From hidden chest to chasing after annoying monsters that steal your mushrooms. Inn keepers that will give you a room for free, and shop keepers that will literally buy the clothes off your back.\n\nEven the most minute details are handled spectacularly. Many of the maps jump to life from birds flying away to fish jumping out of streams.\n\nOf course, I wouldn’t consider it a fair review without some nitpicking. For instance, there is no explanation to the battle system. A small nuance, but it took a few fights to get the swing of things.\n\nSome of the dialogue windows are difficult to follow, but this is a common factor in these type of games. After you get the hang of character names, it becomes less of an issue. That being said, the game tries hard to catch the player's attention but sometimes leaves you wanting more explanation.\n\nIt’s really hard to complain about these things considering all the additional effort that went into the immersion of the player. I look forward to spending many more hours with this title over the weekend.", "timestamp_created": 1487968240, "timestamp_updated": 1487968240, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.575221", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30149640": {"recommendationid": "30149640", "author": {"steamid": "76561198053697347", "num_games_owned": 38, "num_reviews": 1, "playtime_forever": 564, "playtime_last_two_weeks": 0, "last_played": 1486280185}, "language": "english", "review": "Shadows of Adam is an 'old-school' traditional RPG created by a team of developers known as Something Classic, and is an intentional throwback to the 'classic' era of 8/16-bit RPGs, drawing liberally from titles from the early nineties. \n\nThe game begins with an homage to Final Fantasy VI in a world ravaged by a destructive war that was caused by magic. Seeking to escape the destruction, fearful citizens fled into the wilderness and founded a small town called Adam to hide from the war until the wicked magic-wielding Lodan Empire was destroyed by a great cataclysm. \n\n'Magic' in Shadows of Adam is not merely a cool fantasy power, it is explicitly a force for evil, drawn from the world of the dead, and is a power men should never wield or touch. Nevertheless, this power does still exist in isolated places and individuals, such as a girl named Asrael in the village of Adam. The people of Adam are superstitious and mistrustful, and when an evil force begins infesting the nearby wilderness, the people think Asrael is to blame. Kellan, the son of a local hero, stands up for Asrael and is sent to investigate the disturbance to prove it is not her doing. What Kellan and Asrael discover in the wilderness will send them on a quest in search of Kellan's missing father, who they believe needs their help.\n\n The game's visuals, set-pieces and plot are all drawn from the well of classic RPG tropes and conventions. There's a lot of reasons why someone might want to make an 'old school' RPG and nostalgia is certainly one of the highest on the list. I suspect another reason might be the comparative ease of making one compared to other types of projects, with relatively simple programming and artwork. But to assume design simplicity was a goal for Shadows of Adam might leave you surprised. While decidedly steeped in the design auspices of the 'old School,” Shadows of Adam also brings modern design sensibilities to the table as well. \n\nThe game takes the form and shape of a traditional world-spanning 'collect the artifacts' quest where you'll explore towns, fight monsters, enter dungeons and meet a lot of weirdos. Dungeons are a particular winner in this game for me. Eschewing random encounter-filled mazes, dungeons are deliberate, well-paced, and designed with the player's consideration in mind. Encounters are similar to Final Fantasy Mystic Quest; static, non-random, and once fought do not return until you re-enter the dungeon. They are placed judiciously and not overused, so the game is very resistant to forced grinding. More emphasis is placed on study of your environment and interaction with various puzzle set pieces. These puzzles mostly feel organic, clear, intuitive to interact with and solve, and build on mechanics introduced in earlier areas. You won't really see anything you haven't seen done elsewhere, but what's here is nearly perfectly executed, with nothing feeling forced or thrown in. \n\nCombat sequences play out in a fairly typical Dragon Quest or Phantasy Star manner. Each of your four heroes has variety of special abilities they can use by spending AP, which replenishes by a small amount each round. Each hero also has a special ability they can use to restore their own AP as well as grant them some other benefit. You'll have traditional attack and recovery abilities but equipping certain 'Artifacts' can change the way some characters operate, such as granting them more attacks per round or additional AP regeneration. Combat plays out quickly and with satisfying visual and sound effects, experience comes at a quick pace and leveling up has a noticeable effect on your performance. Encounters are challenging but not murderous, but throughout the game your party's HP totals are relatively low compared to the amount of damage enemies can do so while healing abilities come early and are effective you must stay constantly vigilant to stay alive, especially since while most encounters can be seen coming, the occasional scripted ambush does occur.\n\nFinally we'll talk about the characters and story, which is important for me because this is an area where I feel like the 'old school' conceit doesn't work. The depth of the characters feels a bit more akin to a first-generation Dragon Quest game than a modern RPG made in 2017. The game has two protagonists, with Kellan being a typical brave but not-too-bright RPG hero and Asrael being a mysterious, empathetic orphan girl with unexplained powers. The problem is that neither particularly ever grows beyond these very basic RPG tropes to offer us a 'new' take on these characters. There's just not much else to them. \n\nMost of the additional cast is introduced early. Our heroes are quick to make an ally of Curtis, a wandering martial artist who insists he was just passing through but seems a little too invested in what's going on. He definitely has a history, and you'll get to see it before the game is over, but we don't know a lot about Curtis's personality other than that he likes meditating and is a bit of a smartass. The fourth hero, Talon, offers quite a bit more potential. He is an old friend of Kellan and Asrael who was very sickly as a child and was thus always left out by the other children. He has grown up resentful and left Adam to make his own fortune. When we meet him, we learn he is fond of Asrael but deeply dislikes Kellan. Seems like a great opportunity for him to serve as a foil for the group and provoke some conflict and character development. Unfortunately, barring one major exception late in the game, this rarely amounts to anything other than Kellan and Talon calling each other names. The rest of the cast is rounded out by Prince Malvil, a nefarious royal who wants to be Kefka so bad he can taste it, and his duo of comically ineffective but very persistent henchmen.\n\nThe game does offer us a lot of context about the characters. We learn a lot of the 'whys' and 'hows.' But we never really get to know these characters or learn 'who' they are, what they care about, where they're going in life. \n\nThe game's world-building also leads a lot to be desired. The world clearly has some history but the player isn't given a lot of opportunity to get invested in it or learn what's going on. I think a pretty major problem here might be in the NPCs in most of the towns. Rather than using them as building blocks to introduce lore, flavor text, current events, a lot are just used to indulge in cheap throwaway gags. You learn very little about the war, the evil Lodan Empire, or exactly what became of them. Which is a shame because there was at least one twist that I thought was pretty cool when you eventually make your way to the continent of Lod and find out what's been going on there since the war. Ultimately though I didn't really leave this world feeling any sort of connection to it. The building blocks simply weren't there.\n\nShadows of Adam has a lot to offer you. But for people who like to indulge in a game's writing and characterization, be aware that this title doesn't offer a lot in the way of it. Whereas with most features of the game, Something Classic took something old and made it feel new, here it still feels old.\n\nOne aspect of the game not pulling through for me isn't enough to drag down my impressions too far however, mostly because the other parts of the game are good enough to make up for what I perceive as shortcomings, The game offers some classical and enjoyable dungeon-crawling and RPG combat; the kind of game you might have enjoyed as a kid, with most of the rough edges sanded off. The game is about ten hours long from beginning to end though there is some additional end game quest content to explore as well. If Phantasy Star or Final Fantasy dominated your childhood and you've been searching to recapture those feelings for the past twenty years, Shadows of Adam might be just the game for you.", "timestamp_created": 1487967711, "timestamp_updated": 1487967711, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.499179", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "30140312": {"recommendationid": "30140312", "author": {"steamid": "76561198040275876", "num_games_owned": 1053, "num_reviews": 60, "playtime_forever": 200, "playtime_last_two_weeks": 0, "last_played": 1488234735}, "language": "english", "review": "Possibly the best indie RPG-love letter to the golden era that I've played.", "timestamp_created": 1487940831, "timestamp_updated": 1487940831, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.489517", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30133898": {"recommendationid": "30133898", "author": {"steamid": "76561198026667079", "num_games_owned": 136, "num_reviews": 5, "playtime_forever": 493, "playtime_last_two_weeks": 0, "last_played": 1489222273}, "language": "english", "review": "Nice looking sprites, good music, and charming writing. This is what you can expect out of Shadows of Adam. Every so often I see an indie game in developement and I look out for it for a year or more until it finally comes out. I knew I was in for a treat when I saw Lun Calsari, creator of the RPG maker cult hit \"The Way\" was doing the writing, and to my understanding, some of the mapping.  I was a huge fan of his work and had played it numerous times. So I played the demo, and boy, was it good. If you have any doubts about the game, or are curious as to how it plays, you can always check out that demo.\n\nReally, a lot of different things sell this game. The gameplay is simple, but there's some thought to be had since MP is a percentage and skills take up a set percent of how much you have. This means you can't just spam skills to win. You need to manage your skills, if only just a little bit. The graphics are nicely shaded, and are reminiscent of games like Final Fantasy V, but have a personality of their own at the same time. The writing is great, and althought I had some serious head turning at some of the things said, since there's a lot of slang exclusive to the world. While made up slang was present in The Way, it felt natural and made sense, like it was something you might hear in the real world somewhere.\n\nAnyhow, if you give the game a chance, I'm sure you'll find something you'll love about it. It's an RPG through and through, and I constantly find myself finding new things to explore, and a bunch of hidden chests and treasures. There are also a lot of references to Lun's older work that I appreciate a bunch as a fan of his game.", "timestamp_created": 1487912398, "timestamp_updated": 1487912398, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.500693", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30133376": {"recommendationid": "30133376", "author": {"steamid": "76561198076864458", "num_games_owned": 259, "num_reviews": 4, "playtime_forever": 722, "playtime_last_two_weeks": 0, "last_played": 1507606262}, "language": "english", "review": "I am only 1.5 hours in, but so far this is a great retro JRPG!\n\nPros:\nEngaging battle system\nGood pacing between exploration, battles and story\nBeautiful pixel art\nNo random battles\nEnjoyable characters/writing\nSave anywhere\nResponsive dev team\n\nCons:\nNo Steam Cloud support\nNo diagonal movement on the map", "timestamp_created": 1487909901, "timestamp_updated": 1487910209, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.556469", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30132108": {"recommendationid": "30132108", "author": {"steamid": "76561198038399381", "num_games_owned": 327, "num_reviews": 1, "playtime_forever": 77, "playtime_last_two_weeks": 0, "last_played": 1487902202}, "language": "english", "review": "A thoroughly fun and enjoyable throwback to the classic JRPGs of old. Beautiful graphics and soundtrack, an enjoyable battle system, and some silly and self-aware writing.\n\nAs can be seen by the screenshots, the game looks gorgeous. It retains that 16-bit SNES style, but modernized for a new age. The environments and backgrounds on the maps are stunning and diverse, without that feeling of everything being the same tiles repeated over and over again. The battle artwork is great as well, with well designed (and dynamic) enemy sprites, more gorgeous background artwork, and quick, stunning attack and spell animations.\n\nThe battle system itself is a perfect example of a modern turn-based battle system. Turns and animations are quick, and the AP system used for attacks and abilities is a simple system which doesn't punish the player for doing anything other than basic attacks. As of the point I'm at in the game now, battles have felt challenging, but not punishing. I've found myself having to be slightly tactical in boss battles, and as of yet no abilities seem \"useless\" as in some JRPGs, with buffs and debuffs actually being useful and helpful.\n\nStorywise, the script has been enjoyable so far. It's very tongue-in-cheek, and aware of the fact that this game has a base in a long running and beloved genre of games. While the self-aware, tongue-in-cheek, and slightly parodied approach of writing isn't for everyone, I found it charming. Like so many other things in this game, it fits in nicely, without being overbearing. The characters are a little silly, the plot isn't out of the ordinary or convoluted, and the wonderful soundtrack really helps tie everything together.\n\nAs far as technical things go, I've encountered a few very minor graphical issues, all of which I'm sure are easily fixable. But otherwise, the game is solidly designed and runs quite well.\n\nIf you're a fan of the classic JRPG genre, this may be the game you've been looking for. A fun, exciting foray into the days of old, but with a modernized eye for design. The game will tug at your nostalgic heartstrings, in many ways (the music especially reminded me of so many old SNES RPGs), but it does so without relying on the nostalgia as its only selling point. At its core, it remains a solid, simple JRPG, the likes of which are few and far between these days, and I would recommend it to anyone looking to revisit that classic style with a new age twist.", "timestamp_created": 1487903799, "timestamp_updated": 1487903799, "voted_up": true, "votes_up": 13, "votes_funny": 1, "weighted_vote_score": "0.547529", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30132068": {"recommendationid": "30132068", "author": {"steamid": "76561198004847858", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 100, "playtime_last_two_weeks": 0, "last_played": 1490741503}, "language": "english", "review": "THIS IS NOT YOUR STANDARD TRASHY JRPG CLONE!!!!!!\n\nOnly a little over an hour in, will update in the future, but as a three decade JRPG player, I can safely tell you all that from what I have seen and played so far, this game seems legit. \n\nIt feels more like the SNES/Genesis games of old than any other games of this variety I have seen. Period. \n\nThe art is fantastic, the few musical tracks I have heard so far definetely above-average, and the gameplay is exactly what you would expect from a game like this. \n\nI cant speak for the rest of the game, as I said, but I am very happy so far and I cant wait to get back into it.", "timestamp_created": 1487903659, "timestamp_updated": 1487903744, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.526373", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30127657": {"recommendationid": "30127657", "author": {"steamid": "76561198010371406", "num_games_owned": 530, "num_reviews": 22, "playtime_forever": 154, "playtime_last_two_weeks": 0, "last_played": 1487886625}, "language": "english", "review": "As an indie game developer myself I am very proud to see the Something classic team complete such an amazing game that captures the polish and soul of the classics that inspired it so well.  If you’re a fan of classic JRPGs of the SNES era, I think you’ll love Shadows of Adam.  And at $15 it’s an absolutely great deal for the quality.  If you’re still on the fence, here’s a more detailed review:\n\n[h1]Story[/h1]\nShadows of Adam (SoA) is a game inspired by classic JRPGs from the SNES era.  The closest game I can think of that resembled SoA would be Final Fantasy: Mystic Quest.\n\nShadows of Adam has great music, beautiful pixel art, and an interesting a succinct story.   You start off with a warrior named Kellan (male) and a sorceress named Asrael (female).  A darkness called the “Tangle” is taking over the world and has reached your secluded town named “Adam”.  Of course, it’s up to you to stop it!  Later on you’ll get two more human members to your team: a dark-skinned monk named Curtis, and a red-headed thief named Talon.\n\n[h1]Controls[/h1]\nShadows of Adam’s controls require either full keyboard or full controller.  I played with an Xbox 360 controller, which required no additional setup and worked perfectly.\n\nYou can move in 4 directions similar to classics like Final Fantasy 6.  There’s a run button that you can hold to run, which you pretty much do the entire time as there’s no real reason to walk.  Luckily you can go into the options from the menu and turn on “always run” so you don’t have to be bothered holding the button your entire playthrough.\n\nThis is probably my only complaint about Shadows of Adam:  My personal preference is that a game on the PC should be playable with a mouse, though I do understand that a classic game like this really is better with a controller.\n\nLater on you acquire an airship which you can enter and explore similar to Final Fantasy 6.  This of course helps you travel the rest of the world you normally couldn't on foot.\n\n[h1]Graphics[/h1]\nThe sprites are beautiful, but in lower resolution to have that classic feeling.  I first started playing Shadows of Adam at full screen on a 1080p monitor, but the lower resolution made the graphics look too muddled.  I switched to windowed mode and felt that it was much easier (and better looking) to play on a lower resolution.\n\nBosses have multiple forms depending on their current HP percentage.  This adds a nice effect to show you’re near the end of a long fight, and the boss may start to look more angry or more tired.\n\nSpell effects are beautiful and fun to watch even after the 100th time you’ve seen them.\n\n[h1]Combat[/h1]\nThere are no random battles.  Instead, enemies are engaged by bumping into them on the exploration map.  Once you do, you’ll be whisked away to the “battle zone”, which has the enemies and protagonists lined up on opposite sides of each other to combat.  Enemies will respawn when you exit and re-enter the dungeon, which you’ll need to do sometimes to rest in town.\n\nCombat is turned based based on character’s speed stat.  This means you select the actions for all of your characters at the beginning of the round, and then every character, including enemies, take a turn in order based on their speed stat.\n\nShadows of Adam has replaced the traditional Mana resource for a rechargable AP resource.  All of your skills take a percentage of your AP (e.g. 40%), and then your AP regenerates either by using certain AP regenerating skills or naturally each turn.\n\nAbilities are earned by leveling up through gaining experience in combat.\n\nNote: If a character dies they do not receive EXP.\n\n[h1]Equipment[/h1]\nEquipment is set up into 3 basic slots: Weapon, Armor, Artifact.  Weapon and armor contribute pretty much to what you’d think they would, while artifacts can contribute in different ways depending on the affixed stats.\n\n[h1]Stats[/h1]\nThe stats are simpler than some complex RPGs, but maintain variety.\n\n[list]\n[*][b]Atk[/b] - Attack determines how much damage a physical attack does.\n[*][b]MAG[/b] - Magic determines your magic powers.\n[*][b]DEF[/b] - Defense determines how much physical damage you reduce.\n[*][b]M.DEF[/b] - Magic Defense determines how much Magic damage you reduce.\n[*][b]SPD[/b] - Speed determines the action order each turn.\n[*][b]LUK[/b] - Luck determines both Crit % and accuracy (you can miss with some basic attacks).\n[*][b]Crit %[/b] - Critical strike % determines your percentage chance to land extra damage with skills and attacks.\n[/list]\n\n[h1]Level Design and Secrets[/h1]\nThe level design is very well done.  Each dungeon has its own puzzles that significantly add to the atmosphere and spirit of the scenes.\n\nThere are many hidden treasures, making exploration very rewarding and fun.  The treasures range from equipment to items like any good RPG would do.\n\nAlso… [b]I’m a secret boss in the game![/b]  Come get a slice, baby!  But watch out; this cake bites back... <3\n\n[h1]Completion Time[/h1]\nStill working my way through it, so I’ll update on this when I finish.  Overall I’m very happy with how polished Shadows of Adam is!  I would dare call it a proper love letter to the classics that inspired it.", "timestamp_created": 1487885174, "timestamp_updated": 1487887050, "voted_up": true, "votes_up": 47, "votes_funny": 0, "weighted_vote_score": "0.682492", "comment_count": "4", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30124526": {"recommendationid": "30124526", "author": {"steamid": "76561198106918204", "num_games_owned": 96, "num_reviews": 3, "playtime_forever": 1417, "playtime_last_two_weeks": 0, "last_played": 1487781550}, "language": "english", "review": "[h1]Classic JRPG Style with Engrossing Battle Mechanics[/h1]\n\n[i]Have you ever had those moments where you go about your life and something just goes right, like ninja-catching that falling glass? That is what playing Shadows of Adam feels like.[/i]\n\n[b][i]Shadows of Adam[/i] is a JRPG that is inspired by old-school SNES-era JRPG titles.[/b] It chronicles the journey of two inhabitants of Adam, a remote village, as they travel an expansive world to find their missing father one decade after his disappearance. The story is charming, relatable and strongly supported by mostly intuitive game design and fast gameplay. After talking to just a few NPCs, it is possible to quickly become engrossed in learning about every aspect of the lore that you possibly can to get clues for future events and side quests. Despite being influenced by games designed for older hardware, it spares no resources in presenting itself as a clean and visually and audibly aesthetic title that takes advantage of modern system capabilities. Most importantly, [i]Shadows of Adam is just plain fun[/i].\n\n[h1]Gameplay[/h1]\n\nWhile the game is primarily linear, it certainly has a distinct and pleasant pacing that will keep you interested. Each of the main characters has their own vibrant feel and personality, and the matter-of-fact dialogue that they exchange breaks the monotony that you might expect from a JPRG title. While some NPCs are clearly present for decoration, [i]Something Classic[/i] have still managed to find a way to make them relevant by having the main characters turning the interaction into a nonchalant and humorous experience.\n\nThe puzzles in place to progress through the story are, for the most part, intuitive and fulfilling, and often are designed in a way that make you feel like you are just progressing through the game, rather than solving an abstract problem. My experience has had me particularly stumped on around three of the many mandatory puzzles available, but make no mistake that solving these puzzles made me feel like a [i]god[/i] and did not detract too much from how I was progressing and my immersion.\n\n[h1]Replayability[/h1]\n\nThat being said, [i]Shadows of Adam’s[/i] replayability is lacking, as of the version at release, outside of trying to uncover and complete every single side-quest. There is currently no [i]New Game+[/i] option or the like to keep diehard fans entertained beyond the first completion. However, the need to replay the game is nullified by nature of learning absolutely everything possible about the lore and taking the time to explore the in-game world, which can be done in one very fulfilling run. Given that the average run would probably not take more than 13 hours to complete, it is definitely worth it. For those who wish to explore the world after defeating the final boss, saving to a separate file (of which 15 are allowed) before taking the plunge is [i]highly[/i] recommended, as you will not be able to leave the final dungeon even after winning this battle.\n\n[h1]Battle System[/h1]\n\nSpeaking of battles, each one is surprisingly fast-paced, and the system, overall, is an intriguing one to master. The battle system is turn-based, with each character performing their actions after issuing a command to the entire party first, and each command is executed [b]very rapidly[/b]. While there are four distinct characters with their own classes to develop, each one will still start off being able to do a similar amount of damage with their basic attack, making the early game faster than your traditional JRPG. The only hindrance with this fast-paced style is that it is hard to track stat debuffs, such as a decreased attack stat, as these do not have icons or messages that remain on screen after they have been applied. On the other hand, status debuffs, such as burns and poison, do have icons and are easy to track and manage. A majority of the encounters are not random, so in the long run, you will not have any nasty surprises hit your party.\n\nMy favourite aspect of the battles in [i]Shadows of Adam[/i] is that every single character, ally or foe, is overpowered in one way or another. This will lead the player to exploit two main playstyles in the mid to late game: impenetrably defensive or overbearingly offensive. There are no words that can explain the level of elation from the serendipitous discovery of ability combos that enable you to take little to no damage or deal [i]over ten thousand damage[/i] to an enemy in a single turn.\n\nWhile these feats are possible, they are truly balanced by the need to properly manage AP, the resource expended to execute the special skills belonging to each character. Therefore, overuse of powerful combos will lead to one using turns trying to ramp AP, leaving them completely open to be on the receiving end of some devastating attacks, and probably resulting in their death. Planning before each battle and choosing the correct Gear will help the strategically-minded player get even more enjoyment from this dynamic battle system.\n\n[h1]Graphics[/h1]\n\n[i]Shadows of Adam[/i] is supported by incredibly beautiful pixel art and the graphics are animated smoothly. [i]Something Classic[/i] have combined an authentic old-school JRPG feel with more vibrant colours and greater frame rates (currently, up to 120fps are allowed). In turn, whether you are watching a cut scene or getting lost in battle, an immersion happens where you often forget that you are looking at pixel graphics and merely experience the story, much like a movie. \n\nEssentially, each new skill that you learn actually feels more powerful than the last, and dire moments, such as a cave in, truly show the struggle expressed in the moment in both the environment and character sprites. \n\nFor those who really wish to relive the old days, there is an option to render a custom number of scan lines as you play, providing the feeling of playing the game on a CRT screen.\n\n[h1]Sound[/h1]\n\nSimilarly, while inspired by old classics, [i]Something Classic[/i] have not held back on sound. Each track is beautifully designed and remains authentic to the JRPGs of old, but do not sound muddy as they once were. Every song is relatively catchy and helps enhance your immersion while playing the game, and some themes are effective in expressing the likeness of particular characters. Ditzy enemies sound like ditzy enemies, and tense moments sound like tense moments. The battle themes are intense and fun, and the sound effects are clear - they make you feel as if you are in trouble when you are attacked and strong when you attack. Graphics aside, even just [i]listening[/i] to your strongest abilities will make you want to ramp AP to perform those actions again and relive that strong sense of power.\n\n[h1]Verdict[/h1]\n\n[i]Shadows of Adam[/i] is an immersive, cohesive, and overall, fun experience that takes advantage of fast-paced battles and challenging puzzles, beautiful pixel art and crisp and classic sounds inspired by the JRPGs of old. Despite some negligible shortcomings, I would highly recommend this title to JRPG fans, especially for its fun and customisable battle experience.", "timestamp_created": 1487875049, "timestamp_updated": 1487926261, "voted_up": true, "votes_up": 25, "votes_funny": 2, "weighted_vote_score": "0.569696", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 98, "total_negative": 4, "total_reviews": 102}}
