{"reviews": {"29775964": {"recommendationid": "29775964", "author": {"steamid": "76561198144423851", "num_games_owned": 645, "num_reviews": 60, "playtime_forever": 208, "playtime_last_two_weeks": 0, "last_played": 1486544288}, "language": "english", "review": "Have you ever got sick from being always chosen as a sacrifice for the gods? Otem's Defiance is an action platformer game about a kid trying to escape his fate as a sacrifice. You play as Otem. A kid who is chosen by his tribe's Shaman to be the sacrifice for the gods. You have to defeat the Ringods and survive the ritual lead by the tribe’s Shaman who seems to have a personal interest in your death. Talk about jealous lol.\n\nThe game is quite simple but so addictive and great.\n\nThe graphics are sure stunning. The animations are great. The colors are super good. The textures are so detailed. The art works are sure great.\n\nThe soundtrack is good. You won't get bored of it at all. The sound FX are also good.\n\nThe gameplay is super good. Pretty easy to get used to.\nLeft and Right arrow keys for movements , Space for jump and Z to shoot.\nThere are sixteen different Ringods with different attack pasterns. There are three difficulties for each level. There are thirty-six different rings in five unique locations which they all are great. the surroundings are so great. You can just look at it and be like damn this is a really great drawing.\nThe levels go from easy to hard slightly as you advance in the game.\nAll you gotta do is dodge and counter attack but it's not that easy. The game is actually challenging. You have three chances each level. The Ringods gonna just get better and stronger so you won't get bored easily.\n\nThere is also an animated comic full of details and is so great to read.\n\nThe settings are not bad. You can change the audio options, Video options and the language. Yet you can't change the key bindings. The default ain't bad but yet it sure comes in handy if you can change it.\n\nThere are thirty six achievements. You get four card drops out of a seven cards badge.\n\n[Spoiler]If you are interested in reading and discussing reviews. Check Cassus.org[/Spoiler]", "timestamp_created": 1486534643, "timestamp_updated": 1486534643, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.501928", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29329753": {"recommendationid": "29329753", "author": {"steamid": "76561198271298135", "num_games_owned": 41, "num_reviews": 4, "playtime_forever": 51, "playtime_last_two_weeks": 0, "last_played": 1484710661}, "language": "schinese", "review": "很好玩的一款游戏 需要玩家去慢慢体验这种游戏  题材是比较老的 但还是这么好玩 这钱值了 绝对不愧", "timestamp_created": 1484710788, "timestamp_updated": 1484710788, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.518441", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "28155410": {"recommendationid": "28155410", "author": {"steamid": "76561198104112999", "num_games_owned": 380, "num_reviews": 96, "playtime_forever": 33, "playtime_last_two_weeks": 0, "last_played": 1480756798}, "language": "english", "review": "I got it as a gift from my friend and I love it! The controls are spot on and the graphics are very colorful. One minor thing I found as a con is that the tutorial texts vanish a bit too fast and had to restart it to see what it was saying.", "timestamp_created": 1480752469, "timestamp_updated": 1480752469, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.497806", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "27459779": {"recommendationid": "27459779", "author": {"steamid": "76561198076842069", "num_games_owned": 927, "num_reviews": 14, "playtime_forever": 144, "playtime_last_two_weeks": 0, "last_played": 1480257722}, "language": "english", "review": "What is Otem's Defiance?\n\nhttps://www.youtube.com/watch?v=AkMsfeW8K2g\nSubscribe to my channel for similar videos!\n\nBackground\nSo for a little background on Otem's Defiance, the game is an on rails 3d platformer of sorts. You play as Otem, a child who has been chosen as a sacrifice to the gods of his tribe. You disobey your tribe's orders to be a sacrifice and fight around the ring-shaped arena.  In this arena totem-like objects attack you from the centre, with an array of attacks, ranging from fire, to magic, to ice, and a whole load of other crap. You fight back against the totems by getting bolts which lay around in sections of the circle. You attack the circular parts behind the face of the totem to destroy it.\n\nGameplay Design\nThe game is designed similarly to that of a 3d platformer, with good graphics if a little basic,   and cool designs, with definitely a comic book-esque feel to it, which I think going by the story of the game, the designers were looking to do. The controls are tight, and you learn more moves the longer you play, which make certain things easier, like for example the user of the double jump. All of these controls feel natural, and while certain powerups at times make the game harder to play, they add something different to the game.\n\nArtistic Design\nI must say I really appreciate the hard work which has gone into the design of the game, the comic books and the in between levels looks fantastic, and the art style is incredibly impressive, which at times made me wish the gameplay jusst had a little bit more. The actual art in game lacks a little, with it being a bit bland at times, but the character and totem's all look well polished even if other areas of the game don't. \n\nGeneral Gameplay:\nThe game starts off quite easily, but adds more and more totems making it more and more difficult, with different levels and areas adding new tiers of difficulty, with each area having it's own boss which you have to defeat before you move onto the next section.\n\nOverview\nWhat I don't like about the game is though, it does feel like it just lacks something for a PC game, its quite repetitive and can feel like a bit of a chore, but its also challenging enough to make you not seem as if you're just going through the motions. \n\nI could definitely recommend this on a mobile device as its controls would work great on it, and on a PC as a platformer it would also be a decent purchase. I think the developers have definitely created something here which is aesthetically pleasing and different, yet still somewhat familiar.", "timestamp_created": 1480082629, "timestamp_updated": 1480082629, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.490139", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "26462429": {"recommendationid": "26462429", "author": {"steamid": "76561198012221863", "num_games_owned": 838, "num_reviews": 79, "playtime_forever": 111, "playtime_last_two_weeks": 0, "last_played": 1474548881}, "language": "english", "review": "Okay, gonna keep this short. Essentially, in Otem's defiance you have to keep yourself from being killed by Ringods, retaliate with bolts you can gather in each stage and defeat the end of ring boss. Rinse and repeat. \n\nDon't get me wrong, its not bad as such, simply too repetitive. And you need really good skills to get the top score for each level, miss a shot and you can kiss it goodbye. The music suffers from the same repetitiveness, even if its nice to hear at first, the endless repetition throws concentration out of the window.\n\nGraphically, well... Its stable 3D, the ring and level designs are okay and animations are somewhat smooth. But it doesn't really shine if you get my drift. Now, if you like dodge and retaliation games, get it. Otherwise, wait for a sale.", "timestamp_created": 1478459031, "timestamp_updated": 1478459031, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.546600", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24356191": {"recommendationid": "24356191", "author": {"steamid": "76561198202948508", "num_games_owned": 30, "num_reviews": 1, "playtime_forever": 31, "playtime_last_two_weeks": 0, "last_played": 1467952627}, "language": "english", "review": "I really think this a great game, i really do, but not many people aare going to buy it if its on pc. this game would be a lot better on a mobile device.", "timestamp_created": 1468686232, "timestamp_updated": 1468686232, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.459053", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23577620": {"recommendationid": "23577620", "author": {"steamid": "76561198129531155", "num_games_owned": 969, "num_reviews": 42, "playtime_forever": 342, "playtime_last_two_weeks": 0, "last_played": 1466451037}, "language": "english", "review": "This is a really fun game, with a nice story and really good artstyle. It gets really challenging after the 4th stage. The gameplay is really solid as well, I'm surprised this is an indie game. To put it in one simple word... Amazing. \n\n10/10", "timestamp_created": 1466030581, "timestamp_updated": 1466042448, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.533121", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23046842": {"recommendationid": "23046842", "author": {"steamid": "76561198096865788", "num_games_owned": 77, "num_reviews": 1, "playtime_forever": 28, "playtime_last_two_weeks": 0, "last_played": 1463525497}, "language": "spanish", "review": "Un bullethell que en los niveles más avanzados querrás disparate tu mismo. Aunque no soy un gran aficionado a este tipo de juegos, he decidido darle un vistazo a este. Sobre todo por el arte y un soundtrack que no sale de mi cabeza.\nOtra cosa a favor de este juego, que hasta el más noob puede adaptarse a estas mecanicas simples. Saltar y disparar, con solo eso puedes pasarte todos los retos que este juego te propone.\nEscenarios asombrosos con una historia de supervivencia y superación.\n\nNo es el tipo de juego que te incita jugar a todas horas pero si que echarte unas runs para conseguir todas la estrellas.\n\nEste usuario te lo recomienda.\n\n5/5", "timestamp_created": 1463530820, "timestamp_updated": 1463530820, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23036511": {"recommendationid": "23036511", "author": {"steamid": "76561198021736718", "num_games_owned": 68, "num_reviews": 1, "playtime_forever": 71, "playtime_last_two_weeks": 0, "last_played": 1462822095}, "language": "english", "review": "TLDR: There is potential here, but this feels a little rushed.\n\nOtems is an interesting concept: Take a classic boss fight style (Whispy Woods comes to mind) and try to make a full game out of it. It plays well and the idea of battling gods can be appealing. Also, the music and the story strips are of excelent quality. The game, however, gets repettitive pretty quickly. Mechanics take a long time to appear (like the double jump) and fighting the same battles over and over with no new skills, gets annoying very fast. It feels a little rushed and it makes it hard for you to keep interested in the game. The animation quality is also not to par with the incredible cutscenes, and the story feels like it overstay its welcome by being too long. All in all i think this is a pretty impresive first attempt by a small indie studio, and that deserves praise. Moreover, i strongly believe that, with some polish, this could be an awesome product.", "timestamp_created": 1463488448, "timestamp_updated": 1463488448, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.481019", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "22983022": {"recommendationid": "22983022", "author": {"steamid": "76561198041468545", "num_games_owned": 167, "num_reviews": 1, "playtime_forever": 1239, "playtime_last_two_weeks": 0, "last_played": 1462480965}, "language": "english", "review": "Once I started playing this game, I barely played anything else for the week and a half it took me to finish it.\n\nIt's fun, challenging, colorful, charismatic and addictive. Got me cursing and retrying the same level tons of times, but also thrilled when I managed to dodge a volley of bullets at just 1 HP, double jump and hit that damn Ringod in its bullseye-thingy.\n\nExtra props for the great OST, the charming visuals and the cool comic-like cutscenes.", "timestamp_created": 1463252118, "timestamp_updated": 1463252118, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.572816", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22796288": {"recommendationid": "22796288", "author": {"steamid": "76561198057685647", "num_games_owned": 123, "num_reviews": 2, "playtime_forever": 669, "playtime_last_two_weeks": 0, "last_played": 1477169503}, "language": "spanish", "review": "Para empezar, los controles de Otem's Defiance son super simples tanto si lo juegas con un mando de Xbox como si lo juegas con el teclado. La dificulad está muy bien ajustada pero, a la vez, es muy desafiante (morí 3 veces en el primer nivel hasta que me lo pasé XD). Echaba en falta más juegos de plataformas con esta dificultad, últimamente me parecían muy fáciles todos XD.\nLa historia es simple pero muy completa, es decir, se entiende perfectamente (no voy a spoilear que luego me acusan de ello XD)\nLos gráficos están genial, no pidáis más de esto.\nEn definitiva, un grandísimo juego de plataformas de estos de la viaje escuela que se echaban en falta, cuidado hasta el más mínimo detalle. Si ya os cansáis de Mario Bros o, simplemente, queréis un buen juego de plataformas en PC, os animo a que lo probéis.\nSi queréis ver un gameplay mío aquí os lo dejo (La grabé cuando todavía era un beta, asi que se ven algunos errores que ya fueron solucionados): https://www.youtube.com/watch?v=xJJ4Dn2dlBY", "timestamp_created": 1462378470, "timestamp_updated": 1462379405, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500294", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22767757": {"recommendationid": "22767757", "author": {"steamid": "76561198303412336", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 5016, "playtime_last_two_weeks": 0, "last_played": 1513102087}, "language": "english", "review": "IT IS WONDERFUL\n\nPlayable for hours.", "timestamp_created": 1462221242, "timestamp_updated": 1462269524, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504587", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22763234": {"recommendationid": "22763234", "author": {"steamid": "76561197993213470", "num_games_owned": 265, "num_reviews": 3, "playtime_forever": 109, "playtime_last_two_weeks": 0, "last_played": 1470160524}, "language": "english", "review": "Otem's Defiance follows the formula of a good platformer: tight controls, lots of things happening at the same time, and the harrowing feeling that one of the things that happen will kill you eventually. This is all condensed in one circular set, where enemies throw you things and you throw things back.\n\nThe game starts easy but the variety of enemies quickly adds up and you start wondering how the heck are you going to evade the fireballs that are firing somewhere else. The final boss of the first tier gave me a lot of work, and it looks a lot like old school bosses and their exact patterns of movement.\n\nThis is also a game I see with a potential community of speedrunners.", "timestamp_created": 1462202854, "timestamp_updated": 1462202854, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502762", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22739314": {"recommendationid": "22739314", "author": {"steamid": "76561198028018671", "num_games_owned": 8413, "num_reviews": 31, "playtime_forever": 861, "playtime_last_two_weeks": 0, "last_played": 1462399063}, "language": "spanish", "review": "En Otem's Defiance manejas a Otem, un chico que debe eliminar a los Ringods (una especie de Totems) en un juego de plataforma circular si no quiere ser sacrificado por los integrantes de su tribu.\n\nTal y como véis las capturas de pantalla de la página de la tienda, así son todas las pantallas (por supuesto, cada pantalla tiene obstáculos, enemigos y características muy diferentes que las hacen únicas cada una de ellas).\nCuentas con 3 vidas por cada fase, y, aunque al principio del juego puedes pensar: \"Boh, que juego más fácil\"; a poco que vas jugando la dificultad va subiendo MUUUUUUUUchísimo hasta hacer que te frustres y te lleves más de media hora en una simple pantalla que debería durarte 2 minutos. Tal cual. Llega al punto de ser muy frustrante.\nNo puedes elegir la dificultad, así que esa es la que hay. Si te gustan los desafíos, este es tu juego. Si, por el contrario, eres de dejar los juegos a medias si se te plantea un reto importante, o te vienes abajo cuando no puedes conseguirlo... mejor no lo compres porque lo dejarás pronto.\n\nEl juego mezcla la simplicidad de ser siempre ese tipo de plataforma circular con el objetivo de eliminar a los ringods, con la complejidad de ir usando diferentes powerups que aparecen en pantalla (recuperar vida, más rapidez, escudo, furia (balas ilimitadas durante 10 segundos), así como diferentes habilidades que vas aprendiendo tras pasar cada mundo (lo típico, doble salto, etc). Otro detalle a destacar es que hay muchos Ringods diferentes (los \"tótems\" del centro), algunos tiran láser, otros ponen minas, otros se defienden con escudo... hay MUCHA variedad y en algunos niveles la combinación de éstos es muy jodida.\n\nUn punto positivo es que los desarolladores (al menos a día de hoy), están metiendo bastantes actualizaciones constantes, arreglando pequeños fallitos y oyendo las sugerencias de los jugadores.\nOtro punto positivo del juego es que tras superar cada \"mundo\", puedes ver unas ilustraciones tipo \"cómic\" bastante interesantes, sobre todo por el estilo gráfico.\n\nA la hora de hacer esta review aún no me lo he pasado del todo, me queda un poco, así que no puedo opinar sobre el final del título, ya que estoy algo atascado y me está costando bastante cada simple pantalla que pasarme. Pero sigo enganchado a él, ya que me gustan los retos.\n\nYo lo recomendaría a todo aquel que le gusten los desafíos. Sin embargo, quizás puede que el precio sea un poco elevado. Yo recomendaría hacerse con él, aunque quizás en una futura rebajilla o similar. Eso entra en la elección de cada uno. \nEdito la reseña: Cuando la hice, el juego costaba 15€.", "timestamp_created": 1462094942, "timestamp_updated": 1465900365, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.616365", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22717781": {"recommendationid": "22717781", "author": {"steamid": "76561197982850985", "num_games_owned": 616, "num_reviews": 4, "playtime_forever": 71, "playtime_last_two_weeks": 0, "last_played": 1462708804}, "language": "english", "review": "Starting out I didn't think this kind of game could have much depth, but the amount of satisfaction I got out of completing one level after another, getting better while doing so, was far greater then expected. \n\nThe art-style feels great, the totems feel balanced, the speed at which you unlock new mechanics (like power-ups, double-jumps, etc) is nicely paced. \nIf you're a fan of being mad at yourself for dying constantly, knowing it's your own fault, then give this a go.", "timestamp_created": 1462001208, "timestamp_updated": 1462001208, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.531250", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22714617": {"recommendationid": "22714617", "author": {"steamid": "76561198084122899", "num_games_owned": 83, "num_reviews": 1, "playtime_forever": 155, "playtime_last_two_weeks": 0, "last_played": 1480285274}, "language": "spanish", "review": "El juego ha cumplico y con creces lo que esperaba de él ya que hacía tiempo que no me viciaba y picaba tanto con un juego. Me encanta que la dificultad vaya aumentando según avanzas con la historia hace que mires mucho por intentar sobrevivir. Eso sí, cuando mueres y te quedan 1 o 2 ringods por derrotar, te acabas picando bastante y como no es exageradamente difícil no acabas frustrandote y abandonando sino que repites hasta que consigues pasarte el nivel.", "timestamp_created": 1461981647, "timestamp_updated": 1461981647, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22703915": {"recommendationid": "22703915", "author": {"steamid": "76561198014453566", "num_games_owned": 587, "num_reviews": 108, "playtime_forever": 383, "playtime_last_two_weeks": 0, "last_played": 1461786930}, "language": "english", "review": "Otem’s Defiance has delivered upon me seething rage. Proper bubbling bile, frothing in the pit of my gut that demands I throw the pad as hard as I can into my monitor in a petulant temper tantrum. The stories I could tell, the deaths I could recount, the fury I could bottle – and all of it particularly difficult to pin on the game. That makes it my fault. This makes me angrier still.\n\nOtem is largely a twitch-based game that traps you in a number of circular arenas and then casually tries to kill you. It often succeeds. Your job, as a tribal sacrifice not all that keen on the sacrificial aspect of your career, is to run around the arena’s various floors collecting power spheres to then fire at the weak spots on a revolving totem that dominates the centre. Only, it’s not best pleased at your attempts to do so. You’re a blood tribute, and your only role is to die.\n\nFull Review // http://www.honestgamers.com/12963/pc/otems-defiance/review.html", "timestamp_created": 1461934565, "timestamp_updated": 1461934565, "voted_up": true, "votes_up": 10, "votes_funny": 4, "weighted_vote_score": "0.614510", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22670276": {"recommendationid": "22670276", "author": {"steamid": "76561197985963496", "num_games_owned": 252, "num_reviews": 1, "playtime_forever": 161, "playtime_last_two_weeks": 0, "last_played": 1461341531}, "language": "english", "review": "It look, tastes, smells and feels like an old school platformer and by great gabe i love the feel of the controls in this. art and visuals are beautiful and colorful, hell this might be the most colorful game i own. this game is HARD but enjoyably so not once i felt like dying in this was frustrating or unfair. for those who want a challenge and enjoy good music with beautiful art go forth and enjoy.", "timestamp_created": 1461798874, "timestamp_updated": 1461798874, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.481019", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "22654891": {"recommendationid": "22654891", "author": {"steamid": "76561198023923520", "num_games_owned": 155, "num_reviews": 1, "playtime_forever": 60, "playtime_last_two_weeks": 0, "last_played": 1461628886}, "language": "english", "review": "This game is really hard!!", "timestamp_created": 1461717429, "timestamp_updated": 1461717429, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.418326", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22648286": {"recommendationid": "22648286", "author": {"steamid": "76561198042996306", "num_games_owned": 667, "num_reviews": 8, "playtime_forever": 288, "playtime_last_two_weeks": 0, "last_played": 1461940060}, "language": "english", "review": "f*** Dark Souls, this game is the real death trap!", "timestamp_created": 1461687416, "timestamp_updated": 1461687416, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.430032", "comment_count": "3", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 7, "review_score_desc": "Positive", "total_positive": 28, "total_negative": 0, "total_reviews": 28}}
