{"reviews": {"39329177": {"recommendationid": "39329177", "author": {"steamid": "76561198115755383", "num_games_owned": 159, "num_reviews": 9, "playtime_forever": 5, "playtime_last_two_weeks": 0, "last_played": 1484945638}, "language": "english", "review": "I was surprised by this. As a text based story, I at first put it off because I didn't think I would like it until I decided to watch a youtuber playing it which got me interested. I wanna see a Buried 2. :)", "timestamp_created": 1515907103, "timestamp_updated": 1515907103, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38934153": {"recommendationid": "38934153", "author": {"steamid": "76561198102539275", "num_games_owned": 172, "num_reviews": 2, "playtime_forever": 185, "playtime_last_two_weeks": 0, "last_played": 1514809151}, "language": "english", "review": "Love the concept. Can't wait for a 2nd one!", "timestamp_created": 1514809523, "timestamp_updated": 1514809523, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38293865": {"recommendationid": "38293865", "author": {"steamid": "76561198191522873", "num_games_owned": 54, "num_reviews": 3, "playtime_forever": 188, "playtime_last_two_weeks": 0, "last_played": 1513222919}, "language": "english", "review": "THIS GAME IS THE MOST CAPTIVATING STORIES I'VE EVER PLAYED THROUGH.... ONCE. \n\nMy first playthrough was incredible. I can't remember the last time I played through a game with a narrative that interesting. Every word and sentence had me getting closer to my screen. I couldn't get enough and it seemed that every chapter was better than the last. I love how the story affected the game in such a way. I couldn't get to my second run through to change my decision fast enough. LOVED THIS GAME. So before I go any further I'll say one thing. For the price, it's definitely worth it.\n\n!!!!!!!!!SPOILERS!!!!!!!!!\n\nUnfortunately it was my second playthrough that I noticed one very disappointing fact. Your decision don't decide anything. I made one massive decision right off that back. When deciding whether or not to follow the ringing, I decided on this playthrough to not follow it. But it didn't matter. I ended falling through a hole in the ground and getting stuck in the tunnel anyway. \n\nThis kept happening, making decisions and not getting any different outcome from it. In fact, this system is so broken, that dialogue lines where nonsensical. After not having shot my weapon ONCE, I was somehow running low on ammo. After NOT speaking to Barksdale once, he still made a comment on 'How I had spoke to him'. \n\nThe way I see it, there is essentially one ending. 2 endings that are somewhat different but with no real difference and 2 other endings that have such a minor difference from the first ending, that it might as well have not been included.\n\nAs much as I love this game, it's cheaply done and is just giving the illusion of multiple endings.", "timestamp_created": 1513224121, "timestamp_updated": 1513224121, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38244816": {"recommendationid": "38244816", "author": {"steamid": "76561198424022814", "num_games_owned": 13, "num_reviews": 2, "playtime_forever": 245, "playtime_last_two_weeks": 0, "last_played": 1507183672}, "language": "english", "review": "7/10\nThis is a great game to play if you have time to just sit down and play for a few hours non stop. I liked it but I just wish there was a little more replayablity. Besides that this is a great game for the money!", "timestamp_created": 1513032007, "timestamp_updated": 1513032007, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37442506": {"recommendationid": "37442506", "author": {"steamid": "76561198218414405", "num_games_owned": 30, "num_reviews": 5, "playtime_forever": 458, "playtime_last_two_weeks": 0, "last_played": 1493021000}, "language": "english", "review": "I'm usually not one for playing Novella type games as I'd rather read a book, but this game is simpluy amazing and it developed far more than I ever thought it would, the storyline is compelling and I reccomend anyone who likes a good story to give this game a chance!", "timestamp_created": 1511571590, "timestamp_updated": 1511571590, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37232733": {"recommendationid": "37232733", "author": {"steamid": "76561197965517034", "num_games_owned": 2054, "num_reviews": 64, "playtime_forever": 184, "playtime_last_two_weeks": 0, "last_played": 1485205167}, "language": "english", "review": "It took the Steam Awards for me to think back upon my experience with Buried. I chose to nominate it for the \"Choices Matter\" award, for this is truly the most brutally honest \"Choose Your Own Adventure\" I've played in a long time, beating out many of the more interactive games I've played over the year. The story is intriguing, often times down-right spine-chilling, and always pulling you to take one more step into the unknown.\n\nIf you have the slightest interest in the interactive fiction genre, give this one a try.", "timestamp_created": 1511481813, "timestamp_updated": 1511481813, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36669645": {"recommendationid": "36669645", "author": {"steamid": "76561198446549443", "num_games_owned": 9, "num_reviews": 5, "playtime_forever": 314, "playtime_last_two_weeks": 0, "last_played": 1511240813}, "language": "english", "review": "Wow, this game is amazing. It's gripping, from the beginning to the end. The characters are well written, the story is very descriptive and keeps you engaged the entire time!", "timestamp_created": 1511241049, "timestamp_updated": 1511241049, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35993449": {"recommendationid": "35993449", "author": {"steamid": "76561198168671487", "num_games_owned": 134, "num_reviews": 13, "playtime_forever": 179, "playtime_last_two_weeks": 0, "last_played": 1514612307}, "language": "english", "review": "See, this is exactly like Telltale games. In the end , it really doesn't matter what you chose. If you gave actual impact with our choices and not have it end the same way this would be an amazing! Creepy, awesome, and believable story. Great dialogue. Choices are interesting but they NEED impact. I still recommend this game though cause it's definitely worth the money. Hours of gameplay which is awesome.  I subscribed to there newsletter and can't wait for their next game. Make different endings and this would be amazing.", "timestamp_created": 1508951448, "timestamp_updated": 1508951448, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35600477": {"recommendationid": "35600477", "author": {"steamid": "76561198003178974", "num_games_owned": 18, "num_reviews": 5, "playtime_forever": 93, "playtime_last_two_weeks": 0, "last_played": 1510788445}, "language": "english", "review": "Very interesting story. I've only done one playthrough so far, but will definitely do more. I liked the presentation too (nice ambient soundtrack and a few graphics).", "timestamp_created": 1507569186, "timestamp_updated": 1507569186, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35034207": {"recommendationid": "35034207", "author": {"steamid": "76561198045785190", "num_games_owned": 121, "num_reviews": 16, "playtime_forever": 280, "playtime_last_two_weeks": 0, "last_played": 1504176680}, "language": "english", "review": "I must say I dont usualy include interactive stories in my Steam experience, although I do enjoy a good story and this one caught my eye, and the reviews were quite positive. Being in that good story reading mood, I splurged on the $2.99 fee and get stuck into it and was very happy I did.\n\nHad many elements that I enjoy in a story - Secret government conspiracy/coverup, paranormal etc\n\nAll in all a well written story and very suspenseful, the accompanying pics and background sounds serve well to put you in the zone. \n\nHighly recommend if you have $2.99 burning a large hole in your pocket and you want a good read.", "timestamp_created": 1505686048, "timestamp_updated": 1505686048, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34846873": {"recommendationid": "34846873", "author": {"steamid": "76561198288363872", "num_games_owned": 21, "num_reviews": 3, "playtime_forever": 206, "playtime_last_two_weeks": 0, "last_played": 1492985716}, "language": "english", "review": "I'm a big fan of choice-based games, so it wasn't a suprise that I found Buried a very enjoyable, although short expierence.\n\nBuried puts you in the shoes of Roger Hastings, a lumber worker who wakes up in the middle of his destroyed forest work site with no memory of what happened. As he moves though an underground bunker whose entrance is exposed when Roger wakes up, he begins to realize that the incident was not just a simple vehicle accident, but something far more supernatural, and horrifying, then he could've ever imagined.\n\nThe core gameplay of Buried is simple- text is read to you on your screen describing the story, and when you come to a fork in the road, you're givien two choices on what to say or do. Unlike Telltale games, these choices are not timed, allowing you to think each decision through. Unfortunaltly, very little of the choices in Buried really affect the plot long-term. Most of them are just simple dialogue options that only show how your Roger views the current situation. There were some choices that had potential to really affect characters, but they don't have any emotional effect on said characters for more than 30 seconds. You tell a character his best friend died, he takes in the news, mopes for a few seconds, and by the time the scene's over, both characters have forgotten about it and never bring it up again. The first 4 episodes really only have 1 or 2 major decisions throughout their 30-40 minute runtimes. It isn't until the final episode that the game really steps up and gives you some really big and impactful choices that really affect the plot.\n\nStorywise, Buried tells a pretty intresting story. The game does take the cliche \"government experiment gone horribly wrong\"path for its main plot, but it explores a different side of this plot that isn't commonly seen. Instead of focusing on stopping the thing that went horribly wrong, this is a story about witnesses to the event, and about them trying to comprehend what in the hell just happened, and trying to hold on to any hope of survival, no matter what form. As Roger and the few survivors he finds make their way through the bunker, there was this big sense of unpredictability and unknown threat as you slowly begin to see what horrific things the creatures can do, and when you do reach the encounters with the creatures, they're so unpredictable that every encounter feels different, and it's really engaging to see Roger and crew desperately try to both comprehend these things, and fight them off at the same time. The encounters with the creatures are truly the highlight of each episode. Bromoco Games also nails the pacing of this series, smoothly weaving between character moments, plot revalations, and action sequences, all adding up to a well-paced adventure. And by the time you get to the final episode, well, let's just say the supernatural parts of the game completely take over, leading to some of the best moments in the game. While the soundtrack and visual pictures in the background aren't anything special, they're a good fit for the environments described, and really do add to the overall experience\n\nFinal Verdict:\n\nPros:\n-Powerful, character focused story\n-Soundtrack and visuals fit the mood nicely\n-Action-packed final episode\n-Great pacing throughout all five episodes\n-Unpredictability of the creatures make the encounters with them truly memorable\n\nCons:\n-Not many game changing choices\n-Painfully short runtime\n-Occasionally nonsensical character behavior\n-Little variety in endings leads to little to no replay value\n\nDespite a shortage of impactful decisions, short runtime, and almost no replay value, Buried's powerful story and unpredictability, especially in its final episode, makes it really worth looking past it's issues.\n\nScore: 7.5", "timestamp_created": 1504991534, "timestamp_updated": 1504991534, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34426406": {"recommendationid": "34426406", "author": {"steamid": "76561198398701557", "num_games_owned": 124, "num_reviews": 5, "playtime_forever": 134, "playtime_last_two_weeks": 0, "last_played": 1503445523}, "language": "german", "review": "Tolle Geschichte.\nDie zwei Stunden Gameplay waren sehr interessant und faszinierend. Man fragt sich, wie die Handlung bei einer anderen Entscheidung weiter gelaufen wäre. Der Wiederspielwert ist daher durchaus gegeben. \nIch empfehle das Spiel jeden, der gerne viel liest und gute Geschichten mag.", "timestamp_created": 1503446031, "timestamp_updated": 1503446031, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34251788": {"recommendationid": "34251788", "author": {"steamid": "76561198113096787", "num_games_owned": 29, "num_reviews": 3, "playtime_forever": 333, "playtime_last_two_weeks": 0, "last_played": 1487370590}, "language": "english", "review": "Good game, awesome and kinda creepy story. If you enjoy reading, you will like this for sure.", "timestamp_created": 1502786439, "timestamp_updated": 1502786439, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.562955", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34194405": {"recommendationid": "34194405", "author": {"steamid": "76561198086491628", "num_games_owned": 105, "num_reviews": 35, "playtime_forever": 218, "playtime_last_two_weeks": 0, "last_played": 1502553564}, "language": "english", "review": "Great, interesting story, good writing, multiple endings, and choices legitimately feel as though they really do matter unlike in some other games, the choices will keep you wondering what would have happened if you never went until a building or trusted someone and make you want to replay it.", "timestamp_created": 1502553690, "timestamp_updated": 1502553690, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33804548": {"recommendationid": "33804548", "author": {"steamid": "76561198062040803", "num_games_owned": 77, "num_reviews": 18, "playtime_forever": 64, "playtime_last_two_weeks": 0, "last_played": 1501060238}, "language": "english", "review": "cool beans", "timestamp_created": 1501060277, "timestamp_updated": 1501060277, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.495014", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33751228": {"recommendationid": "33751228", "author": {"steamid": "76561198347427229", "num_games_owned": 46, "num_reviews": 2, "playtime_forever": 119, "playtime_last_two_weeks": 0, "last_played": 1488655007}, "language": "english", "review": "This game was incredible!!! The story was amazing and it is really fun to play through it the first time in your own way but then going back and doing the things you did not do before. If you are a fan of games with incredible stories this is a game for you.", "timestamp_created": 1500838391, "timestamp_updated": 1500838391, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32908502": {"recommendationid": "32908502", "author": {"steamid": "76561198318825787", "num_games_owned": 9, "num_reviews": 1, "playtime_forever": 203, "playtime_last_two_weeks": 0, "last_played": 1486067589}, "language": "english", "review": "This is a good game. I played through it twice, then watched Markiplier play it and we got ompletely different roads. It was neat. There was a lot that was the same, but a lot that was different. I really enjoyed it!", "timestamp_created": 1498620945, "timestamp_updated": 1498620945, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32140810": {"recommendationid": "32140810", "author": {"steamid": "76561198111263669", "num_games_owned": 871, "num_reviews": 3, "playtime_forever": 136, "playtime_last_two_weeks": 0, "last_played": 1496204159}, "language": "english", "review": "I found Buried to be a brief but enjoyable experience. The story reads from the perspective of a timber logger who has come to after an unexplained accident, then attempts to discover what happened and subsequently get to safety. The writing is very good and flows well; I was concerned for the characters and found them fairly fleshed-out despite the shortness of the game. The story has a strong supernatural element to it which allowed for an anything-could-happen feeling that kept it from being too predicatable, and it features realistic dialogue/action choices as well (hence the 'interactive' title.) I played without sound, so I can't comment on the quality of that.\n\nThe pros: The well-written narrative and story arc kept me interested to the end, plus the text appears at a quicker speed than in many novel-type games which appeals to me as a fast reader. The background images are nothing special, but perfectly adequate, and always fit the current situation. The price is fair for the quality of the experience and the playtime.\n\nThe cons: While the game does feature ending variants dependant on your choices, they aren't different enough in my opinion to offer replay value. Because of how much I enjoyed the story, I would've liked to have needed more than two hours to complete, and while it all falls together well, I did wish there was more.\n\nOverall, I'd recommend the game to those who already enjoy an interactive visual novel experience, and to others who appreciate an intriguing supernatural tale. I would happily blind-purchase another story from this developer.", "timestamp_created": 1496448950, "timestamp_updated": 1511382485, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.508139", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31874687": {"recommendationid": "31874687", "author": {"steamid": "76561198184465727", "num_games_owned": 40, "num_reviews": 13, "playtime_forever": 179, "playtime_last_two_weeks": 0, "last_played": 1495317356}, "language": "english", "review": "I am a type of girl who likes a good story to the game's she play's, I tell my family most of the time I don't really like \"shooter\" type of games, because for the most part they don't have a story. :/ (no offense to the people who DO like shooter's, just for me; eh I like story more)\n\nOriginally my little brother saw someone on youtube play this game, and he told me about it; he wanted me to play it because he said it had a good story; but I didn't get the best vibe from it, I don't know what it was- but I felt kinda like \"errr\" I don't know, however my little brother bought it for me regardless and hench forth I played it, because I was like \"well I guess I have too\" XD\n\nBoy did I get the wrong vibe from this game XD it's got aspects of sc-fi to it and horror, but it DOES have a good story; and it really makes you feel for the character's involed, without much gameplay (you basically read what happens and make a choice) I'd say it's almost like reading a good book that you get to determine the ending too. :) I'd say for those of you who love a good story to a game, this is COMPLETELY a good choice ;)", "timestamp_created": 1495339635, "timestamp_updated": 1495339635, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31428130": {"recommendationid": "31428130", "author": {"steamid": "76561198109339407", "num_games_owned": 129, "num_reviews": 67, "playtime_forever": 86, "playtime_last_two_weeks": 0, "last_played": 1507247843}, "language": "english", "review": "Ok, of all the games and stories i've played and reviewed. Honestly burIed one of the most amazing and interesting books of all time. You pick choices and my guess is you get a ping after each correct decision you make which is pretty cool however after this review i cannot wait to see the ending after Mark foolish picked to save dennis oh and for this review MLP Joke pun coming: \n\nListened to a Joey Turns Sapphire phone prank while Joey Turner tears his own pizza place down.(I REGRET NOTHING!)", "timestamp_created": 1493426713, "timestamp_updated": 1493426713, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.478261", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31329620": {"recommendationid": "31329620", "author": {"steamid": "76561198130496295", "num_games_owned": 19, "num_reviews": 1, "playtime_forever": 216, "playtime_last_two_weeks": 0, "last_played": 1487244020}, "language": "english", "review": "This is a good decision game. No action or actual gameplay, but your decisions matter. I enjoyed the fact that my decisions had immediate consequences. I would recommend this game.", "timestamp_created": 1492986466, "timestamp_updated": 1492986466, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504542", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31027667": {"recommendationid": "31027667", "author": {"steamid": "76561198045911777", "num_games_owned": 143, "num_reviews": 27, "playtime_forever": 249, "playtime_last_two_weeks": 0, "last_played": 1511483230}, "language": "english", "review": "Beautiful game indeed. \n+Very good story\n+Atmospheric music\n+Good art \n\nIf you like to read and you like to make your own paths in the story this is a game for you .", "timestamp_created": 1491689752, "timestamp_updated": 1491689752, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30496595": {"recommendationid": "30496595", "author": {"steamid": "76561198125129091", "num_games_owned": 103, "num_reviews": 3, "playtime_forever": 182, "playtime_last_two_weeks": 0, "last_played": 1485899524}, "language": "english", "review": "Very cool story with so many different choices leading to so many different outcomes. Masterpiece", "timestamp_created": 1489436418, "timestamp_updated": 1513243522, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30489201": {"recommendationid": "30489201", "author": {"steamid": "76561198351599705", "num_games_owned": 10, "num_reviews": 3, "playtime_forever": 452, "playtime_last_two_weeks": 0, "last_played": 1498586537}, "language": "english", "review": "I purchased this because I love interactive story games. When I got into the \"game\" I realized it was literally a book. So instead of judging a book by its cover, I began reading. The story became very interesting and I wanted to read more. The concept of the reader and the characters having vague clues on what is going on, just aroused my curiosity. After Chapter 1 I was so enthralled in the story and I couldn't stop reading. The story may only be 5 Chapters long and have a very weird ending, however, it's just incredible! I'm not saying the ending was terrible, the ending was actually quite of a cliffhanger but left on a good note and I genuinely liked it. It opened up the possibility that top secret agencies are actually researching these kinds of things and makes me wonder. Now I might be getting too ahead of myself but, nonetheless, it was a great concept and I loved this story. For $3, I don't think you can find a better book. Great job guys!", "timestamp_created": 1489406228, "timestamp_updated": 1489406228, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30432120": {"recommendationid": "30432120", "author": {"steamid": "76561198065510340", "num_games_owned": 162, "num_reviews": 9, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1489111793}, "language": "english", "review": "absolutely amazing... you can feel like you're inside the game deppending on your choises...but, it's amazing!", "timestamp_created": 1489174936, "timestamp_updated": 1489174936, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30396931": {"recommendationid": "30396931", "author": {"steamid": "76561198048046487", "num_games_owned": 137, "num_reviews": 27, "playtime_forever": 13, "playtime_last_two_weeks": 0, "last_played": 1489002065}, "language": "english", "review": "I can't read.", "timestamp_created": 1489002072, "timestamp_updated": 1489002072, "voted_up": false, "votes_up": 4, "votes_funny": 18, "weighted_vote_score": "0.245495", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "30231473": {"recommendationid": "30231473", "author": {"steamid": "76561198044701629", "num_games_owned": 91, "num_reviews": 12, "playtime_forever": 127, "playtime_last_two_weeks": 0, "last_played": 1488244610}, "language": "english", "review": "For $3, this is a REALLY GOOD visual novel. (Cheaper than most books as well)", "timestamp_created": 1488244832, "timestamp_updated": 1488244832, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30203008": {"recommendationid": "30203008", "author": {"steamid": "76561198366394726", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 234, "playtime_last_two_weeks": 0, "last_played": 1488102436}, "language": "english", "review": "I originally had watched this as a play through and had decided I wanted to play it myself to see the other possible choices.  I played through it with a few friends and it made it much more interesting since we chose to follow a majority vote for each option.  Although two of us already knew the potential ending it was still fun to go through it again.  Even though I have technically played this game twice now I still plan to go back and play it a third time just for the fun of it.  I would give it a 8/10 for the replay value and the ability to play with a group of people.", "timestamp_created": 1488134075, "timestamp_updated": 1488134075, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30175074": {"recommendationid": "30175074", "author": {"steamid": "76561198197782430", "num_games_owned": 93, "num_reviews": 3, "playtime_forever": 165, "playtime_last_two_weeks": 0, "last_played": 1511972525}, "language": "english", "review": ".", "timestamp_created": 1488049153, "timestamp_updated": 1488049153, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.498753", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30090373": {"recommendationid": "30090373", "author": {"steamid": "76561198069792862", "num_games_owned": 274, "num_reviews": 18, "playtime_forever": 284, "playtime_last_two_weeks": 0, "last_played": 1487721937}, "language": "english", "review": "There's only so much criticism you can throw against a game that costs $3, especially one with a story as well-written as this one. So why do I give it a thumbs down? Lack of replay value. \n\"But random steam reviewer,\" I hear you saying, \"How can a game with action/consequence and multiple endings possibly not have replay value?\"\nI can't believe the answer I'm about to give for this: The story was written too well. Well, that and some of the morally ambiguous choices you're given have an obvious answer. Yeah, it may be wrong to kill this guy, and it may give away your location, but he's betrayed you twice already and will likely do it again if given the chance. Besides, if you don't, the bad guys will.  It's hard to imagine that scenario working out too many different ways. \nAnyway, what do I mean the story was written too well? I mean, for as concise as it is, it makes the other possibilities pretty easy to predict. Sometimes your character outright says exactly what will happen in both situations. \n\"But what about going back to explore for more info on the world?\" you ask. Well, I have one thing to say to you: Go play Half-Life 1. Or don't, since it's a totally different kind of game even if the stories are basically identical. In all seriousness, if you ask all the questions on your first run, which I assumed you did since you care about understanding the world, there won't be anything new to find on the second run that you didn't already learn. \nI give it a 7/10, but the three strikes against it are enough to make me say, \"I wish I'd just watched a playthrough.\"", "timestamp_created": 1487725539, "timestamp_updated": 1487741016, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.452601", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30025171": {"recommendationid": "30025171", "author": {"steamid": "76561197992661975", "num_games_owned": 233, "num_reviews": 27, "playtime_forever": 260, "playtime_last_two_weeks": 0, "last_played": 1487477577}, "language": "english", "review": "Really great story. Take a couple of hours out and go through it, some of those choices are hard. real hard!", "timestamp_created": 1487477625, "timestamp_updated": 1487477625, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30024745": {"recommendationid": "30024745", "author": {"steamid": "76561198336892090", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 675, "playtime_last_two_weeks": 0, "last_played": 1487582204}, "language": "english", "review": "Amazing story! One of the best things I have ever read!", "timestamp_created": 1487475633, "timestamp_updated": 1487475633, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502570", "comment_count": "1", "steam_purchase": true, "received_for_free": true, "written_during_early_access": false}, "29954502": {"recommendationid": "29954502", "author": {"steamid": "76561198348168967", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 91, "playtime_last_two_weeks": 0, "last_played": 1490235503}, "language": "english", "review": "I ADSOLUTELY Recommend PLAYING this game! it's absolutely amazing! The graphics are cute, and the text is compltely understandable and has me unable to look away, the different possibilities for endings are amazing! I LOVE this GAME!", "timestamp_created": 1487215722, "timestamp_updated": 1487215755, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29887704": {"recommendationid": "29887704", "author": {"steamid": "76561198201048518", "num_games_owned": 69, "num_reviews": 6, "playtime_forever": 337, "playtime_last_two_weeks": 0, "last_played": 1488610851}, "language": "english", "review": "[h1] I have discovered a minor bug within the game.[/h1]\n\nSo far, this game is really great. But throughout playing the game, I've discovered a minor bug. If you change the resolution of your desktop, so will the game. But if you quit the game and change it back to your native resolution, the game will be stuck at the lower resolution.\n\nFor example, if you play the game at 1024 x 768, quit the game, and change your desktop res to 1366 x 768, you will be able to see black bars on the sides of the screen the next time you hit play. It doesn't really seem to mess up the game or anything, it's just a bit annoying.\n\nOtherwise than that, this interactive story is really really intresting. Hopefully the developers will fix this minor bug soon.", "timestamp_created": 1486949953, "timestamp_updated": 1486949953, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29773446": {"recommendationid": "29773446", "author": {"steamid": "76561198126715118", "num_games_owned": 715, "num_reviews": 11, "playtime_forever": 174, "playtime_last_two_weeks": 0, "last_played": 1486518191}, "language": "english", "review": "What can I say that hasn't been said already !   Buried  has a gripping story, believable characters, and the art and sound are amazing.  AND you get it for 3 bucks !  Loved it !!", "timestamp_created": 1486520680, "timestamp_updated": 1486520680, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29740434": {"recommendationid": "29740434", "author": {"steamid": "76561198005798073", "num_games_owned": 94, "num_reviews": 14, "playtime_forever": 215, "playtime_last_two_weeks": 0, "last_played": 1486249375}, "language": "english", "review": "From start to finish I was on the edge of my seat reading this XD\n\nYou know a story is epic when you feel like your with the characters, form a bond with them and feel like your going through what they are.\n\nI even did a dramatic reading of it on my Youtube Channel ^^ https://www.youtube.com/playlist?list=PL2sqSmmNwXvboaELWaoYPj8hB7jK1VWg-\n\nAnyone with a lick of sense should and must read this ^^ \n\n10/10", "timestamp_created": 1486385392, "timestamp_updated": 1486385392, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29735678": {"recommendationid": "29735678", "author": {"steamid": "76561198010092382", "num_games_owned": 129, "num_reviews": 1, "playtime_forever": 109, "playtime_last_two_weeks": 0, "last_played": 1486360817}, "language": "english", "review": "I have played my fair share of text based RPGs. I also went into this experience expecting to be disappointed because I had seen so many lets plays and thought about how expected and a little contrived the writing was; however, I have seldom been so wrong. As much as a pretentious asshole as I am, I loved the story. It takes you in immediately and before you know it you are legitimately concerned for the characters and questioning whether you should look up a walk through to get the best ending. I really can't give this enough praise. Its awesome, well written, and extremely compelling. I hope the creators have many continued years of success and you should definitely pick this one up. Its worth the price; I guarantee it.", "timestamp_created": 1486361179, "timestamp_updated": 1486361179, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29727616": {"recommendationid": "29727616", "author": {"steamid": "76561198168946247", "num_games_owned": 186, "num_reviews": 23, "playtime_forever": 137, "playtime_last_two_weeks": 0, "last_played": 1486324525}, "language": "english", "review": "Buried is a solid interactive story game with interesting visuals and wonderful audio. The characters are interesting, if a little bland at times, and occassionally your choices don't change anything, but I'd still recommend the game to anyone who likes this particular style!\n\nIt's not a very long game, depending on how fast you read. It took me about two hours to complete it twice (granted, the second time was faster because I didn't need to read everything).", "timestamp_created": 1486324628, "timestamp_updated": 1486324628, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29715501": {"recommendationid": "29715501", "author": {"steamid": "76561198025612222", "num_games_owned": 65, "num_reviews": 1, "playtime_forever": 188, "playtime_last_two_weeks": 0, "last_played": 1486289936}, "language": "english", "review": "A wonderful little story that reminds me of reading those, I think it was Goosebumps? books as a child. You know the ones. The ones where you pick an action then jump to the designated page? Yeah those. Of course I always made sure to read every possible outcome as a child.\n\nI've already done this game twice and got two different endings. I feel there are more, so I just may have to do it again!", "timestamp_created": 1486291727, "timestamp_updated": 1486291727, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29696532": {"recommendationid": "29696532", "author": {"steamid": "76561198040035930", "num_games_owned": 46, "num_reviews": 11, "playtime_forever": 258, "playtime_last_two_weeks": 0, "last_played": 1486217536}, "language": "english", "review": "Straight off, let's do away with the \"Choose Your Own Adventure\" tag.  It's [i]not[/i] a CYOA, as the plot doesn't appear to truly diverge except at the very end; it's just aesthetic choices which are quickly railroaded back onto the same author-set track.  That's okay, though it harshly limits replayability.  With this in mind, if Markiplier brought you here, [b]stop watching his playthrough until you've finished the game yourself.[/b]\n\nThe speed of the text and button reveals feel appropriate to the atmosphere, but it's painfully slow when you're just trying to power through a replay.  Although mashing the space key can speed this up a bit, I think this game would benefit from a variable speed/instant reveal option.\n\nAn appropriate atmospheric soundtrack is a pivotal 'make or break' point in multimedia literature, and Buried makes it.  The Wasteland/Fallout feel of it fits well.  Markiplier claims at a few points in his playthrough that the 'calm' soundtrack doesn't fit the immediate events.  I disagree; this is a text story, and jumping to frenetic music would be distracting and would stand out like a sore thumb.  This soundtrack doesn't stand out – it looms in the background.\n\nThe writing is respectable.  I would caution author Barry Napier to \"kill his darlings,\" however; \"haul ass\" is a phrase which should never be used more than once in a work, and then only to demonstrate what sort of person a character is.  Beyond that, there's some over-reliance on horror/action tropes, occasionally to a degree which borders on breaking suspension of disbelief (ie: Overdrawn at the Blood Bank, Ax-Crazy, Aliens are Bastards, Science Is Bad).  Mostly, though, the writing is convincing and interesting.  I hope to see more interactive fiction like this from Mr. Napier and Bromoco Games.\n\nAnd then, there's the value.  That's not exactly a Triple-A price tag.  Overall I wouldn't call this a masterpiece, but it's well-made entertainment for substantially cheaper than watching whatever trash reboot Hollywood has most recently vomited at the cinema.  Save your money and get Buried instead.\n", "timestamp_created": 1486224234, "timestamp_updated": 1486224234, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.603604", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29692573": {"recommendationid": "29692573", "author": {"steamid": "76561198119296687", "num_games_owned": 74, "num_reviews": 4, "playtime_forever": 152, "playtime_last_two_weeks": 0, "last_played": 1485872091}, "language": "english", "review": "I really enjoyed this game very interesting.", "timestamp_created": 1486213348, "timestamp_updated": 1486213348, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29686806": {"recommendationid": "29686806", "author": {"steamid": "76561198053004800", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 256, "playtime_last_two_weeks": 0, "last_played": 1486194076}, "language": "english", "review": "After watching a playthrough of this game by Markiplier, I had to get it for myself and try out the different decisions. A wonderful game and well worth the price!", "timestamp_created": 1486194187, "timestamp_updated": 1486194187, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.524376", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29639021": {"recommendationid": "29639021", "author": {"steamid": "76561198137664882", "num_games_owned": 74, "num_reviews": 55, "playtime_forever": 136, "playtime_last_two_weeks": 0, "last_played": 1485135374}, "language": "english", "review": "People compare this to telltale's the walking dead....\nWTF", "timestamp_created": 1485995076, "timestamp_updated": 1485995076, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.411132", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29621899": {"recommendationid": "29621899", "author": {"steamid": "76561198340095989", "num_games_owned": 17, "num_reviews": 2, "playtime_forever": 92, "playtime_last_two_weeks": 0, "last_played": 1485931155}, "language": "english", "review": "Very Intense! The audio they paired with the game was well done, it had me looking over my shoulders from time to time. Bittersweet in some parts, outright insane in others, but it had a good amount of tense and creepy.", "timestamp_created": 1485931081, "timestamp_updated": 1485931081, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.509804", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29588418": {"recommendationid": "29588418", "author": {"steamid": "76561198034359392", "num_games_owned": 146, "num_reviews": 36, "playtime_forever": 304, "playtime_last_two_weeks": 0, "last_played": 1485794262}, "language": "english", "review": "Your choices have zero to no effect on the plot.\nAnd the tiny effects that they do have, are so tiny that they only effect the next 5 min of the story.\nThe plot is pre-set, your choices wont have any major effect.\n\nAlso the end is dull and lacking, its like \"you chose to \"something\"\" -The End\nbasically the end is like you reach the end of a book, and end up finding out that there is a second part to it, that you dont have and cant buy as it was never released.\n\nAvoid, nothing intesting in this one", "timestamp_created": 1485794650, "timestamp_updated": 1485794650, "voted_up": false, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.275546", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29569988": {"recommendationid": "29569988", "author": {"steamid": "76561198178602901", "num_games_owned": 314, "num_reviews": 10, "playtime_forever": 6, "playtime_last_two_weeks": 0, "last_played": 1485988965}, "language": "english", "review": "Let me start this by saying yes, I HAVE NOT ACTUALLY PLAYED THE GAME. Let me explain.\n\nA friend of mine had exclaimed to me their excitement when they learned that a YouTuber they enjoyed had begun this game, interested in what they had told me about the game, I checked out the video in question they had mentioned.\n\nImmediately the game had me drawn in with it's amazing writing, compelling story and the on-going intense atmosphere. The pacing of the story is good, it never has a boring or drawn out section and the writing does wonders to keep a thick atmosphere throught it all.\n\nAfter seeing it through on YouTube, I feel I have a fair basis to judge this game on, as the experience is solely based on reading and the odd decision to make here and there as opposed to a game like (just for example) DOOM, where you would get much more out of it from actually playing it. \n\nTo close, I will say this, although I experienced the game before buying it, the fact that as I mentoned above it was all so well compiled that I felt compelled to purchase this with no intent of going through it myself. It is an experience that should not be avoided.", "timestamp_created": 1485713405, "timestamp_updated": 1485714459, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.509804", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29556654": {"recommendationid": "29556654", "author": {"steamid": "76561198013189743", "num_games_owned": 245, "num_reviews": 49, "playtime_forever": 161, "playtime_last_two_weeks": 0, "last_played": 1485666313}, "language": "english", "review": "A very well-spent three dollars. A fantastic story, a wonderful work of interactive fiction, compelling characters, and masterfully written horror that evokes Lovecraft. I won't spoil the many possible endings, but I was very satisfied with how it ended. Highly, highly recommended.", "timestamp_created": 1485666391, "timestamp_updated": 1485666391, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.501330", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29536317": {"recommendationid": "29536317", "author": {"steamid": "76561198176969842", "num_games_owned": 64, "num_reviews": 3, "playtime_forever": 88, "playtime_last_two_weeks": 0, "last_played": 1485591197}, "language": "english", "review": "after playing this game twice each time doing a diffrent ending i can say that each ending are not what you would expect and everything you do in this game every choice you make every moment you waste looking at an object,it all ties together and makes the game drastically diffrent.Playing through this game was like playing a well detialed sci fy novel. defenatly worth every penny.", "timestamp_created": 1485591522, "timestamp_updated": 1485591522, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29529383": {"recommendationid": "29529383", "author": {"steamid": "76561198136085825", "num_games_owned": 56, "num_reviews": 3, "playtime_forever": 149, "playtime_last_two_weeks": 0, "last_played": 1485555160}, "language": "english", "review": "A very enjoyable game with intense moments, good, suspenseful music and good art and writing to back it all up.", "timestamp_created": 1485555491, "timestamp_updated": 1485555491, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29481474": {"recommendationid": "29481474", "author": {"steamid": "76561198036944468", "num_games_owned": 14, "num_reviews": 1, "playtime_forever": 148, "playtime_last_two_weeks": 0, "last_played": 1485346127}, "language": "english", "review": "On top of continuity issues I've seen other people mention (I noticed this most with the bullet count. Even if you give the gun to the person that fires off a shot, the gun still only has one bullet left if you choose to spare another character) there seemed to be a disconnect with the science the game is based on. \n\nOne of the characters references the idea that there's 10 dimensions, all well and good. Backed up by current theories in physics and quantum physics. \n\nHOWEVER. Throughout the entire game there's a severe break in the basis in real-life understanding of logic. For one, we who live in a 3D space can see things on a 2D space, but those in a 2D space (in a theoretical house drawing on a sheet of paper) cannot even comprehend us. We in the 3D cannot enter a 2D space without crushing our bodies and just dying from the compression. Basically, the laws of nature of whatever dimention you're in are the laws you're subjected to, biology be damned.\n\nWhile the idea of interdimentional Lovecraftian horrors sounds like a great premise, there was a lost opportunity for character motivation by ignoring that core theory of how the different dimentions work. \n\nThey shouldn't be able to operate on their own laws from their dimention, they should be severely limited and in INCREDIBLE pain after falling into our world. If they INTENTIONALLY invaded and were stated to do so, I might buy that they had some sort of tech to help them stabalize, but the game lore admits that they AREN'T stable and glitch in and out of existence. \n\nI'd buy that they were acting like wounded, cornered animals, especially if it were established that 3D humans fired first and didn't bother to try to make contact or misunderstood that they were in pain. Instead, the lore makes them out to be entities of pure sadistic evil. While I could maybe buy that they don't think much of 3D entities just like we wouldn't think twice about burning a stick figure drawing, that attitude drastically changes when your body has to adjust to a plane where you can no longer move in a set of directions you had before.\n\nHad a lot of promise, but more research would have made it a better horror experience. Endings could have used more elaboration, maybe an epilogue or something for the \"good\" endings. Which, I'll admit the choices only affecting character relations I'm on the fence about supporting. \n\nOn one hand, it feels unsatisfying, on the other hand however it fits into the Lovecraftian theme when dealing with entities far beyond our comprehension where at best you die quickly and at worst you go insane the more you learn until you finally kill yourself upon realizing that you cannot change anything or save anyone. \n\nI'm still recommending the game, it was a fun experience. This is more constructive criticism for the devs for any future projects dealing with the same kind of subject matter.", "timestamp_created": 1485347733, "timestamp_updated": 1485347733, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29479752": {"recommendationid": "29479752", "author": {"steamid": "76561198154533909", "num_games_owned": 53, "num_reviews": 15, "playtime_forever": 210, "playtime_last_two_weeks": 0, "last_played": 1485339392}, "language": "english", "review": "For $3 this is a masterpiece. The story was suspenseful. The characters were well thought out, although towards the end some of them seemed to change rather drastically in a very short amount of time. I'm still curious about the other possibilities that you can get from this game, but I'm not sure I want to spend another 3.5 hours to play it all over again. I wish there was a feature where you could start from a specific chapter (which there may be, I haven't gone back to look yet) so I could just go to the parts where I made mistakes and correct them. The only other criticism I have about this game is that it is simply another game that more or less creates the illusion of choice. In some instances it doesn't really matter what you choose to do, the outcome will be the same, however, this game didn't do that badly when it came to meaningful choices, and I commend it for that. I approve.", "timestamp_created": 1485339787, "timestamp_updated": 1485339787, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.543568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29471940": {"recommendationid": "29471940", "author": {"steamid": "76561198271921998", "num_games_owned": 15, "num_reviews": 2, "playtime_forever": 135, "playtime_last_two_weeks": 0, "last_played": 1485298074}, "language": "english", "review": "this game was incredible well worth the couple bucks it cost.", "timestamp_created": 1485298321, "timestamp_updated": 1485298321, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29466001": {"recommendationid": "29466001", "author": {"steamid": "76561198065064203", "num_games_owned": 61, "num_reviews": 21, "playtime_forever": 174, "playtime_last_two_weeks": 0, "last_played": 1485275864}, "language": "english", "review": "A minimally-graphic episodic novel that features a combination of sci-fi, mystery, thriller, and action genres that will make you go nuts over what's going on. There are parts where you choose what to do or what to say in conversations and they affects some part of the story.\n\nGood story and concept.\nThere may be some grammar/spelling errors and other text-related errors.\nNeat visual images that represent the place where the main character whose POV is at play is in.\nCool background ambient sounds that makes the experience a bit improved.", "timestamp_created": 1485277451, "timestamp_updated": 1490709443, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.459916", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29458988": {"recommendationid": "29458988", "author": {"steamid": "76561198039364415", "num_games_owned": 294, "num_reviews": 19, "playtime_forever": 177, "playtime_last_two_weeks": 0, "last_played": 1485251125}, "language": "english", "review": "A dark and brooding take on a Choose Your Own Adventure book, Buried was a pleasure to experience.\n\nI will post no spoilers in this review, so read freely.\n\nI found myself drawn in by the mystery of the story, trying to figure things out while also attempting to stay out of harm's way.  There are plenty of choices you have to make along the way, and at the end of each of the story's chapters they break down your decisions and show you how many other players forged a path similar to yours.  It was interesting to see if my decisions were the norm among those experiencing Buried or if I was taking the roads less travelled.\n\nIf interactive stories are your cup of tea then I highly recommend it.", "timestamp_created": 1485251585, "timestamp_updated": 1485251585, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29454429": {"recommendationid": "29454429", "author": {"steamid": "76561198017155455", "num_games_owned": 174, "num_reviews": 2, "playtime_forever": 87, "playtime_last_two_weeks": 0, "last_played": 1485400451}, "language": "english", "review": "A very nice change of pace from the games I usually play. Regardless of whether a choice matters in the end, each decision feels important and has weight. The one recommendation I'd give is to let us start from any chapter after completing the game once, so we can explore how the game changes. Maybe use our choices from the last time we got to that chapter as the previous decisions.\n\nAnyhow, very good game, highly recommend, look forward to seeing what else the studio comes out with!", "timestamp_created": 1485228331, "timestamp_updated": 1485228331, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29451327": {"recommendationid": "29451327", "author": {"steamid": "76561198027584793", "num_games_owned": 602, "num_reviews": 133, "playtime_forever": 300, "playtime_last_two_weeks": 0, "last_played": 1485180408}, "language": "english", "review": "So, I was fascinated by this imperfect story and found myself really wanting to keep moving forward to see what happened. Sure, it's not a Hugo Award winner, but I'm not so cynical that I didn't enjoy it. It was a lot of fun.\n\nHowever: The vast majority of choices don't seem to really have any serious consequences. I've gone back and replayed it twice, and, with a couple of exceptions, you end up in the same place no matter what you have chosen. However, there are a couple of life-and-death decisions and a decision or two that make other characters irritable for awhile.\n\nOverall, I would have liked the game a bit more if there had been more serious consequences to the decisions made and more endings than just the 2 to 4 (depending on how you look at it). Most decisions don't really do anything and some of the decisions that the game claims are important are only acknowledged with a sentence or two later. It's almost as though the writer had intended a larger work, but then condensed everything down to where there were really no wrong turns.\n\nStill, I enjoyed the game and the story, and I even bought a copy for my little boy to play on his account. He was convinced even the most minor decisions were monumental and really enjoyed the game as well.\n\nThumbs up for me.", "timestamp_created": 1485211394, "timestamp_updated": 1485211394, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.640972", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29439171": {"recommendationid": "29439171", "author": {"steamid": "76561198019233661", "num_games_owned": 316, "num_reviews": 1, "playtime_forever": 96, "playtime_last_two_weeks": 0, "last_played": 1485161326}, "language": "english", "review": "Lovecraft written better.  It works in the fashion of the Choose Your Own Adventure books of my youth.  A story of a simple logger who awakes after an incident.  To tell more would be to spoil.  It takes about 2 hours or so depending on your reading speed.  The choices are generally the \"go left\" or \"go right\" and the story seems to follow a similar path more like branching paths that tie into the main narrative.\n\nIf you love the works of Lovecraft at his most sci-fi then Buried is for you.  It's $5.  Buy it and play it.  I'm going to play again and see what the different results are.  So if you like story games this is a good time drinker.", "timestamp_created": 1485161721, "timestamp_updated": 1485161721, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.543568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29434920": {"recommendationid": "29434920", "author": {"steamid": "76561198035232890", "num_games_owned": 147, "num_reviews": 1, "playtime_forever": 234, "playtime_last_two_weeks": 0, "last_played": 1485136513}, "language": "english", "review": "Let’s keep this short and simple. It was good, enjoyed the story very much and the ending was quite satisfying. Well worth the $3 however starting in chapter 3 the game would glitch and die on me and that got slightly worse with each chapter but it did save progress so it wasn't setting me back but just causing minor inconveniences.", "timestamp_created": 1485136835, "timestamp_updated": 1485136835, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.510373", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29434536": {"recommendationid": "29434536", "author": {"steamid": "76561198253062769", "num_games_owned": 47, "num_reviews": 4, "playtime_forever": 231, "playtime_last_two_weeks": 0, "last_played": 1485134410}, "language": "english", "review": "Good Game.\n\nRecommended if you need a game to play offline or just bored of other games.\n\na couple continuity errors but for the most part very well written.\n\nIf you liked this game go read a book.", "timestamp_created": 1485134814, "timestamp_updated": 1485134814, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29421789": {"recommendationid": "29421789", "author": {"steamid": "76561198034264849", "num_games_owned": 293, "num_reviews": 5, "playtime_forever": 165, "playtime_last_two_weeks": 0, "last_played": 1485084143}, "language": "english", "review": "I am in love with this game. Honestly a very interesting story and good pacing between each sentence. Text base with simple background pictures to give you a feel for the setting, nothing overly bright or too detailed so you can use your imagination instead of visual queues. Would definitely recommend to text based decision lovers. I'm planning on playing through it multiple times because I want to see all the possibilities for myself :)", "timestamp_created": 1485091819, "timestamp_updated": 1485091819, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29414341": {"recommendationid": "29414341", "author": {"steamid": "76561198060897854", "num_games_owned": 293, "num_reviews": 34, "playtime_forever": 269, "playtime_last_two_weeks": 0, "last_played": 1485147847}, "language": "english", "review": "As the name and screenshots would have you assume, Buried is an interactive story game where you play by choosing different dialogue options. The game is just reading the text on the screen with a pretty screenshot in the background.  That is the dumbed down version of what you can expect. \n\nThe game will play about 3 hours or more give or take depending soley on how fast you read and can make tough decisions.  Immedietly the game throws you into the action making you choose the fate and well being of those around you as well as yourself.  As of right now I have watched half of the game in a let's play by Markiplier (https://www.youtube.com/watch?v=JZYwn4noWho) and have also finished my own playthrough.  The game is so immersive and tense that its like watching a movie that you at the same time are a part of.  You feel remorse for your actions and sympathy for characters you never see or hear and that is only a part of the beauty of this game. You have to try it for yourself and you will quickly find out if you like it or not defintely by the 2 hour steam refunding point. Goodluck!\n\n9/10 I HIGHLY recommend this game to anyone who is interested.  One of my very few problems with the game is the ending felt just a little bit rushed or like it could have been just a little more satisfying in multiple ways. I like what it tried to do but fell flat and felt more like a lazy cop-out than an ending worthy of the game up to that point.", "timestamp_created": 1485063142, "timestamp_updated": 1485063142, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29408616": {"recommendationid": "29408616", "author": {"steamid": "76561198204236928", "num_games_owned": 33, "num_reviews": 1, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1485036137}, "language": "english", "review": "This is one of my favourite interactive games ever!\nwhen i first bought this game i was like \"hopefully this wont be a waste of my money\" and i was truly not let down\ni love how (unlike telltale, love ya telltale) most of the chocies acctually matter. \nwhen i played though i got what i would call the bad ending. everyone died (dennis cuz i was like oh he said he could and out and amy cuz i was like yellow probs means flamable)   but just because of the ending i want to play it more (which i will) just to see what the other chocies do.\noverall one of the best interactive story games ive seen.", "timestamp_created": 1485036930, "timestamp_updated": 1485036930, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29393211": {"recommendationid": "29393211", "author": {"steamid": "76561197961240585", "num_games_owned": 255, "num_reviews": 37, "playtime_forever": 598, "playtime_last_two_weeks": 0, "last_played": 1485097209}, "language": "english", "review": "I'm gonna be blunt here, this, game, is, freaking fantastic. I'm only in 3 chapters and I'm hooked. If you are looking for the old book reading ways of \"choose your adventure\" style books this is the style for you. I'm currently recording a let's play of it and will be up on youtube and I will provide a link below but for now, let's get into the depth of this.\n\n---Story So Far---\n\nLike I said I'm only 3 chapters in but it can only get better from here. I was instantly hooked into the story from the start, so far though it seems not much change has going on since I am watching anther YouTuber play it after the chapters I played and it seems we still got the same results just a bit different,  a different order  etc etc but that does not decline the value of this. Why? Because I could play it and someone could play it and they could be like, OMG DUDE DID YOU SEE THIS? And I'm like NO DUDE BECAUSE THAT'S NOT WHAT HAPPENED! I do love the fact that at the end of each chapter it tells you how others reacted to the major decisions that you make in the story. It'll say you and 36% of players chose this.\n\nSee my point? I won't spoil anything at all about this you'll have to pay the money for the game.\n\n---Music/Artwork---\n\nThe music is a ten out of ten, sure it's very basic but the subtle of the music adds to the climate of the still shot art. The art that is in the background is fantastic.  Though I think they could have added more to the music at the starting of the chapter 1/2ish by acting a slight hum, ya know the hum of florscent(sp?) lights but it's not a deal breaker.\n\n---Price---\n\nFor 2.99 this game is quite worth it so far, I hope to play it more after I beat it to see if there are any other endings/branching paths etc etc. I really hope the makers will make more of these. Perhaps expand the genre, expand on their game and make even more, bigger, more decisions/endings, etc etc.\n\n---\n\nIf you wish to see what the game is about, here is a spoiler alert and a link to the playlist of what I am making for a Let's Play. I hope this convinces more people to play this game.\n\nhttps://www.youtube.com/playlist?list=PLrS81Xfbl5mtRJ5y9IJyw4onO94b-ZDF6\n\nHave a good night.", "timestamp_created": 1484989851, "timestamp_updated": 1484989851, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.564894", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29389739": {"recommendationid": "29389739", "author": {"steamid": "76561198040757926", "num_games_owned": 226, "num_reviews": 5, "playtime_forever": 157, "playtime_last_two_weeks": 0, "last_played": 1484972990}, "language": "english", "review": "What an incredible story! The immersion, plot development and character building really made me love this game. Having to sit back and think about your choices really added to the whole experience. I will be replaying this game for sure... I may not be so nice the second go round.", "timestamp_created": 1484973183, "timestamp_updated": 1484973183, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.508299", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29389543": {"recommendationid": "29389543", "author": {"steamid": "76561198296532998", "num_games_owned": 9, "num_reviews": 3, "playtime_forever": 447, "playtime_last_two_weeks": 0, "last_played": 1486251188}, "language": "english", "review": "3/5\n\nReally intense and wonderful game, full of choices that will affect the rest of the game--\n\nIs what I would say, except that really all your choices boil down to two single endings that vary only as far as who you ensure survives until the very end.\n\nWhile the game is still really fun, it's also very frustrating and leaves you fairly unsatisfied with the ending.", "timestamp_created": 1484972222, "timestamp_updated": 1484972222, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29387957": {"recommendationid": "29387957", "author": {"steamid": "76561198245666106", "num_games_owned": 53, "num_reviews": 3, "playtime_forever": 319, "playtime_last_two_weeks": 0, "last_played": 1513777721}, "language": "english", "review": "I loved this so much one of the best i've ever played.", "timestamp_created": 1484964284, "timestamp_updated": 1511578116, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29386067": {"recommendationid": "29386067", "author": {"steamid": "76561198013892549", "num_games_owned": 404, "num_reviews": 5, "playtime_forever": 283, "playtime_last_two_weeks": 0, "last_played": 1484964754}, "language": "english", "review": "An engaging storyline with compelling writing, a joy to play. This is a very fine example of interactive fiction.", "timestamp_created": 1484955446, "timestamp_updated": 1484955446, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.532084", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29383798": {"recommendationid": "29383798", "author": {"steamid": "76561198140748974", "num_games_owned": 24, "num_reviews": 1, "playtime_forever": 316, "playtime_last_two_weeks": 0, "last_played": 1485091207}, "language": "english", "review": "This is not like thoose telltale games. Your choices will change the outcome. I personally liked the chapter 1,2,3 mostly. The fear of the unknown. Theese chapters made me feel very vulnrable. I had no idea where I was, who I am with or what the hell was going on. While the futher chapters....felt more invincable and a bit rushed. What I liked a lot about this It didn't have that many clicheis as normally horror games do. It thhrew many suprieses my way. The ending felt a little bit.....unsatisfying. But in overall this will make your blood rush from fear and will force you to make difficult decisions. And finally a horror game with no unoriginal jumscares. Now excuse me while I go replay this and try all the outcomes.", "timestamp_created": 1484946766, "timestamp_updated": 1484947034, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29381139": {"recommendationid": "29381139", "author": {"steamid": "76561198101080514", "num_games_owned": 36, "num_reviews": 1, "playtime_forever": 151, "playtime_last_two_weeks": 0, "last_played": 1484938169}, "language": "english", "review": "Great game, but ending felt rushed and lazy.  Worth playing for sure.", "timestamp_created": 1484938262, "timestamp_updated": 1484938262, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.522387", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29372906": {"recommendationid": "29372906", "author": {"steamid": "76561198028410931", "num_games_owned": 279, "num_reviews": 23, "playtime_forever": 245, "playtime_last_two_weeks": 0, "last_played": 1485072906}, "language": "english", "review": "I actually really enjoyed playing the game, it has an immersive story that sometimes kicks your ass for making a bad decision.....I made a Youtube series about it, so if you want to check out one path to go down before diving in yourself, check out the first video here\n\nhttps://www.youtube.com/watch?v=GyTq4UiIZNQ\n", "timestamp_created": 1484908599, "timestamp_updated": 1484908599, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.534202", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29309594": {"recommendationid": "29309594", "author": {"steamid": "76561198021961816", "num_games_owned": 31, "num_reviews": 4, "playtime_forever": 378, "playtime_last_two_weeks": 0, "last_played": 1484625243}, "language": "english", "review": "An engaging and delightfully strange story with some difficult decisions to make, especially as the characters are given enough depth to inspire empathy and familiarity. \n\nNot bad.  I'll likely go through it a few more times just to see how different choices change up the plot.  :)", "timestamp_created": 1484625637, "timestamp_updated": 1484625637, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29309369": {"recommendationid": "29309369", "author": {"steamid": "76561198220791780", "num_games_owned": 54, "num_reviews": 20, "playtime_forever": 408, "playtime_last_two_weeks": 0, "last_played": 1498008100}, "language": "english", "review": "AMAZING!! I normally don't fine interactive stories like these appealing, but this one sparked my interest after watching a playthrough! The story is well done and the enviornments match the story. The eerie music gives a horror feel to the game and I find myself wanting to play again just to make different decisions. I didn't know some had an affect later on that seemed like they wouldn't. \n\nHighly recommended!", "timestamp_created": 1484624517, "timestamp_updated": 1484624517, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "29309289": {"recommendationid": "29309289", "author": {"steamid": "76561198216833511", "num_games_owned": 36, "num_reviews": 1, "playtime_forever": 233, "playtime_last_two_weeks": 0, "last_played": 1491015841}, "language": "english", "review": "Hi, this is my first review and I didn't really plan on making any, but I liked this game so much I had to post a review.\n\nSo in \"Buried\" you are a logger who wakes up randomly after an apparent accident that you don't remember for the life of you. I don't want to say anymore in case I accidently spoil it for you but I figured i would just say the first few words\n\nImmediately I was pulled in as I'm sure many were after Markipliers video. Now, for the record, interactive stories are my favourite so I may be sayin this out of my love for horror and choices but I really enjoyed this game, even if you haven't played one this is a perfect introduction to interactive stories.\nThanks for reading.", "timestamp_created": 1484624152, "timestamp_updated": 1484624152, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497512", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29308381": {"recommendationid": "29308381", "author": {"steamid": "76561198028073468", "num_games_owned": 194, "num_reviews": 1, "playtime_forever": 115, "playtime_last_two_weeks": 0, "last_played": 1484619889}, "language": "english", "review": "Amaziiiiiiiing interactive game! I was entranced during the whole story. Everything, from the pictures and ambiance, to the story itself and the sounds, is perfect.\nThe plot is interesting, the choices are too and the ending is great.\n\nHonestly, it's a great game and I'd recommend getting it if you enjoy interactive stories and choose-your-own adventure games.", "timestamp_created": 1484620107, "timestamp_updated": 1484620107, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29306348": {"recommendationid": "29306348", "author": {"steamid": "76561198057133137", "num_games_owned": 44, "num_reviews": 4, "playtime_forever": 558, "playtime_last_two_weeks": 0, "last_played": 1504855399}, "language": "english", "review": "This game was an INCREDIBLE experience with an amazing story. I might have to play it at least 5 more times because of all the things I need to try. I feel the sound could have been a bit more accurate to the story and that would have developed even more realism and trance into the story, but with just the pictures and words I was given.. Bravo. The story had me hooked till the end.", "timestamp_created": 1484609434, "timestamp_updated": 1484609434, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28940905": {"recommendationid": "28940905", "author": {"steamid": "76561198031141181", "num_games_owned": 80, "num_reviews": 27, "playtime_forever": 126, "playtime_last_two_weeks": 0, "last_played": 1483029405}, "language": "english", "review": "Its a good story game. Not great, i want to stress that. An average plot, interesting choices but no major story changing paths. You do get big decisions but what you choose does not affect the story much, its just 2 ways to get to the same exact point a bit down the road.\n\nFor its price though you get a good afternoon amusement", "timestamp_created": 1483364909, "timestamp_updated": 1483364909, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27576521": {"recommendationid": "27576521", "author": {"steamid": "76561198006355256", "num_games_owned": 88, "num_reviews": 1, "playtime_forever": 182, "playtime_last_two_weeks": 0, "last_played": 1453518997}, "language": "english", "review": "Playthrough for my first game was 3 hours. The story in this playthrough was short, but there are multiple ways you can go. It has suspense for a text based game and you actually have to pay attention to what you do. The best part is the price you can go wrong for 2.99 or less. 8/10.", "timestamp_created": 1480122092, "timestamp_updated": 1480122092, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500896", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25627741": {"recommendationid": "25627741", "author": {"steamid": "76561198168716605", "num_games_owned": 2156, "num_reviews": 605, "playtime_forever": 63, "playtime_last_two_weeks": 0, "last_played": 1476560449}, "language": "french", "review": "Une histoire interactive ayant des images de fond très variées, énormément de texte, bien des choix et de la bonne musique d’ambiance. Par contre, ce «jeu» à un gros point noir. Le texte s’auto-lit, donc il avance d’une ligne à toute les 5-6 secondes. Pas pratique pour les lecteurs lents ou qui ont l’anglais comme langue seconde. Heureusement, j’ai découvert qui était possible de relire les textes précédents jusqu’à un certain point. C’est quand même très agaçant, mais l’histoire est excellente.", "timestamp_created": 1474502753, "timestamp_updated": 1474502753, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.596066", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23948563": {"recommendationid": "23948563", "author": {"steamid": "76561198118127979", "num_games_owned": 166, "num_reviews": 59, "playtime_forever": 225, "playtime_last_two_weeks": 0, "last_played": 1467273300}, "language": "russian", "review": "Всегда любил читать книги и играть в игры. Поэтому был уверен в том, что интерактивная история - это отличное сочетание и того, и другого. В очередной раз убеждаюсь в том, что не стоит останавливаться, скажем, только на FPS, стратегиях или других жанрах. Двигаться во всех направлениях дейстительно здорово. Доказательством того стала \"Buried\" - игра в новом для меня жанре. Возможно, мне повезло и другие подобные игры не столь хороши, но то, с чем я столкнулся зашло на ура. Радует приличный выбор действий, от обычных киношных клише а-ля \"Спасайтесь, я их задержу сколько смогу!\" до \"На всякий случай расколоть башку дружественному NPC без особой на то надобности\". И ведь выбор делать действительно интересно. И было бы ещё интереснее, если бы ГГ мог, при стечении определённых обстоятельств, умереть сам. \nКак уже упоминалось выше, в игре много выбора, что делает её реиграбельной. Пока прошёл только на один раз, но уверен, что концовки, как минимум две. С уверенностью рекомендую \"Погребённых\" любителям почитать и погрузиться в повествование с головой!", "timestamp_created": 1467274960, "timestamp_updated": 1467275065, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.593038", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23425215": {"recommendationid": "23425215", "author": {"steamid": "76561197993838128", "num_games_owned": 715, "num_reviews": 9, "playtime_forever": 177, "playtime_last_two_weeks": 0, "last_played": 1465247335}, "language": "english", "review": "This is a very simply made game: static image backgrounds, text and music. No amazing 3D graphics, dazzling explosions or killer AI enemies... What is amazing is the terrific, immersive story you are drawn into.\n\nThe tale begins with you waking up after some kind of accident in the woods. You try to find out what has happened and are gradually drawn into lethal mystery. All the elements are top-notch. Great characters. Creepy environments. Discoveries that are both baffling and horrific. And threats that are chilling and relentless.\n\nDuring the story, you regularly make decisons that will affect the narrative. You may find yourself crushed by a choice which leads to an awful death. I found there were sufficent decisions to be made to keep you deeply involved without detracting from the game's biggest strength, which is the storytelling.\n\nThe writing is gripping from start to end. For me, it felt like being trapped in a truly sinister Stephen King story - it was that good.\n\nNegatives? Other than a few typos near the end of the story (which didn't spoil the game), none at all.\n\nPlaytime: 3-4 hours.\n\nOverall: 10/10. I'd love to play another game like this from the same production team!", "timestamp_created": 1465248297, "timestamp_updated": 1465248297, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.524176", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23286724": {"recommendationid": "23286724", "author": {"steamid": "76561198048974498", "num_games_owned": 1708, "num_reviews": 483, "playtime_forever": 133, "playtime_last_two_weeks": 0, "last_played": 1464549094}, "language": "english", "review": "Simply put, this is a solid and reasonably intriguing horror-mystery story told in the form of an interactive novel. The visuals are minimal but effective, the sound is spooky and immersive, and the writing is simplistic and a tad underwhelming but gets the job done. No great shakes, and fairly short (a few hours, tops), but worth the three bucks if you're up for a moody and sometimes action-packed tale with a wee bit of interactivity. It won't be an earth-shattering experience for anyone who's read the odd horror/sci-fi short story - or played a certain famous video game franchise, which I won't mention the name of for spoiler reasons! - but it's an entertaining enough diversion for those of us with an unquenchable taste for the eerie and enigmatic. \n\n   Oh, and for those greatly concerned with such things: it would also appear to have some small degree of replayability due to the variety of choices on offer, even if one suspects that most if not all of the story's main mysteries are revealed in a single playthrough. But hey, what do you expect for three bucks? A blow-job AND a marriage contract?! C'mon, let's be realistic here...\n \nVerdict: 7.5/10.", "timestamp_created": 1464592917, "timestamp_updated": 1464627700, "voted_up": true, "votes_up": 11, "votes_funny": 1, "weighted_vote_score": "0.668736", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23245508": {"recommendationid": "23245508", "author": {"steamid": "76561198240216506", "num_games_owned": 21, "num_reviews": 1, "playtime_forever": 193, "playtime_last_two_weeks": 0, "last_played": 1482296816}, "language": "english", "review": "Absolutely amazing. Definitely a game if you like to read and are ready for about 3 hours of sci-fi, suspense, terror, and all around mind-boggling decision-making during crucial plot points. However, if you're not into reading and music/photos don't really create an effective ambiance for you, I'd suggest moving along. I'm very impressed with the detail that went into the writing and how much effort the developers clearly put into making this game. So congrats to them on a job well-done. I will definitely be recommending this one to all my friends! Worth more than $3.00, in my opinion.", "timestamp_created": 1464405776, "timestamp_updated": 1464405776, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.517740", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23218566": {"recommendationid": "23218566", "author": {"steamid": "76561198292704247", "num_games_owned": 47, "num_reviews": 10, "playtime_forever": 5, "playtime_last_two_weeks": 0, "last_played": 1461859865}, "language": "english", "review": "Great if you like reading reading and then some reading! Myself i like to play games. Would i reccomend this? No id rather watch my close family been mauled to death by a pair of bengal tigers whilst listening to tom jones greatest hits. Hope that helps :(", "timestamp_created": 1464272595, "timestamp_updated": 1464272595, "voted_up": false, "votes_up": 2, "votes_funny": 13, "weighted_vote_score": "0.076850", "comment_count": "12", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21912678": {"recommendationid": "21912678", "author": {"steamid": "76561197965738791", "num_games_owned": 636, "num_reviews": 50, "playtime_forever": 108, "playtime_last_two_weeks": 0, "last_played": 1468210105}, "language": "english", "review": "10/10 I recommend this game!\n\nThis game is kind of a \"choose your own adventure game\" in that you are given choices as you play and these choices determine the outcome of further storyline.\n\nIt's not action packed, but it sets a good mood and environment for it's plot. It's a great mysterious story that I haven't gotten too far into -- but I want to know more. It's gripped it.\n\nThis game is under $5 and the quality of the story is worth that much. Multiple chapters to play (I think 5) and let your imagination run wild!\n\nCheck out chapter 1 here:\nhttps://www.youtube.com/watch?v=r8q9j00NDaQ\n\nSubscribe for a chance to win free games :)", "timestamp_created": 1458344773, "timestamp_updated": 1458344773, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.508588", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21893440": {"recommendationid": "21893440", "author": {"steamid": "76561198195923809", "num_games_owned": 155, "num_reviews": 89, "playtime_forever": 1551, "playtime_last_two_weeks": 0, "last_played": 1458312003}, "language": "english", "review": "better than you think idiot", "timestamp_created": 1458250564, "timestamp_updated": 1458250564, "voted_up": true, "votes_up": 2, "votes_funny": 5, "weighted_vote_score": "0.426811", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21548084": {"recommendationid": "21548084", "author": {"steamid": "76561198238409244", "num_games_owned": 72, "num_reviews": 6, "playtime_forever": 150, "playtime_last_two_weeks": 0, "last_played": 1455110650}, "language": "czech", "review": "Väčšinou netočim takéto hry,ale Buried my učaroval :) skvely príbeh,hudobne pozadie a aj atmosféra celej interactive story je úžas :) 10/10", "timestamp_created": 1456763437, "timestamp_updated": 1456763437, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21238633": {"recommendationid": "21238633", "author": {"steamid": "76561198102109028", "num_games_owned": 88, "num_reviews": 2, "playtime_forever": 312, "playtime_last_two_weeks": 0, "last_played": 1455499279}, "language": "english", "review": "I love me some text-based narrative games and this one really did well. Most choices actually matter, even small ones, which is something most narrative games don't do well. The sci-fi elements are well done too. There are a lot of games where they use the old \"you're trapped in a confined area and something has gone wrong\" thing, but this one did well in telling the story. Can't wait to more form Bromoco Games!", "timestamp_created": 1455568705, "timestamp_updated": 1455568705, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21197660": {"recommendationid": "21197660", "author": {"steamid": "76561198050197731", "num_games_owned": 233, "num_reviews": 20, "playtime_forever": 170, "playtime_last_two_weeks": 0, "last_played": 1455277008}, "language": "english", "review": "CURIOSITY alway got me , great story , great theme , great sci-fi if you like horror-interactive story , I highly recommend this game for you \n\nscore : 9/10 \n\nbad thing : this game too short and few choices doesn't effect the story much", "timestamp_created": 1455426348, "timestamp_updated": 1455426348, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.491078", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21163299": {"recommendationid": "21163299", "author": {"steamid": "76561198140299850", "num_games_owned": 1327, "num_reviews": 119, "playtime_forever": 188, "playtime_last_two_weeks": 0, "last_played": 1455308223}, "language": "english", "review": "“Buried: An Interactive Story”, as an interactive story has a lot going for it. But as a story it still has a way to go, and some of the issues are so integral as to likely prohibit repair. Still, for the most part not a bad way to spend three hours. (Due to offline play, I can only estimate game time at over three hours. There is a LOT of text. I found this to be both a plus and a minus, as you will see.)\n\nThe premise of “Buried: An Interactive Story” (BAIS) is that you are the boss of a logging crew who very suddenly finds that he and his crew are the victims of a mysterious and unknown disaster deep in the forest. You find your way into an underground government facility, where things really start to go bad. The story/game is broken into 5 chapters, each chapter is further broken into small segments, allowing for pauses.\n\nThe story of BAIS is pretty basic Lovecraft-like, and not particularly original. Saying that, I would also say that the mood generated is adequately creepy, with a story that feels both complete and real, in the context of this type of game. If the idea was simply to create a great story, this would fail. But since the point is to create an interactive story, it succeeds quite well, with the storyline leading not to more story so much as more decisions. The purpose is simply to drive the player to the next choice, and the choices really stand out (at least for the first three chapters.) The choices really are often quite difficult to make, as they almost always involve other characters for which you feel a genuine sense of responsibility. Some choices are simply to move the story along, and give the feeling that the response would have varied little based on the decision made, if at all. Some choices are significant, as you are notified once your choice is final. At the close of each chapter the player is notified of the statistics involving each significant choice among existing players. \n\nUNFORTUNATELY, once the fourth of five chapters of BAIS is reached, the choices do next to nothing for the story and are rarely significant. In virtually every case it’s a simple choice of “noble choice” versus “selfish choice”, and shallow beyond belief considering the depth of many choices offered in the first three chapters. I chose “noble” (this IS fiction), so I have no knowledge of how other choices would have played out. About his point, the complexity of the game that was such a strong feature to begin…..comes crashing down. In numerous cases the story feels unconnected, and one death as related in the story was absolutely NOT the death that had occurred in “my” story. While there were many pluses to the first half of the story, I was quite happy when it finally came to a grinding halt.\n\nGreat attention was paid to the grammar in BAIS, which was much appreciated. I only found one case of a typo, one of a sentence that made little sense linguistically, and one case of “I” instead of “me”. While there were numerous cases of commas improperly used (or absent), they were by no means dealbreakers. The minor background sounds added much, as did the background stills and the choice of typeface. The feature of leaving the game with a simple ESC, then returning regardless of the position within a chapter segment was very welcome.\n\nWhile I wish BAIS had either been shorter and cheaper, or long with more attention paid, it was still acceptable. Still, I would recommend waiting for a sale price of no more than $1.50 US.\n\nBUY ON SALE ONLY.\n\nThank you.", "timestamp_created": 1455316852, "timestamp_updated": 1455432118, "voted_up": true, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.697317", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21078806": {"recommendationid": "21078806", "author": {"steamid": "76561198139094674", "num_games_owned": 12, "num_reviews": 1, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1507499804}, "language": "english", "review": "Good stuff.", "timestamp_created": 1455033430, "timestamp_updated": 1455033430, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.499782", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20926276": {"recommendationid": "20926276", "author": {"steamid": "76561198075895667", "num_games_owned": 69, "num_reviews": 2, "playtime_forever": 1494, "playtime_last_two_weeks": 0, "last_played": 1454479610}, "language": "english", "review": "Wasnt sure what to expect but totally worth it. The writers were creative and original and that made the story interesting. Great way to read a thriller", "timestamp_created": 1454479886, "timestamp_updated": 1454479886, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20915744": {"recommendationid": "20915744", "author": {"steamid": "76561198269744136", "num_games_owned": 28, "num_reviews": 3, "playtime_forever": 320, "playtime_last_two_weeks": 0, "last_played": 1454876545}, "language": "english", "review": "I need more games like this in my life.  honestly can't think of a single bad thing to say about it. \nIt's like the walking dead/ telltale games where you get reviewd on the end of every chapter, and compares your choices to the choices other players made. Everything else you need to know comes from the promo.", "timestamp_created": 1454435844, "timestamp_updated": 1454435844, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20881401": {"recommendationid": "20881401", "author": {"steamid": "76561198256528057", "num_games_owned": 87, "num_reviews": 6, "playtime_forever": 110, "playtime_last_two_weeks": 0, "last_played": 1454613439}, "language": "english", "review": "-Edited-\n\nAfter being contacted by one of the team (in a very friendly manner!) I now got this game on my tablet instead, and am happy to say I can now enjoy the rest of the story.\nNot just a good story, but a good team behind it as well, an overall very pleasant experience in my book.\n\n\n-Original-\n\nIt feels like someone gave me a good book, let me read half of it, then took it away again.\nThe story was engaging enough, and I did enjoy it while it lasted.\nThat said, I personally can't recommend this because halfway through I ran into an issue where the text simply refused to show up again, and nothing I tried has brought it back, or even allow me to start over.", "timestamp_created": 1454274172, "timestamp_updated": 1454613950, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20865690": {"recommendationid": "20865690", "author": {"steamid": "76561198161426497", "num_games_owned": 50, "num_reviews": 3, "playtime_forever": 147, "playtime_last_two_weeks": 0, "last_played": 1454222641}, "language": "english", "review": "Was decent. It picked up for me around chapter 3- was actually fun after that. \nOverall it's worth playing through atleast once. \n\n7/10", "timestamp_created": 1454222750, "timestamp_updated": 1454222750, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.499782", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20858258": {"recommendationid": "20858258", "author": {"steamid": "76561198261121966", "num_games_owned": 34, "num_reviews": 1, "playtime_forever": 166, "playtime_last_two_weeks": 0, "last_played": 1453787526}, "language": "english", "review": "Thoroughly enjoyable", "timestamp_created": 1454190598, "timestamp_updated": 1454190598, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.499782", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20856452": {"recommendationid": "20856452", "author": {"steamid": "76561198090212889", "num_games_owned": 423, "num_reviews": 12, "playtime_forever": 68, "playtime_last_two_weeks": 0, "last_played": 1464385235}, "language": "spanish", "review": "Great story, accompanied by a great atmosphere, nice graphics and entertaining soundtrack. Good buy...I love it :-)", "timestamp_created": 1454185175, "timestamp_updated": 1454185175, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20817039": {"recommendationid": "20817039", "author": {"steamid": "76561198047597918", "num_games_owned": 565, "num_reviews": 49, "playtime_forever": 294, "playtime_last_two_weeks": 0, "last_played": 1506729414}, "language": "english", "review": "I describe this as a Poor man's version of a telltale game\n\nSerious revieuw; \n\nI am still short into the game, but let me tell you, wow. It has been a while i was so evolved with the story of a game.\nThe text is easy and good to follow, choises are clear and all have they'r results on what will happen.\nIf you liked Telltale games then you will adore this. It is heavilly inspired by it and 1 thing that shows it is that at each chapter you get a little menu that shows how many % of what players made what choise.\n*random example* 36% of the players desided not to inspect ______ body.\n\nTo give you a idea.\n\nDo i recomend it? Yes. Totally. If you like atmospheric games and reading. Totally go for it!\n\n\n1 thing i have to confess is that they made the mistake of not making it feel YOU are there, dont get me wrong but they let you play as a 41 year old guy that owns a wood chopping company, if they gave the idea that it was you standing there and you could fill in names of friends then it truly is a masterpiece.\n\nMaybe just me but non the less it's great. i love it so far", "timestamp_created": 1454031270, "timestamp_updated": 1454031270, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.499782", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20799288": {"recommendationid": "20799288", "author": {"steamid": "76561198014683777", "num_games_owned": 187, "num_reviews": 3, "playtime_forever": 272, "playtime_last_two_weeks": 0, "last_played": 1453612435}, "language": "english", "review": "I was in the mood for an atmospheric game that wasn't going to require 50+ hours of gameplay and my firstborn to complete, and I stumbled upon Buried.\nIt was brief (about 2 - 2.5 hours for the first playthrough), well written (I was never disappointed with actions or my choices), and enrapturing enough to draw me in from the first scene without my needing to work for it. The story was interesting, and while not incredibly deep, it was adequate.\nMy biggest qualm is that regardless of what you choose to do, the greatest differences of the outcome are only made in the end of the game (which you can only get to by playing through the rest of the game first, as there is no saving) and thus the plot was extremely linear and reduced the replay value to once or twice at most, which is disappointing for a \"choose-your-own-adventure\" style story.", "timestamp_created": 1453959601, "timestamp_updated": 1453959680, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20761318": {"recommendationid": "20761318", "author": {"steamid": "76561198081356015", "num_games_owned": 443, "num_reviews": 1, "playtime_forever": 486, "playtime_last_two_weeks": 0, "last_played": 1453784231}, "language": "english", "review": "This game is exactly what it is advertised as. It is not really a game, in the traditional sense, but an interactive story. Do not go into this expecting traditional gameplay found in most titles as you're bound to be really, really annoyed. It's not even like a point and click adventure. You have no control over your character's movement, just some decisions that he makes throughout the 2-3h story.\n\nWithout ruining too much of the story, this is a sci-fi text-based adventure that takes place in the woods of Kentucky. The story is narrated on screen via text, an eerie/haunting soundtrack and evocative imagery. I highly recommend that you play this game in the dark, both literally and figuratively. Knowing anything about the story in any form would ruin the thrill completely, and for this purpose I'm not going to go into detail here.\n\nThe bottom line is - don't go into this expecting more than what you see in the title. It is just that - and it does what it does remarkably well.", "timestamp_created": 1453791825, "timestamp_updated": 1453909383, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.629948", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20760929": {"recommendationid": "20760929", "author": {"steamid": "76561198005444839", "num_games_owned": 1018, "num_reviews": 47, "playtime_forever": 169, "playtime_last_two_weeks": 0, "last_played": 1453788989}, "language": "english", "review": "Great atmosphere, dark and oppressive thanks to good writting and good background sound, highly recommended for those who enjoy text based adventures (and there are quite a few choices to make, many minor, several major).\n", "timestamp_created": 1453789133, "timestamp_updated": 1453789133, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.608049", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20715517": {"recommendationid": "20715517", "author": {"steamid": "76561198070497067", "num_games_owned": 148, "num_reviews": 2, "playtime_forever": 231, "playtime_last_two_weeks": 0, "last_played": 1455870082}, "language": "english", "review": "This contains everything i could ever ask for in a Choose your own adventure game.\nSimply: I love it.\nThe story is original and it never lacks for excitement. I would recommend this game.", "timestamp_created": 1453601834, "timestamp_updated": 1453601834, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.586887", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20707018": {"recommendationid": "20707018", "author": {"steamid": "76561198061172632", "num_games_owned": 488, "num_reviews": 98, "playtime_forever": 197, "playtime_last_two_weeks": 0, "last_played": 1453660019}, "language": "english", "review": "[h1]TL:DR[/h1]\n[i]Lumberjacks know how to fell aliens pretty damn well.[/i]\n\n[h1]The Good Stuff[/h1]\n++Telltale-esque story where choices matter\n++Lots of choices throughout, some make a difference whereas some provide a different line in the dialogue\n+Text moves at your speed \n+See your choices after each chapter\n+Seeing as choices matter, multiple playthroughs are possible\n+Good sci-fi action and writing\n+Background paints a picture as to what the setting looks like\n+Can easily do one plathrough in one sitting\n\n[h1]The Ok Stuff[/h1]\n=Characters are for the most part good. Main guy is cool but some minor characters are a bit annoying. \n=There are decisions where one option is clearly better than the other, only a couple though and they're mostly just dialogue based ones\n\n[h1]The Bad Stuff[/h1]\n-Nothing. \n\n[h1]The Truthful Hard Facts[/h1]\n[table]\n[tr][td]Acquirement Method[/td][th]Steam store[/th][/tr]\n[tr][td]Price Paid[/td][th]$2.99[/th][/tr]\n[tr][td]Length[/td][th]2-4 hours[/th][/tr]\n[tr][td]Rig Used[/td][th][url=http://steamcommunity.com/groups/thisgrouplinkwasavailable/discussions/0/1473095331487872526/]Laptop #2[/url][/th][/tr]\n[/table]\n\n[h1]Check out my Steam group for more Reviews![/h1]\n[url=http://steamcommunity.com/groups/thisgrouplinkwasavailable]STEAM REVIEWS GROUP![/url]\n\n[h1]My YouTube channel![/h1]\nhttps://www.youtube.com/channel/UC4BQSDGExl23rHcd9ML2mRw?", "timestamp_created": 1453573639, "timestamp_updated": 1516392308, "voted_up": true, "votes_up": 44, "votes_funny": 12, "weighted_vote_score": "0.782684", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20697138": {"recommendationid": "20697138", "author": {"steamid": "76561198053422627", "num_games_owned": 1097, "num_reviews": 318, "playtime_forever": 74, "playtime_last_two_weeks": 0, "last_played": 1453536435}, "language": "english", "review": "*** SPOILER ALERT *** \nThe following video shows all of chapter ONE of this 5 chapter long game...\n\nHere is my Let's Play for Chapter One:\nhttps://www.youtube.com/watch?v=-V7pgx64-x0\n\n--------------------------------------------\nOnly played chapter 1 at this point, and the story certainly starts off with enough creativity to draw your interest and intrigue.  I will update my review once I finish a full play-thtough, but at this point I like the story and the fact that the game gives you lots of choices to make early on.  This helps draw you in and make you feel more a part of the story that the writer is trying to tell.\n\nDefinitely seems worth the price tag of $2.99 USD, especially considering you could replay the game and make different choices to perhaps see different results.\n\nThis game gets my thumbs up recommendation if you enjoy reading and/or virtual novels.", "timestamp_created": 1453543531, "timestamp_updated": 1453547681, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.370141", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20694331": {"recommendationid": "20694331", "author": {"steamid": "76561198065264174", "num_games_owned": 343, "num_reviews": 13, "playtime_forever": 183, "playtime_last_two_weeks": 0, "last_played": 1453530186}, "language": "english", "review": "It is a 2 1/2 long story with horror/sci fi themes. You get very nice pictures of the locations to set the atmosphere and you read along with the text. Often you have to choose between to options, some resulting in a change to the story, though I dont know how drastic it is. The ambient soundtrack and haunting pictures draw the story together in a nice way so I recommend", "timestamp_created": 1453530291, "timestamp_updated": 1453543535, "voted_up": true, "votes_up": 18, "votes_funny": 3, "weighted_vote_score": "0.527333", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 100, "total_negative": 4, "total_reviews": 104}}
