{"reviews": {"39451590": {"recommendationid": "39451590", "author": {"steamid": "76561198023119235", "num_games_owned": 419, "num_reviews": 5, "playtime_forever": 132, "playtime_last_two_weeks": 51, "last_played": 1516337442}, "language": "english", "review": "One of the more fun interactive fiction games I've ever had the pleasure of playing!  The choices are simple but profound and the story is well written with no chaff.\n\nIt takes a couple of hours to make it all the way through but by the end I find myself wanting to try again.", "timestamp_created": 1516337545, "timestamp_updated": 1516337545, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37449994": {"recommendationid": "37449994", "author": {"steamid": "76561198262660025", "num_games_owned": 43, "num_reviews": 3, "playtime_forever": 255, "playtime_last_two_weeks": 0, "last_played": 1509979197}, "language": "schinese", "review": "在这个游戏里，你甚至可以造古典时代的蒸汽机。\n感受一下熊孩子是多么难带吧！帝王师也不是那么好做的。自由度在玩过的几个文字冒险里不算高，事件线是固定的，不过脑洞特别大。", "timestamp_created": 1511576775, "timestamp_updated": 1511576775, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36231469": {"recommendationid": "36231469", "author": {"steamid": "76561198082874363", "num_games_owned": 65, "num_reviews": 8, "playtime_forever": 44, "playtime_last_two_weeks": 0, "last_played": 1509674388}, "language": "english", "review": "I have always been a sucker for history, a story so full of weird characters, odd occurrences and unlikely coincidences that any fiction writer would be laughed at if he made it into a script. I admit to being unfamiliar with the history of Ptolemy III and Ptolemy IV before playing Choice of Alexandria. But playing through the game like I did had the feeling of history in the making, complete with all the qualities I noted. I particularly appreciate that the game is perfunctory in its descriptions of places and people. There is just enough detail to set the scene and you go from there. Only truly professional writers know how to perform the trick of sketching enough of the story to let the mind fill in the rest.\n\nThe best Choice of Games adventures put you in situations with equally rewarding choices where the outcomes are anything but clear. I had a definite goal in mind to change history to the point where our universe's version of Alexandra never came to pass. As it happened, I failed in achieving that goal through a series of unwise choices...and yet I succeeded in changing history in a very unexpected way. I might add that the goal I did achieve came completely by accident, focusing on the individual lives I was affecting rather than the big picture. It all comes to a head in the epilogue, where certain events enshrined by one William Shakespeare can be completely rewritten due to a final set of choices made.\n\nWhile I can acknowledge that such CYOA games are not for everyone, anyone who enjoys such entertainment should definitely check this one out.", "timestamp_created": 1509675109, "timestamp_updated": 1509675109, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35736980": {"recommendationid": "35736980", "author": {"steamid": "76561198069159152", "num_games_owned": 720, "num_reviews": 460, "playtime_forever": 184, "playtime_last_two_weeks": 0, "last_played": 1508042192}, "language": "english", "review": "This is an amusing, if sometimes tricky, little choose-your-own-adventure novel. I bought it to try out the idea of it... considering they seem to have a habit of showing up in my discovery queue. Anyway, this being the cheapest, it felt like a good first choice...\n\nAnd boy does it work out. While it plays a little fast and loose with some of the facts (I mean how else can you change history?), it is a fun little read. That said, some of the achievement paths are tricky to get to. Still, it provides hours of fun, if this is your thing.", "timestamp_created": 1508042662, "timestamp_updated": 1508042662, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503035", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34353437": {"recommendationid": "34353437", "author": {"steamid": "76561198032397651", "num_games_owned": 1475, "num_reviews": 11, "playtime_forever": 344, "playtime_last_two_weeks": 0, "last_played": 1503156977}, "language": "english", "review": "A very good interactive novella. It's pretty short, but there is a fair amount of decisions that may lead the story in many directions (and there are no manual saves, so if you made a bad choice, you will have to face consequences). You will probably need to replay the game for at least half a dozen times to see most of its content.\n\nDefinitely recommended.", "timestamp_created": 1503158607, "timestamp_updated": 1503158607, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32530002": {"recommendationid": "32530002", "author": {"steamid": "76561198055041495", "num_games_owned": 112, "num_reviews": 19, "playtime_forever": 229, "playtime_last_two_weeks": 0, "last_played": 1479063383}, "language": "english", "review": "Short but one of the better CYOA text games on Steam.", "timestamp_created": 1497773586, "timestamp_updated": 1497773586, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31085591": {"recommendationid": "31085591", "author": {"steamid": "76561198087921963", "num_games_owned": 97, "num_reviews": 5, "playtime_forever": 162, "playtime_last_two_weeks": 0, "last_played": 1491946857}, "language": "english", "review": "if you like reading, this is one of the best multi choice games i played besides chice of robots wich is also from the same publisher.\n", "timestamp_created": 1491943313, "timestamp_updated": 1491943313, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30845448": {"recommendationid": "30845448", "author": {"steamid": "76561198262696870", "num_games_owned": 12, "num_reviews": 2, "playtime_forever": 308, "playtime_last_two_weeks": 0, "last_played": 1497226253}, "language": "english", "review": "Great game for a great price!\n\nIn one of my playthroughs I decided that I was to become the ruler of Alexandria. So over the course of many years, I managed to poison King and have the Queen hanged. After doing this I basically caused a riot to break out, during this I killed the Prince(New King)'s corrupt advisor and saved the Prince(New King) from being killed. After this has happened I manipulated the New King for awhile, then I decided to poision him too and become the new \"Ruler\" (I was basically a dictator) and went crazy and started talking to the mummified corpse of Alexander. \n\n10/10 would poison the entire royal family again.\n\nAlso in this playthrough I decided that my name would be Dolus in the game. (Google it and you'll find out why it fits)", "timestamp_created": 1490929386, "timestamp_updated": 1490984644, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30523395": {"recommendationid": "30523395", "author": {"steamid": "76561198075673573", "num_games_owned": 327, "num_reviews": 160, "playtime_forever": 201, "playtime_last_two_weeks": 0, "last_played": 1489565078}, "language": "english", "review": "I rate the game, Choice of Alexandria 4/5. Good.\n\nThis is one of the absolute best, most thought-provoking choose-your-own adventure style text-based games I have ever read/played. Its emphasis on philosophy and the potential long-term consequences of your choices (and the potential endings which result) are extremely interesting and fairly well written. The characters are more complex and the various messages and themes are far deeper than much of the intellectual content found in most graphically intense games which have yet been created. The ethical dilemmas this game presents can be extremely difficult and the results of your actions, while not always easy to predict, make perfect sense in hindsight. \n\nUnlike Champion of the Gods, the genre of this story is not fantasy but alternate history (a somewhat unusual form of sci-fi). This story/game attempts to answer questions of what might have been had people made different decisions to bring about alternate events. What if the great library of Alexandria had not burnt down or fallen into disrepair? What if wisdom from the ancient world had not been largely lost? What if the Alexandrian Empire had been successful in competing against Rome and had lasted for much, much longer? The choices you make in this game will help setup (or destroy) these potential alternate histories. This game explains how the petty or selfless actions of someone in a position of authority can, in a tenuous situation, help cause the vast potential of the future to be destroyed or created. \n\nThis game will also more obviously delve into how your decisions as a tutor to a royal heir may cause him to either become a great ruler or a vain despot or perhaps, something in between. Moreover, this game also attempts to answer the question as to exactly why providing people with a good education and access to knowledge is important to the longevity and survival of a civilization combined with the vital role that certain, sometimes seemingly minor technological inventions and scientific discoveries can play in the shaping of the unknown future. Seamlessly integrated into all this are important messages about the absolute necessity of maintaining balance and fairness among the people, even the very poor and those of another race, (messages which some of us, in our modern civilization seem to actively refuse to comprehend) if a civilization is to have a chance of thriving. \n\nUnfortunately, Choice of Alexandria suffers from the same basic failings as most other games of this type. Unlike in a real book, there is no Back button to go back to a previous page or to undue a previous decision so you can easily see an alternate plot. This is extremely frustrating if you want to easily or quickly see the full potential which this game has to offer and track multiple potential timelines simultaneously. In essence, the interface lacks flexibility. While the descriptions and writing is at least adequate for the most part it does tend to be a bit dry and tends to be lacking the visceral detail which many actual novels would possess. You get to read very little of your character's personal life nor do you get a clear idea of what it was like to actually live in the distant past. You almost never get to read about what your character's living arrangements are like for example. You don't get to hear how he/she bathes, how he/she eats how he/she sleeps etc. There's so little written on your character's quality of life that your character seems like a lifeless, 2-dimensional, cardboard mask for you to wear while you make occasional menu choices. He/She doesn't hardly seem to live, or breathe or sweat or ache.\n\nSo, In short:\n\n+Great choices, meaningful endings, philosophically deep, interesting alternate histories, good character motivations, reasonably logical results due to your choices. Important messages and themes. Socially and intellectual important content throughout. Thought provoking. Deals with issues relevant to the real world. Far more intellectually involved and deep than most high-graphics games which have ever existed.\n\n-Inflexible interface doesn't let you go back to a previous page or to a previous decision to easily see what else might have happened if you chose differently causing you to have to play the whole game over again if you want to see the differences caused by choosing any other choice. Somewhat dry writing style featuring little visceral or sensory detail and next to no information about what it might be like to live, from day to day as an Alexandrian royal tutor. Sometimes, seems like less of a true novel and more like pages and pages of interlocking introductions to various menu choices which makes main character seem like a mere interface through which you can make decisions rather than a living, breathing person. The first play through provides the most emotional involvement if you decide to try to seriously make the choices you think you would make in the same situation. Emotional involvement with the story tends to decrease during subsequent play throughs.", "timestamp_created": 1489577795, "timestamp_updated": 1489577828, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.515895", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30018670": {"recommendationid": "30018670", "author": {"steamid": "76561198221731848", "num_games_owned": 145, "num_reviews": 8, "playtime_forever": 172, "playtime_last_two_weeks": 0, "last_played": 1487451759}, "language": "english", "review": "First text-based game I've played in a long time, enjoyed it very much because of the slow pace and long-term consequences of the decisions made in the game. Also liked the historical setting in ancient Alexandria, and the choices offered, they were more interesting than in other games I've played: In other games such as those from Bioware there's usually only one good option for me but here there were several and I needed to think things through before making a choice", "timestamp_created": 1487452113, "timestamp_updated": 1487452113, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29431065": {"recommendationid": "29431065", "author": {"steamid": "76561198080856314", "num_games_owned": 95, "num_reviews": 12, "playtime_forever": 414, "playtime_last_two_weeks": 0, "last_played": 1492294012}, "language": "english", "review": "Really good game with great price/value ratio.\nAbout 3 times shorter than the ''Choice of robots'' (and I find it positive :)).\nIt keeps you interested while giving enough possibilities to end in 7 different ways.\n\nSolid. :)", "timestamp_created": 1485119008, "timestamp_updated": 1485119008, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29211704": {"recommendationid": "29211704", "author": {"steamid": "76561198055740888", "num_games_owned": 69, "num_reviews": 25, "playtime_forever": 187, "playtime_last_two_weeks": 0, "last_played": 1483765302}, "language": "english", "review": "One of the \"Choice of\" games that made me feel like choices really matter here. You're constantly being pulled between being a good tutor, a good friend, a good scientist or even a good power monger. Are you going to be loyal or evil? Dedicate your time to making new discoveries or baby-ing the prince? Are you going to step on or even kill those who are in your way?\n\nIt's a good read and worth picking up for sure.", "timestamp_created": 1484256325, "timestamp_updated": 1484256325, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28989186": {"recommendationid": "28989186", "author": {"steamid": "76561198040785098", "num_games_owned": 378, "num_reviews": 4, "playtime_forever": 222, "playtime_last_two_weeks": 0, "last_played": 1483482498}, "language": "english", "review": "This game is for everyone who likes reading.", "timestamp_created": 1483481218, "timestamp_updated": 1483481218, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28223090": {"recommendationid": "28223090", "author": {"steamid": "76561198091030601", "num_games_owned": 651, "num_reviews": 15, "playtime_forever": 130, "playtime_last_two_weeks": 0, "last_played": 1481427137}, "language": "english", "review": "Shorter than other Choice of Robots, this game is well-written with just the right amount of both humor and historical detail.   I've played it through twice, making about half of the same choices as the first time and felt invested in having a positive outcome for both my character and Ptolemy IV.  It was worth the $3 that I'd paid for it, but I would have preferred more content, especially with more opportunities to build rapport and/or emnity with the NPCs.", "timestamp_created": 1481047289, "timestamp_updated": 1481047289, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.548542", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27994663": {"recommendationid": "27994663", "author": {"steamid": "76561198064041821", "num_games_owned": 18, "num_reviews": 6, "playtime_forever": 178, "playtime_last_two_weeks": 0, "last_played": 1480439152}, "language": "english", "review": "First \"choose your own adventure book\" I've ever read/played on steam. And it was really fun. Gotta say: I fell in love with these type of games.", "timestamp_created": 1480367931, "timestamp_updated": 1480367931, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26719523": {"recommendationid": "26719523", "author": {"steamid": "76561198035593334", "num_games_owned": 146, "num_reviews": 8, "playtime_forever": 179, "playtime_last_two_weeks": 0, "last_played": 1467135774}, "language": "english", "review": "this is one of the weaker of these games on steam, though i havent played all of them. not bad though, for the price.", "timestamp_created": 1479669849, "timestamp_updated": 1479669849, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.458716", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26611030": {"recommendationid": "26611030", "author": {"steamid": "76561198141932857", "num_games_owned": 21, "num_reviews": 6, "playtime_forever": 218, "playtime_last_two_weeks": 0, "last_played": 1479189428}, "language": "english", "review": "A thought-provoking variation on the usual game.  Normally you're a decisionmaker (starship captain, US Marshal, or at least a loner), managing various relationships but bound by none.  In this game most of your ultimate goals can be achieved only by influencing young prince Ptolemy IV, or sometimes king Ptolemy III.  Rupture that relationship, and much of the game falls out of reach.  But, of course, protecting the relationship has a price - including the fact that keeping your young charge happy is not always the best teaching strategy, and failing as a teacher has its own consequences.  \n\nSo this is basically a game about teaching and child-rearing.  As a parent, I enjoyed that novelty.  And the various choices lead to alternate histories that are amusing, even intriguing (despite one terrible Fight Club joke).", "timestamp_created": 1479189839, "timestamp_updated": 1479189839, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.498546", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25892541": {"recommendationid": "25892541", "author": {"steamid": "76561197999167092", "num_games_owned": 194, "num_reviews": 23, "playtime_forever": 250, "playtime_last_two_weeks": 0, "last_played": 1475946425}, "language": "english", "review": "Very interesting story. A bit short but enjoyable.", "timestamp_created": 1475791856, "timestamp_updated": 1475791856, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25409335": {"recommendationid": "25409335", "author": {"steamid": "76561198283149955", "num_games_owned": 44, "num_reviews": 8, "playtime_forever": 117, "playtime_last_two_weeks": 0, "last_played": 1482636563}, "language": "schinese", "review": "故事中的主要人物都是历史上真实存在的人。而不同的选择最后能导致和真实历史完全不同的结局。", "timestamp_created": 1473334723, "timestamp_updated": 1473334723, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.556509", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25384997": {"recommendationid": "25384997", "author": {"steamid": "76561198043872712", "num_games_owned": 188, "num_reviews": 2, "playtime_forever": 380, "playtime_last_two_weeks": 0, "last_played": 1473523717}, "language": "english", "review": "I've played most of these \"choice of\" games, the first I played, Choice of Robots was the best, this the second. Done one playthrough but i know there will be more.\n\nThe game doesn't last too long, but its replayability makes up for that, with different endings set in the future, the one I got was set hundresds of years later.", "timestamp_created": 1473188222, "timestamp_updated": 1473188222, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 7, "review_score_desc": "Positive", "total_positive": 42, "total_negative": 1, "total_reviews": 43}}
