{"reviews": {"39088134": {"recommendationid": "39088134", "author": {"steamid": "76561197960498075", "num_games_owned": 52, "num_reviews": 28, "playtime_forever": 99, "playtime_last_two_weeks": 0, "last_played": 1515167890}, "language": "english", "review": "I finished all 32 levels on regular in 99 minutes and didn't feel like playing the alternate modes (which are stupid). You get a great variety of enemies but pay heavily for it, if you compare the price of Spartaga vs Spacecats with Lasers.\n\nI recommend you buy Spartaga if you like the genre and aren't too cheap to pay for variety.", "timestamp_created": 1515168374, "timestamp_updated": 1515168374, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501661", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38802941": {"recommendationid": "38802941", "author": {"steamid": "76561198121384416", "num_games_owned": 119, "num_reviews": 9, "playtime_forever": 206, "playtime_last_two_weeks": 0, "last_played": 1510182745}, "language": "english", "review": "If you enjoyed Xortex in The Lab, then you'll love this.", "timestamp_created": 1514513897, "timestamp_updated": 1514513897, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501661", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38549840": {"recommendationid": "38549840", "author": {"steamid": "76561198006690931", "num_games_owned": 89, "num_reviews": 40, "playtime_forever": 51, "playtime_last_two_weeks": 5, "last_played": 1516500096}, "language": "english", "review": "I really loved Xortex in The Lab. The only game that seemed similar to it was Xion, which was also awesome. It reminded me of VR Gradius Galaxies.\n\nThis game is very very similar to Xortex, with extra customization, new enemies, some bosses, and honestly... I'm excited. It's exactly what I wanted to play. Glad I was able to find this gem!!!\n\nIf you liked Xortex in The Lab. You will love this game!!!!!", "timestamp_created": 1513976656, "timestamp_updated": 1513976656, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.525316", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36548912": {"recommendationid": "36548912", "author": {"steamid": "76561198144941615", "num_games_owned": 60, "num_reviews": 12, "playtime_forever": 96, "playtime_last_two_weeks": 0, "last_played": 1514243674}, "language": "english", "review": "A long time ago I was a little boy who had no digital toys. I remember using my imagination with a little plastic airplane in my hands \"flying\" around the house shooting down bad guys out of the air. Well now I can do that in Virtual Reality, flying around my little play space pew pew pewing at the baddies and doing crazy acrobatics in the air. Spaceman Spiff, reporting for duty! XD\n\nIt's awesome. I love the VR spin on the traditional old school bullet hell shooters. Defintely a thumbs up from me.", "timestamp_created": 1510830906, "timestamp_updated": 1510830906, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523577", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36157410": {"recommendationid": "36157410", "author": {"steamid": "76561197966649882", "num_games_owned": 1250, "num_reviews": 80, "playtime_forever": 68, "playtime_last_two_weeks": 0, "last_played": 1509330762}, "language": "english", "review": "[h1]Spartaga - [i]Retro VR has never been so new and fun![/i][/h1]\nWhen I was a kid, many many moons ago, I used to play with toy spaceships and planes holding them in my hand and flying them. Come on, admit it, you did the same. So imagine how cool it would be if you could have one that fired for real, have real enemies to shoot at and most importantly you could get away with playing with it age 38 lol. Well, Spartaga is damn close to that, you have the shooting and the flying but you also have an almost puzzle element to the game due to the way the laser works (shoot 4 of the same type of enemy) and the scoring system which rewards combos.  \nOne of the cool things about the game is the different modes, each level can be played normally or one of a multiple of other modes. Including a peaceful mode where you can not shoot but, the enemies spawn with a lifespan that even mayflies would say “Damn that's a short life”, just dodge them as the frantically try to kill you before their number is up. \nOnce you reach Level 8 and face your first boss you unlock a marathon mode (think survival, one life last as long as you can!).\nIf that is not enough variety for you, there is also the ability to level up your special weapons (of which there is a fair few to choose from) and change your skins with a complete experience and level system. \n\n[b]ROOMSCALE / ENVIRONMENT / GRAPHICS[/b]\nThe main area of the game is a large water plane with particle effects in the distant, planets and stars. It is simplistic and yet beautiful, I love it. But most of the time your attention will be focused on the large array of enemies (that get added to with each level) that are trying to shoot or ram into you.  \nThe enemies have a decidedly retro look and feel which goes well with the game’s sound effects and soundtrack. The soundtracks can be switched between fast beated arcade-style music or some rather relaxing tunes by a band I had never heard of called Carbon Based Lifeforms, the latter is what I mostly opted for, again it works well with the game. \n\n[b]PERFORMANCE[/b] \nThe whole area can be filled with balls of purple energy, white tracer fire of shots, red scatter particles, purple chaser ships and large yellow lasers, and yet it runs smooth as pie. This is a very smooth and well-optimized game.\n\n[b]INTUITIVENESS[/b] \nThe first level serves as a tutorial and will quickly teach you the basics of the game, and you soon learn the power of the 4. What do I mean by the power of the 4? Well when you hit 4 of the same enemy without killing another type you get a laser, 4 more keeps it going and this is where the power of the 4 and the almost puzzle-like part of the game comes in. \n\n[b]MULTIPLAYER:[/b] \nNot multiplayer per say but it does have leaderboards, those little lists that encourage the one more try. \n\n[b]PROS:[/b] \n[list]\n[*] Well designed atmosphere, from the game area to the enemy design.\n[*] There is that “one more try” feel.\n[*] The enemies are added at a pace that allows you to learn each one and keeps the levels fresh.\n[*] Fun boss fights (though you will die the first time you try one...guarantee it lol)\n[*] Choice of two soundtracks both pretty cool.\n[*] Great scoring system which makes you actually think how to approach the enemies and encourages you to not just blindly shoot everything.\n[*] multiple game modes to mix it up and add variety.\n[*] Get to play with a spaceship 38 with almost no judgement (making plane noises and going pew pew can cause mild judgement from your cat...may be just my cat though)\n[*] Can be played with one pad (great if you need to charge one or if you only have one)\n[*] A developer that cares about their game (After my first try video I had a ton of feedback about the tutorial and some other bits and pieces, the developer heard this keenly and pretty soon the game was patched. This is a developer that listens to his users and cares about his game)\n[/list]\n\n[b]CONS:[/b] \n[list]\n[*] At times it can be a little too hard. (to some that may not even be a con and tbh I deleted this line and re-added it twice in the draft of this review)\n[/list]\n\n[b]The [strike]first[/strike][i]Second[/i] try video:[/b]\nhttps://www.youtube.com/watch?v=bKrcqhp6KAA\n\n[b]VERDICT[/b] \nAs you can see from the video I had difficulty putting it down, that really says it all. This is a great game that I have really enjoyed playing even when exhausted from my day job. \nI really recommend the game.", "timestamp_created": 1509424459, "timestamp_updated": 1509424459, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.453052", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "35382253": {"recommendationid": "35382253", "author": {"steamid": "76561198417754543", "num_games_owned": 21, "num_reviews": 1, "playtime_forever": 28, "playtime_last_two_weeks": 0, "last_played": 1506866656}, "language": "english", "review": "can not get it to start says center ship the grab ship but can not ?", "timestamp_created": 1506865619, "timestamp_updated": 1506865619, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.470958", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35173341": {"recommendationid": "35173341", "author": {"steamid": "76561198082725740", "num_games_owned": 28, "num_reviews": 1, "playtime_forever": 2366, "playtime_last_two_weeks": 0, "last_played": 1514723286}, "language": "english", "review": "Polished, challenging, and cool. Spartaga is a neat arcade game of the bullet hell genre, a nice change from first person shooters. The combo system adds another layer of gameplay that really makes it interesting and engaging, especially when you're trying to shoot a specific enemy while dodging the lasers, bullets, and chasers. It definitely keeps you moving around and reacting to enemies.\nThe enemies are easily recognizable by their colors and shapes, and so are the projectiles, making it so that you know what went wrong.  What goes on in the background also fills the atmosphere nicely as you're listening to the music. The ability to change how your ship, your shots, and the background looks is also great, but it's lacking variety unlike the enemies. \nThe 27 enemies really do feel like they're all different from each other, unlike some other VR games where enemies are just reskins of each other. Shooters,shotgunners, chasers,bombs(sorta), lasers, turrets, tanks,etc., all make the levels quite a lot more exciting.\nI haven't tried the marathon yet, but I really love the game(heck yeah 20+ hours and counting). Somewhat of a completionist, I try to complete the challenges(speedy,pacifist, and elite) that the game provides, and I don't find it repetitive. The challenges never feel impossible, but they can be quite daunting.\nSpartaga 1.02", "timestamp_created": 1506237821, "timestamp_updated": 1506237821, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501661", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35085900": {"recommendationid": "35085900", "author": {"steamid": "76561197961422532", "num_games_owned": 744, "num_reviews": 9, "playtime_forever": 74, "playtime_last_two_weeks": 1, "last_played": 1516079739}, "language": "english", "review": "Spartaga 1.01: This is a round based roomscale bullethell with auto shooting like Xortex 26XX from the lab. This game is no joke and gets extremely hard really quickly. The levels have the same spawns (time and location) every time so there is a slight element of memorization like an Ikaruga, but mostly this is just a reaction and dodging game. When an enemy gets close there is a very annoying noise. When playing using a Vive, the ship is aimed parallel to the control, meaning you have to aim the controller down like a magic wand. I wish they gave the option to aim the ship more like the angle of the head of Vive controller. To get the best score you need to kill enemies in groups of 4 which is interesting and does create a good meta challenge on top of just completing the levels without dying. The various enemies have made it very challenging and require significant movement just by level 12 of 40.", "timestamp_created": 1505920033, "timestamp_updated": 1515179935, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.501661", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34833999": {"recommendationid": "34833999", "author": {"steamid": "76561198315865889", "num_games_owned": 127, "num_reviews": 14, "playtime_forever": 27, "playtime_last_two_weeks": 0, "last_played": 1504951053}, "language": "english", "review": "If you liked xortex from the lab you'll like this game.", "timestamp_created": 1504952762, "timestamp_updated": 1504952762, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.501661", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34673948": {"recommendationid": "34673948", "author": {"steamid": "76561198055165405", "num_games_owned": 59, "num_reviews": 7, "playtime_forever": 441, "playtime_last_two_weeks": 0, "last_played": 1504300618}, "language": "english", "review": "Flew my virtual spacecraft into my actual lightbulb\nNow there's glass everywhere and it's dark\nGame's got jams though. thumbs up", "timestamp_created": 1504317779, "timestamp_updated": 1504317779, "voted_up": true, "votes_up": 1, "votes_funny": 3, "weighted_vote_score": "0.519055", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34650797": {"recommendationid": "34650797", "author": {"steamid": "76561198306509013", "num_games_owned": 205, "num_reviews": 4, "playtime_forever": 66, "playtime_last_two_weeks": 0, "last_played": 1504234995}, "language": "english", "review": "Great looking, awesome music, tons of levels with lots of power-ups. Nice pick up and play game.", "timestamp_created": 1504238349, "timestamp_updated": 1504238349, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.501661", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34644407": {"recommendationid": "34644407", "author": {"steamid": "76561197966607884", "num_games_owned": 51, "num_reviews": 1, "playtime_forever": 34, "playtime_last_two_weeks": 0, "last_played": 1504063933}, "language": "english", "review": "Addicting game! Spartaga goes a great job of capturing a nostalgic arcade feel through it's bright 1970's vector graphic inspired visuals and satisfying sounds. The difficulty progresses by slowly introducing new types of enemies each round – requiring the player to keep making adjustments to their play style. If you enjoyed the Xortex tech demo from The Lab – but wanted something with a bit more substance – Spartaga is a must buy.", "timestamp_created": 1504214584, "timestamp_updated": 1504214839, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.496898", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34630262": {"recommendationid": "34630262", "author": {"steamid": "76561198297581073", "num_games_owned": 244, "num_reviews": 106, "playtime_forever": 263, "playtime_last_two_weeks": 0, "last_played": 1505072551}, "language": "german", "review": "If you enjoy Xortex from the Lab than this game is made for you. There are lots of similarities but this game is a full game build around it. With lots of different abilities, levels, unlocks and challenges. This game delivers what Chamber 19 wanted to do but failed. Well done Devs! I will update once i played more.", "timestamp_created": 1504172260, "timestamp_updated": 1504172260, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.459903", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34615394": {"recommendationid": "34615394", "author": {"steamid": "76561198005615017", "num_games_owned": 163, "num_reviews": 1, "playtime_forever": 59, "playtime_last_two_weeks": 0, "last_played": 1504124085}, "language": "english", "review": "A fresh, adrenaline-packed and stylish arcade shooter. Love the enemy variety and how it evolves through level progression. It's super rewarding to lean on what you learn through battle, and steadily improve your attack strategy for each enemy formation coming your way! Looking forward to playing more!", "timestamp_created": 1504118687, "timestamp_updated": 1504118687, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.519055", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34600590": {"recommendationid": "34600590", "author": {"steamid": "76561198062907898", "num_games_owned": 127, "num_reviews": 4, "playtime_forever": 944, "playtime_last_two_weeks": 0, "last_played": 1504198067}, "language": "english", "review": "10/10 Getting stuck repeating level 1 because the leader board is mocking you. xO", "timestamp_created": 1504079447, "timestamp_updated": 1504079447, "voted_up": true, "votes_up": 1, "votes_funny": 2, "weighted_vote_score": "0.495237", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34600575": {"recommendationid": "34600575", "author": {"steamid": "76561198080729694", "num_games_owned": 108, "num_reviews": 3, "playtime_forever": 271, "playtime_last_two_weeks": 0, "last_played": 1504075734}, "language": "english", "review": "Action-packed and full of replayability thanks to leaderboards and different modes of play. The combo system adds a level of depth to the gameplay that will keep hardcore gamers busy for hours trying to improve their scores, but the game is super easy to pick up and play for anyone. Would definitely recommend to anyone with a VR headset!", "timestamp_created": 1504079386, "timestamp_updated": 1504079386, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.520563", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34600283": {"recommendationid": "34600283", "author": {"steamid": "76561197972061555", "num_games_owned": 681, "num_reviews": 1, "playtime_forever": 75, "playtime_last_two_weeks": 0, "last_played": 1504077526}, "language": "english", "review": "I heard about this last month at a local indie game meetup & really liked the idea: it's a shmup, but your ship is just your hand, holding a touch controller. Your ship's position and orientation is exactly tied to your hand. It's kind of hard to overstate how novel that was for me -- you can control your ship almost perfectly, so weaving through bullets feels great, not frustrating.  It's also got a neat sorta-rhythmic mechanic where you want to kill enemies in groups of 4 of the same type. I dunno, I enjoy it.", "timestamp_created": 1504078385, "timestamp_updated": 1504078385, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.496898", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34600020": {"recommendationid": "34600020", "author": {"steamid": "76561198062867743", "num_games_owned": 123, "num_reviews": 2, "playtime_forever": 616, "playtime_last_two_weeks": 0, "last_played": 1504111179}, "language": "english", "review": "It's just fun! It's a chaotic space neon battle with bullets flying everywhere and lasers shooting at you, I don't know what else I would want. Haha. \n\nIt's full of moments when I die and say ****! But it's never an unfair death. I always know what I did wrong and what I should do to improve. As a Dark Souls fan, I can really appreciate when a game is challenging. :)\n\nThe game also has really nice visuals and you can tell that each level was not just thrown together. They all seem to challenge you a little differently which I think makes it so much more satisfying to beat them. I've got to the second boss so far, and I'm really excited for the rest. I'll update the review if I'm disappointed with them, but I doubt I will be!\n", "timestamp_created": 1504077515, "timestamp_updated": 1504077515, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.595419", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34598291": {"recommendationid": "34598291", "author": {"steamid": "76561197989426655", "num_games_owned": 135, "num_reviews": 1, "playtime_forever": 31, "playtime_last_two_weeks": 0, "last_played": 1504070620}, "language": "english", "review": "Love the art style and soundtrack! Reminds me a lot of Rez.", "timestamp_created": 1504070923, "timestamp_updated": 1504070923, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.506393", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34598119": {"recommendationid": "34598119", "author": {"steamid": "76561198049488477", "num_games_owned": 153, "num_reviews": 1, "playtime_forever": 60, "playtime_last_two_weeks": 0, "last_played": 1504072615}, "language": "english", "review": "The first thing I noticed about Spartaga was the combo system, which I think added an neat additional layer of strategy that made the game more engaging and interesting to play. The gist of the combo system is to kill 4 enemies of the same type for a weapon boost, which allows a player to kill things quickly and more efficiently... and there’s always the risk of losing the combo and becoming overwhelmed by enemies which keeps the game at a fun level of intensity.\n\nAnother positive note is that the game is simple and easy to pick up, which allows anyone to play and have fun without an intense learning curve. The ship you control will automatically shoot whenever its directional laser comes in contact with an enemy, which allows a player to easily destroy enemies as they dodge, dip, dive, duck and dodge within the play space. \n\nOverall, I think Spartaga adds a neat touch to the Bullet Hell scene and takes full advantage of the play space for a more engaging, compressive experience.", "timestamp_created": 1504070256, "timestamp_updated": 1504070556, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.496898", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34597623": {"recommendationid": "34597623", "author": {"steamid": "76561198077803355", "num_games_owned": 31, "num_reviews": 1, "playtime_forever": 144, "playtime_last_two_weeks": 0, "last_played": 1504142874}, "language": "english", "review": "This reminded me a lot of the old style arcade games but in a new and fun way. The game provides the right amount of challenge that you get the fun feeling of blowing space ships up, but also a nice strategy that keeps you engaged. The game also has leaderboards in case you want to get competitive, overall had a great game and had a lot of fun playing it!", "timestamp_created": 1504068257, "timestamp_updated": 1504068257, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.520563", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34597543": {"recommendationid": "34597543", "author": {"steamid": "76561198156357933", "num_games_owned": 45, "num_reviews": 1, "playtime_forever": 106, "playtime_last_two_weeks": 0, "last_played": 1501379666}, "language": "english", "review": "I had the chance to try out the beta, the game is a blast! Graphics throw me back to how 6-year old me felt playing Galaga on an arcade machine, but now i'm actually immersed in the game.\n\nI only had a chance to make it through about the first 10 levels (out of something like 30ish total levels), and was definitely challenged, partially because I'm terrible at VR games, but it seems like the game has a ton of play time involved. Especially for peeps like me who need to try to get the best score possible on every level.\n\nThe game is departure from most other VR games I've played. The main difference being that most games try to trick you into thinking you're in the world of the game. I didn't get that at all from this game, however, that was by no means a bad thing. It's just a totally different kind of game, where VR is instead utilized to give you a different experience when playing a 3d \"space invaders\"/\"bullet gallery\" type game. Your sense of depth is given from the VR is required to successfully dodge the incoming swarm of bullets,  shoot the right bad guys to keep your combos going, and get the highest score possible", "timestamp_created": 1504067959, "timestamp_updated": 1504067959, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.561789", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34597282": {"recommendationid": "34597282", "author": {"steamid": "76561198272009896", "num_games_owned": 2, "num_reviews": 1, "playtime_forever": 272, "playtime_last_two_weeks": 0, "last_played": 1504071076}, "language": "english", "review": "The graphics remind me of arcade games from the past which I really liked. The game play was fast, challenging, and keeps you in the moment.", "timestamp_created": 1504066953, "timestamp_updated": 1504066953, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.520563", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34595812": {"recommendationid": "34595812", "author": {"steamid": "76561197969452591", "num_games_owned": 229, "num_reviews": 3, "playtime_forever": 42, "playtime_last_two_weeks": 0, "last_played": 1506760302}, "language": "english", "review": "I played this game at a friends house for hours and am now picking it up for myself.  Its like the full game version of the Valve game in the lab but with levels, progression, new mechanics, and weapons.   There are not many full game experiences in VR yet and this one is a whole lot of fun.  The level difficulty scales really well so I always felt challenged.  I also really love the backgrounds the move with the music!   Great experience.  Also while you don't HAVE to work up a sweat to play this is a great work out if you want it to be.  I may replace my cardio with an hour of this....I forget how hard my heart is pumping.  \n\nA deal at the price, pick it up!", "timestamp_created": 1504061434, "timestamp_updated": 1504061434, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.496898", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34591432": {"recommendationid": "34591432", "author": {"steamid": "76561197973315737", "num_games_owned": 249, "num_reviews": 2, "playtime_forever": 74, "playtime_last_two_weeks": 0, "last_played": 1504049514}, "language": "english", "review": "An elegant, super-fun game with simple to pick-up and play mechanics that are difficult to master. Lots of variety in the enemies and bosses; simple mechanics that become complex when combined. It has an upgrade system that spans all modes of the game and rewards you for playing. Marathon mode is a nice feature. Certainly haven't tried all of the upgrades yet but the first couple weapons and special weapon upgrades have all be different and fun. This reminds me of Xortex from The Lab but with tons more content and variety.  While certainly not cheap, Spartaga does offer way more than 5 hours of good gameplay with fun bosses and upgrades. Nicely done!", "timestamp_created": 1504047753, "timestamp_updated": 1504047753, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.520563", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34590818": {"recommendationid": "34590818", "author": {"steamid": "76561198098000706", "num_games_owned": 80, "num_reviews": 1, "playtime_forever": 81, "playtime_last_two_weeks": 0, "last_played": 1506753784}, "language": "english", "review": "Spartaga is a great Vr title and well worth the 20$. A good amount of replayability and the game play definitely draws you in. The art and music are Great! Really fun!", "timestamp_created": 1504046008, "timestamp_updated": 1504046008, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.496898", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34581935": {"recommendationid": "34581935", "author": {"steamid": "76561198165603610", "num_games_owned": 27, "num_reviews": 5, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1511226744}, "language": "english", "review": "Spartaga is a great, fast paced techno-themed bullet hell like game, which keeps you interested and anticipating the next level throughout the game. With each level, Spartaga introduces another challenge, which keeps the game fresh. With the addition of upgrades, special moves, and level difficulties, there is enough content to keep you busy for a long time.", "timestamp_created": 1504025765, "timestamp_updated": 1504025765, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.496898", "comment_count": 0, "steam_purchase": true, "received_for_free": true, "written_during_early_access": false}, "34581357": {"recommendationid": "34581357", "author": {"steamid": "76561198057161102", "num_games_owned": 39, "num_reviews": 2, "playtime_forever": 241, "playtime_last_two_weeks": 0, "last_played": 1503991567}, "language": "english", "review": "Spartaga is a brilliantly crafted game that manages to evoke a feeling of nostalgia inside of its contemporary environment. The game mechanics are very easy to learn, yet the gameplay never feels dull given the large variety of enemies and upgrades which forces the player to adopt new strategies to surmount difficult levels. The variety of game modes, although I have mostly played in the standard mode, offers the player a chance to adopt even more strategies, potentially giving the player many more hours of gameplay. If there was one suggestion that I were to make, it would be to smooth out the movement of the player's ship... although I do not know how viable that would be in practice due to the nature of the way the ship is controlled. Overall, I am very happy with this game.", "timestamp_created": 1504024532, "timestamp_updated": 1504025263, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.496898", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34572015": {"recommendationid": "34572015", "author": {"steamid": "76561198032320339", "num_games_owned": 214, "num_reviews": 1, "playtime_forever": 8631, "playtime_last_two_weeks": 0, "last_played": 1503894431}, "language": "english", "review": "Spartaga may be the most beautiful VR game I’ve played and feels amazing! Having never been very good at bullet dodging games, I was unsure if I would enjoy Spartaga, however the VR experience opens up the gameplay for a surprisingly relaxing experience. When paired with Carbon Mode, the game just gets better and quite relaxing. The game feels like I wanted shooters in VR to feel. I’m glad that something this good has finally come out.", "timestamp_created": 1503996314, "timestamp_updated": 1503996314, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.496898", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34562901": {"recommendationid": "34562901", "author": {"steamid": "76561198125164751", "num_games_owned": 48, "num_reviews": 1, "playtime_forever": 198, "playtime_last_two_weeks": 0, "last_played": 1503960162}, "language": "english", "review": "I've found this game to be a lot of fun. The different upgrades available to your ship as you progress through the game can change how the game feels, and gives you more options on killing the bosses. Great game!", "timestamp_created": 1503956316, "timestamp_updated": 1503956316, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.496898", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34557628": {"recommendationid": "34557628", "author": {"steamid": "76561198041265016", "num_games_owned": 187, "num_reviews": 1, "playtime_forever": 307, "playtime_last_two_weeks": 0, "last_played": 1503939541}, "language": "english", "review": "This game has convinced me to get a headset of my own. It's basically a bullet hell/combo breaker style game that forces you to think fast on your feat and doge around incoming projectiles. Although the core mechanics are familiar, experiencing them in VR is a whole other thing - having to aim by hand while dodging and maintaining a sense of the enemies in the play space creates a lot of fun challenge that feel totally unique when experiencing them in VR. Their a lot of different modes to the game, too... although some of the higher ones might be too difficult for me, I can see it giving more advanced players something to aspire to.", "timestamp_created": 1503939978, "timestamp_updated": 1503939978, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.525316", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34556024": {"recommendationid": "34556024", "author": {"steamid": "76561197962996762", "num_games_owned": 900, "num_reviews": 3, "playtime_forever": 586, "playtime_last_two_weeks": 0, "last_played": 1504058597}, "language": "english", "review": "Gameplay:\nIt is worth noting that I am not the biggest fan of the Shmup / Bullet Hell genre. That being said, the leaderboards and scoring and combo powerup system compliment this style of gameplay wonderfully. You'll soon realize there's far more than simply dodging the incoming shower of lasers looking for an opportunity to shoot back. As you plan an attack strategy you need to take into account how many shots on which target will build up your combo meter fastest to upgrade your weapons giving you the best chance of defending yourself.\n\nVisuals:\nThe graphics aesthetic speaks to a retro futurism pastiche of Tron meets Battlezone in Space. Combat can get pretty massive and evokes the epic feeling of Gundam space battles with a Geometry Wars focal point. Most of the backgrounds, while immersive enough will be just that, as attention will definitely be the battle action happening front and center. These graphics aren't going to blow anyone away but they work well with the style of game.\n\nSound Design:\nAt times it felt like conducting as you weave between the enemies and execute your symphony of destruction... a few quick shots here, a long beam fired there, try not to rush through the red alert of incoming seeker ships. This game goes far beyond classic Shoot'em Ups with an abstraction of elements that would feel at place in a rhythm game. And this is aided by an excellent combination of spacey ambient tunes that really fit the flow of gameplay with its varied SFX of enemies encroaching, lasers firing and explosions all around you. It might be relaxing once you get past the chaos and threat of imminent death.\n\nOne criticism:\nThe ship you control doesn't move necessarily in smooth and sweeping motions like all the enemy ships around it. This is obviously connected to input from the controller eg your hand motion. And I get the need to be able to move quickly to dodge incoming shots, but the immersion is reduced when your avatar acts less like a space ship and more like a gnat buzzing about.\n\nFinal thoughts: \nWhile there are some improvements that can still be made and the game style will not appeal to everyone; this is an exhilarating VR experience that will keep you coming back to enjoy the variety this game has to offer.", "timestamp_created": 1503935709, "timestamp_updated": 1503935709, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.525316", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}}, "query_summary": {"num_reviews": 20, "review_score": 7, "review_score_desc": "Positive", "total_positive": 32, "total_negative": 0, "total_reviews": 32}}
